[
  {
    "title": "Zuckerberg's Courthouse Entourage Showed up in Meta Ray-Bans - Business Insider",
    "description": "Zuckerberg's Courthouse Entourage Showed up in Meta Ray-Bans  Business InsiderMeta’s Zuckerberg testifies about social media’s effects on children in landmark trial  CNNZuckerberg Defiant In Social Media Trial Testimony: “I’m Focused On Building A Community That Is Sustainable”  DeadlineMark Zuckerberg said he reached out to Apple CEO Tim Cook to discuss 'wellbeing of teens and kids'  CNBCMark Zuckerberg grilled about underage Instagram users, social media addiction during landmark trial  NBC News",
    "published date": "Wed, 18 Feb 2026 22:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPUHJUb1N3dmlBS0kxMGtpR1RxZXVLRUlEVzRhQnBXeVpTZWVYRUxVaFo2RFN2WnVCUnR4ZVdsSmtXM2VSSE43Nkp5YlZ4YTZjdnZuOGlwWXlJR2dDMjhISkN6R0tVYzcyWTE4VEkzejRwT3BuMW00alZibmhiTEVzcXFQVGxyc09pTDc1NTEzN3NHYXZhZkIyOUZjYTlQUEt6dDR0UkF6dm8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "\"Denied everything\": Dems blast Wexner for downplaying Epstein ties - Axios",
    "description": "\"Denied everything\": Dems blast Wexner for downplaying Epstein ties  AxiosBillionaire Les Wexner tells US lawmakers he was 'naive' and 'conned' by Epstein  BBCOversight Democrats: ‘Ohio State should have questions’ about Les Wexner ties to Jeffrey Epstein  NBC4 WCMH-TVFormer Victoria's Secret CEO testifies in House panel's Epstein probe  NBC NewsCongressional Democrats respond to Wexner's Epstein deposition  The Columbus Dispatch",
    "published date": "Thu, 19 Feb 2026 00:00:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ET3hqby1yVzNQLXRVcEMzUERDbUt1UzhSblNUM0NKWW9LNkJ1dzJHZ09peTFDQUp2SnpkVU90UTFPM1lPLUlCUHRuNm9hOTZDc1U0d2ZNalEyR2hzRjRYMjVpUGlvaDhkWXVXanJ1MzE5NTZSbEZFVHcwNFg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "FDA reverses course on Moderna flu shot - NPR",
    "description": "FDA reverses course on Moderna flu shot  NPROpinion | Kennedy’s MAHA Coalition Is a Mess  The New York TimesFDA's reversal on Moderna flu shot bid followed White House pressure  PoliticoOpinion | The FDA’s damage to medical innovation will be hard to repair  The Washington PostModerna stock surges as FDA reverses course, agrees to review new flu shot  Yahoo Finance",
    "published date": "Wed, 18 Feb 2026 21:39:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1NWFBiQmZDcTUwZmdwQmdwMm5KNmdkN2tKY3lnZEJEMGJwVWNnak94STg0V3kwMmR4RFhKZXlEcVhvb2YzR0VsYnM1VHVkRHNiVktMWnpmR0FJY2hkMTBWTnBQY2o1aU5XTTZVOTJVaUduOTh5MUhGR1Vn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "White House economic adviser says Fed researchers should be punished - The Washington Post",
    "description": "White House economic adviser says Fed researchers should be punished  The Washington PostHassett says authors of New York Fed tariff study should be disciplined: 'Worst paper I've ever seen'  CNBCTrump administration slams New York Fed study that says US consumers bear the cost of tariffs  Yahoo FinanceKevin Hassett says Fed researchers should be ‘disciplined’ over report that Americans are paying tariffs  CNNTrump's economic adviser says authors of tariff study should be \"disciplined\"  Axios",
    "published date": "Thu, 19 Feb 2026 00:35:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQYTEzNS12WFRncEtIWWZULTl1VGhNZzNTWXVYYjczOHVzWHVwM1YydHBSREJhaGRFaHJ5RkV0MFdIZUt3akQyUEhpUkJIVjFmeDlNMTUtSm95c1JMTk1DamRHNV9xeWI0RWhvc1dQWlV0bHEwUWw5Zl9vZmdQZm1qUlFKYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Etsy Sells Depop, a Secondhand Clothing App Popular With Gen Z, to eBay - The New York Times",
    "description": "Etsy Sells Depop, a Secondhand Clothing App Popular With Gen Z, to eBay  The New York TimesEtsy sells second-hand fashion app Depop to eBay for $1.2bn  BBCEBay forecasts upbeat revenue, buys Depop to boost fashion presence  Yahoo FinanceEBay Buys Fashion Marketplace Depop, Reports Robust Results  Bloomberg.comEtsy stock pops 14% on sale of Depop to eBay for $1.2 billion  CNBC",
    "published date": "Wed, 18 Feb 2026 21:05:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9CTTZoVVNoWEwtVkdGU29xQWxwOGJZeXNSTzI4eGZXM3FUcmRLMTkyMU5HbkxkVnJYV0NwNWxmcE5GODlyN0lHSERJbjRLU3I4Vk9LdnNnV3Z2eGo0STZwa3FXaHEyazhmUldZNU9iVEZiQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "U.S. stocks are falling behind. It could be the beginning of an epic shift toward global markets. - MarketWatch",
    "description": "U.S. stocks are falling behind. It could be the beginning of an epic shift toward global markets.  MarketWatchUS stocks are off to their worst start versus the global market since 1995  Yahoo FinanceThe Ex-U.S. Trade is Working  A Wealth of Common SenseInternational ETFs Have Outperformed U.S. Stocks -- but Is There More Upside Left?  The Motley FoolForeign Equities Beat U.S. Stocks. Should You Invest More Abroad?  Barron's",
    "published date": "Wed, 18 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOZ2tKUl9ISVI0VjlVblJCQTM5U01FbTFFTHVHSXZWc1oyRWFuOUhxNXdYS2NBMjdwcjZnQjEyMkZPV1B6RTVlYWQxS2M3OENnOHQ1aDN6SHBicVUxamdtMkxuTVhvTU1DZXlvTUM4UmZCY3JHdkUtRVFpYXB6dEVLMDRaOEsxRl9VYmRUX3B2NkpSc1B4NUxPRERzMWZmbzFlSDY3YXVQaXU0QWxSamRFWnlpSVhKUWhwQkJnN2dURWd1Xzl4NXlJNkQ0c0lpUjFoTVpz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "JetBlue flight returns to Newark Airport due to engine failure; full ground stop issued - ABC7 New York",
    "description": "JetBlue flight returns to Newark Airport due to engine failure; full ground stop issued  ABC7 New YorkNewark Airport reopens after aircraft emergency caused ground stop, FAA says - CBS New York  CBS NewsPassengers evacuated from Newark flight as smoke reported in cockpit following engine failure  NBC New YorkAircraft emergency forces closure of Newark Airport: FAA  PIX11Smoke in the cabin forces JetBlue passengers to evacuate on taxiway, temporarily shutting down Newark Airport  CNN",
    "published date": "Thu, 19 Feb 2026 00:32:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQY3J6dDFNUmxVWVdITHNhUTk0WVR5V2l6MlRweklLbjJOWnlyMGxWWEdNTGtBTDdzcnJZZURjcXNDV0lRWTFrRHA3Tkx4X1VSMmstR0ZrSlpmNlVZbk0xTWx0UTFJTXdqc2djX2VpV0RqNUgwSEJIZWd5emg5cXpzQl9rQjRsODFLWm1nY3JYNWdoQTJzMnFOcGNhOWhGcTE2WjN2OWxnWlZRV0EycW1Ka3o0dWXSAboBQVVfeXFMTzNOcTFtVVpMM3pwcmFnLUktZnpZREhwU0VEY2Fpb3o3T01nbC1mM1M4cTlVU2lRWm8yeEFlZm1GOVFmWF9wUVI0cEhkTWZlZEhDWDlLQ095all0a1JDd2F1TVltZGEwVG11T2dPS1hPLUpoZUlwcjZhTWJxQjllWGN2a2JEeWpkZHFWdWRlOGY3QW9hblRROVQ5WjBOMGRZWjJaRklUeVFnOUt2YW13eGFCNFFaUm5ZcWlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7ny.com",
      "title": "ABC7 New York"
    }
  },
  {
    "title": "Elon Musk’s AI Pushes Back As He Encourages Users To Upload Medical Information - Forbes",
    "description": "Elon Musk’s AI Pushes Back As He Encourages Users To Upload Medical Information  ForbesMusk promotes Grok for health data, but AI says don’t do it  PiunikaWebGrok Contradicts Elon Musk’s Healthcare Advice – Netizens Weigh In  Inquisitr NewsElon Musk Urges Grok Users To Use It as Medical Tool  mandatory.comElon Musk promotes Grok for medical advice despite privacy warnings: ‘Just take a picture’  CNBC TV18",
    "published date": "Wed, 18 Feb 2026 17:39:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOb2Y5SmRLMTROUGRVYmJSb3lMaXJDLVZpbm0tVWNrN045ZnJKbVVBclFYS0FOUEZBZm1hd1pFZmRVdFlFdlNNVE15NUNPeHNuZHBXVHRvOE03V2pLZVBteGRGNTNoYWNGOUgzaTQ4THZhTUFoYVN1MXlvMkJQX0dDQmtYMld3TU9rWEtqOHFVS0RoOTVjYkhCR1piQ1RPSmdKblhZcmxmYTFyaWZTNkZNNGN0NW45cjBjVHJqU2FNVGJjYUJEZllZZUl3cklOTjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Hassett says New York Fed staff should be disciplined over study finding Americans paid for Trump’s tariffs - MarketWatch",
    "description": "Hassett says New York Fed staff should be disciplined over study finding Americans paid for Trump’s tariffs  MarketWatchView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 16:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQNmprVGctMjdZb1Y2VGEwZXB2cThLX0dYSnVlUFN4enNOOFFpT1N4RDFOT2dmUWxmVEhic1NfcWRGRlhzSEpvSEd3clVMbTZGYWNKN2VLM01DNDBxUl9QS000RkRPMEFmQXRZNzJKV2NhVHdzUVNfOUROU19FQzhBZDBiZFMxV1BVeG12aVkwTkNLUUJJVmdzOURMNVlrbWFfeUtTT05mTDNMaDVfSnhMR2dHLVBkNUtJbktCQjBURTlPbGNXXy1wV1pkb05USDIzNTktN1hOUXNOZUxJQlNzQWg5cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Spain first to enter race for Lagarde succession at ECB - Financial Times",
    "description": "Spain first to enter race for Lagarde succession at ECB  Financial TimesChristine Lagarde to leave ECB before the end of her 8-year term  Financial TimesWhy political meddling over Lagarde’s exit risks undermining the ECB  Euronews.comECB Is Putting Independence at Risk With Lagarde Exit Maneuvers  Bloomberg.comMacron’s role in Lagarde succession drama grips Europe  politico.eu",
    "published date": "Wed, 18 Feb 2026 14:37:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE95bldfQ25qLXQ2Q2NhRlY5VGhCWUhTMDl1bXI0TTdHZEZhSkpNMlFocVVUbzdCMzVEU1pibF96RjBZOE53VzNYdlhDVkM5Q2oybDdDa2p1MjRDZWRlb0xlQnNRV0VONnBSQW9OZmJsMnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Teachers unions push for investigation into Apollo's Epstein ties - Axios",
    "description": "Teachers unions push for investigation into Apollo's Epstein ties  AxiosApollo Seeks to Reassure Clients About Rowan’s Epstein Ties  Bloomberg.comApollo Reassures Clients Over CEO’s Epstein Files Appearances: ‘Nothing New’  ForbesSEC urged to investigate Apollo over Epstein ties  Financial TimesApollo Global Management, Inc. (APO) Investigation: Bronstein, Gewirtz & Grossman, LLC Encourages Investors to Contact the Firm to Learn More About the Investigation  ACCESS Newswire",
    "published date": "Tue, 17 Feb 2026 14:54:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNWnQ3YlNVMWZBcmZPWXgzUmVXZ0V2eGlSQ0ZzaE5rc3pzQ0t5N1JHdkFsS3NjR2J0c3JaNnRHN0Z1Q29jZVVzcEMyYUY4OGozT2ZwcWoyamVvbE9wdnVLNkVDZnIxT3dRanNGbnpzZkEwUHF2V2ZXUlNVRVhJcm42RWR0VW96TnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Fed Minutes Show No Rush to Restart Rate Cuts, and Even Possibility of Hikes - The New York Times",
    "description": "Fed Minutes Show No Rush to Restart Rate Cuts, and Even Possibility of Hikes  The New York TimesFed officials split on where interest rates should go, minutes say  CNBCFed minutes: Lower inflation needed before many officials will support rate cuts  Los Angeles TimesFederal Reserve officials discussed interest rate hike scenarios at their last meeting  NBC NewsFed minutes show officials grappling with policy split, impact of AI on economy  Reuters",
    "published date": "Wed, 18 Feb 2026 20:12:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOUk1ubE12d09aaHhYRC1Qa3luNDFqTjFDeDViWkhXX0RmakdTWi1QOHNjX183R2x2dElfVGtkZ1hkVkFoOWczUXF2OUhUZVI2Tnh5Njg0YzNRZE8ySTVPU0NXMmdzei03anl4MWZTcWJKaEdRR21zOFB4aTZWcGpmWS1NZEZ5QnN6Y0tBay1aTkdxSGluTGVTVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The financialisation of AI is just beginning - The Economist",
    "description": "The financialisation of AI is just beginning  The EconomistBig Tech Accounting Creates a Blind Spot in the AI Boom  The Wall Street JournalThe Data Center AI Spending Boom Hides a Dirty Little Secret  The Motley FoolAI Boom Creates Blind Spot in Big Tech Accounting - Tech News Briefing - WSJ Podcasts  The Wall Street JournalBig Tech Will Spend $700 Billion on Artificial Intelligence in 2026. Here's My Top Stock to Buy to Take Advantage.  Nasdaq",
    "published date": "Tue, 17 Feb 2026 19:16:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQaWg4LW9MNFdXUEE3V1FGX24tbEJhVVZrQUQxMWVzXzhfV3c0R0VqSzY2NUJudWh5UVQzS3ZoYmwySkgzZ3FteVBhUVBLMzM2WHVoMXdaSXMtTVpYR3MyUUw4dDViQlhTS1JJTzYtUlhxa2taZVNUSnZiTUZNeW5OZnRhRlh1ek82MTFSMGJDaDNiM1Q5N0IxdFVQbUIxbHZobWgxamtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Video shows 'unruly passenger' aboard Delta Air Lines flight out of Houston - KHOU",
    "description": "Video shows 'unruly passenger' aboard Delta Air Lines flight out of Houston  KHOUDelta flight makes emergency landing after pilot says a passenger wanted to access the cockpit  CNNUnruly passenger did not access cockpit on Atlanta-bound aircraft, leading back to diversion to Hobby Airport, officials say.  ABC13 HoustonDelta flight returns to Houston after passenger's 'unruly behavior'  FOX 26 HoustonDelta flight returns to Houston’s Hobby Airport after passenger tries to access cockpit, assaults another passenger  Click2Houston",
    "published date": "Wed, 18 Feb 2026 20:08:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOVDJVdDB2TVpVQWdvWHg2WDJUbFd6Mk9OQm1tb0VYeFMxaTgxOGRzODItc0FJcEMtbTVMSzBFMjNYTkl0eTkwR3otdFpzTkI2eXpaaG55c0VSYk5Ucmh6djRXZFdReGlyUkN0UUpGR25XOFZ5RkVhSVBZcU0wU2JQcWlhVFZUU3JRTGxfcHZXVTJLODhRT0l6UHNLdkFpZDlhREpEekZQRkFjN3ZQOXB5SmI2UjdvR1h5anRBdXpNdXhzMm5wQUpfQ2lVQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.khou.com",
      "title": "KHOU"
    }
  },
  {
    "title": "Dow Jones Futures: S&P 500 Rises To Resistance As Nvidia, ASML Lead; Carvana Dives Late, Walmart Due - Investor's Business Daily",
    "description": "Dow Jones Futures: S&P 500 Rises To Resistance As Nvidia, ASML Lead; Carvana Dives Late, Walmart Due  Investor's Business DailyStock Market News, Feb. 18, 2026: Tech Stocks Rose For a Second-Straight Day  The Wall Street JournalNvidia leads the US stock market higher  Associated Press NewsS&P 500 rises, led by Nvidia, even with Fed rate outlook uncertain: Live updates  CNBCStocks Get Tech Boost Amid Strong Economic Reports: Markets Wrap  Bloomberg.com",
    "published date": "Thu, 19 Feb 2026 04:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQNU43TUZHM1ZhRURsR1RiX3p2WGExdnU4aUNTdGRaRHA4OXFnTHkyT3h3Qk1lY3VqaTZmbFp2RkpIYWg3VVMzdVBhUWNmeVF0MnFqeGlseWZjeXZ0eHFhWVBwRlJNdGhXZ3FCY2ZGTkp1NEpmQ2w2VkQ1a3EzcnVxa1l4MkRVSXFucHVnUXRlQXZ0NV91cmNVdGJqZHFrZ1hMZFJ1ekd0MkJ5eUltRHJSNDU5N2hmY0hiZ0VzdXdGOF9oMkpP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "FDA will drop two-study requirement for new drug approvals, aiming to speed access - Associated Press News",
    "description": "FDA will drop two-study requirement for new drug approvals, aiming to speed access  Associated Press News‘Just Agree to It:’ Pazdur Said He Was Told To Cosign FDA’s Reduced Trial Requirements  BioSpaceExperts react to FDA’s shift to single pivotal trials for most drugs  Regulatory Affairs Professionals Society | RAPSFDA Policy Shift: Impact on AstraZeneca (AZN) and Pharmaceuticals  GuruFocusFDA to begin requiring on clinical trial  TipRanks",
    "published date": "Wed, 18 Feb 2026 22:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNUHBQQnNzNVo1Q1B2UEdmY0lTd0lJdW1zQVplbEpObWJtbURJa1RONFBwZFhYME40WmlRRU96Rkh0cHVkZWlJck1HVzU0Yl9ZS25FdFl3RjJKR3FoTTNQY1F3NHpjeDJGczhRQzk2OTJza0xOc0J2cmtWeGlFRVFGT3hkc3FxQUZWcENJYkwyY0t6WFlGVmhuendnaEdsTHNm?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Millions of US Medicare Advantage enrollees forced to switch plans, study finds - Reuters",
    "description": "Millions of US Medicare Advantage enrollees forced to switch plans, study finds  ReutersOpinion | The Higher Price Tag on Medicare Advantage  The Wall Street JournalMedicare Advantage growth slows  Healthcare Finance News2.6 Million Medicare Advantage Plan Enrollees Will Lose Their Coverage in 2026  The Motley FoolUnprecedented Spike in Plan Exits Threatens Medicare Advantage Stability  The American Journal of Managed Care® (AJMC®)",
    "published date": "Wed, 18 Feb 2026 16:58:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNRG1BV2hsRlVod3pGbmMzbC1NbVI0dnVudXFxOGwtRHBKcGs1ak9zcHI4NU9raGlxZVZzcURRRWFQODlEeXY4QVFoZ29xTllzazVXLW9uTFFhOHhheldSMHg4QlZ2YVgxc1Ntb18wOHM5ZlBmV3Bad3VwRmdBY0dNTV95SUp0Snpoc0hFTTI3YU9BbWtsbkRwRkRvbF95X3k5WEhYSGJfVE9jcmUxT3dacmFZa1RDU2dmSVZxSkhzOW0tbVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Ted Sarandos Slams Paramount for ‘Flooding the Zone With Misinformation’ as Warner Bros. Discovery Initiates New Talks With Rival Suitor - Variety",
    "description": "Ted Sarandos Slams Paramount for ‘Flooding the Zone With Misinformation’ as Warner Bros. Discovery Initiates New Talks With Rival Suitor  VarietyNetflix grants WBD waiver to reopen deal talks with Paramount, Sarandos says 'let them make a move'  CNBCWarner Bros. Discovery backs Netflix merger while reopening Paramount talks  CNNAfter Censoring CBS, Trump Will Go For CNN  Washington MonthlyWarner Bros rejects revised Paramount bid, but remains open to a final offer  Reuters",
    "published date": "Tue, 17 Feb 2026 23:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQb19oX3phdEdfb1I2ZnEtcFUtcEI4NTRBN3A0a2NoMjMzeXdibzdqMGtmYmJ2cWhHOXFqd3VtNkIyMkRrLV8xb0ZOdUo4XzlCSmY1VC1tNTNDbGM5ZmdtWGJFZGUzWHEyaWdaai0yVGMzY0lrdEJKenFaV0Y4MUhOUVVjYkxSdWREN0pTQnVoS19odGE0dElOUUhlQWJJMHBsTmRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Laser writing in glass for dense, fast and efficient archival data storage - Nature",
    "description": "Laser writing in glass for dense, fast and efficient archival data storage  NatureProject Silica’s advances in glass storage technology featured in Nature  MicrosoftStone, parchment or laser-written glass? Scientists find new way to preserve data  The GuardianMicrosoft’s Glass Chip Holds Terabytes of Data for 10,000 Years  GizmodoData centres could store information in glass for thousands of years  New Scientist",
    "published date": "Wed, 18 Feb 2026 22:48:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFBWY1R3X01EdkpCcGJBQVAzNWNhMmVma1pNVTY0NjVQSGYzNVMzWG9DNlhtYXZVX21fYmhSdTVjRzVRVDVCRXY1YWw0Z0NHdHFMVzFoWUV2bkhicTBlYjY0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nature.com",
      "title": "Nature"
    }
  },
  {
    "title": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it - CNBC",
    "description": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it  CNBCTrump Family Crypto Bash Convenes Wall Street’s New Believers  Bloomberg.comAlabama lieutenant governor candidate joins Mar-a-Lago cryptocurrency conference  AL.comWorld Liberty Forum opens with 18% WLFI rally as Eric Trump says crypto industry still at ‘one-yard line’  The BlockWorld Liberty Financial to Tokenize Trump International Hotel & Resort, Maldives, in Partnership with DarGlobal and Securitize  Business Wire",
    "published date": "Wed, 18 Feb 2026 23:04:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdUhZZEZEa3pLd05ia3Fxa1BkR3gxdjJ4VjVOamd3RENiN2I1NTVDbkxCbEd6amVJeXVNSkNzTlJ0N29yNWpsLWF3YlRUZ1k0eTBfcnJ1OW5iaFlhOHZMV05CajJEY0piUTRDeER3WFlOVWFtYXV1aEQzN19reTVWbjNNaXFpcUJJcW1uQlJwOWMwNlYwcGctN9IBngFBVV95cUxNcnFVVGMydDRnRXFEaTlYaEx2U2R0cW9LdWlQdlI3UE9vMVdDT0EzQUNlbkp3WmxGdXFLT3BwZHdoRkc0MUg4em4wVTJqdGV6U0Exd1ZLYkplTHNqS2hVNEp3elJQZXVZNmwwcncwdkF5WTBDOGdwb18yRWpZVDU0WkI4MG0zRjVWVDNJdzdjck9zWDdqZ1ZDOFduanpPQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "6,000 execs struggle to find the AI productivity boom - theregister.com",
    "description": "6,000 execs struggle to find the AI productivity boom  theregister.comThousands of CEOs just admitted AI had no impact on employment or productivity—and it has economists resurrecting a paradox from 40 years ago  FortuneAI’s effect on labor productivity is murkier than you might think  marketplace.orgOver 80% of companies report no productivity gains from AI so far despite billions in investment, survey suggests — 6,000 executives also reveal 1/3 of leaders use AI, but only for 90 minutes a week  Tom's HardwareThe AI productivity take-off is finally visible  Financial Times",
    "published date": "Wed, 18 Feb 2026 15:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5HcV8yTWJLUlVpQW83Y3ktbUVablJCWktZYTktZWtPOTRHaUlDcU9yWm5vWUM2YjZzR1prRy1FYzVNUGxCZ0V6RS1Ua3hMMU9LQVlGUVZVNExMQjZRdm83Rkx5UV83SjJWSGx2aVhCbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Johnson & Johnson to build $1B cell therapy manufacturing plant in Montgomery County - The Business Journals",
    "description": "Johnson & Johnson to build $1B cell therapy manufacturing plant in Montgomery County  The Business JournalsJohnson & Johnson to Invest More Than $1 Billion in Pennsylvania Cell Therapy Factory  The Wall Street JournalJohnson & Johnson Expands U.S. Footprint with more than $1 Billion Investment in Next Generation Cell Therapy Manufacturing Facility in Pennsylvania  Johnson & JohnsonJ&J to invest $1 billion in new Pennsylvania plant amid US manufacturing push  ReutersJohnson & Johnson will spend $1 billion on a cell therapy plant in Montgomery County  Inquirer.com",
    "published date": "Wed, 18 Feb 2026 15:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOXzhwLWdxQkx3YkI3WjVLeGYzSUUzb2JIMm9lcngwRmd6bkREMlZRX1J4ek1YeWpLMk9aMndoemhrRHduWG1CYTF1TFZUWC1YUjkwUHp6d0p4dXZtVlZnYkxXUWJaYzR3Q2ltY3RlMjhVY1otUy1pclFjSlVLd3pUT0RBTjBTSG9ZRGJkdjE2TS1LZnNVRFhvQmRzcXlod3VRQkVqRC1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bizjournals.com",
      "title": "The Business Journals"
    }
  },
  {
    "title": "FDA Misses Deadline To Publish Cannabinoid List And Define Hemp 'Containers,' Drawing Industry Criticism - Marijuana Moment",
    "description": "FDA Misses Deadline To Publish Cannabinoid List And Define Hemp 'Containers,' Drawing Industry Criticism  Marijuana MomentFederal hemp ban leaves Minnesota THC sellers in limbo  MPR NewsBans on Many CBD Products Loom This Year - The New York Times  The New York TimesWisconsin hemp business owners want industry regulation; here's why  FOX6 News MilwaukeeHemp bills see heavy debate in House and Senate  Columbia Missourian",
    "published date": "Wed, 18 Feb 2026 15:22:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPMUdjOE9sRTN3X2hEWC1lZkRfS3NfbWlORnVWU3JWY1FtcGdGblJXM3hjZXFtNndzMkJGaWgwbFNsZmdOM2tPNlNBRS1jYjQtZnQySHFIWUZsM1AwM19BaTRXVE9xYU90dHEyVGthbzNJVEpnRUg4cXZhU3ZYUXF5TzJ6VzRIS3hrY0VvaDdhLUxsTkU1OFpCY2doTlFheHBoa2xLRm9iV0d1Z3BXY0laOVhzSURYaWtLUERCMXp1MzZVSm1ib3ZQY3poWnAxUUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marijuanamoment.net",
      "title": "Marijuana Moment"
    }
  },
  {
    "title": "Trump selects investment projects to be funded by Japan - The Japan Times",
    "description": "Trump selects investment projects to be funded by Japan  The Japan TimesTrump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects  CNBCUS and Japan unveil $36bn of oil, gas and critical minerals projects in challenge to China  The GuardianTrump Hails Japan’s First Batch of U.S. Investments  The New York TimesNew $33 billion natural gas power plant could power half of Ohio  The Columbus Dispatch",
    "published date": "Wed, 18 Feb 2026 04:02:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQcHBIN05qOTZ6QzZZQWRaN1Y4bkhGTHN1ZkFOUmhYdEZYQk5aTDF1SzFlcm5pazBKVTU0SXV3d09Xa2V5Y0YzS0pKYWdVSzVqY1hPYVR5Q3dVSm4xM3hNUDEyQ28tNzVpc3JreXFOaXdOcTVFenNKQjVWZXN5VDZDMDhJek96SVJfZnFUVEVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.japantimes.co.jp",
      "title": "The Japan Times"
    }
  },
  {
    "title": "Grandson of the inventor of Reese’s Peanut Butter Cups accuses Hershey of cutting corners - Associated Press News",
    "description": "Grandson of the inventor of Reese’s Peanut Butter Cups accuses Hershey of cutting corners  Associated Press NewsGrandson of Reese’s inventor blasts Hershey over alleged recipe changes: 'I threw it in the garbage'  Fox BusinessGrandson of Reese’s Peanut Butter Cups inventor calls Hershey’s ingredient swaps ‘devastating’  OregonLive.comDo Reese’s taste different? Hershey Company responds to allegations  WANE 15Grandson of Reese's founder alleges Hershey has switched to cheaper ingredients – sparking family feud  New York Post",
    "published date": "Thu, 19 Feb 2026 01:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOY0FZV3cxRTU1QVZPc2NnelpDUWo4SUo0cHNMUWxlRHE2bndZMjBOUm40ZzJkdmZIMTNodlN1RVJ2TXBlMXppZVJZZkRLQXVzS0YwVnBlLUJ4TXJiMVFULXNsR1pSTEU1TW83UndYdWNiaUdScGlndnd2R09aRDktWEZTV2w5ZUNERFRuX3Bwbks0dlQwZlB5VS1EZVVMUkRIb0loa21n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Bayer Agrees to Pay $7.25 Billion to Settle Roundup Lawsuits - The New York Times - The New York Times",
    "description": "Bayer Agrees to Pay $7.25 Billion to Settle Roundup Lawsuits - The New York Times  The New York TimesBayer’s $7 Billion Bid to End Roundup Curse Draws Skepticism  Yahoo FinanceBayer falls 7% after proposing $7.25 billion settlement in Roundup case; European markets end higher  CNBCBayer proposes $7.2 billion settlement to resolve Roundup weedkiller cases  CBS NewsBayer proposes $7.25 billion class action settlement in Roundup litigation  The New Lede",
    "published date": "Tue, 17 Feb 2026 20:37:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNOWJHU3BFQlRKdGtkeWhCYWF2RTNkald3VW9mWURRdDRmMmVjVzFxMHVDZ1ZtVzNKRWFDSjJVeTdZQ2hwM0JWUDBRQTVhSFkxNVRXVG5Cbm95LUNhbjV0UExwWjdaWkRGT3RPYUhKNXIwNjB4TnAzbkM2dEZCY1VESTc4VXpfWVJKcGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge says lawsuit over Buffalo Wild Wings boneless wings has \"no meat on its bones\" - CBS News",
    "description": "Judge says lawsuit over Buffalo Wild Wings boneless wings has \"no meat on its bones\"  CBS NewsNo bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu  YahooFederal judge rules on whether Buffalo Wild Wings can keep 'boneless wings' on menu  Fox BusinessBoneless Wings Are Still Wings, Judge Rules  The New York Times“No meat on its bones”: Judge rejects suit over Buffalo Wild Wings’ “boneless wings”  MS NOW",
    "published date": "Wed, 18 Feb 2026 15:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPRHV5ZXhLdjlzcV95V1I3VktTOUNpS3p6ZUxiV2N0eUFSck4yWEVHSWNRem11NlhnRWx4TU5iZUZoQjhZbmk3UnVOM1J4LVpBbXRQcGtRTTRFNVFtczNyT1FRV2VYYzV0SVlPcEtzbFRLbWRpOFpiQ210c2d1d1ozcmpLQS3SAYoBQVVfeXFMTUJIZ2l1T3BVeldEVExkWVBJOTZhUDAxR3J3QTJPYlNNRjVYdWlNbHRaU2dZcUh5QVQxanlxZEJTZmVtOE40eXpRTW5vaGZTVnlnaEgwN3V0dHRkdjN1Mk9kMHpjMWtIWEcwWHdMZ1dqTTJUQzhXYk9nOUhvZExOd3FJWWJOYkJHNFRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "IMF urges Japan to keep raising rates, avoid reducing sales tax - CNBC",
    "description": "IMF urges Japan to keep raising rates, avoid reducing sales tax  CNBCJapan's junior coalition head warns against political meddling in BOJ policy  ReutersIMF urges Japan to avoid lowering consumption tax  Japan Wire by KYODO NEWSJapan's economy resilient but faces debt and inflation risks: IMF  Fibre2FashionJapan Special Corporate Tax Relief Tops 2 T. Yen in FY 2024  nippon.com",
    "published date": "Wed, 18 Feb 2026 01:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOa3ZZQ2NFckhQalFsVWZMVHZmSWotVk4xanFYZmx1akVDSHkzNmQtSDd6WlB1S2tzLWZfUWR0RWp5NWQ3SXBYT2FoWlZ3VDRNVktuZmdsQVBfU19oU3VRd3JoRWxWSDg1V3daenNON2s4V1NrYVhVZWFLSHlVMTNjYUtmaU1CaGxyVDRQWkU1cVRBNzhCSlZwcE1kUGZDRmlN0gGmAUFVX3lxTE1RRnYyUUw0TVJDcGhjTDZsZmk1TFc0SU9pME9kUl83Z19rQXlUUGNyUUtWYlY4WDRnYnBpYnk2dmN0YTJBRVRvbzZQSFZ0V2ROT21qejkzNXNsaWFubk1jQWZwMkdPbjB1dVlnMmUzckYzVnpqVmkydndDUHFqR081eWNhVWxlTU5ZdzhSM1RFLWNEbEN6b3BQNHFFa2l2eWVsUHo2QWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Agentic AI, explained - MIT Sloan",
    "description": "Agentic AI, explained  MIT SloanAI agents are transforming what it's like to be a coder: 'It's been unlike any other time.'  Business InsiderAgentic AI Is Forcing Contracts To Govern Continuous Behavior  Above the LawThe Rise of the Agentic Economy: From Copilot to Autopilot  intlbmAI Is Wired Into the Enterprise. Now Governance Is Catching Up.  The National CIO Review",
    "published date": "Wed, 18 Feb 2026 15:15:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5nNkJMcjBySVgtWG5XemFIRzVObzZIaEpFZzNLZldpWGZGVWlfNWtONVhmSDlnNjh1ZXo0YkpjR0RnREJ3bXhxdUtkU2ltSnZqUHJnU2tBWXhvc0lqMnpma1JsSk9ONi05S1BBWk5XSFUyaTJH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mitsloan.mit.edu",
      "title": "MIT Sloan"
    }
  },
  {
    "title": "Ford turns to F1 and bounties to build a $30,000 electric truck - TechCrunch",
    "description": "Ford turns to F1 and bounties to build a $30,000 electric truck  TechCrunchFord unveils new details on its cheaper EV platform. First up, a midsize pickup.  Yahoo FinanceSee Images from the Tech Briefing on Ford's 2028 Electric Pickup  Car and DriverInside Ford's effort to make EVs more affordable  AxiosFord’s $30,000 Compact Electric Pickup Truck Borrows Notes from F1 Testing, Tesla Gigacasting  Road & Track",
    "published date": "Tue, 17 Feb 2026 23:43:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPcTNLXzFpbUFOaHJWN1NQbEViYVp2UmNPWm9VQTZ1UUZyLWtjY0FrVW5tR3FLRzlyZDg1dG56czBTTjQ1WnFqNUJSTHc1bVdFRExhdnZIeGpxd0lHM2VJSWxsdHNGTG52blkyNHlyUGl6SVg2Q0o4Sjk5Q0lrOEJEU0hoZnF4ODBiTGlfcGNKU3ptV3NtdzZ0OHdjekc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Palantir's Florida move is more than just a change of address - Business Insider",
    "description": "Palantir's Florida move is more than just a change of address  Business InsiderAI giant Palantir moves its headquarters to Florida as tech company exodus continues  Fox BusinessPalantir — Colorado’s largest public company — is leaving Denver for Miami  The Denver PostPalantir quietly relocates headquarters from Denver to Florida  9NewsMiami Isn't the Next Silicon Valley. It's Something Much Weirder.  Business Insider",
    "published date": "Wed, 18 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPajdlbldvdFZPT2laTHBPOEoyS3NKNEp4NXN6NUFsSks4LXNEZEdjR1N3QXFTcTZFR0VfX3VqbGJRdzU2aVJIaXlNVXhlcEFZRDVCaUh5ekFpTUNnSlNXZ3dZQ1VZQUt4SFNCeXdkclJyREJYNUVVMjdXTDlRQ3BINWNzajViN3NBcGVzcnIteC1pT0xSeldv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Whirlpool to cut nearly 350 jobs at Amana, affecting more than a quarter of plant staff - KGAN",
    "description": "Whirlpool to cut nearly 350 jobs at Amana, affecting more than a quarter of plant staff  KGANWhirlpool’s Union condemns Amana layoffs  KCRGWith Amana layoffs, union accuses Whirlpool of moving jobs to Mexico  The Des Moines RegisterWhirlpool Corporation (Amana, Iowa) WARN Act Investigation  Strauss Borrelli PLLCWhirlpool to lay off off 341 workers at Middle Amana plant  Corridor Business Journal",
    "published date": "Tue, 17 Feb 2026 16:14:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNdFhIS0xXZXp0eVNsLU9KZU1kMjJlXzNqSlpycl9zZHo5YktPdlJ0a1h6bm05ZjlRRktKSXhHWHlZQTFkM0N4OG1ESmFyM21wNEhwYzFlMGM2TmY0b3ZHT0ZLLXlzcTBNVlRvX29ROGl0dHJkTzV2eG1CUHJRY09UMk5MSzJKTlVHb3RXY3VubUtxamphYXVBSmJiTEdIQjRmVkpFQXpfZ2NYRkFVNl9RNFhiLXVXSHB5LUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://cbs2iowa.com",
      "title": "KGAN"
    }
  },
  {
    "title": "Palo Alto Falls As Fiscal Q2 Beat, Guidance Underwhelms Amid Acquisitions - Investor's Business Daily",
    "description": "Palo Alto Falls As Fiscal Q2 Beat, Guidance Underwhelms Amid Acquisitions  Investor's Business DailyPalo Alto shares sink 7%, CEO defends cybersecurity's position as AI hits software stocks  CNBCPalo Alto Networks’ stock falls after earnings. These analysts see a good chance to buy.  MarketWatchPalo Alto Networks cuts annual profit forecast as deal costs bite, shares fall  ReutersEarnings live: Carvana stock plunges after profit miss, DoorDash slides amid mixed results  Yahoo Finance",
    "published date": "Wed, 18 Feb 2026 13:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZ0VCUl9CWFVpSmZrbWpaX0VkYjdLcDRoLUxWaVYzT3VoM3ptYzBhMnFnYy14MmhYSGV6eXZoVlR5TEQ4T1RtS2lmR3dBeURNRHJlemIwNEFLYjV5UU1ZTFVKVXpZakJFR0c1VDFwcGh5d3htbkRJZkRzZVotcDlIWmRXOFhCbzhGNGQ5bzlUUVRjNG5pOC1DX0Vn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "2026 Toyota C-HR First Drive Review: An Entry-Level EV That’s Actually Fun - The Drive",
    "description": "2026 Toyota C-HR First Drive Review: An Entry-Level EV That’s Actually Fun  The DriveView Exterior Photos of the 2026 Toyota C-HR  Car and Driver2026 Toyota C-HR First Drive: Affordable, AWD, and Actually Fun?  MotorTrendI Drove the 2026 Toyota C-HR EV: An Honest Review of Toyota’s Compact Electric SUV  AutoblogToyota’s C-HR electric hatchback starts at $38,135  The Verge",
    "published date": "Wed, 18 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54aFhORDRKZGNKalVYdHgwSlNvVDdOTUNqWFpQVWFTYUdBcVByczNtbTE1VFQ5Y1JudFRQNVJHQlBoX1hPZWp4cEF4eE9SaGltdVBNa1Y5dmt2eXBNTmp5RkNjUkZRSXYwTkhFNUt0ZFBtMTRvVnNnOFJFM3I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedrive.com",
      "title": "The Drive"
    }
  },
  {
    "title": "‘He’s jumping in all the way’: A Trump financial regulator backs prediction markets in their clash against states - Politico",
    "description": "‘He’s jumping in all the way’: A Trump financial regulator backs prediction markets in their clash against states  PoliticoCFTC defends its right to prediction market enforcement as states challenge platforms  CNBCOpinion | States Encroach on Prediction Markets  The Wall Street JournalUtah governor blasts Trump regulator for blessing prediction markets  The Hill\"We will see you in court\": U.S. commission fights states on prediction markets  Axios",
    "published date": "Wed, 18 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNX3hNc0hjMW1FVW5WaVZOSnhIcmlMQjYxc1gycEdZWkczSXFPeUF0ZVh6SWg0RERvbVE1eXoyN2FyY0J0R2VQbmt0ZjZDY3BNRFpxMk5hZm4tNDl3eDdyM2tnSGFxN19udmV0LVlJbmpwbzI2cUh5WU5YZVdvYWVHRi04U2hlUnNVMm5tdE5n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]