[
  {
    "title": "Former Victoria Secret CEO denies connection to Jeffrey Epstein's crimes - Politico",
    "description": "Former Victoria Secret CEO denies connection to Jeffrey Epstein's crimes  PoliticoLes Wexner's ties to Jeffrey Epstein, explained  AxiosBillionaire Lex Wexner tells US lawmakers he was 'naive' and 'conned' by Epstein  BBCBillionaire Les Wexner testifies before Congress about ties to Epstein  The GuardianEpstein files show years of FBI interest in Les Wexner, Epstein’s mysterious benefactor  CNN",
    "published date": "Wed, 18 Feb 2026 19:48:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQYk5oZkNrUmFpYWk5VUJsOVAxNjFFM2lrUVRLNWYxWlFJT2tYU3NsMkFDNElYTXktUHF2X2lLV2xYVU1HaEc4cmZZWDBFYlhMUE5xcFUwWFp0akZWUTIyMWs3LTAzZnFTZ09wT0ZrUUdhZ1A2QVVCUWE3R3JpOVlWOU9nUkU0QzFGMFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Zuckerberg grilled in landmark social media trial over teen mental health - The Guardian",
    "description": "Zuckerberg grilled in landmark social media trial over teen mental health  The GuardianMeta’s Zuckerberg testifies about social media’s effects on children in landmark trial  CNNZuckerberg testifies in landmark social media addiction trial  AxiosZuckerberg testimony: Company consulted stakeholders about keeping beauty filters  CNBCMark Zuckerberg grilled about underage Instagram users, social media addiction during landmark trial  NBC News",
    "published date": "Wed, 18 Feb 2026 19:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQOE9ydEZ4a0dMVUgzbGZKSkRqUjlrSS1GbXpjaVUwNVVEN2FuYXk4RlVWMXJCVDNMcHo3Yk1ZeFpmSHdUQ0dBd2RNMkRzVGcyd29fUXFpb3NOd2JIREpJWDlscG1PeFU3ckVVd2JlR1pjUllkTEh1ZGpYX1R6dG5nX2ttZ2RFWW1qRHRUZzJEcTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "F.D.A. Reverses Decision and Agrees to Review Moderna’s Flu Vaccine - The New York Times - The New York Times",
    "description": "F.D.A. Reverses Decision and Agrees to Review Moderna’s Flu Vaccine - The New York Times  The New York TimesFDA reverses course on Moderna flu shot  NPRFDA's reversal on Moderna flu shot bid followed White House pressure  PoliticoFDA agrees to review Moderna’s mRNA flu vaccine application in a reversal  CNBCModerna says the FDA will consider its new flu shot after resolving a public dispute  Boston.com",
    "published date": "Wed, 18 Feb 2026 21:40:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQajR5QnpMbTNvakRDVVZfXzNvekVpMjR6aVhndVB0cmpPdGxFbkJyOVNjVGlHbF82Z3l0TzV0V014cTRxTW9tVV9rSm1jeUNiTzIwWGVDWDhBMDI4SUI1MHJnbFVmZk1IdEdyQTJtY1Vnc283ZDNmdGhpYlFlZVI1Rg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Fed officials split on where interest rates should go, minutes say - CNBC",
    "description": "Fed officials split on where interest rates should go, minutes say  CNBCFederal Reserve officials discussed interest rate hike scenarios at their last meeting  NBC NewsFederal Reserve officials warn progress towards inflation goal will be ‘uneven’  Financial TimesFed minutes show officials grappling with policy split, impact of AI on economy  ReutersFed Minutes Show No Rush to Restart Rate Cuts, and Even Possibility of Hikes  The New York Times",
    "published date": "Wed, 18 Feb 2026 19:00:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9PSDdsTXhUOVpjWWFVTlAtOVA1V2Y1c0xqWWdqcldDajdxTjdvVmZnVGl6RHg4cFJIQ2QtMXhXMmREeGUzNjQwODhtOEhrYUJHVEE3azZlNHY5SUxIMVcxZG1aMFMyRmZBN3BGSGpn0gFzQVVfeXFMTm9yMU5Fcm1aYnhTX01tNDdfcjNiaGNUREh4NTJqaXdraG5VOWpCZ3BRcWVLWGtJeXhwejdBVnB4WjhjUTgzVHAxRkd4dHZfM0VRaElqaFpaQUxsR09yd2ZrQ0NWcDByY2R6ZFZRbEVXRm1BVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump's economic adviser says authors of tariff study should be \"disciplined\" - Axios",
    "description": "Trump's economic adviser says authors of tariff study should be \"disciplined\"  AxiosHassett says authors of New York Fed tariff study should be disciplined: 'Worst paper I've ever seen'  CNBCWhite House economic adviser says Fed researchers should be punished  The Washington PostTrump administration slams New York Fed study that says US consumers bear the cost of tariffs  Yahoo FinanceWho Is Paying for the 2025 U.S. Tariffs?  Liberty Street Economics",
    "published date": "Wed, 18 Feb 2026 16:33:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFB6VnVlLVJBTThaSWJtOHBYN2hUNHdXaldtdjNkMDVZd051dldUQWFnUWhNOEloNXhEaGNrNkhwUEQtdzJxVkkyUENUTFltRS1lZk5OMXBKNklhRzFCSnN3ZVRfRzM2b0EwMlhrNFFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Microsoft to keep buying enough renewable energy to match all its electricity needs - Yahoo Finance",
    "description": "Microsoft to keep buying enough renewable energy to match all its electricity needs  Yahoo FinanceA milestone achievement in our journey to carbon negative  The Official Microsoft BlogMicrosoft Says It Has Reached Its 100% Renewable Electricity Target  The Wall Street JournalMicrosoft global energy strategy annoucenment at its Dublin data centre  Reuters ConnectMicrosoft Hits 100% Renewable Energy Match With 40GW Portfolio  The Tech Buzz",
    "published date": "Wed, 18 Feb 2026 16:02:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNMjRKTVd1U1NqcTZCVS1jNXYyZE0ybW9scVM5T0Q4dmVOQUJWV0JNS1NVVWdiVzJQVzlFNFdPQi1ZekJKV0xzY0VWZnkteklKbHZxUHVuVF9XNWVYeFV4ajIycEtVSVJtN3o5b3ZTVkNNdFZ2QlZWVkw5Vk5NbmdpamM4N0pmdm5yN0ZTSA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://finance.yahoo.com",
      "title": "Yahoo Finance"
    }
  },
  {
    "title": "Stock Market Today: Dow, Nasdaq Move Higher Ahead of Fed Minutes — Live Updates - The Wall Street Journal",
    "description": "Stock Market Today: Dow, Nasdaq Move Higher Ahead of Fed Minutes — Live Updates  The Wall Street JournalStock market today: Dow, S&P 500, Nasdaq rise as AI worries recede, with Fed minutes ahead  Yahoo FinanceDow Rises as Tech Stocks Gain  The Wall Street JournalDow Jones Futures Rise; Nvidia Gains On Meta AI Deal, Rivals Fall  Investor's Business DailyS&P 500 rises, led by Nvidia, even with Fed rate outlook uncertain: Live updates  CNBC",
    "published date": "Wed, 18 Feb 2026 22:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNSnZSVlItZ3h6SmdZZFdndE5TSWdjcWJDU0Z4VE05NWlra3FpSW1hTFRCNzlaR0tqcjBzQndDZU9rOXl4X2dYTUJ4U2ZKdzg5TnRyZXJuU3EyMFUxc09ZTjI5SElqUTA0YTVLZS1wVmtkNHl4NmxjZWttRTkwXzFieWFiM0FuNk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Spain first to enter race for Lagarde succession at ECB - Financial Times",
    "description": "Spain first to enter race for Lagarde succession at ECB  Financial TimesChristine Lagarde to leave ECB before the end of her 8-year term  Financial TimesUS stocks follow European shares higher; geopolitical jitters boost oil, gold  ReutersMacron’s role in Lagarde succession drama grips Europe  politico.euECB’s Lagarde Hasn’t Made Decision on Finishing Term  The Wall Street Journal",
    "published date": "Wed, 18 Feb 2026 14:37:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE95bldfQ25qLXQ2Q2NhRlY5VGhCWUhTMDl1bXI0TTdHZEZhSkpNMlFocVVUbzdCMzVEU1pibF96RjBZOE53VzNYdlhDVkM5Q2oybDdDa2p1MjRDZWRlb0xlQnNRV0VONnBSQW9OZmJsMnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Musk Rails Against ‘Woke And Sanctimonious’ AI Rivals—Insists ‘Grok Must Win’ - Forbes",
    "description": "Musk Rails Against ‘Woke And Sanctimonious’ AI Rivals—Insists ‘Grok Must Win’  ForbesGrok 4.20 released on...? Trading Odds & Predictions  PolymarketElon Musk announces launch of Grok 4.20 this week  AzerNewsMusk praises Grok for denying US is on stolen land, shares other chatbots’ replies | 'No one is illegal on stolen land' | Inshorts  InshortsGrok – To Understand. See deeper. Think bigger. Be curious. Be excited. Now you get it, at a cosmic scale.  x.com",
    "published date": "Wed, 18 Feb 2026 19:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQbmg0anNlV0dJTnNnX1k5cnlrZmhrc2FPaHdFYmF0Nm9ZaXBfYWVzOEh1MWxfeHF5bEg2eGYxaE9ud0psbUwtNUJRMmd0NDdmNkdmaW9KQ3d1QnFfblJkekRCWFpuLVVlcXFLS2FYeWVvLTA1RElaX1FxX1FEdjU5ZXVxLVlWM2xYdE1FRnVWYWhrV1ZhMEVWOVNkS3JQbngtTFpTUEdKTnMyNFNYZ3h4Y0UwWnQ1bFJhaWhURHU2ZTA1WUU2Snc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Grandson of the inventor of Reese’s Peanut Butter Cups accuses Hershey of cutting corners - Associated Press News",
    "description": "Grandson of the inventor of Reese’s Peanut Butter Cups accuses Hershey of cutting corners  Associated Press NewsGrandson of Reese's Peanut Butter Cup inventor accuses Hershey of \"quietly replacing\" ingredients  CBS NewsHershey Co. responds to allegations of ingredient changes from grandson of Reese's founder  local21news.comThe Hershey Company responds to Reese’s family member’s complaint about Reese’s peanut butter cup recipe  ABC27Hershey blasted by Reese’s family over core ingredient changes  Confectionery News",
    "published date": "Wed, 18 Feb 2026 19:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOY0FZV3cxRTU1QVZPc2NnelpDUWo4SUo0cHNMUWxlRHE2bndZMjBOUm40ZzJkdmZIMTNodlN1RVJ2TXBlMXppZVJZZkRLQXVzS0YwVnBlLUJ4TXJiMVFULXNsR1pSTEU1TW83UndYdWNiaUdScGlndnd2R09aRDktWEZTV2w5ZUNERFRuX3Bwbks0dlQwZlB5VS1EZVVMUkRIb0loa21n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Palantir moves HQ from Denver to Miami - Denver Gazette",
    "description": "Palantir moves HQ from Denver to Miami  Denver GazetteAI giant Palantir moves its headquarters to Florida as tech company exodus continues  Fox BusinessPalantir quietly relocates headquarters from Denver to Florida  9NewsMiami Isn't the Next Silicon Valley. It's Something Much Weirder.  Business InsiderPalantir Relocating HQ To Miami  Bisnow",
    "published date": "Wed, 18 Feb 2026 01:36:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPRkt0NThIc01PMTdjeXR2UmdNOHpDR0xQSzRkLWlvWjlRVWp2ZDgyMWpsRWZYR3ZvUHkzMTM1MGxvZFFhWTBqZE1NSWFXRWt6dWJicjBGMmFObWRxZklONUlKWDdyTUl0OFNzeUVja2NQZVU5R2JvT0pVMkJMTmJUUGFuRjZCNE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.denvergazette.com",
      "title": "Denver Gazette"
    }
  },
  {
    "title": "Inside Ford's effort to make EVs more affordable - Axios",
    "description": "Inside Ford's effort to make EVs more affordable  AxiosFord unveils new details on its cheaper EV platform. First up, a midsize pickup.  Yahoo FinanceFord to follow Tesla Cybertruck with electrical tech in new EV pickup  CNBCInside Ford’s ‘Bounty' Culture: Why the UEV Platform Doesn't Need a Massive Battery  Ford From the RoadFord Looks to Hit $30,000 EV Price Target by Shrinking Battery  Bloomberg.com",
    "published date": "Wed, 18 Feb 2026 08:34:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBmNXJIUm5CbFdXWlZMTF9OWmUyV3RXM0VzUFhnWmlheEg2UHdKd19EdDhuQjJieUZQS3hYUS1tSnNFTXNJSU12akMtcF90aWhsaXhxQ0F0Y2dKUWRvREhWaF9DTFUxVl9mc2U0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "'Unruly' passenger forces flight to return to Hobby Airport, Delta Airlines says - KHOU",
    "description": "'Unruly' passenger forces flight to return to Hobby Airport, Delta Airlines says  KHOUUnruly passenger did not access cockpit on Atlanta-bound aircraft, leading back to diversion to Hobby Airport, officials say.  ABC13 HoustonDelta flight returns to Houston’s Hobby Airport after passenger tries to access cockpit, assaults another passenger  Click2HoustonDelta: Unruly passenger taken into custody, didn't try to breach cockpit  KFDMAtlanta-bound Delta flight returns to Houston after passenger disturbance, police meet plane  CBS News",
    "published date": "Wed, 18 Feb 2026 20:08:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOVDJVdDB2TVpVQWdvWHg2WDJUbFd6Mk9OQm1tb0VYeFMxaTgxOGRzODItc0FJcEMtbTVMSzBFMjNYTkl0eTkwR3otdFpzTkI2eXpaaG55c0VSYk5Ucmh6djRXZFdReGlyUkN0UUpGR25XOFZ5RkVhSVBZcU0wU2JQcWlhVFZUU3JRTGxfcHZXVTJLODhRT0l6UHNLdkFpZDlhREpEekZQRkFjN3ZQOXB5SmI2UjdvR1h5anRBdXpNdXhzMm5wQUpfQ2lVQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.khou.com",
      "title": "KHOU"
    }
  },
  {
    "title": "Tide moves beyond laundry detergent pods with nationwide evo tile launch - Axios",
    "description": "Tide moves beyond laundry detergent pods with nationwide evo tile launch  AxiosTide spent 10 years turning laundry detergent into a tile. Please don’t eat it  Fast CompanyTide’s Newest Laundry Innovation Was 10 Years in the Making — What To Know  TODAY.comTide drops new laundry tiles. How are they different from pods?  USA TodayTide Just Launched a New Waterless Detergent That’s ‘Like Laundry Magic’  Better Homes & Gardens",
    "published date": "Tue, 17 Feb 2026 14:05:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOdnNRZVl6LU5jbE90ZzVOeW1FMWJ0OFp3LUExNTA0MHhZWHdvRkZlUUlFMTUyb0RraDgwa2xaa1FPY3o2bXZPczJRR1RVaVJFZVhFZVNMenZKZGFCREFzbW9EWUVwdW9laVAta2kyZDNGXzVhdXVUNTFDcE1oTmZPQ1ln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "$56.85M Wells Fargo CARES Act class action settlement - Class Action Lawsuits",
    "description": "$56.85M Wells Fargo CARES Act class action settlement  Class Action LawsuitsWells Fargo to pay $56.85 million settlement. Are you eligible?  USA TodayWells Fargo customers to get direct payment from $56.8 million 'home' settlement - see if you are eligible  the-sun.comWells Fargo is already sending checks to all these customers  Mundo DeportivoWFC Stock Today: February 18 – $56.85M FCRA Settlement Explained  Meyka",
    "published date": "Wed, 18 Feb 2026 15:00:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNY2xlUzNvbTZfRzAybXkyeXJGQ0h6NmtmSldiNUdXMVJfYUtSeTFIdDc1bjlWRGU1UDU4TXdEZl82SDBuQjR0YkZfdENOb2JWbjk3OHV3eDVnbnJmTHlFcy1pY2JWdHpxU1dNbk1KWHQ3c3J6cHBxejhkemxEOXdiRzBpOHR1VVNtMWtCRnpFMDR4VjgxdlhtakNxUFQ2RVRLRnlHaHVfRjhqQXJCSnZTNy1XV00yZHlGZU0wd0hnV2dxaXpi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://topclassactions.com",
      "title": "Class Action Lawsuits"
    }
  },
  {
    "title": "Judge says lawsuit over Buffalo Wild Wings boneless wings has \"no meat on its bones\" - CBS News",
    "description": "Judge says lawsuit over Buffalo Wild Wings boneless wings has \"no meat on its bones\"  CBS NewsNo bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu  NBC NewsFederal judge rules on whether Buffalo Wild Wings can keep 'boneless wings' on menu  Fox BusinessBoneless Wings Are Still Wings, Judge Rules - The New York Times  The New York TimesUS judge says lawsuit over Buffalo Wild Wings ‘boneless wings’ lacks meat  The Guardian",
    "published date": "Wed, 18 Feb 2026 20:52:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPRHV5ZXhLdjlzcV95V1I3VktTOUNpS3p6ZUxiV2N0eUFSck4yWEVHSWNRem11NlhnRWx4TU5iZUZoQjhZbmk3UnVOM1J4LVpBbXRQcGtRTTRFNVFtczNyT1FRV2VYYzV0SVlPcEtzbFRLbWRpOFpiQ210c2d1d1ozcmpLQS3SAYoBQVVfeXFMTUJIZ2l1T3BVeldEVExkWVBJOTZhUDAxR3J3QTJPYlNNRjVYdWlNbHRaU2dZcUh5QVQxanlxZEJTZmVtOE40eXpRTW5vaGZTVnlnaEgwN3V0dHRkdjN1Mk9kMHpjMWtIWEcwWHdMZ1dqTTJUQzhXYk9nOUhvZExOd3FJWWJOYkJHNFRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Ted Sarandos Slams Paramount for ‘Flooding the Zone With Misinformation’ as Warner Bros. Discovery Initiates New Talks With Rival Suitor - Variety",
    "description": "Ted Sarandos Slams Paramount for ‘Flooding the Zone With Misinformation’ as Warner Bros. Discovery Initiates New Talks With Rival Suitor  VarietyNetflix grants WBD waiver to reopen deal talks with Paramount, Sarandos says 'let them make a move'  CNBCWarner Bros. Discovery backs Netflix merger while reopening Paramount talks  CNNWarner Bros. Discovery restarts takeover talks with Paramount Skydance  CBS NewsAfter Censoring CBS, Trump Will Go For CNN  Washington Monthly",
    "published date": "Tue, 17 Feb 2026 23:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQb19oX3phdEdfb1I2ZnEtcFUtcEI4NTRBN3A0a2NoMjMzeXdibzdqMGtmYmJ2cWhHOXFqd3VtNkIyMkRrLV8xb0ZOdUo4XzlCSmY1VC1tNTNDbGM5ZmdtWGJFZGUzWHEyaWdaai0yVGMzY0lrdEJKenFaV0Y4MUhOUVVjYkxSdWREN0pTQnVoS19odGE0dElOUUhlQWJJMHBsTmRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Toyota’s C-HR electric hatchback starts at $38,135 - The Verge",
    "description": "Toyota’s C-HR electric hatchback starts at $38,135  The VergeDriven: 2026 Toyota C-HR Has EV Hustle, Lacks Dynamic Delight  Car and DriverThe Toyota C-HR is back as a sporty AWD electric SUV, but there’s a catch  Electrek2026 Toyota C-HR First Drive Review: An Entry-Level EV That’s Actually Fun  The DriveI Drove the 2026 Toyota C-HR EV: An Honest Review of Toyota’s Compact Electric SUV  Autoblog",
    "published date": "Wed, 18 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQaURPQXI1NlEybWpKbGRTNDNqNm12NDZjNUZ4eGw3UUVETk9VRW5xbnN5RGliVWpvRkZoRVctUmRmU0lmUndGd1psLUFJNEN2UHBZbFRNLVVLeEZiODJrXzdGakc3QW9pZU1LR3d6UW0wYllDTjJlSXJuY3dTUGk5YzZiaWU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "AMD Sell-Off Shocks Analysts as Data Center Demand Sets New Record - TipRanks",
    "description": "AMD Sell-Off Shocks Analysts as Data Center Demand Sets New Record  TipRanksAdvanced Micro Devices (AMD) Surges on Strong AI Chip and Data Center Processor Demand  Yahoo FinanceIs AMD Stock a Buy Now?  The Motley FoolWhat Will Power AMD Stock’s Next Rally?  ForbesAMD Stock: $300 Appears Imminent; Why I'm Buying More (NASDAQ:AMD)  Seeking Alpha",
    "published date": "Tue, 17 Feb 2026 21:41:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTTFhalBWMUJFZHU0bC1RS3pObndJNmJERjI1cXNpNWFRWG9zWkpSRkVuOUFzSjBXMG1XdkJRa3lpUW1KNS1FZGlFa0JySXVSMUVSMkFqY21lLWVRY0ltUjlyTHZWa3EzQjBVVENYZklGVUdOYno0b1ZjUHRrc3h4RnRoeUdjaDdiZ051aFRzUlUyYWU1Y1l0V2xYY1g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "Oil Prices Surge 3% After Russia-Ukraine Talks Break Down - Crude Oil Prices Today | OilPrice.com",
    "description": "Oil Prices Surge 3% After Russia-Ukraine Talks Break Down  Crude Oil Prices Today | OilPrice.comOil rises 4% on Iran-US tensions, Russia-Ukraine talks end without breakthrough  ReutersOil prices jump as traders watch talks between Ukraine and Russia, US and Iran  Yahoo FinanceGold Hits $5000 as Russia-Ukraine Talks Stall, Oil Jumps  BullionVaultOil Futures Jump on Rising U.S.-Iran Risk Premium  The Wall Street Journal",
    "published date": "Wed, 18 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPaHNBZzJ6WEpFY1lZbzBHRjZnbHRkUHVYVklxcy1RelBRNFdKRGFNY3F0Z2ZuVm5nTFpMR3pDNk4xSlE2WUI0cmV5N091RFRaQ1dIX1dvRll0WUlDbmphMlQ4bm1NTHlNWktIbEVMSG5yOUJBcXdWSmJTR3hZamdRTDN0TjJyVHN4Snd5Z3NwRnp1SGtVNXBlMXcwSWJ2eTIwSnlOcjl0eFp2QdIBrwFBVV95cUxNc3RuM19MODF5V3U0NnV3YkZDTVNtVDBXNFBfN19ObGVGbnhWS1gzUnM4dXJwT1lUMUZJSmRiOUpoM3pSblVvb2JQNTNON0pKS3EzLXFXWmk3MjYzMy1Oc2J1T0xGQ0RSU0gzSV9lRk14NkZkb0t2NmxkRlF4SXphYXc0cEVPRm5YR0cxaWptVHFwN2lmY1ZMNW4zUTBsNHh0M3FVeWdCSW5WaU5Hakgw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilprice.com",
      "title": "Crude Oil Prices Today | OilPrice.com"
    }
  },
  {
    "title": "This Is the Best Date to Book Flights for the Lowest Fares—and No, It's Not Tuesday - Travel + Leisure",
    "description": "This Is the Best Date to Book Flights for the Lowest Fares—and No, It's Not Tuesday  Travel + LeisureThe cheapest day to fly just changed, and it's not Sunday like everyone thought  FOX 13 Tampa BayThe cheapest month to travel in 2026 revealed - and there are international flights for under £100  Daily MailSan Juan joins global cities in Expedia airfare trends  News is My BusinessCanadian Destinations 2026  Travel And Tour World",
    "published date": "Tue, 17 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5reHFNREI3N1dXOWxkVkxnVmVqbk16anJoOXBHNWE5Y21YQUZWMHU5OFBKM2J5YjIwYWZ6M28wc3Q3UVEwRk5sSjVxcnd2dGljTjFFUVctUVE1bUlDZTFqM0Rla09GV0h1aUpYbXJGekF5S0ExT25TTWJWeU5SV0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.travelandleisure.com",
      "title": "Travel + Leisure"
    }
  },
  {
    "title": "Bayer agrees to pay billions to settle Roundup lawsuits - DW.com",
    "description": "Bayer agrees to pay billions to settle Roundup lawsuits  DW.comBayer reaches $7.25B settlement over Monsanto's Roundup accusations  AxiosBayer falls 7% after proposing $7.25 billion settlement in Roundup case; European markets end higher  CNBCBayer proposes $7.2 billion settlement to resolve Roundup weedkiller cases  CBS NewsBayer proposes $7.25B plan to settle Roundup cancer lawsuits  Fox Business",
    "published date": "Wed, 18 Feb 2026 03:11:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFAtdEpqMERpMWMwVEpTQVo4VzIzWkpJQXpjNjZUSkt5VldxamNFanNJcXM2UzFoRHFTS1kyVE1CdUZYdGFrTTloZGl2OGdURlR4TTRIZkhJWGJXSjhPVi1xSVNqeEY2eGdoRF9oXzRHQmhpd1pmVnZDWURvbnjSAXxBVV95cUxOdnUweDN5ZUgyQy1uWFc5N3hHS2xXRm9oYUx3Sk9sSnVxS1REalNfZGNYMjdmanVubXI5VklXWWtZY1luR1Q5SVNJNVI4WS1wMzRhR0NyVjN2ZGZZeFEtdXFsSXAtRWlzLUxNQ2k3WnhkNjBULXBQRGxCVEsz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "US and Japan unveil first mega-projects under $550bn deal - Financial Times",
    "description": "US and Japan unveil first mega-projects under $550bn deal  Financial TimesTrump lauds Japan’s pledge to invest $36 billion in U.S. oil, gas and critical mineral projects  CNBCTrump Hails Japan’s First Batch of U.S. Investments  The New York TimesUS and Japan unveil $36bn of oil, gas and critical minerals projects in challenge to China  The GuardianSoftBank to form consortium for $33bn 'Trump deal' power plant  Nikkei Asia",
    "published date": "Wed, 18 Feb 2026 05:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBwQjA5YVVXRWpYZ2RQZS1VdVQzSTNqejZKRmgteHlBMFNQbnBCX081c2FzbVFfRmJHaTAySmswZE9SWFhDTWNTVHNNZktLem4wZzFpdjFBZl9UUkxKWXZabmNhc0phYWJpeHZXWG5ERDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "IMF urges Japan to keep raising rates, avoid reducing sales tax - CNBC",
    "description": "IMF urges Japan to keep raising rates, avoid reducing sales tax  CNBCJapan's junior coalition head warns against political meddling in BOJ policy  ReutersIMF urges Japan to avoid lowering consumption tax  Japan Wire by KYODO NEWSJapan's economy resilient but faces debt and inflation risks: IMF  Fibre2FashionJapan Special Corporate Tax Relief Tops 2 T. Yen in FY 2024  nippon.com",
    "published date": "Wed, 18 Feb 2026 01:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOa3ZZQ2NFckhQalFsVWZMVHZmSWotVk4xanFYZmx1akVDSHkzNmQtSDd6WlB1S2tzLWZfUWR0RWp5NWQ3SXBYT2FoWlZ3VDRNVktuZmdsQVBfU19oU3VRd3JoRWxWSDg1V3daenNON2s4V1NrYVhVZWFLSHlVMTNjYUtmaU1CaGxyVDRQWkU1cVRBNzhCSlZwcE1kUGZDRmlN0gGmAUFVX3lxTE1RRnYyUUw0TVJDcGhjTDZsZmk1TFc0SU9pME9kUl83Z19rQXlUUGNyUUtWYlY4WDRnYnBpYnk2dmN0YTJBRVRvbzZQSFZ0V2ROT21qejkzNXNsaWFubk1jQWZwMkdPbjB1dVlnMmUzckYzVnpqVmkydndDUHFqR081eWNhVWxlTU5ZdzhSM1RFLWNEbEN6b3BQNHFFa2l2eWVsUHo2QWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Warren Buffett's company invests in The New York Times 6 years after he sold all his newspapers - Associated Press News",
    "description": "Warren Buffett's company invests in The New York Times 6 years after he sold all his newspapers  Associated Press NewsView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 02:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNS0N6c2JEaXVObWhOMnlSUS15N1U1Z3d5Yks2WXM3ZktETFRueGlyMEJJY2xzZTVwdklRNnJ0aGdRbnQ2S1MyWDdwYV9XT3N6WjhzQ3FxaDFiQnowdHJTTHdYTFdYTjFRWEtWYVBLZEJyVmt3eVhVM2tBT19HZnIxdDcwNExlMlZOUURPdnRuS3RzUTdGQVMxcjJTWXJwbldKbjlQM2RQa1hzX3BYd3h3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "‘He’s jumping in all the way’: A Trump financial regulator backs prediction markets in their clash against states - Politico",
    "description": "‘He’s jumping in all the way’: A Trump financial regulator backs prediction markets in their clash against states  PoliticoUtah governor blasts Trump regulator for blessing prediction markets  The HillCFTC chief sides with prediction markets over state regulators in a high-stakes court case  NBC NewsKalshi, Polymarket: Prediction markets raise new tests for CFTC  AxiosSurging prediction markets face legal backlash in US: ‘Lines have been blurred’  The Guardian",
    "published date": "Wed, 18 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNX3hNc0hjMW1FVW5WaVZOSnhIcmlMQjYxc1gycEdZWkczSXFPeUF0ZVh6SWg0RERvbVE1eXoyN2FyY0J0R2VQbmt0ZjZDY3BNRFpxMk5hZm4tNDl3eDdyM2tnSGFxN19udmV0LVlJbmpwbzI2cUh5WU5YZVdvYWVHRi04U2hlUnNVMm5tdE5n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Employers find new option for workers' GLP-1 demand - Axios",
    "description": "Employers find new option for workers' GLP-1 demand  AxiosGoodpath Expands Direct-to-Employer and Self-Pay Access to Wegovy Through Novo Nordisk Collaboration  Yahoo FinanceAs Insurers Drop Weight-Loss Drug Coverage, Vermonters Lose Access  Seven Days VermontWhat’s next for GLP-1s?  Harvard GazetteOral GLP-1 Pricing Varies Widely Based on Coverage and Access: Eric Levin  AJMC",
    "published date": "Tue, 17 Feb 2026 14:30:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1tdlBiMV9aVkQzWlE4dkIzdEY3MFF0TGhVVlVPQjBaaGYtQzNuREJvSVo3SDFlQVdVbkNpWGZWZlYtbjhFVlF5MmZnSm9fSHRIbmFXeTlyZ1g4eDdJWkh5LWpJWEF5dGVXUTZYQWx0VF9lLVRzODl4TEpXRF9kdjg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Lower food and fuel prices drive inflation down to 3% - BBC",
    "description": "Lower food and fuel prices drive inflation down to 3%  BBCUK inflation cools markedly in January, boosting odds of Bank of England rate cut  CNBCBank of England to cut rates in March, timing of further cuts unclear: Reuters poll  ReutersUK inflation rate falls to 3% helped by cost of petrol and bread  BBCU.K. Inflation Slowed in January  The Wall Street Journal",
    "published date": "Wed, 18 Feb 2026 09:16:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBQaFZiV2NpM0x2NFBVRnFqcjlWQThOVjZDLVFYaWM5NVVBUjhxNmN1RFJ5dERyLWd3V01HVXJCUW5rXzlVNGk1TTlwRDI5TzV2QmtIejRiaE5YZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Whirlpool to cut nearly 350 jobs at Amana, affecting more than a quarter of plant staff - KGAN",
    "description": "Whirlpool to cut nearly 350 jobs at Amana, affecting more than a quarter of plant staff  KGANWhirlpool to lay off around 400 workers in Amana  KCRGWith Amana layoffs, union accuses Whirlpool of moving jobs to Mexico  The Des Moines RegisterIAM Union Condemns Whirlpool’s Latest Round of Layoffs as Pattern of Corporate Abandonment  IAM UnionWhirlpool Corporation (Amana, Iowa) WARN Act Investigation  Strauss Borrelli PLLC",
    "published date": "Tue, 17 Feb 2026 16:14:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNdFhIS0xXZXp0eVNsLU9KZU1kMjJlXzNqSlpycl9zZHo5YktPdlJ0a1h6bm05ZjlRRktKSXhHWHlZQTFkM0N4OG1ESmFyM21wNEhwYzFlMGM2TmY0b3ZHT0ZLLXlzcTBNVlRvX29ROGl0dHJkTzV2eG1CUHJRY09UMk5MSzJKTlVHb3RXY3VubUtxamphYXVBSmJiTEdIQjRmVkpFQXpfZ2NYRkFVNl9RNFhiLXVXSHB5LUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://cbs2iowa.com",
      "title": "KGAN"
    }
  },
  {
    "title": "VW Group Delays Scout Motors Launch Until at Least 2028: Report - The Drive",
    "description": "VW Group Delays Scout Motors Launch Until at Least 2028: Report  The DriveAmerica’s Most Revolutionary New Pickup Truck Just Got Delayed A Whole Year: Report  The AutopianScout Motors Says Revival Is ‘Full Steam Ahead’ Amid 2028 Delay Rumors  AutoblogElectric Trucks: Ford teases affordable pickup, Scout responds to production delay  driving.caScout Motors Fires Back At Report Claiming Production Delay  Motor1.com",
    "published date": "Wed, 18 Feb 2026 19:41:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdFU2MEo3ak9JZjBnbm9yNnNKRWEyTm93LXJ0ay1FWm9rUm1IUGN3TC1SdWtiRzV6cjZvOTJHaHJOLWp1S0VhTFpYZnZoX05kNVRDdkdJR1NTdlZYVnNxOV8wTlRwZ0hNMExTd2ZoeHZXcEJtWjNVYzZKWVpfWDcyZ2hSZmM1QXhxa19qV0ozZnZnaTZ5S29B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedrive.com",
      "title": "The Drive"
    }
  },
  {
    "title": "Regretful MAGA Senator Hits Breaking Point With RFK Jr. - The Daily Beast",
    "description": "Regretful MAGA Senator Hits Breaking Point With RFK Jr.  The Daily BeastTop Republican eyeing FDA overhaul  The HillThe Cassidy Report on the FDA  Marginal REVOLUTIONSenate HELP Committee chair pitches proposals for FDA reform  Fierce PharmaSenate HELP Report Maps US FDA Reform Agenda Ahead of User Fee Reauthorizations  Citeline News & Insights",
    "published date": "Wed, 18 Feb 2026 17:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUU8ta0hxQjZsNUxwUlRlS0kwRTZJTm5VNEROQTdrQUUtSnpmLUI3UTljZGpSNHRaSlkyZURBd1lZVmpQeGt0Z3ZSRTBrQWk2cUJ0LXZjemdXME1uV3M1Q1JHcExlelhLZlhyaUZWRlRRbG9zd1hPX0lDY2FxSGc2TU9zanhSa2pKclVIYUNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Palo Alto Networks Lifts Revenue Outlook as Second-Quarter Profit Jumps - The Wall Street Journal",
    "description": "Palo Alto Networks Lifts Revenue Outlook as Second-Quarter Profit Jumps  The Wall Street JournalPalo Alto shares sink 7%, CEO defends cybersecurity's position as AI hits software stocks  CNBCPalo Alto Falls As Fiscal Q2 Beat, Guidance Underwhelms  Investor's Business DailyEarnings live: Wingstop stock surges on Q4 earnings beat, Garmin spikes, Analog Devices rises  Yahoo FinancePalo Alto Networks cuts annual profit forecast as deal costs bite, shares fall  Reuters",
    "published date": "Tue, 17 Feb 2026 23:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPTHNxNDRKSHB1SHNRZ2tHbmdHNFZVSWNmM1VWOExpSzVMaTR1NVU4azhzaEJoODVVMG9RWWp0d3JFdzJjc2dxdE85b2dWU0pfOWlaRnQ1SXlmZ1NrS3l5azNhLVRlcnJJZURQTlU5MUFla1N4aUNIZVFHcHVFRjltbXkzX0hIeTBkbnlwSVpLY3NxSWZKeEZ5bGFmU3duSTItODBqWFVFQ0E3bmZKalotdGhZVS1VZUZnWWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Meta commits billions to Nvidia chips - Axios",
    "description": "Meta commits billions to Nvidia chips  AxiosNvidia and Meta expand GPU team with millions of additional AI chips  Yahoo FinanceMeta Builds AI Infrastructure With NVIDIA  NVIDIA NewsroomMeta expands Nvidia deal to use millions of AI chips in data center build-out, including standalone CPUs  CNBCWhy Nvidia’s deal with Meta is an ‘Intel killer,’ according to this analyst  MarketWatch",
    "published date": "Wed, 18 Feb 2026 18:26:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBNcEhGN09uYm5VZ241VG0zR1RJaGZRWkdQd3VWNWhWMkhXZE5PMlJSdkhZUDc2Qi1tQlRiNTZXY1N2VFNhSFlsa20zRnJ3QUxxWFVfY3NET2VsTEgzZDhYM0VfUm5OVURs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Stone, parchment or laser-written glass? Scientists find new way to preserve data - The Guardian",
    "description": "Stone, parchment or laser-written glass? Scientists find new way to preserve data  The GuardianLaser writing in glass for dense, fast and efficient archival data storage  NatureProject Silica’s advances in glass storage technology featured in Nature  MicrosoftMicrosoft’s Glass Chip Holds Terabytes of Data for 10,000 Years  GizmodoMicrosoft’s new 10,000-year data storage medium: glass  Ars Technica",
    "published date": "Wed, 18 Feb 2026 17:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQblg1bWRibFRka2FCSGVfLVBuM2tFU19Jd2c3V1I5OEFSRk1OMjdhQmNvWUtydEpYMWJQREhXRFRGSENndHBkWmI0OTRPMmlxZndnYVR4cDlBVVVzOXg4LTB6d01NVHBfYmtjMzZBNjZtaTlFdFB4dk9KMW9vTXJudFU1ckxjMk9UbDRxclhIZmQ1X2RQOWxvTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Shein’s ‘addictive design’ and illegal sex dolls under investigation - The Verge",
    "description": "Shein’s ‘addictive design’ and illegal sex dolls under investigation  The VergeShein under EU investigation over childlike sex dolls  BBCEU Investigates Shein, Citing Potential Illegal Content Risks  The Wall Street JournalEurope probes Shein's addictive app design and illegal product sales  EngadgetThe EU’s war on fast fashion  The Week",
    "published date": "Tue, 17 Feb 2026 15:10:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPQzFhZ25xcFpzWHhfcjVMM1NPUEFSUjNJd3YwR0VlTHE0QWw4emRqemVvekFPaEhuX0lHNldUTEswZ21MS0c1bWd3bTdISDU4V3pKNE1VVmlKdzB4T1RZclQ5UktLc2lLc1k5T0NuRlNvN3puWG1NZlBCeXBXYVN3UmM5R2FjYkw2UUZGbzRLOTJtTXFTeHQzNWp1ZGlNeEp4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Trump crackdown drives 80% plunge in immigrant employment, reshaping labor market, Goldman says - Fortune",
    "description": "Trump crackdown drives 80% plunge in immigrant employment, reshaping labor market, Goldman says  FortuneWhy Trump’s immigration crackdown isn’t boosting hiring  CNNOpinion | Mass Deportations Sabotage the Economy  The Wall Street JournalUnauthorized Immigration Effects on Local Labor Markets  Federal Reserve Bank of San FranciscoOpinion | What Replaces Deported Immigrant Workers? Not Americans.  The New York Times",
    "published date": "Tue, 17 Feb 2026 22:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPdzBMV0IwSzMzOEpZMnNQYUMwWnFlUUlVdEhyelhVdWxoTW95ZGdzZ3dyWXF1NGlvU3czMW9NaklhaWFRYVNWNjVxNjZWVHcwLVlubFRfeEtjWGtpTXNyaWdXVG9xLV83SE15aWZBUW1XcWsyb0QxRkxSUHdPckZsM1c4MmNaM0RiZHd4ZnA1akQyX0RPeEtDRnBYUGtKSG03UXJXd3Z6dTAxaFFXRVFqNXNHZFdxdU1T?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Polestar’s Surprise Move: An Electric Wagon For The Masses - InsideEVs",
    "description": "Polestar’s Surprise Move: An Electric Wagon For The Masses  InsideEVsA New Polestar 4 SUV Is Coming, and the Brand’s U.S. Fortunes May Depend on It  MotorTrendPolestar starts largest model offensive in its history: four new cars in three years  Polestar MediaPolestar's Next Big Move: More Physical Buttons, More Actual Colors  InsideEVsPolestar aims to shake off EV doldrums with 4 new models in 3 years  The Verge",
    "published date": "Wed, 18 Feb 2026 11:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5IbDFyOXN2Q21HVGxsUlRKWnpvRGlpaGs5bkhUM0FyV1FKcGtUZkRnNnI1UFAyNTZ1Q3dJOGotVkxiMlQ0LWlUeWVsNDFuNEpoX2ktTzMtSmVXZXVhRFJrb096SWpFQ0ZTT0NQXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://insideevs.com",
      "title": "InsideEVs"
    }
  },
  {
    "title": "Ethiopia EV Boom Sparked by ICE Car Import Ban - Bloomberg.com",
    "description": "Ethiopia EV Boom Sparked by ICE Car Import Ban  Bloomberg.comNigeria and Kenya lead Africa’s push for electric vans assembled from Chinese EV kits  Associated Press NewsWhy Ethiopia Is Smart To Ban Gas-Powered Car Imports  The AutopianEVs could be cheaper to own than gas cars in Africa by 2040  MIT Technology ReviewRideence To Start Local Assembly Of Electric Vehicles At AVA Plant In Mombasa, Kenya  CleanTechnica",
    "published date": "Wed, 18 Feb 2026 01:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQZE5xUmlWb05vaVRtaDBGVVpxalVUbVBWd3ZnRHFxa2EyWk1yMzlPYzRxM1owUFp5RHNydGVfTkc1bklxdFlBcl94YjhRdWZ6V29ldWNqcGxLSUQ2endnS2FNdmUzNVdHcmkxaktidGdtbWYtZURqSWt1d2pjb05oQXZpbV81NFRoZjZvVkxreG1xU2UxbzBiT2NaaHItUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "US Agencies Have Developed Critical Minerals Price Floor System - Bloomberg.com",
    "description": "US Agencies Have Developed Critical Minerals Price Floor System  Bloomberg.comThe US is merely the latest to join the global rush to hoard critical minerals  The GuardianUS faces 'decadelong' road to loosening China's grip on rare earths  Nikkei AsiaWhat is Trump’s Project Vault?  The HinduProject Vault: Trump’s Bold Plan To Stop China From Starving Our Military  The Heritage Foundation",
    "published date": "Tue, 17 Feb 2026 23:33:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNZXl5WFE5UGp1SEhmRUlyc1pvYkQ4YXpFMC1tcmxTWEZMZmx6R3JGRFBCS2dPV3U5dTQ1UDFKODZINXNidzNMbndjbTk0VTRIVTdSMklrZFg5eVZiWFNta2xTbjlIV0I5NGZFOXZLaEJLS0Y0VTNfT3doODhXOHZqd2tGMnZxODVSeVpPaFdPYk83QzNNVGFrVkNkNWFrZ2plRnh6QURJeEpsbC1fbWQ5c0hGZ1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Top tech investor calls software selloff a ‘generational’ moment to buy - Fortune",
    "description": "Top tech investor calls software selloff a ‘generational’ moment to buy  FortuneDan Ives Calls AI-Driven Software Selloff 'Most Disconnected Trade,' Says Salesforce And ServiceNow Are Historic Buys  Yahoo FinanceSoftware Stocks Lure Retail Dip Buyers at Record Pace, Citadel Securities Says  Bloomberg.comThe great software stock meltdown  Financial TimesThe software sell-off, part II  Financial Times",
    "published date": "Tue, 17 Feb 2026 17:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPWFpwZENoWmFoME9XR2lJMkV1SmtZcFowTmJaMG9oRVU5WGNyWGpSdXM2UzcyRGlPTWJMUzVkeGJMOXBuZm9wbVNJSk03MVRQZkpLLXRQb3lGdERKMUlkQ284OTl5ajNoTHpwcHhNdVQtWUdHakVWZnZNLTRTNktDRGJZa29aRnlnWDJRSkg5Vk1YWlBxUy1GZjMtZHFyTjUyekE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Federal Reserve Wants To Loosen Bank Rules To Boost Mortgage Lending - Realtor.com",
    "description": "Federal Reserve Wants To Loosen Bank Rules To Boost Mortgage Lending  Realtor.comThe Fed wants to ease regulations that caused many banks to stop making home loans  marketplace.orgFirstFT: Fed set to loosen bank rules to boost mortgage lending  Financial TimesFed proposes rules to bring mortgages back to the big banks (RKT:NYSE)  Seeking AlphaUS Banks to See New Mortgage Capital Requirements in Basel Plan  Bloomberg.com",
    "published date": "Tue, 17 Feb 2026 18:33:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPbE5sV0d6Mmpub0ZWUU5KUEREbEpLNkxzRkoxLU5yX3Z1TjdxbFZqWDhURVFmNFBKaGd4Qk1oUWJXTGQ2eTNTdjNfbUF5SHZ3VElQSWtuSjBnZGxvWDNURF9kZnl1TkE2cTBiVzQxeUU4T1NDYmprZVljaGxudVdSZk1UdUNlRm9HQm1lLXNVaWVOWDVJQVg2aVpYZEVOdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.realtor.com",
      "title": "Realtor.com"
    }
  },
  {
    "title": "The US economy is turning - Financial Times",
    "description": "The US economy is turning  Financial TimesThe ‘one-legged stools’ holding up a fragile economy  The Washington PostThe Goldilocks economy, if you don't look too close  AxiosThe Economy May Have Stuck the Soft Landing. Nobody Wants to Jinx It.  The Wall Street JournalEconomic Growth Does Not Point to a Recession  ismworld.org",
    "published date": "Tue, 17 Feb 2026 12:30:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1hYlFFMURCVVRFODRfbWV6dmRvMmh4VFJXU29xeVBnVXBrVXZxLWVMSEg5bGl1ZTlrQWhOeGQtczdaVUxsX3RJaTREWTh0S0hjLWJFSURxR0hxeFUwbjJFOHp4WUs1cmMxcEl3LTNWLWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Texas becomes leading test ground for small nuclear reactors - The Texas Tribune",
    "description": "Texas becomes leading test ground for small nuclear reactors  The Texas TribuneIPO CLUB SPOTLIGHTS TOP SMR COMPANIES FOR PRE-IPO INVESTORS IN FEBRUARY 2026 SURGE  openPR.comEnergy firms work to unlock next-gen power source with incredible potential: 'There could be a global fleet'  Yahoo FinanceNRC Intervention Tests the Data Center Case for SMRs in Texas  Data Center KnowledgePer Capita: Small modular reactors, the new big thing  The Davis Enterprise",
    "published date": "Tue, 17 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQTkwtMDdTUGNSMlYtcnVsLVhxVjJ0UFhUTmx3NmdEU3EtMjZDOFZYdlpGVG5rSm5CTkhfQXlSblFrdDlPMWNsSjU3d25OV2JNMmlGa3BycU5teUtaUUpHLTY3LWtIdFQ3MHo1UEFBR0dTNjhXNWxvR3AybGk2R2h5SnhHTTNKWkl5NklXaHRxNmp0eGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "‘AI Disrupting AI’: Top Investor Warns Palantir Stock (PLTR) Could Be in Trouble - TipRanks",
    "description": "‘AI Disrupting AI’: Top Investor Warns Palantir Stock (PLTR) Could Be in Trouble  TipRanksWhy Palantir Technologies (PLTR) Stock Is Trading Up Today  Yahoo FinancePalantir vs. Nvidia: Wall Street Says This Is the Best AI Stock to Buy Now  NasdaqEarly 2026 selloff is helping Palantir’s stock win over Wall Street. Another analyst just turned bullish.  MarketWatchPalantir Obliterated Expectations And The Stock Sold Off: Mispricing At Its Finest (NASDAQ:PLTR)  Seeking Alpha",
    "published date": "Tue, 17 Feb 2026 20:31:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQbWVIdXhPM0k5Wmx2QlJ5MlUtWTVsaWVnSzdhbm13aFl3cWQ1ZExBbXZkRTlyZDJfODdPY19La2xnSm9iVEFXQm42RW9kQVU1QzhmSldtR2tDZ0NYT1FFU3NTVURwc3lwZW9hcHd4b0JLRnh4cE5EaUl6eFRLMnhqV0VoVUtiTE02Q3lXa283bVZ4bzlrSEVacDgwbEtGUk1JQ3ZsUmQzbWk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "Masimo to be Acquired by Danaher for $180.00 Per Share - Business Wire",
    "description": "Masimo to be Acquired by Danaher for $180.00 Per Share  Business WireDanaher closes in on nearly $10 billion deal for Masimo, FT reports  ReutersDanaher to buy Masimo for $9.9B to boost diagnostics portfolio  MedTech DiveDanaher to Buy Medical Tech Firm Masimo for $9.9 Billion  Bloomberg.comMasimo Founder Joe Kiani On The Healthtech Company’s $10 Billion Acquisition  Forbes",
    "published date": "Tue, 17 Feb 2026 13:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQenZWOTBsSWN0UlVhakR6YXhfblZwXzFKblJoRy1GcjliWktjbnJmYUlRX0pjdllhYjlsV0tjMEE1c2MxUUxNVkdiQ1JzbFF0ZS1mOHFLa2wxdkY1dEVPNkhnWmlnTlVnYnRRRkZ1ekJsTTdjdXFzRDBNVGtncEdaNlJBRWpEaTBLekJsOE5Bd05zYlJOLWVHUkZKb0Vna2lMQWx5ZV8tVDFNNGJkLXl4cWt0QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businesswire.com",
      "title": "Business Wire"
    }
  },
  {
    "title": "PSA: YouTube confirms ongoing widespread outage [Update: Fixed] - 9to5Mac",
    "description": "PSA: YouTube confirms ongoing widespread outage [Update: Fixed]  9to5MacYouTube was partially busted for a while, but it's fixed now  PC GamerYouTube restores service after brief streaming disruption  ReutersYouTube went down — everything you need to know about the major outage  Tom's GuideYouTube Down for More Than a Hundred Thousand Users, Downdetector Reports  GV Wire",
    "published date": "Wed, 18 Feb 2026 01:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE05Rmg4TWZ6SUR5Vm9kUDRsdGFMbXRrN2NTWE8zbXNTTC1OZDBTN0VWVVpxb25yQTBZa2xEYkMtWmpKRXQwWFNiak03bGFGODhJVHVLQVpjM3JQRzlfUXBNT1lraG9DVS1NSWYtSXVrdWRvejZwVUNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Steam Game Developer Wins ‘Patent Troll’ Trial Over Inventor (1) - Bloomberg Law News",
    "description": "Steam Game Developer Wins ‘Patent Troll’ Trial Over Inventor (1)  Bloomberg Law NewsValve Wins Trial Against \"Patent Troll\" Inventor  Yahoo FinanceIn the case of Valve vs Rothschild, it's an outright win for Newell's company  PC GamerValve wins $152K in court after “patent troll” breaches portfolio deal  DexertoValve's Trial Against Accused Patent Troll Begins In Seattle  Law360",
    "published date": "Wed, 18 Feb 2026 00:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQYXZQdVB4S1hORkhYVWpfZUJZWlpCejR1ZldESlh2VVp5UU4yX2lEeTktUkNSTDBuakNLQWd6SDJiYTR5aHJ2RHFveFVWVkFxa1J6YmhNUDhucjVMQUs3NEFsWG9TT2NUU1dqcUpxSTd0VHdfRTlHb0p5OU9Benh2QkF5YzV3cldWSk51TTVkQ2R3UXVhNF9yek9ENVQ2NDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.bloomberglaw.com",
      "title": "Bloomberg Law News"
    }
  },
  {
    "title": "Infleqtion CEO Matt Kinsella on how the newly public quantum computing company is “following in the footsteps of Nvidia” - Sherwood News",
    "description": "Infleqtion CEO Matt Kinsella on how the newly public quantum computing company is “following in the footsteps of Nvidia”  Sherwood NewsInfleqtion to Begin Trading on NYSE Today  The Quantum InsiderQuantum Firm Infleqtion Jumps in Debut After Klein-Led SPAC Deal  Bloomberg.comQuantum Computing Stocks: Infleqtion Pops In First Day As Public Company  Investor's Business DailyLouisville tech company raises $550M as it goes public  The Business Journals",
    "published date": "Tue, 17 Feb 2026 21:42:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQaUc5WmJxTXl4UTdSZzRHeVBJenNpRkFTbjUwT2tZMzBnTUZja1RkY3h0UnBMc3hicUtiaDdUVzliWktOV0tqMjBmeXc2bWtibExnRDdjLVBBNzFvcm5HU1puRmFPRU1SUTlmellYd0NhNjJfNkhCVmc3d3lFR1lQTng1LS00WmtvQ2R3cVh1ckdIWGJ4M3RvQWxiLU1vX0lQTVN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sherwood.news",
      "title": "Sherwood News"
    }
  },
  {
    "title": "Compass says its psilocybin drug helped patients with severe depression in two trials - statnews.com",
    "description": "Compass says its psilocybin drug helped patients with severe depression in two trials  statnews.comInvestors cheer Compass’ psilocybin data  statnews.comCompass, with Phase 3 hits, ready to take psilocybin to the FDA  Yahoo FinanceCompass’ Psychedelic Shows Durability ‘In-Spades’ as Path to FDA Clears  BioSpaceCompass guides psychedelic therapy to 2nd pivotal depression win, triggering approval push  Fierce Biotech",
    "published date": "Tue, 17 Feb 2026 23:35:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQaTJQZHJReFZjUUlrelJBZ2RBSmlmZnFnQTYxZnZJWEktQnZUSndvR2MyTDlnSThRbTVWOFRZTGVLd2kyeVNNdzB0N0s2QkZ0UU1EU3hZMzlBNWZ0YzVnTXV1cGFTalphZERaMU5VRGppRkUtQ0R4S1BvR0FWWHE0NmJFQlBBc1pZN2dBU0dyc2wzR2Rzc1duSGlIZVZHMGVCNFRqS2RyWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statnews.com",
      "title": "statnews.com"
    }
  },
  {
    "title": "It's Time to Get Ready for Walmart's Earnings. Here's What's New at the Huge Retailer. - Investopedia",
    "description": "It's Time to Get Ready for Walmart's Earnings. Here's What's New at the Huge Retailer.  InvestopediaWalmart to tread with caution into 2026 as Furner-era begins  ReutersThis retail giant’s earnings report could offer investors an attractive entry point this week, says Jay Woods  CNBCWalmart Earnings: The Newest 'Tech' Stock?  Zacks Investment ResearchWalmart To Report Results, Fresh Off New Highs, A New CEO And $1 Trillion Market Cap  Investor's Business Daily",
    "published date": "Tue, 17 Feb 2026 18:54:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQS0w2RHRpaEc0T3ZWalRDZEJlNWhGRG10TFk5QkpTQTNNVERucWJ2c0NkNUNDY1ppdDVuMjB0bXRUUUd1NmNtSm8zMFpKc2g2MHNRVm42TWdWcDRRbm5YandMa19kNnVWWE0zSDd4TFF4VjVJNF9OV1hMdVRKSExRRHpDbHZmVW5FeU9MNjlLVnZSazVPb0lmZ1V2Wm51dXk2ZUNWTXVtVkZ5cEplSlZKcHhCN2wxM2pRWmZQei1USzVpTWN6YXZ5YUJ6djU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investopedia.com",
      "title": "Investopedia"
    }
  },
  {
    "title": "US stocks edge higher after swinging through worries about AI and the economy - Associated Press News",
    "description": "US stocks edge higher after swinging through worries about AI and the economy  Associated Press NewsStock market today: Dow, S&P 500, Nasdaq end higher in volatile trading day as Apple jumps  Yahoo FinanceBig tech stocks lose billions as AI spending fears hit valuations  ReutersU.S. stock futures slump as investors digest ongoing tech selloff  MarketWatchInvestors are starting to sour on their love affair with AI  Axios",
    "published date": "Tue, 17 Feb 2026 23:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdHhjT0NmY1g2STloOWtaVEc0MWU2LUFxdFRwR1pqTkZXV2hRVXpzTlVsbzBncEFfUUo5SWQyNWZqQ25tOVZtbnlUbDhES0tZN3JKMDh5Qkh5MVVsQV91YjJWY3lNbkNTUXNxTGgtYVFkY1JFRGJUWENwZGVvWjRQaEZzeXY5ZzFzNmhBRzYxbzJxSU1MMlgySg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "The financialisation of AI is just beginning - The Economist",
    "description": "The financialisation of AI is just beginning  The EconomistHere's Why Amazon, Alphabet, and Microsoft's AI Spending Is a Genius Move  Yahoo FinanceBig Tech approaches ‘red flag’ moment: AI capex is so great hyperscalers could go cash flow negative, Evercore warns  FortuneAI Boom Creates Blind Spot in Big Tech Accounting - Tech News Briefing - WSJ Podcasts  The Wall Street JournalThe Data Center AI Spending Boom Hides a Dirty Little Secret  The Motley Fool",
    "published date": "Tue, 17 Feb 2026 19:16:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQaWg4LW9MNFdXUEE3V1FGX24tbEJhVVZrQUQxMWVzXzhfV3c0R0VqSzY2NUJudWh5UVQzS3ZoYmwySkgzZ3FteVBhUVBLMzM2WHVoMXdaSXMtTVpYR3MyUUw4dDViQlhTS1JJTzYtUlhxa2taZVNUSnZiTUZNeW5OZnRhRlh1ek82MTFSMGJDaDNiM1Q5N0IxdFVQbUIxbHZobWgxamtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "FDA Announces Peanut Butter Recall in 40 States—Products May Contain Pieces of Plastic - Health: Trusted and Empathetic Health and Wellness Information",
    "description": "FDA Announces Peanut Butter Recall in 40 States—Products May Contain Pieces of Plastic  Health: Trusted and Empathetic Health and Wellness InformationCheck your pantry: Peanut butter recalled in 40 states  USA TodayFDA updates peanut butter recall in 40 states, including NJ, Pa.  6abc PhiladelphiaPeanut butter products recalled in 40 states over 'foreign material' contamination  LiveNOW from FOXMassive peanut butter recall issued across 40 states, including Oregon  OregonLive.com",
    "published date": "Tue, 17 Feb 2026 16:19:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5WX1hvMmh0TFhqWEpFMkcwLVByWkZ3UG41NFI0REZBZUM0dHpNRTJNQl9fbWRkSFBLUy1jM3NkaE83ODJtRkVjUGpwcUVUd0RHT1hILWJjMlVJd1BHcjFCOGFRcHJsRDYwcXdvdmlqbFVPR1VP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.health.com",
      "title": "Health: Trusted and Empathetic Health and Wellness Information"
    }
  }
]