[
  {
    "title": "Asian Stocks Set to Extend Rally as US Shares Slip: Markets Wrap - Bloomberg.com",
    "description": "Asian Stocks Set to Extend Rally as US Shares Slip: Markets Wrap  Bloomberg.comAsia markets mostly rise as investors shrug off weak U.S. retail sales, assess China inflation  CNBCBuoyant stocks pause for breath on signs of softening US consumption  ReutersAsia stocks rise; Australia jumps on CBA earnings, weak China CPI in focus  Investing.comAsian shares advance after weak US retail data weigh on Wall Street  Yahoo Finance",
    "published date": "Wed, 11 Feb 2026 06:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQZXBZTlAwLWtnRnV6RThSVlR3dG1UN3NYSkxSTGlrZTRIUTNxRjlzNzJBQi1LNl8zcDd2RTN6OUVzLUxxNzNjTXpObGVOWkc2M0F2czFHSzlTdFV5ZzFfVXl1ZFdBQUd2X3RiZ0hod0FNV1R2R3V6NFJGcGZJTUxaVmMyVzBNVVVPaWhuZGFKc3hOUGlsQkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Salesforce Workers Circulate Open Letter Urging CEO Marc Benioff to Denounce ICE - WIRED",
    "description": "Salesforce Workers Circulate Open Letter Urging CEO Marc Benioff to Denounce ICE  WIREDSalesforce employees call on CEO Benioff to cancel ICE 'opportunities'  CNBCSalesforce CEO Marc Benioff reportedly jokes about ICE at company event in Vegas  KRON4Marc Benioff makes ‘cruel’ ICE jokes at Salesforce event  Gazetteer SFMarc Benioff 'Jokes' ICE Is Watching Salesforce Employees Who Traveled to the U.S.  404 Media",
    "published date": "Tue, 10 Feb 2026 22:25:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQekt1UGhRQ3YwWmNQSXJqT3Vja1U0U05USWJPbEJrbi1CdHBmWUt2cWVqTHRQdUtIdE9EdXo1eE13T3d0MnNwc0MxVjNmWmVKZkFzMm83eHQxelVrcUR5TzdhSVlDejlTYjBSNF9qem9aMGRPTkxjdGtfR004STNzRTFOZVZxZFcxM0YtUnlQQy1DRnhCSURVcXRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Okay, now exactly half of xAI’s founding team has left the company - TechCrunch",
    "description": "Okay, now exactly half of xAI’s founding team has left the company  TechCrunchMusk's xAI loses second co-founder in two days  CNBCCo-founders of Elon Musk’s xAI join exodus from start-up’s tech team  Financial TimesThe Risk of the Muskiverse's Steady Turnover  The InformationElon Musk's xAI loses second cofounder in 48 hours  Business Insider",
    "published date": "Wed, 11 Feb 2026 01:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxObHNSTVROb1hiMmFjTlc5OUo0U1JwQ08tMXVueGt2OHZvT3NGMmhTWUh2bTdwMmp3dW1KcHoxZGxjWUprWEg3Ukk5d0VhV1Q0WHJSR3JPTnpKdk1weUF6QWM0S2Rkd2RqdmdrZmJQT0pyWXpLNTBvWHFRWHk3M1hadHdYYnJMZWpzWDdQbU9NUUE3WU1sekRHSg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "The Toyota Highlander is now a three-row electric SUV with 320 miles of range - The Verge",
    "description": "The Toyota Highlander is now a three-row electric SUV with 320 miles of range  The VergeThe 2027 Toyota Highlander Will Be EV-Only. If You Want Gas or Hybrid, Get the Grand Highlander Instead  EdmundsPremiere of Three-Row Highlander BEV in North America | Toyota  トヨタ自動車株式会社 公式企業サイトToyota Highlander goes electric; TrueCar founder Scott Painter on his comeback  Automotive NewsSee the New 2027 Toyota Highlander's Exterior, Up Close (Photo Gallery)  Car and Driver",
    "published date": "Wed, 11 Feb 2026 02:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQT2o1dWNqbFFlRGktWFZVMVRCVXVNdXhxbVByd2taWGJWTUdkRjFlcVhzQjIyNVVSXzlTRmRwUzJEektxZ29paWhPWHNFYmNBM2VEZXpHVHNrTDBHajBGY2dTYWU2U0ZhdHVoVXlpTlJHSE1VdWtHS3ZtWFA5aDlDOUZfTWEzNnhSNnBB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "FDA refuses to review Moderna's mRNA flu vaccine - Ars Technica",
    "description": "FDA refuses to review Moderna's mRNA flu vaccine  Ars TechnicaFDA refuses to review Moderna’s application for mRNA flu vaccine, company says  CNNF.D.A. Refuses to Review Moderna Flu Vaccine  The New York TimesModerna says FDA refuses to review its application for experimental flu shot  CNBCFDA won’t review Moderna’s application for first mRNA-based flu vaccine  The Washington Post",
    "published date": "Wed, 11 Feb 2026 01:21:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPWURQMXZ1ejI0N3J3VXRQYnVDYXJtS2NXaU9ZbVdkQnV3RFdPSklManMzOVYyNFJiMG5VOV9RWVItSmxnbjNoSDlCRE1hRkNDeXNYQms1RWlDSTkxZ25LV3ctMm9LUHFZVmZKX2ZLVVYwa2xRZnpWOWcyM3VNR09IMzZaNlRzWWdrS1VSTWdTU0Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "YouTube Argues It Isn’t Social Media in Landmark Tech Addiction Trial - The New York Times",
    "description": "YouTube Argues It Isn’t Social Media in Landmark Tech Addiction Trial  The New York TimesStanford psychiatrist testifies Meta's social media platforms is designed to be addictive in NM lawsuit  Fox BusinessInstagram and YouTube owners built 'addiction machines', trial hears  BBCCan Instagram Ruin Your Life? The Jury Will Decide.  The AtlanticMeta Ran Thousands of TV Ads Ahead of Teen Addiction Trial  Bloomberg.com",
    "published date": "Tue, 10 Feb 2026 21:28:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOcjZIdUJFSUZlcUVsb1R1TjZBUWJNeDlBWDVBcm9odmdzZ2VQTGN1akRuemJyenFPV3VPVUZ3MGU1RV9yeVhzVkdkY2xka3ZpUW0zdUE1Nm4tNmJwdkUyZWRvYmhLaFN2TjBycXowSkxrSGtiWS12LVFFaDYwV2xadXE0V3dWck5zcXp5TXczaEQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "China consumer inflation rises less than expected in January as producer price deflation persists - CNBC",
    "description": "China consumer inflation rises less than expected in January as producer price deflation persists  CNBCChina’s Consumer Inflation Eases, Producer Prices Stay in Decline  The Wall Street JournalChina makes small dents in deflation battle as supply-demand imbalance persists  ReutersChina CPI inflation undershoots forecasts in Jan; deflation worries linger  Investing.comChina’s Factory Deflation Eases More Than Forecast at Year Start  Bloomberg.com",
    "published date": "Wed, 11 Feb 2026 01:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPY2h4bl9MMnpFSHFSek5xd0NFY20wWU85WFFhbi1yNGFORUFUMEw0a2o4MTJmZFlhSW9taVRpR3V2U3dnWllVTXQ1TDd3QTRqQlBnRXJ4X25famkyYlZIUDJzZ3lOUF9tdUJ3Qk5vcF94U0MxU1R5S0Q1bzFrZ2JnOEpOa0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Saks Fifth Avenue to shutter Canal Place location - wwltv.com",
    "description": "Saks Fifth Avenue to shutter Canal Place location  wwltv.comSaks Global to close 8 Saks Fifth Avenue stores and 1 Neiman Marcus store in restructuring  AP NewsNeiman Marcus is closing its only store left in Massachusetts  CBS NewsSaks Global to close nine more stores amid bankruptcy proceedings  ReutersSaks Fifth Avenue, an anchor at New Orleans’ Canal Place since the 1980s, to close for good  NOLA.com",
    "published date": "Wed, 11 Feb 2026 05:23:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNYWJ0VUg5eFozbTFDMjV6LU9MckRWc0QzdjFiR19sNmNPWE82Y2trbVhhSVZ4ZGRWbzluNEtLV3ZjN3RJLXNJQ3hMV2ZUQmJxUElZcFNnNDg2WmRlcWpnblJBMnJrTTBoelJQa0FRaXplN3JCQnVBd2daNXVqZ2Z6QWY2N0pscDFfWDdLaTd1eVlPWTBpRjdUZEVKbU0wREpsM3dsS0VybmhvZC12ZHA1OXVRRW9xTEJFS0V6bU02MVZYWGo5TVpPc3JqNHhpd1pV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wwltv.com",
      "title": "wwltv.com"
    }
  },
  {
    "title": "Dan Quinn acknowledges three empty press room seats for Washington Post reporters - NBC Sports",
    "description": "Dan Quinn acknowledges three empty press room seats for Washington Post reporters  NBC SportsThe End of Books Coverage at the Washington Post  The New YorkerWashington Post C.E.O. Will Lewis Steps Down After Stormy Tenure  The New York TimesBezos Loses His Will  status.newsYou Can’t Kill Swagger  The Atlantic",
    "published date": "Tue, 10 Feb 2026 22:17:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQYmtGUEpRNlNxZ0VPNzdDZmw5RGVOc3U4RlFOSVNTRDg1dzB3QjQ5QVU3MGl2YTBJb19nXy1vV2NHV2tacnNkZzVCYUphaHk2OXFrTy1Zc01LSlBTbkRVb242LUUwNjdfMVZ1WTRlM3V2QlFSYWV0aGs5X2JUNTlWakd0dHVQWjF0SG53dEpKMm1GLWhhbnVseW1MVmlGRGl1M3MxeTdsOEsxY2p0dlkxb1FUUFVDSVJxTFdmeFBadzg0bDhVbjJ3TTQ4WmNJNHJZaUZYZ0N6eVVUTms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Two executives leave, others promoted as new Target CEO changes leadership team - Bring Me The News",
    "description": "Two executives leave, others promoted as new Target CEO changes leadership team  Bring Me The NewsTarget will invest more in stores, cut 500 jobs as new CEO takes the reins  NBC NewsNew Target CEO shakes up leadership, staffing  Star TribuneTarget steps up investment in store staffing, cuts about 500 other roles to help fix customer experience  CNBCTarget cuts 500 jobs, invests more money in store staffing  Fox Business",
    "published date": "Tue, 10 Feb 2026 19:57:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQelhiSDhKa19XSWRHbEI3bjVwYWw1Qmoxd0ZYdWRfMktCbXQwbFVFN1E5amNBYjBsdHNOYXVsY1JPM3Vvd0NZWjdtaXc2eW0xVHdDTFRXdGJoRHBoQUM3cko1MTIwTU9mZktSNkNBZFM5a0VQVDBfNVlDQ05Sa004OTZEd3ZfODI1a24zMG5yNFloUUJNUzNIZUVSZGhObS01VVZYRHNKcGZ1S2hLWFN6a1hEWUQzSGFPUWloTjlTU3FfZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bringmethenews.com",
      "title": "Bring Me The News"
    }
  },
  {
    "title": "Robinhood's quarterly revenue disappoints on crypto slowdown, shares fall - Reuters",
    "description": "Robinhood's quarterly revenue disappoints on crypto slowdown, shares fall  ReutersCrypto winter hits Robinhood’s sales and stock, but CEO sees prediction-market ‘super cycle’  MarketWatchRobinhood Profit Slumps as Late-Year Crypto Slide Crimps Revenue (HOOD)  Bloomberg.comRobinhood Stock Drops 8% After Growth Disappoints in Q4 2025  NasdaqRobinhood Gets a Prediction-Market Lift, Despite Cooling Crypto Business  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 21:09:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOVWVPWkFnYkJMRWlENFpEY3gyUXJxZ0gzQTY0Z0E2dzVlQWhqT0tqVzVQb2JhbXBYVGRQRUo3VnN2cXlJMnhjTlRPVi1KcVZqWXRvemdHX2xsbjhRVGxMaVo0WldMZTA0NEJ5bVVXN2ZTQjFvVDJCLVJTaEc3RFdjZjZBZlN3anplWDU2Z1JRdWM1MmoxTmNSSmVPNmx0NWxnWUZJZmZ4c2MxZzQ5c3ZlcjZpbkxKcWVpLWJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Warner Bros. Discovery Says Its Board Will Review Paramount’s Upgraded Hostile Takeover Offer - Variety",
    "description": "Warner Bros. Discovery Says Its Board Will Review Paramount’s Upgraded Hostile Takeover Offer  VarietyParamount sweetens hostile bid to stop Netflix-Warner Bros. deal  CNNParamount sweetens WBD bid, but stops short of raising its per-share value  CNBCParamount Sweetens Warner Bros. Bid Terms to Woo Investors  Bloomberg.comParamount sweetens Warner Bros bid with offer to pay Netflix break-up cost, other fees  Reuters",
    "published date": "Tue, 10 Feb 2026 17:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPNGFyZU5zT0Y4akJPS2prc2w3Sm03b2QwQTNtTXVLSE1LQjhVMGFETnN5T2xNM1R3WWtpbHF1d2lQS3dOMk01eFRRQ3lpNzFLelZMbFZmeDJoTXd6YU9xS0R5U2l1UGdiQXJ6ZmhoNVlUeTBSY0FvajFUX19Nc3pYQkFSbnJBUGJVb0ZrRkhucWRpd0hkTTd6bmREMVBackpSbkUzQXliZmZTZmJLYXdEZHBaRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "A Study Just Found The Average Cost Americans Paid For Trump's Tariffs In 2025, And It's Expected To Get Worse - Yahoo Finance",
    "description": "A Study Just Found The Average Cost Americans Paid For Trump's Tariffs In 2025, And It's Expected To Get Worse  Yahoo FinanceTrump's tariffs cost American households $1,000 last year: Research group  ABC NewsConsumers feared a Trump tariff inflation crisis. Where is it?  USA TodayTrump’s tariffs cost US households $1K last year: Analysis  NewsNationNew research outlines the impact of Trump’s tariffs cost on the average American household  5 EYEWITNESS NEWS",
    "published date": "Tue, 10 Feb 2026 21:55:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNbU5sM2MzTmRSbXVIT3hwWk01SDdmNVlxYUlvLW9Wam9hYmo1WWY5V1hKeEZYdVNkOFNmT1k5NWpUTVRsMkt0MUp4bGJZSGdfMUk5alhOa0ZxTXg3RkNqeTAwbHhkdGJ0akwxSkhnQ1FFaldiYURacWZmNmxxVDI5WQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://finance.yahoo.com",
      "title": "Yahoo Finance"
    }
  },
  {
    "title": "The U.S. bond market is suddenly flashing a warning sign about the economy - MarketWatch",
    "description": "The U.S. bond market is suddenly flashing a warning sign about the economy  MarketWatchUS Bonds Surge as Weak Retail Sales Boost Fed Rate-Cut Bets  Yahoo Finance10-year Treasury yield is little changed as investors await busy week of economic data  CNBCBonds Taking a Pre-NFP Lead-Off  Mortgage News DailyBond Bid Surges: 10Y at 4.20% as TLT, NVDA Pop  NAI500",
    "published date": "Tue, 10 Feb 2026 16:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPRE9XUnhVeThxQm1vcEZZX214bDgzOGgySUczb1p3bG1XQWlJb21ESF93RXhpQ21DRjBDT3ZSdXo2QXFHWmhNUkxMeVRfT2QzTHpZaC00dWtUX21ydXVZWDdYQWwzaS1ZQjBCd2ozbERpdmJKZkZyRGNKWGwtU1lsWlZmX2dZV09ERjZNOUkzS1dPb09YWUFOZ0VtcEFuVGF1QTJPd3FEN2E2NVc2N0dvSUs1TmxtS1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Ford’s EV shakeup leads to its worst quarterly loss since 2008 - Electrek",
    "description": "Ford’s EV shakeup leads to its worst quarterly loss since 2008  ElectrekFord reports worst quarterly earnings miss in four years, guides for better 2026  CNBCFord says it took an extra $900m tariff hit last year  BBCFord Sees Profit Rebounding After $900 Million Tariff Bill  Bloomberg.comYikes! It Was a No Good, Very Bad Financial Year for Ford in 2025  MotorTrend",
    "published date": "Tue, 10 Feb 2026 21:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNU0d1Xy1NYkFJdFlxWk1XZnFpeEhmcmllZFBVQ3E3dkwxUW1OamRjUU1TZ3FDY011aEJfTlFEaWo4Z0dpYlYzYzB5ZktzZnloZ1hqcFV1VVpMX3g0Vl9QTjVGOTJBdFNyLXZyaExNMC1hM0FsQTltZWJZWTN4bVJyYnh6cTRVTmZSYWJfWXhZdFB4a3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://electrek.co",
      "title": "Electrek"
    }
  },
  {
    "title": "Rivian R2 prototypes hit the media and revealed new performance specs as a Tesla Model Y competitor - Electrek",
    "description": "Rivian R2 prototypes hit the media and revealed new performance specs as a Tesla Model Y competitor  Electrek2026 Rivian R2 Prototype Drive: Taking a Different Tack  Car and DriverRivian reveals new R2 electric SUV with $45,000 starting price  USA TodayRivian’s Most Important Vehicle Yet Is Almost Ready for Showrooms  AutoblogRivian R2 prototype review: “a chunky electric SUV with an unexpectedly strong handling game” Reviews 2026  Top Gear",
    "published date": "Tue, 10 Feb 2026 16:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBxS1hSYUhVLXh5NkRsWWJaNmdJVTlEenZPT1pHV3pQbHlkTEdyQjY4ZkliOGcwQkxocVBIcEpILTFvZTJrV3dOY25FX1VNcG4yODYyWklFQndKR01kSnZ1eW5kNmR3VTRubldKWHJzTXJHV2lZUkVSQi1qdFZabGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://electrek.co",
      "title": "Electrek"
    }
  },
  {
    "title": "Hims Stock Crashes With Novo Lawsuit; But Novo Faces A Battle - Investor's Business Daily",
    "description": "Hims Stock Crashes With Novo Lawsuit; But Novo Faces A Battle  Investor's Business DailyNovo Nordisk sues Hims & Hers over copycat versions of Wegovy drugs; Hims stock falls 18%  CNBCNovo Nordisk opens new front with patent suit over Hims’ Wegovy copies  ReutersHims retreats from weight loss pill launch as Novo, FDA pressure mounts  Fierce PharmaHims And Hers Retreats On GLP1 Pills As Legal And Regulatory Risks Grow  Yahoo Finance",
    "published date": "Mon, 09 Feb 2026 21:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPZEZ6ZW5aNl9PRkcxR3V2eW93SU14cmFUZ2piTTB4MUVBVnl4ZTM0VE8tZzdYUGRCUHZMZjdRbWVRWWstNU81UjIwOFBnMnNDSUhVZWF4T0N0RnNldEtzVlZfYmdJZlNzQl9NUlF3U1JVTjV5NHZJVHRUa1A2TWhaeW5YZlF5U0psTFpxWVBFc210YURCeGtTakZnNEEtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Retail sales unchanged in December from November, closing out year on a lackluster tone - AP News",
    "description": "Retail sales unchanged in December from November, closing out year on a lackluster tone  AP NewsAmericans might finally be buckling under the weight of rising debt and slowing wage growth  CNNThe US consumer is slowing  Financial TimesDisappointing holiday season: December retail sales were flat, falling well short of estimate  CNBCUS consumer spending slowed in December - Is it a warning for the economy?  BBC",
    "published date": "Tue, 10 Feb 2026 15:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNa0FGTE5oa0hpZGZxcW1mTHRELUVDVzljaDdfWm1PeVpSUTNsTGpRZ2sweVd3dEM5UU1ablB6SnZNTElON3hmWE11UG9nb1lvZW1Lckd3anY4YnBjYmU0QU1iLXBJb1Ryb0ZvMnd0SXl6Rk91ZlRibEFmOFdaRTliVzBoRG4wV1VhRUxiUm5hcEhKX2h6TkR2alZoN2RDQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Cisco unveils new AI networking chip, taking on Broadcom and Nvidia - Reuters",
    "description": "Cisco unveils new AI networking chip, taking on Broadcom and Nvidia  ReutersCisco Announces New Silicon One G300, Advanced Systems and Optics to Power and Scale AI Data Centers for the Agentic Era  Cisco SystemsCisco looses Splunk to probe and tame its growing agentic menagerie  theregister.comCisco Doubles Up The Switch Bandwidth To Take On AI Scale Up And Scale Out  The Next PlatformCisco's double-tap on innovation: How AI is reshaping UC and CX  No Jitter",
    "published date": "Tue, 10 Feb 2026 08:34:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPb3Y5MDYzejR3V3FLNmRSTVd0RlJKUWZzX2p3NXJKX3ZEdkRSUXBjS0hQWGhJTjk4dGVOWWg5TTctTWk1XzJoN2tWX2lVRE0tUjVrQVJxZVRINHhUZ1hwVTJZU29hNnVLT3NDT3NDTHNFQWFkc3c2ZjVjaDJ1Y1pfa1kxTXpBQk05bWo5dDNPSklrLUF1UnNrbEk1YWhKUFFZRTlXbHQxTXRVbE14ZHYteC1mck5yUm4zbTNNVmRPQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Amazon Ring’s Super Bowl ad sparks backlash amid fears of mass surveillance - The Verge",
    "description": "Amazon Ring’s Super Bowl ad sparks backlash amid fears of mass surveillance  The VergeAmazon CEO says the pet-finder AI tool on Ring Doorbells helped bring home 99 dogs home in 90 days  Business InsiderSuper Bowl Ad for Ring Cameras Touted AI Surveillance Network  TruthoutOpinion | Ring is using lost dogs to make the surveillance state adorable  MS NOWWith Ring, American Consumers Built a Surveillance Dragnet  404 Media",
    "published date": "Wed, 11 Feb 2026 01:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNemRGb2FEdFl6alZ0ZWl2NnlRelA2OWItMnV0R1EtS3VGbXd0T01weHpiZnNrTE0tdVlma3FvMWNmcjJCbll2d1Rjeks2Zkd1eXRFR1ozOVFmbFVRdFZLODJJd0tCQUl5TjQ0SUhSem5UYUxhZXl0MkNNR2NnTWFqcnY5dzZtSjdWbkFJWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Microsoft might be getting U.S. tariff exemptions on chips supplied by TSMC — potentially dramatically lowering costs - Windows Central",
    "description": "Microsoft might be getting U.S. tariff exemptions on chips supplied by TSMC — potentially dramatically lowering costs  Windows CentralUS plans Big Tech carve-out from next wave of chip tariffs  Financial Times[News] US Reportedly Mulls Tariff Exemptions for Amazon, Google, Microsoft on TSMC-Made Chips  TrendForceUS plans Big Tech carve-out from next chip tariffs, FT reports  ReutersUS Chip Policy Protects AI Infrastructure While Raising the Tariff Wall  Investing.com",
    "published date": "Tue, 10 Feb 2026 20:40:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQMDBlN1hDNi1TWXdQb2NCN0tFN19OZ0FrZEtQTU9ZRjZQNVdxbHA4LXdSWHBreUpFQ3RDalhNUzM1NzZHTzliVGtMU19iSjQxUlA4RGZlZkFrejBlY0hjX094OWJXOHM3VFhGMG1PQ3dKc3NMdjhxSFpuZEFtVVN0akFHRDhlZGYtcGNYWGtnMkhXNUttQWtOTmJyWXcxalc1X3dWSUtwZF9FdDEwN1pueGdXaGhoUVREYk1KRjVmekFWMHcxZUlTRHBjVERwS2pocFV4RFhwY2tHM0M3T09MMGJUSXhERzdGQzBZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.windowscentral.com",
      "title": "Windows Central"
    }
  },
  {
    "title": "In the workforce, AI is having the opposite effect it was supposed to, UC Berkeley researchers warn - Fortune",
    "description": "In the workforce, AI is having the opposite effect it was supposed to, UC Berkeley researchers warn  FortuneAI Doesn’t Reduce Work—It Intensifies It  Harvard Business ReviewAI boosts productivity for workers but could hurt them long-term, study finds  Axios'AI fatigue is real and nobody talks about it': A software engineer warns there's a mental cost to AI productivity gains  Business InsiderThe first signs of burnout are coming from the people who embrace AI the most  TechCrunch",
    "published date": "Tue, 10 Feb 2026 18:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOUjhSTktaUUo5QkFqS2hybmRhWFduQ2UyRFAtYTJ3bXFEVVpMWDM3UEdscE9fWGFzUlhwQWNsZkNZZ2V6enlXOG9JV1RfX1pkVUtUemNxRWU1cUxka1h0VDRHUHp4QjBfdFE5RlpqOHNzNEJsbjlDY2lhU251a3lNcTNqZTlEeHRPcXhOWi1HSTlkNncyWkpxY0JfVDhWOW02YjdfeDF0ajlxT25nMTlEMW5Pd2FORjZnMkhIemlZVlZSdDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Operator of Eddie Bauer Stores Files for Bankruptcy - The New York Times",
    "description": "Operator of Eddie Bauer Stores Files for Bankruptcy  The New York TimesEddie Bauer is closing more stores. Which Iowa locations are closing?  The Des Moines RegisterNational clothing chain files for Chapter 11; Cincinnati-area location could close  WKRCSeattle-based outdoor apparel brand to shutter headquarters, lay off workers  The Seattle TimesEddie Bauer to close St. Louis area stores following bankruptcy  STLtoday.com",
    "published date": "Tue, 10 Feb 2026 10:06:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFA5VU84SG9Ca3YwZi1tSHEyOXc5aVhscEQ2MWVPUFVvSW9VeU0zeS1Fa0FRUTBsTVNUeTloTGhBMDlDLVNtcTAyQVpuQi01WWJrQ284RXdSQzhHTENZZ3FvbjZCaXRZNVVOMGJJSVZyMC0tX1huYjVya0hlQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump administration’s changes to the CFPB cost Americans $19B, a new report says - AP News",
    "description": "Trump administration’s changes to the CFPB cost Americans $19B, a new report says  AP NewsConsumer Financial Protection Bureau: Status of Reorganization Efforts  Government Accountability Office (GAO) (.gov)AFR Joins Sen. Warren, Rep. Pressley and Other Advocates on the One Year Anniversary of Trump's Attacks on the CFPB  Americans for Financial ReformThe ‘Humility Pledge’ That Shows How a Financial Watchdog Lost Its Bite  Bloomberg.comCongressional Democrats file amicus brief against Trump CFPB actions  MLex",
    "published date": "Mon, 09 Feb 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNbVV3Ml9HWGVSY2dfRjRxV0lpWGx5UE8xbjBhNWRfX0gtakxpM2NvM3RxVU0yQ05nVm95ZlJUQWdyUWtObkIySEVfS2V3blpxc2JDUXdBNHpoX1lJVjU5RFZBZk55YmFEWHVYWUR5WHowR05IdElpYTY2T2xYRXJHWU1MSUlBYUlTTFgwQnBrT0ZBVjRmSFhTWUxPNHBFNmlLNEVXQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Spotify Stock Jumps On Improved Profitability, User Growth - Investor's Business Daily",
    "description": "Spotify Stock Jumps On Improved Profitability, User Growth  Investor's Business DailySpotify triples profits after raising prices  Financial TimesSpotify Shares Jump on Strong Earnings, Subscriber Growth  The Wall Street JournalWrapped helps Spotify add users despite artists' criticism over fees  BBCSpotify Reports Fourth Quarter 2025 Earnings  Spotify",
    "published date": "Tue, 10 Feb 2026 22:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQRVE0YkVNa2RISnlrZWQ4RmFydjdnQ01nOEdKd2w3ZmxzM3IxZmlFM1NkSV9nS1JLc25JZVpVZ3dadFJMaGRJOTdXVzlfLXZHNVprS2NyU0xpWUNZc1NWalE2Zk1XWVBlNEQ1Q2w1Y3hPZUs5enRUZWpNRmZOYUE1SWJoT1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Fast-Growing Entitlements and Interest Eat Up Bigger Chunk of U.S. Budget - The Wall Street Journal",
    "description": "Fast-Growing Entitlements and Interest Eat Up Bigger Chunk of U.S. Budget  The Wall Street JournalU.S. government borrowed $43.5 billion a week in the first four months of the fiscal year  FortuneReport: U.S. added nearly $700 billion to national debt in four months  The Center SquareNational debt nears $39 trillion as budget watchdogs warn of economic risks  WBFFOpinion | One path to U.S. fiscal disaster is most alarming — and most likely  The Washington Post",
    "published date": "Mon, 09 Feb 2026 22:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwJBVV95cUxQNHcxdUFIWjNDeFNXaXdxbjVvVGlTOUV0R3QxNmwwRnZ1dVYxV204ZUExMFFwbG9BM3NLRS1PRmhhZFNSWm82NGd6VEpJczZndUFBTkd4dnlPUzBwbGZpbFBTWjMzUVBJWmx1T3BCNXdjZE5iclBfOVJSNDZEaEZIb1dlbzNaQ1Jmcjd6SGhtOEx1bDFORXg0VVllT3NqSGZoaDVNQWFvdG05b0pHNVVtZlMwV1pmY1BPNjF5aFh4bVB4WkVLUm11Y3pWYlBZVXh6V1lJcnpMTk5UM0pIbGlFbWZiVXpBZFZmQmRzUzVDQzBIMHFCb3I4M2JaYnRTX2VKQk5PU3pYMlE5bU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "American Airlines flight attendants pass no-confidence vote, call CEO's leadership a \"downward spiral\" - CBS News",
    "description": "American Airlines flight attendants pass no-confidence vote, call CEO's leadership a \"downward spiral\"  CBS NewsPilots and Flight Attendants Criticize American Airlines’ Performance  The New York TimesAmerican Airlines CEO faces union no-confidence vote amid O'Hare battle with United  Crain's Chicago BusinessAmerican Airlines pilots, flight attendants rebuke CEO's leadership  Fox BusinessAmerican Airlines pilots share serious warning  thestreet.com",
    "published date": "Mon, 09 Feb 2026 18:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPdlRzUm55TXNiZ2xKR2RoWjVlTjIyWUlkX2tGdUtuUE5lQ2VMTmJiTDJSUkZ0Xy0tSTRBY3F1RlRaS2k3NjhKellsaVhrWFV5X3JLOXNjOUtDXzIzQXZIWk84UVJSUUFjdWkweE5YeGVucGVNV2Y4Y1lyeGxpSktqU0Utdk9ORERybEN0bFFlalF2dkFiVk00ZkJENXFDT3E1YVRTNG5DSmRCZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Alphabet sells rare 100-year bond to fund AI expansion as spending surges - Reuters",
    "description": "Alphabet sells rare 100-year bond to fund AI expansion as spending surges  ReutersWhy Google just issued a rare 100-year bond  CNNAlphabet Plans Tech’s First 100-Year Bond Since Dot-Com Era  Yahoo FinanceAlphabet boosts debt sale again as total raise exceeds $30 billion, sources say  CNBCAlphabet Sells Almost $32 Billion Bonds as Tech Races to Fund AI  Bloomberg.com",
    "published date": "Tue, 10 Feb 2026 11:31:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOS0N5dVZFeFpKYVJKVDRiZXMxT2xiamNBX2hidUN0WnFhd0xrVFRRclFTUkx1STdaQTlFRnJkcGgzUDFuOHgtdThLR29BSlZ2dWs4ZmpyUlFYZEFjR3BuM0U3ZGtHSXR1c2hWZXlqSEY4RUdpZnhRN2QxejdpYm1Ic3JGVzZVQmR5XzJhSWpKUVVKQ0lkN0JhMjRvY1dwR2dP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "US Consumer Delinquencies Jump to Highest in Almost a Decade - Bloomberg.com",
    "description": "US Consumer Delinquencies Jump to Highest in Almost a Decade  Bloomberg.comWhere Are Mortgage Delinquencies Rising the Most?  Liberty Street EconomicsMortgage delinquencies are rising in low-income neighborhoods  AxiosNew York Fed: Consumer delinquencies hit highest level in nearly a decade  Seeking AlphaSouring card debt is plateauing at elevated level: New York Fed  American Banker",
    "published date": "Tue, 10 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQYzYtM3YxZkFDUjFROHhYMHNhOUlhMDJqcG0wUnNYUGxkdVZLcHRKNm1YT3JaUi1wT0NmOHc1U2JocU9BNmV6OHR5MWRtOS1iSmlIVW5YNTkyc0JQWmJEemZ1SFBRSVpYRDhGdWdjTDBraC0zU1lYaktRaDJkRWVOYmM4c0NIT2VncmNnc29tUjM3QXd6Q2NQZk1OMXJLSnhZWGxmQjJuNEctdVNCZnJldA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "FDA rejects Regenxbio’s MPS II rare-disease gene therapy | STAT - statnews.com",
    "description": "FDA rejects Regenxbio’s MPS II rare-disease gene therapy | STAT  statnews.comFDA rejects Regenxbio’s Hunter syndrome gene therapy  Endpoints NewsREGENXBIO Announces Regulatory Update on RGX-121 BLA for MPS II  Yahoo FinanceFDA’s accelerated approval messaging collides with CRL reality  biocentury.comGoldman Sachs Lowers Price Target for RGNX, Keeps Neutral Rating  GuruFocus",
    "published date": "Mon, 09 Feb 2026 21:29:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPdndkcVRvazZBdzM3Skp4TG84OU5BSVAyVjEzVnBXSkt4MUlfNENQakx2WlNxajg0YXNfRkV1ZmhMV29wQzlYNzJmWHU5emVnZldKY0tWWkMtXy1TUk1lay1MMGFYRTFhTVRLRG1kTElpTjRwWmFGaEZvaG9QemtBaGtOZ1hTNGd1dzl3TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statnews.com",
      "title": "statnews.com"
    }
  },
  {
    "title": "The Super Bowl Was Overrun by AI Ads — And There’s a Reason Viewers Weren’t Buying It - Rolling Stone",
    "description": "The Super Bowl Was Overrun by AI Ads — And There’s a Reason Viewers Weren’t Buying It  Rolling StoneI’ve Been Using Two of the Most Hyped Tech Tools. One of Them Finally Lost Me.  SlateScott Galloway on why Anthropic’s Super Bowl ad got to Sam Altman and showed therapy as AI’s use case  FortuneAI Fumbles Its Big Super Bowl Investment as Viewers Opt for Laughter and Tears  The Wall Street JournalAI infighting erupts as Sam Altman and Elon Musk squabble online  Axios",
    "published date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPbmE2MXdJLVJDUDBORllRY09BSEVGLVQwQzc5ZU9CRjEtZVk3Q0JoYzRvX1ZlSFo3VFRxb2hpRWJHZkNzLTA1MUtpOXRWdkpTR09ndXRyT3pCUzc0UEJvVTRYV3hELXJNcEFyajlWb3NxT3VNWEU5bzB2QU96S0loQzM4dExXc0x0M01lMnlXamZVQ0c4eUhnYXZpdERRb01Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Justice Department un-redacts more names in Epstein files after pressure from lawmakers - CNN",
    "description": "Justice Department un-redacts more names in Epstein files after pressure from lawmakers  CNNJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC NewsLes Wexner's name redacted in some Epstein files, congressmen say  The Columbus Dispatch‘Gang Stuff’ and ‘Illicit Trysts’: How Epstein Sought Leverage With the Wealthy  The New York TimesDOJ redacted Les Wexner identity in Epstein documents, lawmaker says  Cleveland.com",
    "published date": "Tue, 10 Feb 2026 21:43:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9OaUUxa2s0dWRzVVRqLTR4ZVdkanpiRDZKQjg3T29kTERMX3hIaERfal9qM3doTVNMTE10NExhdEFlQUdfRXNQbXJUVHNhUzBOMDRpMVhXZ1JNZDVDV0FJeU9KQ2dPQUlkbzFmc0NUel8xTUk2UjQ4QUlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "FDA to reassess the safety of BHA, a preservative used in popular snack foods - CNN",
    "description": "FDA to reassess the safety of BHA, a preservative used in popular snack foods  CNNFDA moves to ban BHA — an additive used in processed foods such as meats and bread  NBC NewsFDA to remove a food preservative commonly found in bread, meat  KOMOUS FDA to review decades-old food preservative in safety overhaul  ReutersFDA reviewing food preservative BHA  The Hill",
    "published date": "Tue, 10 Feb 2026 21:10:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBMaFpOZF9LRlBnR19YX19WZ2kyWHgwYVRSWVZlbGtiSEUyaTlKV3FadGpDY1FKejI3MVhUTHhqeTV5WmxpUFhURlBYeng3R3JuVFVoMF85dkRmdDlsVXJhVEZoNFVWS3BWMVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "AI chatbots give inaccurate medical advice says Oxford Uni study - BBC",
    "description": "AI chatbots give inaccurate medical advice says Oxford Uni study  BBCA.I. Is Making Doctors Answer a Question: What Are They Really Good For?  The New York TimesReliability of LLMs as medical assistants for the general public: a randomized preregistered study  NatureAI Chatbots Give Bad Health Advice, Research Finds  Barron'sAI-powered apps and bots are barging into medicine. Doctors have questions.  Reuters",
    "published date": "Mon, 09 Feb 2026 16:33:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE11R05Sa2tIZS1ybm5rTWp6MWFnZzhpMVJBQW9QMnZ6d3NaVGVFSk15enZ0RzBDcUFSZENaMkVSNmY5Q28zV1dwUlZ0Zjh4RzN1S3lManN2bG9wQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "2026 Audi A6 Is A Satisfying Luxury Sedan, But You'll Want To Wait A Few Months To Get One - Jalopnik",
    "description": "2026 Audi A6 Is A Satisfying Luxury Sedan, But You'll Want To Wait A Few Months To Get One  Jalopnik2026 Audi A6 Gas V-6 First Drive: Back in the Fight  MotorTrendThe Audi S6 Is Dead  Edmunds2026 Audi A6 Mid-Model-Year Upgrades Make a Sedan Stalwart Even Better  AutoweekView Interior Photos of the 2026 Audi A6  Car and Driver",
    "published date": "Tue, 10 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1MdHlvMThBMmVjU20tUi1zRjFsOHJrYXpLcVA5RjR4M3Qybnd2YTBCQk9IeUxrcm9WblhvcE04X3BoaE03ZkozZE9sWHh6ZHhfVG1WYUhCOU1mY3I2WUtxWHJwVU5wZVVLbmZ5Z3B6ZGNLNnU5TUF1SFJFcXBZM3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jalopnik.com",
      "title": "Jalopnik"
    }
  },
  {
    "title": "Donald Trump confesses ‘big mistake’ in major admission on economy - MassLive",
    "description": "Donald Trump confesses ‘big mistake’ in major admission on economy  MassLiveTrump Says Fed Pick Warsh Can Get Economy to Hit 15% Growth  Bloomberg.comTrump Says Economy Can Grow 15% With Warsh as Fed Chair  The Wall Street JournalTrump says the Federal Reserve is 'in theory' an 'independent body'  NBC NewsBREAKING: Trump Admits His Fed Pick Was a Mistake And Why This Matters More Than the Quote Itself  Binance",
    "published date": "Tue, 10 Feb 2026 19:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQTXR3aGk0RFdjRGFxSXdUV1NBZ2ZleFB5X2NlYWllQzlrMlpqT1NjR1U2Mm1XYnZZeVpDSW9Sa01LR1lFS1dEem9aalhWYkhsVEFWTkp5WjFCZzZ4dTd1RjdEWnFNaE03ZzhmZFgxb1FqQWVPbnctRjdvcF96dlJqWkpoVFVDRFJYdk5PQ1lxZGNZeW1YLVBLck1ZbGd3UktEUy1BWjF2ZzhZNEHSAb8BQVVfeXFMTlNiNXRpMlpTVlE2ODNFUWVJMUZXT21IMFltd0Z4NXpuVGVseXdxYXVtTWJFUzVIOUxBUi1pdW0xUXBveG9vRzUtS01hWmdZOWMxNVBTd0l5cGtvREtDMFlKMmwtZ0V1OThxc1hBSThEZGZkRVl4dmJXN0JUUlZVakxxSEIySFByZlhjZWkzdl9aMUJGY0ZQZmNGb1BKWC1uNW9KSUQzbnRjWUpSNFZEcE45OGtsWC0tSHZ6c01oNkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive"
    }
  },
  {
    "title": "Wall Street’s New Trade Is Dumping Any Stock in AI’s Crosshairs - Bloomberg.com",
    "description": "Wall Street’s New Trade Is Dumping Any Stock in AI’s Crosshairs  Bloomberg.comThe AI threat wrecked software stocks. Now financial stocks look next with LPL closing 8% lower  CNBCWall Street Spurns Stocks With AI Risks in Latest Trade Strategy  Bloomberg.comWealth Manager Stocks Sink as Traders Flee Next AI Casualty  Yahoo FinanceStock Market Today: Dow Rises, on Course for Third Straight Record — Live Updates  The Wall Street Journal",
    "published date": "Wed, 11 Feb 2026 00:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPdmtFSm1wS1VEYVkxWDZIS1c5TWtVT3JaSDV2NjBXRGtvVVV5LUZGb09yVlROcVducDluUmI3U0paanNfc1VrNHRPMXRsVEtkYVNpLV8xM2gwZHJlNEFPc0NZUjhBaVNEdGZwRnpaMzlSN2YwUGQ5VDQwbm1iZ0U1LW9wWnlWOHZuNUVQc0dkU2FJc1FZRG0zNDAwVFRldk9ST1VqampUd0VUZzVQM2REd3MyNXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Mercedes-AMG GLC 53 Revealed: Six Cylinders Are Back, Baby - Motor1.com",
    "description": "Mercedes-AMG GLC 53 Revealed: Six Cylinders Are Back, Baby  Motor1.comThe 2027 Mercedes-AMG GLC53 Coupe, Up Close: A First Look at the 443-HP Performance SUV  Car and DriverGoodbye 4cyl: the Mercedes-AMG GLC 53 gets a ‘high-revving’ 3.0-litre straight-six  Top GearBMW M’s Best-Selling Model Faces New Rival From Mercedes  BMW BlogMercedes-AMG GLC53 4Matic Arrives to Replace PHEV GLC63 in Showrooms, If Not Our Hearts  Road & Track",
    "published date": "Tue, 10 Feb 2026 23:29:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1qT0hsYUlQbUtTYi15U19LVDJJU3lya19qcVItUXVfN3BNYjRPWWVXY2pXbGxCX1k0X0owakV3bFlhOGVtWEJoenpVUVJacVZsMlpBOGxwczEtRTVrb1BjLThxVjJTUG1sQnMySjdleVl0UU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.motor1.com",
      "title": "Motor1.com"
    }
  },
  {
    "title": "Gold drops as investors brace for US jobs and inflation numbers - Reuters",
    "description": "Gold drops as investors brace for US jobs and inflation numbers  ReutersView Full Coverage on Google News",
    "published date": "Tue, 10 Feb 2026 01:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNYVVvLTdmVFVhbVJxdWd1Nm9qMHBaSGJfQUFHSnktdDBCTWlFOFMtUTNNd25OZ3hELU54a1ZvTDdmdkVIclp3Y2tPQUNSNWFXNGFPLWVaYkJKcVBBd2VjVUhxdHhvSHpHaDQ4MVZEbUxXSXl4dUVRVzdEYlRuVjZqbThZc1o1eHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Amtrak offers first look at fancy new trains. Here’s when they’ll debut in the Northwest - OregonLive.com",
    "description": "Amtrak offers first look at fancy new trains. Here’s when they’ll debut in the Northwest  OregonLive.comMeet the New Airo Fleet  Amtrak MediaGet a look inside Amtrak's new $8B train investment  WJLAAmtrak offers first look at Airo equipment  trains.comAmtrak introduces new trains on Cascade route  Yahoo",
    "published date": "Wed, 11 Feb 2026 00:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPTU9UQUVUQ0FvNlZ5MnJ4ZTBGVmhhZ2haMWFQZ2VHMVpLb3pob0F3TktacDVONnVmemJZS3I3a2RCamRRcWU0QXdBU1VZX3lzUS1jZHRQMFMxaHZkbncteXBDbnhRNkl2NjdaVEY0Z0F2ZGg2YTJvR2RVNC1VUUZLZHFkQ29haE96djd1UWQzZkkzZDF6aFBISWgyZklqVlZUcVBlMWpHUDZUd0pCZnF1Nmw1clpJalFVcmJCcWp5RjJvUlFwbEF1SEhJUjjSAeABQVVfeXFMTnJUWEQ3ZFZzQ21jR2RMVFBhZ3BXbXpRa3hRSFpIdlJnUVM4M0VqMDZjMXM5VkF6WTlENEpUTHY3VkdHNlZQY2dBbUdQZDFkWlpFX2hXYmhiX0EwbWN3OWZrWkhnQXRLMnRJU1hJLUgxUXF3UktDSjBORll4YTloNnk3RnkzdERZd2c5bE9yamN1Wi1BOU92djZnUVIyT0NTTExsYWNDZzlseGdpYXpzdy04RS1ucUZsZmZIblJXS2VmbnF1SGFMSnVLcHJyV2VqR3hqNWtFaXZlOGFPeXRnUUM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "VCs Are Throwing Money At Recent College Grads To Build Prediction Markets - Forbes",
    "description": "VCs Are Throwing Money At Recent College Grads To Build Prediction Markets  ForbesKalshi chief Tarek Mansour: ‘We’re pricing the future’  Financial TimesChecks and Balance newsletter: The danger of prediction markets  The EconomistI Created My Own Prediction Market. What It’s Telling Me About the S&P 500 Now, and What Comes Next.  Barchart.comTrading, Gambling, or Something Else? Prediction Markets and the Payments Puzzle  regulatoryoversight.com",
    "published date": "Tue, 10 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPcnJ2anNSZUZzblhMWldodXhobEFIMnJVbVE5Q0VyTEpNOXFrd1FTenhYakptcDRvZG42OGdaeHpfUU1GVFA4ZnZVbXhFaDNWVHFWblRrd0c5eTdhWV9zdmR4RkJFUExKR0t4MS1FREwwVnlFTkMxTXJJVG42VHBrdEFudWpjSFVwVWQyVWx6aHRHV05PcU5wNTFwTExOcXJRUkhLb2o3QTZuMmFVVm9VYVZMU1BZWHpxSnVCWWFXWWhBazJ2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "How much power does the Fed chair really have? : Planet Money - NPR",
    "description": "How much power does the Fed chair really have? : Planet Money  NPRTrump wants lower mortgage rates. His Fed pick may push the other way.  The Washington PostWhy Trump’s Federal Reserve Pick May Surprise Him  PoliticoThese Presidents Found Out How Trying to Control the Fed Chair Can Backfire  The Wall Street JournalWarsh Call for Fed-Treasury Accord Stirs Debate in $30 Trillion Bond Market  Bloomberg.com",
    "published date": "Tue, 10 Feb 2026 11:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPXzgzTnY1VXNiWXF5N0FJMjNySHFYVDdEYW5CSXB3Wk1LdzNqN2dIR2w5RnJscWZVVFpieW5pNGV3Y0djSncxQzEyQ0JMUkJMemVBRXJoNk1KbE91WUpFc1F6bFRnZGF4SjhNdmVhZlFsVHByOEMxQlk0RGhKak43dnlYejktQXFkNzRhUVcyNTBpb1hzLWdGZEpZbzU3MVFOdlpCRklzb09SZEVvbDZV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Mark Zuckerberg Buys '$150 Million' Mansion on Miami's Billionaire Bunker - Realtor.com",
    "description": "Mark Zuckerberg Buys '$150 Million' Mansion on Miami's Billionaire Bunker  Realtor.comMark Zuckerberg becomes latest California billionaire to relocate to Florida amid tax concerns  Fox BusinessExclusive | Mark Zuckerberg Is the Latest California Billionaire to Buy a Florida Home  The Wall Street JournalReport: Mark Zuckerberg buying Indian Creek estate  Miami HeraldBillionaires Fleeing California Wealth Tax Snap Up Miami Mansions  Bloomberg.com",
    "published date": "Tue, 10 Feb 2026 16:09:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNQ29qWDQ0UHhnV2JPd19MbTZmeGVzY2lmMFE4Z19WcUI5WVBrR2F5dUJJSVhOZWRhQnVJbzFIU2FhSkIwWFhPQlhaXzRVanB0NUUwSG5LclRhSkRzR1Y2LVBJR21XOTg1UEZZVVB1Q2JuazQzNkI1aV9NNDFVLXpEbzNPdmhERnFxY2ZyOUthTlYyd1ZCTFRyZlIzZ0xXUEtjOG9rblpHZ2xUeUpEVFFQLVNXMk9PV2hr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.realtor.com",
      "title": "Realtor.com"
    }
  },
  {
    "title": "Epstein engineered intimate relationship for Tesla’s Kimbal Musk, emails show - The Guardian",
    "description": "Epstein engineered intimate relationship for Tesla’s Kimbal Musk, emails show  The GuardianTesla’s Kimbal Musk Linked to Epstein’s ‘Girls’ in Latest Emails  Bloomberg.comEpstein files reveal Boulder restaurateur Kimbal Musk communicated with convicted sex offender multiple times in 2012 and 2013  9News‘He Was Subscribed to a Newsletter I Sent Out’: Kimbal Musk Posts His Explanation for All Those Epstein Emails  GizmodoKimbal Musk responds after emails with Epstein surface in DOJ documents  The Business Journals",
    "published date": "Tue, 10 Feb 2026 22:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM1owMzZwRzYzMG81SzVSaWY3bnlmLWdjMzRjQ3NOVEJlMTR5dHo3UjdzaUktTWFZdklRRTY1eXhpZUdka29JWEhQWExQX3VQbzJNaVJFSk9uU1dGOWJRNWt5VTNXV3hYTUttekg2VXVzcWVIOXNnczhnR0xVRGNmLUw0YzZMc1Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Elon Musk Wants to Build an A.I. Satellite Factory on the Moon - The New York Times",
    "description": "Elon Musk Wants to Build an A.I. Satellite Factory on the Moon  The New York TimesWith co-founders leaving and an IPO looming, Elon Musk turns talk to the moon  TechCrunchIn a reversal, SpaceX prioritizes 'city' on the moon over Mars project, Musk says  NBC NewsElon Musk said he'll congratulate Blue Origin if they land on the moon before SpaceX — he's focused on something else  Business InsiderElon Musk pivots SpaceX to moon from Mars as IPO approaches  Yahoo Finance",
    "published date": "Wed, 11 Feb 2026 02:04:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE80cV9rMFBlek90Q0pMalk3Y2VqckI2TFNxMkVmSVVBZm16M0VXUlFMUEtXRXozbU1TRGN2elN0Q0RQRlAwREdZTHZLR1Izc2dDdERIdllhWFhKNFlTQUpNTlV1aXZKeV8zZjR4REpxd3ZmbHI3NGE3Q21WSFA0b2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "TSMC Stock Is on a Roll. AI Chip Sales, Trump Tariff News Could Keep It Going. - Barron's",
    "description": "TSMC Stock Is on a Roll. AI Chip Sales, Trump Tariff News Could Keep It Going.  Barron'sTSMC Revenue Jumps 37% in January as AI Spending Marches On  Yahoo FinanceTaiwan Semiconductor Manufacturing (TSMC) Stock Just Hit a Record High. Here's Why  NasdaqTSMC Stock Hits Record High As Chip Foundry Posts Strong Sales  Investor's Business DailyTaiwan Semiconductor Just Delivered Encouraging News for Nvidia Shareholders  The Motley Fool",
    "published date": "Tue, 10 Feb 2026 21:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNaEtQRjFtTHJNUjdQYXNNeDc5aFhUeHVMX3RyRERpcHVqdFhrdHEwdjIta3E1RHNkSEduTlI4dUQtdkJqeng5bW5pUW1LMnBJWkQyRlBYcGhpa3NyYmdYUnluT1lpVXRXbFd4OTRpcjVzNmFmbDdsMlY1OFVlUGJvSk1EekxMMmZN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.barrons.com",
      "title": "Barron's"
    }
  },
  {
    "title": "Le Creuset, OXO and More Kitchen Brands Are on Secret Sale in Amazon’s Hidden Outlet, Up to 67% Off - EatingWell",
    "description": "Le Creuset, OXO and More Kitchen Brands Are on Secret Sale in Amazon’s Hidden Outlet, Up to 67% Off  EatingWellEarly Presidents Day furniture deals take hundreds off couches, patio sets and more  CNNPresidents' Day sales 2026: The best early tech deals from Apple, Sony, Roku and others  EngadgetI Spent Hours Browsing Article’s Presidents’ Day Sale — Here are the 12 Best Deals  Apartment TherapyBest early Presidents' Day deals at Amazon [2026]  Mashable",
    "published date": "Tue, 10 Feb 2026 05:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNTzJ1ank2MjJVU1FjYW8tbU1RUzlDNExMbjBvcmtzNzlCRjNBR0RlSE1JeDNOdkhqWjMyM0poVkFnWDI0M3BDcjRWSV9EZWpsNDlaNXdQOWo4VjhZZElLakRvT3RRVmFhQmVNb2Z1VEpVYVlZbC0tVkdzSEt6QzJPTlVaMU5fYm5Ld1QxUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eatingwell.com",
      "title": "EatingWell"
    }
  },
  {
    "title": "Stock Market Today: Dow Up As Oracle Soars; Cathie Wood Buys Buffett Stock Amid 145% Run (Live Coverage) - Investor's Business Daily",
    "description": "Stock Market Today: Dow Up As Oracle Soars; Cathie Wood Buys Buffett Stock Amid 145% Run (Live Coverage)  Investor's Business DailyDow soars by 1,200 points as Wall Street rebounds from tech meltdown  CNNS&P 500 scores back-to-back gains as tech rises, Dow touches new record: Live updates  CNBCStock market today: Dow, S&P 500, Nasdaq futures steady near records as rebound holds ahead of jobs report  Yahoo FinanceHow the Dow Got to 50000, in Charts  The Wall Street Journal",
    "published date": "Mon, 09 Feb 2026 21:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNMEdNWGh3NENiSGtEb1JNdS1tc29NN1hFRjJqa2NnSkFOR3hVOHNWLTZKYUQyclE4NEVjd0ZiUFltU3BvZlk4dXdEdmtGWkJ4dmwxQ0hYeHVuRWVzd1RLY3o2OGpWMDhYOEYybWRXQm8wNmhaRXRkLVFOLVBNTlV1SVFjSFc0SE96RTFjd0JqVmdhX1JZc0NmZlFaYW9Fc1VIYVhSWllUQnlCR1lKek9rUDFfS3pvUFROV1M0bjJndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Fiserv Reports Fourth Quarter and Full Year 2025 Results - Fiserv",
    "description": "Fiserv Reports Fourth Quarter and Full Year 2025 Results  FiservFiserv (FISV) Reports Earnings Tomorrow: What To Expect  Yahoo FinanceFiserv struggles with financial business  Payments DiveFiserv looks to AI, BNPL to spur its recovery  American BankerFiserv Q4 earnings top consensus, but outlook for 2026 disappoints after October revamp (FISV:NASDAQ)  Seeking Alpha",
    "published date": "Tue, 10 Feb 2026 12:01:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNYVdEOGlzLVI4R2YyY3FVMjFzY3cxMlZkU1JyQmdtY1V1Z2ppMXFzOXkzZWxvNjJySEo3S1NEb1BLNURBbWE5OFRldlRYdFBhYlBYSUVTcTNKMVlzUWY0Q3R5QV9QR21zQWRoek9IMEJZUGxCSms2VnZYWUw1MV9ZUGhCeWFpbHhiYWtJRXMxM2hLX0lOaXJzQXhNVTlYYWNYbVBxTlZSdENnQ1daeldGVGlkMWJwTzFuUy1mbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://investors.fiserv.com",
      "title": "Fiserv"
    }
  },
  {
    "title": "Stock Market Today: Dow Closes At Another Record High; Nasdaq Breaks Win Streak (Live Coverage) - Investor's Business Daily",
    "description": "Stock Market Today: Dow Closes At Another Record High; Nasdaq Breaks Win Streak (Live Coverage)  Investor's Business DailyS&P 500 closes lower as AI fears weigh on financial stocks; Dow hits another record: Live updates  CNBCStocks mixed but world index hits record high; Treasury yields fall  ReutersS&P 500, Nasdaq end lower after the latest retail sales data (DJI:)  Seeking AlphaDow Rises, on Course for Third Straight Record  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 21:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWUVNUmpXWGRvZ3V3WTF4OU01UWNkQmFtcHhiYzE5OUdJZTlQTGNzQ1VKb1A4d05lM2xPLWpXY19BTHMxQUJndzZfYldQc3BZZ2I5Ry1QcWFkT2V0V3hNUHZuX1lraXVoQllTU2tFVUt6NnBqblN3QjZPV19UVEZDUkY5bDdoWXRVWHgtLW5MaVVWMFN2RmtvYmUydi1ZQmxjdkhuVVVYd09uTkZfenhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "How One Prediction-Market Trader Played the Super Bowl—and Lost $100,000 - WSJ - The Wall Street Journal",
    "description": "How One Prediction-Market Trader Played the Super Bowl—and Lost $100,000 - WSJ  The Wall Street JournalKalshi says Super Bowl trading volume surpassed $1 billion  CNBCGambling Stocks Sag as Prediction Markets Steal Super Bowl Bets  Yahoo FinanceYou’ve Never Seen Super Bowl Betting Like This Before  The AtlanticSuper Bowl Gives Prediction Bets Record $1.2 Billion Trading Day  Bloomberg.com",
    "published date": "Mon, 09 Feb 2026 20:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE4zdFhUemVsbHhCRF9zei1wanB4eXlHOV9PQTRCc0FKTkl2TjIyRUZhV3N2bjlMX1MxMm52WVhQbU1xcHdiLTU1ck9fWEhXdTVPdFRPN1FkOWdLOWhiV2JIc2YtajBRWDA3eFNvbnR2b0lFMjdlN1Y4VmN6TjBnQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Coca-Cola Reports Fourth Quarter and Full Year 2025 Results - The Coca-Cola Company",
    "description": "Coca-Cola Reports Fourth Quarter and Full Year 2025 Results  The Coca-Cola CompanyView Full Coverage on Google News",
    "published date": "Tue, 10 Feb 2026 11:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOQk9Kdjc1UFdYYldCajNsUThFbG0zM2I5bWNscFJGRHVPT3h3TE96UmVudDRPRVBld3AwNVFBX1dYbUM3TnFMS1JHMnpob3lycWI2eXpheWJUTERzd01LZjlabGxoVno4WU5nVGU4Y2l2aXdtS01YOXgwVkJoZEdsT05KaTMxOUJhZHhwTkJmODVWZ2wyaE1TTTQ0NGFCMVhlejhiV2dmTnNzWm1QSFU5a3Q1MmRxRlJpcU9YU1FZa0tWeW5jTmxUeW9HNUp3WWtLWm9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://investors.coca-colacompany.com",
      "title": "The Coca-Cola Company"
    }
  },
  {
    "title": "Is the U.S. economy creating any jobs? Is inflation really slowing? Investors are about to find out. - MarketWatch",
    "description": "Is the U.S. economy creating any jobs? Is inflation really slowing? Investors are about to find out.  MarketWatchTop 3 things to look out for on Wednesday  Seeking AlphaInterest rate outlook comes under scrutiny next week with jobs, inflation data on deck. Here's what's ahead  CNBCWhat to look for in the delayed jobs, inflation data out this week  marketplace.orgWhat to Expect in Markets This Week: January Jobs Report, Inflation and Retail Sales Data; Earnings From Cisco, Coca-Cola, McDonald’s  Investopedia",
    "published date": "Mon, 09 Feb 2026 21:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOYjR0OWlnbVZnLTJnV2lDUnVoci1vS3Y2VTFKeUZYaGFsaEg0bnNPeWJBN2ZSZVk2RnMwTXlpUzE2amdBSGRzWmpXeG01cjVybldNNXR1TVZ0QnVUU1BfdkZxZC1VdUptQmJoQ1E1RjZsdmhmSHp4T0ZiQlY3bnJPX0N5RjZSQ05UWkhGUEFmTVhwdVhhZkk1TDVfeDBkVENnT3JLYkY5aGtTYTFXb204YW9IajI0ZDNYcjVhX3htM0ZWZmU1Q2hRSjJRaFRucUtBbm9JVjVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Bitcoin price analysis: BTC faces fresh resistance near $71,000 - CoinDesk",
    "description": "Bitcoin price analysis: BTC faces fresh resistance near $71,000  CoinDeskBitcoin falls to $69,000 as crypto market shows 'early stages of bottoming'  Yahoo FinanceBitcoin’s Recovery Rings Hollow as Derivatives Stay Bearish  Bloomberg.comBitcoin’s 50% plunge from highs ‘hurts a little’ — but it isn’t shaking these investors’ conviction  MarketWatchWhat is next for Bitcoin after its recent plunge? (BTC-USD:Cryptocurrency)  Seeking Alpha",
    "published date": "Tue, 10 Feb 2026 03:44:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNY0VlcWVBLXZ0S1JieFY2Qk84VG1xTGFSLUdRR0VYd3RZLU8zS1JoSnNBV2tuaTZDM3ZLV0RLNE5kNE9hUnNvbnM1bUNEdGZwTVQ2Zk1WZmxzVlJjc214UFJFZzI1YnNkUWxuRFNlX1Z2UlRvems3ZEJ5R01PSWRyM2l2Q01tUjZMaTNRbDAyZzZVS2JfNjFjaFZlTzYtZVVGVVp3bnNfU0lYQzE4ak1lMkZjeXVHaHBEdlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.coindesk.com",
      "title": "CoinDesk"
    }
  },
  {
    "title": "Don’t let Elon Musk monopolize space compute - Slow Boring",
    "description": "Don’t let Elon Musk monopolize space compute  Slow BoringMusk predicts more AI capacity will be in orbit than on earth in 5 years, with SpaceX becoming a ‘hyper-hyper’ scaler  Yahoo FinanceWhat to know about Elon Musk’s merger of SpaceX with his AI company  Los Angeles TimesElon Musk wants to be a trillionaire — here's how SpaceX may get him there  CNBCElon Musk is getting serious about orbital data centers  TechCrunch",
    "published date": "Tue, 10 Feb 2026 11:02:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1tbzNmbDUxTG93c1E4bEp6QW96N09UWkVPcW5VajFlcVM0bV93Y1NFS1pCaGE0bDBGWHJmUjdDWWoybEh0QVpLZDJneEEzWXg2dktnSlNvVWtFazVKSFhBVUxHbDRhQXBXS1lxZi0zandhdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.slowboring.com",
      "title": "Slow Boring"
    }
  },
  {
    "title": "Pentagon needs more time to finalize defense firms on naughty list after initial review - Breaking Defense",
    "description": "Pentagon needs more time to finalize defense firms on naughty list after initial review  Breaking DefenseExclusive | Pentagon Warns Major Defense Contractors It Is Reviewing Their Performance - WSJ  The Wall Street JournalInvestors in defense stocks wary as Trump places new limits on CEO pay and dividends  ReutersThe US Needs More Missiles, Not Defense Stock Buybacks  Bloomberg.comPentagon holds off on naming and shaming defense contractors  The Hill",
    "published date": "Mon, 09 Feb 2026 21:42:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPOXdZaEhXbGt2OVBzLVpmVGNJY0RxNTNtRnlSVTVqV29sVWJhUzlLUmw3R19TNG93SU5Lb0tuRGJRcmktbDJTQV9aWlYxTkxZUllmWHRDYW9ZaWlBYUNaY0pPT2YzQ2pLOFppelZGZHJfSE9ITUY3MHlieWlsV1hDdG41Z0QzSVJoeUd5bWx5VV8zWi1MdXhqN3NCSWZzRmxxUzNqWnhkMTVEMUxzWk5zU1VqYlZpUTcyVlA2QWJOaE11UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://breakingdefense.com",
      "title": "Breaking Defense"
    }
  },
  {
    "title": "4 reasons China and other foreign investors may retreat from the U.S. - Axios",
    "description": "4 reasons China and other foreign investors may retreat from the U.S.  AxiosChina might be beginning to back away from U.S. debt as investors get nervous about overexposure to American assets  FortuneChina’s Years-Long Retreat From US Treasuries Flags Bigger Risks  Bloomberg.comChina May Be Moving Away From U.S. Treasuries. Why the Market Shrugged It Off.  Barron'sChina regulators wants banks to scale back holdings of US government debt  Business Insider",
    "published date": "Tue, 10 Feb 2026 10:02:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBseEhQemtCVzhrUnc2QmZ4MnQtejhkbklFMjdiaVdPeWdRa01YdXBYa0wxSmJIXzJtSFhzTGwwUTRIVTZmbmcwdjlYNlZoYW03NmRCa3BtS2FtZUVJdjFTUHNsbklnQVhaeG9oTTBYeTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Discord says ‘vast majority’ of users won’t see its new age verification setup - The Verge",
    "description": "Discord says ‘vast majority’ of users won’t see its new age verification setup  The VergeDiscord will require a face scan or ID for full access next month  The VergeDiscord to start requiring face scan or ID to access adult content  BBCDiscord faces backlash over age checks after data breach exposed 70,000 IDs  Ars TechnicaDiscord backtracks on controversial age verification rollout…kind of  9to5Mac",
    "published date": "Tue, 10 Feb 2026 20:17:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTUJoUnpRbkhPemd5cEl6OXZHbmhlX1Q1ajRXMFJYb0pvaEo1RFUyWHNQQnNxd0hnc2NwemNWTjRONEF5WGJESi1GYVhvdDZqLVg2N0x5Rl9jZ1E5a2lFQTZoYnZiaWtCNThtWVNaTVFjclZieERXemV6SE5Ta000bkEtTFg5dy1uekNFaHF6UlJXNnBfa3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "What to know about Netflix’s landmark acquisition of Warner Bros. - TechCrunch",
    "description": "What to know about Netflix’s landmark acquisition of Warner Bros.  TechCrunchNetflix exec calls DOJ probe into $82.7B Warner Bros deal 'ordinary course of business'  Fox BusinessHow Breaching 45-Day Exclusive Window Will Devastate Movies & Why Netflix’s Commitment To Theatrical Is Misleading – Guest Column  DeadlineExclusive | Justice Department Casts Wide Net on Netflix’s Business Practices in Merger Probe  The Wall Street JournalNetflix Exec Predicts “$6 Billion in Job Cuts” if Paramount Buys Warner Bros. Discovery  The Hollywood Reporter",
    "published date": "Tue, 10 Feb 2026 15:56:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQSFlTU2I0LUZDekdoTTZ1U0RqOUt4bVNjeDZLSXdBWEdhUjJqZWtpaVBYcF8xYnpTTUdza3pKTm55eFNVWnFScWFWUmFyelpBRzNFYkhsb1hmMUZqUjZVclBpa2FqTkpTNU9Qc2ZGb3JsNjVFOEx1MEFMSFpWU1BmeFpQVjRCX2c5VHhqdGY0N21FUElBRHp4Rm1lS2s1aXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Why you shouldn’t worry about AI eating the stock market, top analyst says. The U.S. economy is ‘about to take off’ - Fortune",
    "description": "Why you shouldn’t worry about AI eating the stock market, top analyst says. The U.S. economy is ‘about to take off’  FortuneAI Loser Software Stocks Overshadowed as Hardware Earnings Jump  Bloomberg.comAI agents aren't eating SaaS—they're using it  FortuneGoldman Sachs CEO Solomon calls software rout 'too broad' as Wall Street looks to steady investor nerves  Yahoo FinanceHow exposed are software stocks to AI tools? We put vibe-coding to the test  CNBC",
    "published date": "Mon, 09 Feb 2026 18:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNMjU1aHpycm13bEFRellsUTJBbjg5N2JjbmR0WFphd28yVGNRMVFXR0pmRmgwS2xRdEZZV2tZWnZxSG0wUGpTTThpV0FJT0FvSENqODZnRXNBNjZnWUNXSGRPT2RvRUY2X2lKem9EVXB3dzNQcVVrVXhiLXdsUTJQWjNFcVc4UjN1Z2g4N09ZSzVIcUlycm9Ca0FfZXYydzNyS0tvOVJSRmQ3T3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "The first jobs report of 2026 is coming out Wednesday. It could be a doozy - CNN",
    "description": "The first jobs report of 2026 is coming out Wednesday. It could be a doozy  CNNComing Wednesday: The 'Super Bowl of jobs reports'  Yahoo FinanceThe delayed January jobs report will be released Wednesday. Here's what to expect  CNBCWhat To Expect From Wednesday's Report On The Job Market  Investopedia‘Consequential’ US Jobs Report Will Define Labor Market Slowdown  Bloomberg.com",
    "published date": "Tue, 10 Feb 2026 11:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOTjhZMzVndmloOW9GejVteHVjQkpUelR0d0dvcFp4bHpGTE5ycG9JVDhwbkpJVkRRYUQ4anRoU3VIWkpZY25RM3hrelBhOEF5bXdIb0daY3dRbzNaWkhCbFJTLXNNZVZkZGJmdUJfRzd1SDlxanBFUU42ZXhkbkp2X2tmcnJ5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  }
]