[
  {
    "title": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates - CNBC",
    "description": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates  CNBCU.S. Inflation Eased at Start of the Year  The New York TimesJanuary CPI breakdown: What the latest inflation report means for your wallet  Yahoo FinanceInflation measure falls to nearly five-year low as gas prices fall and housing costs cool  AP NewsJanuary inflation eased more than expected in promising sign for economy  The Washington Post",
    "published date": "Fri, 13 Feb 2026 21:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1rMzAwSXVIelF1VVJ2WU1YbzFiLWtfa0xMRDFVLTZpVE1WcGlrM3hPZnJScFV1b1A2WTNXX3JQeHFEcWRaTU5HdDlYMF83czJndGZqZUY0Y3piUTkzME5LaWFoVlFQQ0xCSXAyaGtlNUlMMU1JMTBJ0gF8QVVfeXFMUG1WcWJDeUpjZVd1ZDdzSWxFaEQ1VUlWX0NnWnFBZTQ1dFBmVlF1dWY1TzRjS2hUbjItWGxzWjFjczZ4QnU4RWVsQ2thWFMyZ0I4T2lfM0p0U3VaUFc4S0t5RXZVTTUyQS1sMzBQYWhOWlhWZ0lncmpnczY1Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Ring-Flock partnership: Amazon scraps partnership with surveillance company Flock Safety after Ring Super Bowl commercial backlash - ABC7 Los Angeles",
    "description": "Ring-Flock partnership: Amazon scraps partnership with surveillance company Flock Safety after Ring Super Bowl commercial backlash  ABC7 Los AngelesRing cuts ties to company that helps police days after Super Bowl ad  USA TodayAmazon's Ring cancels Flock partnership amid Super Bowl ad backlash  CNBCAmazon no longer working with controversial police tech company after backlash over Ring doorbell Super Bowl ad  NBC NewsFlock and Ring Cancel Announced Community Requests Integration  Flock Safety",
    "published date": "Fri, 13 Feb 2026 16:47:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNS0V3b09KRjIxNHZZZEVkY2JQdjAzcVVHTmpZYUFWV003QjlaeXJDX2tEc1VGMk1WTldjWmRYY3NJYmlDenBtVmNfVTJCMnRKMnNxVzROTWhoS0N4b0F0V29rcXJMZW5VODg4YlRiUWtrOTE0cDBidmVjR2NSY3pNMFlpWmNXQlNhX0lZVTEwV09aZkthejVRLTNxOW9IeEI5R19CLUpJWU1DZnZ6bWpxRnRUSVYwS1BGTmhTLU5fa1FMcGN0UFHSAcsBQVVfeXFMTlY4RjdWcWpVTWt1SVp0MzFETzE4SC1xd1FESmtPS3ZtMTV4dDZWYTFKby1LUVo2ZXhaWDFad0xCbjJJSXQ3U2hCd0N4S1pKNlRsTUxmTm1XeGw5MFBlZnYwZG9EMF92Q1EtOFF5NXVpb3FaOV8xbldBbFBZSWNRRjlwUUJTQUVCMnI0MXVqTFVGLTlPbEc5aDFpWjhZeVN1aTB6bmdvUXo4M0d1NzBKamlnUlpSbFh5R3NycEllN1dmdk1FRjEtaHQza1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Wendy’s closes US restaurants and focuses on value to turn around falling sales - AP News",
    "description": "Wendy’s closes US restaurants and focuses on value to turn around falling sales  AP NewsWendy’s will continue closing hundreds of stores through mid-2026  CNNWendy’s Sales Dented by Persistent U.S. Struggles  The Wall Street JournalTHE WENDY'S COMPANY REPORTS FOURTH QUARTER AND FULL YEAR 2025 RESULTS AND PROVIDES 2026 OUTLOOK  The Wendy's Company - Investor RelationsWendy's closing hundreds of U.S. restaurants as sales plunge  Axios",
    "published date": "Fri, 13 Feb 2026 17:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPT2o5dTRkYzJJNXE5Slhha2JFS3ROWUt0OFNTUmFaRkJ1bm5IUWxEaXhtUjA2ODBBOGJZTC01a2lycXhpZVF4SmtqLTNndTh1V2M1RGd1YTZ4dmpHXzBHSEJZeVl1S0VaSjJXRXYzQTVlZThzU1FsSWUxYzJ2dWxPeEdqWUd2VkFidmRXaTAwR21OenN1bVM4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Valentine’s Day sticker shock: Chocolate prices are spiking - CNN",
    "description": "Valentine’s Day sticker shock: Chocolate prices are spiking  CNNWhy your Valentine's chocolates are so expensive  AxiosCocoa crunch: Pittsburgh-area chocolatiers face Valentine’s Day amid cost crisis  90.5 WESAFalling cocoa prices won't necessarily mean cheaper Valentine's Day chocolates  Channel 3000Cocoa Traders Halt Ivorian Purchases as They Seek Lower Prices  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 10:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41QUZ5dnlocFl6MGlpeEVDV2JZTzNzd2N2dGZmWWtpbWN4SVFwR05HUlc1aTUzb2JCZlVWTGl5eTc2d3ozQmc2RGRkcXJCcnVMQnU1Rk1FanVSYUpXZDRsa0x0OG1GdzhLUi1nMVA2NV9US3kxS3kybmVKOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "OpenAI retired its most seductive chatbot – leaving users angry and grieving: ‘I can’t live like this’ - The Guardian",
    "description": "OpenAI retired its most seductive chatbot – leaving users angry and grieving: ‘I can’t live like this’  The GuardianOpenAI Is Nuking Its 4o Model. China’s ChatGPT Fans Aren’t OK  WIREDInside OpenAI’s Decision to Kill the AI Model That People Loved Too Much  The Wall Street JournalOpenAI is officially killing GPT-4o and users are freaking out (again)  Business InsiderOpenAI Retires Controversial 4o AI Model, Angering Loyal Users  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 16:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOa3o4Xzl3YnJmLTc2RFAxZGJkbEFBdW5MN0VCRW45NWdrMkpYd3c1VXBOYmlOYl9rM2cyWk1YNHlfY3RpY3hpQmh6QVI1b1BRZXhZU2hMcFVkSDNldzZxRGx2aEFWTS1ZUVY3U2ttODN6VG43MUR5T0RlMVo3NEh5aDl4Y2RnQ2ViRmQ1Y3NlZW80THNLb0JrTEQwWDN0NXRmd0EtOERR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Rivian Surges 30% On Upgrades As Attention Turns To Its New Tesla Model Y Competitor - Investor's Business Daily",
    "description": "Rivian Surges 30% On Upgrades As Attention Turns To Its New Tesla Model Y Competitor  Investor's Business DailyRivian surges over 20% on delivery guidance, R2 launch in Q2; CEO says 'key inflection' reached  Yahoo FinanceRivian tops fourth-quarter expectations, targets significant production increase  CNBCRivian shares surge as upcoming affordable SUV powers EV delivery forecast  ReutersRivian warns losses will persist ahead of next-generation EV debut  Crain's Chicago Business",
    "published date": "Fri, 13 Feb 2026 19:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOZmpIelVQYXdHMU12OFlycGlaZUlPU3ZwOEVmMG92Tmd4c285V2Z6b3FldTdnODN1YTBIZk12MFZ4aDN1dHpvTmNERWNUS3J2NzNjemV2YUZ2Y19TTHpNZFdSMld5RDNseEo3eE4tVTZ1Y1RBSDJxTHJycEhOZTY5R3ljdnlOWV92bGJIY2FQeUhHTHk3MGVuTHdtWUFiS1lTaVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry - The New York Times",
    "description": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry  The New York TimesTillis suggests Warsh faces long Fed chair nomination process that could restrict his business life  CBS NewsFed chair drama: Tillis pours cold water on off-ramp for Powell criminal probe  CNBCTillis continues to hold Fed nominees despite latest offer from Treasury  The HillBessent Sees Senate Proceeding With Warsh Confirmation Hearing  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 14:34:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOc2FXUkxlZ3VrMFFmd09nV3huTUttOFRpZHBNMEw4Y1czcnh6VWFiY3pWRHpoeEMtV2Y2bUppUUcwaDlGT0FrbXhTYTBIREpuVlQ4VTJNY2NnNkpDV2cxSDIwUWttWS1ySUpUcXlwMkx3UEltQXIzOE81MF9YVnRXTmI2bS1LWk5jSmFYaDFuT0NlaUxCMVdqTlZORQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Private-equity barons have a giant AI problem - The Economist",
    "description": "Private-equity barons have a giant AI problem  The EconomistAI disruption could spark a ‘shock to the system’ in credit markets, UBS analyst says  CNBCPrivate Credit’s Software Bet Is Even Bigger Than It Appears  Bloomberg.comHow private equity’s big bet on software was derailed by AI  Financial TimesHow Bad Is AI for BDCs? Not So Bad, Says This Analyst.  Barron's",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxON1pyOHYzcjVROHVrQlNPbEwzajRTUlBMV3NkZjBiVGx4Vk02NGpZWTlvSjRTc3dCQlZnenAtQUw0YWtfVnpvMWpHTE1sNWl4bjk2eFdmaHJVNnFYeGtrM2s5b3plb2ZmeGdBRlZwWGY5WnF2aHBYaElnX0loV2kwUEdQRHBkX2VWeWliQ25qNzZVVWNfOGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "5 Best Artificial Intelligence Stocks to Buy in February - The Motley Fool",
    "description": "5 Best Artificial Intelligence Stocks to Buy in February  The Motley Fool2 No-Brainer Artificial Intelligence (AI) Stocks to Buy Hand Over Fist in February  Yahoo FinanceAs Tech Stocks Churn, Nvidia and Other Semiconductor Plays Look Cheap  MorningstarAmazon, Microsoft, and Alphabet Stocks Plummet on AI Investments. These 3 Stocks Are Set to Win.  NasdaqBull vs. Bear: Are AI ETFs the Best Way to Play the Megatrend?  ETF Trends",
    "published date": "Fri, 13 Feb 2026 09:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPdDcxb1psdy1oZWtvOFg2UTJDZ1Rnakl4NDhSQUNDRzFNU0tnWmNFeFdkSG1rUEFGSGRNdzhvdU5WM3ExS1JCNnc1blZNLTdiNlRSanRPTnplN0hTYmNMOU5FRG9ibkhWdmkwM1RNVWpIR3BNOFVHTG96cHdxMFVHLWVrUjlDbGpqSEIyNVZRbXZVQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fool.com",
      "title": "The Motley Fool"
    }
  },
  {
    "title": "Corporate broadcast news fumbles January jobs report - Media Matters for America",
    "description": "Corporate broadcast news fumbles January jobs report  Media Matters for AmericaSome folks on Wall Street think yesterday’s U.S. jobs number is ‘implausible’ and thus due for a downward correction  FortuneStock market today: Dow, S&P 500, Nasdaq sink as tech stocks get pummeled  Yahoo FinanceFed’s Path to More Rate Cuts Challenged by Jobs Surprise  Bloomberg.comThe latest jobs report is bad news if you’re looking for work — except in these fields  MarketWatch",
    "published date": "Thu, 12 Feb 2026 21:45:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNTlBtRzU4b250b0lPQkIzanJfZEk3bVowdGx2Zl9zeXB6VlR3aEtJZHhuMnVsRDVsR2I0REpCRDRHSXhQMm5LWUhLSElDbTRXWWpyS1lwRjZoR09tb2tMX0xnWE0zdHc2WThjM2ZFeUZ6WUp0Nzl3cjMzNENYZ2JGOEZBZEppUVZRNTFDTjczUVlnUkhsTkNFZlNLQTY5MzlJa1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mediamatters.org",
      "title": "Media Matters for America"
    }
  },
  {
    "title": "Presidents' Day sales 2026: The best tech deals to shop this week from Apple, Sony, Samsung and others - Engadget",
    "description": "Presidents' Day sales 2026: The best tech deals to shop this week from Apple, Sony, Samsung and others  EngadgetPresidents Day Sales Start Now: Best Deals All Weekend Long  CNETWe combed through hundreds of Presidents Day deals on Amazon and these 99+ are the best ones to shop  NBC NewsAmazon’s Presidents' Day deals arrive early with sales on Apple, Carhartt, Sealy and more  Fox NewsShopping This Weekend? These Are the Best Presidents Day Deals We’ve Seen So Far, Starting at $6  TODAY.com",
    "published date": "Fri, 13 Feb 2026 14:50:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNbXZGS1VsanUzV3VBenVZMF9ZeHh5WkU0VmlleFRtOUZBOXJmdVRLVFBqZ0lBMUZlVjBRSlBMYlYwb0VtdWViUjI0ZVpWNGFUNlFRNmFHbmJBMG5zc1lzeDdSY2htRlFCMWNwQXRSZXFIZ0VuZ0V5aDZjMC1iRGpfX0JPWUtjR0JQaG8yNEZiMVA1MlhNSzVDWXk4c2RJLUxyVTdvb19yUEx0VkQxcnhFUEEzM2hkYm1XSzRDOHpINVVINDZVcFlIelp3Rml5NHBaVnVhQ3BmT3ZGUzFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.engadget.com",
      "title": "Engadget"
    }
  },
  {
    "title": "Shares in trucking and logistics firms plunge after AI freight tool launch - The Guardian",
    "description": "Shares in trucking and logistics firms plunge after AI freight tool launch  The GuardianFormer Karaoke Company Drags Logistics Into the ‘AI Scare Trade’  Yahoo FinanceOffice real estate stocks tumble as AI disruption casualties in the stock market grow by the day  CNBCFrom software to real estate, U.S. sectors under the grip of AI scare trade  ReutersReal Estate Stocks Sink on Worry About AI Risk to Office Demand  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 10:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOUS1ZcWYyVTFBNzl5MHhZMXRBaUtFbDcxcEg3elFISE4tUFhWeS15MlZJQ3RDVVdZY25MN0J1aUhndlh0LWlOVkktYW1aUk01X0MzbzRQQVVEWHRrYW4wTHJFaHVDTzc5T3pmMXNfd2RBRXBFb0tpbERuMk1md0ZnejhGRlY4aWN6MWswZEFiTlBJdzB1OEVyOUVMX3B0M2IxczFzLWU0aWVoY1AyNV9qRFMtVkFkWDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "USDA Announces Ground Beef Recall in 3 States—Nearly 23,000 Pounds of Meat May Contain E. Coli - Health: Trusted and Empathetic Health and Wellness Information",
    "description": "USDA Announces Ground Beef Recall in 3 States—Nearly 23,000 Pounds of Meat May Contain E. Coli  Health: Trusted and Empathetic Health and Wellness InformationEnormous ground beef recall issued over deadly E. coli contamination risk across three states  Fox BusinessOver 22,000 pounds of ground beef recalled over E. coli risk  USA TodayOver 22,000 Pounds of Ground Beef Recalled Over Possible E. coli  Currently.comGround beef shipped to 3 states, including Oregon, recalled due to E. coli contamination  OregonLive.com",
    "published date": "Thu, 12 Feb 2026 17:01:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE84ek0zdDFGRkRXMW1aR2lfR3QxaVVYUzlzYlBjd21Sb0pabUc2UTFhVzg5MzA2b2E2UERJVVhhVVM3cU5NWEpidzVhS3ZwbllWV1JUMkhkWDByY2VlOVRYbTA3Yll3WGdXTUMtcFdXTHphZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.health.com",
      "title": "Health: Trusted and Empathetic Health and Wellness Information"
    }
  },
  {
    "title": "Exclusive: Binance fires top investigators who claim to have uncovered evidence of Iranian sanctions violations - Fortune",
    "description": "Exclusive: Binance fires top investigators who claim to have uncovered evidence of Iranian sanctions violations  FortuneAnother Binance Shock: Team That Flagged $1B Iran USDT Fired?  BeInCryptoFormer CEO CZ Responds to Allegations Regarding Binance!  Bitcoin SistemiBinance Sanctions Violations: Shocking Revelation as Exchange Fires Investigator Who Flagged Iran Transactions  Bitcoin worldCZ rejects 'contradicting' claims Binance fired investigators after Iran-linked probe findings  The Block",
    "published date": "Fri, 13 Feb 2026 16:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPeTgyeGpNUTlMWEVERGUzWXR5N1BJLXZTTzFsLVZBazdwMmVNZE1jeHNCUFRva21id0s1eWFzSE9nYndIMVY5Z0NWN1FwS2E5cWoyblMzX1ZwWVpFUDYtVVdSYWdxeG1zVDdLWS1lVzZYdXhPRU5GZmNKamNHTDNPXzQ5ejc5dUFrX0VkYmIxXzd5Y0xzZy1aUkpvNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "‘Misanthropic And Evil’: Musk Rails Against Anthropic After Its $30 Billion Fundraise - Forbes",
    "description": "‘Misanthropic And Evil’: Musk Rails Against Anthropic After Its $30 Billion Fundraise  ForbesAnthropic closes $30 billion funding round as cash keeps flowing into top AI startups  CNBCElon Musk slams Anthropic AI models as 'misanthropic and evil' in scathing social media post  Fox BusinessAnthropic raises $30bn in latest round, valuing Claude bot maker at $380bn  The GuardianThe weirdest way to invest in Claude maker Anthropic is rallying again after funding round  MarketWatch",
    "published date": "Fri, 13 Feb 2026 10:35:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxOalZUZXMyaU9Zc1JWWFpGU2RCc1ZrY1hxTlR6U3NjTTZLODFRX01Bb25NMWJnMGhQMmg4RHNIam5xNGNQR2pNbHdIUzdRdlVZd1pFZnJhOUdBNUFYbERpbU9RVFIwV0JpZTJrM2xMWkZ3Sy1ETmdmU2FJdmRfWDlzZFBfTzhqTm5uOWpqdHhWVmFIdTdrY2x2WE83YUJ5YzBNMUhaQk5WWDdaWWdfQmFrUXVUelVPNXR0czd2dzBYcWJoOWMxVW5tVFBlWFFyWTRuNFBCeFBic0JaczBz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "The US economy is growing - so where are all the jobs? - BBC",
    "description": "The US economy is growing - so where are all the jobs?  BBCWhat Sweeping Revisions and a Blowout Month Tell Us About the U.S. Job Market  The Wall Street JournalThe job market was already ‘slim pickings.’ New data shows it just got worse  CNNUS's low unemployment rate masks lack of job growth  Le Monde.frThe Job Market's \"Just Trust Me\" Energy  theSkimm",
    "published date": "Fri, 13 Feb 2026 00:05:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE91Y1Ryb1F4WmtBemxSZVotQVN4VzZvVXRLS3NrcHVNTnNndVNTcjVmMDBFS2FWY1JIR3RYaUNuYnhHdFhKTjVia1kzWkFMUzFNSlJpN2Z4WTgxUdIBX0FVX3lxTE04X3RPOWx3cGVzUnZ5NzVMWHFOc1FheTFTczQ2bjg5VVVmQXVxMmk4SEFUUVQxd3YzYkR5cmtmckl6RU56ZEdRUWlGU21Ec3ZINjNHMl9HSjFDYlR0ak5r?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘Pure Corruption Reigns’ at Trump DOJ as Top Antitrust Official Gail Slater Ousted - Common Dreams",
    "description": "‘Pure Corruption Reigns’ at Trump DOJ as Top Antitrust Official Gail Slater Ousted  Common DreamsJustice Department's antitrust chief says she's leaving, effective immediately  NBC NewsGail Slater Leaves Role as Justice Dept.’s Antitrust Chief  The New York TimesDOJ antitrust head steps down  The HillJustice Department’s antitrust chief has been fired, sources say  CNN",
    "published date": "Thu, 12 Feb 2026 19:24:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE5pM2FUVTRwMld6NjROWktiWDNMbEh0eXdOZUJpX3VwLUthaUFKeUxLaDRVRmtHcGJzUDFMSzlBYnFHWWhxMWVSa3gxX1lrLXpPWGh5NFNmNmRsblBpV1pRRDFubFlLdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.commondreams.org",
      "title": "Common Dreams"
    }
  },
  {
    "title": "It’s been a software horror show. Here’s why it could get even scarier, according to Citi. - MarketWatch",
    "description": "It’s been a software horror show. Here’s why it could get even scarier, according to Citi.  MarketWatchSoftware firms need a ‘Google moment’ to prove their relevance amid AI disruptions – analyst (IGV:BATS)  Seeking AlphaSoftware Stocks: Are Investors Worrying Too Much About AI Disruption?  Morningstar Canada3 factors that will separate the ‘SaaSpocalypse’ winners from losers  FortuneGoldman Traders Launch AI-Proof Software Basket Amid Sector Rout  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 11:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOc3hJNFhlVnBramRPSDZvR3EwbFV1anBhQUpiV0Q4UnNNRlNiWktjYl9OZWRJOXp2SGRaMEJMZFhPeHF5aVNqNFc2Uk40YTBBR0xtc2Y2RE9sU01yX0pXVFduMnRScFQ5aG5GLWhRSlZkaWJ0TEFoTlhOTkxMbXNKV2tXQmdvV0V1bExBN0t6NHEwT0trS3RvU0lzR3dpajN3MEhtS2cwSmNkNHE3WG4yVGlMVGRNMUpLSHB5MkNNeHNZWkVPZEVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Moderna’s president weighs in on FDA’s decision not to review its flu vaccine - statnews.com",
    "description": "Moderna’s president weighs in on FDA’s decision not to review its flu vaccine  statnews.comFDA refuses to review Moderna’s application for mRNA flu vaccine, company says  CNNFDA refuses to consider Moderna flu shot in move experts claim is part of ‘anti-vaccine agenda’  The GuardianFDA’s Prasad Weathers Personal Controversy, Internal Strife Amid Moderna Imbroglio  BioSpaceModerna’s Flu Shot Ordeal Hurts Innovation — and Public Health  Bloomberg.com",
    "published date": "Thu, 12 Feb 2026 23:23:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNRnZyZHVyZVBnM01zSkdkYUZaQ21wNXhSX3RlNl9hLWZZNV9DejJkSGdKdnd6UTR0VnpaSi1VN3RDTVhkMTM0S3gyQU9pMmRaVGs4MGdYaEtMUGVyeWNIX1dRXzdieGVDQmtpbmZpaHZrcXFDY3pHUWdtS04ycm9sR1RjeDJrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statnews.com",
      "title": "statnews.com"
    }
  },
  {
    "title": "US could take action including fines against Hims after brief Wegovy copy launch - Reuters",
    "description": "US could take action including fines against Hims after brief Wegovy copy launch  ReutersAnalysis-US could take action including fines against Hims after brief Wegovy copy launch  Yahoo FinanceHedge funds bet big against Hims & Hers Health before Wegovy showdown, Hazeltree data shows  ReutersHIMS Selloff Creates De-Risked Entry (NYSE:HIMS)  Seeking AlphaNovo Nordisk, maker of Ozempic, sues over weight loss drug copycats  NewsNation",
    "published date": "Fri, 13 Feb 2026 11:05:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQd1k4Mzl5YUhMdFN6NS1QS3g2cFdacDViR2xfYjY0QWlrZHVaUDZTakNJc0p2ZmI1X0FJZWNFRFhxbmNJU2sxbDJfclB0VjRFT3k0SExHb1RlTFRyVUh5Yl9UaHMySHFKLVZUUFBhYTNyb3haOHJma3FJRFhTaVVxQzNDSHlNSFQyUXhWREYyczJfMkxyU1Y3TV9vamFlaFBvcDVVZm1iR0ZHWmFlclloLWYyOGY2MEZXVUZsOFp3dDR1MlZQMjNiU29nTXlEdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Instagram Boss: You Can't Be Addicted to Social Media - Newser",
    "description": "Instagram Boss: You Can't Be Addicted to Social Media  NewserInstagram Chief Says Social Media Is Not ‘Clinically Addictive’ in Landmark Trial  The New York TimesInstagram chief likens social media addiction to being hooked on a Netflix show in trial testimony  CNBCInstagram chief denies social media can be ‘clinically addictive’ in landmark case  CNNMeta really wants you to believe social media addiction is 'not a real thing'  Engadget",
    "published date": "Thu, 12 Feb 2026 15:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQN2tubEVxOTdFNVlGVXExdU9xaS14TXFneEU5dUEzT2pISy1EaFN1cndYaUV1N1RUR0JQLTJ3MENxb1ozLXN1emVjVkNmNlFLdEdlQVhzVld2V1RBZmNZTzRUdHNHU2cxalUxOVAwTmVYYkJ2eXgtX2xEVXFhZlJVb2dPZzg4ek9oTEZFWHJzTU4yUmROX1pF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Futures: AI Fears Grip Market With Inflation Data Due - Investor's Business Daily",
    "description": "Futures: AI Fears Grip Market With Inflation Data Due  Investor's Business DailyGlobal shares slip ahead of US inflation data, tech worries simmer  ReutersAI Angst in US Stocks Sends Global Money Chasing Asia’s Winners  Bloomberg.comDow slides 600 points, S&P 500 falls for a third day as AI disruption fears rattle markets: Live updates  CNBCStock Market Reels From ‘Sell First, Ask AI Questions Later’ Tech Slump  Barron's",
    "published date": "Fri, 13 Feb 2026 12:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQNWVtMldIN0FnZ3lxZTBmSjJfNUVXeGxOdkNjZUc1eGxtV1lTa3pKWTJqQ1pDbkdKYTFSQWZxVG1rUlJKa0FydXdvMXBJYmR1SGszNFhtRy1sR2lTYWtpRk1oaWdnUm9DeW9qMmQydDlvdWY0b2pmQW9PbkxSR3FuWXlXZmJsX0xGZDA1Y0FjTFdITGxNbXlHV0ZKYno2UGxZeEZsMWMzODE4MngwSVhqeml3TzZUQ2xwcDFELUNjRklBUGdHZjFpaHlOVkozSmJ2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Sanofi Shares Fall After CEO Change - The Wall Street Journal",
    "description": "Sanofi Shares Fall After CEO Change  The Wall Street JournalSanofi Replaces CEO Hudson, Names First Woman at Helm  Bloomberg.comSanofi's new CEO needs to fix drug pipeline and navigate Trump  ReutersSanofi’s stunning CEO switch—Chutes & Ladders  Fierce BiotechSanofi ousts CEO Hudson after stalled turnaround at vaccine giant  CNBC",
    "published date": "Thu, 12 Feb 2026 16:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPZ20xUWVINmN4WFNSU0NXN000N0l1aE4zUlJ6d3lZeG1kSk8xVnFMQng0Q3dfcWpDUFE4SUh5V2dGYjNfRVl6Y3hoWm5jcmpYYnN3Z3hTemxLalgzYjZWLVNsck5Wa2tKT3hlSWx5Y1RBeFltS25uWFZCV1U3eTFDUmVESXhOOFJyRUVrY3FycHVaM18zYXNyYUVlZkpERjYxNEpIUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Who Is Paying for the 2025 U.S. Tariffs? - Liberty Street Economics",
    "description": "Who Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNN90% of Trump's tariffs are paid for by American consumers and companies, New York Fed says  FortuneCosts from Trump's tariffs paid mainly by US firms and consumers, NY Fed says  BBCAs Trump touts tariff windfall, battleground states shoulder billions in costs  Fox News",
    "published date": "Thu, 12 Feb 2026 22:19:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOeFdvMVVjZC1HY3p3ZDNOVm5EZEFQNmNRUDU0OTVSVkVlNXlJN1VMY2xVRk5teHpST25CR1Z4bm9TaDlPaDdDYzE2a09FTVpyWjM1LUZJaG0yN0pHcGNhSnM3eTFqTTdWSC0zenVTekdHaEpZVGxqa2JkZ3l6WVRlR3JVOGNfeGdSR1huOWRMTGh4cXMyWklxdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://libertystreeteconomics.newyorkfed.org",
      "title": "Liberty Street Economics"
    }
  },
  {
    "title": "When Amazon badly needed a ride, Europe’s Ariane 6 rocket delivered - Ars Technica",
    "description": "When Amazon badly needed a ride, Europe’s Ariane 6 rocket delivered  Ars TechnicaAmazon Leo prepares for first heavy-lift mission of 2026 with Arianespace  aboutamazon.comEurope Launches Its Most Powerful Rocket With Amazon Satellites  Bloomberg.comBy The Numbers: A look at European rocket Ariane 64’s maiden launch  AP NewsMore power: first Ariane 6 with four boosters lifts off  European Space Agency",
    "published date": "Fri, 13 Feb 2026 00:34:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQcHVNWDJpRU43SktTcnNjd2x1Sl9SUHFodXU4VkY2LWFlUWJXS1pfT1R0bTdiWHZqSXFWSmtfX0xEQnVVaW9kdi1NUUtYeGMxZUtOanpmNWNjNmFHaHg0TENzRG5Dc3ZFWVI3Z2xQRE45VzFSZ1RESURGWExPNDg5a2JtaTJfU3dEODhVdXhBcWstNXJCbWFxNzZsa294NVEta3d2dkpLVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Gold Steadies After Sharp Drop Sparked by Wider Market Jitters - Bloomberg.com",
    "description": "Gold Steadies After Sharp Drop Sparked by Wider Market Jitters  Bloomberg.comGold rises over 2% as soft inflation data rekindles Fed rate-cut hopes  ReutersGold Reclaims $5,000 as Cooling Inflation Lifts Fed Easing Bets  Yahoo FinanceGold prices testing resistance just below $5,000 as US inflation cools in January  KITCOGold cascades down as strong US jobs data and stop-selling weigh  CNBC",
    "published date": "Fri, 13 Feb 2026 16:52:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPVVhlbWd1aFJLalN6MjhrSTJNNHpnRXN3SXI4TFM1Z0JCUE94ZjlLVXQtNWJFQ3NSempsWm9JWXpJQW5mb0dBQkE1cFp1cGJBLWtiVVBNejhUNU85OXV6cGJCaWRzbVB4Q1h0VUQ0aVkwcHFfSVIwRFc3aGkzZktPRWdDYm1IQ1VNU0dmc3lyQXlCVlV2RWh1VVFqZHRzTWFyZ1VhTXVITHJ4ZjYwVlRiWlJvNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "US concludes Alibaba and BYD have links to Chinese military - Financial Times",
    "description": "US concludes Alibaba and BYD have links to Chinese military  Financial TimesView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 17:15:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9tT0xESUdPMVR2Tk9ZdWlpRDJjUkR4eTQ0NGZkYzhha0kzbVJuOWdwSmtUR2R5ZW1ubjdPWXdWcUg3bEQ2emxldUFPWGprUUU0d2JfQ1JldTdJRFQxUFJncHdwUkgzeTlYSUZNUG5XWWo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Trump plans to roll back some tariffs on steel and aluminum goods, FT reports - Reuters",
    "description": "Trump plans to roll back some tariffs on steel and aluminum goods, FT reports  ReutersDonald Trump plans to roll back tariffs on metal and aluminium goods  Financial TimesTrump Trade Team Working to Narrow Scope of Metals Tariffs  Bloomberg.comTACO Trump Plotting Humiliating Retreat as His Approval Rating Plummets  The Daily BeastAluminium pulls back from one-week low after market digests report Trump may ease tariffs  Reuters",
    "published date": "Fri, 13 Feb 2026 05:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPczdzNi1QREpkeTVGVXB2VmdLNm10NU9GY21GeW5UN1VobjNlcUhzMVl3MndOZnlIcHQ3dS03ZmkzaHYwdjJFVVZZOEE0SGR1R0pVekVXYlVfVXU4LW42Y2wxT1ZRa1VfNjNwSW5NUTY1WGRXb2FTdmY1Tld2X2NUbnVZbUpZTlZ2N1l2Q0J1Ump2UHkzVjBadlRNUmU4RXpOSUNiU2tQeTFlMkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Amtrak Is Revamping Its Run-Down Fleet. Check Out the New Trains. - The New York Times",
    "description": "Amtrak Is Revamping Its Run-Down Fleet. Check Out the New Trains.  The New York TimesAmtrak’s new trains are arriving soon. Here’s what to expect.  The Washington PostAmtrak Cascades prepares for new trains as railway travel popularity goes off the rails  KATUAmtrak announces plans for upgraded trains on Cascades route  My Bellingham NowAmtrak offers first look at fancy new trains. Here’s when they’ll debut in the Northwest  OregonLive.com",
    "published date": "Fri, 13 Feb 2026 10:02:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBkVDFoR2ViZ1VJQmJ1bUtUckplc1R5V1FNdTRsVS1jMEJFN0cwV3czeWJER1p5WWRnemRJUW10TEo2OWo1VHdhQXNBY01LWFhyUDBpN3pod3NYQlVEVVgtejRVU2Y4QnVCVjNlcXNSbmh6ZWRqdWtV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "FinCEN Issues Exceptive Relief to Streamline Customer Due Diligence Requirements - FinCEN.gov",
    "description": "FinCEN Issues Exceptive Relief to Streamline Customer Due Diligence Requirements  FinCEN.govUS FinCEN reduces bank customer due diligence requirements  MLexFinCEN Eases Beneficial Owner ID Rules For Banks  Law360Banks get relief from US Treasury’s customer due diligence rule  MLex",
    "published date": "Fri, 13 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPc3ZsX0FsT3pCV09BYmZGYjNqX1pkZnRhZXlvS2ctamY2ZHEyUmtmS0lvUy1PbS1FVEdpN1p4MXN0QWtkZEFhanY2M2hmZHNRZkNNS2FDb2tLalhnRDBXb1UwdFVWcVhPcktpWjl3YkR0d1h5Q3dwdkpCblczeFo3MGIxMjlSLXlxODJUM0g2TE5Pc1lGSFlBeFhvNUlfYWdLSW1zYmJiMnVkTkZhR3N1RFp2Q1JSNkJVUUdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fincen.gov",
      "title": "FinCEN.gov"
    }
  },
  {
    "title": "Inside Will Lewis’s tumultuous two years as publisher of the Washington Post - The Guardian",
    "description": "Inside Will Lewis’s tumultuous two years as publisher of the Washington Post  The GuardianThe Murder of The Washington Post  The AtlanticBezos guts The Washington Post and casts a shadow over democracy  The Seattle TimesThe real reason why Jeff Bezos killed the Washington Post.  SlateWashington Post C.E.O. Will Lewis Steps Down After Stormy Tenure  The New York Times",
    "published date": "Thu, 12 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNbXhGcHUtR0ZTTGZkcWJxeHZVa1ZEcXFrOG9ZQUJURU8tcHg5cDlpcm91MUtGQmZ6aFlsb3VlZjE2dWV0UHdBMWl0SjQyaEtRZXplaVJWcmZOZkxidmZNNUdzVkN1dEhjSHpXam42UWtQR3RPak9JVU9UYW1JcVlHLW1hVW01cjQ4dUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Governor Healey Announces Massachusetts to Become First State to Deploy ChatGPT Across Executive Branch - Mass.gov",
    "description": "Governor Healey Announces Massachusetts to Become First State to Deploy ChatGPT Across Executive Branch  Mass.govHealey rolls out ChatGPT-powered AI assistant to help 40,000 state workers  The Boston GlobeMassachusetts launches AI assistant for state work force  WHDHAt launch event for new AI council, Gov. Healey says state employees will get access to ChatGPT  MassLive.comMassachusetts Is Deploying an AI Assistant for Its Workforce  GovTech",
    "published date": "Fri, 13 Feb 2026 13:14:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPYlhLZnZ6QXRmZ0doVmJBWDNWWGM3bU1jODlWcU05Nm5MY0Jsd2ZmUXpvQ1dycWVpbjB1RWt0VDRkazFKcWpKQVl2MFNINUZlc1Y4a21ybjM2d3E5TlVRem9scWhYbHlnZU5YaWZWMGRoLXliZzdNaGltNi1SMDB6MVFkU2gzWi1DYk9YbEhmakJwak1ZUVJyaHM3eUFGaXREZjJjYlluV0RjU3B1dUU0OVpLZ2gxZ1dSVzNoSmZ0eTRkTzlKSWNicQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mass.gov",
      "title": "Mass.gov"
    }
  },
  {
    "title": "Delta Air Lines adds 2 Hawaii routes for next winter - The Points Guy",
    "description": "Delta Air Lines adds 2 Hawaii routes for next winter  The Points GuyNonstop service from Logan to Honolulu returning to Boston  WCVBLei-ing down Delta’s largest Hawaii schedule: MSP–Maui launches, BOS–Honolulu returns  Delta News HubDelta will add new nonstop service to Hawaii from MSP airport  Bring Me The NewsDelta to revive nonstop flights from MSP airport to Maui  Star Tribune",
    "published date": "Fri, 13 Feb 2026 14:04:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5pODlGeTl3bG5vYTRZaGpYbUNPMkZPUTRGVXFDZWhhMENMSDNZU3h5S3E2LV8ySXMycXVlSG5pVWR3aGw2ZFFuTlVLVzB3X0YyTkN6TUc1NmV2YktVb3FZcVRIUmt5OVlpd0IySnBHMTAyRE40WWJkNy1LSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thepointsguy.com",
      "title": "The Points Guy"
    }
  },
  {
    "title": "Treasury, IRS provide guidance for certain energy tax credits regarding material assistance provided by prohibited foreign entities under the One, Big, Beautiful Bill - IRS (.gov)",
    "description": "Treasury, IRS provide guidance for certain energy tax credits regarding material assistance provided by prohibited foreign entities under the One, Big, Beautiful Bill  IRS (.gov)US Details New China Limits for Clean Energy Tax Credits  Bloomberg.comTreasury issues FEOC guidance, clarifies material assistance cost ratio  Utility DiveUS publishes interim tax credit rules meant to restrict China clean energy influence  ReutersForeign Entity of Concern Guidance: IRS Implementation of the One Big, Beautiful Bill Act and What it Means for Solar and Storage  seia.org",
    "published date": "Thu, 12 Feb 2026 21:36:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAJBVV95cUxPMlhjLUIyWlJ6Si1MVmo1ekF5UlAxUFo5M25iTHdmNnZFMU5MTFVsZVR3YzlYbTV5Tm9DNHRJSDRjOHRtNjMxcWg4MFBEYWNOTlUyMlFMaVZGYmpUZ3N1QkNGbGxtVU1MeWF5a2ZFRWJuQ00zdm9sR1J6TGllWHN6U0J3bWhUME5LZU1JZks1X0Z4OFBVSHIwRVVpaGNGQXBYMklER2RDeHN6UXVvVXVpX0RHOWVPM19VdW5RM1V5RFF0dXM3aHpfV25QbHJZVzJoNWtqVXRvNl9ZNkJVTGZ3Q2RNLWVYSFJNRHB2eDFDMUFSTGVMYjJPR2c1MW1JVVFMa3QxWXZ4VnNuSXE1RE1TN2p4YTBTQ0diRXhMdg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.irs.gov",
      "title": "IRS (.gov)"
    }
  },
  {
    "title": "Lurie requested PG&E restore power to opera before daughter’s ‘Nutcracker’ performance - The San Francisco Standard",
    "description": "Lurie requested PG&E restore power to opera before daughter’s ‘Nutcracker’ performance  The San Francisco StandardPG&E walks back claim that S.F. Mayor Lurie meddled during blackouts to help daughter’s ‘Nutcracker’ show  San Francisco ChroniclePress Release: Supervisor Alan Wong Holds Accountability Hearing on PG&E Power Outages  Richmond Review/Sunset BeaconSF supervisors dig up answers from PG&E on December blackout in public hearing  Local News MattersPG&E CEO promises change at SF hearing on December mass power outage  KTVU",
    "published date": "Fri, 13 Feb 2026 02:33:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9uUEd5MWYtM3F1WDJ1R0VCcnFMOEM4TTVKTTg5T09Fc0JFZWptYkZBdm9OcnJNVEVOOVBRcFBNVmQzWXhmOG1BTFVOOG9Kc1pRUGtiUU9yMVRwYWpFVURRUm1oanRsM3RhT2xFVVZoempnaTY2ZnA3a2d3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Dog Owners May Want to Switch Up Their Kibble - Newser",
    "description": "Dog Owners May Want to Switch Up Their Kibble  NewserCommercial dog food contains ‘alarming’ levels of lead, mercury and other contaminants  CNNVIDEO: Study says dog food contains dangerous levels of metal  KIRO 7 News SeattleLab review finds many popular dog foods contain heavy metals, plastic-linked chemicals  WKRCFRESHPET BECOMES FIRST DOG FOOD TO EARN CLEAN LABEL PROJECT CERTIFICATION  Yahoo Finance",
    "published date": "Fri, 13 Feb 2026 13:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQdjVpbl9sbEJvZE0yX0hoUlc2UHA5SzczQ2JzYjRXY0NyZ0VvOWxDMGVSbjliSndKbHl5WWdSMi1vVmU1TGxLOURNSkcxekREb25tWGVGY1AyYlhWVTVYRzNtM3U1TVZRRDFVQ0VuUXRfV3lwT19zLU9ReWd5RXk2RVJHOGY3OUcxX1EzNTE2NENYaS1HUklZMXd5SGdPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "NAR Existing-Home Sales Report Shows 8.4% Decrease in January - National Association of REALTORS®",
    "description": "NAR Existing-Home Sales Report Shows 8.4% Decrease in January  National Association of REALTORS®Realtors report a 'new housing crisis' as January home sales tank more than 8%  CNBCRealtors Raise Alarm Over ‘New Housing Crisis’ Under Trump  The Daily BeastHome sales plunge despite affordability improving  AxiosRealtors warn of ‘new housing crisis’ as home sales fall at start of 2026  The Independent",
    "published date": "Thu, 12 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPZFNoQnB4bkVRTURBMm44ZzVQVnEzdXNXRmlEOXRSUWVCRVpoZXU3eHU4bGhsTWpjWjFXWVJyZFNHSXV4Ym42WmUzejRPeV9GZXVLYmNfbHhVVE4wWVRwSmJ3aFZuUFo3RGUwODBHOE4yNGVnblRoYndMYmZTWkYtc2pmRUtidXBLY2ZQUnYzZXJlUERhMVUxcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nar.realtor",
      "title": "National Association of REALTORS®"
    }
  },
  {
    "title": "The 2027 Toyota Highlander Gets An EV Feature Most Teslas Don't Have - InsideEVs",
    "description": "The 2027 Toyota Highlander Gets An EV Feature Most Teslas Don't Have  InsideEVsSee the New 2027 Toyota Highlander's Exterior, Up Close (Photo Gallery)  Car and Driver2027 Toyota Highlander EV Interior Review: Quieter, Smarter, and Way More High-Tech  MotorTrendSubaru Has a New Three-Row Coming That’ll Be Built with Toyota Bones  Gear PatrolSee inside Toyota's new electric Highlander — its first 3-row EV to launch in the US  Business Insider",
    "published date": "Thu, 12 Feb 2026 19:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxONUFJZHd5SWUtWWxoS2hhUU52anMwVEhibzZBY0NleFJETWV4UWZfeGVITmRZbnhGbVpuaXp4VnhOR2xHV2twUTQzaUFlMmZqbEFzRld0V1NMNDRVOF83c2JlQUxlM3hYcE9JeG1ETHl1UEQ3S0JlS3ZMRWlMbG1PQjd4N1I2QUZYZXYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://insideevs.com",
      "title": "InsideEVs"
    }
  },
  {
    "title": "Trump’s campaign against ‘left-wing’ media finds a new target: Apple News - The Washington Post",
    "description": "Trump’s campaign against ‘left-wing’ media finds a new target: Apple News  The Washington PostFTC warns Apple over alleged lack of conservative news  BBCF.T.C. Chair Warns Apple Against Bias in Apple News  The New York TimesFTC warns Apple's Tim Cook over alleged political bias in its Apple News app  CBS NewsTrump’s FTC chairman chides Apple boss Tim Cook for content of Apple news feed  AP News",
    "published date": "Fri, 13 Feb 2026 07:41:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNNEJrQU9zNDlVWW1wY25FTVhhY2x0UTl3M1E1MHpBWGdaYWZOSGhmM0M0b042Q2hFbE9SU0dqdk9NbldvSTB3VFVpLS1mYnNKekNfY0tPblJxZ3FJcUFERHdBZFBDNlJabnMwRTVCV18yZTAtSDFXOXpEYmtHVF95QkItT2I4cjNTWDZUcTdaWmRvczA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Schroders agrees £9.9bn takeover by US investor, ending 200 years of family ownership - The Guardian",
    "description": "Schroders agrees £9.9bn takeover by US investor, ending 200 years of family ownership  The GuardianWhat is Nuveen and why is it buying Schroders?  Financial TimesSchroders Sale Is Inevitable End of an Era for London  Bloomberg.com3 charts: Nuveen’s acquisition of Schroders  PitchBookSchroders agrees $13.5 billion sale to Nuveen as family sells out  Reuters",
    "published date": "Fri, 13 Feb 2026 02:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNMi1JcDQ1eXlqVXQ4TTRHZUl6aXJ4eklCMVZUbW90MTZVWVFmOTduZl9kLXBwQzRMZmVIampoODZsbnZaTFZpVVNaV0FfaVQwLXdyRUxPWEJialIxUnNlVUt3a0JFTVpvcmVqSXRscFJ0bmpNX0N1emRrWk41S2l1aEpTak04cG5SLTJSdV8zbDFaVG1Oa28tU1dTM29RVWFIMk1mUFdRak90N2xhUTVGYmdzdlVMWlNtcGZzMzlKbFoybDVIYkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Air Force validates open architecture, expands Collaborative Combat Aircraft ecosystem - af.mil",
    "description": "Air Force validates open architecture, expands Collaborative Combat Aircraft ecosystem  af.milUS Air Force’s CCA program advances with auto-flying software integration  Defense NewsAir Force begins testing mission autonomy package for CCA prototypes  DefenseScoopAir Force Working with Collins, Shield AI to Build Autonomy Software for CCAs  Air & Space Forces MagazineGA-ASI ACHIEVES NEW MILESTONE WITH SEMI-AUTONOMOUS CCA FLIGHT  European Security & Defence",
    "published date": "Thu, 12 Feb 2026 19:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQZjlrME5aS1V6VXZjVWgzQmVCREh5aWxfZTJYZUFmQzhjZ05zQ2lJSl9wNHJKV00yUFlGR2ZUV3FYa1F4bUVQRHQwY3RLSzNZcTl2Y19RNFdWUlZEV3BvNDJfVHFJckp2Nkpfb0tBSVJ0bjBhUW93QklENFdMZnFYa0FTRXI5YVJZTVdTS050TzlPUjdEWF8tLXFnXzZ3b2tweENJdFd2ZHRlZDU3d0xIYkRSUXM2YjR1VkswRDFWWnVXRExYcWpOX1RGT3lCMjNTTnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.af.mil",
      "title": "af.mil"
    }
  },
  {
    "title": "Most Jobs Added Last Month Came From a Single Sector - Newser",
    "description": "Most Jobs Added Last Month Came From a Single Sector  NewserUnderpaid and under pressure: The eldercare workforce leading America's job growth  NBC NewsHealthcare Jobs Have Become the Engine of America’s Labor Market  The Wall Street JournalThe top 10 fastest-growing jobs in health care, according to BLS data—some pay six figures  CNBCThe Quiet Economic Force of Healthcare Jobs  Barron's",
    "published date": "Thu, 12 Feb 2026 16:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPejZzM3JLbl9odHZicWVMeWdvTGdfQ3YtZ1NIek9rOFpRN0VZVmM0cG9HSGE1eFE2R3ktNFdDa2wwWFQ2TGgzem5GNHhpTURDNFdHdTJKdk9jYlR4dVE4RUpHZi1qcTRWNkk0Sy0zRGdFZ0hEZ2hIbDExb0pCdFpWM3VmUXhJRlByXy0zYW9CNzJtZTFfMGgtSw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Eli Lilly builds $1.5 billion stockpile of weight-loss pill ahead of FDA decision - Reuters",
    "description": "Eli Lilly builds $1.5 billion stockpile of weight-loss pill ahead of FDA decision  ReutersLilly's pre-launch inventory of oral GLP-1 candidate swells ahead of expected FDA obesity nod  Fierce PharmaEli Lilly boosts weight loss pill inventory ahead of FDA decision  Seeking AlphaPharmalittle: We're reading about Lilly bulking up on weight-loss drugs, scrutiny of a 340B contractor, and more  statnews.comEli Lilly's $1.5 Billion Stockpile of Orforglipron | PharmExec  Pharmaceutical Executive",
    "published date": "Thu, 12 Feb 2026 20:27:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNSUw4Um9pMzN6Szd0WEhQRkJsOXpJUnJibnR0eXIzRlZsajN1QzBzbHhrdnlZRGNXV2pmLWVVcTBjYkJZY2FHVUhCcVRXQVVoSGl0Sm1RYVZ5a2NkTmhtalNRMUFhbWhFNW9sZHMtNl8xZC13dzdWZlFlV0JSeUFiNkM4LXdJNjZWSzhCSnhKZ2ZxMWhUUl9YWjdBZXh4RUR6Z0NLanNTNEdUd3cxVXgwUTdGTGRUTFphSThPdnYwZEJJZHpUMnZLOUVZWVY5MjJhb3l4cS1VQ19FMy1KMmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT - TechCrunch",
    "description": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT  TechCrunchPinterest stock craters 20% as tariffs hit earnings. Here's what's happening  CNBCPinterest (PINS) Reports Earnings Tomorrow: What To Expect  Yahoo FinancePinned down by AI: Why 619 million users may not be able to rescue Pinterest  MarketWatchPinterest plumbs six-year lows after tariffs sap ad spending by customers  Reuters",
    "published date": "Thu, 12 Feb 2026 23:26:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQckFwYVpyeVdVUFdHLXBULXJwTThrN2o2QjdfWmloOTZsMm9vcGpYamwteDdzbjA1TDIyX3FkZ0JEb1AwUjBDYVQ1R3ZyU2ZUNm5iNkNTdEtLdjRFSEdwM3I1TGFmUlhYVjNXZ0JJWDU2MjVXU0FOSFl1OUFkbVRKa0NJRzFxMG9oa0kza3VNVnVENHFJbFNCaEludnpLNTlVMUNVa0lUdE1fTlhHUmp6R1k4bkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Mortgage Rates Slide to New Multiweek Lows - Mortgage News Daily",
    "description": "Mortgage Rates Slide to New Multiweek Lows  Mortgage News DailyWhat are today's mortgage interest rates: February 12, 2026?  CBS NewsMortgage Rates Oh So Close to 3 Year Lows  Mortgage News DailyMortgage and refinance interest rates today, February 13, 2026: Low rates and new home discounts entice buyers  Yahoo FinanceMortgage Interest Rates Today: Rates Drop to 6.09% After Better-Than-Expected Jobs Report  Realtor.com",
    "published date": "Thu, 12 Feb 2026 20:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1ZeUlWLUUwVlphbDRpUWt5WGtNYVllNjQ1NS1iY2VURWNZMTBVWGhRQld3LWh6ek5SeUJmUzBWSHN5Mm9TSDZNOVc3eHE3WDBTS0ZFdkdnS1YzUi1hOVc2Q2QyMFRKazhLWDRJcmtQN1hTVlHSAXRBVV95cUxOQ1dray1QNkVvR1Y0RnVDcVNUZFR5emNSNmNvN0lZcEoyejk5TmdWYnRsWHJnMlh1OWNCUmNvQnRHTkE1SUpsOFFCemwyV3B6YlQ2MGx6UFZTMncxTGxPcG1RY1FpclFkMy0ySkNLdXpCOU5hcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mortgagenewsdaily.com",
      "title": "Mortgage News Daily"
    }
  },
  {
    "title": "Aurora’s driverless trucks can now travel farther distances faster than human drivers - TechCrunch",
    "description": "Aurora’s driverless trucks can now travel farther distances faster than human drivers  TechCrunchAurora says automated long-distance trucks mark dawn of \"superhuman\" logistics  AxiosAurora Innovation (AUR) Targets Positive Free Cash Flow by 2028 Amid Ongoing Expansion  Yahoo FinanceAurora Triples Driverless Network to 10 Routes and Prepares to Expand Across U.S. Sun Belt  Business WireAurora’s Driverless Trucks Can Now Run Longer Than Humans Drivers Are Legally Allowed  InsideEVs",
    "published date": "Thu, 12 Feb 2026 17:58:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNcnlqaVVHZjBTdk5uanpla0VkRXctSlViWWgzYWIwSWFEdDhGbEZpcTFVQ3Jsdmc2V3JnelpjMFZSckduaU1nTC1UUGVDN3ZheG1uaUNOdEdtbEtXcEpVXzkzSHpmVTBzX3ZtY1pyMkRacXJtQzlDQkI2TmNYSF9weEhPWGtEUElJNTBOcFRpS2FzLXJ4UVhLY1dfTG1XdjVKUWJlRmFqbW5Ia3RsYTNpR0lYbHBFcGF0SU9Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "'Wizard Of Oz' At Sphere Hits $290M In Sales; \"Enhanced\" Version Coming - Deadline",
    "description": "'Wizard Of Oz' At Sphere Hits $290M In Sales; \"Enhanced\" Version Coming  DeadlineSphere CEO says Maryland venue may open in under 4 years  thebanner.comSphere Crushes Earnings Estimates, Stock Up 370% From 2025 Low  Sportico.comDecoding Sphere Entertainment Co (SPHR): A Strategic SWOT Insigh  GuruFocusQ3 Earnings Outperformers: Sphere Entertainment (NYSE:SPHR) And The Rest Of The Leisure Facilities Stocks  Yahoo Finance UK",
    "published date": "Thu, 12 Feb 2026 17:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQMFJXOVF2M3BsbHdvd01QVUllMEI2Rms4NnVVaGRUSkVkOHRsd2Z2UTNOVk96VkdncjRHWmVMZENDT3QycTNhcG81a2VmVDRLd3dvVkw4YWx6NmZkZ3RSNlp5bEd2RFM0aDZnZ296SzF5Q05kRVRiRW9YbDV2Z0RuUTRkVmpFc2lxSXdsM1NfOFJXb0V5eVJ6YUVPU0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Beginning fully autonomous operations with the 6th-generation Waymo driver - Hacker News",
    "description": "Beginning fully autonomous operations with the 6th-generation Waymo driver  Hacker NewsView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 17:13:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTE02bEViMjBPTlcyMEFxckFFOW9ySUFqOVgwY2xXdTRYRWZhdnpzTklQTmZNNTRNTkVHZGNtckx5Yi1jdFdtZ3J1anNoNE9LUUN4Z2VlVFJtd3o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.ycombinator.com",
      "title": "Hacker News"
    }
  },
  {
    "title": "BofA Says Anything-But-Dollar Trade to Lift International Assets - Yahoo Finance",
    "description": "BofA Says Anything-But-Dollar Trade to Lift International Assets  Yahoo FinanceErratic US is spurring 'middle powers' into action and investors are noticing  ReutersAre Investors Really Selling America?  The Wall Street JournalAs 'Sell America' trade volatility rages on, some of the biggest changes may be in your bonds  CNBC'Hedge America' Trade Takes Over The S&P 500: Here's How You Can Take Part  Benzinga",
    "published date": "Fri, 13 Feb 2026 09:16:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVlBrb3NvbzcxQWJ4REdUSW1ZNDg2Z1JaT0hBM0M5TVYtRG51S3MtMGpDYmNKRTdZZkpxaWZ6aVFUNXh6Tk8xQmtaT0dQdzkyd200VTdjNk9iRDdaOGxRRjBPZml3cUFfdGNYa1NNbm5WMFpQOWNzc193bnh3RGNJa1RNUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://finance.yahoo.com",
      "title": "Yahoo Finance"
    }
  },
  {
    "title": "Khan Academy CEO warns even a 10% workforce reduction due to AI 'will feel like a depression' - Fortune",
    "description": "Khan Academy CEO warns even a 10% workforce reduction due to AI 'will feel like a depression'  FortuneThe godfather of AI predicts mass unemployment is on its way. This CEO warns even a 10% reduction ‘will feel like a depression’  Yahoo FinanceAmerica Isn’t Ready for What AI Will Do to Jobs  The AtlanticThe big AI job swap: why white-collar workers are ditching their careers | AI (artificial intelligence)  The GuardianThe real economics of AI and jobs  The World Economic Forum",
    "published date": "Thu, 12 Feb 2026 10:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNVU1oRFYzQXZpNkFoR1E1RGVReE9pcVVUcUpXdkdneDFfOTRkVFp1QXN5enVKcmk4UDR3NFc5SUdGYmJkU0didG9QbmMxTkVmcnRPZWdTbVFZZGpRaFZnVlhkeTVXUG5CZml4c3ZWMHI5bmliS1BlckdXbThzOW5mZFowTnVuUVRtSXFyS1BoMndYYVVocldzaUpqQ2Y2VU04SGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "AI toy maker exposed thousands of replies to kids, senators say - NBC News",
    "description": "AI toy maker exposed thousands of replies to kids, senators say  NBC NewsView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 18:02:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPQjIyYkw0a09QMENjU1ByM3JCTFRKb3ZFcmFaNExPMnBmRzFMT25qencxTC1pd2RVYU9DYnpFQXVxUEx2eUMybWV0blVNNHVHSmNzdGhvel9PUHR6YmVxeE5uT0JNYnQwS0YxM2NfTFo4Y3YwVHhwZWFqZExxYkpYVktrakdVN2dOaTRRWUFvQXo4bzI4VDIwVVloZFFHOUdqSHhTTXBUSm1ISUFO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Warner Bros. Discovery Stock (NASDAQ:WBD) Slips as Paramount Skydance Ramps Up Proxy Fight - TipRanks",
    "description": "Warner Bros. Discovery Stock (NASDAQ:WBD) Slips as Paramount Skydance Ramps Up Proxy Fight  TipRanksActivist Investor Pushes Warner to Walk Away From Netflix Deal  The Wall Street JournalParamount enlists top WBD shareholder in push to derail Netflix takeover  Financial TimesActivist investor Ancora to oppose Netflix-Warner Bros deal, backs Paramount bid  ReutersParamount Skydance Says It Will Pay Warner Bros. Discovery an Extra $650 Million per Quarter if Its WBD Takeover Isn’t Completed by End of 2026  Variety",
    "published date": "Thu, 12 Feb 2026 21:00:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOaW1JenNMNWN5TExUbk1YakdWQ1RpM2xaODBGNGhQazFId3hvb2l6Vk5pME81RkpSenRUbjZqcGt5TXVQVklfRTBNcFZtM1FURFVuYW9KNTFpYVlrdFZRaTNBaUZWRURKZldCejVPX2l1ZC1WNXZtU0t5S3dWZlgxX29kMjVScHZ6M2dVdTNXdEtNMFRGWktkMXdFZHN4ZVM1VmNfcDhHcWNCWjF5WmlsLThtT0lUWDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "FDA Approves First-of-Its-Kind Device to Treat Pancreatic Cancer - fda.gov",
    "description": "FDA Approves First-of-Its-Kind Device to Treat Pancreatic Cancer  fda.govNovocure Gets FDA Approval for Pancreatic Cancer Treatment; Shares Soar  The Wall Street JournalFDA Approves Wearable Device to Treat Pancreatic Cancer  MedscapeA pancreatic cancer approval; Seres cuts staff  Endpoints NewsU.S. FDA Approves Novocure’s Optune Pax® for the Treatment of Locally Advanced Pancreatic Cancer  Business Wire",
    "published date": "Thu, 12 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQN2R2SjZJcVdYVkdvWnFyVkhBemgyc1NqR254VzVUNk1EeEZ6b3ZQWDhVVUNDTXdyVlVzb052a0thSUhkVm1ZYkZUdko0TWlQOUJpSGhoUEYwbllPcDRWTlFMSFY5X05kZnNXd09qRWtEa1hRRzNGNTFvbkdEOUhFcUF3VDE2NEVzdG91a2NneE5CNVFGZDlRTV91alYwUE5ScWtHcmlpRFVKZ3Fzc3JF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fda.gov",
      "title": "fda.gov"
    }
  },
  {
    "title": "Done Deal: UMG’s Downtown acquisition approved by EU competition regulator - Music Business Worldwide",
    "description": "Done Deal: UMG’s Downtown acquisition approved by EU competition regulator  Music Business WorldwideUniversal Music Gets EU Approval for Downtown Deal After Agreeing to Sell Royalty Services Arm  The Hollywood ReporterFrom UMG’s approved Downtown deal to Spotify’s AI ambitions… it’s MBW’s weekly round-up  Music Business WorldwideReport: EC To Approve UMG Downtown Acquisition  Hits Daily DoubleIMPALA Responds to EU's Universal-Downtown Deal Approval  Digital Music News",
    "published date": "Fri, 13 Feb 2026 10:48:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQeWJHRFQ3TlNKTlpZRURkZEFjNDBVVWktdEtwSWpJeHJSQ2s3WkcwWG5JbkFLdWtUQVRaSFJXZmNhdnRFU01yTFY0ZTNlSW5neml0bUw2ZDZOclZkTUZSNGpaTG9McWNpQURoRVM4TzBNeUVtVjFTQUlHLUFua2NVZWhZU0dScUNGNTdkNEhacldjQnFnc0FoSVJwTXE3R01lZFA4YmZQZnB6dUlyM0VZLQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.musicbusinessworldwide.com",
      "title": "Music Business Worldwide"
    }
  },
  {
    "title": "Chinese AI models push pro-China views - Axios",
    "description": "Chinese AI models push pro-China views  AxiosChina’s Rising AI Billionaires  Bloomberg.comWhat’s next for Chinese open-source AI  MIT Technology ReviewChina’s AI Boom Is Creating Billionaires At A Sizzling Pace  ForbesThe AI Divide  Foreign Affairs",
    "published date": "Fri, 13 Feb 2026 10:01:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBUblFqN2RNVXBJNHExM3YyOXJLSXFDS0FPNWRyS1JkRDhyWE4yelhuTUFHT0JCVjJpWmtDTExPZkZNTWhkbEFfcGNrNmtEb1F1b0NNMzZnYkh6YXNuSi0yWWRNeEpuNWRTaWl2WkpLcTg4YkVxZFIyYXJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Applied Materials Trounces Expectations With Big Quarterly Beat - Investor's Business Daily",
    "description": "Applied Materials Trounces Expectations With Big Quarterly Beat  Investor's Business DailyApplied Materials jumps as AI demand drives chipmaking tool orders  Yahoo FinanceApplied Materials' results were 'solid,' but Wall Street is impressed with its guidance (AMAT:NASDAQ)  Seeking AlphaApplied Materials Profit Rises on Soaring AI Demand  The Wall Street JournalApplied Materials’ stock jumps after earnings. The CEO just made a bold prediction for the chip sector.  MarketWatch",
    "published date": "Thu, 12 Feb 2026 21:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVjBLRE15Zkwwd3Y0UVVzRzlhT3dKTmNsb2s0V25SX0tNNVFTbW5OeDhyLXpidnNtQlFoaXp5N013U3lXWmtXRHp6bHp5Y3hkeDRoajdLVVlFU3hXZGVQaEhtRXl0S08wVFZtNWJWTUJqMWVmS3YtQzlpeGRpZmdySXl6ZmZvLUhza2JFWFBycVhYc2p6UFpLVW1tUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Software engineer says companies should only expect 3 hours of vibe-coding work a day due to AI fatigue - Business Insider",
    "description": "Software engineer says companies should only expect 3 hours of vibe-coding work a day due to AI fatigue  Business InsiderAI Doesn’t Reduce Work—It Intensifies It  Harvard Business ReviewIn the workforce, AI is having the opposite effect it was supposed to, UC Berkeley researchers warn  FortuneThe first signs of burnout are coming from the people who embrace AI the most  TechCrunchAre you feeling AI fatigue at work? We want to hear from you  Yahoo Lifestyle Singapore",
    "published date": "Thu, 12 Feb 2026 15:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNZ2w2TUhjY1ZGSzgyenRnZ0RxMEc1aUxsUjRnYWtGc2pKbFFCRGhqU3hzRXJzQW9PbmhTUGVCc1o4UkxyNThBUmVMUUd2ZXM0ZFJoeHhadXJDZFVfUUVyem9pblB4Z2VnbEltdDdmYUJ2enhXWUtpaUl5RWFxUzEwLUt2bENpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "As electricity costs rise, everyone wants data centers to pick up their tab. But how? - AP News",
    "description": "As electricity costs rise, everyone wants data centers to pick up their tab. But how?  AP NewsCovering electricity price increases from our data centers  AnthropicAnthropic to cover costs of electricity price increases from its data centers  NBC NewsAnthropic says its datacenters won't spike your leccy bill  theregister.comDatacenters and Electricity Costs By the Numbers  RealClearEnergy",
    "published date": "Fri, 13 Feb 2026 05:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOdUNEZS1GR1puR2lRRm0xeWJXaHpZcnc2R2FpWnFZWW1wSXp0dVEwM3dhbS1yeUhUVEVzallQZTlUa0ltNWZfaHo1cWJMU3BPU1pHZEVQUk9NdHZER3pOQ21obVVpblg4b2lmaGZybVRmVUVzMHRGU19HRF9hRVBSWlBidzRVYXFoZmhnYkdxTmh4SV9EdkhWM2I5QVdnY1VMeTQ1SmZRZ2I0U1IySVhXRi1BZ0MyLUNBTnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Coinbase Reports Q4 Miss With $667 Million Loss Amid Bitcoin Retreat - Decrypt",
    "description": "Coinbase Reports Q4 Miss With $667 Million Loss Amid Bitcoin Retreat  DecryptCoinbase Scores Q4 Miss. Here's Why Shares Are Rebounding.  Investor's Business DailyCoinbase’s $667 Million Loss Snaps Eight-Quarter Profitability Streak  PYMNTS.comCoinbase swings to surprise loss amid crypto exodus, but says traders are buying the dip  MarketWatchCoinbase Delivers on Q4 Financial Outlook, Doubles Total Trading Volume and Crypto Trading Volume Market Share in 2025  Coinbase - Investor Relations",
    "published date": "Thu, 12 Feb 2026 21:27:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNMGk0WVNrZXp4eGZNN1R4ajJmN2wwMnFVS0ZlNEpBbDJMYjNJX3RwWEoteFNiUnZtV0tqeEJDYV96TVVTbUxuZ0NQU1haS0o0MlM2X0xBV3UySzA0RTVMdGtDWXYzZ2FXSXZLZkt3TFdKREFpbG5GREhzUFR1eWhQLdIBiAFBVV95cUxPd2tGZlpzTEd1U0k3QWEzVy1pMWJWSnhKVkZ2Y2ExODRrMDZDeHhOcS05X3J2Yk9wLW5BZlVxampGUi0yQkpBdkZubjd6dTJtWkFjQ1ZkTEJsallEYjJHWXBPMDVNSUNwakpEUXBLdlN3NnRoVHd0MFdBSS1ydGpERzhNc05NMlRq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://decrypt.co",
      "title": "Decrypt"
    }
  },
  {
    "title": "Axiom Space Secures $350M in Financing to Accelerate Space Station, Spacesuit Development - Axiom Space",
    "description": "Axiom Space Secures $350M in Financing to Accelerate Space Station, Spacesuit Development  Axiom SpaceAxiom Space raises $350 million backed by Donald Trump Jr.'s firm, Qatar fund  CNBCAxiom Space raises additional $350 million  SpaceNewsVenture moves in space and manufacturing to highlight  Washington TechnologyAxiom Space To Invest $350M In Commercial Space Station, Spacesuit  Aviation Week",
    "published date": "Thu, 12 Feb 2026 23:39:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOei02MndKRThBbFJoUVV4OFg5QnE1bmF3LXNGa0lzTmNXdG5HalVOYzNRT2Q3SEY0U3dRUGpIUzJnTGZTOHZPRlJoWDNqallVNllmNV9uV0MzQkZpLWd1NjZpTXVrWmpPa2pEdGxGOUx3WmNvZjlXaHEtT3M3XzM4SEhlQzMyU0xLcGI5aHktRExVaFM5SF9naG5SRy1WRzRUa2o2SmdBbTc0N3BuSVkxLWNVNzc1QUNvLUcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axiomspace.com",
      "title": "Axiom Space"
    }
  },
  {
    "title": "\"He Sounds Nervous\": American Airlines CEO Robert Isom Responds To Union Revolt—Here's His Turnaround Plan - View from the Wing",
    "description": "\"He Sounds Nervous\": American Airlines CEO Robert Isom Responds To Union Revolt—Here's His Turnaround Plan  View from the WingAmerican Airlines flight attendants picket as CEO tries to calm frustrated employees  CNBCAmerican Airlines unions call for ouster of CEO Robert Isom, flight attendants pass no-confidence vote  WFAAAmerican Airlines unions ratchet up pressure on board over lagging profit  ReutersAmerican Airlines Is Struggling, and Its Crew Members Have Lost Patience  The Wall Street Journal",
    "published date": "Thu, 12 Feb 2026 13:04:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxObjdkeUd6dkxnaU95RUlFRFRKTi13TTM3WVJ6V29UOHhCSThnMDVGMWdrRVBBelNIVnVFTGJiYk5qLWN6bHJUci1wRDc2SGtWSWZ5bWEyRVBmUlJtM2ZBLVV6dlYzTk1ZZWFtbHBReGpRdHhtaWZVbTlvYUNCOHM1aXpOTjdtRFY2dUE3YTZ3aUdBc0JZNDlFNXJad1M5OEdNNDU5ZUkyNkZJQ1pLRTU4Uk5xdDR5T2pVMmNNRmxzT2Q4ckFXZ3ZsRGV4WQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://viewfromthewing.com",
      "title": "View from the Wing"
    }
  },
  {
    "title": "OpenAI's new Spark model codes 15x faster than GPT-5.3-Codex - but there's a catch - ZDNET",
    "description": "OpenAI's new Spark model codes 15x faster than GPT-5.3-Codex - but there's a catch  ZDNETIntroducing OpenAI GPT-5.3-Codex-Spark Powered by Cerebras  CerebrasGPT-5.3-Codex is now generally available for GitHub Copilot  The GitHub BlogOpenAI sidesteps Nvidia with unusually fast coding model on plate-sized chips  Ars TechnicaOpus 4.6, Codex 5.3, and the post-benchmark era  Interconnects AI",
    "published date": "Thu, 12 Feb 2026 18:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBxUXZlSFFZdVlkNS1nTFhZSmFKaEN4TEdQa1ZEZWRmRDBZcm9fLTNPc1ZNTnZXV2lwYzc4UGJ6TTI3VW0yamdycTk0LUJvN2Y4REdxR0tObjdyaXdsS0QyUVcxZExpaktpbzl6ZjNFRW43cFBlTi1QeA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.zdnet.com",
      "title": "ZDNET"
    }
  },
  {
    "title": "Making America Stagnate Again - Paul Krugman | Substack",
    "description": "Making America Stagnate Again  Paul Krugman | SubstackA million US jobs disappeared overnight. What happened?  The Boston GlobeJob Growth Was Overstated, New Data Shows  The New York TimesU.S. added 130,000 jobs in January, but labor market growth stalled in 2025  NBC NewsFebruary jobs report: 2025 was a dismal year for jobs  vox.com",
    "published date": "Thu, 12 Feb 2026 11:31:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE8yaWU3RmV0c0tMWFJyTnBObDZUZGFRUTlDbWtKQ1ExQUktb3R1bnR5RjNiN3NxdUIxemxEbGY2M0tNX19nbGIwM2p5TElNTzhsQUpjYV9pVEFmQzNUNjM1SkxpOXp1aWdNMTJnUllaM2RrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://paulkrugman.substack.com",
      "title": "Paul Krugman | Substack"
    }
  }
]