[
  {
    "title": "Trump Administration Live Updates: Kevin Warsh Is Trump’s Pick for Fed Chair - The New York Times",
    "description": "Trump Administration Live Updates: Kevin Warsh Is Trump’s Pick for Fed Chair  The New York TimesTrump names Kevin Warsh as his pick to replace Jerome Powell at the Federal Reserve  CNNOpinion | Kevin Warsh’s opportunity  The Washington PostKevin Warsh, Trump’s Choice for Fed Chair Could Find It Difficult to Deliver  The New York TimesRepublicans love Kevin Warsh. But he still has a problem in the Senate.  Politico",
    "published date": "Fri, 30 Jan 2026 20:16:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1qUHV1V1h2WUU2VjR2UGVXU2RHT2NvQ2lIV3lPZlN5X082aXRYNlRmMHkyZDJDWU83Sk96SFdpQ2N0WnRaSl9UYTgxYW1kMS0tVnFSVkZlY3lSeV9DMGo0X3dhTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Three reasons for the record rise in gold prices, and one why they are falling - BBC",
    "description": "Three reasons for the record rise in gold prices, and one why they are falling  BBCHere’s How Gold Hits $8,000, According to J.P. Morgan  Barron'sMining stocks have been on a tear, with gold passing $5,000. Analysts are split on what's next  CNBCGold and Silver Have Been Flying. Here’s Why and What to Watch  Bloomberg.comCurrent price of gold as of January 29, 2026  Fortune",
    "published date": "Fri, 30 Jan 2026 19:11:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE13NlgxX0U0NUc3QWx6UTUxeXREa05tR3dQRDkzbFRZeXNNaUdqRE9vYTFOMFlmc09kbkVZc25Oalp1UmZzaWNDWnZIdllNVHdHZEY5T1NUWERJQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "'Washington Post' journalists plea to Bezos: Don't gut our newsroom - NPR",
    "description": "'Washington Post' journalists plea to Bezos: Don't gut our newsroom  NPRWashington Post Plans Cuts to Reshape Newsroom  The New York TimesWashington Post’s White House team urges Jeff Bezos to halt massive newsroom cuts  CNNThe Post's Audience of One  status.newsInside the Washington Post’s Existential Meltdown  New York Magazine",
    "published date": "Fri, 30 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4VzBEVkhNbXhCWm1MZlQyMEdjWGpMSDd0TGNvUXZ0d0FmNjh5LS1qd3V1LUFCaFhqd0t6dFpIRVVBSlhvUmVmSHFhX0w2R2ZTTDhwNTV1WTBwSWxJbHBLM295OGpfWjNhVmlLY1dKMzR3NlpvSXI4MjBYYkxLSmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Stock Market Today: Dow trims losses, S&P 500 and Nasdaq down after Trump picks Warsh for Fed chair and investors weigh inflation report; tech under pressure as stocks head for weekly losses; gold slumps - MarketWatch",
    "description": "Stock Market Today: Dow trims losses, S&P 500 and Nasdaq down after Trump picks Warsh for Fed chair and investors weigh inflation report; tech under pressure as stocks head for weekly losses; gold slumps  MarketWatchDow tumbles 200 points as Apple shares decline, speculative silver trade unwinds: Live updates  CNBCEM Stocks Set for Best Month in Three Years on Stronger Outlook  Bloomberg.comStock Market Today: Dow Sinks On Hot Inflation, Fed Chair News; Verizon Soars (Live Coverage)  Investor's Business DailyDow Jones Today: Stock Indexes Drop to Close Week; Trump Nominates Warsh for Fed Chair; Gold, Silver Plummet, Dollar Rises  Investopedia",
    "published date": "Fri, 30 Jan 2026 19:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQV3VwQlhYNDV5QkVRSWl4anVnSzFjX2N3Rkk5RkFJdGI4S1pZcmZ0ZnhHSklTRWU2ZGlUdGZmdVhNRkFNMEtxaTVJYmJLN1lsMVY3dXZzejBxYl90WjBfOFRmOG00NUR3X294Z1pFMnhUeDR1QlpsbGk4RjVYRE5vQldxM2NKUzI1eV9ERHFnUDc4ZmNLUFdqV0N1RFRITzNUWkwzYnJXMHBBRmM3UmVqV2FpWmx2cDJXa05COE94LVN2SjN4ekRBU2NkMmVrRDlybHNmX21nekQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Gold and Silver Prices Fall Sharply as Trump Picks Warsh as Fed Chair. Here’s Why. - Barron's",
    "description": "Gold and Silver Prices Fall Sharply as Trump Picks Warsh as Fed Chair. Here’s Why.  Barron'sSilver drops 30%, gold tumbles 10% as Trump Warsh pick eases Fed independence fear, triggers dollar rally  CNBCDollar Surges as Plunging Metals Hit Commodity Currencies  Bloomberg.comGold, silver and copper tumble as nervous investors discover gravity  ReutersWhy Trump's pick for Fed chair is causing gold and silver to tumble from records  Business Insider",
    "published date": "Fri, 30 Jan 2026 19:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPMl9ianRrVWhXRUJ2MUJiX1IyQU5GUWNnX2lqOWlxekVYbDl0eHpmcmhNZjhqbFhSZTEwR3dpRXctc2VObl9yaEJHMUlLb2pZQV9Qa011SmpDZGNPTlA5NmxLLTdUSFloM3N3YjRkeXJENFBQRjlzUjBEZlg1dDkyb1JCQmxCMGNMNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.barrons.com",
      "title": "Barron's"
    }
  },
  {
    "title": "Exclusive | The GameStop CEO Has an Audacious Plan to Clinch His $35 Billion Payday - The Wall Street Journal",
    "description": "Exclusive | The GameStop CEO Has an Audacious Plan to Clinch His $35 Billion Payday  The Wall Street JournalGameStop's Ryan Cohen eyes 'very big' consumer megadeal that could increase company's value tenfold  CNBC‘Big Short’ Investor Michael Burry Says He's Betting on This OG Meme Stock  Yahoo FinanceGameStop wants to conduct 'major acquisition' of a public company  GamesIndustry.bizGameStop Stock Rises After CEO Doubles Down on Acquisition Plans  Barron's",
    "published date": "Fri, 30 Jan 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE53WDhYZDV2azR5RDdlbVJUNEIwRnZEZHNLS0hvRDdLdHF1dnZsdDB1aExTdC1SZGdVZm10c2Myel90QjgwcFVDVHRFUExYcFZWX2ZTTGVRbnZBa1psRmR1bDc0VklDS3hDVUF3R0JLYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Apple's iPhone sales surge to new quarterly high despite early missteps in artificial intelligence - AP News",
    "description": "Apple's iPhone sales surge to new quarterly high despite early missteps in artificial intelligence  AP NewsApple tops Q1 earnings estimates on record-breaking iPhone sales; stock falls after Cook's memory warning  Yahoo FinanceApple sales surge 16% on ‘staggering’ iPhone demand  CNBCThe iPhone 17 is easing Wall Street’s concerns about Apple’s AI troubles  CNNWhy Apple’s blockbuster earnings weren’t enough to lift the stock  MarketWatch",
    "published date": "Thu, 29 Jan 2026 22:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOUVvVkhxcWlKcWJEZ1FkWjVjcFZ6Q0xGd1ZnRWpkaEwzNkRJLUt2X0ZydFUtYkxMRTFzQTBhTklBaVkwemlHX0dMTzFOTlNlekRiam4yLVdFbVJmcVFOcDY4S2loLV9MVzlPbjlnQlRNMl94aHZXeXJiTzN5Vk01NzVtdmZQVlFGRFlqQXV3Y3VJb0NUWjI2Y0V0bnBXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Waymo robotaxi hits child at school drop-off, triggering safety inquiry - The Washington Post",
    "description": "Waymo robotaxi hits child at school drop-off, triggering safety inquiry  The Washington PostA Waymo hit a child near an elementary school. The NHTSA is investigating  CNBCA commitment to transparency and road safety: event overview  WaymoUS regulators open inquiry into Waymo self-driving car that struck child in California  The GuardianWaymo vehicle hits child in Santa Monica  FOX 11 Los Angeles",
    "published date": "Fri, 30 Jan 2026 03:15:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPVmttYjd3akZHSkVOeWtmcDZCMG1DVUo3TkhVX1FLbkpPLWZtU19lVW5LUUNLTzdfUGFuTHNPWkJoSlRlZmcwWkhMcmo1ckNLNmFHWTZwZk1zYldiT2pfR054V1ZGakJMRGd5NXNNNUZGZllvMzhxb19rbHR0WHpyUlRGSDVPTWJxWC1HTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Fed Chair Powell sends frustrating message on future interest-rate cuts - thestreet.com",
    "description": "Fed Chair Powell sends frustrating message on future interest-rate cuts  thestreet.comFed holds interest rates steady for first time since July  CNNFederal Reserve holds interest rates steady as a defiant Jerome Powell resists White House pressure  NBC NewsInvestors bet on later Fed cuts to support markets after pause  ReutersFed, Signaling Little Urgency, Prepares to Pause on Rate Cuts  The New York Times",
    "published date": "Thu, 29 Jan 2026 13:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPekNOMWd3NFpyVWkyM3lJQ29VZ3ZuUkhRcVBfUVlJMXUzUlNzX2xDRVpZendTd2gzaHd0QWxqcUUtUWdrSGwxRzNSdGgwVDF0ZHdUVXZ6UUtleUh5eUhkMi1ZbGNwT3ltYlgzaXFIY2VMRV92M1EtalVyanQ1MHRyTnFVZ2dPLXg4SWphS09Da2J5V25UVngwc3NuRU9scUxBYm5V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestreet.com",
      "title": "thestreet.com"
    }
  },
  {
    "title": "Trump thinks a weaker dollar is great for America. Is he right? - NPR",
    "description": "Trump thinks a weaker dollar is great for America. Is he right?  NPRWhat the Slide in the Dollar Means for Trade, Travel and Investment - WSJ  The Wall Street JournalOur currency, your problem  ReutersJust how debased is the dollar?  The EconomistWhy the US dollar hit a four-year low and could fall further  BBC",
    "published date": "Fri, 30 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBDQndEN2s0V3o4dUwzOUM2aHcwOGU1WTQxMVd0VkxKZVMwNDFXamp2ZVB6UTEtREFrRmotXzc0aWd0Mm9sT21PUnpuLUdLYmVEYUZLTmhfVEE4NVBPc0lvOHdNV3o5UXpxcUFnYVk3RVVidzMwdEtoV1pwQXp3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "White House Scrambles to Fix Humiliating Math Errors - The Daily Beast",
    "description": "White House Scrambles to Fix Humiliating Math Errors  The Daily BeastTreasury secretary predicts 25 million will take advantage of new 'Trump Accounts' for kids  NBC NewsJPMorgan Chase and Bank of America to match $1,000 U.S. contributions to employee 'Trump accounts'  CNBCThe employers and credit card boosting Trump account contributions  AxiosErika Kirk pledges Turning Point will match $1,000 government deposits in ‘Trump Accounts’ for employees’ children  The Hill",
    "published date": "Thu, 29 Jan 2026 20:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPcnYySHNvYU9yQ0VwWFZTQjNKTUNuUW9ZLXM1b3N5TmZSUU9YbU5KblFURlNCQkFfeUFXaVFEWl9POGxwNjRQcVlmQkVnUXROMk5xX2dvM3BBRi1MVDBNSm8yNTluUlVHa0xzN2JFUC1vT3ctMjZSZ1RvN0FGcmNvNFVqeC0yLVU1bjVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "META or MSFT: Which Is the Better Tech Stock Post-Earnings? - TipRanks",
    "description": "META or MSFT: Which Is the Better Tech Stock Post-Earnings?  TipRanksCramer says Microsoft and Meta's earnings offer a clear lesson: Don't give up on the tech giants  CNBCBig tech results show investor demand for payoffs from heavy AI spending  The GuardianMeta And Microsoft: Great Earnings But Different Results  Real Investment AdviceZuckerberg, Musk Vie for AI Primacy With $155 Billion Spree  Yahoo Finance",
    "published date": "Thu, 29 Jan 2026 13:05:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOVjhsaUtOaEVIdVF2UEMxSmRmSVVUUG9JVmlmZnZ2emgzZzRob1QyeWdEMy1UTFQ5UksxSEgyUy05bnZFWjJiYTJpbEROQWFwSE9oTUVseTNqZ2kzOTdJNGFPMHB5blhONjZNUWVlOTA2V2pKQmV3M09nTTJhYk1vcGdNUXZqRWpYQ2h4OVgySkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "Chevron And Exxon Top Earnings But Only One Supermajor Saw Profit Growth; U.S. Oil Prices And Venezuela In Focus - Investor's Business Daily",
    "description": "Chevron And Exxon Top Earnings But Only One Supermajor Saw Profit Growth; U.S. Oil Prices And Venezuela In Focus  Investor's Business DailyExxon earnings beat estimates despite low oil prices  CNBCExxon and Chevron Lift Oil Output, Blunting Crude Price Drop  Bloomberg.comExxon Mobil reports strong quarterly profit on solid production at home and abroad  Yahoo FinanceExxon Earnings Beat Wall Street Expectations. Why The Stock Is Falling.  Barron's",
    "published date": "Fri, 30 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxORUJOZ1RFT0JwNllIdXlPZER3T2ZSNU0yazJrUjF2YUpaeGFzUnVHUGl4bHoxc2JFUFkxNUtHWDZhOG9pRW1jTjlDeDg2c0FiZVRSQkhtWmhERzZBMEdVcHdRbHhiYjV2cnFmUXd2MUZmY3RDQURibGJQVzRvbzB0b1ZTUGZSallSa1l6enJxa1owZFF4WERpSg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Verizon Delivers on 2025 Financial Guidance with Highest Quarterly Net Adds Since 2019 - Verizon",
    "description": "Verizon Delivers on 2025 Financial Guidance with Highest Quarterly Net Adds Since 2019  VerizonVerizon forecasts upbeat annual profit as wireless subscriber growth hits six-year high  CNBCVerizon’s stock heads for best day in 18 years as CEO sends a message to rivals  MarketWatchVerizon Earnings Beat; 2026 Profit Outlook Above Views Amid $25 Billion Buy Back  Investor's Business DailyVerizon's Q4 sub adds blow past estimates; posts strong results and forecast (VZ:NYSE)  Seeking Alpha",
    "published date": "Fri, 30 Jan 2026 11:30:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOU3phM0pocV9HZ2ZfSzgtU1M5b3lkTC01WjdsSW9MbE9vaU5zVTRTVWxRdHlDZTN5bDRsOF9yamN6eWRVTm9BMlBrdm9hVGZMX1lJMjlldnpsRHVnN1JULWxaRzE4YVZSNXFveE9JWDFtdFlLeVNSX0VrdWVzY3FGdi1hN2dHOV9NNWhhQ0cwaW5nZkhHMDJqRXRCREIxR1FQd0I0dg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.verizon.com",
      "title": "Verizon"
    }
  },
  {
    "title": "If you're one of the 16,000 Amazon employees getting laid off, read this - theregister.com",
    "description": "If you're one of the 16,000 Amazon employees getting laid off, read this  theregister.comUpdate on our organization  About AmazonFactbox-Corporate America continues job cuts in 2026 in efficiency push  Yahoo FinanceSeattle rocked as Amazon announces historic layoffs  The Seattle TimesAmazon inadvertently announces cloud unit layoffs in email to employees  CNBC",
    "published date": "Thu, 29 Jan 2026 10:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE12b25ObXJ2UmQxR0hmNjhpNXZwZlRFQVdjQ2lya1NPNU9wOElDQzhTWks5VFRrbFdqRHhjVVVzZU8xcnU0Q2lHNlozRXl6NDZySVdXNXpxOHViQmxKMG5xSzdZbzY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Tech boom turns to gloom in Seattle as economic fears swirl amid layoffs - GeekWire",
    "description": "Tech boom turns to gloom in Seattle as economic fears swirl amid layoffs  GeekWire‘Dire’ job market awaits Amazon laid-off workers  The Seattle TimesAmazon Layoffs Hit 1,400 in Seattle as Local Tech Jobs Wither  Bloomberg.com‘Scariest time economically since Great Recession,’ layoffs hit struggling Seattle region  KIRO 7 News SeattleTech layoffs rattle Seattle  Axios",
    "published date": "Thu, 29 Jan 2026 16:42:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbWluckhxMmxMTF9FRHdzcV9KNWNZV0JCazZGRkt1Wmg5a3FDeEx5NFNlTUtsb2k2eEhoVm5QbFJBcGRzeFF2S3dMNUliVjdHbXVGcVRiSmR5WEpkemhla0pqZlhtR29uWnNTWDgzQ0sxbTdxX2RJVnRiRE1sZlBXUEs5R1B1RW1yZzJHVDFuc2tRUTJqR054TEJtVnQwdl9Ea19uY2xn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.geekwire.com",
      "title": "GeekWire"
    }
  },
  {
    "title": "Donald Trump Just Hit Russia Harder Than Any Missile From Ukraine - Newsweek",
    "description": "Donald Trump Just Hit Russia Harder Than Any Missile From Ukraine  NewsweekA Fight Against Russian Oil Hits Lukoil Station Owners in the U.S.  The New York TimesCarlyle Edges Ahead in Race for Lukoil’s International Assets  The Wall Street JournalUS Carlyle Group agrees to buy Lukoil's global assets after sanctions pressure  ReutersCarlyle Group Agrees to Buy Most of Lukoil’s Foreign Assets  Bloomberg.com",
    "published date": "Thu, 29 Jan 2026 17:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNTUtEQWZHUnlmWXRwaDRYcHE0OEJSbDhYY0ZmYno5eHRZbnN3VW11NVRPTnNSVEdpazllMG1Xc1lUX3BvWFM1a2dHdTNNNEtJVE9qQlkzWTN4aUh0T1cxYk9SMmdEZTh6N0Qxbkl6NE5LeTM1eEdfUEdUYlBYYkJHVWt4cmpSS3lrTDhjOG5n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newsweek.com",
      "title": "Newsweek"
    }
  },
  {
    "title": "Exclusive | Trump Regulators Say They Are Ready to Lay Out Crypto Rules to Foster Growth - The Wall Street Journal",
    "description": "Exclusive | Trump Regulators Say They Are Ready to Lay Out Crypto Rules to Foster Growth  The Wall Street JournalCFTC and SEC Joint Event on Harmonization, U.S. Financial Leadership in the Crypto Era  Commodity Futures Trading Commission | CFTC (.gov)U.S. SEC, CFTC chiefs push united front on paving the way for crypto  CoinDeskThursday, January 29  The Presidential Prayer TeamCFTC and SEC join forces on 'Project Crypto' to modernize rules as Congress works on digital asset legislation  The Block",
    "published date": "Thu, 29 Jan 2026 17:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNX3F3X05OWVdGek1vbm5WdDVhNm8xSjFZSEN5ckhQeTBncm1wNFplc3VRYzRoVm83YU1CeTV4a3hwRlByQWhoRVdNbGNaQldNalQzS05GUDJIWnNva0V3OFZ6a01yM3F5U1FIbHRqUzJJTDZNaFFpT1doNXl0aXYweVVMNU1YMUxwVTBxSy1VNU5SRmZ2MkRLY2tyM2dyZ0VSUnhiRXZwdUc3a2J5WTdoSVlSS05FNEVMWXdyNmg2MUp2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Tesla Stock Falls As The Market Mulls Tesla's Shift To 'Transportation-As-A-Service,' Massive Capital Spending - Investor's Business Daily",
    "description": "Tesla Stock Falls As The Market Mulls Tesla's Shift To 'Transportation-As-A-Service,' Massive Capital Spending  Investor's Business DailyTesla’s Model S, Soon to Be History, Changed the Auto Industry  The New York TimesElon Musk's $20 billion spending plan signals 'Tesla of yesterday is gone'  CNBCTesla throws in the towel on car sales  The VergeElon Musk says Tesla will stop producing its S and X models as it shifts to making robots  NBC News",
    "published date": "Thu, 29 Jan 2026 21:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNXzR4LUg3UGFEQmZXOGFlZXE3WFkwZWx6ekJCckt0QWw2aEVmVjZTYnpoNlZKQXR6ZmNod0dDUHdrT29rUEswYndGQUI4R3VJd1pjSUl1ZDdpVzZFZ2VTUGhEX2l1aDZhWGgzbUwydkJEejhEQUZlRUF1NlpVejVmcDg5dUw3dlRQdHNHRzZiSVM3UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Key promise of Trump's tariffs goes up in smoke - Daily Kos",
    "description": "Key promise of Trump's tariffs goes up in smoke  Daily KosTrade deficit soared 94% in November and was higher than a year ago, despite tariff efforts  CNBCU.S. Trade Deficit Bounces Back as Tariffs Cause Volatility  The New York TimesUS Trade Gap Widens From Smallest Since 2009 as Imports Rise  Bloomberg.comUS trade deficit widens sharply, reversing big pullback lauded by Trump  South China Morning Post",
    "published date": "Thu, 29 Jan 2026 18:00:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQMm1sYm96SVkzckl1NFJzNTh5YjBSbXlHMFhhdklkOUV2WnUzZkhZaUFIeU5YbTR2TUF3SjFaUUdINVBCcFluNHFsTTJkSjFoampGOTRSQ2Y2R19EdHdydFpRYm0xOUFTNEdkZ3YtSUxSUUxYVkh2X3dtWEI4bGZqYzE5S25vTDg0YksxVnhVLUFFYkdNMzdvTnVKWGZhRVRI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailykos.com",
      "title": "Daily Kos"
    }
  },
  {
    "title": "Exclusive: China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources - Reuters",
    "description": "Exclusive: China conditionally approves DeepSeek to buy Nvidia's H200 chips - sources  ReutersChip stocks rally after bumper earnings and a report of a game-changing China approval for Nvidia  CNBCNvidia’s Campaign to Sell AI Chips to China Finally Pays Off  WIREDNvidia's CEO says China is still finalising licence for H200 chip  Yahoo FinanceNvidia Stock Gains. How China and OpenAI News Could Break It Out of Its Rut.  Barron's",
    "published date": "Fri, 30 Jan 2026 06:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNRWRNWTVXcVEwQWlQMi0wWThOd3M2XzBsSGs0c2tCcVdBNVg3NUg5WDVOcEE2WEpVenNqaEVXa2ktZXdpVGpWdDN1WTUyelVnNWhpbDNFS2hLNWJsdGtfWG8tcVRjN2VDQjU2TkVCb0JEUVY1YW03aFMzVHhkbGhZUjJQVVJ6eFdYNEt5RURfMzdKN1otUjlSR1NIMGVDQ2Q0Q0dNMHpmc3RkSVRFQUx1M0JGOWRNMU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Amazon is reportedly in talks to invest $50B in OpenAI - TechCrunch",
    "description": "Amazon is reportedly in talks to invest $50B in OpenAI  TechCrunchOpenAI in Talks to Raise as Much as $100 Billion  The New York TimesNvidia, Microsoft, Amazon in Talks to Invest Up to $60 Billion in OpenAI  The InformationOpenAI’s too-big-to-fail fundraising  Financial TimesAmazon bets on OpenAI even as Wall Street cools to the ChatGPT maker  Axios",
    "published date": "Thu, 29 Jan 2026 22:11:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOS0REbDlIcXR2NDhINVlZVS04NlZESHNTVnc1a1hNS04wbkhnVHBobVA3NGlWVTluZW1BamQ2NjQ0MVV6ZHdtU214VWZiaGgtZ0I3NWdYa0NCSEdmZnZvaS04RklKLUE0emd5YXpBTEhUWmFQYjhwVE14Q0FLVXdwWEFCMkJ2ODJBcWptNnVSbWQyQmVuY3BNcVFXNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Sandisk Stock Soars As Memory-Chip Maker Smashes Estimates - Investor's Business Daily",
    "description": "Sandisk Stock Soars As Memory-Chip Maker Smashes Estimates  Investor's Business DailySandisk Profit, Revenue Jump on AI Demand  The Wall Street JournalSandisk Rockets As Memory Stocks Called 'The New Gold'  Investor's Business DailySandisk’s 1,700% Rally Keeps Going After ‘Unprecedented’ Quarter  Bloomberg.comSandisk’s eye-popping earnings forecast helps justify 1,400% stock surge  MarketWatch",
    "published date": "Thu, 29 Jan 2026 21:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWS1WcTVDNkxPRks3dWwxaEpKcnRSVHNjcjQ1cTJYUHN2SVBpTmxPTnc5Z0pNRFdTS2hrYlo3RkowZXFfMVgtMTBwS2wyLVdCbmZYYTFDMDNkMnZRLThMN09TYjZ2ajlwaGVmUW9pVlR1bFEyajlNbkhNcG5sZ2VxUm1vemgxMFoxTUtDZVF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Want to Buy the Dip on Software Tech Stocks Like Palantir, Microsoft, and Oracle? Consider This BlackRock ETF. - The Motley Fool",
    "description": "Want to Buy the Dip on Software Tech Stocks Like Palantir, Microsoft, and Oracle? Consider This BlackRock ETF.  The Motley FoolSoftware stocks enter bear market on AI disruption fear with ServiceNow plunging 10%  CNBCWhy software stocks are getting crushed as AI casts 'shadow of uncertainty' over sector  Yahoo FinanceUnity, Appian, Box, Domo, and Palo Alto Networks Shares Are Falling, What You Need To Know  FinvizMSFT led the decline in tech stocks, are software stocks in trouble?  Seeking Alpha",
    "published date": "Thu, 29 Jan 2026 12:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU04xdlBRa2hweDVNNndiakNLcFNWLXNyTTBpMTZJLUJxaGpfZ1RWT21fcFBERVpJcFpxb1d3aUNraVBpbGVMamVJNHQ3SUZoN3VQSTN4UzgySDF6cllBSFA3M0g5TkthaVFtSk5UVWhGU2NnbUN1UVlRQUxySUY1UXJB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fool.com",
      "title": "The Motley Fool"
    }
  },
  {
    "title": "Microsoft Shares Plunge 10%, Wiping Out Nearly $360 Billion in Market Value - Investopedia",
    "description": "Microsoft Shares Plunge 10%, Wiping Out Nearly $360 Billion in Market Value  InvestopediaMicrosoft stock is flat the day after sinking 10%. Here's why  CNBCMicrosoft’s $440 billion wipeout, and investors angry about OpenAI’s debt, explained  Yahoo FinanceMicrosoft stock plunges as Wall Street questions AI investments  Al JazeeraMicrosoft: The Market Has Lost Its Mind (NASDAQ:MSFT)  Seeking Alpha",
    "published date": "Thu, 29 Jan 2026 16:51:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeXFldGpnSFdfZUlMQk1IUjc3UjAzcldRYVVYQ0pGcDM1dVpGZ0J4OUs1QWNBdE9aWVhMT3N5VlVOLXFFVW5fOFNJSThmYTlRbXpLVWxiUFExdGlOU1NmV1Fmd1BnVkRXZ0tMbkFRX216ZFNjYlh1T1hoM1dWY0UzNi0zOXp4WVVwUXhF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investopedia.com",
      "title": "Investopedia"
    }
  },
  {
    "title": "Comcast keeps losing customers despite price guarantee and unlimited data - Ars Technica",
    "description": "Comcast keeps losing customers despite price guarantee and unlimited data  Ars TechnicaComcast’s Broadband Subscriber Slump Persists  The Wall Street JournalComcast posts mixed quarter as broadband pressures weigh on business  CNBCComcast sheds more broadband customers as competition mounts on core business  ReutersComcast Q4 Sees Fall in Cable Revenue, Wider Peacock Losses, Despite Boost in Ads, Wireless, Theme Parks  Variety",
    "published date": "Thu, 29 Jan 2026 19:51:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQeVo5SGhJRGZFdFVVOWRybUlTYkM3Y3dQeXhVcmNjREM5RDFMSk9IbXVyMnBUUV9CbWRUS1lST243UklYZl84X2N3emM5ektHakd4WUhmZVY0WHk0VmhHTUpoQmtBNGpIWnNUdkdFdTQ1ZDRZUlhoUldyeE9CUC14ejgyMDVjY29JYjFuN1JQTy1fN0RrdFhiSWpOQXkwc2FjOWpKc253YnppblBCRUpyS1NVZEtMY3B2SVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Ex-Google Engineer Convicted of Stealing A.I. Secrets for Start-Up in China - The New York Times",
    "description": "Ex-Google Engineer Convicted of Stealing A.I. Secrets for Start-Up in China  The New York TimesFormer Google engineer found guilty of espionage and theft of AI tech  CNBCFormer Google engineer found guilty of stealing AI secrets for Chinese firms  CBS NewsEx-Google Engineer Convicted for Stealing 2,000 AI Trade Secrets for China Startup  The Hacker NewsEx-Google engineer convicted of espionage, stealing AI tech  KRON4",
    "published date": "Fri, 30 Jan 2026 02:24:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNOG9icWQycXFLaW4tbVN5eFJQNkcyU0E4R0s1cFZZMjVpYXBObGlPSW5BN3N1aGkybnp3bW5YbnljQ3VlenZQVWdzM3loSjNPZGMzdXZ3TGx5WXBNTzVrNThNVnh4ZTlLQnpidmdHOWtZRVdmNE41OHZjU0x6MkVtVnprZkpZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Medicare Advantage insurers face new curbs on overcharges in Trump plan - NPR",
    "description": "Medicare Advantage insurers face new curbs on overcharges in Trump plan  NPRTrump proposal signals Medicare austerity  PoliticoHumana, UnitedHealth plunge 20% after Trump administration proposes keeping Medicare Advantage rates flat  CNBCCMS official defends flat Medicare Advantage rate proposal for 2027  Healthcare DiveInvestors Assumed Medicare Advantage Was Safe Under the GOP. They Were Wrong.  The Wall Street Journal",
    "published date": "Thu, 29 Jan 2026 18:58:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNbFBJdno2SHp5UElueU5vaGJkbjZGa3VkWDBfQUEyS3V3X2M5S0lpVUt1by1oVzNsUUptNmNMUkNZeXROV0ozM2ZKQTFsRTZtWW90VW80eFEzWlBlWDBwalk4S3dZSTN3em9KWkRhcGs0bGFWR3RDMWo1SGpyQ0p2a2Vha3B1T3RTSThxcnNCaEMxb0RnU1gzQkthRW9wMnpPejk0ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Tesla Stock Climbs on Reported SpaceX Merger Talks — What It Means for Investors - TipRanks",
    "description": "Tesla Stock Climbs on Reported SpaceX Merger Talks — What It Means for Investors  TipRanksTesla climbs as SpaceX merger talks fuel Musk empire consolidation hopes  ReutersElon Musk may merge some of his companies  AxiosWhy Tesla Stock Popped Today  Yahoo FinanceSpaceX and xAI could merge, according to reports  Daily Memphian",
    "published date": "Thu, 29 Jan 2026 23:53:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQaUNjWHdhd3d3ZkF3RVZDYi1YaVdhOC1nemNWcEVQZzNFd3h3a0pHTS1vRDRBUXd6SnhCWTdvWE51VU56LWV1dHR3T1lNNmZFcDM1X2NqUU5leGo2MTJFX3IzeTVITFNWMTdGZmdGVGtENHNUSGFIaUo2eUpoX1dBMnZlNWpJZHVBYVkzNWpkSFV0ZUNuU240dGpaX0s0MHlzQjVvVk1qbHFIVEFs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "Growing Wave of Silicon Valley Workers Condemns ICE as C-Suites Split Over Fear of Trump - KQED",
    "description": "Growing Wave of Silicon Valley Workers Condemns ICE as C-Suites Split Over Fear of Trump  KQED‘ICE Is Going Too Far’: OpenAI’s Altman Weighs In on Minnesota  The New York TimesAfter Minneapolis, Tech CEOs Are Struggling to Stay Silent  WIREDWhy Minnesota’s CEOs finally broke their silence  CNN1 in 3 corporate leaders think ICE tensions are ‘not relevant to their business,’ study finds  Fortune",
    "published date": "Thu, 29 Jan 2026 21:15:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPRHJMVlc4akdsMDN6Y3BFLVdJejc4Ym55QnB5eVlIaWRCaVRGX2xuZThoNk8zZG8wSFV1RW9ZY1VYQWJjQmxQcjFLd05YTGlDdzBVYko1aDNaXzAzWUQ0SUlJelREeW93enQzR1pwTkVjM1J6bC1uSmh3N3ZibERGeW9mSEl4R1FjTWxnUFRTTTFPWG16UkRsLVI2TmkyeG1LUHZqQnVNSDRPU0FwcXpmY3c3Q1FMYXVWMDhOc2NyVjg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Remove Tesla’s non-repeatable profits, and the stock has never been more expensive—now boasting a ‘core’ PE of 632 - Yahoo Finance",
    "description": "Remove Tesla’s non-repeatable profits, and the stock has never been more expensive—now boasting a ‘core’ PE of 632  Yahoo FinanceTesla Profit Slumps, but Investors May Not Care  The New York TimesTesla tops estimates for quarter, but wraps up first annual revenue drop on record  CNBCTesla cuts car models in shift to robots and AI  BBCTesla CEO Elon Musk to stop production of two models, S and X; convert Fremont, California factory to produce robots  ABC7 San Francisco",
    "published date": "Thu, 29 Jan 2026 22:12:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPb1VJai0yZjljajRzc09YTWoyeTd1UFpBaDVWMV9IWHZGenNHbUdseHBWa2dMMzc1UENtVjlrS183Rjk1bkhLUlNTYlhZU3BSOHVYQ3l5ZFAzSXR3bHBxT0E1S0VVaU1RdUU0Z0tNdlRYQ1hjSTctM1NhSVprZUFjRlpRb1RHS3pF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://finance.yahoo.com",
      "title": "Yahoo Finance"
    }
  },
  {
    "title": "Costco Is Sued Over Preservatives in Its $5 Rotisserie Chickens - The New York Times",
    "description": "Costco Is Sued Over Preservatives in Its $5 Rotisserie Chickens  The New York TimesCostco is roasted over its $5 rotisserie chicken  The Seattle TimesLawsuit claims Costco rotisserie chicken falsely marketed as preservative-free  KOMOCostco’s $4.99 rotisserie chicken gets roasted in lawsuit. Here’s what they’re claiming  Los Angeles TimesCostco faces lawsuit over its famous rotisserie chicken  KSWO 7News",
    "published date": "Thu, 29 Jan 2026 20:45:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSkVRbHVwTWNoNWhXbWVKUWZWcUhaZVd4bzlpRFVoTHpZWkcwRDRlVEJReC1LeDdIOVZqdlJDVTBPc2l1M3dERFZ3aVgxdUpQUHg3cnJLRDJrcFh3TmU0TW1ZYmFMaDhJempNZjNEYXR4ckI4UWVaa1V5MHBJa1VuMWx0VmpKamhVSHBMc2J3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gold and silver stumble after record run. Is now the time to enter the market? - CNBC",
    "description": "Gold and silver stumble after record run. Is now the time to enter the market?  CNBCEli Lilly looks to sharpen its domestic supply edge by building another U.S. plant  CNBCTrump finally makes his Fed chair pick — what Kevin Warsh means for investors  CNBCStocks making the biggest moves premarket: Apple, Chevron, KLA, Sandisk & more  CNBCJim Cramer's top 10 things to watch in the stock market Friday  CNBC",
    "published date": "Fri, 30 Jan 2026 07:14:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxOUVlzRmFMRGlVRTkwaUYzYkRSLVJVc2I2WVltZjlvSm5yU0FXOVhQUkRkQjYxUV9aQ1NzVFlONmxnQkY2N2tzc2ZscFNjUHQ4QTJtRFNlR0NKV1ZaX3Y3VmhfREdfU3NiODEwSF92WmlhLUs1RXBTbjFCNFhlNWxELTJwVk1fXzJ3Yml1MFpwbmwya2NGMkJIQi05WGxzU29ZcU8zYkQySGhYbWgzRjFxSXhOaEhwcmdUY2NYQWtVUXVyS3FscUd2VXpsTG1scmFJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Microsoft Earnings Prompt Tech Stock Selloff - The Wall Street Journal",
    "description": "Microsoft Earnings Prompt Tech Stock Selloff  The Wall Street JournalMicrosoft lost $357 billion in market cap as stock plunged most since 2020  CNBCStock market today: Dow, S&P 500, Nasdaq sink as Microsoft's post-earnings plunge drags tech down  Yahoo FinanceStocks Slip as Gold, Silver Hit New Records  The Wall Street JournalThe 'Everything Bubble' Crash Averted - At Least For Now  Seeking Alpha",
    "published date": "Thu, 29 Jan 2026 22:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOa2ZseUFoUXdOOUkzaVBIMjBzYjEwNE9jRmdxNC02bGdTQkZBVDJseWtZV0VtN0tiS2d4TlNyT3RaUkhmN0ZFcUhpWEZBNjU1T3R0MFBmRTJXbldfTjJJVS1waF9aR1hfZk5JQy1JMG1uRTZjTzl3UFdPZnFmU2ZKZzN5NTRRdVYxSjd5YkRZWW1Ndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  }
]