[
  {
    "title": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History - Rolling Stone",
    "description": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History  Rolling Stone‘Melania’: Watching a First Lady Vanish in Plain Sight  The New York TimesThe Melania Trump Documentary Is a Disgrace  The AtlanticStephen Colbert Says 'Melania' Numbers Impressive 'Until You Realize It's Less Than 10 Percent of Budget'  Rolling StoneMelania review – Trump film is a gilded trash remake of The Zone of Interest  The Guardian",
    "published date": "Thu, 05 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQMXRuVWI1V2g1TEVUeFFoUVlfb20yVmdWYTlxZ0lsTHQxTWhpMUVTclgtUGlucGxaRjAwSHByYWRJeDc5ZkxsQjZPdHktOHVfdVdHQTNEbmRpZWMyaTJaZ25TQTV2anM3ejFKeVNHT0ZqQVhYLXJyTHlRM2Qzd0NsS2lWM19QaFBjMENGSWpRejFwbTNqTmYwR1hKSEZDY1ZrR1B1YUpfVDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "With $3M ad buy, GOP governor candidate asks Michigan fans to skip Super Bowl halftime - MLive.com",
    "description": "With $3M ad buy, GOP governor candidate asks Michigan fans to skip Super Bowl halftime  MLive.comBad Bunny doesn’t need the NFL as much as the NFL needs him  cnn.comBad Bunny previews new details of Super Bowl halftime show  ABC NewsWhat does Bad Bunny at the Super Bowl mean for Puerto Rico? I flew to the island - The Athletic  The New York TimesBad Bunny's 2026 Super Bowl halftime show triggers polarizing reaction  WPDE",
    "published date": "Thu, 05 Feb 2026 22:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNcUpnamdPaXZzZ3VtR1hDQlRiNWhjU3JoQXp5YWExbFVMZ3I0OURSSzE3bjN4blNDVkRHekUzbjhJYnFPd3V5R0s1VTJBVmJ2UUlNWVFEVFpydndWNFFZMHljdjRSb3FlX1JqSFVSYTVtNXZZak1ORUhDX3ZLM2lMNTRHTm1yQ1VzNUE3dkFGc1FxeGI4YzBTdjRjNzZ2MFN3OHRGbDB3MldYZlBOUUZtaEppNXF4V2d4bmhGOGg2M1lZN2dTeTVj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlive.com",
      "title": "MLive.com"
    }
  },
  {
    "title": "2026 Super Bowl Ad: Star Talent Fees Down As AI Surges - The Hollywood Reporter",
    "description": "2026 Super Bowl Ad: Star Talent Fees Down As AI Surges  The Hollywood ReporterWant to watch Super Bowl 2026 commercials early? These ads are already live.  cbsnews.comThe highlight of Super Bowl 60 may not come from the game itself  WTOPAI, weight-loss drugs and celebrities galore headline Super Bowl commercials  The HillThe 2026 Super Bowl Commercials Are Here, and They're Weird  GQ",
    "published date": "Thu, 05 Feb 2026 12:48:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaFRrbkpkMjVGREFNRzhtd0tPWTd2TmxVdDZLSTBfeUVBS3pGU1FJZ3FjUEtOTFkycjFGRS1ienc4dXlNWHFuTHVqdGxBQmJkbnA1NUw4Sl9Nb1BMQTd0QlAzZTYzTk5MV2RUTjdDTjJXa2xkaDB6VlZiekw4NktUNzlGX0ZVaG1udG5lSTBVbzZNRzZWR2d0TVFvLWtpWTBCNFBwcmpvOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Mike White Gives ‘The White Lotus’ Season 4 Update During ‘Survivor 50’ Return: “I Can’t Pass This Up” - Deadline",
    "description": "Mike White Gives ‘The White Lotus’ Season 4 Update During ‘Survivor 50’ Return: “I Can’t Pass This Up”  DeadlineMike White explains how he is handling Survivor 50 castmates angling for The White Lotus cameos  Entertainment WeeklyWhite Lotus Creator Mike White Explains Why He Couldn't Pass Up Survivor 50, Wants To Present As 'Avuncular, Early Alzheimer's Guy'  TVLineMike White Reveals His Hopes for a White Lotus Alliance on Survivor 50 with His Former Castmates (Exclusive)  People.comThe White Lotus’ Mike White Reveals How He’s Avoiding ‘Survivor’ Players Asking for Cameos on the HBO Hit  Just Jared",
    "published date": "Fri, 06 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNblpCX3BkaDZXLU45eFplS2pLODByb2V2b05YSWl1UmxYdzBqMHB5T1VOZlpJZ1JuVU01WVU1ejh1bWJwUm1JTzBwMm9KMHpLUi0xT3dIbW8yQ21sYXBpRHZTSnBBY3E0SDk3R1BkUHdmR3NfRFAweFdLZEtGdWJoc0FNbGR2ano1S1lmUm5nakxDM0tzQ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "How Paris Hilton Invented the Influencer Economy. “I Was Just Living My Life and the Paparazzi Followed My Every Move” - The Hollywood Reporter",
    "description": "How Paris Hilton Invented the Influencer Economy. “I Was Just Living My Life and the Paparazzi Followed My Every Move”  The Hollywood ReporterParis Hilton Jokes That 'Mother Is Mothering' as She Struts in Chic Ballgown with Kids Phoenix, 3, and London, 2  People.comParis Hilton Reveals Whether She or Carter Reum Is the Stricter Parent  E! NewsExclusive: Paris Hilton opens up about husband Carter Reum and 'taking back' her voice after surviving abuse — 'I finally feel safe'  HELLO! MagazineMy BRUTALLY HONEST REVIEW of Paris Hilton’s INFINITE ICON: A VISUAL MEMOIR!  DVDfever.co.uk",
    "published date": "Thu, 05 Feb 2026 14:00:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNZDFSZ0d6c0dSU0tzRXM3VzNjVmJ0QlRvamlwQWJYZzg4LURlMHBnZktRbWF5d0VZVXNVQmhtdmZENEsxTmpKelhxeWhMazVWQXNyTnRKNFVUN2pyYWRya2FoZGQ4eERiYms5cnVKZGJPWHJTZlZhRFVqZHQzeWhWV0ZUSlE3VE9JUkdoeXJtZ3VMZnk4NmZCSDJwMnlkT2ZzekNBOWVKbnVROGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Trump Takes Fresh Jab at Kennedys After Deciding to Destroy Center - The Daily Beast",
    "description": "Trump Takes Fresh Jab at Kennedys After Deciding to Destroy Center  The Daily BeastThis Is Not the Kennedy Center  The AtlanticTrump hints at dramatic Kennedy Center renovations that will leave steel ‘fully exposed’  cnn.comDemocrats demand answers about Trump’s plans to renovate the Kennedy Center  MS NOWFrom ‘Hamilton’ to Issa Rae to Philip Glass: Here’s a List of Kennedy Center Cancellations  The New York Times",
    "published date": "Fri, 06 Feb 2026 02:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQcUhkNDNjZXJuTDVfbEI2RG1QUjVQZHd4Ti0yZFlhQkhLTy12bXJOa3JvdVhUWDQxLTIzdWFTMG16ZS1lbHEyWHdya1l0cUZzSjgxb3pRTXI5NDNPSXl3MGFGOGJUa0ZCa0MzX0FoV0FQa3NnZzJiQUVrNjRlT1lpVjRqQUw0WGc4ZEFpaHFvUnhmSWpRS1NoUE85ZExOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "‘The Masked Singer’ Reveals the Identity of Calla Lily: Here Is the Celebrity Under the Costume - Variety",
    "description": "‘The Masked Singer’ Reveals the Identity of Calla Lily: Here Is the Celebrity Under the Costume  VarietyThe Masked Singer Says Goodbye to Real Housewives Star in Tear-Jerking Reveal  E! News'Masked Singer' makes shocking reveal in emotional elimination  USA Today'The Masked Singer' reveals Calla Lily as reality star Teddi Mellencamp  Entertainment Weekly'The Masked Singer's' Calla Lily Was Pushed Out of Her 'Comfort Zone' amid Health Battle (Exclusive)  People.com",
    "published date": "Thu, 05 Feb 2026 02:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPby13VUNnNlBGb1pSQlZESmx1OHBlZnFxdzdnS04tcTRBTUx5c0hublk5YUZ6WHBpWU1pTTZkSkdNa3EyQ0lUX3FHUWlOekFqbkZ4cUVvNnlHcEtYLVU2RUc4NWdPTDh1ZE1LZnY2MUN2cjVEMTNvLTFEWjFRX05lbUVoZFBCa0IxMkUzNTZuYzZ1SFZtQmdQVFJra0NqYmNv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "MOULIN ROUGE! Sets Final Broadway Performance - BroadwayWorld.com",
    "description": "MOULIN ROUGE! Sets Final Broadway Performance  BroadwayWorld.com‘Moulin Rouge!’ Musical Will End Its Broadway Run This Summer  The New York TimesMoulin Rouge! The Musical Will Close on Broadway This Summer  Playbill‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years  Variety‘Moulin Rouge!’ Musical To End Seven-Year Broadway Run This July  Deadline",
    "published date": "Thu, 05 Feb 2026 22:30:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQT3NtT3BRd2d0SW05cGNNMFo2cFE4ZlVPRGFCNjZZY2RwVFBzUTZPeXlObGNZSUZzUXNFV0tMTU45VUVLX1pVWm02UC1WbkFfQjVUR3VQQUhEYlEtRXZwMjNXUXZEZlVkZEhUbnU4V3pYcUYzVGZ5eTN4b1NrM2FuYTNXeXlQSXpDeGxjRUVudEMxRGlSOUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.broadwayworld.com",
      "title": "BroadwayWorld.com"
    }
  },
  {
    "title": "MuppetVision 3-D Reference Hidden in The Muppet Show with Sabrina Carpenter - WDW News Today",
    "description": "MuppetVision 3-D Reference Hidden in The Muppet Show with Sabrina Carpenter  WDW News TodayReview: This Is Your Grandparents’ ‘Muppet Show,’ Fortunately  The New York Times‘The Muppet Show’ refuses to modernize in its triumphant revival  The Washington PostThe Muppet Show Special Event: Plot, Teaser & How To Watch  Disney PlusThe Muppet Show's revival with guest Sabrina Carpenter is joyful, say critics  BBC",
    "published date": "Thu, 05 Feb 2026 15:48:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQa0xiX1kyQ1JTRGNXMzY3Q25HQ2Z2OHVXUlpQbGZWTk9zcFdLcTBWbEZpYi1VdS1iM2VzMGdZR2Z1dXc0aEkyRWZnQVlMVUg5LUJ1YU5QQjJGck9fWml3N2h1QXJqb3JHR3FKSDBCcTh1cmtMOG83S1ZJeTMzZzVaNDJjVHZUS05QLTlyYi03RnNEYmEza0U2RWhWYTdlZkx0N3ViMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wdwnt.com",
      "title": "WDW News Today"
    }
  },
  {
    "title": "Margot Robbie, Jacob Elordi and Charli XCX at Wuthering Heights UK premiere - BBC",
    "description": "Margot Robbie, Jacob Elordi and Charli XCX at Wuthering Heights UK premiere  BBCMargot Robbie’s Fully Sheer Dilara Findikoglu Corset Dress Is Made of Hair  YahooMargot Robbie Brings Vintage Galliano to New (Wuthering) Heights  VogueMargot Robbie Takes Her Style to New Heights With See-Through Look  E! News",
    "published date": "Thu, 05 Feb 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE5qMzZyaDhrY0hzaU9XSVNlRFowYlVpSy10NV9sY2pIOGNDbjVFOThLT2tVOEtSdEFkQzdtc3lnd3htSEo5WFJ5Rm9LVG11UUZkWlpSajlXSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Where are all the protest songs? - NPR",
    "description": "Where are all the protest songs?  NPRBad Bunny Isn’t Toning It Down, and MAGA Is Fuming  The Wall Street JournalBad Bunny uses Grammy Award win to protest ICE  cnn.comRicky Martin Writes Open Letter to Bad Bunny After Grammy Victory: ‘You Won by Staying True to Puerto Rico’  BillboardThe stakes couldn’t be higher for Bad Bunny at the Super Bowl  Andscape",
    "published date": "Thu, 05 Feb 2026 16:18:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5mQ05UYjhNMmo2Q0t5SmxOMmNwVjhXU0REUzIycHk1VFc3Q1NHYm1QSG5aWkRxTGJuSU1zZ1JXYTdKM1ljb0l5NE1QakRhZEtQWVhEUWFGbmFMWTRmblBYQWZaTndxbW9yVFItNXJPcmNaeDFtWW4wSG1Pdzg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This. - The New York Times",
    "description": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This.  The New York TimesLouvre Museum crown left crushed but 'intact' after raid  BBCLouvre Begins Restoration of Historic Crown Damaged During Heist  Artnet NewsEmpress's crown dropped by Louvre heist thieves to be fully restored  France 24Louvre to restore deformed Napoleonic crown after brazen heist  USA Today",
    "published date": "Thu, 05 Feb 2026 17:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPQXhsOXpwbjRjTC13R01vTFpZckFYLUk0R0pCNzBIbTNMaE9lN3lhRWk0R0otNno3YjBBVUh4ZzRUUnVoU1NzWlQ2bUZjX0w3VUdlTHpVd3g3UHVIN0FBMmN5NW1GU0pIWWZJWnJRRzU2Szk2N2RMVTI0Y0lIVUhUWEZHMENrZmZ6cXRxS2ptQzBlNkVvSUNVTkd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Kid Rock responds to haters with Kobe Bryant quote amid backlash to conservative Super Bowl halftime show - Entertainment Weekly",
    "description": "Kid Rock responds to haters with Kobe Bryant quote amid backlash to conservative Super Bowl halftime show  Entertainment WeeklyKaroline Leavitt says Trump prefers not to watch Bad Bunny at Super Bowl halftime show  foxnews.comTurning Point USA unveils alternative Super Bowl halftime show lineup with Kid Rock  USA TodayKid Rock’s 2001 Song About ‘Underage’ Girls Resurfaces Amid Turning Point USA Halftime Show  YahooWhere to watch the Turning Point USA halftime show 2026 with Kid Rock?  The News Journal",
    "published date": "Fri, 06 Feb 2026 02:08:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQSkY2SFlHMmN2VGk3ZlB4VU5FMEJKTWhTYll5RVB2LWpobkZISjN4RnhSNGVSU0RDeFBJZEVFbzVDSEsydlMxdlBaTjUzWWJDVmppODBmeDQ2a284a1NhVVBQbDZPeUJRT2dkaU9Dcjg2Mzc3NWxma2NNMUhXQjBQX3ZwTFJWODVpYllrcGdiRjJ6aXNMeVhWUjF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "AJ Styles Talks Not Leaving His Glove In Ring After Retirement Match - SEScoops",
    "description": "AJ Styles Talks Not Leaving His Glove In Ring After Retirement Match  SEScoopsD'Amore Drop: If this is really how AJ Styles’ career ends, it's perplexing  Yahoo SportsWWE News, AEW News, Pro Wrestling Backstage News  FightfulAJ Styles and Gunther face off before huge bout at Royal Rumble: SmackDown highlights, Jan. 30, 2026  wwe.comAJ Styles’ wife Wendy sends emotional message after WWE retirement  F4W/WON",
    "published date": "Thu, 05 Feb 2026 09:23:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1bnhQQjZnZVpKeXdFTERXRmYzQ0std3RkMVpseWh6TERzSDh2TDhQQ1FmSVJuazRvcTJ1M3JpUGltaUlWVTU3WU1YNE9pM0JxVFdFYVZmSjJiOGVUZWZfQnZTQzdtZTNiaml2bXA0VVJXakpCN2FNTThCX2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sescoops.com",
      "title": "SEScoops"
    }
  },
  {
    "title": "Harry Melling Always Wanted to Be a Character Actor — but He’s About to Be a Leading Man - IndieWire",
    "description": "Harry Melling Always Wanted to Be a Character Actor — but He’s About to Be a Leading Man  IndieWireHarry Melling Went From PG ‘Harry Potter’ to B.D.S.M. ‘Pillion’  The New York TimesAlexander Skarsgård calls his latest a 'kinky gay biker rom-com.' It's also the love story of the season  latimes.comMovie Review: In submission romance ‘Pillion,’ BDSM meets barbershop quartet  AP NewsHarry Melling Knew He and Alexander Skarsgård Were 'Not Going to Be Shy' with Pillion Sex Scenes  People.com",
    "published date": "Thu, 05 Feb 2026 17:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNWWs4YWZpQldKTWs0bGs1eVFrdDViRElSZnJEVEgyeUtuY3IzWHV4b25wMTNGSFVhSUF1RWhIR1V1eW53TGdmTDMxbTE4ek9uZUx2V2h3MGJjOElnOVJNb0VHbUhPUEpqVmhiSTJTQzhJaDhtenptZnVaNUw0cDVSN25FVXRwcnl3VjZiRzdSSXBjZzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.indiewire.com",
      "title": "IndieWire"
    }
  },
  {
    "title": "Tony Khan announces new matches, segment for AEW Dynamite - F4W/WON",
    "description": "Tony Khan announces new matches, segment for AEW Dynamite  F4W/WONAEW Dynamite Preview: February 4, 2026 – Brody King vs. MJF in AEW World Title Eliminator, Omega vs. Andrade, More  allelitewrestling.comAEW Dynamite Results, Winners, Live Grades, Reaction and Highlights From Feb. 4  Bleacher ReportAEW Dynamite Results and Recap: Andrade Scores Big Win Over Kenny Omega (February 4, 2026)  TheSportsterBabes Of Wrath Eliminator Match, Death Riders Trios Bout, More Set For 2/4 AEW Dynamite  Fightful",
    "published date": "Wed, 04 Feb 2026 22:28:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPYi1GTnFLWk0yVndYWE1ZLVl3Qmw0LXlta25ob3JxNVc5TlQ1OERvd1RYRFN6V0hOZ2p6NjhYNE9hc1RzTGF2b3hpZ2VZaWNDSDdsN09Ybm83UDhWWnRzSkNJMWhCeHlPalJEMjQ4czliRGRTY0czZmg4azE3QnFFdVh3T2R6OVhnNmV2dVNDUEg3b3hBaE9V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.f4wonline.com",
      "title": "F4W/WON"
    }
  },
  {
    "title": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin - Variety",
    "description": "‘Baldur’s Gate’ HBO Series in the Works From ‘The Last of Us’ Co-Creator Craig Mazin  Variety‘Baldur’s Gate’ TV Series Continuing Game’s Story In Works At HBO From ‘The Last Of Us’ Co-Creator Craig Mazin & Hasbro Entertainment  DeadlineHBO is turning Baldur’s Gate into a TV show  theverge.comBaldur’s Gate TV Series Set for HBO, Will Be a Continuation of Baldur’s Gate 3's Story  IGNBaldur's Gate 3 Is Getting An HBO Series And At Least One Person At Larian Isn’t Happy  GameSpot",
    "published date": "Fri, 06 Feb 2026 00:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFAySUZ0Zmtzb3VnUkRVSl9kZTZ0OUw2a1haT0ttX0tFV1NqVDlpa1ZQRTlTVW12NVkzYm05YkxHTy12WU4tZjVSVHVNQzZsbWVDNkNlTHFoWEdxNTFwWHNWUnFBZTF3TkYxcUFFYTBaamdjLXJxMWtxUUQ0a3VqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "What to know about the rare condition Catherine O’Hara had - The Washington Post",
    "description": "What to know about the rare condition Catherine O’Hara had  The Washington PostCatherine O’Hara, Star of ‘Best in Show,’ Honored in Westminster Tribute  The New York TimesAndrew Gelwicks, Catherine O’Hara’s Longtime Stylist, Remembers the Late Comedy Legend  VogueCatherine O'Hara: The Queen of Mockumentaries  The Atlantic“A Mighty Wind” is Catherine O’Hara’s emotional tightrope act  Salon.com",
    "published date": "Thu, 05 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPdnU2eURzS0NkMUdmeVl1Q3dmR0twSVY3cnJaSUdRNU1VVXpnekpxWUhfYU03V2VrcUxCOUpqeXdZeFQ5QXZPLUFHMjZuTnMzYkFXQl9iMlRRQm1nSnA5c1pFNDcxZURNMjBYZkt1dUlSOTN6c1d2bmNXTEFnU1lNRk44N2NDQl9Yc0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "‘The Lincoln Lawyer’ Season 4 Escapes Three Common Netflix Pitfalls - Forbes",
    "description": "‘The Lincoln Lawyer’ Season 4 Escapes Three Common Netflix Pitfalls  ForbesThe Lincoln Lawyer: Season 4  Rotten TomatoesPalm Springs area locals featured as background actors in new season of Netflix's 'Lincoln Lawyer'  KESQThe Lincoln Lawyer Will Return to the Courtroom for Season 5  Netflix'The Lincoln Lawyer' Season 4 is 'most emotional' one yet with new faces  USA Today",
    "published date": "Thu, 05 Feb 2026 16:38:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNSEJrempCS0VVam42dmg1VWQwbW1RdHdMby1sTl9qX0pxNUtaNlBWNUNRNXFwMFlhSnI4WFdpczZmR0pDOVkwZU5YM2JMcGdTdGhUeEp1VTVXVVVaMzhRNkFPQTE2bDVFZ3BTeDZMNW1qQW1FdE9rWFloX1ZJS0F5bVYydjB4N00tUUUwS3FveWRCZU9UVVpzblpXV1dIU0tuVUNkandJbkwzbEFZM2dFLUpsRTJvbHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "'The Lost Boys' first look at Broadway adaptation of cult classic film revealed (exclusive) - Entertainment Weekly",
    "description": "'The Lost Boys' first look at Broadway adaptation of cult classic film revealed (exclusive)  Entertainment WeeklySink Your Teeth Into a Preview of The Lost Boys, A New Musical on Broadway  Broadway ShowsVideo: In Rehearsals with the Cast of THE LOST BOYS  BroadwayWorld.comWatch Now: Sneak Preview of The Lost Boys on Broadway  broadwaydirect.comVideo: THE LOST BOYS Cast Performs 'If We Make It Through The Night'  BroadwayWorld.com",
    "published date": "Thu, 05 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxObU91TUlsaUhHQzlhTXk3ZGFEQ2VZOWVHc3VCdlEyY1U5QnROWXNRMGUxdGhkSjlHTDhLOFRCcmVzUTF6clM5MGUxX0VYaDRuejJGb1lnWTJoYmxINm5YYVVkcDBQZEpkNkN3MHVCaExBWlBoc09HMzI5SFZIbVlkLW9paFl5My1qeDhUS19lYkhSU3ZKSHJUX0IxUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "The Philadelphia Museum of Art Restores Its Old Name - The New York Times",
    "description": "The Philadelphia Museum of Art Restores Its Old Name  The New York TimesPhiladelphia Museum of Art name change reversed after 4 months  6abc PhiladelphiaPhiladelphia Museum of Art rebrands itself, again, back to its old name  WHYYPhiladelphia Museum of Art Says Goodbye to “PhAM”  HyperallergicBrand Update: Philadelphia Museum of Art Will Return as Name of Institution; Griffin Logo and Brand Identity Will Remain  Philadelphia Art Museum",
    "published date": "Thu, 05 Feb 2026 19:24:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPbnIwbS14Ukt0WUI5dTVqc2d3Slh0NXhGMTZWRHh2aWI2Z0dKc3hWb2xJdzQ1M2loM1J1QkZ2b0E4Z1l3UXBtQUhrWWMxZm5ZLWlQOUxUY0JhV21nVmpnc3NkNFV3WUtDOVRMLXJVSVlMRWN6RTk4U2NBbm5KaThYUUNDTGw5M1Fmb014N3pFcHRma1I5cS03cmRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Movie Review: Caleb Landry Jones is a lovesick vampire with a fabulous wig in Besson’s ‘Dracula’ - AP News",
    "description": "Movie Review: Caleb Landry Jones is a lovesick vampire with a fabulous wig in Besson’s ‘Dracula’  AP NewsReview | A famous director, a talented cast and a ‘Dracula’ that is endlessly bad  The Washington Post‘Dracula’ Review: Fangs and a Lot of Fragrance  The New York Times‘Dracula’ Review: Luc Besson’s Kitschy Vampire Pic Is Light on Gore and Heavy on Amour  The Hollywood ReporterLuc Besson’s ‘Dracula’ is so bonkers, not even Christoph Waltz can save it  San Francisco Chronicle",
    "published date": "Wed, 04 Feb 2026 18:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQRk9RMXV1dGFtWDdzSGtXeDFrVkx2UWJzcmx0NmxSZTBnaTB4S3BPWnA1VGkyeWowdm8zV1c0aUpVcnR5VjZGMG9wbGIxclVvckpZUGc1RkJIeFZyaEc0LTZTWWhHVFhjdkphb1c1WFpmd2xrMFk0MDZSRTR5bnp4d0tGc1NDekMxcmVpT21hZWY2Wk9IWFAxNVI1NWVTUnBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "'More relevant every day' in the U.S.: A filmmaker documented Russia's journalists - NPR",
    "description": "'More relevant every day' in the U.S.: A filmmaker documented Russia's journalists  NPRView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 14:41:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOUUE3a2J2QkFyaXhNWHJsTjU5Q2RNLVYwYW9pd1N4QTBmZFBaQTFCLUdPdTQ2MlBGbkxObTFSS0NUbjZtVXJiWnN0X1haZE41VkxCb0l0alZ1clJfRG5fTlJhUXlCVG1wVDZQVEVZaG11Rl9ZQWVWNFhxR25SM0FPRlJYRndaZE1nSU50QlR6Vk8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘Fallout’ Season 2 Ends Pointing at the Big Bad You Already Knew Was Coming - Gizmodo",
    "description": "‘Fallout’ Season 2 Ends Pointing at the Big Bad You Already Knew Was Coming  GizmodoSome Surprising News About The ‘Fallout’ Season 3 Release Date  ForbesFallout Season-Finale Recap: Welcome to the Wasteland  VultureFallout Season 2 Ending Explained: Your Biggest Burning Questions Answered  IGN‘Fallout’ Finale Offers Major Game Easter Egg For Season 3: “Always a Matter of How and When”  The Hollywood Reporter",
    "published date": "Wed, 04 Feb 2026 20:00:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNaWpJXzBDOHczektNcmNDSTBOaEpYcnpoeF9SMi1WYktKcTZfNVY4QjA3QldhT0ZfcnBOZ1luVjd3U191MFdVOFN3cGQ5cFR4cWRCWnlJRWE2LU1qRDNTNm9weGw0ZmtCRUZZNEpFYVBxU3FQelp5aXREdVBBTzNCVm00eXU2X0lOSWxSNkpENm1LMzBzQ3lpT29vMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "California Introduces Bill to Cap Resale Ticket Prices - Billboard",
    "description": "California Introduces Bill to Cap Resale Ticket Prices  BillboardCan New York Stop Ticket Scalpers From Gouging Concertgoers?  The Hollywood ReporterLive Nation’s Two‑Front Strategy: Fight Breakup Pressure in D.C. - Rewrite the Rules in the States  TicketNewsProposed California bill targets bots, limits profits on ticket resales  ABC10Why California's fight over ticket fraud has become a proxy war against Ticketmaster and Live Nation  latimes.com",
    "published date": "Thu, 05 Feb 2026 16:10:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5zeW15VlNVSFpzZUZDTzE2aVNwemlzX2VlWXdFd2ZtODUyb3FHbUFvNkd5WmdYMXJ5VjNmWk1Xd3NzdmtNTkxiQTI5Z2k2dU1IZVAzTVJxSXRGa0oweTlQV0RRUXZoc1RLaTNGTnpKTllpUXlGWHZ6ZGdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.billboard.com",
      "title": "Billboard"
    }
  },
  {
    "title": "Paramount’s David Ellison Vows Anti-Monopoly Approach in Warner Bros. Discovery Bid, Pledges 30 Films Annually in Open Letter to Creative Community - Variety",
    "description": "Paramount’s David Ellison Vows Anti-Monopoly Approach in Warner Bros. Discovery Bid, Pledges 30 Films Annually in Open Letter to Creative Community  VarietyParamount CEO David Ellison Takes Dig At “Monopolistic” Netflix In Open Letter To UK Creatives About Warner Deal  DeadlineEllison Tells EU Regulators He’s Committed to Films in Theaters  bloomberg.comDavid Ellison Warns of “Monopolistic” Netflix in Open Letter to U.K. Creatives  The Hollywood ReporterWarner Bros. Discovery Stock (NASDAQ:WBD) Slips, Paramount Not Giving Up Yet  TipRanks",
    "published date": "Thu, 05 Feb 2026 07:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPZTY2RkNxUEJNUUhod3VpeVBFVnFYLWVnTUdSVTN6OGltME1yWHFWTTJ0Uk1OVHU2bGEtdjJDYXBJdmdXX2Jpa09sakNaYU9BMnJIZjZRX0wxQldFdjRUWlRINHhtNjlTaVE5T0dmWU9IUUd2eWxHXzRsei1sdm1pVVh2eVJSOC1uRWFUbm8wTzFyYWNhRm9nWjJ6Qi1rRXgzSGY0ZEp5Zjh2d1MwbTJjVnE3bjFtODZ0amU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Newly discovered Michelangelo foot sketch sells for £16.9m - BBC",
    "description": "Newly discovered Michelangelo foot sketch sells for £16.9m  BBCRare Michelangelo Study for the Sistine Chapel, Newly Discovered by Christie's, Sells for $27.2M, An Artist Record at Auction  Christie's - Press centerMichelangelo’s tiny drawing of a man’s foot fetches toe-curling $27M at auction: ‘Best foot forward’  New York PostSold for $29.3 million! One tiny foot drawn by Michelangelo  The TimesFooting the bill: Michelangelo drawing for the Sistine Chapel makes $23.1m at Christie’s  Antiques Trade Gazette",
    "published date": "Thu, 05 Feb 2026 18:21:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5VanNYcmVkckFtRmdrZFh3ZkpkVHB5VlF4aHBZV0ZIVnZuWnZnUi1VeVRmUUNJeml5eFU2dGRja1VlMzkxV2VTT2FfRV9JR1V0WGxmQ0RrYUQ5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Kid ‘n Play’s Christopher Reid Reveals He Had a Heart Transplant: ‘I’m Urging All of My Fans’ to ‘Get Checked Out’ - Variety",
    "description": "Kid ‘n Play’s Christopher Reid Reveals He Had a Heart Transplant: ‘I’m Urging All of My Fans’ to ‘Get Checked Out’  VarietyChristopher 'Kid' Reid reveals he underwent heart transplant  ABC NewsKid 'N Play's Christopher Reid Reveals He's Recovering from a Heart Transplant: 'I'm a Better Version of Myself'  People.comMember of popular 1990s rap duo has heart transplant  YahooHip-Hop Legend Christopher “Kid” Reid Survives Life-Saving Heart Transplant  jubileecast.com",
    "published date": "Thu, 05 Feb 2026 16:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQVzFCTnA3MTVKelE3cHFaUmhsTjFOUk5kNmhiUFByeFJsZmlac2VZVmtCcEhDX0VyeVpNanNxNmRSUHV0TmtGdGtESmtjcDZZcktJNTBMWE1iWW1RUFk4RENXMmlZek5IMXk1ZUk4Qmhkdm42eUhfVnVUeDlTLVJtX19lN1ZZRnZCV2lPYmI5NnN6ZlJMdFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "‘Melania’ Backlash Causes Huge Surge for Michelle Obama Doc - The Daily Beast",
    "description": "‘Melania’ Backlash Causes Huge Surge for Michelle Obama Doc  The Daily BeastMichelle Obama documentary rises 13,000% in views as Melania film opens  The GuardianMichelle Obama's 'Becoming' surges on Netflix amid 'Melania' movie release  USA TodayMichelle Obama ‘Becoming’ documentary sees viewership spike amid ‘Melania’ release  The HillMichelle Obama’s documentary surges on Netflix after Melania releases in theaters  The Independent",
    "published date": "Thu, 05 Feb 2026 10:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxONG5SUUpwMnd5M0IxbUZlbWpVbkdBaEFVYVVwMUJrUzZUSmdscW11Wkk5MWRYVWpERmJuYUNFRFlRbHVqZktOYnRuUTMwVi1ETllEOFZpRzYxeUtrVm9GMC1hSXJrRWhYYXdaMW9vVzVrZTBFR0FBekJXNHlwZFJWM1ZkcGVjeE44aDF5ek9LeC1Ydw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Former Prince Andrew moves out of royal residence, Windsor's Royal Lodge - ABC News",
    "description": "Former Prince Andrew moves out of royal residence, Windsor's Royal Lodge  ABC NewsFormer Prince Andrew leaves his Windsor home as Britain's royals seek distance from Epstein revelations  NBC NewsAndrew, ex-prince linked to Epstein, moves out of royal residence  The Washington PostHow do people feel about Andrew in Sandringham?  BBCRoyal staffers refuse to serve former Prince Andrew at new home: Report  NewsNation",
    "published date": "Wed, 04 Feb 2026 17:27:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPX1BXVW9hbWNJc2I0eWRmNElidjIyRDh6QUp0YWxxZHFpazFCaDRLMTlXZVVscEdvQTJfYUlDQlpRVUt4TFpKUnE1am9IOGNEN3lDREdDczZGS1FPdWJqTGowSnJMWGF6Zmw5a19GVVNuck5seW9fVi1EZFdDM2t6NktxMXdSV0VmbmFJZ2tfUE5ISFItRUYtS0lueTRiMFNucFdISlpvREhEa2FO0gGyAUFVX3lxTE1ZaFp1MDZUcHVKUTY3LUFVVzYxT0l0bGxsTFlmMEtRRV9KNERwR243Uzd6c3p3a1hxdlpfUXhITXhIMXEzazBkMFhjaVF2NW9PdjVYdnQ1eXM2UTN2YkNWYWVoZWl2TG5FT29DSUpfZDZDLWVvRVliblNJdzFiLWl5b0oxTkFqU0RMeDd2ZEpNVzVzUTNjRkFXSjVIM01haGR0MVM0anN6Y1luOHBpeVdnRVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Anti-ICE chant erupts at AEW pro wrestling show in Las Vegas, pausing main-event match - NBC News",
    "description": "Anti-ICE chant erupts at AEW pro wrestling show in Las Vegas, pausing main-event match  NBC NewsTrump Body-Slammed by Pro-Wrestling Crowd’s Raging ‘F*** ICE’ Chants  The Daily BeastWrestling fans chant ‘F‑‑‑ ICE! F‑‑‑ ICE!’ before main event  The HillPro wrestling fans loudly chant 'f--- ICE' during an All Elite Wrestling match  foxnews.comWatch: Pro-wrestling fans loudly chanting 'f*** ICE' goes viral & is the best thing you'll see all day  Advocate.com",
    "published date": "Thu, 05 Feb 2026 18:45:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPdGRtYm5NTE1GSXE1bkZlYnFhRDdIMmxIMW9WOC1hWE9mV21jay1qdWkyOFh6bkh2VEp0eGUzTzgyczFTTXZzVGhHUVFPWDZKampnVlQzRGVtcC1LU0J4emtZVTV6ZEtCQkN5ZEVNb0lES2RpMGVtRHdmQU94NWk4TnZsUlo5VzlKcHdDU3V3OUVoOGM4dDd2RmY1LUYzRGM1RTZraXJuYjAxVDhSVHB5bjhmT0R3VDU1NVpiZXpnVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "'The View' star Sara Haines cries upon learning she's related to 2 U.S. presidents - Entertainment Weekly",
    "description": "'The View' star Sara Haines cries upon learning she's related to 2 U.S. presidents  Entertainment WeeklyThe View's Sara Haines Burts Into Tears After Finding Out She's Related to a Former U.S. President: 'He's a Good One!'  okmagazine.com‘The View’ Co-Host Breaks Down in Tears Learning She’s Related to 2 US Presidents  PopCulture.com‘The View’ Host Stunned to Learn She’s Related to 2 Presidents  Yahoo News UK",
    "published date": "Thu, 05 Feb 2026 17:21:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxON3BIOEhGZUNGWDBteFhnNVJKY1FldlNhM2c5SEVjckdvQ2M0N3drcXBhd3lvaUUtQ2tjRV9zVy12WnFsa3FPcFJhWlh1OWVuU19rQlVQLTc3MkVTWHd3S281emo3UC1qSlVaUlU4T1ZnalN2cVMwVHBNYWppUVhBWVFvVjJjb2l3bkd4eFZCQlA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Mark Ruffalo Says ‘STFU’ to Kevin O’Leary After His Criticism of Billie Eilish’s Anti-ICE Grammys Speech - TheWrap",
    "description": "Mark Ruffalo Says ‘STFU’ to Kevin O’Leary After His Criticism of Billie Eilish’s Anti-ICE Grammys Speech  TheWrapOpinion | No, Billie Eilish, Americans are not thieves on stolen land  The Washington PostRepublican senator suggests Billie Eilish should forfeit her Grammy over ICE remarks  The HillFinneas calls out ‘powerful old white men outraged’ by Billie Eilish’s Grammys speech  latimes.comNative American tribe that owns land under Billie Eilish’s LA mansion has message for virtue-signaling singer  New York Post",
    "published date": "Fri, 06 Feb 2026 03:35:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxONzNSMWM4M09zVlVRNExhVm01QWhQWnpxLTFBbHk3U1lhUHZSdzZFc1M1aTVRcUt1U2VUSUcxS1Z0NGZJd0p0OTFqNjNPbUF1Sml1SUJudmpScHJqZ21kdjJqbGR1eEVnUDRiU3h5d0JKYmUtWWl3MjFkVUR3eHB0dVdMRTdWb05vT2ExN1V3TWhObFpqdjJycEFLV01KN3k2d0RSakNXU0ZmdzFPSWoyV0h4c3BsQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thewrap.com",
      "title": "TheWrap"
    }
  },
  {
    "title": "'Marty Supreme' Gets China Date; Movie To Be A24's Highest Grossing - Deadline",
    "description": "'Marty Supreme' Gets China Date; Movie To Be A24's Highest Grossing  DeadlineHow Soon Is Timothée Chalamet’s ‘Marty Supreme’ Coming To Streaming?  ForbesTimothée Chalamet’s ‘Marty Supreme’ to Get China Theatrical Release  Variety‘Marty Supreme’ Makes Huge Step Forward for Original Movies  YahooMarty Supreme (after Christmas Day)  The Bucknellian",
    "published date": "Thu, 05 Feb 2026 02:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOV3Q2dEFMY3pQRnVmbjhjeGIwa3k5U04wYV9FNlBNSmZMSWhtVmFYVDAxc211U2llYXZvWnpDRDFtMWM0NW1zRkJ6d0htcXVtQlFQanZHcmVucFNNLVVCUDNlWGhsaGxhYnNKTGEwdjZyM3BzcFo1TVFHcWlrNE1TbE1IRkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "'The View' producer shakes head in horror as 3 cohosts motion toward privates - Entertainment Weekly",
    "description": "'The View' producer shakes head in horror as 3 cohosts motion toward privates  Entertainment Weekly",
    "published date": "Thu, 05 Feb 2026 19:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPLXpLbkVBZVR6aVRYa3RKUjRSc0FOUjg0eEd0ZkF6c2tmRGdHeVpuVE11MGRHRUI4dkZIV3JHa2I2YjJMTUJQWFJEdC1PbXpiU3c2ZmRJVGQtVUNWZk5mNEp0WXBNb2VjbnlTVHRleUZSckQ3Z1hQcThBUG5RMDJsX0N2UDJYQ0hXcGEtMVpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "MAGA's Aspiring Pop Star Takes Offense To Rock Legend's Stance Against Trump - HuffPost",
    "description": "MAGA's Aspiring Pop Star Takes Offense To Rock Legend's Stance Against Trump  HuffPostStreets Of Minneapolis  brucespringsteen.net‘Streets of Minneapolis’: 32 protest songs inspired by the Twin Cities’ ICE resistance  MinnPostSpringsteen ICE protest ‘Streets of Minneapolis’ highest-selling song in US last week  The Hill‘Streets of Minneapolis’: Bruce Springsteen’s Anti-Ice Song Debuts at No. 1 Despite Limited Release  Yahoo",
    "published date": "Wed, 04 Feb 2026 16:27:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNWmg0MVhYZ2NuZTFCZkhieUwtck15WE93THZDTFVsXzI0Yl90X1dTaklPcnpZcUdZejBZdkJvMFlQdjVvZHhENGVxME1mUk9JMUxzdERRWUZTdUtiT094OHFEa0lvTXhsb0JBdXRTWlJKVlVZeDJjdEE4dmJscnFrNnkzZWdUUlBmNjYwUnZHQWZNajUyT1NyemdnQmxSQdIBowFBVV95cUxPc3hJOFkyTkZqVGg5MFFEVHRJODVmSndFWURXWEJ6c2hDSGZMYXpqcmpLWjR6dGRNX1ZubU1BeEU3V2JjWkNSQ2dBNlpXTjRpQ2tTdzlxTXd2a2NVRXBkbjQtNm8wSXlKeGUxRVlJYTNGd2tRZHFCWnVURk5FV3pFdVBMWUJGRkVKR2dhT19pWUFPWElTR25HM2RUTG9uN09SSEtr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "You can now access F1 TV with your Apple TV account, here’s how to set it up - 9to5Mac",
    "description": "You can now access F1 TV with your Apple TV account, here’s how to set it up  9to5Mac‘We will bring everything Apple has to bear’ to bolster the viewing experience, new F1 telecast partner pledges  RACER - Racing NewsStefano Domenicali attends Apple TV press day  Formula 1Is ‘F1’ Sequel Revving Up? Apple’s Eddy Cue and Formula 1’s Stefano Domenicali Tease Film Plans  The Hollywood ReporterAfter F1 Movie Success, Racing Boss Hopes to Share More on a Potential Sequel Next Year  IGN",
    "published date": "Wed, 04 Feb 2026 19:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB2S0g0VmRYSXVTMHRPOWVseUpGQ0dMMXFVQklialdmaDNQcWFZTmJXYS1yZXA1Ym80WVVEUmF5S0JzUWJGSVNPSTU4VlBDUXluNkI5STU4NFRCT0RQbUhMdjRkMnEyUXNpTmlhMnRBa2lZMXZxSmllV2xfM1NObE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Email appears to confirm photo of former Prince Andrew and Virginia Giuffre is real - cnn.com",
    "description": "Email appears to confirm photo of former Prince Andrew and Virginia Giuffre is real  cnn.com'Vindicating': Giuffre's brother on email appearing to confirm Andrew photo  BBCEmail appears to confirm photo of Andrew Mountbatten-Windsor and Virginia Giuffre is real  The GuardianVirginia Giuffre 'Vindicated' After Epstein Emails Suggest Prince Andrew Photo Is Real  People.comEpstein files: Email appears to contradict Andrew's claims about photo with accuser  Sky News",
    "published date": "Thu, 05 Feb 2026 11:49:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5WaUtTOG04d3k3d3locG9TMHVhOElFdXVab2ZZVkg3VGw3eTRXX1dEWnVuTUpveHdva1c2bVJZRkRTZHFxVk55ZWFYYmQwVTdlQ0F2RFNpSk56NmhERTE0ZUQtc0hqMjdjZGpUdFRzb2Y3SzRvNHcyaGFMbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Why is Jacob Elordi’s Wuthering Heights casting controversial? - Yahoo News UK",
    "description": "Why is Jacob Elordi’s Wuthering Heights casting controversial?  Yahoo News UKIs Emily Brontë’s ‘Wuthering Heights’ Actually the Greatest Love Story of All Time?  The New York TimesEmerald Fennell hopes Wuthering Heights will ‘provoke a primal response’  The GuardianJacob Elordi’s Suit Got Caught Caught in the Rain  GQ'Wuthering Heights' First Reactions Praise Margot Robbie, Jacob Elordi  Variety",
    "published date": "Wed, 04 Feb 2026 14:35:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQzNWN0wxemlCMmlJek9yWDZDOW1GeVNwU2pVNzZtTkF1WHhqSnZDV05GNy0yNUl1c3E0VjZTWE1STzlrMFd5OVJlU05MWWNFQnd3UFBVR3pvZFlFVkczRHY0b19NM0VFc09CSElfMzMzbnpKelBIRUxBbjdTaWtKTUhZWkoyVUZ2c0hTUmZKZThQbWhDWjdIVWFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://uk.news.yahoo.com",
      "title": "Yahoo News UK"
    }
  },
  {
    "title": "Whitney Leavitt Leveraged ‘Mormon Wives’ to Earn ‘Chicago.’ She’s Not Sure How She’ll Ever Go Back - Variety",
    "description": "Whitney Leavitt Leveraged ‘Mormon Wives’ to Earn ‘Chicago.’ She’s Not Sure How She’ll Ever Go Back  Variety‘Real Housewives’ Star Bronwyn Newport Dresses ‘Like a Black Widow’ For Whitney Leavitt’s Broadway Debut  YahooPhotos: Dylan Mulvaney, Whitney Leavitt Give a Post-Show Talkback at Broadway's Chicago  PlaybillDemi Engemann Absent from Whitney Leavitt's Broadway Debut  People.comMomTok Showed Up for Whitney Leavitt’s Broadway Debut  The Cut",
    "published date": "Wed, 04 Feb 2026 18:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNVnRTUkdPeDN2UlZJaUUzNG5yVkk0YzJYY18xOE55TEUzRkc3WHN1QkdMTG1paWY2Tmh1RnkyaXBkSXNZM3ZIV1FzME9fdlFKWWlsMlJmTC1VeXhGQTVrakJRX1FyOW1kbXRBRWhmeGU5VnUtQUVHUGlzYUUtLXczbkoweXRQdUtqb0lZbHIyVjY4QTB5R2hXb2RVMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "How Super Bowl halftime moments became flashpoints from the 'wardrobe malfunction' to caged kids - AP News",
    "description": "How Super Bowl halftime moments became flashpoints from the 'wardrobe malfunction' to caged kids  AP NewsShowtime! Interesting facts about the Super Bowl halftime show  NBC Bay AreaFrom The Athletic: What were the most talked-about Super Bowl halftime shows ever? These are the halftime performances that had everyone buzzing, at the water cooler and on social media, the next day. https://nyti.ms/4a9xkh5  FacebookSuper Bowl Halftime Shows Through The Years  ABC NewsThe Super Bowl halftime show over the years — as told from behind the camera - The Athletic  The New York Times",
    "published date": "Wed, 04 Feb 2026 16:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQNFFHTkEzTm9KZi1BdWNaZEZ5S3JOSTdFTGdCRklTTXJoYjF5dTF5bDJtQlhYendXd0hqN0hVbWxSVk12QXozU1E1MkxKSjMwMXY4UVRZWU1JUE16ZDd2eVNGMDRHNldvRjlrTnctWHBFaGR6dE9ERnFmR3dJSFVWbi1rcUt2d2k2RlBUTWp6cDdnRlFDSE0zc3lhWXZlcFo2WmVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Amazon pulls Melania from Oregon cinema after owner’s criticism as rumours mount over ‘fake ticket sales’ - The Guardian",
    "description": "Amazon pulls Melania from Oregon cinema after owner’s criticism as rumours mount over ‘fake ticket sales’  The GuardianA Portland-area theater says Amazon banned it from screening ‘Melania.’ Here’s why  KOIN.comAmazon pulls 'Melania' from theater over marquee joke, description  USA TodayAmazon Pulls ‘Melania’ From Movie Theater Due to Jokes on Its Marquee  Yahoo News CanadaLake Oswego theater says Amazon canceled 'Melania' screenings over sarcastic marquee sign  KGW",
    "published date": "Thu, 05 Feb 2026 19:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPdDYzd2ZJT21OcjhUN29oTnpmVndQZ3otQnpLTjM1M0ZYUzVPVDFWd21Qc0pJNnBJTUhpeW9tOU9xdkRjNzluQXJQVTBfV2RtLVpkQVRHdXhnaVg3X3ZIR1VFbmxXN3ZyVDVZYVpyUzFVMVpscDk3bUYwXzRvX2lkdk9UeGNNRWk4WFNxdWxBaTZ1SElZMnE4ZHptZlh4eWFES2tsT04tc2U0czA2QXlJVE5oNUhLNW5CNkt4VmJJekFDWGVCWWVWSEgtZFA0WEdhYTJCb1FNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Join the Club: ‘Heated Rivalry’ is Making Queer Hockey New York’s Hottest Sport - THE CITY - NYC News",
    "description": "Join the Club: ‘Heated Rivalry’ is Making Queer Hockey New York’s Hottest Sport  THE CITY - NYC NewsThe hit TV show that no one saw coming  The EconomistBrock McGillis, Former Professional Hockey Player, Marries Matthew Ward After a Decade of Ups and Downs  The New York TimesYour obsession with ‘Heated Rivalry’ is about much more than sex, therapists say  cnn.comGay hockey drama 'Heated Rivalry' becomes word-of-mouth hit in Russia, but fandom could lead to prison  NBC News",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBYLW8za3dud2pldVpJcFdrLW1DN1ZrVGlYVzg2SUFVdmFvUEUzWlBHTkRud1dsSWkxVHlJRGVqR2J6RkFFa3FjWUlSSG5FQjZjSkwwWHJOWk54bVBlU1BDckhCeG4wX2NzWm5YU2pha0NtSzdjMXA2MQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecity.nyc",
      "title": "THE CITY - NYC News"
    }
  },
  {
    "title": "Channing Tatum undergoes surgery after injury and more star snaps - pagesix.com",
    "description": "Channing Tatum undergoes surgery after injury and more star snaps  pagesix.comAlabama-born actor shares hospital photo before procedure: ‘This one is gonna be hard’  AL.comChanning Tatum reveals severe shoulder injury, 'hard' hospitalization  USA TodayChanning Tatum Hospitalized for Shoulder Surgery From Ski Accident  TMZMajor movie star reveals grisly reason for emergency surgery  NJ.com",
    "published date": "Wed, 04 Feb 2026 16:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNOGdhU1otS3BRTjQ4bWg0Y0tIeVNrTEVMTjZBdUZkOThLWnNFTlJRRUdDSXBJallYc0Y3aUNsTXJBY3Y0ZmN0cmE3WnB2cjdKODFwWkV0ejNoaGt6U181R0M0Q2hib3U3cEtBWW1TdktCUEdtMmJMbUpqbzl5TXJ0dVZ3bjV5RXdFTDMxM1JEQ0JQYTFNal9VWmw0cmQ4cWZmbGtTWUxOMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pagesix.com",
      "title": "pagesix.com"
    }
  },
  {
    "title": "So What’s the Deal With Iron Lung? - Vulture",
    "description": "So What’s the Deal With Iron Lung?  VultureThe Self-Financed Horror Movie That Beat ‘Melania’ and Battled Disney for No. 1  The Wall Street JournalIron Lung review – YouTuber Markiplier crash lands with big-screen sci-fi horror  The GuardianIron Lung’s path to theaters was unique, even if the movie isn’t  theverge.comIndie game film adaptation Iron Lung earns $21.5 million on opening weekend  GamesIndustry.biz",
    "published date": "Wed, 04 Feb 2026 22:38:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNN093VzhjanNhNFpvcnBJejZ1WFNZSTNCSko4SGRqT194c2pzb0xvMnhmTVlyTXVybUtDblVfZ2ZiaWlJcnF4S0VFNTlEajIwLXVOMVBKWnJtS0Itb3dscnl2WVNQMUczZGR6eWU2MV9CVHhBTUkta3h5ZjQ5RVY3MndQYnJMWlZ6YmxTOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vulture.com",
      "title": "Vulture"
    }
  },
  {
    "title": "'The Poster Boy for Cancer' Has Good News - Newser",
    "description": "'The Poster Boy for Cancer' Has Good News  Newser'Full House' star and Metro Detroit native Dave Coulier's cancer in remission  FOX 2 DetroitDave Coulier says he’s cancer-free — again — months after tongue cancer diagnosis  latimes.comDave Coulier, actor, comedian known for 'Full House'  Detroit Free PressDave Coulier reveals his tongue cancer is in remission  ABC News",
    "published date": "Wed, 04 Feb 2026 16:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOcGh6cTE0THBneVcxMkVSZVo1bWxvYUZtWlRZYXZLazVseENtLTdfSnQ3WlI5ZlNiOXJMTHpLN0hVb044Qkh2ZTM1eTNGSnpsWmZCMFpUdG9Odmc4RnBTbmF6WllvVWVGWUNxM2R5dEQ5Z0w1c080Yk8wY3V2OWd1SGhkdFBhbVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Draco Malfoy Becomes an Unlikely Lunar New Year Icon - Newser",
    "description": "Draco Malfoy Becomes an Unlikely Lunar New Year Icon  NewserA Harry Potter villain is now an unlikely new-year mascot in China  cnn.comHarry Potter’s Draco Malfoy becomes mascot for year of the horse in China  The GuardianSad horses and Draco Malfoy: China's unexpected Lunar New Year trends  Yahoo News SingaporeThe new face of Chinese new year? It’s Draco Malfoy …  The Times",
    "published date": "Wed, 04 Feb 2026 18:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPN2NNZ0hWcnNxcTRKUlVhQ0dTR1JRamJCdzh5SkMzN0MwYlhoRGVLbl9BMk9oV1Vha21pUDE0azctX1kzZkxGLTY5NGVTQkpiRUJRRjlIeC03TzhaRE5pQ0xXdHBHeXlEMVR6bWNHMzBvU1JzeHlXWXhiUzg2T0NaOGtEdTNKRG1EMWlpRTg1WWhYNFhyallUNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Shaboozey responds to Grammys-speech backlash: He wanted to honor his parents' sacrifices - latimes.com",
    "description": "Shaboozey responds to Grammys-speech backlash: He wanted to honor his parents' sacrifices  latimes.comAn Emotional Shaboozey Tears Up After Winning His First-Ever Grammy: 'This Is a Representation of My Dreams'  People.comShaboozey poaches Kenya’s crown  Daily NationJJ’s Country Music Minute: Shaboozey Responds To Criticism and More  101.3 KFDIShaboozey and the Habit of Erasing Who Built America  Word In Black",
    "published date": "Wed, 04 Feb 2026 21:49:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNVHhlVTdTbmpkRlMwOEtaTTlpTS1kZ0tkNmd5a0dBNFRLRjYwUWQ2QVZBSTQwUFg5NVNnbVNTMDRRNVlwY2hmMjRSZWxqVnMzd1VQU0c1N2NkNmh1UkxfN1NJcDc4eUxrTjBRRXFOQnpGYW1XZlRCSGp5ZElKSkxyaldJN3ktdlZpdTAzOEVFQk1fa0pSUm81STJNZGFfenJOcWdycnQ1Q3N5VjJO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Noah Pacht and More to Star in THE OUTSIDERS on Broadway - BroadwayWorld.com",
    "description": "Noah Pacht and More to Star in THE OUTSIDERS on Broadway  BroadwayWorld.comMeet Broadway's New Outsiders  PlaybillNoah Pacht, Caleb Mathura & More to Star in The Outsiders on Broadway  Broadway Shows‘The Outsiders’ Musical Recoups on Broadway  The New York TimesVerona-native joins Broadway cast of 'The Outsiders'  channel3000.com",
    "published date": "Wed, 04 Feb 2026 14:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNNmJyOXBFbkxwQndkbFVETGFRSlFmMVExaU5TeG14dEk4Z2tvMVA5VVFaa2g2aUg2ZEZnY1BYSHU1MXFhRzhTQ2Z4Q2tudGhTSUQyMGFCeFRmek1SWFRDZDdqT2pONUNZbjV0eWJOcElpOFRPZ2paUGM5ZHZYS0pFLW80Z0J3RlpFY2lHSWsxVGpvNVNNUWowX05yS0ZBQzBvUmREZ3FB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.broadwayworld.com",
      "title": "BroadwayWorld.com"
    }
  },
  {
    "title": "Ellen DeGeneres Reportedly Bought A California Home Because She \"Grew Tired\" Of The UK - BuzzFeed",
    "description": "Ellen DeGeneres Reportedly Bought A California Home Because She \"Grew Tired\" Of The UK  BuzzFeedEllen DeGeneres returns to California with $27M mansion purchase after fleeing US post-Trump victory  foxnews.comInside Ellen DeGeneres’ decision to buy California home one year after UK move  pagesix.comEllen DeGeneres' flood-cursed Cotswolds farmhouse is OFF the market with rich American buyer poised to snap it up after she secretly slashed £4.5million off the £22million asking price  dailymail.co.ukEllen DeGeneres Is 'Missing' California, Says Source as Star Buys New U.S. Home 14 Months After Move to U.K. (Exclusive)  People.com",
    "published date": "Wed, 04 Feb 2026 20:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQRkphTGJiMXI2dG50YWdTS3ZJUmtncy10SEZiT3hibFRwTndQU1dndnFqY1lBNkVtZXNTVWhWTVlidl8zQS1kRW5UQnNuRVM4c25aNDg3cTYzR0lJcXlZeGpySWE5UGt2RVE1ZmpoRnQ5ZHpNbi1JeXdoRFlIb2M3Z0VUOVI3YWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Apple TV Announces 12 New Shows and Films Coming This Year - MacRumors",
    "description": "Apple TV Announces 12 New Shows and Films Coming This Year  MacRumorsEverything coming to Apple TV in 2026  MashableApple Unveils 2026 Film Slate: Ryan Reynolds Fights a New War, Jonah Hill Gives Keanu Reeves the ‘Jay Kelly’ Treatment and ‘Matchbox’ Revs Up  VarietyApple TV details its 2026 streaming lineup with big list of announcements  theverge.com​Apple TV 2026: The shows and films featuring queer people (and icons)  Out Magazine",
    "published date": "Wed, 04 Feb 2026 20:29:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBXTmNXbkUxcm05VDJaWUJiaDlVRzVKVzQza3NFeFZiZ2lVTEdENkpGVVFGM1EyUG40cm53aXVsa05fQ0FSVXdUcXVnSGJSQnFSbWFJclJPRnFJRUc2dFNtVFBLT0tOWU1jU0lEeU1SMm45UDRHSHR3dTh1d00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "Olivia Dean: From the London Stadium to the Grammys. Can West Ham tap into her star power? - The Athletic - The New York Times",
    "description": "Olivia Dean: From the London Stadium to the Grammys. Can West Ham tap into her star power? - The Athletic  The New York TimesOlivia Dean: From the London Stadium to the Grammys. Can West Ham tap into her star power?  Yahoo SportsAnd the best new artist Grammy goes to … TikTok  NPR2/11 – Album Spotlight: Olivia Dean “The Art of Loving”  Williamson HeraldOlivia Dean is crowned pop's most exciting new artist at the Grammys  BBC",
    "published date": "Wed, 04 Feb 2026 13:16:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVGcyenlma2pOc2pDSXZvTGFsMXd5QTV1cU5ZT1BubENRTWdlSVhwS0o5b3BZenZFdU1fRnp0YXp0SFN6Yl8zU1hILXh6bXN1dWx3ekFHNXpid3JjUHZ3alpVb1dEZENpSS1tNE5Mc05PNmoyUDQ0YW5RUl8tUmp1LVRNRHRYNk8xLWU0TzBVNW5TMVQ3bzRlMWF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "'The View' Guest Co-Hosts Set For Alyssa Farah Griffin's Leave - Deadline",
    "description": "'The View' Guest Co-Hosts Set For Alyssa Farah Griffin's Leave  DeadlineThe View's Alyssa Farah Griffin Is Ready for Maternity Leave Ahead of Baby Boy’s Arrival (Exclusive)  People.com'The View' Airs With Emergency Medical Staff on Standby in Case Alyssa Farah Griffin or Audience of Pregnant Women Go Into Labor  TheWrap‘The View’ Shocker: Elisabeth Hasselbeck Heading Back to the Hot Topics Table  decider.comThe View Is Bringing In Former Hosts And More To Fill In During Alyssa Farah Griffin's Absence  Yahoo",
    "published date": "Wed, 04 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPZE9veFZKOVJfaWt2TmlXU0N2TVJla2Q1NnJVYjBKRmlpZkNTazJyYk1lVFNSanpTWktoNnhnZEtzOWJtNDE5VFo5QV93OTZ2ZlZVZ3hTM1NwRHJZT3VoazlTOTJjTUJKRm9PdnIwRnBJX3V6ZWNhbF9qdHBpamFhMzhCUWVsTklvWkF1V0JR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Rapper Lil Jon's son reported missing in Georgia - NBC News",
    "description": "Rapper Lil Jon's son reported missing in Georgia  NBC NewsLil Jon’s son missing: Massive search underway in Milton for DJ Young Slade  FOX 5 AtlantaLil Jon's 27-Year-Old Son Nathan Smith, a.k.a. DJ Young Slade, Reported Missing in Georgia  People.comLil Jon’s missing son last posted happy photos hanging out with Bow Wow  New York PostAdult son of Lil Jon missing in Milton  11Alive.com",
    "published date": "Wed, 04 Feb 2026 18:59:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPUkVQRFhzMDJvY3dvVEZyQk55Nl9jVXc1bWI3TUhIcExfR1RxcDFUU25LN2N2REc3THVnNHp6elkzSEktdFRYdENkaDZPLWdfRnlCdFRoc3NJMzZOSXJGMVNuYm05UUU4YXlFWmhnWWJvMk9nQ1BmQkdVNkliclBkMXdyOFlteHdoUUpKVDNSc3IyTDJObTM4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Jennifer Esposito Says She’s Moving Out of Home She Mortgaged to Make Her Directorial Debut - The Hollywood Reporter",
    "description": "Jennifer Esposito Says She’s Moving Out of Home She Mortgaged to Make Her Directorial Debut  The Hollywood Reporter'Blue Bloods' star Jennifer Esposito slams Hollywood's lack of 'decency' after losing home to finance film  foxnews.comBlue Bloods star Jennifer Esposito loses home she mortgaged to finance her directorial debut  The IndependentJennifer Esposito Holds Back Tears Revealing She Has to Move Out of Home She Mortgaged to Finance First Movie  Yahoo News CanadaJennifer Esposito Reveals She Lost Home That She “Mortgaged To Make My Film”  Deadline",
    "published date": "Wed, 04 Feb 2026 22:16:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPWE41UllRQUROWms2YTdwYlRlRXkwOEtxaVE4YURJSmdZWGR0NGMxOVEtMzI2bVhtMEFvN09nRXB4S0llUnFsUHlfMmxqUG4wdWc0V25CTnljbUtOTFAtMlVycEhfUGpaWmVGeXNjVE1xQ1FZeWxRYm9iaEpEYU96YWU2dlJIVzQzVnpXYVgzMGdLUlpLX29JRFNMUGxTMkR0VlpUajA1MGtHOUpTX1JOTWpEQ0VKd25hdURhWXhEQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Nicola Peltz’s Billionaire Father, Nelson Peltz, Just Broke His Silence On The Beckham Feud - BuzzFeed",
    "description": "Nicola Peltz’s Billionaire Father, Nelson Peltz, Just Broke His Silence On The Beckham Feud  BuzzFeedNelson Peltz shares advice for daughter Nicola in Beckham feud  The TimesNicola Peltz Beckham's Dad Breaks Silence on Brooklyn Beckham Family Feud  E! NewsBrooklyn Beckham's billionaire father-in-law speaks out for first time since major family split  LADbibleNelson Peltz shares his advice for daughter Nicola amid Beckham family drama  The Independent",
    "published date": "Wed, 04 Feb 2026 13:23:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQeXdCS3hKa2ZRWTBoZ2RCaW9nSXNPbExDa2w0OWtKMGZ5eFFyRElLNWphclFFZjlQaTVUcGNPWkVlVmdxTGVJSDR3MzMzQ09qWHd1dVhsYlI0MzZ3VldsalVvMHU1eFRMUGMwMXR4d05lMW5rOHh0b1pyRHZNV1Y4WFlaNmNNWWZsWFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "LaMonte McLemore, singer and founding member of The 5th Dimension, dies at 90 - AP News",
    "description": "LaMonte McLemore, singer and founding member of The 5th Dimension, dies at 90  AP NewsLaMonte McLemore, singer and founding member of The 5th Dimension, has died at 90  Inquirer.comLaMonte McLemore, a pop music pioneer in the 1960s and 70s, has died  9NewsLaMonte McLemore  Legacy | ObituarySinger, co-founder of Grammy winning ’70s band dies at 90  NJ.com",
    "published date": "Thu, 05 Feb 2026 00:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNZjBaZHo0WFl5WDRfbHBoc3pMU19RU1FfZGZIcE1zYk9lbmlVRHRWZnFIajNjbHo2Z0M4YmdoQjM3WWtYSXJkMTZPcjUzbENMMTUtZGptLTZ0T3AybWE2ejllcGxacDNJWlJjQk9BTDJfSlFjRmhnWTdWVnZtTEh3ajc0Yi0xZXlVUm9TREF6YTZ2aTJMdDdwRl9RRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Royce Keys’ WWE Brand Assignment Revealed - Ringside News",
    "description": "Royce Keys’ WWE Brand Assignment Revealed  Ringside NewsJim Ross Comments On WWE Debut Of Royce Keys (Powerhouse Hobbs)  FightfulAEW President addresses Powerhouse Hobbs, AJ Styles  Wrestleview.comUpdate On WWE’s Plans For Royce Keys After Royal Rumble Debut  Slam WrestlingTony Khan Praises Royce Keys Following WWE Debut  Sports Illustrated",
    "published date": "Wed, 04 Feb 2026 21:43:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5KY3FLcDFTS0RBSjR2TV9LZ2Nxb3A4Q0hYbFhtc0NIWUVOa3hEQkZCeHBDX1NydTZjS1FyLWhFckd5QnRfT1JjU2ZmVUc2bnJ0WG1kVGZaY0IybEs0dk5OQVBHaEZuWU9wNXlCUkhnWFR5MTBiWERtUU9B0gF6QVVfeXFMTkpjcUtwMVNLREFKNHZNX0tnY3FvcDhDSFhsWG1zQ0hZRU5reERCRkJ4cENfU3J1NmNLUXItaEVyR3lCdF9PUmNTZmZVRzZucnRYbWRUZlpjQjJsSzR2Tk5BUEdoRm5ZT3A1eUJSSGdYVHkxMGJYRG1RT0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringsidenews.com",
      "title": "Ringside News"
    }
  },
  {
    "title": "‘The Last Of Us’ Will Replace An Actor For Season 3 Due To Conflicts - Forbes",
    "description": "‘The Last Of Us’ Will Replace An Actor For Season 3 Due To Conflicts  ForbesThe Last of Us actor replaced after quitting HBO series  The IndependentThe Last of Us season 3 makes a major cast change  Yahoo‘The Last Of Us’ Adds Clea DuVall; Jorge Lendeborg Jr. Takes Over Manny Role In Season 3  Deadline‘The Last of Us’ recasts character after shocking cast exit  NJ.com",
    "published date": "Wed, 04 Feb 2026 14:33:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPUjdPUzlzb0p4U05tSFByMkZWUVhDV2FyZzZ1cVpHQXRNaU9BLXpzc0ZVS3Vnc0U3dmpobkdHNUFvVmdCZ2cxZEFydkJncktUa0xhUEZIdFZyVjhubURVR0MySHFmNkRQdnpMeGZ1WjdoSDIyUHA5N3BoVGh1YjEydm9ZakFwRGd0SWhTSVo5TFc2VmVEamZJVWNJSW5mRGMtQW56d0VvQzNQUDk5d19LX1hLWUVVMEZ5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "'The Daily Show' Roasts Gavin Newsom's Affair, Failures in New Segment - Variety",
    "description": "'The Daily Show' Roasts Gavin Newsom's Affair, Failures in New Segment  Variety'The Daily Show' roasts Gavin Newsom on homelessness, high-speed rail in satirical 'leading man' video  foxnews.comThe Daily Show explains Gavin Newsom to people outside California  Boing BoingWhy ‘Daily Show’ Just Skewered Gov. Gavin Newsom  Hollywood in Toto",
    "published date": "Wed, 04 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQeEkxNWkxd3JZZHRJSkVQUFpqamhheHlaclpxRTZHSXliZnBSUXZtTUpYWml1aVhrWGg3OGlqY0oxUFN2WDE2MTVnbE9DaXl1VnBxeUl2bjlnUk5QNDBFUGNmZnZrcmVFR19IUVVWZFE0aW5UTXFwZ1RGME8wYXZKckJuWEFadw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Jonah Hill Is So Unrecognizable You Wouldn't Even Realize He's In This New Photo - HuffPost",
    "description": "Jonah Hill Is So Unrecognizable You Wouldn't Even Realize He's In This New Photo  HuffPostJonah Hill Debuts His Thinnest Look After Losing Almost 200 Pounds For Major Transformation  YahooAn Unrecognizable Jonah Hill Returns to the Big Screen for ‘Outcome,’ Alongside Keanu Reeves and Cameron Diaz  The Hollywood ReporterApple Original Films unveils a first look at Jonah Hill’s dark comedy “Outcome”  AppleJonah Hill Goes Bald and Bearded for Upcoming Film with Keanu Reeves and Cameron Diaz  People.com",
    "published date": "Wed, 04 Feb 2026 21:54:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQLU5KenUta2lTUlFkUXRndEdLZnZwcXVlUHRVR3Y2cXlXaEQxajBLRzhyaWhPZ01IZmNHNl9pYndiMHdLLUp5Y3J6UDU4cXpWTmRQbW9POFp5QVU5eFQ2VEoyNmJyeW1XNVM3aXJNU1ZPWF9NSHdIdU1BbmVUc09DSnJ3RnZOSXRhXzg5c0hZakxONWZlLVdyZjNLRkw3c01Xd3dRTkhjNlpBTHd2dkVjQ1k3b2MwaE5iYlUwOXRNSm5ycnVobEpEbUM3TG45by140gHWAUFVX3lxTE1zb1ZnMmhoM3h6Rk1qeU1PVlJTdTUxOXNERWZyNWJyWnpHblZpM0hPTGxwbmdsZF9ENUw1bExsR1FpMmlpTmdOa3hRMFBrV24wemhHUUR5eGdrRjlkZlcwek5UdUhKRF8zdzB3NlVpMGdneHB3c25sMV9sdnBvclJLMDJzS1YxbGVuamxBQ3huQUtWR2RlVlNJcnFXZm9OVVBmYTBvTmM4c2pGVlpaWDVDV1VtenhTVG9NQTFtajZreE12Zlhjd3hPM3FZYVRMY0pEeXMzd3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Lewis Hamilton reportedly dating Kim Kardashian - GhanaWeb",
    "description": "Lewis Hamilton reportedly dating Kim Kardashian  GhanaWebKim Kardashian Leaves Little to the Imagination in Lace Catsuit amid Rumored Romance with Lewis Hamilton  People.comKim Kardashian Spotted Out With Lewis Hamilton Amid Dating Rumors  TMZKim Kardashian and Lewis Hamilton Arrive in Paris Together Amid Dating Rumors  E! NewsKim Kardashian's friends reveal VERY cheeky secret nickname for Lewis Hamilton... and intimate details of their 'friends with benefits' arrangement  dailymail.co.uk",
    "published date": "Wed, 04 Feb 2026 16:09:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQNWd5Z3l6SEF0dUVFNWhld1dQMnRVMUhQTThvanNhTGEtSzQycDA5QXByRkQxOUxVU1Q3dmxxVzVwZVd1a2VjbFBuVWdXNExNZVpXWjRKZUNBRXRTU19qWkFVMlhZWXUtS1lJWXV2Ty1iaHBPbXZSQVI2OGJma0c2S2kzWGNQZU1TaUhOTm9pZVprLWotSXE4MVl6TFFjckotZEFVQ0lHNlBQVG90?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ghanaweb.com",
      "title": "GhanaWeb"
    }
  },
  {
    "title": "Your Zodiac Sign's Tarot Horoscope For Thursday, February 5, 2026 - YourTango",
    "description": "Your Zodiac Sign's Tarot Horoscope For Thursday, February 5, 2026  YourTangoToday’s daily horoscopes: Feb. 5, 2026  AL.comYour Daily Horoscope by Madame Clairevoyant: February 5, 2026  The CutHoroscope for Today, February 5: The 2 Signs Having the Luckiest Days  TODAY.comYour Daily Singles Horoscope for February 05, 2026  Yahoo",
    "published date": "Wed, 04 Feb 2026 22:03:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNc3FFMVRPTFNwSUhPSFRVN2NmUzFXalFRUUVnUV9ZeEo3eUlLSUg0Y2U1c0NNbjlyYnlucVNCMnNuRGR5ZmZzVHFrR3drbzdaWTRyZ1Z0MjFOS1VNTXRKelBVaGFpZjlnQ0xTaVdXaHdtY0NtVnNGWS01N21nSnlGOTdIZGJBV2R0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yourtango.com",
      "title": "YourTango"
    }
  },
  {
    "title": "‘You’re Really Gross’: Jessica Tarlov Disgusted by Jesse Watters’ Questions About Her Dating Preferences - Mediaite",
    "description": "‘You’re Really Gross’: Jessica Tarlov Disgusted by Jesse Watters’ Questions About Her Dating Preferences  MediaiteJessica Tarlov Expresses Disgust at Jesse Watters’ Questions  El-Balad.comFox News uproar as Jesse Watters makes 'gross' dating comment to Jessica Tarlov  Daily Express USJessica Tarlov Criticizes Jesse Watters’ Provocative Questions  FilmoGazJesse Watters roasted by Fox News co-host after calling Stephen Miller a 'sexual matador'  Daily Express US",
    "published date": "Thu, 05 Feb 2026 01:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOZVJRWDIxTHFIa3B3eFMtbXFTNkNhQXFRUDQ1MzZDeXpFQnNYMDQ5Sm4tY2o5TWM1d1EtcWVJNTNsMFV5OUNIQW9tZjJQTFozWmV3QlZSRVEyQTlXcHJIM0lIMGRsYUFUb0RDemlzMVlMS2syYW1hY01LLXZRQndUbURLLUF6Q2ZmWUlHbzVDcXpHdGlFclBLVWJncElzQW9WMzU5LWlISDZBMWxMYmU2TWVpbkw3ZmhJbTJOeURWdjctdUlwQy1YaVZ4SHpKQms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mediaite.com",
      "title": "Mediaite"
    }
  },
  {
    "title": "Record Store Day announces 2026 exclusive titles (full list) - BrooklynVegan",
    "description": "Record Store Day announces 2026 exclusive titles (full list)  BrooklynVeganRecord Store Day 2026 at Rough Trade  Rough Trade BlogJayhawks, Cory Wong among Minnesota names on Record Store Day 2026 mega-list  Star TribuneKATSEYE, HUNTR/X, Madonna & Bruce Springsteen Among Record Store Day 2026 Special Releases  BillboardRSD 2026: Vinyl From Pink Floyd, 'KPop,' Springsteen, Katseye, 350 More  Variety",
    "published date": "Wed, 04 Feb 2026 18:01:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQeHI4Qmd1M0RHQXViMDU4d1RVcS1CTmxmR1JxSW9KTFFKbWdLSmJiTldKQmcxdUxETjAwTXA3aFgxNU94N3BBX3QxaUtGSmlXdWZzUkZnb1lUYXU0QWxIRlVmajdVQ3UxUGFzRWU5WUVpQ0JGV0Jna3B0NXpBbEM5M0NKczlQbF9EdDhEV0ptSmZyU0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.brooklynvegan.com",
      "title": "BrooklynVegan"
    }
  },
  {
    "title": "'The Crown' star Claire Foy reveals she battled parasites for 5 years: 'I didn't know what was going on' - Entertainment Weekly",
    "description": "'The Crown' star Claire Foy reveals she battled parasites for 5 years: 'I didn't know what was going on'  Entertainment WeeklyClaire Foy says she quit caffeine after having parasites for five years  BBC‘The Crown’ actress reveals she may have had parasites in her for 5 years  Hawaii News NowHow ‘The Crown’ Star Claire Foy Changed Her Diet Following Terrifying Health Diagnosis  Yahoo'The Crown’ Star Claire Foy Gave Up Caffeine After Catching ‘Gross, Absolutely Rank’ Stomach Parasites  People.com",
    "published date": "Wed, 04 Feb 2026 23:07:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQbjNFN1hlQTcxek5RdEFvRHNWbXJlQWhyUDk0bnpmUS1wUDNkWnQtV3U2RmNseGJkMnFWR1Jmcjh6UWpiWlRNdzY0VUJ0emlNa1g2MC1LT1d2LVFjaXhubHBhRnQ1SGtfWU9mVlFVeTNpa1RjVHhnbHdscGp0MGhWWUFEVWZOMGF4SDNhN21VaE5OWUttU1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Why Tommaso Ciampa Won TNT Title in AEW Debut Match - Ringside News",
    "description": "Why Tommaso Ciampa Won TNT Title in AEW Debut Match  Ringside NewsAEW Collision Results: January 31, 2026 – Ciampa Wins TNT Championship, Kidd Attacks Allin, Women’s Champions Laid Out, More  allelitewrestling.comAEW COLLISION SPOILERS & Matches Announced For AEW Grand Slam Australia & Next Week's Dynamite  theringreport.comAEW Collision rating for the show that aired on WWE Royal Rumble Saturday  Pro Wrestling Dot NetTNT Championship Three Way Bout, Kevin Knight vs. Scorpio Sky, More Set For 2/7 AEW Collision  Fightful",
    "published date": "Wed, 04 Feb 2026 12:42:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNam1yRW5fZHpmM0xlUC1BS0Z6dTR0TzBSVElkcjk5R0FRSnBlSzhzR1JacllOUjZaNVpkZ0FXQ3pNbGhMLW1hMkdaVFdjVWc4SWY1aUozbXBObXNtbnZMUzB0Si1zVnhZelc4bVZmaFAxb3Y1cFRzWVYzUlBXbDRITm9obUTSAYQBQVVfeXFMTWptckVuX2R6ZjNMZVAtQUtGenU0dE8wUlRJZHI5OUdBUUpwZUs4c0dSWnJZTlI2WjVaZGdBV0N6TWxoTC1tYTJHWlRXY1VnOElmNWlKM21wTm1zbW52TFMwdEotc1Z4WXpXOG1WZmhQMW92NXBUc1lWM1JQV2w0SE5vaG1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringsidenews.com",
      "title": "Ringside News"
    }
  },
  {
    "title": "Jason Bateman criticised for asking Charli XCX about having children and telling her she \"might find somebody\" - nme.com",
    "description": "Jason Bateman criticised for asking Charli XCX about having children and telling her she \"might find somebody\"  nme.comWhy Is a Woman Saying She Doesn’t Want Children Still Deemed Debatable?  Vogue‘SmartLess’ Faces Backlash After Jason Bateman Questions Charli XCX About Having Children  The Hollywood ReporterExactly What *Not* to Say to Someone Who Doesn’t Want Kids  CosmopolitanWednesday 2/4 Hour 3 – Whose Voice Is It Anyway???  myTalk 107.1",
    "published date": "Wed, 04 Feb 2026 10:15:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgJBVV95cUxNSzVOZE5UQnNvMElHdS1wbFEwcl82dFJiR21wV0t5ZXBna2tiYVVocU01QmdFdmVTd0xsOFlSX1laaDQya3lOUmtQT2p6djd4TUwwSm1oYzg0WVl6Tk51LXRKdDBfU252T1RibHRUaGRSUWdJaHhaeXBXbmlubXpkOVJaWjZianJDTFRIek5CQlFFWUZQU29KN29PZVE1ajFQM2VuTjh0VWdOd0sxQ2U5bTZpM0Z0cjNsY0NMcXA5X1k3ZEMyVmtkaXlHdG9zcGg5TnNOV0ZHLWRVQzB3YW5YMFpFWXdKMmx3V2pXTHp6WUVKZ2xhN0VkUkN2aDFjV2JCYUkzVWcyaVQ0Tm81VEI0T3hTNVJwb0dLNHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nme.com",
      "title": "nme.com"
    }
  },
  {
    "title": "Source of a Large Print - The New York Times",
    "description": "Source of a Large Print  The New York Times",
    "published date": "Thu, 05 Feb 2026 03:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8xcTVSbE1CRjdKNHZCSzZ3TjMydnFNZDNYb2hnV1dpSGpzUV9ySmoyWlNyQ25yRUU5aUllQWdRbmkybHg1WmQ2Q1JhT2NrTkVBZDg2Z1ZoRVdWNmxFRGlyNy1LOXJ2cXMwNFFmd1NXM0NjYWczM1ExRXU2aDB3RlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Kristen Stewart Buys L.A.’s Highland Movie Theater and ‘Sees It as an Antidote to All the Corporate Bulls—‘ - Variety",
    "description": "Kristen Stewart Buys L.A.’s Highland Movie Theater and ‘Sees It as an Antidote to All the Corporate Bulls—‘  VarietyWhy Kristen Stewart just saved this historic L.A. theater  latimes.comActress saves historic Los Angeles theater  KTLAKristen Stewart buys iconic Highland Theatre in Highland Park  NBC4 Los AngelesKristen Stewart buys historic, defunct LA movie theater  The Independent",
    "published date": "Wed, 04 Feb 2026 21:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOYW1DQjNuVWdjdzNzRFdwSGxlZ3RoSkdOVkZxUUtSNm5LSXdhNERTYkNRRkRGQkZvZzByT1owMW5YZWJjTW0tdnJqRnRqVm5GdlRTeVJEVm9RSTB0VndYR0VsQThxOVNXQldtamhxNUJWM1AyVnIyVmNuOVVTMjBuWjFReEE5Y1ZzczNzd012SEJMYU5kbFVUNXZlZGxIaldBLW5EaA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  }
]