[
  {
    "title": "Man tackled to ground after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall - mprnews.org",
    "description": "Man tackled to ground after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall  mprnews.orgLive updates: Rep. Omar attacked in Minnesota as Trump says he wants to de-escalate state tensions  CNN'I don't let bullies win,' says US congresswoman Omar after substance thrown at her  BBCMan Rushes Ilhan Omar at Minneapolis Town Hall and Sprays Her  The New York TimesRep. Ilhan Omar rushed by man on stage and sprayed with liquid at town hall event  NPR",
    "published date": "Wed, 28 Jan 2026 13:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPNjl5Q2dQbDBIUWRhRFhHSmZid2dHeGVRY0tWR3I4RVJOVlQySGpTN1NLVUxycjRqOWx3Xzd2b2Z6Z1FSV3FUMjdkZEFqQVg3YW54N0ZPYWJzRFc3Ym5Nc2hyNDYwYWxKYlRaaHVwZ3hxWEl0aVowR3lpZkZqZWxKaG9JWUlONjVnVzFpOGM3TzJwQVVkMklhZ0VlRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "mprnews.org"
    }
  },
  {
    "title": "Trump says government will 'de-escalate a little bit' in Minnesota after Pretti shooting - BBC",
    "description": "Trump says government will 'de-escalate a little bit' in Minnesota after Pretti shooting  BBCRepublicans wrestle with immigration message after Minneapolis backlash  BBCTwo federal officers fired guns in Alex Pretti shooting, initial DHS report says  NBC NewsInternal review contradicts White House narrative of Pretti’s death  NPRTrump puts Republicans in a tough spot on gun rights  Axios",
    "published date": "Wed, 28 Jan 2026 13:05:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1XLTZ4OERDWm5SZU5EemtUbG9HdVM5UVp6dEtMRVdQb2s1YjgtYWZ1Q0JiVDFzeDIzV1hYSHZqQzNCeGRGdy03OTFPUkZkb2xqaUhFWklhdG90QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "As Minneapolis Rages, Legislators Move to Restrict ICE in Their States - The New York Times",
    "description": "As Minneapolis Rages, Legislators Move to Restrict ICE in Their States  The New York TimesUS state lawmakers push to allow lawsuits against ICE agents  ReutersAn Ohio group wants to hold ICE agents accountable by closing this federal loophole  abc6onyourside.comCT Dems are worried about ICE violating residents’ civil rights. What they plan to do  courant.comCT legislators to pitch bill to allow lawsuits against federal agents  ctmirror.org",
    "published date": "Wed, 28 Jan 2026 10:02:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5iWDM4dWhMOHJGU3BXSm1mZGxzZl9JSWFiUFgzckp2dnJfUEJSVEZzX0NtQTVXYkxsam81QlpoMVFqdXlMRmtQT3ViQlI4VERnc2N6WXl4OG1NaWFUanlGeXFPUHBtQ25uVUdHMmtISklDWmhuejBmRURSYU9tam8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Hill Democrats – and even some Republicans – plot an exit for Noem - CNN",
    "description": "Hill Democrats – and even some Republicans – plot an exit for Noem  CNNNoem’s Handling of Shooting Put Her in Trump’s Penalty Box, but Just Briefly  The New York TimesIs Kristi Noem's job in jeopardy? President Trump says no, lawmakers say yes  wcvb.comRepublicans turn on Noem, demand resignation  AxiosTrump news at a glance: Top Democrats give Trump ultimatum to fire Kristi Noem  The Guardian",
    "published date": "Wed, 28 Jan 2026 01:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9lM1lDM0o0TDNYMjJzUVJZN3ZQeVMzbmpLX0J3R3BTc28tMWk0VnI0ZWVteUx4Ym03V0NZWnZhMnFRLUt0bG5lMHhXZUVJN0lPb2F0WjEwS01BTWNoNHZhRWM3NXdsME1ZcTRmWW5JYjJxcXAtSEhjMWh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Judge finds Virginia Democrats’ redistricting resolution illegal; new Maryland map advances - wtop.com",
    "description": "Judge finds Virginia Democrats’ redistricting resolution illegal; new Maryland map advances  wtop.comVirginia Judge Blocks Democrats’ Efforts to Redraw Congressional Maps  The New York TimesVirginia judge voids redistricting push, rules lawmakers overstepped authority  Fox NewsVirginia judge blocks Democratic-favored map from going into effect ahead of midterms  The HillJudge strikes down Virginia Democrats’ plan to redraw congressional districts  The Guardian",
    "published date": "Wed, 28 Jan 2026 01:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPdWpsZEVwdjY3c1RpQW5pdnR0SVN5WFRieXFyWjBsUWNwenJOQjZGUWJxX3daMjM5UjMxS3JiSGRCNDMyNllTdUtleGZDQkpvNjhSUG5Ka3dVeVlMaTZ2Y3VqeXFzdUZCWDJjRkhsWURoMXNIWWJIX2I0STBTU25uQmVoSzRYcjhfcGdOOGJYTktTR3BSZzN6dWpMNl82M3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "wtop.com"
    }
  },
  {
    "title": "Family identifies fourth victim in Maine deadly plane crash tied to Houston law firm - abc13.com",
    "description": "Family identifies fourth victim in Maine deadly plane crash tied to Houston law firm  abc13.comWell-known Texas attorney’s wife among victims of deadly private jet crash in Maine  Fox NewsCharred remains of Maine plane crash victims still littered among wreckage — days after horror accident  New York Post6 people presumed dead in Maine plane crash, Bangor airport says  CNNLoved ones identify victims of fatal plane crash  wabi.tv",
    "published date": "Wed, 28 Jan 2026 00:55:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPZmNMcWxxQjA2Tjd4OEU4bFladkcxT3I4ZlZMaHNrNTE1V0d3M1hJcUROQW9YdUUxU3FYSnNwNlpfbm1kNUMzbDdVT0ZuSE91M0FWQnpBTGgxa3EtbEdMWWpuOXdOdGhUa2MzbXJUd0ZRUGx3MUVPZE5KdGJ0Ymh4QnF3NHBRSmJBWGRXaHJLRnE0Y0VJUEkydTJBSVJhLVR4UmxZUG5aNFVnel9JQU83aNIBtgFBVV95cUxNdGQ4d1FLWE9XOUhBOXdmb2hJVXdXOWw3dzNOMnhqcmtvNVNSUG1mcDZBUGFlblVZWEdfR0dXbkNBUTVQV01UcEJkOUZHTzVZNmdESS0wOFdXX3RadXl1MGlVdGRmbmFjMjFmOHpPbFlsNXZySDFnNWhNS3FfM0FlU0Z3X05MNkxCRDhKeHhMNU9aMXFaZVE0anVJcmVxMjRXZ2pkN19nN01GUmV6VV9QTzNGeFRoQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc13.com",
      "title": "abc13.com"
    }
  },
  {
    "title": "Trump reiterates threat of military action with demand for Iran deal - Al Jazeera",
    "description": "Trump reiterates threat of military action with demand for Iran deal  Al JazeeraTrump Administration Live Updates: President Renews Threats to Iran  The New York TimesTrump Urges Iran to ‘Make a Deal’ On Nuclear Weapons, Warns ‘Massive Armada Heading Its Way’  ForbesIran’s neighbors on edge as US ‘armada’ arrives in Middle East  The HillExclusive: Trump says Iran wants a deal as U.S. \"armada\" arrives  Axios",
    "published date": "Wed, 28 Jan 2026 13:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPNXhjdkVtbmZobGx4VHE5U0RHQzlzQ1NEal83SVJtSWdPVWM5Wk1rblJyYTZVQzZfQ0V0MGl5WTFFNlpGWnlLb3NpQnNBeDhSZGgtSEhVa0RMSTFPQ0pncFZyLUd1cWRFcG5xNUYzYlp2T01wbGVWVnRyRXpLRGFyc2RzQXM5WmVBV2laSW5zQmM1d2lpNmQxX09wY1d1OWx2blNPdDJ6SE1GUdIBrwFBVV95cUxPV2NWVnZwTkNaMG1WQ25ua2JGYmRwWU8tNWJoNmJfam1lUW5idEY0Nm9idVpGelVWeXlVV2NDU1JaejVPbWM1R2FLalRJa3A0Y2RRYkJ5ZjNSNUVfWENjT2VrYzdRR0V4TUFtcU96QWNRSFN2S0h1eGtuclJ0UlU0Y2ZhUFJablZfb2hydndYdmVSMzNVUDQ3TkdESmF3VXc4WkRXUE5PNTRRUzJESWtz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Pressure grows on Stephen Miller after Alex Pretti killing but Trump unlikely to cut ties - The Guardian",
    "description": "Pressure grows on Stephen Miller after Alex Pretti killing but Trump unlikely to cut ties  The GuardianScoop: Stephen Miller behind misleading claim that Alex Pretti wanted to \"massacre\" agents  AxiosStephen Miller Suggests Federal Agents May Have Diverted From ‘Protocol’ Before Minneapolis Shooting  The New York TimesEven Stephen Miller is jumping on CBP for the killing of Alex Pretti  PoliticoTrump Advisers Quietly Turn on Stephen Miller as Brutal ICE Poll Hits  The New Republic",
    "published date": "Wed, 28 Jan 2026 13:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOLWZfbUNnYUl2aENqMXJwQVRmZm51d2JQVWNjRWlZUS15SVpKNE9vR2lyaDBDVVBMOHBXbWlPalo0OFozWUVSb1FZeHFraDBYWWJzNm9yX2EzUEppYjV2QlI1WGxWSDV3VTE2OXU0bEpoc0lGMkpXQkc0MmZMYkJPU3Bmb2Rpd2ZCaG15ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump aides declared 16 DHS shootings since July justified before probes completed - The Washington Post",
    "description": "Trump aides declared 16 DHS shootings since July justified before probes completed  The Washington PostLive Updates: Trump says he wants to de-escalate in Minnesota; new Pretti shooting details revealed in DHS report  NBC NewsIn six violent encounters, evidence contradicts Trump immigration officials' narratives  ReutersRead the Report on Alex Pretti’s Killing — and the Bizarre Q&A CBP Gave Congress First  The InterceptHow ICE and Border Patrol Keep Injuring and Killing People  The Marshall Project",
    "published date": "Tue, 27 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNQ3VXcjEzQU5tUDRJSXlQUDJfQ1FrUWRMU0R3aFVxYllYTkpMRmJDelFZRDRSUkw5OFRjTnZmX2VNZVA0WEV1Tk1SdldKMHhrVnhTdFluQnR0dk81UjB1RnlkSWJFTHg0eG4wNFJEZm5QQzhZTUF1TEwwYW9ZZGlJb2U0WDB4OVhBV2hFX0UteEZ4N3NhTHYzeTJqOHZJaHp6cmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Minnesota’s chief judge, a veteran in conservative legal circles, takes on ICE - Politico",
    "description": "Minnesota’s chief judge, a veteran in conservative legal circles, takes on ICE  PoliticoMinnesota judges hit breaking point with ICE  The HillJudge Orders ICE Chief to Appear in Court Over Potential Contempt  The New York TimesTrump has a new problem in Minneapolis — a GOP-appointed judge  CNNTrump administration releases Minnesota detainee after judge threatens to hold acting ICE director in contempt  NBC News",
    "published date": "Wed, 28 Jan 2026 02:35:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQUlZSZXhSYjZWMTZIOTZaVGxFM2lueXZVbDNMUTM1Nm9ERzhOb25QQVFCOEFnUUlpRHJDZ2Zra0t6Yzlac241ejhtMXBGVTQ1ckJEREh1X0JoTVEwLUU0RHFMSEhSaVN4OElSc2ZvaHF0b241T1lMeWNmbmVFdVlzOVgwRWtGd05SUzRJZ1NWUDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Minneapolis killings cut short America's post-election apathy - Axios",
    "description": "Minneapolis killings cut short America's post-election apathy  AxiosWhat Should Americans Do Now?  The AtlanticPretti’s death marks the point of no return for ICE, CBP  The HillAfter Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York TimesAmerica has reached a tipping point on fascism – and on opposition to it | Robert Reich  The Guardian",
    "published date": "Wed, 28 Jan 2026 10:02:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1XQnc0dk5KTGVfdm9GZFNjNmpuVmpNRkMxeUZkZUwtakt6dnpkcURqaGlMYjN0WkZqVmpJSHlIemlvN25oUlFiOU0tM1B6ZEtaYTZvYzFiMjB5UG83WXlMWUdxMlBaQWJRSHJPNXpGV0xIMHJSYXM0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Democrats Restore Minnesota House to Even Split Amid Immigration Turmoil - The New York Times",
    "description": "Democrats Restore Minnesota House to Even Split Amid Immigration Turmoil  The New York TimesSpecial election results: Democrats win, bring House to 67-67 tie  AxiosDemocrats win two Minnesota special elections, bringing state House back to a tie  The HillSpecial election keeps MN House tied 67-67 heading into legislative session  fox9.comDemocrats to restore tie in Minnesota House after two special elections  CBS News",
    "published date": "Wed, 28 Jan 2026 02:11:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxORnpTaG1Da05EZmxyVG5QZWYtRHpDbzlLQml1OUYzRWM2YUtMYTZyWnY4SkV0RFVxeExMVkFMX1Q4SmJSV21ndzFqTnRTYkFhX2c0M3dOWFpSQVhIWDFKd25PMmYzR0xJX2FYVi1JbnJEck1fYko1d3R1MHVKcHlxMEdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices - NPR",
    "description": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices  NPR'We've got to win': Trump calls on MAGA to turn out for midterm elections  NBC NewsDonald Trump’s Iowa base shows cracks over Minneapolis deaths  Financial TimesTrump pitches economic record in Iowa amid fallout from ICE shootings  kcci.comIowans protest President Donald Trump and ICE before Clive event  desmoinesregister.com",
    "published date": "Tue, 27 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPU1BsREwwMEpiSlVCWDJ2ZWxnb2VYRDZpbEdPUTJacnQyWWYweUVpd09XNWVVOVlrRVBkZUNuQ0dkMl9CNjBLOXhkNXVZaUpNR3RUbk5XVHdqZmZkV1ZlZEJXejRneG1DUWwxekZhcHJwd3Rya3BqNzZVVHBBRHJQNVphSkM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "In Alexander brothers trial, first witness testifies to being sexually assaulted - CBS News",
    "description": "In Alexander brothers trial, first witness testifies to being sexually assaulted  CBS NewsAlexander brothers raped victims lured with trips, party invites, prosecutors say  The Washington PostBrothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesBrothers were predators masquerading as party boys, New York court hears  The GuardianAlexander brothers trial: Prosecution paints trio as predators, not party boys in opening statements  ABC News",
    "published date": "Wed, 28 Jan 2026 04:58:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQR1F2dGY4MS1Qc0V6ZFRHVlpPbWVwMjdXblRxZDh2WGZibFBKMWdRUVZXY2FRTzQ2dENheDZicGk0bnkxQU5NTkNISlhDVDVRMG9La2FzM19hZXdfbkswclFEU2YzcG9pZHNEY2VPWWhidWRNTlVyb0wwVXoxaXp0cGZQdDHSAYoBQVVfeXFMTnh4dG9QaF9Yd2x4cDdHMUlueEZNVU9uczBXblktU2JGTzZEMktIUlFhTDNqV2I0TkZ0OWxEYUhwODJWYThxLXZDSUdiWGdtdDJDNjdpcGFnN2hLdGlkaGFpQlFTLW1STzJCYzkzNF83MWJZdElQT1ZhZDlOc2lfT1hzakxrSFQ3bW1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "‘ICE conveyor belt’ illegally detaining, moving Minnesota children to Texas faster than courts can respond - mprnews.org",
    "description": "‘ICE conveyor belt’ illegally detaining, moving Minnesota children to Texas faster than courts can respond  mprnews.orgHow four faces changed the way many Americans see Trump’s immigration crackdown  CNNJudge Temporarily Blocks Deportation of 5-Year-Old Detained in Minneapolis Suburb  The New York TimesJudge blocks ICE from deporting or transferring 5-year-old Liam Conejo Ramos and his father  CBS NewsJudge blocks removal of 5-year-old detained by ICE in Minnesota  ABC News",
    "published date": "Wed, 28 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNVXJLMUVaTGY3ckg2bURIRHZSWW9vTkwtNkNKV3ZWTW9mSXI3NXBfZE5xejltX0EzdkFid05EMFQxWWx0eGZESXpjMUVqZFpJSXVCVXFqTjRpWll3djZrNXlvcjNqRndUNnNXZWo1Sm84QWJwcHJoNVBlWm5IaWdWX1BCNGhJRG5VTzBpdG9Wa1FjWXZtZUFMTnRkdnBCSXdwdGtLamF5dzJ2OU5KeVBQTkVPcXRZNDhsZ01RSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "mprnews.org"
    }
  },
  {
    "title": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington, D.C. - NPR",
    "description": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington, D.C.  NPRClose helicopter routes and Army crew’s perception of the wrong aircraft determine why a regional jet and helicopter collided  CNNDC mid-air collision that killed 67 was '100 per cent preventable', investigators say  Australian Broadcasting CorporationSafety Board Blames F.A.A. For Multiple Failures in D.C. Crash  The New York TimesDeadly Potomac collision prompts urgent calls for airspace safety reforms  komonews.com",
    "published date": "Wed, 28 Jan 2026 00:12:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRGFUd0JYRnkxS3Nvbll3MEI3cG1qeDZMdGM1dm5JWDBaX3hlUERaQWotd0VkTzFaTDZDV0RLb3RNRFh3b3VXOUFETnlVVHRnU0hxVVdVNEptZ0NGZjVaajY0akNKVU1KUFpIUndET21UaHBTSkE3VGZ3NVlWWENfR3NEaWFFTXlIWnN6Sk83WWhSaVBwVkVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Ecuador says ICE agent attempted to enter its Minneapolis consulate - BBC",
    "description": "Ecuador says ICE agent attempted to enter its Minneapolis consulate  BBCEcuador says ICE agent was blocked from entering its Minneapolis consulate  NBC NewsICE agents blocked from attempting to enter Ecuadorian consulate in Minneapolis without permission  kstp.comEcuador says ICE agent tried to enter consulate in Minneapolis  ReutersEcuador Objects After ICE Agent Tries to Enter Minneapolis Consulate  The New York Times",
    "published date": "Wed, 28 Jan 2026 11:43:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE4zS1NscTRmZlZzMDUxVl90TXhYQnNNS2t5WjhDTVhIUnVFSGdwSi1naHUxZWg2cDJVTFBLQ2FtZ21RRkJXQXpKRlhVOU04RG9yb3FfcVgtTjB6dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Third ‘No Kings’ nationwide protest planned for March - Politico",
    "description": "Third ‘No Kings’ nationwide protest planned for March  PoliticoMore ‘No Kings’ protests planned for March 28 as outrage spreads over Minneapolis deaths  AP NewsAnti-Trump 'No Kings' protest organizers target Minneapolis-St Paul for next flagship demonstration  Fox NewsNo Kings Tallahassee revives Trump fury; separate protest blasts Iran regime  tallahassee.comNext 'No Kings' march on the horizon with flagship event in the Twin Cities  NBC News",
    "published date": "Wed, 28 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5icHZlemtJdGhrVTQ5TDU5TjlDRTlYWWxOXzFKbWc5RUhBcnRNanJwQ2J6WTMxcEJidWF1TXBWdUF1cTRiT3BEOWdyOExQZFE4RGFiRUFVb1FxR2ZsSlpVbFFLdHNjaHAxTEtJaF9fU3dHZ0h6NWZWNFhJdnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Forecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios - CNN",
    "description": "Forecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios  CNNAnother Weekend Winter Storm? Forecast Details and Updates.  The New York TimesMillions under cold weather alerts as below-freezing temperatures remain  NBC NewsEast Coast Storm This Weekend Could Become Bomb Cyclone With More Snow, Wind From Carolinas To New England  weather.comCould a nor'easter this weekend bring another foot of snow? Here's what we know  nbcboston.com",
    "published date": "Tue, 27 Jan 2026 17:19:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5pOGNlWDhiVjJjSVJSSjUwLXRJVWJoNzdSeFVwdklsV1NWc3owS0ZvQzJVZGY3RmRHbUVOWENwLXduYjZNcVJ1WS0yeGstVGtzZTdqTVpmZmx4VU1qemVnVEVHbEliQkhIaTRQUkhpRzVGeFJPbU5CQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Bari Weiss Urges CBS News to Think Like a ‘Start-Up’ - The New York Times",
    "description": "Bari Weiss Urges CBS News to Think Like a ‘Start-Up’  The New York TimesCBS News names 19 new contributors  CBS NewsAfter rocky start, Bari Weiss plans cuts, adds commentators at CBS News  NPRSharyn Alfonsi, Scott Pelley's jobs are on the line after pushing back against Bari Weiss' CBS News shakeups: sources  New York PostBari Weiss to CBS News staff: Without a shift in strategy, “we are toast.”  The Washington Post",
    "published date": "Tue, 27 Jan 2026 22:59:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPUmlEOGhZSWU2S1lKaVc4WWhqdlBBbDE3NmI5dl9Gb0g4Yk93am1Kb1FwWlFyUEdZQ1FuWmhXMjN2NmR5OWF6elpUYUlJeVJMU3R1NUtYMWxGOVJaOG5DcF9odXBSd2I3Wk04VnVPTEQwcXZqeGt2MnFRa2VkV1VGaWRnX2dKWVZOMTFMNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "On Immigration, the G.O.P. Finds Itself in a Shocking Place: On Defense - The New York Times",
    "description": "On Immigration, the G.O.P. Finds Itself in a Shocking Place: On Defense  The New York TimesOpinion | Minneapolis May Be Trump’s Gettysburg  The New York TimesTrump hints at 'more relaxed' federal tactics in Minnesota after shootings  ABC NewsNoem and Bovino are taking heat for Minnesota — but it’s mostly on Trump  CNNIt Wasn’t Democrats Who Persuaded Trump to Change Course  The Atlantic",
    "published date": "Tue, 27 Jan 2026 18:29:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVUItRFBlcEFHbExFQ0hCSzM5RXBENDNsM2NpYnpvSlI4R1E2b3dNNWQ4dVBwLXVyb096UzV1X1J2SWdwR2tJc3A1Y1JxUnRIekxJYnM0dkJrNzlNQV9kdldrX3lJQmdiVXI5ZFVKNGFNWVF6UjR6eWJSUWZFWGVWUlBWQ3dVSV93T0pyVmxlQXpJdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The DHS crisis is squeezing Susan Collins - Politico",
    "description": "The DHS crisis is squeezing Susan Collins  PoliticoFamilies in Maine scramble to halt ICE’s transfer of detainees out of state  The Guardian‘We’re not safe right now’: A nurse’s dramatic ICE arrest ignites fear in Maine’s immigrant communities  The Boston GlobeMaine’s Immigrant Students Stay Home as ICE Operation Ramps Up  The New York Times“This Is a Warning”: ICE Agents Follow Protesters Home  The New Republic",
    "published date": "Wed, 28 Jan 2026 02:24:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQcEdPRnFjT1ZjNmZzc3F1eHJ2REtOWjV0eElFYkpFalBCamttSzZia2ZNOXpMc2hVamZ6ejFha0hJd2w1NHo3ZTRtSkdxOVF6OTl6SGZKaXpCUm8yVUVwMFd5TlFPbVJWM1J6dENGWGY3bDJlLWZCMVZJMDVucjdqZ0phZ29zbmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "New polling memo urges Senate Dems to ‘play hardball’ on ICE - Politico",
    "description": "New polling memo urges Senate Dems to ‘play hardball’ on ICE  PoliticoOpinion | The time for Democrats to start dismantling ICE is now  MS NOWDemocrats try to find their footing on immigration as Trump trips over ICE  The HillNurses demand Congress abolish ICE, invest in health care  National Nurses UnitedDemocrats' demands to rein in ICE intensify after Minneapolis shooting  NBC News",
    "published date": "Wed, 28 Jan 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQ3hzVS1hTncyWVplOVl4SHl6NkZXZjJ0T0FDel9HZDJsZDU5dzF4WlBfN2pnN19GZklHcHYxWWx4ZG1SVVc0cW1MYWpzUllDeFFnVW1sT1hrMUJaUmg0RHZnNC16dnBIWkpNVktoek1wbFlyNEN2OEJFQVQwZE5hQThDVjE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "After Minneapolis shootings, California advances a bill allowing lawsuits against federal agents - latimes.com",
    "description": "After Minneapolis shootings, California advances a bill allowing lawsuits against federal agents  latimes.comNewsom urges California law enforcement to investigate possible federal agent crimes  PoliticoCalifornia Senate Passes ICE, Border Patrol Accountability Legislation — First in Nation — In Wake of Minneapolis Murders  sd11.senate.ca.govCalifornia Democrats to Congress: Shut down the government over ICE shooting death  calmatters.orgCalifornia Senate Approves Bill Making It Easier to Sue ICE Agents  kqed.org",
    "published date": "Tue, 27 Jan 2026 23:37:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxQSHpiblRBMGNKOFRibFVoYXZaYWdya1ZmbDh6TndtbUVVMUZuV3lDSHl2bndGMGl2aloxR3pDX3diTGZPU2FTNWE0R20yMXpmZzJ1RDVpdmx5dVlYZHhJbThoTE5nbmJWY3llampfUzFqM3QxeWducVFFNThBTjNMaTVzWlloVXd6SFN3QktLakhFTVk1bHdhai00TnBPU1laSzNoQ2oxdkkwR05WeW9IbEJ0S2VGc3BZNWFHY1dQNVhUN3Rlc01pam5IQ0ViVlJvQ3BHaXpRRDJlVVcyRHNmZC10WFg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Person in critical condition after shooting involving Border Patrol near U.S.-Mexico border - PBS",
    "description": "Person in critical condition after shooting involving Border Patrol near U.S.-Mexico border  PBSShooting involving Border Patrol agent under investigation in Arizona  CNNMan shot in incident involving Border Patrol in Arizona  NBC NewsSuspect hospitalized after shootout with Border Patrol agent in southern Arizona  azfamily.comOne Person Is Wounded in Shooting Involving U.S. Border Patrol in Arizona  The New York Times",
    "published date": "Tue, 27 Jan 2026 21:19:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNbFVzcVVuSkJ4NGdNMVpaLU5RVkl6VklEY19LcXBjR3pxZFJISUVCOEdwakdoc2xKRndMVmtGMWxGYUNLR0E0SEhSRmxRWUNxbERsWlU1bk9VUWxwSFAyZ0tjQTh0UmgxTHdzUElfOGtBdVVNS0JoVkRmc2Z2ZnRzYWVFRENEMUpqMThLRXdXaWE1NnBDZ1hQNWdNSjA2YmtidmpnVjBJX1JCcnY4aG8xNktYUzk4YUJsYWVIa1hxdlZOTk8w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Musician who owns Stillwater restaurant describes how ICE sweeps upended life, industry - bringmethenews.com",
    "description": "Musician who owns Stillwater restaurant describes how ICE sweeps upended life, industry  bringmethenews.comThe Legal Fallout in Minnesota Has Only Just Begun  Politico‘Political thunderstorm’: inside Trump’s attacks on the Somali community  The GuardianNorthland lawmakers call for ICE to retreat  duluthnewstribune.comMinnesota Proved MAGA Wrong  The Atlantic",
    "published date": "Tue, 27 Jan 2026 22:43:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxObTBLc0lURzZtNmtwclNFODJZblMyOE0xWkJRaVJBbEJmRFFUQ2RyaGc1NjlFYXBKbXFHbENfTUhVVFN0bTU1RHBobW9ZSVN6WTJoSm9wZDFCLUQ3TW95VXUwVnZjMjVOQVFJMWdLdGR2MGliTGZjNGtISGF2RDEwVjhtTU9xWnFmbmFKNDk3ZkpMUXEzWnZNd3M4dktpclhRVnItYm84cU5PblVUb084c296eWNWdHpTV0JZY3kzNGY0RU42NWhCMGxJNXQ1QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bringmethenews.com",
      "title": "bringmethenews.com"
    }
  },
  {
    "title": "U.S. Population Growth Slows Sharply as Immigration Numbers Plunge - The New York Times",
    "description": "U.S. Population Growth Slows Sharply as Immigration Numbers Plunge  The New York TimesThe states growing – and shrinking – the fastest, according to Census estimates  The HillForeign-born population falls by 1.5 million amid Trump policies. California economy under threat  latimes.comA crackdown on immigration is leading to a sharp drop in U.S. population growth  NPRTexas sees largest population increase of any state for third consecutive year  kxan.com",
    "published date": "Tue, 27 Jan 2026 23:38:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdHJlNWpqa3VET0gzV2VNSy1aZ3lTRUxPVk9uaXY4ZWRQd3UxTmF6ajBpcDVUZWk1M29RS2YteXVsdjJyQTFWNkJwVVJqdTRTU05sNU5vNGt5M0xzUV9hZUltR3Z6OUFnTEIzYnBYWENlYmRCdlQ4UDFfU3lUUVFHaUZYZklhN003UHM2N254bXFicWM1aEFQWlM2VEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘This isn’t sustainable’: Middle Tennessee residents speak out after enduring days without electricity - wkrn.com",
    "description": "‘This isn’t sustainable’: Middle Tennessee residents speak out after enduring days without electricity  wkrn.comRumors, Misinformation Add to Ice Storm Chaos  nashvillescene.comNashville ice storm: 0.42 inches recorded  AxiosHotels in and around Nashville area are at capacity amid power outages  wkrn.comTennessee weather-related death toll climbs after 8 fatalities confirmed  wsmv.com",
    "published date": "Tue, 27 Jan 2026 22:33:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPdmZXcEd0TURvNU1DTEhJb1JCdDEtR09iNl80NDFqTkhRUXREZTNEU0pTRVR6RlpRMzhzcDVTWlRzaEtHVHFSWllmSDRfbEVlU1lPWkVsVVNDcDdXM25zZWkwS3FYYzNsYlVWM1JNbm5rU2VYYTVCRm9ubjBWVWxVYkZBM0RmV0dfbF9jY0NR0gGTAUFVX3lxTE15MHU3OWlFbWFMLUF2Zlk1UThpVkVjZy12VHdlQ0pVNC1tMnFVR3ZsRkhNenpFeG5rMXdZWlJiX2FSVnJtZ3gxMmVFdEdqXzZRbTBjNF9HallpUW1zc3RJQy10VEN4MTFCR1RiY2xIZTZsUFpRSG5jUWh6akdVeDYtVlFWd1lVVWJNMC16OUx2ZUxBOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wkrn.com",
      "title": "wkrn.com"
    }
  },
  {
    "title": "Schumer says Trump pulling the plug on $16B tunnel project is 'insane,' 'absurd' - Politico",
    "description": "Schumer says Trump pulling the plug on $16B tunnel project is 'insane,' 'absurd'  PoliticoWork to Stop on $16 Billion Tunnel Project Unless Trump Restores Funding  The Wall Street Journal‘Gateway’ Drug: Trump Is Holding the Second Avenue Subway Hostage  nyc.streetsblog.orgGateway Tunnel construction under Hudson River to shut down next week unless Trump restores funding  abc7ny.comSherrill calls Trump funding freeze on Gateway Tunnel an ‘illegal attack’ on New Jersey  Fox News",
    "published date": "Tue, 27 Jan 2026 19:52:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY1pfM21YZkRmWTlxMjRHRHNjbjllM3F6MWFhdzhMOG5tcmFCcXlNT0NvSlFwZ0kyX1JlOXpHX2pnWFNuQkNCbG5GVl9NVVJvcnpfVkwzV2RsT2dCN3gwY09PNWU5Q3J1cllVazBlbmhkRUJubGxzbkFzelZ2UWhEMS1CcWhIaFFzTUtCMDJlRlRfRmRMN2xQeUduQ1RONGNRWnYybFFCbTlRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Italian officials voice outrage at the presence of U.S. ICE agents at the 2026 Olympics - NPR",
    "description": "Italian officials voice outrage at the presence of U.S. ICE agents at the 2026 Olympics  NPRICE Agents Will Join Olympics Delegation in Italy. Many Italians are Angry.  The New York TimesItalians furious over deployment of ICE agents to bolster US security at Winter Olympics  CNNUS to send ICE agents to Winter Olympics, prompting Italian anger  BBC‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics  The Guardian",
    "published date": "Tue, 27 Jan 2026 22:09:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZ09zejNWN0hBR3JjNDYtU1dLREN5ME50QXBXb2Q5RUtRX1ByTm5QT2k5eGIxSUViaS10LXljSjd2UGwxZXpUNUFmVzZLaXVXd2tocXBrQmNFNUF0Tmxoc3dBMkY2bGlVVERIcmlpZVBxT0cyNFUzc3g2NkxoX011MjQyTzRmV1lwVkRv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Around SF, the Melania movie is not 'selling out, FAST' like Trump says - SFGATE",
    "description": "Around SF, the Melania movie is not 'selling out, FAST' like Trump says  SFGATE‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling StoneThe ‘Melania’ Movie Isn’t Selling Out Theaters—Despite Trump’s Claim  ForbesMelania documentary struggles in UK cinemas as Vue admits sales are ‘soft’  The GuardianCNN Data Guru Predicts Melania’s Humiliating Box Office Flop  The Daily Beast",
    "published date": "Tue, 27 Jan 2026 22:18:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPSXBKNVlCQ2E1SFpHRVBONWJMemNqUDlEcnB6OXpBOWFUam5lTGFmUlU2bmd3aWFTRjh0MENLMTVkQmU2Qk9nU0FqUkJObzExX19FYl9tM2czNElwSzM0aHV6VnFxalVkcW50c0lvOS04ZkJKa3FwVHkxTmlvUmoyd1Q4c195QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "Zohran Mamdani Wore Custom Carhartt to Tackle His First Snowstorm as Mayor - GQ",
    "description": "Zohran Mamdani Wore Custom Carhartt to Tackle His First Snowstorm as Mayor  GQMamdani's big storm takeaway? People care ‘a lot' if he doesn't wear a hat  nbcnewyork.comWinter storm update: 10 deaths in NYC linked to weather, Mayor Mamdani says city increasing homeless outreach  abc7ny.comAt least 10 found dead as frigid cold grips New York City, mayor says  ny1.comStorm Tests Mamdani as Dangerous Cold Grips New York  The New York Times",
    "published date": "Tue, 27 Jan 2026 22:27:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBNeF9tb1E1eE1jblNxdF94MDFzc1dCNnN3Yk5ZMFB1SEFEU0cyTTgzSTlHSTJtV0N6SHNEcXZZc1J0d2xTVnRTb05xbXUtcDFZYVhmVTJxVDBzbUJmeDNrMnA2VGo5VFFqZ1FPUDZ3TGdIMTl6Wm9BRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gq.com",
      "title": "GQ"
    }
  },
  {
    "title": "TikTok users “absolutely justified” for fearing MAGA makeover, experts say - Ars Technica",
    "description": "TikTok users “absolutely justified” for fearing MAGA makeover, experts say  Ars TechnicaThe Trump-approved US TikTok is off to a rough start  CNNTikTok US pushes back on claims it is censoring content  BBCTikTok denies ICE, Epstein censorship, says power outages behind U.S. app issues  CNBCTikTok users say they are being censored after change to U.S. ownership  PBS",
    "published date": "Tue, 27 Jan 2026 23:17:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQZVBIdnlmdlQ0dC1nRk96ZXp5Qmw1aGVVZ1dpMU9saXRTY2NaZDRjVFRXSFJ6X1lYRkdfTGlKMGJrVnJJREFaNnBKNlAtLTlqUnZ1OHdBSS1BWEFQejdJeWQ3aUFHUWlsQXNCS1VYMDc1QVNvaDFmM2VZWUdxYTNlekcxMjh0dVlqbHZ3ZmQwUXZPQXkyOHQ5NWYxQTBTU3daZ1BFU3hGaE9GLVJGVFZvRGRwLWR3VHdvSVRiVGZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "I grew up with Alex Pretti - The Verge",
    "description": "I grew up with Alex Pretti  The VergeLincolnites honor people killed by federal agents in Minneapolis with candlelight vigil  1011now.com‘All Alex ever wanted was to help’: Sister, friend remember Alex Pretti  kstp.comOrganized Labor Escalates Against ICE Summary Executions  The American ProspectAnn Arbor community honors Alex Pretti as Washtenaw County restricts ICE activity  clickondetroit.com",
    "published date": "Tue, 27 Jan 2026 16:39:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPbEhwTXJYNGQ1SmdlU0UteVYydXpGcFlZai1JeVlLY19YOXBOQjZCcTYwSk5Lcm5ZSFMzUHJyTl9NQm16M0M5ZE11Nmp0ZGt1anFoWWZBYXVtdUZvZVhuYWlHZXJHVUI4SnBqbklQeGl5MUhuSXROT2gtRUdVUEJGeGJKcmg5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "As the U.S. bids adieu to the World Health Organization, California says hello - NPR",
    "description": "As the U.S. bids adieu to the World Health Organization, California says hello  NPROpinion | By leaving the WHO, Trump is squandering U.S. security  The Washington PostThe U.S. Has Pulled Out of the WHO. Here’s What That Means for Public Health  Time MagazineWorld Health Organization says it regrets US decision to withdraw  ReutersWHO statement on notification of withdrawal of the United States  World Health Organization (WHO)",
    "published date": "Wed, 28 Jan 2026 11:47:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNcTFDN1pDYXplRU14aTBfdm9NS1NUMjFDczJ4Mk45NUhiaVZkTzR1S0F5enNEZ19YVmhwOS1USWJFN1dnTnBJczV3cS1NNVV5LV9xMnJjcVMzVXpYbGx5dmp5NTZSRUZVUUFKTHAzdjMyYlo4LUVKUkRqWDBjOVBaUlJZMDNHMnhNN2NNSUpuYmMxTG9EMlppa09oSXFiRXd0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "How much snow did Mass. get from Sunday-Monday storm? Updated list reveals highest totals - boston25news.com",
    "description": "How much snow did Mass. get from Sunday-Monday storm? Updated list reveals highest totals  boston25news.comFIRST ALERT: Greater Boston could see 20+ inches of snow  nbcboston.comRegion digs out from biggest snowstorm in years; some communities slammed with nearly two feet of snow  The Boston GlobeWhat should Massachusetts homeowners do to prepare for more snow? Experts share advice.  CBS NewsSnow Emergency and Parking Ban to End, January 26, at 8 p.m.; Schools Closed Tomorrow, January 27  boston.gov",
    "published date": "Tue, 27 Jan 2026 18:25:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOcF9aLTJucUdzbkJINXA1dFZKdld0QjNyd0FFNmNza1ptV3hMcHBKejFqVThOd1NpVVlqMDd3b0Nmd3VERGFodVZzZ1RfYm9MWE9qVklWYXRoMTYxOVl1RHgxQ2RYbURPeWUwQngtNFM3aVdRdlNSUlluOWp3SW5TUjdBOEVRcmduU18yM0VtREhXMWhwOHJuM2FUYUtNRkZDY0tTTGxyUkF0dy1uSFh5ZDhXUlNuUl9HbXNrN2VKRTBqczNwN1NmZnhnZTNPUDlOZ3NiQ19LaFBrMXY3SVBHcjZvdVbSAfgBQVVfeXFMTVByZnBWX1FnM29ZcTVSZ1ozWk15UWlCcTUxdnQzeEpUb1MwalhFV0R4aUdwTW90NEpUNWZxN2o5SndodlJhZGJVb2tIUHJ3TV9yQ0xDTGQ5RDU0RHk2S0lTUnQ2WXRNMjJXMmFPMmVnV08wSzRwcUFXME9hVnJaYXFMSnM5OGZwXzl4eGhNbVJTRTlFY0tqa3IyalgwTEpkUFllSmFRbjRJRFpZV2NqN0l5eHVKQmJpemNncGdZZlRBdkNrRUlxaGxWeEU3Y244aVViNTNDR0Zrbnp4d0JNaDZXQ2dHN3hRZDJXMDU4ek9LczI4RDFIYko?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boston25news.com",
      "title": "boston25news.com"
    }
  },
  {
    "title": "San Francisco Mountain Lion Is Tranquilized and Captured for Release Elsewhere - kqed.org",
    "description": "San Francisco Mountain Lion Is Tranquilized and Captured for Release Elsewhere  kqed.orgMountain lion roams posh San Francisco neighborhood before being captured  YahooTails of the City: San Francisco’s Latest Animal Sensation Is a Mountain Lion  The New York TimesMountain lion roaming San Francisco’s streets captured by wildlife officials  The Guardian'Majestic' mountain lion captured after hourslong SF standoff  SFGATE",
    "published date": "Tue, 27 Jan 2026 22:33:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPQUJIREFFYVdsOEEwT3dZYUZCX2N4VlRwU3Z4ZnZLVGU5Ql9Fdmc3VFJ6OW1SMVE4VHd6WjlDel9tUnEwQk8zLXNUWWxXNEhQUjlSWGhxZ0xJUURBT2JXZlFyUU9sUFhzS1RMU2phQkJuTFVubW9QQlN6cHBFQ1RVMXFCTXZZaTEzck5aS1dIRVRldVJIMGo3UGFJSHZsdU90TzdXdHg4SzlfS29jYm1NemhtNXdmcmttaUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "kqed.org"
    }
  },
  {
    "title": "Carney pushes back on Trump team over Davos speech - Politico",
    "description": "Carney pushes back on Trump team over Davos speech  PoliticoCarney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos  AP NewsWhat’s the cost to Mark Carney of defying The Donald?  Financial TimesCanada's Carney to Trump: 'I meant what I said in Davos'  CNBCMaybe the United States Can Be One of Mark Carney’s “Middle Powers”  The New Yorker",
    "published date": "Tue, 27 Jan 2026 15:17:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX0d0UEw0N3Y2ejdxYnk0MWVHVi1xdVRzektqRGVwZ0lYSFRQbUlWVXpjRHJqbWJIMmpWbXhyaUMtTTlZWU54aUt2QllTSmE3MmVDYjhSdVplb3djSUFoR3dUSGVPdWFXYnVMRVB3SV9HWEk4SlZNSEdxYkt3aEpPQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Governor Abbott Launches Investigation Into H-1B Visa Abuse - gov.texas.gov",
    "description": "Governor Abbott Launches Investigation Into H-1B Visa Abuse  gov.texas.govGov. Abbott directs state agencies to freeze H-1B visa petitions  kbtx.com'Shooting ourselves in the foot': Will Indians be affected by Texas Governor's H-1B freeze?  Times of IndiaTexas Moves to Curtail H-1B Visas  The New York TimesGov. Abbott orders Texas universities, agencies to halt H-1B visa petitions  kut.org",
    "published date": "Tue, 27 Jan 2026 16:55:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOME52NjJHc3Z3VzFEQ0Y2c0xZN0I0RElhWTh0NnBJOTU0TUVIWkx1aHVzN1Q3bUlTY3hIWnNwS21EcUxHZHh6QkNxMXEzN01BRk1UczczNTlzTzE5OUlKSW5wS2RwTzNUNDhiNlU3ejk2M2dqQ3BIQUVTaVlUbGNZbkJrbDJkUG9SZG1idUpmOEJfbXFpcnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gov.texas.gov",
      "title": "gov.texas.gov"
    }
  },
  {
    "title": "Families of two Caribbean men killed in boat strikes sue Trump administration - Politico",
    "description": "Families of two Caribbean men killed in boat strikes sue Trump administration  PoliticoFamilies of 2 Trinidadian nationals killed in strikes sue Trump administration  ABC NewsFamilies sue US over deadly boat strike off Venezuela coast  BBCFirst wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of two men killed in Trump’s military boat strikes sue US government  The Guardian",
    "published date": "Tue, 27 Jan 2026 18:25:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOeVFxNFZYY1hGQUZEd2hQMTVwUkdRa1ktVm1GTU5qR240NlVONXFkNTlBSlVqVmUyR2Zxa003YXdweHJFY0FrM1ZfRlVYSVN4b3pWYURvMVU2em45ZUZEQ09nc2Z1cmJrZVNCOVV4UlIwdG1RbXdUM3Nub25IMkJuTDV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ADDRESSING STATE AND LOCAL FAILURES TO REBUILD LOS ANGELES AFTER WILDFIRE DISASTERS - The White House (.gov)",
    "description": "ADDRESSING STATE AND LOCAL FAILURES TO REBUILD LOS ANGELES AFTER WILDFIRE DISASTERS  The White House (.gov)Trump signs executive order to ‘preempt’ permitting process for fire-destroyed homes in L.A.  latimes.comTrump signs executive order aimed at taking over LA wildfire rebuilding; Newsom says money is 'main obstacle'  abc7.comTrump issues executive order assuming control of Los Angeles wildfire rebuild permits from state, local jurisdiction  CBS NewsTrump signs executive order to fast-track rebuilding of homes destroyed by LA wildfires  foxla.com",
    "published date": "Tue, 27 Jan 2026 14:57:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPczFQWGd3OUdIaW52VmI3c2NnS0VreGloMHQzUk1FOWREYWpqOGhUd3U2MG4zVWVHX2dCUTVtQU1hSXZFMEFadmNIcVc0aDVoMTl3X1BOYy15M0s2cTdsbkRVTXoyaHNxUnVUWDRla3pOTDJVYmx3ZkRJNUpoanVWWEt0WHdaT1Bzd1AxRFUwQzl5T1VVdjhSTUVOeDRURGh2VTFFRDJUVXI1eWxIZ1hnU2xJS3JSWFoxWWFFTU05cHBHTEcxc2pGMGV5WElra2tQcXg3ZzM4MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Nervous Allies and Fox News: How Trump Realized He Had a Big Problem in Minneapolis - The New York Times",
    "description": "Nervous Allies and Fox News: How Trump Realized He Had a Big Problem in Minneapolis  The New York TimesHoman arrives in Minnesota, but immigration crackdown continues  AxiosWho is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?  BBCWhat does a scaled-back ICE operation look like?  kstp.comIlhan Omar attack. Trump says Frey 'playing with fire': Live updates.  USA Today",
    "published date": "Wed, 28 Jan 2026 12:58:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPUHlYeThxV042cDF4NWt0TnZBdVl6SFdhZ2toRHYxdmFWci1SclNia04wNW1tNlFCUVFXMklqdmNmdUZhRUZubDJHOGphd0lERkFIV1RaX1FyREJ5RkFZV20xVTFhSXp4b3k0Ym5pemJGTGVDVWJnMm93RmMyUlkxN0F6dEl0TjdycUpOdURqNmxlc3cwXzFV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "FBI to investigate Minneapolis activists after far-right claim about Signal chats - The Guardian",
    "description": "FBI to investigate Minneapolis activists after far-right claim about Signal chats  The GuardianThe New “Signalgate”: Kash Patel’s First Amendment Fail  Cato InstituteKash Patel says the FBI is investigating Signal chats of Minnesotans tracking ICE  MS NOWHow Minnesota's rapid responders track ICE agents in real time  AxiosFBI is investigating Minnesota Signal groups tracking ICE, Patel says  NBC News",
    "published date": "Tue, 27 Jan 2026 16:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQaTRUSkM3VEt2M1hIUHNlNGVxT2Y3QTRyanBfR1pUTmU3eC1LV1Z6OGJwRWVkRkx1WlJtTVo0X282QzBaRzlMOFh4cXJza0RnV2d3Sm1pZ0pGQjBweTBqMF9YYXh1dk40cjV0NVNsWUVDejA3eDlKbWFuYm1nWWN2bi10QldsTW9GOUppRTktUm0xTzRlUFAwUldlbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  }
]