[
  {
    "title": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties - The New York Times",
    "description": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties  The New York TimesSecond Epstein victim claims she was sent to UK for sex with Andrew, lawyer says  BBCLatest Epstein file photos appear to show former Prince Andrew on floor with female  CNNFormer Prince Andrew can't escape Epstein's shadow as new documents reveal details about friendship  NBC Bay AreaEpstein files lead to resignation in Slovakia and calls in Britain for former prince to cooperate  AP News",
    "published date": "Sun, 01 Feb 2026 12:19:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNSlA1TlpPTmdwWXJqLTRxRDFZbk9HVjlPWEx6WVliRTlVMEVIbTdRQy1oV0tzaHp3amk0SWFNNnljY2pOT0hsTU8yVnlRN2lWd1A2Q2F4WlFNMzVmVDJndWRjUDYxWmRrMnBmejlpMzNVMzJxTXBzVWpxRWFubEx0bFNaWS15cVFwNE1BZE43MlRSems3eWhteGVGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "LA 2028 Olympics chief 'deeply regrets' flirty emails with Ghislaine Maxwell - BBC",
    "description": "LA 2028 Olympics chief 'deeply regrets' flirty emails with Ghislaine Maxwell  BBCThey Said They Weren’t Close to Epstein. New Documents Show Otherwise.  The New York TimesWhat 3 million new documents tell us about Trump’s ties to Jeffrey Epstein  CNNEpstein files: Trump, Howard Lutnick, Steve Tisch among prominent names that appear in latest Justice Department release  CNBCEpstein files ‘absolve me’, Trump claims  The Telegraph",
    "published date": "Sun, 01 Feb 2026 09:50:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1BWTlHSE5HRTVRUG90Rmw2M1dOOWhzLXVybk9pS0RHMWpWT3A0cG5rUzdscHBvTlNlb3FjVlA2a2FYdjMwVUJGVktITEpCN0pJa3RSQjEwQU4yQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Democrat Christian Menefee wins special election for U.S. House in Texas - CBS News",
    "description": "Democrat Christian Menefee wins special election for U.S. House in Texas  CBS NewsMike Johnson's majority to erode as Democrat Menefee wins Texas special election  AxiosIn Texas elections, Democrats narrow U.S. House majority, land state Senate upset  The Washington PostDemocrat Christian Menefee will win special US House runoff in Texas, CNN projects, shrinking GOP majority even further  CNNHouston Democrat Christian Menefee wins special election to complete Sylvester Turner’s term in Congress  The Texas Tribune",
    "published date": "Sun, 01 Feb 2026 05:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNQkhFUk5tVGVQWUJwZ2JiM1ZNSTRYR1EtWkRIYVNQTjdTTW1JSDVKbzB0NDBoRUtvaTRBN2ExUEpSSGlZVEFSMWhfZGlrWDlQcExpdzkwWHZyZk1XZEJMdm0wSlpNay1wc0tkTExUc2Z3aXBtVmdWV1poeWdYUlo3clQ2TXlvNDBXc01BT2lVMmYzZDUxTVZzYWROUmNCZ9IBowFBVV95cUxNR1pOcXpPVDlYNEpTV0lSSHNDWWpuNFREOEpfNGNtajBERzdFTUMySW0xMmNGUC1SdG9LMERNNnNLTXBHYmxzZDNYcDl4aEVmN2wzNV9Od25nV0FaYXZKWEdNSXJMV0FqMHV4NTI5Tng2R1N1WWh4b2wzNXhuaVBWNU9jSnNHTFFrUDJNWVlxOWVXRjlkb2Q4R0pVdUlWcWEwN2pR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Federal Courts Undercut Trump’s Mass Deportation Campaign - The New York Times",
    "description": "Federal Courts Undercut Trump’s Mass Deportation Campaign  The New York TimesJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoJudge denies Minnesota’s request to end ICE surge in Minneapolis  The GuardianMore anti-ICE protests underway nationwide after judge declines to immediately halt Operation Metro Surge in Minnesota  CNNMinnesota ICE surge upheld as judge finds 'balance of harms' lacking  Axios",
    "published date": "Sun, 01 Feb 2026 10:02:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX1BHVTBjSkllOWppNTJlLW9BSHZ0ZE4wUFZSbEdvbjdXa1Z6X1ZTV1VlUGQwTElmb2d5clgzOVM1WmhRUXVfb1JpOVhQYVVfcVpBQVVhelBtR3VLWUcyZ3B3Rjg4MGdKMy1qbWJTVW5JdnFmTkRrX1JvclM1MjFYOU03RHRIR3dlLTR2WnI2Z0kxeURvbEo1dXdNZFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "RFK Jr. is now a wellness guru for Republicans in Washington - Politico",
    "description": "RFK Jr. is now a wellness guru for Republicans in Washington  PoliticoRepublicans look to MAHA for a midterm boost  Food FixGOP Promotes MAHA in Bid to Avert Midterm Losses. Dems Point to Contradictions.  MedPage TodayArticle | Republicans think RFK Jr. can help them in the midterms. Democrats worry that’s true.  POLITICO ProCould RFK Jr’s push to reshape America’s diet save the Republicans in the midterms?  The Independent",
    "published date": "Sun, 01 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPaUNGcFE1bFFFY04xWFQ4VkkzbXdoeXFzODQtLW1iRmd0Slg1N1Aybm1PM3dGT29nblFYb1hVN3VCdW1SN2k3S2R4WkQzNlZPcHlPS2hFak4wMzctaHRNa3JyR2RLdWIzZ3V0ODlSdXpUcFF4emNldE50UmRfVnNwOWFGNmJidjBRdVp6Z1l3NU9DbG5RcVdaUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown - Axios",
    "description": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown  AxiosFacing Immigration Backlash, Trump Called Schumer to Cut a Deal  The New York TimesPartial government shutdown enters second day amid DHS funding dispute  Fox NewsJeffries says Dems won't help fast-track Senate-passed funding measure, with shutdown expected to drag on longer than anticipated  ABC NewsLive updates: Partial government shutdown hits Day 2 as House stares down votes  The Hill",
    "published date": "Sun, 01 Feb 2026 12:41:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQQ09QU0o5a3U0N1p1RDNLY2dvVlNWaTNjV3UyMmpHR0VZa041MVk3bWREbHpGWTFNSWcxVFZVRzdHT2pIRUY4UU50eG12azFsZDAtYk42Mk1DYWFwYXF5Rlo1eGlWLUFqZFpRLTJsREVBSi1OUDBOQU5yc3lqUXVTTml4SHJ1Q3c4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Judge orders release of 5-year-old Liam Conejo Ramos and his father from ICE detention - PBS",
    "description": "Judge orders release of 5-year-old Liam Conejo Ramos and his father from ICE detention  PBSJudge orders 5-year-old Liam Ramos and his father be released from immigration detention  CNNJudge Orders Release of 5-Year-Old Detained by Immigration Agents in Minnesota  The New York TimesJudge orders release of 5-year-old detained by ICE in Minneapolis  The Washington PostJudge orders release of 5-year-old detained by ICE in Minnesota  Politico",
    "published date": "Sat, 31 Jan 2026 22:41:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOZ3FjSHpxeWpYdThvYlZxSVZwNHNMeEQ3VEpGS2pXVTZCQXpJcktwT3Y4ZC1XWS1CMFoyUGx2UUxvQnZxN29zOUl6NXBKMDFOdkVjd2ZzNEFQNTlvRTBZZzNrLWYtMHQzeDk2Z05rRnhDUzFMMnkxRW52R1NDU0tfMkdNcVAtNFZudmNVRE1ST0UxZ29hUS1aMVd0dXpyWTJMSEdfaFVUaWJoeFlmYzNWMTJHY2psc3d1OWRrXzF3NA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Iran's supreme leader warns any US attack would spark 'regional war' - NPR",
    "description": "Iran's supreme leader warns any US attack would spark 'regional war'  NPRTrump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran.  The Wall Street JournalIran’s leader warns of ‘regional war’ if US attacks  The HillIran's supreme leader warns any U.S. attack would spark 'regional war'  NBC NewsTrump says Iran 'seriously talking to us' as military ships head to Middle East  Fox News",
    "published date": "Sun, 01 Feb 2026 10:23:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOYlF2NzJoWjZzeG5YU1I5ZzlsYmk1OE5SdjZCLW1zSFA3RFdVOVN5NVh2ZmUzcHFRUEtEdnNBR3JkN2g1YnFLakR5cGZOQWFVanJnbTRWMm1oRDFiWTFuV1ZTYi1tTmdCZzVFOU1DVEhiV2FLcXN2WFJEeFZ6MkdUc0VHR1BacDZJeHhwWUVFZ2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "In Minneapolis, all-encompassing immigration story tests a newsroom in midst of digital transition - AP News",
    "description": "In Minneapolis, all-encompassing immigration story tests a newsroom in midst of digital transition  AP NewsView Full Coverage on Google News",
    "published date": "Sun, 01 Feb 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRE5tY2FzTlhPSXdSU25UUjV2Z2RNTkFVS212bW5Wd2RSb2g5b0UwSXlYX09xckZ5NmN6LXVXMEZCZXRlTDZOYmJDUVYwM1FQWUU4ZmFnYml5anhtNlhXVEZtWEFhZjZFMDNaWkYtR2lwd0RRYWprRkZaS2FTbHFVby1aMjVQQUVYczNVRXZIeVhYcmVZaTFRRzZnalhhY0IxaHFUS2FvMHJDQUllWlI3cVRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Live updates: Arrests made hours after hundreds gathered for another anti-ICE protest in DTLA - ABC7 Los Angeles",
    "description": "Live updates: Arrests made hours after hundreds gathered for another anti-ICE protest in DTLA  ABC7 Los AngelesProtesters clash with federal agents in downtown Los Angeles  CBS NewsAt least two dozen people detained in anti-ICE protests in LA  NBC Los AngelesColumn: When the government tramples people's rights, the people must take to the streets  Los Angeles TimesICE protests spread across Southern California amid nationwide shutdown; L.A. protesters clash with police  KTLA",
    "published date": "Sun, 01 Feb 2026 07:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Federal officers use crowd control munitions as demonstrators protest outside Portland ICE building - Oregon Public Broadcasting - OPB",
    "description": "Federal officers use crowd control munitions as demonstrators protest outside Portland ICE building  Oregon Public Broadcasting - OPBAgents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story.  CBS NewsTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC NewsBattles Are Raging Inside the Department of Homeland Security  The AtlanticHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNN",
    "published date": "Sun, 01 Feb 2026 05:41:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQM0FGUFZMWmMzbm9aUFQ4cks5emR5SVRYbkFYbkFJLTB5LVA0cFlvNjdqT2MxdHA2bjFYRlFpS0VhenVuWnhCS2ZKSEY0UUdELWtlanc3dnJjN1I2dDZLaWZvazlUN2FSNDVWVWJ6MzVRS0l1RDJsWWJCMU1PRDVJZ09LOWhDZlRaODg5bEVVUkJNUzktOXJzQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Winter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow - The New York Times",
    "description": "Winter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow  The New York TimesFIRST ALERT: Coastal storm to bring gusty winds, flooding, up to 5 inches of snow  NBC BostonNor'easter, Winter Storm Dumps Heavy Snow In Carolinas, Georgia, Virginia  The Weather ChannelStorm barrels through weary Southeast, bringing bitter cold and blankets of snow  The Washington PostCarolinas buried under more than a foot of snow | Morning in America  Yahoo",
    "published date": "Sun, 01 Feb 2026 12:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPNzJsU2lHVEh1YUdWNlUzdE5DWURfcUd5VzI4SUdrc1FhVkxET1daNkpPd0RvS0M3Tm1rTWszcEMzUmhqbUZNVHU2SVdaejlMRE5HbXBvWEp0Uloya0JEQWRrdkpBUGRPa3M0b1Ixbk1rWVNYdEhzeFA2d19XUWtVTDdzMERNMlRI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Don Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest - NPR",
    "description": "Don Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest  NPRDon Lemon arrested after covering protest at Minnesota church  NBC NewsEx-CNN anchor Don Lemon released after arrest in Los Angeles, says he 'will not be silenced'  Business InsiderDon Lemon vows to fight charges in First Amendment showdown with Trump  PoliticoAnalysis: Is the case against Don Lemon about winning — or about chilling journalism?  CNN",
    "published date": "Sun, 01 Feb 2026 01:00:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPVk5QMzdSMExWR3Q0SF9lN0VHSkkwOHlQZHNOeXEzLXZDUG9Rb3FBbVJNaTRtU1lvaGN1SmRlMzBMaDVWNE9wcEJBb09MWUlFYUNLbHQxQ2xkTlNnU09hMFl6aWhub1JWVDVTc2lmSzhUd19CSUR6WXpFb254UXhoZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Highway 99 reopens after 59-vehicle pileup in the Central Valley - Los Angeles Times",
    "description": "Highway 99 reopens after 59-vehicle pileup in the Central Valley  Los Angeles TimesMassive car pileup shuts Highway 99 near Earlimart amid dense tule fog  Visalia Times-Delta10 Injured in 59-Vehicle Pileup on Fog-Shrouded California Highway, Police Say  The New York TimesCHP: Several injured after 59 vehicles involved in Highway 99 crash near Earlimart  KBAKSecond victim in deadly Highway 99 pileup in Fresno dies from injuries  ABC30 Fresno",
    "published date": "Sun, 01 Feb 2026 02:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNHA0XzdsX3Ftb2RKYWxGNUJud3E2WGY3Tm0xUnNkVC1yR3pmYzVYTmhyVDFvLWM2U2p4UVl4dzRCdHBnelp5dF9EUFNuZEI3d0hHOHlqaWdYWWhRVjQ1MHhVYlFoa2s5SVZpRzNDNEFrbHhsMXRtek5YUXNEX2NLNjNDYjZ6UGlQTFB1OU96cDBYVXBxWUZzTlFUUHJMV3pYaFR2YmxZdkdad29EY2huMUlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so - AP News",
    "description": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so  AP NewsTrump says federal government won’t step into protests in Democratic-led cities ‘until they ask us for help’  CNNTrump news at a glance: president orders homeland security to avoid protests in Democratic-led cities  The GuardianTrump says DHS won't respond to protests in Democratic-led cities until they 'ask for help'  NBC NewsTrump orders federal agents to stay away from protests in Democrat cities  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 04:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZVZjSHNrX1l3RW1Mb2NPQ3k1SGo2NER1eFBLZlY4cDRIVVZlc3ZnSGhVQnVONUt3bVEwS1NhckVtODJSSG5vZFFXeTA1bmZya1JEYlNiWlZ6RjdWUUtTbVZqcllDX2VJRlU3WWlKa25XTy1MOG0yZDZoSkdRMjdOUUlMejlXMEpRWnZ2NjdGVjVSVUdQSldxRk5oTWpyY19kNWlYdWd0cm4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump says US is ‘starting to talk to Cuba’ as he moves to cut its oil supplies - AP News",
    "description": "Trump says US is ‘starting to talk to Cuba’ as he moves to cut its oil supplies  AP News‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure  PoliticoTrump says U.S. is 'starting to talk to Cuba' as he moves to cut its oil supplies  NBC NewsTrump’s threatened tariffs over oil to Cuba put Mexico in a bind  CNNPresident Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 03:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPWVZYcm9QZEJhS1FfWTg4aGVDWWVaaGFCdDd2ZHRHUDA4OThUeVVNUkZSemFnZlhFTjRRaGVLeTBubW9BVGxKa2F3TjljUUpmeWRsMDFUS241WXphZzAyUERMSy1IVlN3d0pTOVU2cVNmRFJPU1lzU2FZQWNLWmhFNXRrRWpqQ3F1VkhBSVpSN1ZZd3FCNlkxUXFObGdzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Where does this weekend's snowstorm rank among Charlotte's biggest winter events in history? - WCNC",
    "description": "Where does this weekend's snowstorm rank among Charlotte's biggest winter events in history?  WCNCHow much snow fell in the Charlotte area on Saturday?  WCNCRoads hazardous across Charlotte region following significant snowfall: What to know  WBTVLIVE UPDATES: Winter Storm Gianna Batters The Carolinas; Power Outages Rising  YahooLive updates: Nor'easter hammers Carolinas with record snow, Florida deep freeze shatters records  FOX Weather",
    "published date": "Sat, 31 Jan 2026 22:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxPam5laUY2RzBwdWVXZjBXVXlVWUJid1E2enNMNVYweDBCdXJJUFRPWXBJZG81cHpWVHlrZ0plRDkxUjhJQzR2R0RxbHozMlR6TmppN1FuVUh1NjNIa2k4SUlpV1M1aFpPOTBQalhBb2ZxR2FqVWZwRXJhV0RCRmFJNGliempNX19iOW5KYWZBbVJmRUQ3UjlOeWo5UkdzN0V4NTk1dm9ZbGktSjNJbFEzM0pYQUEtT2RYNDg1RmV4aGR0Q0poSkJveHkwX1lMYU13UVd6ZFlaT3JUTmV1NEF3RGVFTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcnc.com",
      "title": "WCNC"
    }
  },
  {
    "title": "Ukraine peace talks pushed back as Washington juggles Iran crisis - politico.eu",
    "description": "Ukraine peace talks pushed back as Washington juggles Iran crisis  politico.euUkraine Peace Talks Delayed After Russia and U.S. Meet  The New York TimesNext round of US-Russia-Ukraine talks to begin Feb. 4, Zelenskyy says  ABC NewsUkraine talks set for next week as cold sweeps country  ReutersZelenskyy announces next round of talks with US, Russia as Ukraine aims for 'real and dignified end to the war  Fox News",
    "published date": "Sun, 01 Feb 2026 10:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOQ2JHejNrM240c2VhZDVLZHJpa0hSNThtd0Q2RGJ2MnpjS3pUZkh6ZUhKVm41NEVBNWl2TV9jVFV0NUhmMzhlb0lmRXdUQW9XTXkzY3daYnNuRGdhWXJvZm1hTTdSZkdaU3RGMXBLUEF5R21zczBWbzB5UGFLbXFtRGVzcXJ0NTh2Vm9HZ0ZaTjNvdnU0bnVlRURaV1NVWFZBRXZVTVpfNDRtZzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Updated snow totals for southeastern Virginia: Forecast down - The Virginian-Pilot",
    "description": "Updated snow totals for southeastern Virginia: Forecast down  The Virginian-PilotView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 22:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE94SjRwYWRJYlJoTUpOVEFIQ2t5UDRZVDhsV2JNRHdrMFJMOTFNd2NJcU54clJqeUxwblU5VkdGWkJ3eWJBemtSNVc3TE5mSzFaNUhqanU0MG15bGlCSDhiTllmNTIwUlMzd3pfcHFQdFZaVFZPUkEzZWNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pilotonline.com",
      "title": "The Virginian-Pilot"
    }
  },
  {
    "title": "Democratic Upset in Deep Red Texas District Rattles Republicans - The New York Times",
    "description": "Democratic Upset in Deep Red Texas District Rattles Republicans  The New York TimesDemocrat Taylor Rehmet wins a reliably Republican Texas state Senate seat, stunning GOP  NPRDemocrat Taylor Rehmet wins solidly red Texas Senate seat in stunning special election upset  The Texas TribuneDemocrat Taylor Rehmet flips a Texas state Senate seat Trump won by 17 points, CNN projects  CNNDemocrat flips Texas Senate seat in Tarrant County  Axios",
    "published date": "Sun, 01 Feb 2026 06:09:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOTXRjUkszQUJFUkVIMVJQbGdlSGRvVlRMdGY3bEdiNlJJa1ZYSFhDUC1uZFZMMVdQcUNRbWZCUjV3QVdpdTdLMXI5TGFOS0N1SmFxYlpJdzBUZFJqZDAwdHhkeGZKS1pUX1Y5cTd6a0NKTjUzYjdSUHhDS3RKOGl2QmZkY1RoalAwek5aSHNwYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Mamdani Names Nonprofit Leader and Ex-Rikers Inmate to Run N.Y.C. Jails - The New York Times",
    "description": "Mamdani Names Nonprofit Leader and Ex-Rikers Inmate to Run N.Y.C. Jails  The New York TimesMamdani names new Department of Correction commissioner  Spectrum News NY1Mamdani names jails reformer Stanley Richards to steer chaotic Rikers complex  GothamistMayor Mamdani Announces New Appointments, Including Commissioners for Health and Correction  NYC.govStanley Richards named to lead Department of Correction — NYC's first ex-con commissioner  New York Post",
    "published date": "Sat, 31 Jan 2026 23:39:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNWTJxaDFmUWV1RWNldGFxMkk4eWJSVWhiMk9jeTJHUnlzLTZLejN0N0E0WVM1dElkUk5xU0tKUEFJZ1RReER0OUVlRzN1M3F1LXZHakZTQjFhdzMxS1dhR3BFLVdLQ3pKZnhOZWlnQ2x4bjNwRnVYeUs2U2NYTGZTRXUwUlhQa2tSMm5rbXNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct - CNN",
    "description": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct  CNNChicago mayor orders police to investigate alleged illegal ICE activity in city  The GuardianMayor Johnson Signs Executive Order Designed to Lay ‘Groundwork’ to Prosecute Federal Agents for Actions During Immigration Raids  WTTWMayor Brandon Johnson signs executive order, directs Chicago police to investigate alleged illegal activity by ICE, federal agents  ABC7 ChicagoChicago Orders Police to Document Potentially Illegal Federal Immigration Tactics  The New York Times",
    "published date": "Sat, 31 Jan 2026 21:53:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1TWUdtcU9BeFdSUlluVEdlNFNtZl9Xa0NQZzBHZFFBeUJqMjZwSkR2T0U4YXoyVGxUMUM5Y2lhZ19CWGVGdy1kbWxrYnVQTHEtdXBweFk2UzVmZ0hYX2pDeUZmbnJfUlBockNrTkw2dnRCQjkxNnQzYkN4eFA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "What a swing House district in Colorado shows about Republicans' immigration fallout in the midterms - AP News",
    "description": "What a swing House district in Colorado shows about Republicans' immigration fallout in the midterms  AP NewsA closer look at Americans’ views on ICE  CNNTrump’s immigration agenda is colliding with a midterms reality  PoliticoSenate Republicans try to regain footing on immigration after Minneapolis blowback  The HillTrump’s Immigration Push Fractures Republican Party  The New York Times",
    "published date": "Sun, 01 Feb 2026 12:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQXzhaU0FlTHVCRDhjckk2REFTc3FFSWJsNHktNkpyYTY1SEdwRWxQeVJzYnlUZjMxaUdkTHlUSElwOU9ZeTVDMXFPZ3I2X1U2SldTS0xQbFdMajJuS3F4cEc1ZzNPTzk5Wmp3b3JmZEswUmVGcFdOS01EVmF5U24tUkNBQXA5VFFlSV9ad2ozWmRMblRBbXA5cTRDd0o2dU1OaWZqaEtlS3R6MGpSSjFJXzZYamhkRVp3LVFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "List of ICE raids, major updates in Minnesota on Saturday, Jan. 31 - Bring Me The News",
    "description": "List of ICE raids, major updates in Minnesota on Saturday, Jan. 31  Bring Me The News‘We’re fighting for the soul of the country’: how Minnesota residents came together to face ICE  The GuardianPhotos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show  NPRMinnesota Proved MAGA Wrong  The AtlanticLIVE UPDATES | ICE in MN: Alex Pretti memorial ride in Mpls, Operation Metro Surge allowed to continue  FOX 9 Minneapolis-St. Paul",
    "published date": "Sun, 01 Feb 2026 00:05:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQS1hWTHQ3V0pwcHBkSXMzTHhOdG5XX0ltUkp6dmR6b0tUS3ZkZFViMVFlcm4xc3NpcVI5TGlWVGdqWE00YkRKVjRJMHlxeS05UFFoNmVkUEk5cS1NakN3UlBzSWVJZ3NTUHBhZUpNMFJCb0d6dWhJa2ZhRmp4d0EtRmJmN0NHWUFjbzRNQTZ0Z0xEa1pBZlRISXY0eWF2SEowczhncXBQdkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bringmethenews.com",
      "title": "Bring Me The News"
    }
  },
  {
    "title": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics - CNN",
    "description": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics  CNNGun Activists Bridle at Suggestion That Pistol Justified Killing  The New York TimesThe Second Amendment Was Never Meant for Everyone  The InterceptAfter Alex Pretti killing in Minneapolis, Jewish gun owners confront 2nd Amendment tensions  The Times of Israel‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response  Politico",
    "published date": "Sun, 01 Feb 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPZ1NCWC1HOHRSa3BoUHlac1ZpWU5hZ2VHTHpFLW4tLVlwTjlHSXpORmlDRFJ0QnFRU1l6N01PTklBd1RHaTlEcmcxbUc3ZjljRnB2MlVnaHZsT2cwVkw0eFJyT2p2ajhhaDhsZWJtR3lxLVFpOWd6angtWEo4X2dxNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners - CBS News",
    "description": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners  CBS NewsVenezuela: Interim president proposes amnesty bill  dw.comVenezuela’s acting President Delcy Rodriguez announces prisoner amnesty  Al JazeeraVenezuela plans amnesty law for political prisoners and closure of notorious prison  CNNVenezuela announces mass amnesty plan for political prisoners dating back to Chavez era  The Guardian",
    "published date": "Sat, 31 Jan 2026 22:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQQTR4a2FTaTA5bXpabDJacGtLdUZmY3dVczFpZDB6VjRnT3hfQWNBTFNjTDlfY2U5VEtxbEluTGo4U2VOb2prQmhqQnVfd0gtUUhNYm1BNFl6cDBSSnNfa3MzN3JmbWYtWGhWME1zNzRrckluYXNCZ2N1aFdNcTdVMkIwTEFmdWlCdXFSYzZYS3dPdzTSAZgBQVVfeXFMTUNSNm5SOFYxUlJDV1Y0TWFBYzl2YzYzMGEzZWJ6d3JrWTBrLVc3cmd2OWthQjlCdXZubG1vOHdCQ3Q4THBBcmZwRzhvRFJqZ0FucDktdjlsTWU0Y0RMcGJYdm91enFjVEttb29ZZjg5ei1ERjVGVW5ab0NIUlB5SmdPcVBIVFQ3aDg4MG9GNlk5TzVqWnZ5c3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Virginia woman was strangled with her child sleeping nearby, authorities say. Who was behind the deadly attack? - CBS News",
    "description": "Virginia woman was strangled with her child sleeping nearby, authorities say. Who was behind the deadly attack?  CBS NewsA MOTHER GOES VIRAL ON TIKTOK DEMANDING JUSTICE FOR HER MURDERED DAUGHTER  Paramount Press ExpressVirginia Man Sentenced to Life in Prison for Strangling Young Mother While Her Child Slept Nearby  USA HeraldKatlyn Lyon Murder: Where is Trenton Frye Now?  The CinemaholicExclusive Preview: Hidden Assault on Katlyn Lyon Unveiled  El-Balad.com",
    "published date": "Sun, 01 Feb 2026 04:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOREd6M3FWY2VYenNWTUdwektiUVlHWkc3Q0xreXFxTHVTQzdwTkNDdng1OEptR3VUd1N3enYydmM1ZlJOMHplYTNzR3hWVjY1eHdzZlJ6bUFFSkRiQlVuRU5FQm5iUFAyTWl1RVVqMGhzWFFab3VHRmdzQWdzWDUxRDkwX1p2MnNiemt1S3VhZ2Fia2o1QUgzaHJFTWNVcFpEeE11OFJSMnRzZDNfMHJ3eXd30gG3AUFVX3lxTE11VmljRUdKSkZOc0RpUG16UzBPTnlKdmF5VWNGQ2VZeXhyeTZiSVk3WFVhNUhFNzk5TFVJQVU2aXdWazZsdXdzOF9uNW9iaVVaSk9TUzR6MWI2WENRb2NJaWVVWWJfd3l3MHVOT05zbjQtaDdpMkUzQmlYOHlkRVBDR2kyVlhVNWtNM2FKaGw1dHRhWEdDbGJkd2ZKNWxEMkJwWG0tTFhMWGJyY2FzeFl1b1BmTldfcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Kash Patel confirms FBI had 'probable cause' for Fulton County election hub raid - Fox News",
    "description": "Kash Patel confirms FBI had 'probable cause' for Fulton County election hub raid  Fox NewsOpinion | I watched Georgia's 2020 recount. Here's what the FBI raid in Fulton County is really about.  MS NOWThe FBI’s seizure of 2020 ballots in Georgia is a signal of what’s to come | Austin Sarat  The Guardian‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNAmid FBI investigation, Trump's 2020 election obsession is still shaping Georgia politics  NBC News",
    "published date": "Sat, 31 Jan 2026 20:46:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOd0hkcUhTbVRBcUZRVE5qZi1SWnRXV3lIdXgtZDRXSm50cXplUHRwZy1taDY1aWR4cE9xY2ljdE5paWxwelJmQU9HczFBZXRhRWs0dHNTZXZ3Z1dJelhuNmhXN2x2WmlheHpSM0FBWENUbzRUSjVteHQ4c2pDN3A2MlVwLVM2LS1JNkpDRDduelBlNUdfdEYwQ2VPc0t6X2duQ0VWalR5Y9IBrAFBVV95cUxQOFNVeEtFOE9Ja013eElMdlA0emI0cjlqMC1uSFZSZFZLcTRXWUo4MkpuU1NiTmtJTnJZR2Y3TkV1Wnd5LWd3cXBEQWNwUWpfTENtREN6SExFbFdQMVFYeVNqaFprNzBUVTB6YU4xT0lOeWp4ank5U0VJTmZaVk1CQmtaRDJHaTNrTXJiZy15WTZnUFJ0cXk2TTFOUWdjRThBdHMySV9oRFNMeVQx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  },
  {
    "title": "Hundreds of Texas public school students walk out to protest ICE killings - The Texas Tribune",
    "description": "Hundreds of Texas public school students walk out to protest ICE killings  The Texas TribuneBusinesses close, protesters gather in S.F. as part of nationwide general strike against ICE  San Francisco ChronicleHundreds of University of Illinois and Urbana High School students protest ICE, federal immigration operations  IPM NewsroomThousands march in anti-ICE protests across Bay Area  KTVUPhotos: Protesters flood S.F. streets for ‘ICE Out’ strike  Mission Local",
    "published date": "Sat, 31 Jan 2026 03:20:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQkR4Sk4yWDBvYV9SaDJKRGVwM0JEQ3hJR1l2TTBJV2d1RFFqUDR4bkNHVGVpSG5wdjZNaV9BalNUT1pRRUJwWF9uY1o3dURSVlFCMEcwUDJ3bk91T05WSV80ZWU4RmV0dzlza2pmYnNnRU5nM1JCbEVIUG1xdlJrMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "At least 1 killed in Iranian port city blast ahead of Iran's naval drill in the Strait of Hormuz - CBS News",
    "description": "At least 1 killed in Iranian port city blast ahead of Iran's naval drill in the Strait of Hormuz  CBS NewsBlast rips through building in Iranian port city of Bandar Abbas, state media says  CNNIran on Edge: Explosions, Diplomacy, and Trump’s Next Move  Euronews.comIran: 1 killed after explosion hit Bandar Abbas Port  dw.comFive killed in gas explosions in Iran, officials say  BBC",
    "published date": "Sun, 01 Feb 2026 01:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNZzZKdVVjWmJGM0Q0djc0cGdOVDZOTmJTM3pwMldpUW9nN1BiRFdaaUVxU0p2eFlRNWhsZzB6UEt4ZGhaWG1FdGJkaE5Ja1hPQ1Z4U0JkN3M2d3ByRUh3SWlHbHRkNG5Pc2FsWF9wZjY0YU9CWDUxNE12Sk1MdzBMNEFnUmhZUlVzQzVrX0Q5NFFfYkdHcmE5MmxJNlDSAaIBQVVfeXFMTmswQUVLQnYwc05fUG9mVVdRczhjZ1lNOFRMWURFOXZsbjA2MFVtcHhrYzI5UXlpUjNhTlRxbGVaaFJUeHZOeFpGOTlzMEVJV2pOU21DWS1Vbk9xd0xOVzU4dDJUV1ZLX0ozTjJwN1FNbHBKYUptRTFSV0cwcUwyUm5sd1FrZ2FrQ0JaMktOWGNscVotQWlpSW9WUFpod2JUbUlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments - The New York Times",
    "description": "‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments  The New York TimesHundreds protest Trump's NATO comments and Greenland demands at US embassy in Copenhagen  Fox NewsProtesters in Copenhagen rally for Danish veterans after Trump remarks  ReutersDanes and Italians protest against US Greenland threat and ICE  Euronews.comDanish veterans protest outside U.S. Embassy over Greenland, combat contributions  CBS News",
    "published date": "Sat, 31 Jan 2026 19:46:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUlIzU2pTR0dvMGlOQXBGVU00MTVvRjdieXQ1NDVPU2k4bTg0eVlFc0p0MGowbUVwOTNiYVFqcThRLXFOV2RsalBBbXhsbDZTSDJsdnhIeFFIMVI5VUNiRE9LRFp3UW1ISUZWZU1Kam9Mb3B5MGhEbVAtNC1iN3FFanItakU1WnRDb1RRclZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "1 year after deadly Northeast Philadelphia plane crash, inside 10-year-old Ramesses' road to recovery - CBS News",
    "description": "1 year after deadly Northeast Philadelphia plane crash, inside 10-year-old Ramesses' road to recovery  CBS NewsCommunity Gathers to Remember Victims of Deadly Northeast Philadelphia Jet Crash One Year Later  6abc PhiladelphiaPhilly medical plane crash anniversary: 8 dead, 22 hurt, lawsuits filed, community remembers  FOX 29 PhiladelphiaFrom tragedy to strength: Reflecting on the Philly plane crash 1 year later  NBC10 PhiladelphiaOne year after the Northeast Philly plane crash, ‘eerie,’ ‘devastating’ scene still strong in neighbors’ memories  WHYY",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQQ0phTmFnc0p5TmNkUDRQUURmZmVKVVduT2MyMHQyaFI3V241ekZSX0tiajBoOFBfSXNTNWh0eE4wbGRZVndwNjZ5QXBScUZVMjhHcEt6LTdPSjA2cnF5Qm00c3dVR3hPNUR4Z0MwY1ZvY3RCUV91QWF1VG5OWkxTajh5TVRGcjBGMTVLOEluX0hWSXAxVlNrVl9kbnBqVERSMzRvMUVLRDlqbUZDY1h2eTE1dDh1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement - WCVB",
    "description": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement  WCVB‘Stand up, fight back’: Protesters on Common assail deportation tactics around country  The Boston GlobeSmall businesses stay open during nationwide shutdown, citing financial reality  Hawaii News NowFewer Minnesota small businesses close for second protest in as many weeks  Star TribuneThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The Guardian",
    "published date": "Sat, 31 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5EYWtjMy1aMERJNmdVN0NyaXpLVEdibF9IR0x1ZTFVVW5lU0Nya0JId2IxOHdaTFF1dzNyYzlhbmFzcDBKQjhJTVREVjZyZlgtTEEwT2pGd1lEN2NpNXExV245ZFRDQ3JPX3hkelptZ2Jmd0phdUI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcvb.com",
      "title": "WCVB"
    }
  },
  {
    "title": "12 states are hoping for early spots on Democrats' 2028 primary calendar - NBC News",
    "description": "12 states are hoping for early spots on Democrats' 2028 primary calendar  NBC NewsDemocrats to shake up primary map, as 12 states vie to be among the first  The Washington PostNH clears first DNC hurdle in push for first-in-the-nation status  WMURIowa advances as Democrats hunt for winning 2028 presidential calendar  The Des Moines RegisterFor Democrats, the road to 2028 begins here  CNN",
    "published date": "Sat, 31 Jan 2026 19:13:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQdlVHM3gyZ010azdOOVV4bTFqNDFYQmZTT0lSaVNzaUh4d2x0dlZjSENyVWtjQ3E5VFN0LUxsOFp4UjdNOFF1V0ZZQy02MTBlblNhY3paMUQ5eFpnaVdxLVo2X2FsLTcyWVhoUHdWRzhfVy13Tm1QdHBVUWVNYkY4alcxa2VabE1SNnRnSUwxZDRPVzhQR2dlNTVuRnlaMk1hOHJxU2QxVGtmR21pWGRlMkcyNktGck5qZlVN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Search for survivors halted after Massachusetts fishing boat lost at sea - The Guardian",
    "description": "Search for survivors halted after Massachusetts fishing boat lost at sea  The GuardianLily Jean: Search suspended for missing fishermen after boat sinks off Massachusetts  BBCTV star fisherman’s tragic final call with pal hours before vessel carrying his entire crew sinks off Massachusetts coast  New York PostUS Coast Guard calls off search for Gloucester fishing vessel with 7 aboard  The Boston GlobeSearch Suspended for 6 Missing in Boat Off the Coast of Massachusetts  The New York Times",
    "published date": "Sat, 31 Jan 2026 15:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeU5uSXZoUkxVdmRuRzFqdzdCcmdTXzVPQWVTbU14SFpkSE12RkozU0J3WElXU0pyYlNJSkJ2ODRFY1F4dHpqOWhKTk1QMWJxR3k5dmdaVjJUUENyeDNfUDY1dnFfcndULWlTTWNMQjRHMGh6U21ncWRpTVRFRldzaU0taVgxMTByOTdUX2hNZ2RTd0ZXX05ERHFjNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Luigi Mangione unexpectedly summoned to court next week - ABC7 Chicago",
    "description": "Luigi Mangione unexpectedly summoned to court next week  ABC7 ChicagoLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersManhattan DA wants Luigi Mangione state trial to start July 1, before federal case  ABC NewsFederal Judge Drops Death Penalty Charge Against Luigi Mangione  The New York TimesNews Wrap: Mangione will not face death penalty after federal murder charge dismissed  PBS",
    "published date": "Sat, 31 Jan 2026 17:47:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQbDhlYmV5Vi0yVE9tSzZtNk5lV2Y0ZXFOaHJybnF0d2paYkFCMGgyQ1h6OG5odklFRklpaHlrM0VRdUJOOFhZWEUwbmV0T0ZDR0RJZ0tiREVyVFRwaFNUZ0ZlQnhwbENTdjBHZDdtMnNfWjdxb05RU2ljakVPcjI1cmJsTVYwSTlzOGxkWXd3QnN1NHNQaElvbUFPaG1UMC0xUkF2M0d6SFRqWEhIN1BzYUlabVFzUjFqMFI0QjZQUTRCS1VTYWV5QUd6azNGNXZyZV9IaFM4VmJzdzJld3ZBdTR0ejYxUGxWc2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "Top Iranian official says progress made towards launching negotiations with the U.S. - Axios",
    "description": "Top Iranian official says progress made towards launching negotiations with the U.S.  AxiosIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNNIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsMiddle East Scrambles to Find U.S., Iran a Diplomatic Off-Ramp  The Wall Street JournalThe U.S. threat toward Iran may wait for another round of Turkey-led diplomacy  Haaretz",
    "published date": "Sat, 31 Jan 2026 20:47:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE8wSUVsVEZyQ1B1MGRBRGdRX1l6SWxmNE5sUHFKTkpkajRvck4wUXNGQzdWWWw0VDhEVW1fQU1Vb2FKX2lyMDE1VnhlYWxSSFdaTWpYN2F5MmZ4TElrOEw4dnRCeU5CY0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Protesters Rally Across the U.S. in Solidarity With Minneapolis - The New York Times",
    "description": "Protesters Rally Across the U.S. in Solidarity With Minneapolis  The New York TimesAnti-ICE protesters call for national action against federal immigration tactics  NPRDemonstrations against ICE tactics continue in L.A.  Los Angeles TimesHundreds gather for 2nd day of anti-ICE protests in downtown Los Angeles  KTLAMontana businesses close, shift operations to participate in national strike over ICE activities  Montana Free Press",
    "published date": "Sun, 01 Feb 2026 02:50:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOQVNUZkpuZlBCUnJOdU1SaFBKMV90elFkTWl6eklmUW1pb24tbFJZUHVNeGItdGlyREZ5bnhzT0lDNFRkZkhua1ZUODZMc0xkV1E2b19vTDB3ek1XaTI0MHN0MGFqN3FrYk9FekI5S2piMXU2alVSUWlWYUFWb1k4Ym9UdXZ4d1VxR3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The West’s water war arrives in Washington - Politico",
    "description": "The West’s water war arrives in Washington  PoliticoFate of Colorado River hangs in balance as political battle brews  The Washington PostArizona’s Cheap Water Supply Is Drying Up—and It Could Hit Affordability Hard  Realtor.comWhat happened at the governors summit on the Colorado River? Here's what California said  CalMattersWhat's at stake as Utah, 6 other states seek new Colorado River deal  KSL.com",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdW1TMnJxNDQyTmZNVVFxd2dxek5GTDhXNzNPakhCWVhvVFdCaFJRT0p2eld4TXhlNFZKMmE2Vm9BWEFDUFEwNkNBTFFkVjExRzlkYkR0aGU1YlJKU0xuZkt0ZE16cEdsVngzOTZNUzluNVhqdHdvUERUd1Y1eTVZOTN3cmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls - Politico",
    "description": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls  PoliticoBondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’  CNNBondi Links Minneapolis Violence to Voter Data  Brennan Center for JusticeRead Bondi’s Letter to Minnesota’s Governor  The New York TimesOpinion | What Pam Bondi's demand for Minnesota's voter rolls is really about  MS NOW",
    "published date": "Sat, 31 Jan 2026 19:36:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMG9kWm9STGxkdEo4WVlZcGpfZUVxOVlLd1I2WUMxM3VKLXlZcVdZOHQ4S1dTT29Ma0ZuenFiNXBLVHJ0XzVEZFJIWjhhOVl3dVRTT1BvN2JEU216SGpvVEhlc3p4WDIwT2owSG03S0J3S0QtUndnbXppTm1Hc2V1WFp3ZGtYSzByQlBQZjRQaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach - NPR",
    "description": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach  NPROutcry in Italy as U.S. Says ICE Agents Will Join Olympics Delegation  The New York TimesDemonstrators in Milan protest ICE unit at Winter Olympics  ESPNAnti-ICE protests erupt in Milan ahead of Winter Olympics over planned agent deployment  Fox NewsDemonstrators oppose ICE deployment at Milano Cortina Olympics  USA Today",
    "published date": "Sat, 31 Jan 2026 20:04:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNa2N2TVBSQzZnTDB5SDRjLUZmd0t3OUQ3NHgycEtadGVQdDFFdlVaZE5TZXFsNHlJeGZZM2E4dVhWMVRuZmRaRS1yY1F5aDdMc1NHbWh5UTUxaEtzcElPeXRxQXRoMHZpa2dleG5lRmcxaTdmbDVfMHZ6UW1FQWJCZnVZLXJxMkswd0xocm1laTJQeHNzVFU4TXljRDFSYlNuS1JHVDJEcnh2dVJQa3BDWmV2UkdwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump continues to defend Homan, Noem amid immigration enforcement backlash - ABC News",
    "description": "Trump continues to defend Homan, Noem amid immigration enforcement backlash  ABC NewsTrump’s New Method of Humiliation  The AtlanticNoem says her response to Pretti shooting may have been wrong  PoliticoFor Kristi Noem, an impeachment threat is growing  USA TodayWhy Democrats won't rush to force Noem impeachment vote  Axios",
    "published date": "Sat, 31 Jan 2026 18:23:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUms1OUN0U3NGaUMxb3FIdExlTHZUS194WFdpbndLT3pTYTZCVERhVHFZMHJSVTdUVGhFcW0tN0N5TXVuUHlQNnFMOElXenpGRWpmZ3o0SHBzWFJobnp1eVJVR0VabmljdnJmQ1E2RFdPMXFmRFFTMjBteG1DeGdwbjB3dTVVX184dldjdno1VG00VENkemh1SEt1dm1YVmNRZDhjdkxaY1dyVi0zaW9uOUE5Z9IBuAFBVV95cUxQem5fMnE1cFdnaG5xOEVIeER6T2ZRSC02VVJtTUZpX0JjT3JWMUdfWE5FN0lja1NiTEM1R0c2V0FnbTk2cS1kOGJBZkl5Snd1XzYzQjdSbUdrRnc1WnNNc2RlcERTdTM1RVhXMGhla1Z4cHZ2RVZGbGh1QVNxaFZDbnN6bGNaeDJ0U3h6ck53bl9qZTNZTW1FY1poTWd3eG1ORUxzZnM0VWhzZFp3QVJaaXBaSTM0a2NK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Thousands of labor union members march to South Portland ICE facility - KATU",
    "description": "Thousands of labor union members march to South Portland ICE facility  KATUICE halted its surge in Maine. The state might not be quick to forget.  Politico‘Be unafraid’: Mainers protest Trump’s latest immigration crackdown  The Boston GlobeCollins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesHundreds of students walk out of Maine classrooms to protest ICE  WGME",
    "published date": "Sun, 01 Feb 2026 03:38:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgJBVV95cUxPdlZCUlliWXAyd19sVExCS1JjR2VIV0xDZjJ6bDdHMXBzUXNwN1VpaEJ5V3pWNjJpanA1eW1ja2ZJanVwZG8xaFcxX0RRTTZjcFhVTjNFMTVYai1XSzF5Z2hrS2N6SWhYQndUM0tjdXZrVEdJemtlOGxxWTFGSnM1Qmo2UVZfM2lXc0YwX0tQSF9hLV9SX1F5enVqS09UMV9xdWZZdnNIbC1KQWVvX0JmNEpTd3RBQTYzTUxjOEV3clRabGpPcjREU3lzOXVvVVhoU1lHX0NSMGxiVF9qUXlVQ1RaQ1A0RE5YOHBNWExSTHlOdko3RTJ3Y0t5aEJsclJJZkU4bDlkS3htb3dEQWRmU0o5a0tpTFh6Sm5DaWdFcWZ4c3BIa2xyWXdOdmk0R1FpeWZEOXdoUVd3TkpxdEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://katu.com",
      "title": "KATU"
    }
  }
]