[
  {
    "title": "An abduction, a Bitcoin demand and a TV icon - why Nancy Guthrie's case has gripped the US - BBC",
    "description": "An abduction, a Bitcoin demand and a TV icon - why Nancy Guthrie's case has gripped the US  BBCLive updates: Search for Nancy Guthrie reaches 2 weeks, no arrests after authorities swarm nearby home  CNNUrgent plea for Tucson home footage to find missing Nancy Guthrie  KVOAThe Disappearance of Nancy Guthrie  The New YorkerInvestigators need you to help bring Nancy Guthrie home  KVOA",
    "published date": "Sun, 15 Feb 2026 02:02:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1za3pQQ2d3SktjOGxQdjNXWjFLWmdjNHI5ekJMUWFVWERKS25TdDExdFdES0ZBWWcwOUM4a0xPbFBsdVo2SEx2SnBtQ1RaYmdfcExla2xKN2F0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "TSA agents are working without pay at US airports due to another shutdown - AP News",
    "description": "TSA agents are working without pay at US airports due to another shutdown  AP NewsWhat services will be affected by the DHS government shutdown?  CBS News5 things to know about the shutdown at the Department of Homeland Security  NPRT.S.A. Workers Brace for Another Shutdown They Didn’t Cause  The New York TimesHow the Homeland Security shutdown is impacting travel in the U.S.  PBS",
    "published date": "Sat, 14 Feb 2026 21:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZEVGNGdfS3Z6LVowS0doZHgyd0w4VHpxOWJZbTVHYndzUk15ZkpvdXNOcVpIRHJWU0JHNDdXdHcwZ2JjZEFXY1N1NVB6bUtKTjhoMnlJZXNncWw0QlRVWFJJYk1keEdpMXNpLVNYLUNUdG1FOTBPazc0T0ZBYUpXUXFvQ1BuZjIzOHpKTWVhcEs0anlfbHU2bV9FNEdJdnJM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Winter storm warning issued as Tahoe braces for feet of snow - San Francisco Chronicle",
    "description": "Winter storm warning issued as Tahoe braces for feet of snow  San Francisco ChronicleHeavy rain will soon hit parts of California and Oregon. Here’s when and where.  The Washington PostNorthern California forecast: Calm before the storms  KCRASierra storm could bring 8 feet of snow; Reno may see rain, snow  Reno Gazette JournalCaltrans urges drivers to cancel travel as major winter storm threatens I-5 closures  KRCR",
    "published date": "Sun, 15 Feb 2026 04:29:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPaDluel9kRDBhbm1Ca1dIX19tSVA2aXNBYW1wWlJzLXlPTHpod2YyQTF3LWJmcFVxUnRrZzZmNUdEYnZCYVFPOFJUb2FIaW40MmVna2dsU21LTGJKVzl3bFI0M0tVZEpuYzFDUGItdGt6UHdYRlVSdnFkem1wTGkyUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "‘South Texas will never be red again’: Home builders warn GOP over Trump’s immigration raids - Politico",
    "description": "‘South Texas will never be red again’: Home builders warn GOP over Trump’s immigration raids  PoliticoAs construction workforce dwindles due to ICE presence, business owner worries about long-term impacts  CBS NewsImmigration Raids in South Texas Are Starting to Hit the Economy  The Wall Street JournalBipartisan push in U.S. House to create new visa program, help home builders who rely on immigrant workers  KXAN AustinFronteras: How tariffs, immigration enforcement are creating a ‘chilling effect’ in the Texas economy  Texas Public Radio | TPR",
    "published date": "Sat, 14 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOdS14Q3NnbnlnTjJZLThpcDZXRzUzMXUybWJJajhkWlZ4ZUtMRmFBdnF2STlpbzROM0NGMFlHWEhyaE5tSGx0dTA1Wi00a3hjVWhaRU0xZ0VsYnE4VUVLRjNEYm1POVZwWC1zSE1MRDRXNVk5NmJkU3lrTDBZS1JCOGRLd2VBaXNoQkxzX0Y4dnI3c2xKa3JCQ1ZUMG8tdk9MS3FKZ2xCWVZzeTVoZU9vUjR6OTFDQVNoMjJERVJIMTdlWXNtTW92Y3BNb2xNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "How a Solitary Bullet Hole Blew Apart ICE’s Web of Lies - The Daily Beast",
    "description": "How a Solitary Bullet Hole Blew Apart ICE’s Web of Lies  The Daily BeastHow ICE Failed to Justify the Shooting of Julio Sosa-Celis in Minneapolis  The New York TimesMinnesota shooting of Venezuelan man is the latest where video evidence contradicts ICE accounts  AP News2 ICE agents under investigation for ‘untruthful statements’ about north Minneapolis shooting  5 EYEWITNESS NEWSDHS says immigration agents appear to have lied about shooting in Minnesota  NPR",
    "published date": "Sat, 14 Feb 2026 22:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPR0p3NG1EU0xhM3NzRV85T25uX2VTUk13NnZRODN2OHRhWmJaT2x6dGNDMm53dVpRU0xpR2U2dUlqdEhMZHN0ZURLYWswbmtPN3ZWcC1qTXlqbElzbGE3LW1xUFZfbld1TzdLUTBOWURVd21HbTR5UjEzZVBmNFh4dTFEd1VtQXEzRUEyX193?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted - NPR",
    "description": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted  NPRInside Jeffrey Epstein’s network  The EconomistSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianThe Epstein files come for Hollywood royalty  CNNEpstein files: A list of people facing consequences over the DOJ's release  Business Insider",
    "published date": "Sat, 14 Feb 2026 23:04:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBfQW5SYTRKMWpBWFUtX0JYTHE1YXZFU0lCbThPTXZoSm05Rlo5bG9sYk9GaHdBdVI3V0xFMGdPc3hzQ3NhLXBhNmRnU0NjTDRkNFNqZGdybnN1M3lPOEtHdU5DamZGNFlVZmszN3ZGelE4NzFDYXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "States reliant on Colorado River fail to meet the latest deadline to find consensus - AP News",
    "description": "States reliant on Colorado River fail to meet the latest deadline to find consensus  AP NewsStates Miss a Big Deadline, Ending Chance for a Colorado River Water Deal  The New York TimesThe coming failure of Glen Canyon Dam  High Country NewsWestern US states fail to negotiate crucial Colorado River deal: ‘Mother nature isn’t going to bail us out’  The GuardianWestern states are barreling towards a showdown over a shrinking Colorado River  CNN",
    "published date": "Sat, 14 Feb 2026 22:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNS2ktRGU2Zno2OG85MmhCZGwyWjRLRHhMdjNmR2ZxcVBDU2I2d0w0Yk1ZcWloMzMybzNXQnFZSXo0RmxZclhvUnJqb1phdF9vSW5GcEZ2d01YaUg4WncxZ1hNRXV5NnE1OHFZZGNmUC1JN0JYUkxNT0h6T2c1Skh2YkxnNGJnczFNQzNtbE9rbGZ1cGFBV1M5ay1KZk9QVGRvM29IbTVpX1Zpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Valentine’s Day heat breaks record in Twin Cities - Star Tribune",
    "description": "Valentine’s Day heat breaks record in Twin Cities  Star TribuneMinnesota weather: Multiple warm temperature records broken Valentine's Day  FOX 9 Minneapolis-St. PaulRecord warmth into the weekend, but the warm weather will not be sticking around  5 EYEWITNESS NEWSValentine's Day to be mostly sunny in Twin Cities  CBS NewsNo broken hearts, just broken records for Valentine's Day  MPR News",
    "published date": "Sun, 15 Feb 2026 01:50:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPUV9BblZDNFFlZHlxWDZYeU9BdldGdGhNMVpJNzFmMmpMU1JQbFJxYmJuYmstQmlDTTdUUGlteFFLVzVWNElGM3NkbUlXSElLeHNFRnYwUmMzYjJsMUZCMG5kcWVIdkk2WFNJal9oc0FIQ1NGX29hZlZQT0RMcThLeDhYNVdaZ043SFZSZW1VMXdmYUtCbjJpRUJqcU55cHduUTExT01faG9ka0N5S0xtUjVrd1ctMUFvc1hVV043OEl5QzV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Barack Obama Breaks Silence On “Deeply Troubling” Trump-Posted AI Video Depicting Him As Ape, Blames Social Media “Clown Show” - Deadline",
    "description": "Barack Obama Breaks Silence On “Deeply Troubling” Trump-Posted AI Video Depicting Him As Ape, Blames Social Media “Clown Show”  DeadlineTrump privately lashes out at GOP lawmakers over racist video blowback, sources say  CNN'Clown show': Barack Obama on Trump post depicting Obamas as apes  USA TodayTrump shared a racist \"joke.\" That humor is an American tradition : Code Switch  NPRMy Conversation with Brian Tyler Cohen  Barack Obama – Medium",
    "published date": "Sat, 14 Feb 2026 22:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNWlJrQ2ZRQS1GeTZONUlKTXdpc0ZmbFJPMGtzaVgtTDVoY3AtSkhxdFpEWEx3UVA2ZkhaVlpjRmFzbk1XQTRBZ1djcW5rZ2c1ZFNISGhDd251NjZmU0xPQWlsWXM3VXQ0Nm50bC1DTDg2b1hoTGhBdTE3UEVGajZjTjNQbzJXcmdPTGNtVHRmYUc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Newsom Pleads With US Allies in Europe to See Trump as Temporary - Bloomberg",
    "description": "Newsom Pleads With US Allies in Europe to See Trump as Temporary  Bloomberg'Trump will be gone in three years': Top Democrats try to reassure Europe  BBCNewsom says Trump’s attacks are bringing Europe together  PoliticoAs Trump tests alliances, Democrats with 2028 ambitions offer reassurance at Munich conference  CNNNewsom says world sees US as ‘a wrecking ball’ under Trump  The Hill",
    "published date": "Sat, 14 Feb 2026 19:44:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOcGpRR2NrTjFiVTZUbFl3c1F0V2FKVmdkcHFwd2xWamNRNEVNRlNRcHN1ZGVRUEtiTlQwT1RSVjNGRm1YM1psSjNCMHFqS1JuNlc2LVIwenRtM3ZyOWxRdUlMc3RDbEJjeVMwckhCY1JzdmtTTjhPaThYTkNBampvQk5lVGY1X0ZDaUZyMkZ1eVJpV2hSR0tuUlc2TUllTTM2ZzlXMkRqT29WRm5ySnFuS3AtLWNPZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg"
    }
  },
  {
    "title": "A Nebraska girl went looking for a date to a high school dance. One week later, she was murdered. - CBS News",
    "description": "A Nebraska girl went looking for a date to a high school dance. One week later, she was murdered.  CBS NewsCould the puzzling case of slain Nebraska teen Mary Kay Heese be solved after 50 years?  CBS NewsA teen's murder went unsolved for over 50 years. Here's how police made an arrest  YahooThe Girl From Wahoo: 48 HOURS' Natalie Morales talks to Mary Nelson about the decades-long pursuit of justice  KMTV 3 News NowMary Kay Hesse Murder: Where is Joseph Ambroz Now?  The Cinemaholic",
    "published date": "Fri, 13 Feb 2026 22:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE45Z3FKTXVjUXhndnBvUXZkTUVtSmg1SS1IX1RmNnZsS0JGX1dKTlBaNFlmTW5qbWFpUG1qNmMxSzZNUXlpX2EyZG80eWkyMm1uMThPUkQ0SXFOaUVpN3QyUlZ6UWFCNUVOdXZONXRsa09zSG50TXNCWNIBfkFVX3lxTFBMRUphQ0xaSGtjbDFSbmdPd2J6SlRfLWVWSWtoMmVCYk9HOTl1Q2dXTE9TeV93TE4wbTY4a2szaDYzVVFHQXVDUEFoN3NpakNQU29naTNseE1RYlV6bG92VjBKdnMwdWpkQndxb01qUm05YVp4Tlk1SnV4UUdBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "description": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest.  The Washington PostDon Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon pleads not guilty to federal charges stemming from church protest  CNNDon Lemon, Nekima Levy Armstrong plead not guilty in church protest  Star TribuneCivil rights attorneys predict charges against Don Lemon, others will be dismissed, citing flaws in FACE Act  CBS News",
    "published date": "Sat, 14 Feb 2026 18:00:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTGlxaTVmZGNfZ1lOUlZqRUdNVWZhUnQyZkV1dWpOMFM0V2tsSTZOcUdjMmItUTd4MDBRMWZxZ0x2TFJRUlJMZGx1UVRPeTRhbXVPa1VPUWJZYUNWRUVFS2k2NXhJY1RRZXVZbG9waElyZlZkODZGa0FpUEhiakItLXFna1o4ZnZFQ0I0MGhwZGhiQlJjeXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Sen. Mark Kelly's lawyer urges DOJ officials not to seek indictment for a second time over video - NBC News",
    "description": "Sen. Mark Kelly's lawyer urges DOJ officials not to seek indictment for a second time over video  NBC NewsPam Bondi Crashed Out for a Bizarre Reason. She’s Not Alone.  SlateOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York TimesKelly expects Trump to come after him again  PoliticoDOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington Post",
    "published date": "Sat, 14 Feb 2026 22:22:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNNUNOY0lfV0tCVkg5RnFLMWNPVjZlSF9pTllNQTJOY0hTNk95X1VVMzhsR1hKeGs5NkxTWlhsRzdFVGFLcU4xeThfb2VfOUlKZGpvbnE1RnpWeG10d2o2d1BzakFoTXdSTTNfSWktUGRpOVR0Zm9SV2ZyaUoxUHlsbklpV3VLdEJ4eTN4dm9saUpBQk1fcWd3anZ2X25QaHBacHo0UXFZOVVscDVlbFF6NFBTc0VtRTZLV0R5LXZObw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "From chaos to radio silence: How ICE tactics changed in weeks leading to Homan announcement - Star Tribune",
    "description": "From chaos to radio silence: How ICE tactics changed in weeks leading to Homan announcement  Star TribuneOpinion | Trump’s Operation Metro Surge in Minnesota was a failure by every metric  MS NOWICE drawdown in Minneapolis: No deals made with federal government, sheriff says  FOX 9 Minneapolis-St. PaulBrooks and Capehart on what's next as ICE leaves Minnesota  PBSTrump’s Minnesota Retreat Points to the Power of Public Anger  The New York Times",
    "published date": "Sat, 14 Feb 2026 15:25:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPc1pMcTMxU3lYNlhOVU5VLTBzOTJFaUpjUDVaTktlUVFnWUtvRGxtVFZwcy02a2FTRTVKUWhESEVBVFQ0Snc2ZmxHNHhLSTUyS2V4S29IVkpHNzczcUdiQ29jVHdINVhwYjBvUVlxakpvSGFHdy1vZS1KZVhZbzJfUXhrSDRua0V5b0swR3JqVzhNRzV3RnJMQ3JNTmNPaDNleXVxbGFyYm1qa2w3S2NyYkFFZG10MUNWcWs1RW9aV29xT3FKbHRr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Trump and Netanyahu agree to increase pressure on Iranian oil - Axios",
    "description": "Trump and Netanyahu agree to increase pressure on Iranian oil  AxiosTrump, Netanyahu agreed US should press Iran to cut oil sales to China, Axios reports  ReutersNetanyahu to discuss potential Iran strikes with Trump as Washington and Tehran resume talks  CNNTehran in the crosshairs: The dual US-Israel strategy pressuring Iran - opinion  The Jerusalem PostPM and Trump reportedly agree to ‘full force’ economic pressure campaign against Iran  The Times of Israel",
    "published date": "Sun, 15 Feb 2026 02:15:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1nN0hVWG1lQ0pIc0dGSkFTMVBjX1cxd3dsQlM0TlkzLVIzdFNBVlpvbzB6UElaRU1oSG9TcWd4eTl4QncxaHBrMFFoSV9RVzdpU1ZSdThwaS1kSHFYOTFnUkxlRDE2M01kejF4WjhwX0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Homeland security pushes social media giants to dox anonymous accounts critical of ICE - Mashable",
    "description": "Homeland security pushes social media giants to dox anonymous accounts critical of ICE  MashableHomeland Security Demands Social Media Sites Reveal Names Behind Anti-ICE Posts - The New York Times  The New York TimesOpen Letter to Tech Companies: Protect Your Users From Lawless DHS Subpoenas  Electronic Frontier FoundationOpinion | The Trump administration is using secretive orders to crack down on dissent  MS NOWA short note to Kristi Noem  Robert Reich | Substack",
    "published date": "Sat, 14 Feb 2026 18:39:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPbzl0aDNXNnppdEpsRGVpWFVFbjhWOHY5U3U2MXlzWDhDWDRBcjZiX2NMdHA4aVBlNWlBdXcwb1pvcW81QTZSdzViUTBGbGkyUzdDQU11NzRwdmJ0dDU4SC1Vc2NCell5VUQ3SW0ySzg0TlROUXBibXhJMnZXMG1tNFZ3YXRFVGlKRS1XYmVjVk5iMlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mashable.com",
      "title": "Mashable"
    }
  },
  {
    "title": "President Trump Delivers Biggest Regulatory Relief in History - The White House (.gov)",
    "description": "President Trump Delivers Biggest Regulatory Relief in History  The White House (.gov)Trump emission rules cut 'universally hated' start-stop feature in cars  USA TodayEPA boss offers forceful defense for scrapping landmark Obama climate policy  PoliticoTrump Erased the Endangerment Finding. Here Come the Lawsuits.  The New York TimesWe Wondered What Automakers Had to Say About the EPA \"Killing\" Stop-Start. So We Asked Them.  Car and Driver",
    "published date": "Fri, 13 Feb 2026 18:13:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQckczY3R0ZEgyTlJMZ1hjNkxmSlNDMldwZWdVNHNhR051NUdyM2RRS1dpRHNMNFN0aHhybHBJZVUyYksxeWdpRU81dVRYZHg1T1FwVUxDNmMxU0pGRHNVUVU0WEVjNVpETEJsX0xyTXhpWlBZV1dwbXQ4OTdKRThlcE9Balp2cUx0dXNFSVpBVWw3dVNkbVo2d0NXR2EtLXZiSUswSExJcEV1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "2016 video of Pam Bondi comes back to haunt her after terrible testimony before Congress - Queerty",
    "description": "2016 video of Pam Bondi comes back to haunt her after terrible testimony before Congress  QueertyOpinion | Bondi’s Incompetence Is the Latest Insult for Epstein’s Victims  The New York TimesDemocrats to Pam Bondi on Justice Department's Epstein files \"spying\": \"Stop now\"  AxiosOpinion | Warning: Listening to Pam Bondi is harmful to your brain  The Washington PostOn Epstein files surveillance, Jim Jordan struggles with the basics of hypocrisy  MS NOW",
    "published date": "Sat, 14 Feb 2026 01:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNOHlJUFRTZnFQY0Z2MThFT09GTFNGVUZ3T3VQS0FZdlJleXZXRDI1QWtKRnUzQTI0YTBDdk5mZDNwXzJtZ3U2bk9hYWdPYkQ0UGZwSEdHdkIwajF2T2kwVFNMSjN3Y1Zub0ozUWdwR1FPbHVUbmlMX0I0OTBxa3NLR0xTdjdlNnRBQkRJZThLd1ZwajVZZlNiRkxON09kNVlVMmRGNTVfajhaVEhXUy1NSDhEM18zNWowY1NrNTNUZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.queerty.com",
      "title": "Queerty"
    }
  },
  {
    "title": "Trump says change in power in Iran would be 'best' after sending 2nd aircraft carrier to region - PBS",
    "description": "Trump says change in power in Iran would be 'best' after sending 2nd aircraft carrier to region  PBSExclusive: US military preparing for potentially weeks-long Iran operations  ReutersUS sending second aircraft carrier group to Middle East, sources say  CNNTrump says change in power in Iran ‘would be the best thing that could happen’  AP NewsAs Diplomats Talk, Pentagon Prepares for Possible War With Iran  The New York Times",
    "published date": "Fri, 13 Feb 2026 23:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOdDhhcnNlTVN3UkRDOWhYTERGSmZKMnA1VmJFLUNMQmtEZENDeW96aGpUYlQxbVU4TDJJQmdSYkZCdUkwSEFuWVJMeU9VY0ZBR0lDcUNGVDdMVEx4bHhXcVZfY3MtVUVaUmNvOXFhUk80VnRhUFpDMy1YSEVxcFJhUGI1U0JzMDg3WXJSdGl1WktPalNfT0MtczVUQzUtNlZ6dzNwWkxrdElqVVJ3ZXNfRzNCLTlVUXJXRFZDVjZ0ZDhHVHBCVWY4NDZqY9IB0AFBVV95cUxPRmc0UzdmeG1qR0JQVm8tRnpCRERMZ3gtTWpOMDVIazNKWEtRZUpyblJpTUtvN0xUNmh6R3NkYzlSYWlJaFZ3Mmp1cnQ1cDBKMF9ERHNxX0lqNHczaXBOcnNBdENia1JvWGN3TGRZbko4UFRfNk1RREJpYUk0QXktY2F2TXZnN0RsTFl1cHp6cGtfcTVFLXdnSUNpbkZjTW1POHlMMjBna1BTY3lHNlJOVzdmQzQzdnhXMXczLXBnRmNXYjQ0ZTY0ZnRZaGF2WTZt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Congress let more law enforcement agencies to down drones. Then CBP fired a laser near an airport - Fortune",
    "description": "Congress let more law enforcement agencies to down drones. Then CBP fired a laser near an airport  FortuneInside the Debacle That Led to the Closure of El Paso’s Airspace  The New York TimesWhy is the U.S. government exploring using high-energy lasers near the southern border?  CBS NewsLaser weapon that shut down El Paso's skies was LOCUST system  AxiosFBI: CBP shot laser at Valentine’s balloons it thought were drones  MS NOW",
    "published date": "Sat, 14 Feb 2026 16:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNZkgxczZNOHNNSWtRcjYtZ3loTnJxX3B3QnlwVGhRUUNWZWdIdUk5UUgyUjQ2MXQyNldweXJnQ3BKWWxKX1E1QjNpOUYwMk9LYUhsZTAzalJ5Z0EwTU50SHktX2ZfOG44ZEt2ZjUzTl9vQUtKcWZYRDdvVUpWTlpidkRTZU1CQWo3ZzR2ZlB4TEJWTnhQWWNNZkwzYWlqTXIyRTlKWmN4YVZ3YVo5NUR5V0duRzNyX2pxRHRzOFJGVm56OFA3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Mike Lee’s Trump-backed SAVE America Act could disenfranchise eligible voters - The Salt Lake Tribune",
    "description": "Mike Lee’s Trump-backed SAVE America Act could disenfranchise eligible voters  The Salt Lake TribuneWhat to know about how the SAVE America Act could change voting  PBSCollins boosts Republican voter ID effort, but won’t scrap filibuster  Fox NewsHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsWhat is the SAVE America Act that mandates voter ID?  BBC",
    "published date": "Sat, 14 Feb 2026 13:01:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNSW9SNTBMeGdpd2FaeVAxMjl2SUM0aGk2WEtobWNVam5scmU1N2lJb1dTZmpST09hNkFZZHN5SXRoZHFoNDk3MGtHUzZrZUlmNHVScnRuOGJnU1lOVDA3Vmt3ekNpZno5dTR0RkxhMFAwakhoZi16ZEJfWDVmMktLLTVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "In Munich, AOC warns that democracies must deliver for the working class to stave off 'authoritarianism' - NBC News",
    "description": "In Munich, AOC warns that democracies must deliver for the working class to stave off 'authoritarianism'  NBC NewsOcasio-Cortez Offers a Working-Class Vision in Munich, With Some Stumbles - The New York Times  The New York TimesAOC's ap­pearance at Munich con­ference in­ten­sifies spec­u­lation regarding pres­i­dential run  Spectrum News NY1Trump news at a glance: Alexandria Ocasio-Cortez blasts president’s ‘age of authoritarianism’ at European conference  The GuardianRubio and AOC present dueling world visions at Munich security forum  MS NOW",
    "published date": "Fri, 13 Feb 2026 22:32:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQTXk5a3ZEcnNOMHBGLVVuM1ZkMF9zVzI5enp3LXdsMjB0TTg2NTZNU3NGRjJadUNVY0lMRnZuMmJyckw1UDVYMHBrd2xzMW9YYnhYclVIZnJReEJDVmdyclZwMnF2ZllLVnR1S0FMR1hlMUdQeWdtRTUzSHFmQkIxRlliZVZianQxNTZYb0RsdzVNdjVPUEZvdXNLTWlCX0kyU2xsdFRJT3ZtZGxtNkt4a2pNeGlHVHFKZU41MEVYanA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Judge gives US 2 weeks to retrieve student deported to Honduras while traveling for Thanksgiving - AP News",
    "description": "Judge gives US 2 weeks to retrieve student deported to Honduras while traveling for Thanksgiving  AP NewsJudge Orders U.S. to Facilitate Return of College Student Who Was Deported in Error  The New York TimesCourt orders Trump administration to facilitate deported student’s return  Al JazeeraAdministration ordered to return college student who was deported over Thanksgiving  ABC7 Los AngelesJudge orders deported Babson student to be returned in 14 days  WCVB",
    "published date": "Sat, 14 Feb 2026 00:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOLU41ZGI2dkNvN1pVR2VPaks3VC1RZ2RrMThZNG9sVkxxZDBxN2ZPd1MwaGtxNkhfQ0w2X3c0Y2JGNFM2dUxBZ0lZZ3NUXzlvUnF6N2dtMFZqV0RYTGw5b2lUZV9yUnlGS3ZoMlAxQlQyU2VTRFJlTW5ZZGJsUUxSc0ppcE94WkQ2VTlfLW5KSld3cnp5VzFhYUNXTUNnQ3RTZ3lKM3FoN0RHa1VqNlkzU25Rcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Walk for Peace Buddhist monks arrive in Fort Worth for homecoming celebration - KERA News",
    "description": "Walk for Peace Buddhist monks arrive in Fort Worth for homecoming celebration  KERA NewsView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 18:29:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOZl9YLWttOHJqYm9nOEZTTG56UVlGY1UxNFZwckQzLU5DOXRraGM0bFpsY19aUFRfMlNhUEd4OTJHVUdPajl3NXJmb1ZBSVVwc0dabWxhbTVXNGJEdzBfb2VlenExbTg5ZkFHVTlKMnZ2TEF5WkpsUmlwNVlBcGJncXhQWVBLckJFNDNnSXR2NUlaUWk4Sll6TDRPNE5pbUlNdmFQMTF6UmZRUlNMS1lvYzhiemJMaFhVcm5n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keranews.org",
      "title": "KERA News"
    }
  },
  {
    "title": "ICE to spend $38.3 billion on detention centers across US, document shows - Reuters",
    "description": "ICE to spend $38.3 billion on detention centers across US, document shows  ReutersOpinion | The Depravity of Trump’s Immigrant Detention  The New York TimesRepublicans Have Found the Real Victims of Trump’s Effort to Build Mass Immigrant Detention Centers  SlateAs feds eye a potential Orlando ICE facility, records show detainees might stay for 7 days  Orlando SentinelICE ramps up deportation push with 92,600 new beds in $38.3B expansion  Fox News",
    "published date": "Fri, 13 Feb 2026 21:05:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNTmpUSXhhaEp4cWZOZ1ZrRzdQSjBNZERrRUhmUEE3algxbWFzOFZuVlJJU2pxNVFkZV9vTDltUTg3aUYxMF9mNGFRSlc5UEp6TjRxYU1HT19nSVVMNGRUMkxNZVZJRkFHZDBvMDhOWnA1YTNDLTY5MmJnWDJXSFVDd3pyWFJZUTZVYXlfWkxUMjRMdDl4anE4S0hBLTh2MDZlZ3FKdzZLQTVWMGg5Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Kennedy is banning junk food from SNAP. Our quiz shows what counts. - Politico",
    "description": "Kennedy is banning junk food from SNAP. Our quiz shows what counts.  PoliticoSoda ban for food stamp recipients would cost South Dakota $248,000 annually, report says  South Dakota SearchlightSNAP junk-food purchase restrictions taking effect in three more states - see where  LiveNOW from FOXBig changes coming to Oklahoma SNAP benefits as healthy food waiver goes into effect  KOCOWyoming is asking the USDA to ban candy and soda from SNAP  KHOL 89.1 FM",
    "published date": "Sat, 14 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQZWZlem1sVzF2ZGIxeXRTeU5BYTRzVkRLemI4VUxtd3I1ZkU1S3lrR3BHeXNlYThzYU9wMGg2RG5PZGpoZVlhNjBMWC1EYnNvTlZ6enZ2cEsyN0YyN2VRV3dRZ0xPaXBfY2NOdHBJUXIwMmIzWWVzNjBTeFBxT3JJUTFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump Says He May Enact Voter ID Without Congressional Approval - Forbes",
    "description": "Trump Says He May Enact Voter ID Without Congressional Approval  ForbesTrump says he will issue executive order to get voter-ID requirements before midterms  CNBCTrump vows voter ID requirements for the midterms, 'whether approved by Congress or not'  NBC NewsTrump: ‘There will be Voter I.D. for the Midterm Elections, whether approved by Congress or not!’  Democracy DocketTrump threatens to impose photo ID for voters for midterm elections  The Guardian",
    "published date": "Sat, 14 Feb 2026 00:42:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQV2lOY3pfNVhZaGtpNVRnRFF3cGtobTF6VnVlbjFXNWVlbVhKQ25OZFJtWFF1VGNEajBpRm9aRTF0VkNFeDRXcnVFeUhnRWstcUxiMDZ4YmFXR01rcG4zM2tONFpMZUJwQ0VRZjRKU2ZtR09SMWVYYm1uVW1abVE1Zy16RmpSZmhVT3JDb1NXMFpKajVUaE5nakFqZGNiRHJ0WVltcGNVMTJxXzR5R2ZIN1BnX0ZEYVN2WEhxYlFEMVZGT29yUmVQSTFpbzN6UUZzU0xkMVBEbUw3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "'Remnants of sewage' including toilet paper, left behind after wastewater pipe collapse - WJLA",
    "description": "'Remnants of sewage' including toilet paper, left behind after wastewater pipe collapse  WJLADC Water forewarns 10 months of repairs for Potomac sewage spill  NBC4 WashingtonVirginia health officials warn to avoid contact with Potomac River due to sewage spill  WTOPVDH issues advisory for the Potomac River after massive D.C. sewage spill  InsideNoVa.comThe Potomac sewage spill is a disaster for river activities this year  Axios",
    "published date": "Sat, 14 Feb 2026 03:58:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AJBVV95cUxPY25NUjFRZ1BiNXhpcVVSZlFRbHZDd1hLNVlnOVg0a2UxS01GeDNxWm04OTdKd1Q3WHE0VzVIck5CSldVSEZyTDB3cDZvazlOa0tLMDJod0ZTWXFBM3ExaU5XOU5SZl9GTGxIZHFQY2tvaWNtQ01xU3drVmVqdklpcTZXYTN1UFVLUnFvNmVCMnVmcWNTZ2lBSnJJM1FHTDNLNDl4Y041Y0ZiM0p4TVZYOC1WdldHQTQtRTU3VFRSS2F3OVA2a21sUnJtdGcxbFNCTmh6QlJOOW83ckdsWU94NVZTcy1KTl9VUEoycDV2QkFVaVRWV1VScUxCU3dSWTd1TktfRVdrOEc5QjNJT3FlQTZkWXFRMVROWF9HR3RNZGJrWFF3d2ZDdTFWMEZCdllHNDU0X2JNclVleXIzQzZaMUVnQklwU3FPcXlOUjZkNE4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wjla.com",
      "title": "WJLA"
    }
  },
  {
    "title": "After court tells Trump administration to release funds, the massive new N.Y.-N.J. tunnel project gets $30 mi - NJ.com",
    "description": "After court tells Trump administration to release funds, the massive new N.Y.-N.J. tunnel project gets $30 mi  NJ.comTrump Administration Tells Judge It Will Release Gateway Funding  The New York TimesGateway gets $30M in frozen funds, with more to come  PoliticoGateway Tunnel project goes to court: Judge says Trump administration in compliance with court order on funding  ABC7 New YorkJudge gives Trump administration more time to unfreeze billions in funding for NY tunnel project  CNN",
    "published date": "Fri, 13 Feb 2026 22:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQVlo5Skg4V3pJTG9jLXdPVlhJX2E2bmtQQVdyaGNqUWNhUUl4Zkl0WVFUeXEyYkhpNm1OS2dWLWVMcGlUT0p3WU5SSTFNcGNrN3R5ZFJQaDZwZm9aRjJER3Q3QWNnQzhhYkVYYTBacWpCUVIySmRSWkJFSU1rRFpDa1NZRlhHVi1lZi1WQU1nVnJmUkhKbm5McHoySS05WWs2R1ZzUzdwVlNpMTV3NGR1by1wM3dTdjQ0Mjhoal9qeGRWZGszZWwzaXFzRDk0UWhDdjliY0NrRWhyMG1oREHSAfIBQVVfeXFMUGthdGhEcjVlVTNyT3U1ODFsSUM1WW1oTEUySXR1X3ZNSUxvWEEzckdNWk1iZWhZNnFWenBoYi1abVBhTHl1OG0zWE4wX0UyYlk1YW9DcEpvQzFUbUtMLV9DaG82ZmJmODF1b0NzSTN6WmxhUXlrNGhZM0lxTjJseGUwNFFwd2dUUzRxT1NndVh0bVo5VmhYV19fS3NhREdHXzBrWkdiVm5RLWVPd1RWZEF6UTZtTGpQbUg1ejV4YVVmWGNRWmF6T05mNklUdjBXdGg5cTRwTlZXUUpVZEVVcjdaaWlpU2Vkd2tsNmJTTkdhRnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Nancy Guthrie kidnapping investigation draws scrutiny as case drags on - Los Angeles Times",
    "description": "Nancy Guthrie kidnapping investigation draws scrutiny as case drags on  Los Angeles TimesView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 16:44:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUDBvcmtIYkdZQTBZV2Y3el9lWGNUa3BtNFZ0Q29KT0ZnMkpTLTdwN0l4TnpJOHRSVXBBLTdiRG11bU55dXQ3d1BxeEZoTk1fdFBhNWlqWWxVZHFqaGJVUWQzeXNKRmV0QmVmUXVjcWhDcDg0aVFtcjJQN3lVTWlHTEJqLXljUnlT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Don’t forget: All post office locations to close, mail won’t be delivered - MLive.com",
    "description": "Don’t forget: All post office locations to close, mail won’t be delivered  MLive.comWhat’s open and what’s closed in the DC region for Presidents Day 2026  WTOPIs Presidents Day a federal holiday? See full 2026 schedule  USA TodayWhat’s open and closed on Presidents' Day 2026  FOX 32 ChicagoBanks will shut down for a whole day in February. Here’s why  NJ.com",
    "published date": "Sat, 14 Feb 2026 11:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOb2NXbkNVclJ3WmdZTXZBVWRFTi1DX3NfZUtYZnFZODBJWWVBVG1NQWI0NUl2MWVBRHZWeDE0eXBEdmh3SlVNU0xMaGNxTTFicko3LXAzdmg2NGlDN2lCU0szdFhxamJ2WndYUXpLWDZNWnJZdmtUSVhZajZhVm9fWVE0OXQ1YkNwd1FjTkMza3pnRXoxcTVYUHBrRFZpUmE2cmZ3RGhWdWRRazJ3ZkFob2dSLWhMSUprZ3fSAc4BQVVfeXFMTVdkVUdsLWJIZ2ptTXJtUjBxSHRwbUlCV18zT21BSGMxOWJtWUYzenhGTm4yTG94cGNaSXRjdzJpd1VmNWdMMmF0ZHhTMHZ4czNTMkF3RGxfaFB6clVuRm1RaFFVWlpLaWJHdWxpanY4YXN0dmM0V3FVU1VmYmNNVXpNYjBYRnZpZ2lPVkFZeWpMRHBBOVQzUEF5Tzg4aVlJWVNOUm0zTXNXdkxnQmxZWWxUdmQyUldkUWtLY196NFd0MXRZWFBWa0dTYWRxVmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlive.com",
      "title": "MLive.com"
    }
  },
  {
    "title": "US military reports a series of airstrikes against Islamic State targets in Syria - NPR",
    "description": "US military reports a series of airstrikes against Islamic State targets in Syria  NPRUS army launches retaliatory strikes on dozens of ISIL targets in Syria  Al JazeeraUS launches airstrikes on dozens of Islamic State targets in Syria  The GuardianU.S. strikes 30 ISIS targets in Syria as it continues \"relentless military pressure\" on terrorist network  CBS NewsU.S. Forces Continue Strikes on ISIS Targets in Syria > U.S. Central Command > Press Release View  centcom.mil",
    "published date": "Sat, 14 Feb 2026 16:29:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA3VVFnZEZ6X21RZDg5TmNZZHU0REJTWDNoNGlMc2tLV3A2WkZSQUxxT0ozTzRjamJxR1VwdngzVENHSWNBaE1HWnI0STlQN2hyRWYtVG5scTZ0RTA4em5EMnNySDJFUmphZm1Uc2NVdDQxdjY0bXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Lindsey Graham Shares Blunt Message to Those 'Nervous' About Trump’s Takeover Plans: 'Who Gives a S--- Who Owns Greenland?' - Yahoo News UK",
    "description": "Lindsey Graham Shares Blunt Message to Those 'Nervous' About Trump’s Takeover Plans: 'Who Gives a S--- Who Owns Greenland?'  Yahoo News UKLindsey Graham to allies: Get over Greenland  PoliticoLindsey Graham’s message to Europeans ‘nervous’ about Trump: ‘Who gives a s–t who owns Greenland?’  New York PostTop Republican lawmakers spar over Greenland  PoliticoGraham: ‘Who gives a s‑‑‑ who owns Greenland? I don’t’  The Hill",
    "published date": "Sat, 14 Feb 2026 18:35:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOVUN0MUljM3VkR0JFVmF0ekNTTW9CajhjOTNwdFh5UjQ3STlpVHE0VWwxZzRuTmVrb2tId1ZnM1BxODVWOFYzZEo0Z1NxWjVCV2hHRjZ5ZHJ3NmRnLXgyTnBOWURFVVpwbXlaYjRxckYyajhpWGhCRTZiNWtfSkJqQjh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://uk.news.yahoo.com",
      "title": "Yahoo News UK"
    }
  },
  {
    "title": "Judge Boasberg’s Most Recent Decision - Civil Discourse with Joyce Vance",
    "description": "Judge Boasberg’s Most Recent Decision  Civil Discourse with Joyce VanceJudge orders Trump administration to help dozens of deportees return to the US  PoliticoVenezuelan deportee can return to US but fears repeat of ordeal: ‘I’m not over that nightmare yet’  The GuardianJudge says US must help bring back some of the Venezuelans deported to notorious prison  AP NewsFederal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act  NPR",
    "published date": "Sat, 14 Feb 2026 03:55:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE0tX28tVEcyRDlyMHkzR2dnYmpHZHBKcmFFZ2JYSC1tc3VSeWFDV093Z2otSEpCNmpuWHpoRkVUTGc3eTVTSnJrT1VCY3paUm5PVEQ5UjhqZ280c19vMmZFYmwwNG9GTnhBNWVzVUdHcFNmWFhVNnoyUjhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://joycevance.substack.com",
      "title": "Civil Discourse with Joyce Vance"
    }
  },
  {
    "title": "\"I Cannot Believe How Incredibly Stupid This Country Has Become\": This Trump Nominee Was Asked To Define \"White Culture,\" And Things Got Awkward So Quickly - Yahoo News Singapore",
    "description": "\"I Cannot Believe How Incredibly Stupid This Country Has Become\": This Trump Nominee Was Asked To Define \"White Culture,\" And Things Got Awkward So Quickly  Yahoo News SingaporeBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNDems plan to question Trump nominee on past comments on women and Jews  AxiosUtah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post  PoliticoWho Is Jeremy Carl, Trump’s Nominee for a Senior State Department Post?  The New York Times",
    "published date": "Sat, 14 Feb 2026 19:33:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPeUh5c2U5OVpONEpobjlTUHpLamJHNnJIOWwwR2lKRHgwZ2pPV25JLXo3MVRGd2xlLUtzcU5vS0x3STk1X3hQN2lkUkhLanZLNEFVWGs3ejNWb1l2Y0xJOGl4bkZpNUlHOWI2V2ZoMGdaYzhTQVlHX085bzhQb2N5M245V3FOQ1NI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sg.news.yahoo.com",
      "title": "Yahoo News Singapore"
    }
  },
  {
    "title": "Courts have ruled 4,400 times that ICE jailed people illegally. It hasn’t stopped. - Reuters",
    "description": "Courts have ruled 4,400 times that ICE jailed people illegally. It hasn’t stopped.  ReutersEven Trump’s own appointees are ruling against ICE’s mass detention strategy  PoliticoCourt ruling means Minnesota immigrants sent to Texas may have little chance of returning  Star TribuneAs Trump administration pushes for more detentions, immigrants’ options for parole shrink  StatelineOpinion | A Very Dangerous Ruling in New Orleans  The New York Times",
    "published date": "Sat, 14 Feb 2026 10:07:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPMlZ1NC1EeGtJVUFUSnJGYmlHM3ZrTFJCR2NrNmpQTEhIUXRkSTVXdDNVV0hEN29ybkFzQUJxLUUzTlJvRGhWd0laRVdfSjRmU3h4SnVUbDQyZ1E3Uy1qd3dKX0ctVmdJRV90a0R4WmJQbGh4NXlDYWR0bkJLUElBVFFuTGpURnBocmdaYl83LTZrT2stRFhscllmSThLSldiQVM3V0VCeVBHQ0lMV1dRc0tseVB2T3JpZnBBWjZJT0hQb19WZF93Zmlkdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  }
]