[
  {
    "title": "Person Detained In Nancy Guthrie Disappearance Case—Police And FBI Agents Search Property Rio Rico - Forbes",
    "description": "Person Detained In Nancy Guthrie Disappearance Case—Police And FBI Agents Search Property Rio Rico  ForbesPerson detained in connection with Nancy Guthrie disappearance  AxiosMan questioned over missing mother of US TV star Savannah Guthrie, after doorbell images released  Sky NewsPolice Search Annie Guthrie’s Neighborhood After Releasing Image of ‘Armed’ Figure Possibly Connected to Mom Nancy’s Disappearance  People.comPerson of Interest Detained in Nancy Guthrie Case for Questioning  Yahoo",
    "published date": "Wed, 11 Feb 2026 05:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNRlo3Y0hob0szZGVJaHBMR0pKNGdBQVFRNXdFeEswRzN1WXBlekp3RENnWDd0ME1kVmFRUDM2b2k4amdaeTczY1pNb1RfVjJZSUQtSnVfc05XcmpkUlFFSXZsU25fcXozci1uLVdFWGVyamtEWTJHdVBUZkFBMmpOMDg2Tkh1RC10QUJZR2QwRG5zRkdTaEhQY2VCYVJraEZxYWZreGJ0Ml9nVE40TlRpRzdfNXhJcm5JNTVGZFNIVnRUTmUyV3piNFlfdlFFODE2NXJBd3pRRW12TkxXbjFxYVFtcW9Ka2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "House Defeats Republican Bid to Block Votes on Trump’s Tariffs - The New York Times",
    "description": "House Defeats Republican Bid to Block Votes on Trump’s Tariffs  The New York TimesThree House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs  CNNHouse Republicans revolt over GOP’s attempt to hand Trump Congress’ tariff authority  MS NOWGOP revolt opens up lane for votes on challenging Trump tariffs  AxiosTrump Tariffs Face Rebuke as Johnson Fails to Block Votes  Bloomberg.com",
    "published date": "Wed, 11 Feb 2026 03:34:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcm9ibFhhOFBoenJkUVY4SXU0cURzTzA2NThrXzZydkttcld2QU9PSGlBRjZrZmdQejdtQ2xrbGRiTmpaTVRlQ2pMY0NZcmFWVmpiWm9OeE1kdkowVUppQWRvaG1GRDc3b25NUzdjWDNGT2xBVVl3R25UVmVUTTFQdllub2JDendB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up - The New York Times",
    "description": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up  The New York TimesA Minnesotan nurse saved my refugee family’s life. Four decades on, we watched the news together in horror  The GuardianPHOTOS: Anti-ICE Demonstration in Downtown Athens  The Red & BlackAlex Pretti was trying to help. I can't move on from that. | Opinion  USA TodayIn their first sit-down interview, Alex Pretti’s parents talked about memories of their son, and the nightmare of anger, grief and unanswered questions they have faced since he was shot and killed by immigration agents last month in Minneapolis. “He’s my first b  facebook.com",
    "published date": "Wed, 11 Feb 2026 01:08:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ZSGRhTjdtMGVYamwyaDJhTkZNMlkxU20wYV9ydmJrZHNmY1Q0MHFMOV9zMXFUUTZWM0ZycDU4UnAxb2dLdUVmYmpXc05tUkx6TFFJeVllR19FWUlTMl9oQ3ZBWExlSHFYRjRaWFN1NnN4YmtMY1d5VEtpZ3U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Bodycam video shows scene of Border Patrol agent's shooting of Chicago woman Marimar Martinez - CBS News",
    "description": "Bodycam video shows scene of Border Patrol agent's shooting of Chicago woman Marimar Martinez  CBS NewsBorder Patrol agents say 'time to get aggressive' in footage that contradicts claims against Marimar Martinez  Chicago Sun-TimesTop Border Official Praised Agent Who Shot Chicago Woman, Evidence Shows  The New York TimesBorder Patrol agent's texts after he shot a Chicago woman five times will be released, judge rules  NBC NewsMarimar Martinez shooting: Video released of Border Patrol shooting in Chicago  ABC7 Chicago",
    "published date": "Wed, 11 Feb 2026 03:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQcEdzOUFkYXZMWk1FckdEYWJmZldzMUMwYVFRWl8xNWxSOUhCQjluQXNyWDdOS01Hdm1rNklULWs4dXBVRzNZdUg4cTZBYjdnUEt0WUMzVmtNMmhxRHRvcTdtb1J0SkRrX1RfODhpODFfU1JCc0RIZ2FBcDR0SHhnUVRPbzBmMmNzWHR1WWNYNGZCeUo2bmVDX29TR3VOVVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "D.C. grand jury declines to indict six Democratic lawmakers - The Washington Post",
    "description": "D.C. grand jury declines to indict six Democratic lawmakers  The Washington PostGrand Jury Rebuffs Justice Dept. Attempt to Indict 6 Democrats in Congress  The New York TimesGrand jury declines to indict Democratic lawmakers who urged service members to disobey illegal Trump orders  CNNDC grand jury declines to indict Sens. Kelly, Slotkin for seditious conspiracy: MS Now  CNBCSlotkin slams Trump admin after grand jury refuses to indict Democrats over military video  Axios",
    "published date": "Wed, 11 Feb 2026 05:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPYlNfYTNoWUstdmd2Sk9oelp3Zkg4SWl6R2l0cVo0c2M3aXVlLTUyNHh0NGw3emZqSWZTSHVMNE9lcW1HdGVibC1uNGp3dlRhT2R1OWxkNE5ydm5ZQ002Zm1kZ2hkVmoyUlJEeFU2ZlZSLVNFUHJjeV9tMGRfOV8tQmc4OHpwSnNDZHV5eVo1X25jdC12a2EtNGxR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Who are the six men named in the unredacted Epstein files? - The Guardian",
    "description": "Who are the six men named in the unredacted Epstein files?  The GuardianJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC NewsTrump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosHouse Dem identifies ‘wealthy, powerful men’ DOJ redacted in Epstein files  PoliticoNew roadblocks slow US reckoning over Epstein as Europe races ahead  CNN",
    "published date": "Tue, 10 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcXZzUG8tUUdadGx5MU90ZWx2emRnRHpMLXkzcWdfQm1BNUlsUS01NHZ6VEt0SzI2LXNaZ0MwMm92d0RvWGtLYnZ0R1JSejhCYXdwckJMbm1MbUIyb0JwbjFvR19hb1FIRHBpb0wtVmlPamkwVE9RSW8tbzZXZDExU1A2eFdScWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump lights a fresh fuse with Canada over new bridge - Axios",
    "description": "Trump lights a fresh fuse with Canada over new bridge  AxiosRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesReport: Ambassador Bridge owner met with White House before Trump’s threat to block new bridge  ClickOnDetroit | WDIV Local 4Trump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free Press",
    "published date": "Wed, 11 Feb 2026 05:23:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNUWZMNHFnWF9vQ0ZtUDRIXzFhTG1zS2FPV1BnMGs2V2dDOUwyNmpRT2ZFM0pfVkpZY2l2RWViVDA3d2QtOVppazZnUGtSQUowZzV5c1V2Ym9NTHU0c1JXZW9VcXpvRjE2Q0FmOGh5SlhCemRmVldPVVVhVlFzYkM3SHJvRHQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too. - Politico",
    "description": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too.  PoliticoUnder-fire Trump commerce secretary confirms he visited Epstein's island  BBCLutnick and Epstein were in business together, Epstein files show  CBS NewsLutnick distances himself from Epstein, says he had lunch on his island  The Washington PostLeavitt brushes off Lutnick–Epstein heat with list of admin wins media ignored before ending briefing  Fox News",
    "published date": "Tue, 10 Feb 2026 23:14:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBaenVnUWNUWE5oNFVqZWw0MVJZXy1pRHg2aWxFMFZNOTZDMUlMN0FmMGs5ZlRMeUROa0dvckNSZmF2Y3paZGpnQmxicVN1US1DQXNKRy02eFRBcjg4azhySWl3YmtYUURoUlVadGtvaFM3Q2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Late Night Mines Trump’s Million Mentions in the Epstein Files - The New York Times",
    "description": "Late Night Mines Trump’s Million Mentions in the Epstein Files  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldTrump told police chief in 2006 that ‘everyone’ knew about Epstein, FBI document says  The Times of IsraelHalf of Americans think Donald Trump was involved in Jeffrey Epstein's alleged crimes  YouGovWATCH: White House won't confirm whether Trump called Palm Beach sheriff about Epstein  PBS",
    "published date": "Wed, 11 Feb 2026 06:31:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPeFlLRUM0VkpyczlmMS0yZGdqa0VDMFdVMVpaMkJHYmtSbzF4LWtZYzdlRV9RLXVZZ2lLSU5Da2NGWnZNNFVkaDl4eU4xSFdocV84cXdGOXVUMF9Zd1hTZlJaNUtpdGlJSFpOOTd1M0puWi10UXF3a3N0d3JaajNNSzdSNmVNcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims - NPR",
    "description": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims  NPRGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesFBI cited debunked claims to obtain warrant for Fulton County vote records, documents show  The Washington PostJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  PoliticoFBI documents show what led to raid of Georgia elections office  PBS",
    "published date": "Wed, 11 Feb 2026 00:37:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOempoOWp2elFncUJyS1VfWG9NTEV1aVFvN1pvV09jc1I5c3VQZ2lwV3I2bXBPY3RfVXpMTFlSTWtDelRsVjYyRzBibFhZSWtJNHFNV1hBQmF4NHpIQTVQdTRvdlhMSnRpejBZMTlwYkhsODZLSVRFOEdHazBDN3Q4Um1aRTF5b2UwSHo2bzAtTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Don Lemon hires ex-U.S. prosecutor who quit amid concerns over investigation into Renee Good's killing - NBC News",
    "description": "Don Lemon hires ex-U.S. prosecutor who quit amid concerns over investigation into Renee Good's killing  NBC NewsDon Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case  The New York TimesFormer Minnesota federal prosecutors launch private defense firm  MPR NewsDon Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe  CNNFormer federal prosecutor Joe Thompson joins Don Lemon’s defense team in church protest case  Star Tribune",
    "published date": "Wed, 11 Feb 2026 03:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNcEZRLWZVRTVPZi1XdkktN2J5ZjN4ZTE1NjBXRFZXTnEtVzJWR0l0T2RqaGc0VTVHek5mYWc0aTlFRWhSYVFINzB0d1U5U1ZTMHVzWVEwckltc0Z5RmhQZ3VCRlpmTURwQVVSYXJ4bVV3VG5TdUowemQyVEs1Z19UbnVNR3BUdm5CZzBqeFRmSFVFUEoyb3JPVEdXVHdnOG5nWUlURHZjT08zenNKZm5FekFXcHZTdTdRb2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Annual governors' gathering with White House unraveling after Trump excludes Democrats - NPR",
    "description": "Annual governors' gathering with White House unraveling after Trump excludes Democrats  NPRGovernors won’t hold Trump meeting after only Republicans invited  The HillDemocratic governors threaten to boycott Trump dinner over exclusions  The Washington PostGovernors to skip Trump meeting after White House invited only Republicans, source says  ReutersDemocratic governors pledge to boycott White House events after a Trump snub  Politico",
    "published date": "Wed, 11 Feb 2026 07:18:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5yZWJZZUlFRkRLVjNvZW5KZl8ySUJGc0RSVU1jYkNZU3NwVUlwdHVYS3dBZ1d5SXZWSVZUbDNXVHl1aE0xWG4yQmVZaXBKeFVqcnVrREdxbXhtLUs0dVRGY0hUQUdoN0NMSUF4dDBrSHNPTXBkUDZUVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "ICE chief tells US House agency is 'just getting started' - dw.com",
    "description": "ICE chief tells US House agency is 'just getting started'  dw.comICE and Homeland Security officials testify before Congress  BBCTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  Politico5 takeaways from the Republican-led hearing on ICE  The Washington Post",
    "published date": "Wed, 11 Feb 2026 02:18:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQQlg0TUVMcGNaZ210d0Z3TmdYMktRYVNXRjhTamZrNWU5blVkZDVKeXdJRU8tOUFSTTZ5NjRrRFoyYThpVkdkRFhOMXQwOEJBdXd3bFhLUlNuNk5VWXFIcGhTX1poaEg1ZmRtYm9GYjdIVm9oZTFzMVBPOHBoYUtROUhzd0tvaTVzc0xKZUZqd1lSQdIBkgFBVV95cUxQNjY3Vm1kaUxzVDhLXzRKeW1xdWg3ZmxRakZKSEs5V0dSRG8yZjllMTlVMHBLdVlmaFdWR3lrOXB0d3BoaGRvYlNuT05fX05VMThid0FWYmF0UURneEpWSThpM0dxbDFMTWk2YXZrcE92WUY4Rk5zaDFyTWRUdkdEZm52Nlc5bDJaeE8wQUtVYUxPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "EPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health - NBC News",
    "description": "EPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health  NBC NewsTrump set to gut U.S. climate change policy and environmental regulations, White House official says  PBSBehind the E.P.A.’s Rush to Repeal the Endangerment Finding  The New York TimesTrump to repeal Obama-era finding foundational to US climate rules  The GuardianOpinion | EPA is right to reverse Obama overreach  The Washington Post",
    "published date": "Tue, 10 Feb 2026 22:50:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQOXFkSFV2akM0aUEwUFg3c2d2anFDR1hwWDVsUWJTcFlsQU9oYjNyNEJReDMyWk0tcXZ4Rnk1bDZiM3VkeHZkX2kzLUd4d2ZGSlpZNnE1S3RSVkVoRFBqRmtvZHd5YnBHNnM5S2E4LXl2SWNLcFVLakxJVmI3aFdRR1pucUlzd01BSjRjMHRtbmxYZmd5N3lhdnJsOFpUMTJiMF9LSFdqMFlDNzJEWWJvX19nR3ZkUXk2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Sherrill endorses Mejia in special election for her old House seat - New Jersey Globe",
    "description": "Sherrill endorses Mejia in special election for her old House seat  New Jersey GlobeAnalilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage  CNNAIPAC Strategy Backfires as Progressive Underdog Wins Key House Race in New Jersey  The InterceptWhat's next in New Jersey's special election: From the Politics Desk  NBC NewsProgressive backed by Sanders, AOC pulls off upset ballot box shocker in Democratic congressional primary  Fox News",
    "published date": "Tue, 10 Feb 2026 17:43:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQWHdYZEgxYmdTaXVDcTF6akoteExrWjhmYTBlYXl3WVhSa0xadkNWQXg2UHpSbDJGR3A0UURoMXVHTkhGRmsxdFJzbVdNWEpDelQwWV9VTmM2VElENkRJanphTzFLRmxTek52ekZFTXhGRjktS2QwMm1VU05CU1NLUmZQeTl3OHF3QWsySUN2SldFUTFWQkc1N1V5R2x6Zy1yd1dRcmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "New Jersey Globe"
    }
  },
  {
    "title": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it - Politico",
    "description": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it  PoliticoTrump admin removes Pride flag from Stonewall National Monument  CNNNYC officials vow to fly Pride flag at Stonewall, after Trump admin takes it down  GothamistPride flag removed from Stonewall monument  AxiosGracie Abrams Slams ‘Demonic’ Removal of Pride Flag From Stonewall Under President Trump Directive  Billboard",
    "published date": "Tue, 10 Feb 2026 18:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOHJGakFVUFN1TzFTS2VYT2JoUGRxTy1YcVpKZkZLMmt0ZWNrUEx0bWh4aDBZNHpyRGxJNGJvN3ViX3FxMk9hSml3MDNCa0FBbzN2blBNVGFyYmM0bkxJSjhxa0VieHpielpONEFvV0hiT0NhQWVXRVZUdFNaWlItUDVzcU1EZkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "How this Trump-backed bill could prevent 21 million citizens from voting - Axios",
    "description": "How this Trump-backed bill could prevent 21 million citizens from voting  AxiosGOP Sen. Lisa Murkowski comes out against Trump's election bill, with a warning to her party  NBC NewsRepublicans are pushing to drastically change the way you cast ballots  The Washington PostTrump touts bill that could make voting harder for married women  USA TodayKey House committee advances nationwide voter ID bill, setting up 2026 election fight  Fox News",
    "published date": "Wed, 11 Feb 2026 00:32:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9YWTU4MGFtOGVYM3dDU19uX2NxQi1xLWVBUUJqdG5fYTBCc1dVOERhbE03MU9sV0gyUEM1c1VRVEl3RENOa2pFbHVPZDBORDk2OVFrV2pUbDItcXBDTks5Q0ZCNEFEUWVTcW9TUGdVUUh2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Capitol agenda: Democrats demand more from GOP on DHS - Politico",
    "description": "Capitol agenda: Democrats demand more from GOP on DHS  Politico‘Complete nonstarter’: Administration allies say judicial warrants a red line for White House in DHS funding talks as shutdown looms  Politico\"Absolutely pathetic\": The left rages at Dems on ICE  AxiosSome Advocates say Democratic Plan to Rein in ICE has No Teeth  The New York TimesBacklash to Trump emboldens Democrats on DHS and ICE as partial shutdown looms  NBC News",
    "published date": "Tue, 10 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPTk85b1NpajFrLXY3SjlHMU8tejZUNE40azh4R3FGN0llN3FZSXFGYUgxbXFsLVNFRTlvd0lmTWxXQjdEYWF3aldBcTEzbE16enh2TC1oc1hTRE1hM0c2SGM1UUw2WU5WT2ZqUi13Z0poMDdlOXZ1bFE0T09qZnMydVlaMHR3WkFvUkZLOTZKbldCa1E0QVZtS2ZqSHoybkJrUFFxQW9Sc01LcjNPTlBz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]