[
  {
    "title": "Black gloves found in search for Nancy Guthrie, sources close to the investigation say - CBS News",
    "description": "Black gloves found in search for Nancy Guthrie, sources close to the investigation say  CBS NewsThe Search for Nancy Guthrie: Live Updates  The New York TimesPossible tattoo seen in Nancy Guthrie video may help ID subject, former profiler says  Fox NewsBitcoin reportedly sent to wallet associated with Nancy Guthrie’s ransom letter providing potential clue in investigation  FortuneSearch for Savannah Guthrie’s mother continues with 18,000-plus calls pouring in  The Guardian",
    "published date": "Thu, 12 Feb 2026 14:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBWajBsSElvOVNyVkExWkplRXJGYko4X0lHcmdNR3dZSmVNYS1MVmdHbXJDNG4wbG9xNU81Sy14ZnY2cnVIUmlxeEdJalh1cXQ1YjU2SnJIZ1Nkdk5zUjFEZWxzdmZld2dEdGFnV3FyTFpBNGZfdVljd2xTZmZrd9IBgwFBVV95cUxOZXo0Wm9nRlJyc1ZidWttWm5PbGIzUm1jLXIweUN2RjNjN3pDQkpiYWRTMDZwWXF3NlV6d3FYYm1aaS1VQW5PNEE0QUFrak50alVzVXpoSnktVVptMnFXbEZvM3hxOVZGZnJhOXpFSEhRcWNqSmZ2UkNMVjNpeklPZjhqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump Live Updates: Homan Announces End to ICE and Immigration Surge Operations in Minneapolis - The New York Times",
    "description": "Trump Live Updates: Homan Announces End to ICE and Immigration Surge Operations in Minneapolis  The New York TimesTrump administration to end Minnesota immigration crackdown  AxiosMinneapolis immigration enforcement operation to 'conclude', officials say  BBCTim Walz says ‘long road to recovery starts now’ after Trump border czar says Minnesota immigration surge will end - US politics live  The GuardianTrump administration says it is ending its immigration surge in Minnesota  NBC News",
    "published date": "Thu, 12 Feb 2026 16:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1jbDljTndfSmMxMnJjV2tsaFd6cmlGUUo1UU9wclNObzhlbjlGcGpLZ3prVzY5SUJVR2lwVGNoTER6dGJIZXRLN3Q2Z0h4ZHJiaGxuc1FOMTNleDZvQ1lZaG1Edw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Exclusive: AeroVironment's LOCUST counter-drone laser used by US Army near El Paso airport, sources say - Reuters",
    "description": "Exclusive: AeroVironment's LOCUST counter-drone laser used by US Army near El Paso airport, sources say  ReutersBorder Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser  The New York TimesFAA lifts El Paso airspace closure after cartel drone breach, federal officials say  KFOXBreakdown between Pentagon, FAA led to flight stoppage, officials say  The Washington PostEl Paso rep: White House spreading ‘misinformation’ on airspace closure  The Hill",
    "published date": "Thu, 12 Feb 2026 03:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNbkc2SUhCRmVreXhXUDhMU01pVXdSR3pGUmNkRGJqQjJ2UEExcWh3V3JnRW5nZ1RIOTgtcWtBTXgxcHBJOFdRRUg2S0JLbTY2QlNoX09QQkhPdUhKbmE3bEx6cC10VVRneTBudmRTdTliaEZtY3BBSWxNS2N0WGJaQ2RWcVRFOG5XUEVKVDZrUzlUdkhBQkVVN0Q1bDFMYUZ0UjlfZS12bFBHbVRmSV9CN2RPQ0pCLVotMlNCdTdYYktwX2JVb1BMMWZuMW43b0R2UWVDOWNmZG0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Exclusive | Two U.S. Navy Ships Collide in Waters Near South America - The Wall Street Journal",
    "description": "Exclusive | Two U.S. Navy Ships Collide in Waters Near South America  The Wall Street JournalUS Navy destroyer, supply ship collide in Caribbean, injuring 2 sailors  Fox NewsUS Navy ships collide during refueling, 2 personnel injured  The HillUS warship, Navy supply vessel collide during refueling in waters near South America - WSJ  The Jerusalem PostTwo US Navy ships collide near South America  BBC",
    "published date": "Thu, 12 Feb 2026 14:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPYjI3YXJvc1RmZGYwR2FReWYybGo4TTdxaTlibWxyZFZQWHp4b0lzSzlZWlBrejYtMEwwdDFiUUdGSTl6MFluNllLNEV6M3UtcU1Ra2E0a1BmN2lYUXV4ZXM2YWN2enROTnhyWWhja21Fa2VSemQxUklWY21UMVdNWWdoMnVLd3BlUUd1WlVOU1lqSHo4RHF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "\"You washed-up, loser lawyer!\": Pam Bondi hearing erupts into angry outbursts - Axios",
    "description": "\"You washed-up, loser lawyer!\": Pam Bondi hearing erupts into angry outbursts  AxiosHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoLawmakers demand DOJ stop tracking lawmakers' Epstein files searches  NBC NewsLate Night Boos Pam Bondi’s ‘Bratty’ Behavior  The New York TimesJimmy Kimmel on the US justice department’s handling of the Epstein files: ‘A brazen cover-up’  The Guardian",
    "published date": "Thu, 12 Feb 2026 13:30:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOZXBHdUJSTjh1Tnl6UG41Y3VfaXlaMldnZGxGQVMySWVqTWJTcXRyYThnSVBPZThGR2JYQVNkc21RQjRWTTdyOFBJOWZUQ0pvcUp1RnRidjlYUjg1TFBPMW1lU1hraURlX0w3S2YtblI1dzB2LUdvaFJHSGZiWnJ0VS12WQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "New Jersey Gov. Sherrill signs order to limit immigration agents on state property - Politico",
    "description": "New Jersey Gov. Sherrill signs order to limit immigration agents on state property  PoliticoTrump DHS hammers Dem governor’s portal to track ICE agents: 'Encourages violence'  Fox NewsNew Jersey governor bans immigration agents from some state property  The GuardianNew Jersey Gov. Mikie Sherrill launches an ICE tracking portal  WHYYGovernor Sherrill Takes Action to Protect New Jerseyans’ Safety, Defend Constitutional Rights  NJ.gov",
    "published date": "Thu, 12 Feb 2026 03:53:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUU1xcm5mMmpyRDNpMVR2R2p4ZTZ2UUkwM1lhSFV1NVA5d1hrQzd0WDZKSEVkSE92b3N6RWVJZ0FuX0xlTzRFSHpPR0FHblZqeVFHQzIxYUtLcVJ6QjNReGlMTmNOSG5RS0JuSDVTekE2SmcyamVnNWNfSkxHVVRFUGZDQVRqVUc5ZjNVNUlSV1ROSF9ncUVCM01B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "House passes elections overhaul bill that could make it harder for married women to vote - The 19th News",
    "description": "House passes elections overhaul bill that could make it harder for married women to vote  The 19th NewsOnly one House Dem voted in favor of voter ID, proof of citizenship in US elections  Fox NewsHouse passes Save America Act, Trump-backed bill to impose new voting rules  The GuardianHouse passes GOP elections overhaul  PoliticoHouse Passes Strict Voter ID Bill, Amplifying Trump’s Claims of Fraud  The New York Times",
    "published date": "Thu, 12 Feb 2026 00:34:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNb1JBMTd6Ty1vN2l1RmVZNUI2ZVdza0NrbGc2akppdXlDb2JyV0lVbEFlN0JKRlZEMXRnc2l2QlJDQjRmTXZqTnBVLUNsN0M2Sm5fSkVWclNKZi0xLTNPWVZvcU5EYmtsdUJuSUFGUjlwblM0ZG15cjlBbFkzOGJmX1VGaTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "DHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times - Chicago Sun-Times",
    "description": "DHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times  Chicago Sun-TimesMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  YahooBorder patrol chief praised federal agent who shot US citizen in Chicago  The GuardianBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsOpinion | We Have to Face What ICE Has Done to Us  The New York Times",
    "published date": "Thu, 12 Feb 2026 01:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOYkduZE1oenJOdEgxcG9WemwzUTdGMTVoM0lvalhRV2hRSGtSdDlUSnFzNkYtN0pEMjcwQl9DRUJWVWF1R2JWa1k0dElfSlF5LUJ6cUdSRWxnUzRCaUZIelNEOUx6N09EbDBTTnl3NGJZRHRuRF93dXNXekFaTVBYUFB4WDVEQnEzMVdHdEFrQVltMktMWUp2ejVZWGZMZENraEdDeFJGZnJjTWxra1Z0cWdwRGJwTnZNQ3U4UjNqZU5kNFRTOWxoS2R1cVRkRXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://chicago.suntimes.com",
      "title": "Chicago Sun-Times"
    }
  },
  {
    "title": "Trump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering - NBC News",
    "description": "Trump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump Says He Will Now Invite Democrats to Governors’ Meeting  The New York TimesTrump allows Democratic governors at White House meeting after initial snub  The Washington PostWes Moore suggests race may be why he was not invited to gov dinner with Trump  PoliticoTrump says governors from both parties are invited to White House events, except 2 Democrats  CBS News",
    "published date": "Thu, 12 Feb 2026 16:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNQjFlc2Nqa0hGbVEzVnNDa1BzYTdMSjVQWV9rcUx1dFdxYmU1VzFHdWY1QUJNNURyZVQ3ZENIcFZxdzdWVGN2TklmZnRYX29KaXhvbmVPd3FvcGZOS2w0a2hxSHZlcm1OY0ZzTzJPdFlUUFdna3FlZkJySkMxMFJNSjV3YU11d3JIMmVLUlkzb0I2a1VDVGJpdkpTUmkzeEdVRWd6eTRHa1dlTEQ5SFgxOWRZVHRXcm9pYnYtdFFvRThmYU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Partial government shutdown looms as ICE negotiations stall - The Washington Post",
    "description": "Partial government shutdown looms as ICE negotiations stall  The Washington PostDHS officials warn about shutdown impacts  Federal News NetworkA partial government shutdown is about to hit the Department of Homeland Security. Here’s what that means  CNNCongress prepares for a Homeland Security shutdown  MS NOWHow Democrats aim to curb ICE without losing votes  The Economist",
    "published date": "Thu, 12 Feb 2026 16:31:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPUmdqcGpWRnZrZUp1SVhLV3lXYlhnNVlwVlFTd0E4aFk4Rl8xdjRwTnRsMkg1X2FfMWduN1RVWXNPSjBZWW1OTUYzdlRoVHNxMDJMT0lmYThvSmJlTGRXNjBDRENiYjZSaVpDRXVQSHR3UzZEOGcxdE4xVkxYMkcxTE5LVjBQaG8ydkEycF92VXA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Poll: Top NATO allies don’t think US helps deter enemies anymore - Politico",
    "description": "Poll: Top NATO allies don’t think US helps deter enemies anymore  PoliticoDonald Trump prompts global surge in people viewing US as a threat  Financial TimesEurope's growing mistrust of the United States  Le Monde.frOpposition to US has hardened in western Europe after Greenland threat, poll finds  The GuardianDonald Trump Drives Staggering Spike in People Viewing the U.S. as a Threat, in Canada and Europe  The Daily Beast",
    "published date": "Thu, 12 Feb 2026 03:40:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5mbEM3QTNQb3FHaEVtT19iVDc4LVd0WS1hRnp0X2pkX0toUzFac0JQdUhpN1R2S00yeVZaa3h3UVJ5dTkyNFA4Zi13emQ1TXNmY0huYnctNHRnd3dPWWMwTjRuWHNuMnlKOGNiSVdVdWFqYU1ORzd1OTFFNWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Greenhouse gas emissions will keep falling despite Trump's climate rollback - Axios",
    "description": "Greenhouse gas emissions will keep falling despite Trump's climate rollback  AxiosThe Secret Plan to End U.S. Climate Regulations  The New York TimesClimate leaders condemn Trump EPA’s biggest rollback yet: ‘This is corruption’  The GuardianOpinion | EPA is right to reverse Obama overreach  The Washington PostTrump administration set to revoke basis of US climate regulation  Reuters",
    "published date": "Thu, 12 Feb 2026 10:02:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPYlFNem1QbUNnaDhobDZUQzlHa0x5ME85Nld1V0J4UTlBdXhxdWp6TDRMYTJiRnVsWGxqajFDSmszTkowVDV5R2drX18tNEdaMUxrODl1VlJ0dXI5OU91YUtUdmd1VGFnUkZ3bE9iQm1RSGxGa1laSk9lN3dEeGYwTVp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "U.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House - The New York Times",
    "description": "U.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House  The New York TimesTop US prosecutor appointed to New York Albany office by judges is immediately ousted  The Washington PostJustice Department fires U.S. attorney in New York hours after judges picked him for the job  CBS NewsDOJ fires acting US attorney in NY who was appointed by judges  Politico‘You are fired’: White House pushes to quickly remove new US attorney  The Hill",
    "published date": "Thu, 12 Feb 2026 11:45:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQkpYNHhrYTVGV2xGYzRTRVI3c011TEk4WS1hVjdRMlI0RU9hTXhqR2FwamhDMWxnNWNYUWpXWDZ0bExGdkR2RE1oaFhvYmhiZDBoOG9QZTFKSldLZndkY3pLVkNFOVNLUTMyZHdoRVZzaFltTlVobWZKWUREaEhjbTlteHJodDJ5VTFj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Minnesota’s suburbs are an election battleground. Trump’s immigration surge is unpopular there. - Star Tribune",
    "description": "Minnesota’s suburbs are an election battleground. Trump’s immigration surge is unpopular there.  Star TribunePoll: Trump's ratings on immigration tumble as Americans lose confidence in his top issue  NBC NewsWATCH LIVE: Border Czar Tom Homan holds news conference in Minneapolis  PBSSupport for Trump’s immigration efforts drops sharply after Minnesota shootings  The GuardianImmigration once fueled Trump’s 2024 win — now sagging approval tests GOP grip on Congress  Fox News",
    "published date": "Thu, 12 Feb 2026 12:07:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOdS1MSlBUN0tBLXpVaW9CTWpKLUxIMVJEUXJqOEhEXzFFNllkdGVremRPckNVMFVJYWFCU2RDZi1IVUJpZlFaQldKdnowcmMzUXphb09uMW5sVFlJR1MwcnV4Q1BWeWZONzdpc0VGMXZHSE5uMjk3NWI0a2ZjM005bzJhclVkMzlGNmJJUzRJaUFyLVFQRDVwLWVRemlDcGNaWjBWcmtZTTJTTHFiek82aDcwX05MV0NLY1VQZjhVRjg4QzR0eWtoag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Anthropic Donates $20 Million to Super PAC Operation to Counter OpenAI - The New York Times",
    "description": "Anthropic Donates $20 Million to Super PAC Operation to Counter OpenAI  The New York TimesAnthropic gives $20M to group backing AI safeguards  The HillAnthropic is donating $20 million to Public First Action  AnthropicFirst look: Alex Bores, target of AI super PACs, rolls out AI plan  AxiosThe candidate at the center of the brewing midterm AI war unveils his agenda  NBC News",
    "published date": "Thu, 12 Feb 2026 14:33:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNVWZSQ19sTkNTaWp4cWVHMmdDS01GcTdmZE1DcXRjLXpNcW5zZVJGQjZ4ZmEtSWhDYnBWQnJZSHZhSWpld0tic3ZXUnMxYkZNWE9SUklrTWJUZk9lZWpKdmdvSlJWSS1XeHQ5aFVieEtlaEltUjZ6QzZPeVBfS3ZUQlhYQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Watch Live: Minnesota officials testify at Senate hearing on immigration - CBS News",
    "description": "Watch Live: Minnesota officials testify at Senate hearing on immigration  CBS NewsMinnesota officials decry immigration crackdown during Senate hearing  CNNTop immigration officials to testify before Senate as a potential DHS shutdown looms  NPRICE director refuses to resign under pressure from Eric Swalwell not to 'side with killers'  Fox NewsHouse Democrats Hear Accounts of ICE Treatment  C-SPAN",
    "published date": "Thu, 12 Feb 2026 15:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOM2ZaaFRIeWxQVmp5LUdjYzVMM0U0V05uSWNrbk5FTnlSLU9vNE50ci1zejVNMDRUVFh0ZjBSbDJfU2Z6NVVWV3JBa2xYT3ZVUEQ3Um5TS3RXdXA3VkJ5WDdSeGhtZmRWRlkyWjdCWWwycnpJMFBaWGpmVmxKSFVoQXptRmk4d1hwN1B5QlZWVzJ4THRENWlPWXhwb1XSAaIBQVVfeXFMT1dlS0FrRG9YZ2plckV2eGJ5cTlwNENvVW04SV9JNnUzb3UwYVRSVURNUTBscXRkZkhPV3puUzhGX3JQZkVYbHNBdnJObzY0bVl5dXVIdTJoUzZJZ2owdUhPRHl1ZWVydGNyVWJuaDh4Y2ZYM21aT3lpem5pZnpQd3BaRTVBcm1TQ3pzUE9feVRLMU10UzVuZ3VZNXRGQ2JoSXlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump orders Pentagon to buy coal power as the polluting fuel struggles to survive - The Washington Post",
    "description": "Trump orders Pentagon to buy coal power as the polluting fuel struggles to survive  The Washington PostTrump orders Pentagon to buy power from coal plants  CNBCTrump orders Pentagon to buy electricity from coal plants  AxiosTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York TimesPresident Trump Receives \"Undisputed Champion of Coal\" Award  C-SPAN",
    "published date": "Thu, 12 Feb 2026 07:14:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNbTVGY3BUdU83cndPdnNsdUl2aFBFNDVIa2lwMExZbUQ2bnhMMDFTcW0wcV9NckYzdjU2MDA1ZmhJaWVrRVlTcGFVeWZjNFN3Sl84QVNSb1h0cGpIRzVaWVVfVmQycXl4bUplZkM4N3ZBa0lkbkpGNmhCVE5ldFh5OTBzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "How the FBI might have gotten inaccessible camera footage from Nancy Guthrie's house - NPR",
    "description": "How the FBI might have gotten inaccessible camera footage from Nancy Guthrie's house  NPRLive updates: Family shares home video in honor of Nancy Guthrie as investigators comb through tips  CNNVehicles at center of Nancy Guthrie investigation probed as police canvas for truck, Ring footage  Fox NewsDoorbell cams draw new wave of surveillance fears  Morning BrewResidents near Nancy Guthrie’s home asked to check security video from 2 dates  AZ Family",
    "published date": "Thu, 12 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQQ29iUjhDXzdCVEpILWtzRngtWlJVeHhsUGRjay1QamhYVV9INHFzX0p3cDdjelA0QXBubEFPSUtJR0R3Ni1ocm83OWZVaF81dEJpdmtTYmtzWVZDcEdsUnpySzNWcXlRX3oxR3ZCb3gzc0VXdEk4WFlrSFU3ckpOZGF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "2 Mexican Navy ships laden with humanitarian aid dock in Cuba as US blockade sparks energy crisis - AP News",
    "description": "2 Mexican Navy ships laden with humanitarian aid dock in Cuba as US blockade sparks energy crisis  AP NewsTrump’s Threats to Cuba’s Oil Suppliers Put Mexico in a Bind  The New York TimesMexico Confirms It Won’t Ship Any More Oil to Fuel-Starved Cuba  Bloomberg.comMexican ships carrying humanitarian aid enter Havana Harbor  ReutersChile Agrees to Send Humanitarian Aid to Cuba, Joining Mexico  Bloomberg.com",
    "published date": "Thu, 12 Feb 2026 14:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNTWYxa2JkdG0xak9pdzlXYVJTa3EzRTJVOUVWcnBUeHVlN3JfZ083MV8zZ1FOYjRYb18zT0dnazVSWnZ1MFFIRG0wZFUtbnZoamxUTC1KdklwMWgyRjZ6ZG5zVTJsaVhCaEk4Wnh5bHNILUI0eHRDUEVnMWhCbWpLOUhDQzR4MDBRSVhwZ3NvaVFuMjhvb19tN1E0RHFoSVU4c3p2S29KS3lFY1Jx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump’s failed attempt to indict Democratic lawmakers, briefly explained - vox.com",
    "description": "Trump’s failed attempt to indict Democratic lawmakers, briefly explained  vox.comHow Trump failed in his latest bid to weaponize justice  CNNDemocrats are cashing in after DOJ failure to indict them  PoliticoOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington PostTrump's revenge tour falls flat in the courts  Axios",
    "published date": "Wed, 11 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOWUE1cHZfZzRFc3lsU0R4MDJUZXY5bjd2bXloWFYyRUdUeTJSV3pYd1Vvakd2OW82X05pQzAzcEx0T09VdVloX1M2Z2Q1emhuVlBrby1taFB6bVVQUUFrRTU2clItV2Y3MG9uQ0owd3RHdklUaDMwbDZvVHR3Z05MQjc0bF9WSGdaU0QyR2U5VUk1R1FJMElpajFacHpYXzVrWjlTNGpuR08zU1BNRFE5TUJ0N1Y1bXZiWFo2dHIyUEJPVnlBVGppTmRwSnBMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "States Say No Thanks to Trump Tax Cuts, Drawing Republican Fire - The New York Times",
    "description": "States Say No Thanks to Trump Tax Cuts, Drawing Republican Fire  The New York TimesNot everyone needs to file 2025 state taxes but most do. What to know.  USA TodayState Tax Trends to Watch in 2026  Tax FoundationTip deduction? Car-loan deduction? Depends on your state  marketplace.orgStates facing decoupling uncertainty  Bond Buyer",
    "published date": "Thu, 12 Feb 2026 10:06:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9QajhCTUtJSW1INHRkUllsQk9QX2xuRUVpbHhIeFdoQWFpTE1ldVFqTkl5SktRS1JhemRGcHNiaC1VcDVJM05FTVFjV1o1R2VjMzhaWUEzbjJXV2NYZkF0cFJuNndrMTVkWUt2aGpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "In North Carolina, a Tight Primary Could Upend the Balance of Conservative Power - The New York Times",
    "description": "In North Carolina, a Tight Primary Could Upend the Balance of Conservative Power  The New York TimesHelping Berger out the door  PoliticsNC",
    "published date": "Wed, 11 Feb 2026 21:41:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNUE5Ya2ltd19Sa19zRVVISlA2QktGeDl5RjlFNWU3VmRudFUxd0FObzFRUEQtSkstNVByN0RJQjQxV2lGVVpOa1QwYko0LXhsejZGSFlhX0ZkYXpqQVJhUTZlWVhEZWFFaHFBa3VYX1NRVjYteWZEdzhCVFo0MG5YbzdXeDNHMExvQ2JNTFVFZzhBZUN5ODJDVzFtRW0wS0JI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now - Axios",
    "description": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosNetanyahu leans on Trump ties as Israel heads toward elections  CNN‘Nothing definitive’ reached about Iran during Netanyahu’s visit with Trump  Al JazeeraIsraeli officials reportedly warn Iran's ballistic missiles could trigger solo military action against Tehran  Fox NewsTrump says no 'definitive' agreement with Netanyahu, US talks with Iran to continue  Reuters",
    "published date": "Wed, 11 Feb 2026 20:39:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA0QUd3U3ZWUi1wNmRKeXNoVWVDaExGTmlZQkRVcV9COTBWbEczOHBqRHdOak5icDhpVEJlLWFTNG1nUWFWMzJ4cFI3NTl2QmV2YU5TVGZId3pKeDloaGJnREo5YnlKdXJKc0txZ2l3T3dfenpXLTRNeU1aT2dmWUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Four States Sue Administration Over Loss of Public Health Funds - The New York Times",
    "description": "Four States Sue Administration Over Loss of Public Health Funds  The New York TimesTrump Administration to Cut $600 Million in Health Funding From Four States  The New York TimesDemocratic-led states sue Trump administration over health funding cuts  The HillTrump administration withholding public health funding for Illinois and other Democratic-led states  CBS NewsCalifornia, other states sue over Trump administration’s latest cuts to HIV programs  Los Angeles Times",
    "published date": "Thu, 12 Feb 2026 00:45:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOaUtPVXJJemcxd3NleWdKSzZsT3l5SzF6WWNkN2hYV1BYejRoVnR6dVQ5SGpRSWFDdXhBNE9tZGpFZS16a0ZJcDFvUDNDa25KWlo3YUZzZnF3TlRlZWJuMWNpZ3lodmZkSXMySzlfZG1RMU5XOE5waXQzS1VULWpRT3R5WnBwZDhFVE0w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Hochul’s no-tax-hike stance gets an unexpected boost from Mamdani - Politico",
    "description": "Hochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoMamdani’s very first Tin Cup Day (as mayor)  City & State New YorkMamdani Expects Wall Street Taxes Will Ease NYC Budget Crisis by $5 Billion  The Wall Street JournalMamdani Finds Allies, and Skeptics, in Albany as He Asks for Funding  The New York TimesWorking Families Party on 'Tax the Rich'; City Council Oversight on 'Code Blue'; Universities and Democracy; Where Do You Get Your News? | The Brian Lehrer Show  WNYC",
    "published date": "Wed, 11 Feb 2026 21:53:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNGdNdTVQUkFDd0ZkU3ZlT1lsMU91SVc0OGtFcjFqMVF3S2pxOVQwMU56TkpPLWRrZnJnck1ZYnZLdVg4dW42WEVpdjhTbmVyTUtTTVdubGQ1YW8xODE3RklmOWQ4d05ZRU92ZHRIUkw4ZGtqSjJodHI0SDBCWUNFS2R2UWwxcXV0YzRzd3BpQW1QR2J4ZzExcGtjY3BSenByUFpRQkJISmZOcTBueVYtTk93dzk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "1 dead in crash involving Iowa Lakes Community College baseball team - ESPN",
    "description": "1 dead in crash involving Iowa Lakes Community College baseball team  ESPNIowa Lakes Community College cancels classes following deadly bus crash  KCCIIowa Lakes Community College baseball bus involved in fatal accident  Radio Iowa1 Person Killed After Bus Carrying College Baseball Team Crashed and Landed in Ditch  People.comBus carrying college baseball team crashes in Northwest Iowa, serious injuries reported  KTIV",
    "published date": "Thu, 12 Feb 2026 03:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPMUZ5VkxmdVh1Ny02dmNGMnhVMHk5cFpENmVaVzdPNGZqVWNDUkhZUHpCSHhTXzV5dFVwa1A3c2JjU0J3MEU5TXpNR1ZYVzRxUzNPeWJiemEtMFh6VU16UnE4OTNFTG5pc3FxZGhfTHozZl9zajFFNmNWbm5RN1RRSkV5R2lhUzVuZjI2MTdzXy1SMk9fZHRFN19acTkyY1JscEdicElLOEdFUkYza1p4OVJiT3hMV1gzSXVUQUtn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "San Francisco Teachers Strike Day 3: City’s Schools Stay Closed as Negotiations Drag On - KQED",
    "description": "San Francisco Teachers Strike Day 3: City’s Schools Stay Closed as Negotiations Drag On  KQEDS.F. teachers strike: Schools to close for 4th day, negotiations slow  Mission LocalLurie wades in as teachers' strike roils San Francisco  PoliticoAll SFUSD schools will be closed Thursday, superintendent says  KRON4San Francisco Teachers Walk Out for the First Time Since 1979  The New York Times",
    "published date": "Wed, 11 Feb 2026 22:51:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxPQUc3VEVGOEhRTWttTHcxREhrMkMySjVfSlhPMGJRQi1sdjQ1M1FpUlctdkYtYW9BMHAwR0RVQk9kcW0zMllJdm1FMzlVaVNTZWlnZXRfU3RQTUwtRUhsZEZuYmw0aFFzaFBtSmdxVUEwUDFQbHJBR2lIaUJQblZTZmhfazFWLVBDX2JBR21mcFFYcWh0UTlUYVVzTEs5MTRtdl9VcmhzZkRSNjVVS19BWUNZZFhHc0ZOZGw2cg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "These monks' walk for peace captivated Americans. It ends this week - NPR",
    "description": "These monks' walk for peace captivated Americans. It ends this week  NPR‘We show respect': Police officer goes viral for greeting monks with a bow  NBC4 WashingtonMonks bring balm for America’s wounds as Washington cheers peace odyssey  The GuardianWalk For Peace Concludes Washington Events, Adds Final Day In Annapolis Before Return To Texas  The BayNetWatch: Monks finish 'Walk for Peace' in Washington DC  BBC",
    "published date": "Wed, 11 Feb 2026 22:13:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQX0MxaWRHTEd1MU41al9kSExpZkNDUEF1TGtPOUo0ZTlMemtXZDlmMWxPRDBEWk1tR1hkcVJnN1RQQWkxSVp6d3gzRTUtaGlDQ3FWVzhSNmtUV0FKaVFOZTBQNjl2S0JvUlZPZjdjbmFVRTZZZTBnbDU4V3ZCR1czeDRYazY2R2pJX2JER1FzdFVqVDhhZmZHV3h2YnVtZGZWeGo0VnN4V2txdGNsSUExa1c4cHVOd2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Senators introduce first bipartisan effort to curb utility bill hikes related to data centers - NBC News",
    "description": "Senators introduce first bipartisan effort to curb utility bill hikes related to data centers  NBC NewsBill would hold data centers responsible for energy costs and environmental protections  Chicago TribuneIllinois lawmakers propose POWER Act bill to regulate data centers  ABC7 ChicagoNew package of energy bills would impose moratorium on data centers built on Mahomet Aquifer  WCIA.comSpringfield reignites fight over who pays for Illinois' data center boom  Crain's Chicago Business",
    "published date": "Wed, 11 Feb 2026 22:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNMlB0bTRNZndzSWFUamMyYTJTN2NWejR2UkJTZVJmaE1lVUY4QnJFYXk0N3ZZcldXRDc4UjVYd3RKcm8wd19QMHAyeTNPaW1kX0NZTFhWSTdzNVZfUUR3V1MxRFUzUG1sR3ZJWmF1cGJTcHlwYXUwc1p0a0d4ekx6c0IzeWFyNGJnMmJmRmEzUFktOHhFV2lzNVkzRm1RaFRSZ1N5QVZ5Vk1mVDl2SkNpYzBuZVRZNmY2a254VEpuZmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Gun accessory company to pay $1.75 million to Buffalo supermarket shooting victims - NBC News",
    "description": "Gun accessory company to pay $1.75 million to Buffalo supermarket shooting victims  NBC NewsView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 08:12:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPMGR5eE1pTlR1eWVwUzlIQWcwZHp1VzBDMkhXdUFMMGVjeTdUS3lraE9Ic0ZzczJOM2p3Y1BZT2FHbFpDbU9YUTY0WHJHVmwxODNWMFFIWHU3OUZYdTRGR0JWRFU2bk5wR0xTXzJfbjVadUFmWUV2OGEtVkp2MkZHTV9DelViWnZ3Vm5mT20yU21vWGdhOUdDSEpQR2hIRnFnLWYyZS1sQWd0R3dLUzdtcGNTZDF6dFV3Zmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  }
]