[
  {
    "title": "Live updates: Nancy Guthrie’s disappearance and latest on person in video - CNN",
    "description": "Live updates: Nancy Guthrie’s disappearance and latest on person in video  CNNWhat stands out to experts about the surveillance video in the Nancy Guthrie case  CNNBREAKING NEWS: FBI releases images of subject in Nancy Guthrie case  KVOAInvestigators wrangled video from Nancy Guthrie’s Google Nest camera out of ‘backend systems’  NBC NewsNew activity in crypto wallet tied to Nancy Guthrie ransom note  AZ Family",
    "published date": "Wed, 11 Feb 2026 01:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWExYblhTQlNjMEI5Y0lkcnlNNmFZSFY4cGVjVVdYVFZsRHcwVDdqNWRNZnZaTkx0OVdoY1hJSWhiekhVQktLYmRhdmdUN2I1QndhN1c2blRpMmxodEh3c1JhQXFTMVo3LXB1VzEtd2xXNHMzRGxLdW13OXEyRTR4MmZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "ICE And CBP Heads Refuse Questions On Alex Pretti And Renee Good’s Deaths In Heated Congressional Hearing - Forbes",
    "description": "ICE And CBP Heads Refuse Questions On Alex Pretti And Renee Good’s Deaths In Heated Congressional Hearing  ForbesDemocratic congressman Ro Khanna names six men appearing in unredacted Epstein files – live  The GuardianTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoICE chief forcefully defends deportation campaign as scrutiny mounts  The Washington Post",
    "published date": "Tue, 10 Feb 2026 18:35:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxNZk01S1ZDZGZtbmdUVXBzZV8ySUhOUXVGVDdqcmNJZEp0M3FnY1FfOFpVclRuWEZkeVItcDlFWS04SGJpRnBUNTFZcVdab0F1SDI4Q3NZVFl5OVVyZWNZRnNIbFNDNlFIT0U0VWhuOGpmRHhsMzNmTU1OanRUSGktMlk4aHc1bG82RURwbFFGc0VVc0hZZ2ZkRUxhZktFZnhPN0ZuWmJqTW0zcy03NDhQZWg4UHRZQW00Ykt2YWYwRW5NcXVoVVpuTmFLbEdHWHhCc1BjeWVTM0dody0ydjhtb1FtSjg3Q2ExM1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "House Dem identifies ‘wealthy, powerful men’ DOJ redacted in Epstein files - Politico",
    "description": "House Dem identifies ‘wealthy, powerful men’ DOJ redacted in Epstein files  PoliticoTrump administration latest: DOJ un-redacts more names in Epstein files after pressure from lawmakers  CNNWho are the six men named in the unredacted Epstein files?  The GuardianTrump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosOpinion | The Epstein Files Are Coming for Keir Starmer  The New York Times",
    "published date": "Tue, 10 Feb 2026 19:56:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQWjE3UHdxaklLdlJ3ZzZ2X3Nya3phWVV6VnFmdUp2VUtQeDhSRi0wU3ZFNlZhTFRhamJBU1hXdlM5amJWNk0wb1VXZjlpUnlvSmtzMFdwTXlTVEdKOGdETHB1NGhpcHhhZFlHbjRPRU9XSHNPaE9udnRhdzBfaFZ3VXlHSTFhNlduX0xkaHRKVUxEQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Annual governors’ gathering with White House unraveling after Trump excludes Democrats - AP News",
    "description": "Annual governors’ gathering with White House unraveling after Trump excludes Democrats  AP NewsGovernors won’t hold Trump meeting after only Republicans invited  The HillDemocratic governors threaten to boycott Trump dinner over exclusions  The Washington PostMd. Gov. Moore uninvited from White House bipartisan dinner: 'Blatant disrespect'  FOX 5 DCDemocratic governors pledge to boycott White House events after a Trump snub  Politico",
    "published date": "Tue, 10 Feb 2026 19:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNNVVWaEoyc1hIS0w2cXM5UzlOLXBPQ0p5cVhTeUtmQ2JSU3JoWnZLbDV1akxMUzhHajlIcF9ySWJEWTZzdUVaZi1vQWFLS3Q1WG9keV85Y3ZtdFVtMWRSOXlmUENnZFR3Umc1anY0QXpTaFRIUjFDMTdoRUM1ODVKaGNPUlh4UmRQQjhaTnd2WENtNHpHYW1JWWljZXFBVTNKYTU3aW96aGRBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed - NBC News",
    "description": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed  NBC NewsHusband charged with murder of St. Cloud politician's daughter  St. Cloud TimesMinnesota GOP governor candidate’s daughter killed in St. Cloud stabbing  Fox NewsMinnesota gubernatorial candidate Dr. Jeff Johnson's daughter killed in St. Cloud stabbing  FOX 9 Minneapolis-St. PaulCharges filed against suspect in fatal stabbing of daughter of Minnesota governor candidate  MPR News",
    "published date": "Tue, 10 Feb 2026 20:45:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNV0ZfRFhCMjlEUkNWbS0yRVZSSXZlQ1FlOG04TXFWTVI3czdxRTkxbHZLc1VDQ3FLZ1N4cWFTU2RvZjRsZlQ2dlAtVFl1Ny1ac1JfVmFKY1VlVVg3MFhUeXppc1BKZUxQZDQtZUk3LWJac3hwNFN5Z1hiTGZaeUI1bkJrMk1XMXltbjI0ZzR4SGhHc2hJbUdYUFN2UDFKNjBqd0s4UW9wYjBmMUJTUmVJdERvdEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Lutnick Acknowledges Traveling to Epstein’s Island - The New York Times",
    "description": "Lutnick Acknowledges Traveling to Epstein’s Island  The New York TimesUnder-fire Trump commerce secretary confirms he visited Epstein's island  BBCThe White House is shrugging at Lutnick’s Epstein ties. His foes are too.  PoliticoLutnick and Epstein were in business together, Epstein files show  CBS NewsHoward Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties  ABC News",
    "published date": "Tue, 10 Feb 2026 20:13:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQa1lpeWE4QVEza0VfWGVZNFE0Q0t5S2RGV3FMR2hGMlJZRWJUaTZBZDAtaFhuRVVOaGpTVlM5eDZVUC1XOVIxVFZuVmd2V3dHUHYzektTSDllMDBJdnVTM1VJczFuenYxYWRXN1JVZXkzeWttNS1KRkNyYXFScDVNcGpWN3NObzJXbEREcmk1dk9KVkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Fact check: What Trump got wrong and left out while threatening to block the new US-Canada bridge - CNN",
    "description": "Fact check: What Trump got wrong and left out while threatening to block the new US-Canada bridge  CNNBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressWhat Gov. Whitmer said in response to Trump’s threat to block opening of Gordie Howe Bridge  ClickOnDetroit | WDIV Local 4Rick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit News",
    "published date": "Tue, 10 Feb 2026 23:35:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBRNmdUM2VHQ2RSY3k5VTJGSFRMNzZVUE5hcTVvUThYMkJHc3owdGtSZlgtWnNnM2JmOXRGUWNCZi1IM3c2YmNpRzlDbDc2emlSb3ZCSVM1bmpweFZtV2R1eGFvRUxocDFFaHpBakNsRjZsUXJoU0taNkVUNV9pQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "FBI cited debunked claims to obtain warrant for Fulton County vote records, documents show - The Washington Post",
    "description": "FBI cited debunked claims to obtain warrant for Fulton County vote records, documents show  The Washington PostGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  PoliticoFormer Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit  CNBCThe FBI seizure of Georgia 2020 election ballots relies on debunked claims  NPR",
    "published date": "Wed, 11 Feb 2026 01:40:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOX2RSTWRJZGM0bEZsdDVNZzdnd3BiQTRPWGQ4WmFURUFFV3JXM1NrbGY0bm9kbndmU2NGWWJYTHpRckRrYkFpbXFGVEZ2TGdoM0trZEJmQjJEcWNNYjBsNXBBV0tscWZfRk9admVmY2JCUmdkd0FGaGRqZFFzdk9rUUtPMmZEQnlPR2JSYVAwTlo3RHJ0cGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Malinowski concedes to Mejia in Democratic House special primary in New Jersey - NPR",
    "description": "Malinowski concedes to Mejia in Democratic House special primary in New Jersey  NPRAnalilia Mejia Declares Victory in NJ Race After Her Main Rival Concedes  The New York TimesWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al JazeeraProgressive backed by Sanders, AOC pulls off upset ballot box shocker in Democratic congressional primary  Fox NewsAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of Israel",
    "published date": "Tue, 10 Feb 2026 18:42:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQaFRqMXBtUnhOc1IybXpKWDZxbDFuNW5Uei14dXJKTGxycFRXUmJHYjhZZlltSHdLbDdVampxWFpQTXlrU0hWQWxWMXVqNTZHMDRSejhxMnNvT2lMcWVBUnByQ081VHVyTDRGbFRneEVDd3BsMHVIODFDMHFiR2prYU8wSkxxNzBy?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Immigration Judge Says Rumeysa Ozturk, a Tufts Student, Cannot Be Deported - The New York Times",
    "description": "Immigration Judge Says Rumeysa Ozturk, a Tufts Student, Cannot Be Deported  The New York TimesImmigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say  CNNCourt rules government can't deport Rümeysa Öztürk, Tufts student who criticized Israel, her lawyers say in filing  NBC NewsUS immigration court blocks deportation of Tufts graduate student from Turkey, her attorneys say  ABC NewsRümeysa Öztürk’s deportation halted as immigration court ends proceedings  The Boston Globe",
    "published date": "Tue, 10 Feb 2026 14:24:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaFJCT3FxN0ZJaVoyRmh3ZEJKSm9EalE0M3d1bEZFNUVxbUF6WTBIb3U0OExISndBM2VReHp3SlN5SER1c1IxY2dvek1jVjlLUUpOVTBGNGlxZGotSVIyYm5BMHFjSW04cW5yVlgzTzNENlBsR1hmcS03aVFta3AwSDFZYWM0Ukc1WFpXNEptZHpzdzQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Dan Osborn cancels fundraiser after co-host’s Epstein link surfaces - Politico",
    "description": "Dan Osborn cancels fundraiser after co-host’s Epstein link surfaces  Politico",
    "published date": "Tue, 10 Feb 2026 23:04:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQN2sxdjhBWkhGRWFvOXpkVUs4Z0RsWUxaeXlyMkg5Szg0X2Naam9VZ1RKZWViTE9GeXFSbWNiODJNeTJHWnJ5MllVVkFIWGZacFlxUTY2dTJqUGs5OXZid2ROdF96NHVpWDAwOXVLa2Z1eW4tcXF2VEdPQjFjRmtYWkFrdzdBNU5hTl9LTnplQ0tBb2hqVWxwb1JVaG9GUFpuLUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump EPA set to repeal scientific finding that serves as basis for US climate change policy - AP News",
    "description": "Trump EPA set to repeal scientific finding that serves as basis for US climate change policy  AP NewsTrump set to gut U.S. climate change policy and environmental regulations, White House official says  PBSA Campaign to Revoke the Endangerment Finding Appears Near ‘Total Victory’  The New York TimesEPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health  NBC NewsTrump to repeal key ruling allowing regulation of planet-heating gases  The Guardian",
    "published date": "Tue, 10 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNNnpBUk90WWwyN3hUWHN6bWNiWWxiZFRGeC1vSVBjQUx0NW5rdzgzRENxTHpmRW05UHRkRTBscEZzdUVkN1FPaWlFZVNpSV83OUhWNFZxM2FjMVRZQ2szS0R5bEYwT0h1SlROZXVHLWYxdUhaT1lWdGMyWXpESERTbzFDOTJSUU8zdk1uQW5sS3N4TmhsSDc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Pride flag removed from Stonewall monument - Axios",
    "description": "Pride flag removed from Stonewall monument  AxiosPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesTrump admin removes Pride flag from Stonewall National Monument  CNNTrump administration removes LGBTQ+ Pride flag from Stonewall national monument  The GuardianNYC officials vow to fly Pride flag at Stonewall, after Trump admin takes it down  Gothamist",
    "published date": "Tue, 10 Feb 2026 19:56:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQUi16OWFfUTJtNzMtRUVYMnFGLUNTdjVKNkhvM1huUVpPc25tNW82b1Nxck1JSHdZUW5TV2RBVHpQdGY5eTY3QThMd0tCclhnMmZjMFNiaWZrN3Y5OXVtMDJ3QUlNNlktaDdvWjF4c0Y5R3dEOEVCSWRqTzhxdmtfY2xka3JRbDJ0aVg0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "House Republicans Again Seek to Stop Time to Avoid Vote on Trump’s Tariffs - The New York Times",
    "description": "House Republicans Again Seek to Stop Time to Avoid Vote on Trump’s Tariffs  The New York TimesJohnson says it’s full steam ahead on tariff vote ban  PoliticoGOP anxiety over Trump tariffs tests House Speaker Johnson in upcoming vote  CNBCGOP lawmakers threaten to rebel on Trump tariff vote  The HillGOP mutiny forces House Speaker Mike Johnson to delay vote on key piece of Trump’s agenda  Fox News",
    "published date": "Tue, 10 Feb 2026 21:44:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcm9ibFhhOFBoenJkUVY4SXU0cURzTzA2NThrXzZydkttcld2QU9PSGlBRjZrZmdQejdtQ2xrbGRiTmpaTVRlQ2pMY0NZcmFWVmpiWm9OeE1kdkowVUppQWRvaG1GRDc3b25NUzdjWDNGT2xBVVl3R25UVmVUTTFQdllub2JDendB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Jeffries slams Republican DHS offer as ‘woefully inadequate’ - Politico",
    "description": "Jeffries slams Republican DHS offer as ‘woefully inadequate’  PoliticoOpinion | How to rein in ICE without undermining its mission  The Washington PostDHS Shutdown Looms as Senate Democrats Reject White House ICE Deal  The New York TimesDemocrats unify behind a hardball strategy on DHS funding  MS NOWDemocrats reject latest White House offer on ICE reforms with Homeland Security funding hanging in the balance  CBS News",
    "published date": "Tue, 10 Feb 2026 15:58:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOYlBvbTFwaFV4dUJUcHQzdk5JUFpsNV84N3NXY2owb3JYYmN5eURSdnpKcXdxNG9UbXVEMEx3UFk2NUZMVk02Y29udzhWbC1wUlJuczlMNWRpVncybFN0cnAyM2ZfMEFIMXVISFJQSHJCaHNuQ3Fad1NXN00tUkxfMnc5T1FnVjZIenNMeEpwNnBTTDJlTDEtb3pmTnRicmRvWG92WFVpQUtXUUhpamZ4cjZLM0h3VVJoM0diTlBlYmU5UHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Judge rejects Trump administration's effort to obtain Michigan voter data - CBS News",
    "description": "Judge rejects Trump administration's effort to obtain Michigan voter data  CBS NewsMichigan Judge Rebukes Justice Department’s Effort to Obtain Voter Data  The New York TimesFederal judge dismisses Trump admin lawsuit over Michigan voter rolls  Bridge MichiganFederal judge rules DOJ can ‘no longer’ be trusted in voter roll crusade  Democracy DocketTrump-appointed judge dismisses DOJ attempt to access Michigan voter data  The Hill",
    "published date": "Tue, 10 Feb 2026 15:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQMHJKWXFpQVJod0NIY2p1bU9nb3p4OG9qTDUwV0RDN01NUzd5Mk9QSDZxcllwbTcyOVAyR3g5NnozS2FBTVEzWUZuenA1RnNBR0M2Rk9fWGdicDFyVXlRek1oRTBCQ3BaSWVUb2Y2RXNjZUg3SzJJd3o0YXlJX1U1SG80bTM3M2ZrTWZMc9IBkgFBVV95cUxPQkRJdVJseDcxQlFQUy1CYjhaTTE3bDZhZzR0Z1B2blFJZE9XMHZqZmEzWUJHckpwYkNnVS1IN2l3cFFhek5OTkFDRHliSUhjb1k3bEU1eDdzeUVJVmdhQVFMY0JkTXo0aFlRTmU4RzJ3TnRYQnFoMERUdFJ0eVB6SlAwRHVjUXJ1cnZrYWExbXMwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Don Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case - The New York Times",
    "description": "Don Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case  The New York TimesDon Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe  CNNFormer federal prosecutor Joe Thompson joins Don Lemon’s defense team in church protest case  Star TribuneDon Lemon hires federal prosecutor who resigned over Minnesota probes  The HillDon Lemon hires former Minnesota federal prosecutor in church protest case  MPR News",
    "published date": "Wed, 11 Feb 2026 00:28:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPbzN3amVoM1dCYUFoOFJYZ3JoNklpWVI1ekJPU0lQQ2pDT1pyMDRHeTlvTGJGdjYxcll5c2luTlJfNzd6WFhxdHVFVXpkNTFKWFBwcE5HdFNxeEVrVU9zcElBOEZKcWlwRndfbnl4aHFHLVVKa1IzcnlmYUZESXdGUEhWbUs5RE1CYk5hZWZlMDM4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Former Palm Beach Police Chief Said Trump Told Him ‘Everyone’ Knew About Epstein in 2006 - The New York Times",
    "description": "Former Palm Beach Police Chief Said Trump Told Him ‘Everyone’ Knew About Epstein in 2006  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldTrump told police chief 'everyone' knew about Epstein, FBI document says  ReutersWATCH: White House won't confirm whether Trump called Palm Beach sheriff about Epstein  PBSEx-police chief said Trump told him in 2006 'everyone' knew of Epstein's behaviour  BBC",
    "published date": "Tue, 10 Feb 2026 20:53:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBCbGVuaGQwc05ZN3d1ZGc2MksyQUp5VXczMk1jWjFkZkk2LUtxenNkWGE5X1RlVU04Ukl0NEJkTXNCVHR6QVRkX1BueEpweTg0WDFleFZEVnVzQWtZaUlfcjBybmNod2xJbTk3OEdiLTMwN00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "How this Trump-backed bill could prevent 21 million citizens from voting - Axios",
    "description": "How this Trump-backed bill could prevent 21 million citizens from voting  AxiosRepublicans are pushing to drastically change the way you cast ballots  The Washington PostGOP Sen. Lisa Murkowski comes out against Trump's election bill, with a warning to her party  NBC NewsTrump touts bill that could make voting harder for married women  USA TodayNew SAVE Act Bills Would Still Block Millions of Americans From Voting  Brennan Center for Justice",
    "published date": "Tue, 10 Feb 2026 18:33:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9YWTU4MGFtOGVYM3dDU19uX2NxQi1xLWVBUUJqdG5fYTBCc1dVOERhbE03MU9sV0gyUEM1c1VRVEl3RENOa2pFbHVPZDBORDk2OVFrV2pUbDItcXBDTks5Q0ZCNEFEUWVTcW9TUGdVUUh2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "A 14-year-old girl described being zip-tied during Idaho raid, sparking fresh questions about ICE tactics - CBS News",
    "description": "A 14-year-old girl described being zip-tied during Idaho raid, sparking fresh questions about ICE tactics  CBS NewsA Raid in a Small Town Brings Trump’s Deportations to Deep-Red Idaho  The New York TimesPro-Trump Town Stunned After ICE Raids Leave It “Nearly Destroyed”  The New RepublicACLU’s Lawsuit Over ICE Raid at an Idaho Racetrack Could Be a Game Changer  Mother JonesU.S. citizens and legal residents sue over aggressive immigration raid at Idaho horse racing track  AP News",
    "published date": "Wed, 11 Feb 2026 01:22:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNVUdURW93eHBKR1FvSEtfMU42emdkSEJxd0J5eE9ucENGZm9wdE8tTURkRVRKNDA2dGd2bUJfR2RGOUdyVEk5N2NBUnFkcElxU2tfeTlvYzFQQnZzT3E1Z29WWmhRXzVtWXl4T3oxamZGVHkxSzNCMF82WUNZQ3ZTTldqY3lHVzZKZHFF0gGQAUFVX3lxTE5FLWV0MUo3SjdFRFgzckRWaDJaNkNzMWcwYVk2TlRFLXh1Zm1rdGxzZFpvRmpycXN2ejFWaWctaE1MWUJuZUU5cElnOENBNzF5QWt5NmlhcG1FOEtoaUMwVE55VzR2b3Q5RHRqcERIX1NvdWM1a2tib205OWlIVjFZdG1GWUN4WnQ2RlRiZVBadw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Gov. Tim Walz says federal immigration crackdown in Minnesota could end within days - AP News",
    "description": "Gov. Tim Walz says federal immigration crackdown in Minnesota could end within days  AP NewsView Full Coverage on Google News",
    "published date": "Tue, 10 Feb 2026 21:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQZkhCTVgzYjE2T3BRcU1sWXFnUGJiTXc5SUZKdVYweHlwRFBpbkttVWItWjBGbkFGYmt5eFJ5ZE5VdElySG16TFF2WVpsYjR3RmdRbTJmaDFaYzkwUy1INGdYbnBiWjcwX1RQZ0NQVG03Qkt1ZVFRazViY2J5UEk0cVJGT3JoVGJ5elBkRkZIWE1FX0syV2NkYVRqOWxiSy1tcjh5c3VRTEhoQl9L?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  }
]