[
  {
    "title": "FBI releases description of suspect, increases reward in Nancy Guthrie case - NPR",
    "description": "FBI releases description of suspect, increases reward in Nancy Guthrie case  NPRFBI releases description of suspect in Nancy Guthrie kidnapping  BBCFox News True Crime Newsletter: Ransom deadline passes, key evidence emerges in Nancy Guthrie case  Fox NewsFamed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case  Austin American-StatesmanRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOA",
    "published date": "Fri, 13 Feb 2026 20:52:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQaHlXMVBKakdGMEZyY2xBTklCMnpNX0RZR3ZEcm5hMW91UDlDZTRVV1BfelljWElpSHNfcWItYy1TX3FDMzYtZGtGbmdxY2JuSzJPYUN4REE1Z0taek83dEs4UzBVQTQzQ3A4XzBUWUpCWTJmalhCbTg0WXphRHBEajdiU0ZLX0hCSGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Partial US government shutdown could mean airport delays, travel groups say - BBC",
    "description": "Partial US government shutdown could mean airport delays, travel groups say  BBCA partial government shutdown is about to hit the Department of Homeland Security. Here’s what that means  CNNDepartment of Homeland Security Faces an Impending Shutdown  The New York TimesA bipartisan effort to save health subsidies failed. Will ICE reform be different?  NPRWith Congress gone, much of DHS is set to run out of money after midnight  The Washington Post",
    "published date": "Fri, 13 Feb 2026 18:44:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1uSjZiRkRfUGZxeTkzWGxObmtLZDcxWldfaG9CWDhIQmczLUN1aTc5NlRzR2dyZ24xSHZGNG1mVy1QSW56NnJWZzJ3NHBpVmtpZlhuakl0MGNBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "DOJ drops charges against 2 men accused of assaulting ICE officers in Minneapolis, citing new evidence \"inconsistent\" with complaint - CBS News",
    "description": "DOJ drops charges against 2 men accused of assaulting ICE officers in Minneapolis, citing new evidence \"inconsistent\" with complaint  CBS NewsAgents Suspended After Their Story of Shooting an Immigrant Falls Apart  The New York TimesFederal officers may have lied about shooting of migrant in Minneapolis, officials say  BBC2 federal agents placed on leave after appearing to make 'untruthful' statements about violent encounter in Minneapolis  NBC NewsNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 13 Feb 2026 20:35:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTk4xZW54bFpVRzRhRFhJVFhNLXQ3UTkyU0xFaUI0d2VJWkpOZXdENW9wWnh6MGlabTlHdHN3c2JFWmZud1liYm1uUFNzaUQxZVpndFlCNlI3R2E2b1J5YkliZE0zOWJBRG13a3Y3NlIzbjQya09tVF81bHdOeG5wZHdrSnhqcUM3MjQ2dkdXSUFTVlJTMTZvTNIBngFBVV95cUxOdVdrRzlxX3o3bVdyNmRQUWVJSF9jdVFLTS1ITXdoQU1WVVdCdTQtV1pYaEdOWVg0aFdwTmpEUmtxUnQ2YTRQUU5PUTVQRFY4OUpfdE4yQXpHdXVscDB1eXE4QzEzNW5GOGJZWmNkam1rUzNLTUpQNTEwSERrVkplaVpFN2FNX3piX2c5Rk10Q2JNckJ6cUFIVnI0ZFQzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "ICE plans to spend $38.3 billion turning warehouses into detention centers - The Washington Post",
    "description": "ICE plans to spend $38.3 billion turning warehouses into detention centers  The Washington PostTop House Democrat says Republicans’ latest offer to fund DHS is ‘unserious’ as shutdown looms – live  The GuardianICE Plans $38 Billion Expansion of Immigration Detention Facilities  The Wall Street JournalICE reveals $38B plan for immigrant mega-jails  AxiosOpinion | ICE’s warehouse detention centers run up against NIMBYism  MS NOW",
    "published date": "Fri, 13 Feb 2026 22:11:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUFdJa2JLQ2pCdHM2Rkw5WWpIZmFVOGx6NERrY25fcF9NWG5SdTRLT2Y1QUNEREhNN3RkekJZQm5LeENERlM0b1FXOE1WaU5JVTBBZ3hYS3VWaGZWd3p4U19lSWc5SUZ6d1VRWjlOSGhFTHdLRFNlTkZYbTdIcWRURERyWjZIem5GT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "description": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress  PoliticoAfter letting Trump abuse it for a year, the legislative branch shows a little pride  CNNIllinois Republicans weigh fealty to Trump as president’s agenda faces backlash and shutdown threat  Chicago TribuneShifting Republican Support and Congressional Dynamics with Trump in 2026  БуквиDeep red Republican breaks with Trump as president's popularity plummets  Alternet",
    "published date": "Fri, 13 Feb 2026 16:44:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTVoxZjhUak52TTZtZFQ5c0s0b2tHRnRmYkpTdWVZZVRfcmNXY3c0czBSZG1sQjgtaTBtb1NiREFkX0VDYWxfTEdueUJZV01qUFlIUld4MXlwTUZLT2JHRi1wTGZOM2RWbGJ2V0UtaXFyMUNVV3BpYi1nOXZDdHZFWDI0UDZqZGVrXzctSmlhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Don Lemon pleads not guilty to civil rights charges after Minnesota anti-ICE protest - The Guardian",
    "description": "Don Lemon pleads not guilty to civil rights charges after Minnesota anti-ICE protest  The GuardianThe Don Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon pleads not guilty to federal charges stemming from church protest  CNNDon Lemon, others plead not guilty to Minnesota church protest charges  CBS NewsDon Lemon in court Friday in connection to St. Paul anti-ICE church protest: What to expect  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 13 Feb 2026 21:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQbF9LbXF3VENoSFpYU2JqV3g4S1h1dWk3cTBzS0l4aVJtUnZNUUJMbGNKTUMzT0NEVVlXU29yU1h2N2h3bHQ0ZWN2Ujd2Q3NUV1ZpUzFpUEt0YWdtM0RwNzJHYUVpQVU4QUpXSk5KcXpfTF9HcHUtcVlnZzdSTnhlR1lwZzJXcUJ1ZTkyeVROazhBQU5DZU1oa2ZUbGVQamluVnp5Sw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Au Pair Juliana Peres Magalhães Sentenced to 10 Years in Banfield Double Murder Case - The New York Times",
    "description": "Au Pair Juliana Peres Magalhães Sentenced to 10 Years in Banfield Double Murder Case  The New York TimesAu pair who plotted elaborate double murder with Brendan Banfield sentenced to maximum 10 years in prison  CNNAu pair sentenced to 10 years for her role in double killing  The Washington PostAu pair gets 10-year sentence for scheme to kill lover's wife and another man in Virginia  CBS NewsBrazilian au pair faces sentencing in scheme to kill lover’s wife and another man  AP News",
    "published date": "Fri, 13 Feb 2026 20:08:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNS3ZmOWNSbTU3bjZZSW5KRmtSV0JoQjlNdk8tTEtYWHlsRm9HSDR5aFlLczdWUE1qUm1WOHNWYjJQbm4yd3VoaG03SG40NWFQdE01M1BreFVTMWFNUEh0ZWJYRk0yOWFqUUZ2T1UyS05rMEYzMGFyY0IwU3lSTnpGaEdMNnduN0dQZGJ6ZXYwNXF0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump administration deported some migrants at a cost of $1 million each, Democratic report says - CNN",
    "description": "Trump administration deported some migrants at a cost of $1 million each, Democratic report says  CNNUS paid $32m to five countries to accept about 300 deportees, report shows  The GuardianU.S. spending millions to send migrants to third countries, report says  The Washington PostDemocrats say Trump's foreign deportation deals cost taxpayers millions  ReutersUS Spent $133,333 for Each Deportation to Third Party Countries  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 11:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNbEhzMFJ6T0EtdkxOTmM3ZFVXQWpITElxbXlVTkdHUGFkUUlodXU1dTRSLVMyeURCUkwzbDRfNS1ld1B0S1FfMEFLN2x6eUZ5Vllxc2hocnpRR0pLLWxranlIcE1hUUNqaUhDeFZEMnoyS3NaeFU0VWVVcUdUZ1Fkc1hNRHNIY0pzdWF2c05YYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "description": "S.F. teachers strike is over as school district and union reach tentative agreement  San Francisco ChronicleSFUSD fumbled the teachers strike  Mission LocalSan Francisco teachers strike ends after reaching tentative deal  AxiosWhat SFUSD superintendent said about her pay amid teacher strike  KTVUSan Francisco Unified School District and union reach tentative $183 million deal to end historic teachers' strike  ABC7 San Francisco",
    "published date": "Fri, 13 Feb 2026 18:16:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZTZ6MHI5U2dfRHpQdS0yWGRxRk9vbnlESVgyQ0RDQWlXUG9nend5QnhnaXNSR0N1V2JPRGN5NmNHdmdjc1NPcmplZXRSZ1RpVUU4WjFsd0wwZVc5anlmbGZjMk1vZzVDMG1rcERuN3pkZm93RWNzTEhhekVvNldPRjhtZE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "A look at false claims made by the Trump administration as it revokes a key scientific finding - AP News",
    "description": "A look at false claims made by the Trump administration as it revokes a key scientific finding  AP NewsTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesHow dangerous is Donald Trump’s “endangerment” decision?  The EconomistTrump administration moves to end \"universally hated\" start/stop feature for cars  CBS NewsHeadlines for February 13, 2026  Democracy Now!",
    "published date": "Fri, 13 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPcktVTzgwMHJYVFhXdlVDRmplUXA4N1J3NjZVQlJuQlpWcW1aZEd0X1l3a3NERVIzOTVTSEhHVEE4a05iMzNDOW1WYkpxRGxEMkREOHdkUTVyMzFIOTVwYkVBQ2V1bVJTZktmbWRGeTlVMjdYcVhIU0hwQkpldmpBVEhKTnkwZXVYT2tGQW5vQnlQZlFxVWFhWVVoTkJOU3o0V2tpaURQZFBya1FFNGRtZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Virginia Supreme Court allows redistricting special election to move forward - NBC News",
    "description": "Virginia Supreme Court allows redistricting special election to move forward  NBC NewsThis crucial state is the latest battleground in redistricting war between Trump and Democrats  Fox NewsVirginia court allows Democrats' redistricting vote in their plan to counter to Trump  NPRHow Virginia’s top court might decide Democrats’ gerrymandering fate  PoliticoVa. Supreme Court paves way for Democrats to add four seats in Congress  The Washington Post",
    "published date": "Fri, 13 Feb 2026 16:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQdEwxQ2ljWTlJZmZibUFXY3hGcXNJeTBRVURZbXkwY0pKZ21OZW9QTTU4UVpOY2xFVG8tSjdDZFdGZmg4eG1oZ09Kbml0dVJva1ZCa1ppVVEyNjFHc3B5ZmluNWx0R2dxUnVNS1QwSDBnUnZ3X1ROb3ZLVHVIaGtqV19oVGFlOHAxYW5Oc2QzY0NOdDFZWFdSU0RRbTRHS1czeU5fMFlrTm1KNFByekRsY1RnV2FUUDRuUmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law - NPR",
    "description": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law  NPRFederal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesCalifornia, other states sue over Trump administration’s latest cuts to HIV programs  Los Angeles TimesFour states sue Trump administration over cuts to public health funding  ReutersTrump's CDC is canceling $600M in HIV and STD funds to four Democrat-led states  Scripps News",
    "published date": "Fri, 13 Feb 2026 18:18:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQazdJaTROOTRYMThGdnp4NjJjQmZHWFR6bWRqSWp1eWVQQmwtUG1qc2ZxTHZlV0hnNm5Nb3kxbXZKbnh0cTl3dHJaR1h3VWNjZldQeDludGpSZGRaZElMUWFlM1N6b3Bka1RMTkNlNTduMGdxeVpMSFAtb1ZOVWJERXZmRVA3SzlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump’s Minnesota Retreat Points to the Power of Public Anger - The New York Times",
    "description": "Trump’s Minnesota Retreat Points to the Power of Public Anger  The New York TimesThe News Roundup For February 13, 2026 : 1A  NPREnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticBannon on ICE Minnesota withdrawal: ‘It’s just not gonna wash’  The Hill",
    "published date": "Fri, 13 Feb 2026 15:03:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPTVQxYVFkSUpldDVZSmdwOUROYVFqT0pkS3RneXpmVHpMeHA5d0d3V3EzVlZmamtZaHdFM2c2b1otWUtYSUNoTnVCaDNqUlJFRW5ldFZvZW1Pakd1cmVZY3laLVRGY2dWRmJVWnY5NjZrN1JlOGVhWUdNby1zbGxwWF9zUGRCSl9YMXl3RXRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Newsom to world leaders: 'Donald Trump is temporary' - Politico",
    "description": "Newsom to world leaders: 'Donald Trump is temporary'  PoliticoNewsom tells world leaders Trump’s retreat on the environment will mean economic harm  Los Angeles TimesAs Trump tests alliances, Democrats with 2028 ambitions offer reassurance at Munich conference  CNNAOC accuses Trump of trying to usher in ‘age of authoritarianism’ at Munich conference  The GuardianNewsom Takes His Anti-Trump Arguments to Europe During Munich Security Conference  U.S. News & World Report",
    "published date": "Fri, 13 Feb 2026 16:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOMlRYSEF1dkFMYm1XZ3VlMEpyQWE3WFRLblhhMEZrbHZOLXU5RUNXLXZmR0IwRTNMZFBEUS1MNkFJUTdJQUFfcjZ2OXVubjdMWDNEa19pTzNyeS1OcldMMWl3ZUtWcU5oVzBncWxzT3AxMWgzLXMtdmxPTXAyS0tFcktSLTdQVzAzdlVDQ0l2azI1cjFLSi1ILWdKU3JLelVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "18-year-old sentenced to life without parole for fatally shooting 5 in North Carolina - CBS News",
    "description": "18-year-old sentenced to life without parole for fatally shooting 5 in North Carolina  CBS News18-Year-Old Gets Life in Prison for Shooting That Left 5 Dead  The New York TimesLive updates: Austin Thompson sentenced to life without possibility of parole for killing 5 people  ABC11 Raleigh-DurhamNorth Carolina teen who killed brother and 4 neighbors in 2022 attack sentenced to life without parole  NBC News'It's what we were hoping for:' Families of victims find closure in mass shooter's life sentence  WRAL",
    "published date": "Fri, 13 Feb 2026 17:37:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNR2s0dWNqTGl4MnozRlprdlBkc0s5RHJEblVma1F4enVyb0xQT1FjSDA1ZWZvenktRGZteG1HWGN4bnY4YjhHVzVadHdMMUthSVVxYnRCTUtiX3BaM0ZhUmMtQ3pQZjFKSHE4QkpEX0Z3VXE1aW1za2s3TVd6TnVFRHVlRHQzMmREeU1jaDZEV2ZiRGw1RTgwUFppeFRkcHQwSzJ3ejlyMVTSAa4BQVVfeXFMTmZjUi11MEVUbG9VNVhuYkRCZ2haU28tOGFvdG44NWNZbVRIU0dWQkVqdXF3by1SVjRjeWw4c0VHdE9ZU29RRDd4X0ZDZThMWXExNTBUc1M0SnpObXFYdGttaUt5VHFDd0dfRDJ6SmU4UVZzVnNEQzBSeG5hVFUtY200X2VaY2owZmxuRXBlVnNPQUNxd0oxUXBrVVoycTFUQUw3V1BlNzdoNlBrdWRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "White House, RFK Jr. shake up health leadership after controversies - The Washington Post",
    "description": "White House, RFK Jr. shake up health leadership after controversies  The Washington PostTwo top aides to RFK Jr. leaving HHS as part of leadership shakeup  CNNRFK Jr. shakes up top health department staff  AxiosPresident Donald Trump Scrambles to Crack Down on RFK Jr. Chaos With Major Overhaul  The Daily BeastTop aides to RFK Jr. will leave posts  Politico",
    "published date": "Fri, 13 Feb 2026 21:05:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNngyWjBaNHE2LTJ3UzJGeWF4U2NIWUo4Tk11N2ZxQk5MRGwtZGJ2cGU3UUt5R0tPNnpVazFPRElweVJZX255UVlzNWYwMzViNUk1bG1iSlJ6T3p6MTkyd2FzNy01UDYzTUQ0VHUwYjUtZ2h4cFhnNlNDZ2pKQjlLVHc5N242ay11eDUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump sends second aircraft carrier to Gulf amid Iran threats - Axios",
    "description": "Trump sends second aircraft carrier to Gulf amid Iran threats  AxiosU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesTrump tells troops 'fear' is powerful motivator in difficult Iran talks  ReutersU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street JournalTrump says change in power in Iran ‘would be the best thing that could happen’  AP News",
    "published date": "Fri, 13 Feb 2026 12:53:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE4tWC1WNV9tSUhBVE1LSUFEbmMyeEVVTEw4Wkw4MVhiU0tmU0tEbnVLYm14WVctcXg0bm02b3dCeEtWM0h5QWRZem5INDk3Zk1SaE81Q1R3TnpQUEpOMDlYY1RUNEFPdXUxSGJMX0ZzSmdJY2NGUmNkdVRKd0pMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "The El Paso Balloon Incident Could Have Been a Disaster - The Bulwark",
    "description": "The El Paso Balloon Incident Could Have Been a Disaster  The BulwarkLaser weapon that shut down El Paso's skies was LOCUST system  AxiosWATCH: Laser incident that caused El Paso airspace closure was 'joint agency' mission, Noem says  PBSDo Drug Cartels Actually Use Drones at the Border?  The New York TimesRare shutdown: Photos show inside El Paso airport after FAA grounded flights  El Paso Times",
    "published date": "Fri, 13 Feb 2026 14:18:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQYVFNejh4NnN5VGdiYUo1eVg3aG1NOGVWTWlsUVhVZjFxMk5DcGpwNTNXa2wzLXdKOWY2VWxwMHBKZnhkb3phZVlBMmNVdTVkcFd3UFk1U3ZtaEU3UmlUQmpIZmYxWGlzTklPWXRvcUVnSkpCTXFoN0VKLWpzUEVTZEFlUU91Q1d2OThRb3JGakFFUXdLMEliQlNRcDlDdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Slotkin looks to make sure DOJ has ended investigation into military video - Politico",
    "description": "Slotkin looks to make sure DOJ has ended investigation into military video  PoliticoOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York Times'The grand jury has spoken': Elissa Slotkin's lawyer tells DOJ to close social video probe  NBC NewsDOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostHow Trump failed in his latest bid to weaponize justice  CNN",
    "published date": "Fri, 13 Feb 2026 16:43:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQaDczRkVwOGN5V1duTUxtNmVsWnpQQ2hXcFZkMmlJbUlSSDZ5R2tOTFFEeElUZmVaWURSaXFMSGtGRktISm5QVnhVRzlEdnhPZmZXZDh3VEwwRktKQm15c05zREsxR283QzliNkRiTEF5YldzZEFsNm5Wai1PYTJ6V3lR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Justice Department Sues Harvard University for Withholding Race-Related Admissions Documents - Department of Justice (.gov)",
    "description": "Justice Department Sues Harvard University for Withholding Race-Related Admissions Documents  Department of Justice (.gov)Trump administration sues Harvard over data on race in admissions  BBCTrump Administration Live Updates: DHS Shutdown, Harvard Lawsuit and More News  The New York TimesUS justice department sues Harvard over admissions records access  The GuardianTrump administration files new lawsuit against Harvard in long-running funding battle  CNN",
    "published date": "Fri, 13 Feb 2026 14:52:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPclBhTHo2M2ZrZnhJYzVkZnk1YTFNcDA3Qkg2ZHFSRUJSVnlDRE9DRThmV2R4Vm5xVDlyWE9pVFFBUXJyS2lFbVpfZkduTDU4QmhTTTZMWFkxSko1Y0F5enJuZW1ObzV0UjdaN2hHUkpuTktCMGp6enhqczZiQndONDQxeW1QMjZta081ajVPakcyV0J5YkdGbVJUdnVTQ0tKWHpTNWVIM2VTUnpsZDU4eEdRNjQ1OGpFRW9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Federal judge reads death threats during hearing on Trump decision to end legal protections for Haitians - NBC News",
    "description": "Federal judge reads death threats during hearing on Trump decision to end legal protections for Haitians  NBC NewsFederal judge maintains block on ending Haitian TPS, responds to death threats  Miami HeraldOhio city stands up to Trump’s ‘attitude of hate’ toward Haitian community  The GuardianFederal judge upholds temporary protected status for Haitian immigrants  Fox NewsSpringfield community reacts to federal judge continuing pause on TPS expiration  WHIO TV",
    "published date": "Fri, 13 Feb 2026 15:21:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQY20yZ2tVVUt5Ny1yYUt4Q0psaXVpTUxHeXhYMFZfX19zNUxvZi1BbHZsSVczWHBkUXpfWElzTnJhY2x3d0pqejhwa0QwU3VhemtmR1pDTVRsNTZ3S3dBZXp3TmhjcEt5QlJ6d3dxMnFaNkhJVXhWWHBiWEFBanVYYzhzWVAzbnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "What Meetings Among Trump Lawyers Reveal About the FBI’s Seizure of Election Records in Georgia - ProPublica",
    "description": "What Meetings Among Trump Lawyers Reveal About the FBI’s Seizure of Election Records in Georgia  ProPublicaRead the annotated FBI affidavit used to seize Fulton ballots  AJC.comConcern rises within FBI that conspiracy theories spurred search of election office  MS NOWAnalysis | What’s happening with the FBI seizure of ballots in Georgia?  The Washington PostGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York Times",
    "published date": "Fri, 13 Feb 2026 16:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOZFZtTDlYTVJNdTBybWhGR1RtUlVwNnV5THBrbkNfUjcycHVoeUl6b1JGV3J5d0JiUGRSSmQ2eDRhOUVaZlhERGs0R2gwc1o4aHY2aUdmaUkyS1dmQW8xYk1wWWwtQmF2d1RxRk4wNDBFcU1ja0ljZWhOaU1IRnc2ckthNHpBREd3Unk3QnFIbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Massive sewage spill into Potomac River: What’s in the water, what are the risks rise as ice melts? - WTOP",
    "description": "Massive sewage spill into Potomac River: What’s in the water, what are the risks rise as ice melts?  WTOPDC Water CEO addresses community in wake of massive sewage spill  WTOPUPDATE: Potomac Interceptor Repairs, February 12  DC WaterPotomac wastewater spill appears to be largest in US history  The HillMounds of wipes clog pumps at Potomac River sewage spill site in Montgomery County  Bethesda Magazine",
    "published date": "Fri, 13 Feb 2026 15:59:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQZWVCN2pwSEg4Yk5qZ3ltLWZaN2VGQk1VUE5yVFBBelNXck9qNFpTZG5hNVNzMmZSM1VYeHFrUjh0amhYUVJkbWRlRFNLekNHRWUtS3FsME52MlFCeTNfN0w2NHVTN1JvQUQ4blZGem03cTkzMjhQeHI1bHUxMS1MNDFhZlFMMGN2aDJfNW4xQzE1OVJBX3dqSERnTGV4MjVBeUVfSVQ5YWwzS1JfVWpiVGZPYm54VjBBMVM2dnUxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "WTOP"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesList of ICE raids, major updates in Minnesota on Friday, Feb. 13  Bring Me The NewsPressure mounts for U.S. Congress to block funding for Homeland Security  The Globe and MailActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateICE Melts in the Minneapolis Winter  The Nation",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Conspiracy Theories Only Flourish With More Epstein Evidence - The New York Times",
    "description": "Conspiracy Theories Only Flourish With More Epstein Evidence  The New York TimesThe Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesWhat will Epstein accountability look like?  CNNInside Jeffrey Epstein’s network  The EconomistOne celebrity in the entertainment world got Epstein 'withdrawal'  Australian Broadcasting Corporation",
    "published date": "Fri, 13 Feb 2026 10:02:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxON0pmX2dZX1pzNUpKYWFPcHJGQ0RSVm5mc0VVRGh3LThtSkRvam9DdlRRSW9pYmc2OVc5U0NuRnoxQXBXbWJsTnZFWWRBYXo2NjlKVjhJSGtnNnZkTFh4d3YxMkpydW9VNlVpRld6bE40WGxyTkhqUkx0cTBsWFpRYlE5eERfM0VfYVRhelhLRDZRdU9rUUlWN2tJcEhsVWZrdEhhck5fYWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Epstein files: DOJ says it logs Congress members' searches to 'protect' victim information - CNBC",
    "description": "Epstein files: DOJ says it logs Congress members' searches to 'protect' victim information  CNBCHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoDemocrats to Pam Bondi on Justice Department's Epstein files \"spying\": \"Stop now\"  AxiosPam Bondi’s Contempt for Congress  The New YorkerCommentary: The unintended hilarity of Pam Bondi's finger-wagging testimony  Los Angeles Times",
    "published date": "Thu, 12 Feb 2026 19:43:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNeXRKT1hlUW5qeHZVOFJ6QnRIMWkya195M1lTTlhQLU5UbXlHQk5PTHI5aEdHVVlHdS1wcVJzX1hPcVFwUWYwMWxWbVlwTUtWSzRpaU1iWnkwTjlqaXJFSFJidktEMGhMUU5XRl9TcDBoOVA2andBTEtVbkNJNFZpSVM0dUFneFnSAYwBQVVfeXFMUFNyeUhoTmpsLVNnZzlmdFUwVGhIM1VVNUk0a09HWGxxNWlndzdVMWtmVHIza1FlTTczZXNpMklzdS1Oc3JlMXIyQU1tdXdzREZJZ0d5eXhlZHlPVXhkVTNXUTRkUFFpUWpMVU56TGRZOE1taWRlaEh5cDJ4SlRYSjVDTWJ3aGotdUY1bXk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California - Redheaded Blackbelt",
    "description": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California  Redheaded BlackbeltStrong storm set to pummel L.A. with heavy rains, flooding and beach hazards  Los Angeles TimesStorm to bring 1 to 3 inches of rain to Southern California. Here’s the timing  KTLAOnslaught of storms is headed to California — with chance of snow in Bay Area  San Francisco ChronicleStorms on the way for Southern California. Here's what to know  Ventura County Star",
    "published date": "Fri, 13 Feb 2026 08:01:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNLXQxMWR2ODhZTHNEQ1g3aE1leXRhdTdKWmFLdjJITUQ2UnY4NFZfQWxLVmQzX0xSWmcwdXVLS2FQNGY2dDg5Vy03ZVJ3aTdQdHg1eDRZTnRwMzRzRjhoRFgzbGozYnNpNklMek5fUzFuSUR2Y0szYmVDZnVpQk1WdVI2VV9DTFBlbDRndmtpeUpwQ1B0bEdweW5vMUdQVHhMMi1nWXN3bm01WkF0Qy1vOHR3bzhReExQamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kymkemp.com",
      "title": "Redheaded Blackbelt"
    }
  },
  {
    "title": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections - PBS",
    "description": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBSHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsWhat is the SAVE America Act that mandates voter ID?  BBCFederal Power Grab On Voting Still Flunks Basic Civics Test  Cato InstituteDHS Secy. Kristi Noem Holds News Conference in San Diego  C-SPAN",
    "published date": "Thu, 12 Feb 2026 17:52:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOY0ZzZXFwWk9laXpFVWJsaVlYLVdiQTUxbFpuYTZROERXSzBpOVRHYlpsTFUxNUFkbHhqQlM0UUFRa19LTFR0LTIwbW5hVE5yNWRVbnBkTVY4dHA4U09FempMdHFsSFFnY1F5ckpqRF9vbXRVV2YyWUZfZ0pqZFpoX3JMdnRMbm9HNVFydDV1M0FiYUk3Z1Zzd3R3MUxxOWhEUTdnbEpFcWdxYTdURllVLWV2eWlleG11a3hvV0c0WC1MZUdyQjFiTk5DSFjSAdIBQVVfeXFMT0dkZWJnbmZPMXJReUEzNEdVZkJFLWdIOE11c2UxYzVjQzZPNWtxOHo2RU9qQlFTN0ZRVUpmMlh0U0ViV2FEd1hJcU9vRzhJZ3lUYi1vcVJ4T3pmZnRxQVMzLVRlSXk1dDVzT1hIaEZ3LTBOWk1JRTU3T3VaTFM4T0UtZWZLQzZjNl9QbnM2Wmt5ekwtYVBMVnVxOXd1eWRvcDQ0bUlQeHNfTGhrRElURTZJRTVpbGVBVC1YdnpxcXFJY2lreC00QmZPZjdkMGktTV9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Nanos pushes back on claims of withholding evidence in Guthrie case - KVOA",
    "description": "Nanos pushes back on claims of withholding evidence in Guthrie case  KVOADay 13: Sheriff now says no gloves were found at Nancy Guthrie's home  WRALSheriff Chris Nanos disputes claim he’s blocking FBI from evidence in Nancy Guthrie case  KOLDExclusive: Arizona sheriff blocks FBI access to evidence in Nancy Guthrie abduction, source says  ReutersGenealogy company exec slams Pima sheriff's 'devastating' move to ship Nancy Guthrie evidence to Florida lab  Fox News",
    "published date": "Fri, 13 Feb 2026 06:25:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxPbW02cnl2N29XcncwUEljaG14anB2UDlLZ0R4ZWZ0V3Z3RVFMczAwYjFFdklFOGR1QWlTeS1SU0FPdDhmRTM5T0RWcGZPUEwtOFNuM210cW93X0o0ZUVhcjJ6ZVR3Vk5UNDFva3h3OUt4c0piUzk5Y24xZXdrT29zbnBMTkJ5RU04bDU2d2s3cHpTejZhNjJZUlJYSWpuVDZlR21LSlBxSDNWN2Y2YzFaVy1GX1IzM09sUHdWeGJEUTRSWmdEb05IVjVQcjN0dlluWGJqY3NmZGhtTzYyY1luVEUtLXB3R1pSZUl6cHpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kvoa.com",
      "title": "KVOA"
    }
  },
  {
    "title": "February 12, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 12, 2026  Letters from an American | Heather Cox Richardson | SubstackCoal industry latest to reward Trump with an unnecessary, made-up award  MS NOWOpinion | Another government sop to an ailing industry  The Washington Post“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)Trump directs Pentagon to boost coal use as Energy Department announces $175M infusion for plants  The Hill",
    "published date": "Fri, 13 Feb 2026 07:44:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5CbkZXVWM0ZlBodXJyR2ZVNlJaNlMzdjROYlNaaFBfTFYzVDVDRXpHbDQ3eXdKRkc5S1hTQUVSM3o1ODhkczdsMEZtdGlCbk1zelgySXNpWmYzb2xIX3o1QmtIX2l4bnJKNGhwMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "Pride flag reinstated at Stonewall after it was removed by Trump administration - The Guardian",
    "description": "Pride flag reinstated at Stonewall after it was removed by Trump administration  The GuardianNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistTrump admin rips Mamdani, local Dems as activists override gov't move at NYC monument: 'Focused on theatrics'  Fox NewsStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New York'We will not be erased': Stonewall pride flag raised in defiance  USA Today",
    "published date": "Fri, 13 Feb 2026 02:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWHg1QnRGQ0Q3Zkk1ajBzeWtNZmExYkFzM1FYRjFLS3U3Yzk3Y1VvaTAyd1I5bGlMSmxybWxVMHlGSkhNOVhNZVpuZ1lLNllBc1poRjRpNVdPNEVLLWprUG5Fa1ZKVGt0YTRXcmJGOWJPWVhmblI4UDQxOF9USUtoOFlOQ2MxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge temporarily blocks Pentagon action against Mark Kelly over illegal orders video  NPROpinion | Sen. Mark Kelly's legal win over Pete Hegseth is a First Amendment victory for all military veterans  MS NOWThe Situation: “Horsefeathers!”  LawfareJudge Quotes Bob Dylan in Scathing Rebuke of Hegseth’s Bid to Punish Senator  Rolling Stone",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It. - ProPublica",
    "description": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It.  ProPublica‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston Globe'Shocked' Michigan Dems urge Trump to reverse stance on Gordie Howe bridge  The Detroit NewsReport: Michigan-Canada bridge delay could cost up to $7M per week  Bridge MichiganWindsor mayor says Trump’s claims about Gordie Howe International Bridge are “nonsensical”  Michigan Public",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPN2RBRm5yY3lIaHo5bFIyNFZITEVmYW43bDA4OWo4MGE0bXpRdVJqX3N4ZXNScVh1elJ6c3dtN1p6NmlROHA0YlJTYmdVS0pickxKLUJFc0JTOHdicXJ5aGRHR0Jqd1E5cEs1TzBFclJQaHhBM3g3NU9wai1fODJDWXNwRGE4Yk8yNVN5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge: Government flouted constitutional rights of Whipple detainees  Star TribuneJudge orders DHS to give Minnesota detainees swift access to lawyers before transfers  CBS NewsJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York Times",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "SAVE tool keeps mistakenly flagging voters as noncitizens - The Texas Tribune",
    "description": "SAVE tool keeps mistakenly flagging voters as noncitizens  The Texas TribuneTrump’s push to audit voter rolls is already snaring US citizens  CNNDHS Unveils Tool to Check Voters’ Citizenship—and It’s a Disaster  The New RepublicTrump's multi prong attack on voting profiles a desperate man  Daily KosLocal election authorities say a verification tool used in Missouri flagged citizens for removal from rolls  ABC17NEWS",
    "published date": "Fri, 13 Feb 2026 10:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQNzU4SUNGemR0TWNVM3Ywd3Fxa21yTEtJYXlzckhPU1dCaTdBdTkxLW9fYkk5RThNRkZvbzdiSEVyYS1FZkxqS3NJNnY4Rm5ycVRGamcxUHZNRVBXOGI4MkJXVVlRSVFxNmFWOEZnOWZIRGczbFBXTVZpYS0xb05KT0lnQkpXb21SMXhWdXY2WW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsGovernors association says all members now invited to White House meeting as Trump defends exclusion of some Democrats  CNNTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsMaryland's Democratic governor among those excluded from White House event  NPRTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  Politico",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump officials confronted with Pretti shooting video at Senate hearing - Axios",
    "description": "Trump officials confronted with Pretti shooting video at Senate hearing  AxiosSenators Press Immigration Officials on Minnesota Shootings  The New York TimesICE chief defends his officers’ actions before Congress after the deaths of 2 protesters  AP NewsCongressional hearing examines ICE presence in Minnesota  MPR NewsICE director stands his ground after Swalwell blowup, says Democrats are ‘misleading their constituents’  Fox News",
    "published date": "Fri, 13 Feb 2026 16:13:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQSllTajVsMDRtOWtDcThRZlQ2UHRmdFlXVU5wUUUtMTMtRVlsVkttcEdMcDNtSWpWS05BY0tCRzIwcVQtOU5rR3daR1BmWlRKRnkyZGR4ZEFHMElLWW5PVDY4Q0JkUTF4VS1HeHJSRm4wTE9KN3AtaFN0RS1EUVNxMjR4UFJCY245S1REN3ViTGlxdmx3OVdMbHhTaGQ0anNQQmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary - AP News",
    "description": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary  AP NewsIn an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesNew Jersey House Primary Special Election 2026 Live Results  NBC NewsWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al JazeeraAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of Israel",
    "published date": "Thu, 12 Feb 2026 22:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPYVlpeF8xa3g4SkNYazBsMGVzRUduZVVmalVfRDR1U0JHOE9yenl3VjdDcXpJTS1ZUHRIZ3lqTkhPZVhUdnVPc0Q1N1ZHMG9hanRQSXpCMjNPM19wTzJ1Slc5dlNfQUFLMnp5SFdIZkV5dDZNbzl1VV9IUHFPajlfUy1zM0lxb1lzZGpjRFB6Qi1lYTJ5a3AtSFpLc01rTDZT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New York\"Honeymoon is over\" Zohran Mamdani grilled by lawmakers as he proposes to \"tax the rich\"  WRGBMamdani Expects Wall Street Taxes Will Ease NYC Budget Crisis by $5 Billion  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Costs from Trump's tariffs paid mainly by US firms and consumers, NY Fed says - BBC",
    "description": "Costs from Trump's tariffs paid mainly by US firms and consumers, NY Fed says  BBCA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNN90% of Trump's tariffs are paid for by American consumers and companies, New York Fed says  FortuneWho Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsAs Trump touts tariff windfall, battleground states shoulder billions in costs  Fox News",
    "published date": "Fri, 13 Feb 2026 01:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFB6WnR1Mi1xLWo1Qy0wa3kyX0JZejk0TnFybjR3bWVfbXpSNzZnNnZZbTRiT3Jwc3BGblVWaFUtOXQ2cGpaT1NjRlJhRGQ3ZE1XS1hkWXdpcUk3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted - CNN",
    "description": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNN1 year of RFK Jr.: How his MAHA agenda has reshaped US public health  The HillRFK’s idea of making America healthy starts with making it politically sicker  The EconomistThe Senator Who Has Made It Her Mission to Stop RFK Jr.  Rolling StoneOne year of Health Secretary RFK Jr.  The Hill",
    "published date": "Fri, 13 Feb 2026 12:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSVpFdFBhN2FxdTYtQ25adlIySnp4bkxOYUZxTmpIRmJKWjBZb1gwOUMtYk9jWkdsaGRSTkVXRlVfNXRCSjBIOXVpZ1FtNkdFUFZXNEZOOWhmb3l3X2diWG5qYzVnb3IxMjJJRGdOa0lQc1J6dFJWUkVnNWVzSTVRYjZQMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children - The New York Times",
    "description": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children  The New York Times'Even in Russia, they don't treat children like this': A family's nightmare in ICE detention  NBC News“I Have Been Here Too Long”: Read Letters from the Children Detained at ICE’s Dilley Facility  ProPublicaReporter details life for children and families detained in Texas migrant facility  PBSThe Kids Trump Sent to ICE’s Dilley Detention Center  ProPublica",
    "published date": "Fri, 13 Feb 2026 10:02:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4Z2hLbVhFMHlFUlQ2bjBjM3A4MVB3aHV2bTVjVDFqOGYwSWNvRW1Idmt3S2FUYURNU1ZTY0NIQXZUV21vZ3o1Uk12UlB1Y2tRNlI0X2RQV2h5SVBPZEJTZ0pqUTZkdDFzS2lHOTh5dTNwNk9Ia1RxWm5BajZodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]