[
  {
    "title": "Tensions remain high in Minnesota as ACLU files lawsuit and Trump threatens Insurrection Act – US politics live - The Guardian",
    "description": "Tensions remain high in Minnesota as ACLU files lawsuit and Trump threatens Insurrection Act – US politics live  The GuardianTrump threatens to invoke Insurrection Act to quell anti-ICE protests in Minnesota  BBCLive updates: Minneapolis ICE shooting, tensions flare after man is shot in leg after allegedly assaulting federal agent  CNNFor Trump, Everything Is an Existential Threat  The AtlanticTrump threatens military action in Minneapolis. And, inside his healthcare plan  NPR",
    "published date": "Fri, 16 Jan 2026 12:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcG83VXB3ZjM2dTNNT3gzcTA1eWs2TFBMRE05cU56bXNYclpEbWxfbmRuSnNOTlhtZU1wYTFjV2lnME9rSUZiVks1UXVKb3JvOXJBRy1HcXN3YnhRMHJxYmF3OWlwQUZEVktTLU9HRTJ4YV9tLVIzVjh3b2c1aXhmYVFQSFdqdWQ2djhKOXp2VjItR2hQaHhaX1RxQVlIUG9iWm41LWh3S3ZQczZ6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "‘Dumbest thing I’ve ever heard’: Republicans amp up their resistance to Trump’s Greenland push - Politico",
    "description": "‘Dumbest thing I’ve ever heard’: Republicans amp up their resistance to Trump’s Greenland push  PoliticoBacon says he would ‘lean’ toward Trump impeachment if Greenland invaded: ‘Utter buffoonery’  The HillJohnson: 'No boots on the ground' for Trump's Greenland acquisition plans amid military speculation  Fox NewsSenate Democrat on Trump Greenland rhetoric: ‘This is the president being an idiot’  The HillGOP congressman splits with Trump over Greenland, calls it 'buffoonery'  USA Today",
    "published date": "Fri, 16 Jan 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxObWxiOWtKa1Z0eVk3TTlvYWlWWnBRN1FmaUx3UzJZNTJobFQ2eUNWd01ValNmU1JoN21meEVRcVIxV1J5UFR6NG5SZGRFUVhVZ2pIQm9WZUVqOTZtd25TSlpyZXhEZDdma2FPbTBwNUlfbWFueWVyTDNQcDFXUHR2S1ZCTXhFaXptbW1GckdQdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Ex-U.S. Sen. Kyrsten Sinema had affair with bodyguard that led to breakup of his marriage, ex-wife claims in lawsuit - CBS News",
    "description": "Ex-U.S. Sen. Kyrsten Sinema had affair with bodyguard that led to breakup of his marriage, ex-wife claims in lawsuit  CBS NewsFormer Senator Kyrsten Sinema Accused of Affair With Member of Security Team  The New York TimesKyrsten Sinema sued by former bodyguard’s ex-wife over ‘alienation of affection’  The GuardianKyrsten Sinema Faces Affair Lawsuit: What to Know  Time MagazineEx-wife of Sinema aide accuses former Arizona senator of wrecking her marriage  The Hill",
    "published date": "Fri, 16 Jan 2026 13:09:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPcjNlWlBVODViTFdFS2dpVWswTThRbUZKdG9QX0R1aFBRVll2b09BcGNWNmc3NjFZUVpDeWJvQ0JaRTFZcUFxYktXajVWTUxydGpPVjRCd3ZUbEluVExQRUs5cTVST19CLWtLVmtBTmlaXzNlQ0RERzVpV2JVeDNmakZESGVXZzNOVlRSdkNB0gGTAUFVX3lxTE5fWFRGQ2VuRXJqN2pNLWJhUE9NM1VTN0FGbWxsTkkzT0lxVmd5eWJfb29rU3NtRjkzU0pSbjZZR1BBRWh0T0dhblBuNkpyUDN1QmoxdUt1MGpHMmhvaUVqbXdQNEFtdkFJak41UXZVZjQ3c1MxalRWbm82RmRVXzFUdEFSVkoxaW90Zng0amEtNUFkVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Aggressive tactics used on Minneapolis protesters raise concerns about federal officer training - AP News",
    "description": "Aggressive tactics used on Minneapolis protesters raise concerns about federal officer training  AP News'It feels like an invasion': Minnesotans stunned as federal officers flood their state  NBC NewsMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNNPhotos: Minneapolis Neighborhoods vs. ICE  The AtlanticACLU sues Trump administration over ‘racial profiling and unlawful arrests’ in Minnesota ICE surge  The Guardian",
    "published date": "Thu, 15 Jan 2026 22:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQX2duZTFxTUJuZmdjdW84ZmhCR05DaERFRDljbWpzcGxwa25fc1ZPOW5xV1dtZ3VpX1N2SWxWZVpkZGVsMjlZNG9lR2x1UTQ2TnprZkxXNWU0aFBsTW1aMGU2RFhjU2Z0bkNoOUg3LVprNDJyNGJ3bUZ1Q0RlOElJRk5SY2h3U3VUUkZLekJ3eEpybEo5VEpzUzlGcVhwNHhwS2VXamZySXhxQlNMZjEyWS1NcWN4anhhM29vRXNWWFRaNTlUYWVQd1Bn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Norway Stunned After Machado Gifts Nobel Peace Prize Medal to Trump - Bloomberg.com",
    "description": "Norway Stunned After Machado Gifts Nobel Peace Prize Medal to Trump  Bloomberg.comVenezuela’s Machado gave Trump her Nobel prize. In return she received a swag bag but no promise of support  CNNGiving Trump the Nobel peace prize medal is ‘absurd’, say Norwegian politicians  The GuardianTrump accepts Nobel medal from Venezuelan opposition leader Machado  CNBCMachado gave her Peace Prize to Trump. Can a Nobel be gifted?  The Washington Post",
    "published date": "Fri, 16 Jan 2026 09:18:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOV1pYNGVRcUFrLTlGTE52am1TZDktMzRZaVpIMW9EYVo0MjJOakFJODJFdHZJQXlIOUpnbnhFd3l1aV9KT0hxVVdKR21FOVJVTmFTemFiOGM4cTJTeTBfc0ZDdGRrMFZ5aGpmQjZNNGZVNjdkWERnWmVLaGpoVWUzVm4tcWFESi1GMW9EMFZ0VkNVR0Frc3NEWUZMc2hiM3NlMHMwVEk1MUprXzZJOE9lY1ZSY3A3RWlVSk4tZWFWcXZvaTVNN0ltVDNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Alleged Charlie Kirk assassin Tyler Robinson’s defense is set to argue to disqualify prosecutors from the case - CNN",
    "description": "Alleged Charlie Kirk assassin Tyler Robinson’s defense is set to argue to disqualify prosecutors from the case  CNNA prosecutor’s child witnessed Charlie Kirk’s assassination — can he take part in the case?  Fox NewsCharlie Kirk's accused killer asks judge to disqualify prosecutors because attorney's child was at event where Kirk was shot  CBS NewsThe death penalty is not justice for Charlie Kirk’s killer  The HillProsecutors push back against effort to remove Utah Co. Attorney’s Office from murder case  KUTV",
    "published date": "Fri, 16 Jan 2026 05:01:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPVUFOdXZ1Tno1MnpXT3o3UldWZ1hNVmhrTDktb2ZlS25ZZWxMczVKMzJRVnppQzh3ZzNEVHVja1VDNkhvZUQ2aFNkMTFMcVJBOFhlZi1HclBIX1BmZzlMSUhnajJmMXQxTjJ2Q3I2bF9iSnltTEFrM1FqUlU2Z0I2TGVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "ICE Jails Oglala Sioux Members at Fort Snelling, Site of 19th-Century Concentration Camp - Democracy Now!",
    "description": "ICE Jails Oglala Sioux Members at Fort Snelling, Site of 19th-Century Concentration Camp  Democracy Now!Native Americans are being swept up by ICE in Minneapolis, tribes say  The Washington PostMichigan Native American tribes warn about ICE. What they're saying  Lansing State JournalOglala Sioux leaders seek missing members detained by ICE in Minneapolis  FOX 9 Minneapolis-St. PaulMinneapolis Native community works to protect each other as ICE surges in Twin Cities  CBS News",
    "published date": "Thu, 15 Jan 2026 15:15:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNR3NjYzBmanNlcGdlamFPb2FPVnpOLXNFNTFCbE5NSm5OcWVXQUtZc2g1MnJyYk1GRmNqYmM2SjNwTjctRVU3M1dIYlQtWVRsamEwQWZ4SndPV3VmN0kxeUpKY1IzT1B4cnJoLXRLaGhYWWNMLWkxbVF3RVRLdkNqV0RiallnbUpZVTQ0bDF3R1hnbERPV0RJQ05hNXZnbmx2NEtnbHRBNnBtZGZUZU5jUWxPaWVONnMtaVViNFhZc0d0OHczMUFaTTJYRzJ0X0pEQnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracynow.org",
      "title": "Democracy Now!"
    }
  },
  {
    "title": "Death of man at ICE camp could be investigated as homicide after examiner’s report - The Guardian",
    "description": "Death of man at ICE camp could be investigated as homicide after examiner’s report  The GuardianMedical examiner likely to classify death of ICE detainee as homicide, call says  The Washington PostDeath of ICE camp detainee could be investigated as homicide after examiner’s report | First Thing  The GuardianReport: Migrant's death at Fort Bliss detention center likely ruled homicide  KFOXReport: Medical examiner believes death of ICE detainee arrested in Upstate NY was homicide  Syracuse.com",
    "published date": "Fri, 16 Jan 2026 03:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNZE1uVXF4SG4yRkE2c05XMU5GMHVmTnZhWHVrRlJpak15LWU1R1J1ZXlvaW1UUXNGVXFWX2FlZWhOZ3prTk5ZM05hTXItdWNBUXlqRU93eFZpaG1LSVY4M0I5UHhXSndESkhKTEdrX2FFSXBHMHNhX0REaGJzbjNtNExSTTk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Iran protests abate after deadly crackdown, residents and rights group say - Reuters",
    "description": "Iran protests abate after deadly crackdown, residents and rights group say  ReutersSo much for a ‘final battle’ – once again the Iranian people’s peaceful and democratic demands have been silenced  The Guardian'It's horrifying': Videos of body bags and machine guns give rare glimpse of Iran's bloody crackdown  NBC News‘You need to hang up now’: Australians report surveillance of phone calls with relatives in Iran amid uprising  The GuardianIran Update, January 15, 2026  Institute for the Study of War",
    "published date": "Fri, 16 Jan 2026 14:00:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPb2V5aVlhWDg4QmdwMC02WmdDTWJIci1BYlJzdElVOFJEWlR1dkM1aVhDN1Q5MlVVNmxkZ252Q01mZW1mZGRWVktaTXFpQkpid2tRU1Fya05SLTVrdnlyQ0F1QlBoMldRRWhMb2tGZ3VOY3lPakJ0Nm0yX3FSY2FFRXAwZWVoQ0hkY2Z2SVlZcG9HZ2VkbnZHVHZSMkN2Ry1sRnNWb0thMk91Nmp4STcxZ1c1cHVvR0R5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "A healthy meal for $3? Agriculture secretary says it’s easy. - The Washington Post",
    "description": "A healthy meal for $3? Agriculture secretary says it’s easy.  The Washington PostTortilla, broccoli, ‘a piece of chicken’: US agriculture secretary mocked for ‘money-saving’ meal  The GuardianDolls, pencils, backyard chickens and ‘a piece of broccoli’: The Trump team’s awkward austerity talk  CNNTrump’s agriculture secretary mocked over ‘depression meal’ for Americans  The IndependentTrump Goons Boast They Ran ‘1,000 Simulations’ to Recommend Tragic $3 Meal  The Daily Beast",
    "published date": "Fri, 16 Jan 2026 11:32:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNU18teXlkbjRzQ2lYVkxaN3hyRENMakpKcTIwbkFBdmlld2FtX3VGY3o0Zm9NV2c2VFcwaUtMeVNaS2pCQm9YRDQ4TC11ejJ1YUVpOE8yMlhwUk9hR2ZRa19INmVCa1otZUhZOU1iLXJfZ0FEWFBKaHE0N2lQWDVNZjN5Nno?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump threatens to use Insurrection Act to deploy troops to Minnesota to \"put an end\" to protests - CBS News",
    "description": "Trump threatens to use Insurrection Act to deploy troops to Minnesota to \"put an end\" to protests  CBS NewsVideo Analysis of ICE Shooting Sheds Light on Contested Moments  The New York Times911 transcripts and an incident report reveal where Renee Good was shot and how her community faced her killing in real time  CNNRenee Good had four gunshot wounds, Fire Department report reveals  Star TribuneDo federal agents have 'absolute immunity?'  NPR",
    "published date": "Fri, 16 Jan 2026 13:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOUllxRnFmemtucDEwb0l6WlVQbnJUV0VKTldsNUViaEZHRDdlbWVhVnl1RUkxeFpnMzFyTFNYNXNoNHo2QUFJRFQybXZaNjRlOXJWaXRlRXJSNWM2elZYWGRmekZGTU1FcjZBNHBmM1FKODd2UDZueXRwWXlrejNpYUlFcUhvOF9qcklCbWFNV3lBSHBXeEswakFWVmp0MXFIYlFRWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "New Mexico’s US representatives sign on to Kristi Noem impeachment resolution - KOB.com",
    "description": "New Mexico’s US representatives sign on to Kristi Noem impeachment resolution  KOB.comIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsArticles of impeachment filed against DHS Secretary Kristi Noem  Gulf Coast News and WeatherHouse Democrats call for DHS Secretary to be replaced  Federal News Network\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  Axios",
    "published date": "Fri, 16 Jan 2026 06:04:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNVHZtRFJSTkFHVFhqYURfSEllWGtQcU9fOGdycGQzRkVVWVp0aG1mUzQ5YUNDa3MwWEdVVWpUalJHc29jSTN2X0xnSU9vU1JwZlJrRjdsRmtzQ2E5VzFia19NNFpKZTZYUmJjY2Q3V0JxaW5VZEpoRGVBOEJaQW5RS0hsM1g4SnVhVV9xTVRZV3VTejNmc1lXOVZON1VtQnVpcVJBUnJPQUZJa3h2TVJEMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kob.com",
      "title": "KOB.com"
    }
  },
  {
    "title": "Cumberland County DA cancels news conference on ICE activity after state court concern - Portland Press Herald - Maine Sunday Telegram",
    "description": "Cumberland County DA cancels news conference on ICE activity after state court concern  Portland Press Herald - Maine Sunday TelegramNew Mainers plan Waterville dinner despite ICE concerns  Centralmaine.comImmigrants prepare for their arrests and leave Lewiston ahead of ICE action  Bangor Daily NewsMaine lawmakers respond to ICE operation rumors  WABILewiston schools gear up for possible increased ICE presence  ​​Lewiston Sun Journal​​ ​​​ ​​​",
    "published date": "Fri, 16 Jan 2026 13:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOaERkdE8wSVJzdFJPaGFSMHRIYnBMM3lxVE9KSmU0bUlINVBtQ2hid2RRTkhFRFoxeThfVlRqQXRWMllraGx2MmtsN2hBbDlkS2lrTkQ2VlA3LTBwT2hFSk9RcERBckRYZzcxTVhvZ0JLVTZwSUxvSThOWUl5RWZaS3JIQU5UbEpFTkMwa1RrYTRNR0lESVktY1Z6WnBsVjdwLW11TWR5cjY3M3J0SGF6d2t6cERJOXlZcDRSdXZsWjg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pressherald.com",
      "title": "Portland Press Herald - Maine Sunday Telegram"
    }
  },
  {
    "title": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities - CNN",
    "description": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities  CNNAre Trump's supporters getting what they want from his second term? Here's what a new poll shows  AP News58 percent call 2025 a failure for Trump: Poll  The HillWhat is Trump’s approval rating See numbers after ICE shooting, protests  The Providence JournalBacklash to Trump has been more severe in his second term  Strength In Numbers | G. Elliott Morris",
    "published date": "Fri, 16 Jan 2026 10:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE41Ujd3MDF2WnQtdkIwa0FZU3VOcjlKUmZqejdMZkRFUk9USnRUa2VfMlBEUHhoNFVuNVJKR1FqYUU3N1BlekxTUHRZcEtubFlwVEtFMVNqWUltRUNmbGhjcmtkY0s5aWxGWDF2cEpFdWtMMVhHWXNiU2RoSkZXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "RFK Jr. Says He’s Ending the War on Protein. It Doesn’t Exist - WIRED",
    "description": "RFK Jr. Says He’s Ending the War on Protein. It Doesn’t Exist  WIREDFor Men, How Much Alcohol Is Too Much?  The New York TimesKennedy, Rollins Unveil Historic Reset of U.S. Nutrition Policy, Put Real Food Back at Center of Health  USDA (.gov)RFK Jr.'s new dietary guidelines go all in on meat and dairy  NPRHealthiest red meats to eat — and how a cardiologist says to prepare them  Fox News",
    "published date": "Fri, 16 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxORERQTVBJRGpac19SSXd6a2JmUjhhZEJZci1WcHdwX0hrQ0RpblNPVS01WDNrV0VLQ3ZNWE9ZTjRVQktkTFVOSlFUQ1R2RU5KNi1raEVOcE5iTXpYM1F5c3p2Y2FUNFJJVm1UbG5wMXZhQUs3U29xc1R2Z3pVaU1vdGprejVJR3kxWnZzbmdycw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Renee Good Was Concerned About ICE, a Lawyer Says, but Wasn’t Following Agents - The New York Times",
    "description": "Renee Good Was Concerned About ICE, a Lawyer Says, but Wasn’t Following Agents  The New York TimesGood family attorneys launch their own investigation into fatal ICE shooting  5 EYEWITNESS NEWSWhy it is difficult to sue ICE agents  ReutersRenee Good's family hires George Floyd law firm to investigate Minneapolis ICE shooting  The Washington PostRenee Good’s family hires firm that worked on George Floyd case, releases statement  InForum",
    "published date": "Fri, 16 Jan 2026 10:04:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOZmR1U2hBMkFoNXNhUmtxM2VMTkx4UUdQYzAtZk5KM3RHQUlFendtc2lSdmxqUjdscXllSjZhdkk2OE1VTUR6RFhIUFFLY01qZU9GV3g1UzgyV0UzcXlJbnh0cVI4QTNZdFBvTF93eE1SZWxUekRCZ00zTlhMbEM0TlNwMzdXS0cxbGYzQlM0cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US appeals court ruling raises prospect of rearrest of pro-Palestinian activist Mahmoud Khalil - Reuters",
    "description": "US appeals court ruling raises prospect of rearrest of pro-Palestinian activist Mahmoud Khalil  ReutersAppeals court reverses decision that freed Palestinian activist Mahmoud Khalil  CNNNYC Mayor Mamdani posts in support of anti-Israel activist that US seeks to deport  The Times of IsraelUS appeals court reverses decision that freed Mahmoud Khalil from ICE detention  The GuardianFederal appeals court sides with Trump admin in judge's Mahmoud Khalil decision  Fox News",
    "published date": "Thu, 15 Jan 2026 22:07:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQOFprdHRSanJ5Y3B1anhvOFBVbFhLTkNfVVBFVGI5Q1VfSEx3UFZVYnNLWHlyZUJhaWc5d1R3V0ZjTDBfS1UyM05VVTRkS185YzFJay1la1FQOVFXbzZicnJMdDlQQndDbUZVME9VV3NDR01CdjdLUjB3WE9yNmpYU1ZvR3RVYkJuSS1xa1VyNE14dGo4WGZwYVFjOGxpVUczcEpIMlhaamhiV1FIZ3Z6YTBwbHB5WTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Youngkin ran on culture war issues. Here’s how he changed Virginia schools. - The Washington Post",
    "description": "Youngkin ran on culture war issues. Here’s how he changed Virginia schools.  The Washington PostWATCH LIVE: Virginia Gov. Glenn Youngkin's 2026 State of the Commonwealth address  PBSGov. Youngkin touts economic, education gains in final address to Virginia General Assembly  WTOPState of the Commonwealth | Youngkin to Democrats: Don’t make big changes  Richmond Times-DispatchOpinion | Youngkin’s Strong Virginia Legacy  The Wall Street Journal",
    "published date": "Fri, 16 Jan 2026 14:05:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPNFZPanhSSWU2eG1Wc3EtSDd2UlpIeTBpOHNSSHZnalF3S21DYlk2M0ZpQ0VrVUdOYVRIZUpKVktGeTNlZlg1UTNDMDQyZDZ2MERzeFI1TGV2bDhfWVg5U2VpaWZPMWRXbU9aZnd4TU5QUERaQWhxQmlvN2Z4a3FEcVhSRHV0YTlMLV9HdlNBMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump administration’s demands for California’s voter rolls, including Social Security numbers, rejected by federal judge - Los Angeles Times",
    "description": "Trump administration’s demands for California’s voter rolls, including Social Security numbers, rejected by federal judge  Los Angeles TimesJudge deals blow to the Trump Justice Department’s use of the Civil Rights Act to ‘clean’ voter rolls  CNNA federal judge dismisses the DOJ's effort to get voter data from California  NPRJudge dismisses Trump administration lawsuit seeking detailed voter information from California  ABC NewsOregon not required to give feds voter data, judge rules  Oregon Public Broadcasting - OPB",
    "published date": "Fri, 16 Jan 2026 03:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUzVKOGEydEtuOFhsSEpKV1BTWkJJSlpLWlQxMEtDTnZJc3ZLTTZ0Y0JKLUxLWTlMSHg2TDFtWEpsYXY4Y1ptX3YzSkswaVVyWlg4WWJGcmwtb1RrRWhpWnp0dlhFamI4enNKYkVrZHJvN29TMThoeDk4RE5HU0ZlZU5TV3I0M3VDUHR6WUdLcllseU9JbG4tMjRNaHQ4Rl8xZHdCb2ZhVDdMckJfVW5DOVFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Trump health care plan doesn't help people facing skyrocketing ACA premiums - NPR",
    "description": "Trump health care plan doesn't help people facing skyrocketing ACA premiums  NPRTrump pitches direct payments to consumers for health care. What policy experts say about the plan  CNBCThe Great Healthcare Plan  The White House (.gov)Trump’s health care plan excludes those with preexisting conditions  NewsNationTrump unveils health care framework aimed at lowering costs in latest affordability push  CNN",
    "published date": "Thu, 15 Jan 2026 20:48:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZzFZVTNNNkxBdmtzbWt2aUplTzR4WldiM2h6eVE4QmhKb0FHQktBaUItNlBMRGJMZE1IeDFQS1hjSDVyYWdtNDczbjZYZVhGMXQ5VFFlSC15dV9uWkdTdDVQb0hHVW4yZUp6TVFhYVE2WG9ncjVlLW5vNFIxNFNSWW5NUlJaRU92Qm9IdU92bk9UMlVDak90bXliZWlFeFV3Y29Va1VNYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Los Angeles Billionaire Moves To Nevada After California Threatens To Tax Wealth - Forbes",
    "description": "Los Angeles Billionaire Moves To Nevada After California Threatens To Tax Wealth  ForbesCalifornia billionaires flee state’s wealth tax in the most-predictable result ever  Fox NewsBillionaire tax sparks intraparty war in California  PoliticoThe Proposed California Wealth Tax Is Far Higher than 5 Percent  Tax FoundationPeter Thiel makes his biggest donation in years to help defeat California’s billionaire wealth tax  Fortune",
    "published date": "Thu, 15 Jan 2026 15:15:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNeWk3QTdDR3hET0lQNm83ZlMxRXBuUG51dEp2R2xndmxSM1M4cHFhamtqamVWRFFVNFB6eDNQTjhYMEt4TXR5SHBMV1VQMlA4dnNDaHZRb0Q3Y2hBMmVDME9uekNEdVNEeDZHNjJxNTdXTWdSOVQ0UWNwT2E1TUhEVkdNM1gyMmdwZFJuN3ZEZEp2SkZqZzNpOEwzQUdUREx6cklLV041Szhvd3YzbnpsVE5FRXBwUWlYanZxVHpkS3c0Qy1yLW50MFdNdnhHaDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "On the verge of strikes in Iran, the US held off. What happens next is up to Trump - CNN",
    "description": "On the verge of strikes in Iran, the US held off. What happens next is up to Trump  CNNAnalysis: Why a ‘quick and clean’ US attack on Iran won’t be easy  Al JazeeraTrump Was Told Attack on Iran Wouldn’t Guarantee Collapse of Regime  The Wall Street JournalTrump sees Iranian crackdown easing, Tehran denies man to be executed  ReutersTrump says 'we saved a lot of lives' as Iran signals it won't execute protesters  NBC News",
    "published date": "Thu, 15 Jan 2026 23:04:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5yNENPSm5Xd1h6RjV5VWprcnNUZHpIZV9tb0xxa1E3UkpJSW9YWnUybGswcEhtYTZ3Ui13UVlad0hkekdEckUtTFlYMEFGVnpUeEVFMUQtaXVreGpZdUlWX01EMzBaTUZUV254TlpjOVVmWDkwM0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Dueling accounts of ICE shooting of Venezuelan migrant in Minneapolis - CBS News",
    "description": "Dueling accounts of ICE shooting of Venezuelan migrant in Minneapolis  CBS NewsFederal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesMinneapolis ICE shooting: Video claims to show man shot by ICE calling for help  FOX 9 Minneapolis-St. PaulOfficials identify man shot in leg by federal officer in Minneapolis  USA TodayThree Venezuelan illegals arrested after ICE officer 'ambushed and attacked' during traffic stop: Noem  Fox News",
    "published date": "Fri, 16 Jan 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQbE1Edzl6SWFRUFpPQ0VRMk5TcUJuY2E3M29EWkR6bW5NSTdzakEybDE3S0VoQmNCcW10YWx0UjFTYWkxVEhQOXJlMk9TNWF1bFJhRnRrTFg3WUhZbE8xWUhVZ20tR01fWVFUQnJ6OFhJWjV2OTczenQtUW1zZHppZUJTb3hOc00tdHI3S2JTY3c5MG9jQW0wWTBFamRKWWNf0gGmAUFVX3lxTE9PYnoySjVRR1FTTUxzNXVJUFB5c3RzdThkeUZvMkQ4Yjk1VE1KcUpOWHpiU2JFMXdLdHpoNWNWN3dOcDRKZGNQeURWcUZWU3N5MUtaR0hLd2wtZ18tRnJrUXlDRFZtLXNRVHRGeWZoeFpTUVEtdkxOUUVvd0c5S1prajFwX1hESVJoZ0h1cUM3TmwyTXFBOF84T3d1UmpXMW5IZkNkbXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Confusion erupts in mental health and substance abuse programs as HHS cuts, then reinstates grants - AP News",
    "description": "Confusion erupts in mental health and substance abuse programs as HHS cuts, then reinstates grants  AP NewsTrump administration rolls back $2 billion mental health, addiction grant cuts  NPRWhite House slashes, then restores, funding to treat mental health and addiction  PBSHHS quickly reverses $2 billion in mental health and substance abuse cuts after pushback  NBC NewsUS health officials reverse course and reinstate $1.9bn to mental health and substance use  The Guardian",
    "published date": "Thu, 15 Jan 2026 22:18:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNaGlkME1GUFE0bHVnUG9NbDNIRkZyZTBKVm9sT3FjY3VmMGk0QUwzWTNic09vSkdWd2N2Y1VRdTdadHVDeU1JUWQwU0psMUtlc2V1WWdvWXVqRGN5RWVMRm5GV1JoZnYxZTlLcUQ4NjF3YWN1eFhCb052MG5GcTY4QTNXMTF6LUs4Z0xjWWI0M3dFbjFTWGNfRTdINDJ0bEkzbTJUbW1HZ1huU0FPbFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘Unconstitutional conspiracy’: Judge slams Trump administration over targeted deportations - Politico",
    "description": "‘Unconstitutional conspiracy’: Judge slams Trump administration over targeted deportations  PoliticoTrump Cabinet secretaries conspired to violate Constitution, judge says  The Washington PostJudge Tears Into Trump Goons’ ‘Conspiracy’ Against the Constitution  The Daily BeastJudge to Weigh Next Steps in Student Activist Deportations Case  The New York TimesJudge promises ‘crystal clear’ order protecting international students behind landmark free speech lawsuit  The Boston Globe",
    "published date": "Fri, 16 Jan 2026 03:47:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQdTcwWXJreUpHbk5IX2VIblNHZ2FyNWxKanBKMzgwT1VkMGRWbXFsMlFDckRXNEk2cHdJX0JMUjc5YVFOWGtaQTBPSERKLUpzTUI3ejVIbmh0bFMzelRZdHJYbHZyUE9BZnphWGQ2NWRlNTRISm4zOUh3YmVEMkRpT05SVlVmS1IybEhUeFk0TUdoU2tLa2hPOTVfd1hiZDAzVFp0M0RNYzB1MU5Ta1l0QVhGbEVIMEUxa1liTjkxcG5hcUV2ZWZMd2xyQ0VaZWtVQWVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "January 15, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "January 15, 2026  Letters from an American | Heather Cox Richardson | SubstackFacing Contempt Threat, Clintons Refuse to Testify in Epstein Inquiry  The New York TimesClintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsHouse GOP seeks to hold Bill Clinton in contempt for skipping Epstein deposition  NBC NewsWatch LIVE at 7:00 AM PST January 15, 2026 on C-SPAN 2  C-SPAN",
    "published date": "Fri, 16 Jan 2026 06:31:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE91aTZmNXFreS1aeFR1WVV1Ykw1Q29lbVNnSTlXNHRQdjlDT1Fsd3hodWFubW8tT21sRURTOE1ZbGRIZUlKajNQMTFlazFnX1hmQnJBM044anhGNHAtbWpKem5COGZUMzhVekJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "Congress passes bill to fund U.S. science agencies, rebuffing Trump's requested cuts - NBC News",
    "description": "Congress passes bill to fund U.S. science agencies, rebuffing Trump's requested cuts  NBC NewsTrump wants to slash funding for federal climate and weather research. Congress is about to tell him ‘No’  CNNYou just saved NASA's budget  The Planetary SocietyUS Senate passes bill to boost federal science spending after White House sought major cuts  ReutersPro-science Republicans are fending-off cuts to funding  The Economist",
    "published date": "Fri, 16 Jan 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOd1Y2eUtWcE9PVW9tNXJ2bkxyX3JhZXY4WC0yYS10TUpndVlVRm9qQ0pXbTA1ZDhSeEpmc1U5RzRJN19ob3htOEt0UW1hMkFmcWpJUHhVVXB5YUtQMGxBcl9XdGpWbkZOSmRSX25WOEVzLWNTeDgtRXdLcEVGcklBYVVFbUJNU1F3Si04WDlJb0lISE1yam54YzZqR1E5U2w3MXV2UHVPOHNUVE1YeTdIZmtxcmlVNTdDRHNNZ255NVc2UGd1NDdr0gFWQVVfeXFMT2s2eFNFc1hrVjZpcWRFMVo3ZGxWd0o3bWpaSlEzNzU5dUNZOUJFVUdhSGNEYWx0RFdQS3YzR00waml5Ynkzd1NvWU9GSEo1Zy1obXNXRWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "ACA enrollment ends today in most states, as tax credit compromise stalls in Congress - CBS News",
    "description": "ACA enrollment ends today in most states, as tax credit compromise stalls in Congress  CBS NewsOpinion | The ObamaCare Enrollment Apocalypse That Wasn’t  The Wall Street Journal1.4 million fewer people enrolled in ACA plans as premiums spike, tax credits expire  ABC NewsInitial Obamacare Enrollment Drops by 1.4 Million as Expiring ACA Subsidies Drive Up Premiums  The New York TimesDeadline looms for North Carolinians to enroll in Affordable Care Act Coverage amid rising costs, subsidy losses  ABC11",
    "published date": "Thu, 15 Jan 2026 22:30:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNcnlSMWhiV1RMeWRWSy1aLVJ3TFJSbWZtTGo3ajc1MC1Qb1Y0SFNDdXdzcHM0Mjh5TTc5clNpdXBrUTVWQlBJU0RHWlRzUnBGbC1SUV9nMU9wQm1zNUx6QXczR081YlV0cEhQU2lscWV2M2R6VHk5Q2k2ZmxXWEFnSHYxRmNHU3V1YURzX2xB0gGTAUFVX3lxTE5WeWttRTVDMmJyb1lFb1FuR3RjUGZDUGFxZGlNdHJUaHhQejJqY0ZQOXFJeHdFZzN1YUpyRTBCVUhiTnd0UXhldUNXM3Yzc3RzYjlnVDlzVEZQUTJXS09WTTRLTGNwWlRWbjUxMG9yeEJiTERYb0tHRzhxR1NDRUhFNjN0RXVJS0xKeVNSUmNkQ3ZWNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Winter Weather Advisories issued for 13 Michigan counties, up to 8 inches of snow forecast - MLive.com",
    "description": "Winter Weather Advisories issued for 13 Michigan counties, up to 8 inches of snow forecast  MLive.comNew round of snow in parts of Michigan could reach 7 inches; bitter cold remains  The Detroit NewsMetro Detroit snow forecast: More on the way to start the weekend as bitter cold maintains grip  FOX 2 DetroitA 4Warn Weather Alert has been issued for Friday in Metro Detroit -- Here’s why, what that means  ClickOnDetroit | WDIV Local 4Drivers experience rush-hour traffic nightmare as snow creates icy conditions  WXYZ Channel 7",
    "published date": "Thu, 15 Jan 2026 20:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPVFl4NlIzMEtiVVl4ZjNzNFRQMWJXM1UwcUV3WWUyMXFEaWIxbjNaT0dvUEU0UU5OSEl6UnVjOHRuN1liZVlEZ3hyNExWUzMzYkV0b2ktZGJ2RzVIZzRDamxJZ25IVm15SHBFRnV4QTBPN05iUXBUUXc2MkNIOUJqdTNOTm83UmhmbGdEV0RQekFFYmJhRXYyNnFlUlMwMVNWbEFzYkw3UmM4UTJZWDgwZFlJN3NCSDZqdW45R192dEkwNmI0WjBYWlhXN1TSAeABQVVfeXFMT0dTTldLZE5pUHRoZ3BFUDNGWC03cUNTWHFYamRvQ3FtWTUza3dsRDlkUnhCcDlKTnBuenNpU1UwbTBUNHRVdHZJdG9Dc2p5eHV4ZTI4c3gzSlF4TDRtandGTUJnQktSZF96T2kzREVqaWJ3UWhQcXRmVHVKeHZTQXA2WDJQMEwyT1VUZ1J4MVlOWVFhMG91ZExIejZ3TmZrZm5OanBQMm5ndWJFdHZ0eGFDbmRDUUFJaG51NnhJSjh3UEY0LUJoa0RTVjJjd2pnLUMtMGs0TUhZd0ZSLVQ3SnA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlive.com",
      "title": "MLive.com"
    }
  },
  {
    "title": "Man acquitted of murder in S.F. killing of ‘Grandpa Vicha,’ case that sparked Stop Asian Hate movement - San Francisco Chronicle",
    "description": "Man acquitted of murder in S.F. killing of ‘Grandpa Vicha,’ case that sparked Stop Asian Hate movement  San Francisco ChronicleSuspect found guilty of involuntary manslaughter in 2021 San Francisco 'Grandpa Vicha' murder case  ABC7 San FranciscoSuspect found guilty of involuntary manslaughter, assault in 'Grandpa Vicha' pushing death trial  KTVU‘Grandpa Vicha' murder case: Defense offers detailed closing statement  NBC Bay AreaMan found guilty of lesser charges in SF death of 'Grandpa Vicha'  SFGATE",
    "published date": "Fri, 16 Jan 2026 02:31:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPXzlyQ3ZZNFRwa3I3Um5HdUlqVFZWU2dvdlg0ZVVzNmZzQzNuYjMzVDZGZ29lVFVTVGdLLUZIM2ZtazVkRGo1ajZjUVU2Z0FGRkFJOVMxTkcwMmNYV2hjUWhOY29GNWljYnVSbl9xaUJXaWo2WTdEMmlmSWJIdDdYdnNsbThTNG55bUdiblNiN3h3MU0yVnA1d0I1cl8tc2tqMFhF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Why access to Venezuela’s ‘heavy’ oil is ‘tremendous’ news for US refiners - Al Jazeera",
    "description": "Why access to Venezuela’s ‘heavy’ oil is ‘tremendous’ news for US refiners  Al JazeeraHere’s who is likely to profit from Trump’s Venezuela takeover  The Washington PostU.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTrump says US is taking control of Venezuela’s oil reserves. Here’s what it means  CNNExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Fri, 16 Jan 2026 07:40:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOSFl5ZG5FS2lxOGpKYW9FRHB6ZEMxR1lmQlFvTy1Pc0s5WGl0c3djYTZrWVQ5Tk9DRlEyOFZrbjVxQUoxUUdGU3FMczUtZEdkXzFkTWpweHUyVm95SkNxY2dRNTZ1aXpSMGpXZnA5TGM4QlB5X3doX3U0TmpBejhkRlc5RndMV2dmbDRJVzhncTV6RkhpT0U5dVFHXzVyQmdLRHFqUWJfTHBpWDRrYzRZ0gG0AUFVX3lxTFByVldsNHA1MmNLUlROQUNfd25IYXAzTGtsblJ0OGs5bFo4VHRkNU1OYU44S2VrUHVhcVlKV0NoLTJvQzBIUnBXOXFKd0YxZFIwS05zdmd3YXZJQWNSNi01ZUNZQ2ZlWGRTY2ktR3l1VHVZQ0pKanBJVXBnWnZEdW5vcnN2czU5QjF6VFRNUUFXcS12RWRCZnljZmdBQkJLOVRGU21laDN0cUdrVzlhVllDUEJBSg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Karoline Leavitt Crashes Out Over Reporter Citing ICE Statistics - HuffPost",
    "description": "Karoline Leavitt Crashes Out Over Reporter Citing ICE Statistics  HuffPostTrump press secretary launches tirade against reporter who asked about ICE  The Guardian'You're a left-wing hack': Leavitt rips into reporter in defense of ICE officers  KOMOWhite House blames Democrats for ICE violence as Minneapolis erupts, Insurrection Act threat looms  Fox NewsWatch: Leavitt calls Irish journalist 'left-wing hack'  RTE.ie",
    "published date": "Thu, 15 Jan 2026 21:43:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQTVJkUzBkb3Q5bHExNWxiYlh0ZXN0eVZGV2lzXzRTcl9MOEFCWlZ4RnFmRnctVlBJUUcwR29mX0ZkTjgxWDc1MzdaZ21zZTBLd0VlTGtINFNNbGFsQkl6ZFh5TzJZYlRKMjQtNDIzQW9pajM4X0xfQnNKX1EtbTZuaVJZT2VyMm1wbzRfaGZWaFdHVjAzaTlGalN2M1YtUlZJ0gGmAUFVX3lxTE9VUmE5aXY1SktiNEtyb1FLSFhXZWduanZVbGtiRzhUTC13UmxSTkFiZnc5cjl2Y0NCUC1VSE10WjJCNE1ta3BaZEVmSU1pU1M5MnZLdnN3S0NJVkZoM0N2dmE5b3p3TlRDcVlJdHdHOHZRUkhlMEN4SnFWelVaclJnXzc0QWhZNXRRZm1Jd0llMUhNVEkzV3pkalRUa3QzeUZhWDJ6bEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Push for greater ICE training grows on some Republicans - Politico",
    "description": "Push for greater ICE training grows on some Republicans  Politico‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time MagazineAmid Protests, ICE Told Agents to Take ‘Decisive Action’ if Threatened  The New York Times“ICE Is OK with Renee Good’s Killing”: Journalist Ken Klippenstein on ICE Tactics & Recruitment  Democracy Now!In the immediate moments after a fatal ICE shooting, what does federal protocol require of agents?  Star Tribune",
    "published date": "Thu, 15 Jan 2026 23:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQTEs0ZVpEZlV5dEtRazgxeHlycGtCUjFGTlFTY1pqa2gyRDlOakt2SGppblBienNkeDRmMzFxc084UDRCRFZNTWl5b2ZLRXJjS1JpZURzb2g0UHpNRDJqZFlQWkcyTXlZSFU0X1lBNk8yaTBodTZ5VnFaOGs3cXh3dElzazhYZFZPYXU4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Senate passes 3-bill package to fund parts of government, sending it to Trump - CBS News",
    "description": "Senate passes 3-bill package to fund parts of government, sending it to Trump  CBS NewsDems relent, Senate sends $174B spending package to Trump's desk as shutdown looms over DHS funding  Fox NewsSenate plans passage vote to send three-bill funding package to Trump  PoliticoHouse Passes H.R. 7006, Strengthening National Security, Protecting Economic Growth, and Restoring Regular Order  House Committee on Appropriations (.gov)Senate passes trio of spending bills  The Hill",
    "published date": "Thu, 15 Jan 2026 20:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQSHFWUFBBM1RwVXBkTzg5enNJZ3FiR21rdXAzNHF1NjZsNzc3cUxPeEdIMVl4MjExVGJWM2x0bENPbFNpUjhzc0FnSkFxbk9TbXMzY092NXEyd2JfN3JJMFNvZWlDUkVqc3pKYmw3b1ZSS2Vjbmt2aWtwQnpKZFFoR3Y2MnHSAYoBQVVfeXFMTVFWMUtZSU5LRnpib3JfRUM0S3Q4ZFVabXJQMWlHZzA0cXVKMzZkbHh0cWRJUElrWTBnZ2w4dmo3U0RlUEcyTm1YMDY4YjFMajlQeGRZbktxQTRaWjNUS3FDUURUb2xLSzlGWEVCNjYxS05veXl1V0pMd205NU55RTBEYkdZV0FyLVJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "The Minneapolis mayor ‘grabbed the megaphone’ and told ICE to leave his city. Trump doubled down instead - CNN",
    "description": "The Minneapolis mayor ‘grabbed the megaphone’ and told ICE to leave his city. Trump doubled down instead  CNNMinneapolis mayor who told ICE to 'get the f--- out' now calls for peace after another shooting incident  Fox NewsMinneapolis mayor's claims about Utah undocumented population lack firm data  KUTVThe Minneapolis Mayor Who Cursed Out ICE Is No Stranger to Crisis  The New York TimesMinneapolis mayor: ‘I don’t support abolishing ICE’  The Hill",
    "published date": "Fri, 16 Jan 2026 09:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPWnA3ZmdtYmVGeXFpNHpwU1dtbWloV3ZWQndFLVBlcnQyQ2h2ejJXNmc4R0pUTmpfSXNDQjAwNXBaSFJVR3J0cDJMWjZNUmFoakNyTFNLQU9oSDdLMUxtbmMtczRFU19VNGJKcWNnUEZhVkJUMk1BQkxrSTZzQ1A5azcxWFNVOUMx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "How Minneapolis became America's flashpoint for protests - Axios",
    "description": "How Minneapolis became America's flashpoint for protests  AxiosMinneapolis is becoming a critical testing ground for Trump’s strongman project  CNNEditorial | Minnesota is under siege. This cannot stand.  Star TribuneOpinion | ICE wants to make Minneapolis cower in fear. The opposite is happening.  MS NOW‘She was a mom’: Renée Good’s killing amplifies the stakes for parents  The Washington Post",
    "published date": "Fri, 16 Jan 2026 05:16:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOLXVBa1ZBSi1IdXRmZ3RDeE1NS3dpMWdiZ0M2RS10N0hfRVFRdG5CVjNvNkV2enBZUkNtSjFIU1dhSUZhVHY5Vy0wV1ZqcXlmVGpqRlJ0RVJLY3lPNlpYXzVJNlM1Q1cxNU1ObFpmLUhWRXBFREtMSFZCampUaEZQNEJscmtiUzdyTGN2S0xMdm13dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "U.S. forces seize sixth Venezuela-linked oil tanker - CBS News",
    "description": "U.S. forces seize sixth Venezuela-linked oil tanker  CBS NewsU.S. Forces Seize Sixth Oil Tanker Near Venezuela  The Wall Street JournalFootage shows US military seizing sixth oil tanker accused of defying sanctions  BBCUS military seizes Venezuela oil tanker under Trump sanctions  The GuardianVenezuela’s New Leader Enlists U.S. Troops to Bring a Rogue Ship Back  The New York Times",
    "published date": "Thu, 15 Jan 2026 14:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBKb2o3cWI0LVIyMktYSDUzQXBUWFBobUVNZmFBQWNsblhqbDhQRlZ2anRUMnQyQmtTYmFFdVRjTE9SSUU1Njc0bmxVRG9XWUJfYVh3SmNLZUpCbkJvcnZ1ZDlPZW9mMVpLeFdBQUVnMWtadUdsMkVUOGJpcDPSAYIBQVVfeXFMTkt5SlMwbzNxcVFoWGZYV0JXOXdia2tzNnRLTTd4ckZodkF1NFhUZ1RhMzdIYmh5Q3Z0UEs2UHZRWDVSczZDU3JoWU1IQ1I4VS13ZlYyYVBnSzdmZDlKaW52OGtQZjZwM0xGUHRpTE9pdlpIYWlFRVNpX3ZCU0RmQnBrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "University of Arkansas Withdraws Job Offer for Emily Suski Over Transgender Stance - The New York Times",
    "description": "University of Arkansas Withdraws Job Offer for Emily Suski Over Transgender Stance  The New York TimesState rep claims U of A law school dean had offer revoked due to stance on trans athletes  5newsonline.comUniversity of Arkansas, Fayetteville revokes offer for Emily Suski to be law school dean  The Arkansas Democrat-GazetteA Sudden U-Turn at UofA: Offer for Law Dean’s Position Rescinded  KATVUniversity of Arkansas rescinds Emily Suski’s offer to be law school dean, search resumes  KNWA FOX24",
    "published date": "Thu, 15 Jan 2026 22:37:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPQ2hLMHNnNmFTNXg4anBfQVFoNl9YYlRYbmpyMjlFeXhfZnRnVWh5RW9HdHJ2MEZKRHZLeUNZc1JIM0hiTTF2dS1ZTlhQNVlmUWx4Vzh4Y1otQ3g0SnJrU3hfSzUwbVhUb2llbWJicXVYbGVYd1kyZk54eTQ0X2ZCdXN0Y0RWWDVmR3JQeTFBYzZ3RjJ0c3EtZW1sQ080RkJjQWZwVGh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Alabama Weather Update: Uncertain Snowfall Forecast Ahead - Alabama Emergency Management Agency (.gov)",
    "description": "Alabama Weather Update: Uncertain Snowfall Forecast Ahead  Alabama Emergency Management Agency (.gov)Snow in Alabama? Arctic blast pushes rare winter setup into the Deep South  Montgomery AdvertiserAlmost a year since historic storm, snow is back in the forecast for Coastal Alabama  AL.comFirst Alert: All eyes on the weekend  WSFAWinter weather makers make way to northern Gulf Coast; Low chance of snow flurries  WEAR-tv",
    "published date": "Thu, 15 Jan 2026 20:48:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNbTZNbnpGRWFNRnlpSVFNVXZyOUdvNHlmcG9QRFJqNUxjRXBTeDBLeHlwY0hLckloX3Z5dkNxWW93SWpodERCYWxTME5lb3ZVX1h6NmVEMm1BaldhcW1lOW1OWVQ5ckl2U3AwNWNVNFBoOUloMTQtYllGdFV5N3Z5VTE2d0l5R1FVNThJbVNENVNiTHpHYXJGT1RiOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ema.alabama.gov",
      "title": "Alabama Emergency Management Agency (.gov)"
    }
  },
  {
    "title": "US Navy leaders embrace Trump-class battleships - Navy Times",
    "description": "US Navy leaders embrace Trump-class battleships  Navy TimesI ‘did not expect to be told to build a battleship,’ Navy’s surface warfare director says  Defense OneSECNAV: Shipbuilders Need to Hire 250,000 Workers Over the Next Decade for ‘Golden Fleet’  USNI NewsGA Examining Role of Railguns on Trump-class Battleships  navalnews.comA strategy that needs rethinking  The Economist",
    "published date": "Fri, 16 Jan 2026 01:12:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNS0lJT3A2TkxyYXlrbWVQYzJmZlZURVUtTE93YWNtXzRTQ2RYb0tTQmtOZDJTQWlWOHotUWI4TmVRR3B5NEEwdGJkekt2N2FkMEsxa3NLY2RHZExtTnE1R3ZfaENBdDZZUDJEOG5FYkdqQzFHcENrUnpPaWY5QTZsa3Z0b0I3V0ZUWGN5dmJSdHZXcmQzeFEyTDRaMURKOGhPZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.navytimes.com",
      "title": "Navy Times"
    }
  },
  {
    "title": "FBI Raid on WaPo Reporter’s Home Was Based on Sham Pretext - The Intercept",
    "description": "FBI Raid on WaPo Reporter’s Home Was Based on Sham Pretext  The Intercept‘Tip of the iceberg’: The FBI search of a reporter’s home has newsrooms bracing for more  CNNJeff Bezos Needs to Speak Up  The AtlanticF.B.I. Searches Home of Washington Post Journalist in a Leak Investigation  The New York TimesJournalists confront new reality in reporting after FBI raid  The Washington Post",
    "published date": "Thu, 15 Jan 2026 17:50:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE53bHJPdTctZV9DMFphMXRQNnVFTXM1QVRTc0JOLVk4Q0FpUkhaYWpMMUp6QzRzVEhJREhQN0lBMVVRdHdXTUtPd1hjb0lLRHhFbnJObVN2TTN4YlhHRDlWamN5Q2FNb3MwRkNJZmVHcDA3c1JDSEdyWEsxemE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theintercept.com",
      "title": "The Intercept"
    }
  },
  {
    "title": "Hegseth Hosts Japanese Counterpart at Pentagon - U.S. Department of War (.gov)",
    "description": "Hegseth Hosts Japanese Counterpart at Pentagon  U.S. Department of War (.gov)Japanese Defense Minister Urges Indo-Pacific Nations to Link Defense Efforts During Hawaii Visit  USNI NewsTokyo and Washington Agree to Enhance Joint Production of Defense Equipment  وكالة صدى نيوزJapan and US agree to expand cooperation on missiles, military drills  The Grand Junction Daily SentinelAs tensions rise in the Pacific, US partners say they are in for the long haul  Defense One",
    "published date": "Thu, 15 Jan 2026 22:00:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOY0NOMjFaNWtYV01MTE5KWE92U0JubThoOGFEY3V6MjUtUW5tLWd4Q2p0d3h5QWhhU0taMHhHTXVORmRJTl9ZaEdqOW9YNmJCdEZTV2dzeTRnQjFPREFJUW8zTnVFOUlsNk1vbTN0UENMN3R0R3JBM08wemVHM1VXdHZXLU52Z2YxWWtzRng1UUd1NmtuVlNxamkwYmtXS1dSZzA1RVpBV19jYWl0LVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.war.gov",
      "title": "U.S. Department of War (.gov)"
    }
  },
  {
    "title": "U.S. Sanctions to Support the Courageous People of Iran - U.S. Department of State (.gov)",
    "description": "U.S. Sanctions to Support the Courageous People of Iran  U.S. Department of State (.gov)Iran protests: US sanctioning Iranian officials over 'brutal crackdown'  ABC NewsUS imposes sanctions on Iran over crackdown on protesters  ReutersUS sanctions Khamenei aide, other Iranian officials over protest crackdown  Al Jazeera'Rats fleeing the ship': US treasury secretary says Iran's leaders moving funds out of the country  The Times of Israel",
    "published date": "Thu, 15 Jan 2026 15:59:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNa2JKV2RYSThWWGMxVlFVRkpzdnBZTXBheWcxVVRFcnRUYkdnUC1GbTBNZXFXU1dDanlGZ0lKN2txU1poNmFfOE1qc2s2Q3g1Wm52OHp3amtEMFN0c00xZHY2WFByUy13QzNaSzRZa0lGelhTZURxOGJNdXRGOWU2cmhicVcwME1lcFVTZks0b3BiTkJLZmYxckFaZU1TYlpPVnhxOEtXd3lBYnVsM1FPU2ZPdU5VVnFGbmJLbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.state.gov",
      "title": "U.S. Department of State (.gov)"
    }
  },
  {
    "title": "Will Florida and the South get hit with snow this weekend? - The Washington Post",
    "description": "Will Florida and the South get hit with snow this weekend?  The Washington PostSnowflakes could fly in Florida, Georgia this weekend as freezing temperatures will spread across the South  FOX WeatherChance for snowfall on 2 nights in parts of Georgia this weekend  WSB-TVSorry to rain on your winter parade. Florida snow seems unlikely | WeatherTiger  Tallahassee DemocratCould it snow in Florida this weekend?  Yahoo",
    "published date": "Fri, 16 Jan 2026 00:30:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOR0liS3hlWk5iM29MTGtyaFpDVjJ2bnNNcXBycmxjQVAwcHg5X3J6U2I1VWNGUHo5dXB4OWduaE9DS1VFMjYtZUxIWXExdTNXX1otYm41cE9seGZDcVlZa3Fya3lJSXBmRUNhRGp6RGJxd1N4Ukc4OUE1cFpyYkFLVHdYR3lNNnAw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "3 more Democratic lawmakers say they are under federal investigation over illegal orders social media video - ABC News",
    "description": "3 more Democratic lawmakers say they are under federal investigation over illegal orders social media video  ABC NewsDemocrats, Pennsylvania Rep. Chrissy Houlahan, say Trump administration is investigating them over video message to troops  6abc PhiladelphiaJustice Department reaching out to Democrat lawmakers seen in video telling troops to 'refuse illegal orders'  Fox News4 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them  The New York TimesDemocratic Rep. Jason Crow contacted by Justice Department after video to troops  CBS News",
    "published date": "Thu, 15 Jan 2026 19:32:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPMmwxWVN3TXRUZDNVUmlYZ0laeVVQVWhzd3dWczZicUVhcEhtQWRGWFVKVUxwdkJYSkVlTmNvbWY4U1hBV0J0V01lRlM1aG4tUmprYWlSb3owRzVqOTNRT3dkYmVNZmIzZkR0dTVVdndISV9GMWlfQld4Qi1QUUUtaWJHenB1ZkRuWWpjRXg2U3BlcE1yQkdzTU9jQ2l2M0htbjNualM1NVFVQ3Rnb25fNDVGZVZSb2w10gG-AUFVX3lxTE1oRGNReXJpRC1BNTF4aXU5dlVGcHZPckwzS0lMaHUzb3BEZHQtZ3FzOXVLQlJKbFp2WUs5czdwNDcxejJmekY2WFJ0c0h2ZURQMmFNUFNFc2dQZTFpaGRRMHBPTGQzVmdtSmZVcE5MYk1ZM05qcGlXR1BqOTNsZWtORXlGMWlXTVpmdnRyemc1YWlfaDR2dDM4NGM3NlB3d2wzZTI0Zllfai1fRG9wT0pWQkFQdV9qNGUwUUk0cFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Florida Supreme Court ends three-decade reliance on ABA, handing win to DeSantis - Florida Phoenix",
    "description": "Florida Supreme Court ends three-decade reliance on ABA, handing win to DeSantis  Florida PhoenixTexas law schools no longer required to be accredited by American Bar Association  KSATFlorida breaks ABA grip on who gets to take the bar exam  Tallahassee DemocratFlorida Supreme Court says state should end only using ABA to accredit law schools  Tampa Bay TimesLaw's Paul Rose discusses how Florida and Ohio are considering cutting ties with the ABA  Case Western Reserve University",
    "published date": "Thu, 15 Jan 2026 17:46:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOaDNTbk41Rzd3ajZsZTZ3NThjQ19NQi1vWWJXSjN0WmZDNUFDazl6amtWbzdTWU80N1luN0RPZzYzTmhKbGZkMXl3ZDY3Qlp2TWlMQ1hqY0ZXWWJiM2pCaUhKVGNJSnhxSGt5OEFLMkZ6eFllMXlyRGp2cmdSU1NKUWY5ak5PbGRSVm1wNUQ3RXpoREs5QS1ibjRxWEtZTF9lZVd5RjdiM2RUUW1oOWtQdkZIOUh2bHFId2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://floridaphoenix.com",
      "title": "Florida Phoenix"
    }
  },
  {
    "title": "White House: Trump Only ‘Joking’ That There Shouldn’t Be Midterms - Forbes",
    "description": "White House: Trump Only ‘Joking’ That There Shouldn’t Be Midterms  ForbesTrump muses on midterms: “When you think of it, we shouldn't even have an election”  MS NOWIs Trump Serious About Canceling the Midterm Elections?  Time MagazineTrump: ‘We shouldn’t even have an election’  Democracy DocketIs Trump getting impeached in 2026? Here's what he said about cancelling midterms  The News Journal",
    "published date": "Thu, 15 Jan 2026 17:49:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQX09zN1ZNRldjNEFmU0gxeTQzazlsQzZTeDZZTDVZOFN0VDlNYUxGS3liYnF5WElEYmo2dmF6RzVJeUpLS1JOU1FqU1ZyLWVBY2hpYVQwM0piVEN5X2c5V0JvMy1EaDhLcHFNQkdXdDFFRTNZMUlSZk9QQW9vNDNpVW8xTEcwT1RQWkxnMUJjVXFPTDhoQnh6clBlNW1pZ1cza0lmaUtnRmVJbEdv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "U.S. Says It Erred in Deporting Student Traveling for Thanksgiving - The New York Times",
    "description": "U.S. Says It Erred in Deporting Student Traveling for Thanksgiving  The New York TimesTrump administration says detaining college student trying to surprise family was a ‘mistake’  The GuardianDeported Babson College student asks US government for help  The Boston GlobeUS apologizes for mistake in deporting Massachusetts college student, but defends her removal  CNNTrump administration says in court that Babson student's deportation was mistake  NBC Boston",
    "published date": "Fri, 16 Jan 2026 04:46:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPdkE1NkxnZHJCUV96T3ZDU01LUW00aXpPZTYyUlVvWGh4ekpjbWxpSldSVlplanpkUmVsYjBldVViSWlpN0NyMDktQ0lfLWdhXzU3YXJvTVZ6SUo4YVF2bGVvdC1TcTN6bS1uZUNGN0dhSXdlMHNKZGRvMkNhYU5Kcm1LUXhCeHRsS3dUUHpDOUxUNElDSVlqeHFaMUlORFpIMVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "WWE star donates $5K to heckler who called Trump a ‘pedophile protector’ - MassLive.com",
    "description": "WWE star donates $5K to heckler who called Trump a ‘pedophile protector’  MassLive.comColbert Jokes That Trump Has Found ‘a New National Bird’  The New York TimesDonations for suspended Ford worker who heckled Trump top $800,000  Detroit Free PressTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The Guardian",
    "published date": "Thu, 15 Jan 2026 21:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPU2xNVTR2YTFPaWU4R3hjTC1MY0lNTWN5QXV1eW1nblFYSDN4RnhLd3BqWnBoZVdIbWZSd29YZWl4YkpyNEhjY2NqNElVOUJtdDMyVzBZRXg5MVVPb3llck5fQmh6dGlrRF9DNFVmWnVnSFl1VW1xVU5NcG1tc2tUaVlCN2xHR29kcmFaMmNzQ2hJTi1rRmM3UHFEckJjZ29ldVhyNEx0VU5UYmdyZ0h5ZXJEczBUdHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive.com"
    }
  },
  {
    "title": "Colorado’s governor gave his 8th and final State of the State speech. We analyzed everything he said. - The Colorado Sun",
    "description": "Colorado’s governor gave his 8th and final State of the State speech. We analyzed everything he said.  The Colorado SunGov. Polis looks back on two terms, and ahead to one last session in his final State of the State  Colorado Public RadioGov. Jared Polis gets more pointed on Trump, reaches for familiar solutions to Colorado’s challenges in final year  The Denver PostColorado governor mentions rising cost of living, artificial intelligence and more in final State of the State address  KKTVGov. Polis talks Tina Peters, current moment in Colorado and future  kdvr.com",
    "published date": "Thu, 15 Jan 2026 22:29:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQOS1LX3ZWSk13anNpZl9lVFNFOEhFR2xjWE9Wc0ZSNzc1cW5RQVN2YXhsYnU5SXFwQXV6UGtfcnE5WU1OY242VndVVFptWEYxdjZKWVFvMVlfbWlOeHBKdFllY0d3MDBIMlhsOXgyZGkyMnd4MVZqcFFMX1V4NGxLYmlSaHE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "FBI offers reward in connection with damage, theft from government vehicles in Minneapolis - Star Tribune",
    "description": "FBI offers reward in connection with damage, theft from government vehicles in Minneapolis  Star TribuneMinneapolis ICE shootings: ATF arrests man who allegedly stole FBI weaponry  FOX 9 Minneapolis-St. PaulLatin Kings gang member accused of vandalizing FBI vehicle, stealing government property in Minneapolis  Fox NewsMinneapolis family says federal agents raided wrong apartment looking for items stolen from FBI vehicles  CBS NewsFBI offering $100K reward to find items taken from federal vehicles after ICE shooting  Bring Me The News",
    "published date": "Thu, 15 Jan 2026 23:20:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQMHVqenJ0d0JuRGlfMXB6cndIbG1qRTN6emUwMzF3SDdNNHR5a2tjTmNFWG9xMEwyX2NVWmQ2bHNDM1QwOWZiOWlyMUtveW5Kd05JSWRCT0lkRnYxYkpCWl96a0FHVVVLYzhPOFc5LTdhSkxONTEwampkU2txT19waDFObmlodFExWndpLWNtdGhfNFg0Z0xXR3d3RG1RUHZkeW91ZUxNS21vOERhYl9lY2hvV1dXMDREZFFOa0xIQTdkVzJINW1idUQyN3ViVXBwUkh0S04wWWZhVlpiVGM3MUVBcGZiMjV1Tngw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Secretary Noem Announces New Deputy Director of ICE - Homeland Security (.gov)",
    "description": "Secretary Noem Announces New Deputy Director of ICE  Homeland Security (.gov)ICE deputy director resigns to run for Congress in Ohio  CNNMadison Sheahan, ICE’s No. 2 Official and a Trump Ally, Leaves to Run for House in Ohio  The New York TimesMadison Sheahan, ICE's No. 2 official and a Noem ally, leaving agency to run for Congress  CBS NewsNoem announces new ICE deputy director  The Hill",
    "published date": "Thu, 15 Jan 2026 22:27:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOU0ZoZ2MtOWw5aE1ISFRfQzFjeEloclRudnIzbm9JOFhnWkl2MlUzWFlFN1cxX0Q3SjlycXpwX0ZMUnlLa29EalpldnVCQkUwVXQySUhOZGVUdVBxbkhmYVEwS2t4MG5qRTAtVnJTdXp1UHRrWjFTaThNZlBZZ0p0dEs2YnZiU2IxVFhqWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "California GOP appeals their redistricting loss to Supreme Court in last-ditch bid to block voter-approved map - Democracy Docket",
    "description": "California GOP appeals their redistricting loss to Supreme Court in last-ditch bid to block voter-approved map  Democracy DocketFederal judge scorches Dems for pandering to Latinos with California map in fiery dissent  Fox NewsFederal Judges Uphold California’s New Congressional Maps  The New York TimesProp 50: appeals court rejects Republican bid to block California maps  The GuardianFederal judges allow California congressional map to stand  Politico",
    "published date": "Fri, 16 Jan 2026 02:19:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcDJGSnpkOGZCaVVvWXBGQXdTeDh4M3JkMDlNUzBHUEVlTmNFV0ZJMTBnUV9NeHpEYUQ1czNrUGFtLTRiLUxiR1JQMlA0Q3cyb29hZWNodkY2OE9SR3I3QVY3RzJfTjRRU0Jqa2oxYUlSYXhQYlFSZk1pXzU1RnRMMFpsLUdRa3RLZ3YyWWlaQXlodWhBWDhJRFR1RVFpVFFSRVlSc3dOcU1tbkxQUXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Newport co-ed cheerleading team is at center of Trump transgender athlete crackdown - Portland Press Herald - Maine Sunday Telegram",
    "description": "Newport co-ed cheerleading team is at center of Trump transgender athlete crackdown  Portland Press Herald - Maine Sunday TelegramChamplain Valley schools face federal investigation over transgender athlete policy  VTDiggerFeds Investigating Hawaiʻi Schools’ Policies On Transgender Athletes  Honolulu Civil BeatNewport co-ed middle school cheerleading squad target of federal discrimination investigation  Bangor Daily NewsFeds investigating UNR amid national transgender athlete debate  Reno Gazette Journal",
    "published date": "Thu, 15 Jan 2026 19:20:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPMEcyV1JvYXZsX3lua3loSWNiZlVfb3RSd1RDNXRoTDJlRjBveS1JVmdRUE9hbTJjXzcxRGh5VTlaTHpiNjhmYzZRVUhyUl9zT2ZqemVHaXJoODAta0Y1ek9Ba2w5WndEWmtaOFFXZDhnQm9LclBDRVZEOWlIeUhPSkhSeGFyY1hrbTNMU3pua29oM01xRmxtZ05EVC14NXg3MWJVbUZJQk90bG5HVEZVSTZTaUpuZ0pKYU1CMFRmNGRFeGY2cHNjQ1l2RGgxZXBrQkxCMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pressherald.com",
      "title": "Portland Press Herald - Maine Sunday Telegram"
    }
  },
  {
    "title": "3 deaths, dozens of illnesses linked to California poisonous mushroom outbreak: Officials - ABC News",
    "description": "3 deaths, dozens of illnesses linked to California poisonous mushroom outbreak: Officials  ABC NewsDeath Toll From California Wild Mushroom Poisoning Rises to 3  The New York TimesForaged mushrooms in California linked to 3 deaths, 32 additional hospitalizations  KCRAAnother California resident dies of death cap mushroom poisoning  NBC NewsCalifornia reports largest outbreak of deadly mushroom poisoning  SFGATE",
    "published date": "Thu, 15 Jan 2026 19:16:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNd0VZdlpOYkZ0aDdBcVNBZVhaOWYwZEJxWUh3UXQzeHFnbGZoWnZzVUVUTENiS25PNm5nWFphLVVseHVZMUVzWk5FMEVYS21IVmNLS3lQeWxqVVU2cWhVUkZmcklGNi1VQlhob0h6Y1ZLZ3V4WGxnYU4waEVRSm9tUW5vdUNtN1JMM2Vtc2JJT05fdFNJRElpY0xiWW52UW84RUJjaTQtM0p3a2fSAbABQVVfeXFMUC1OOC14VDdoMTlEdTlCNjJLQnd2UFhRXzR5bEEtNWRIRGdod2dIT0JDZWJWSHpSVWFEdEh3Q3NUY1hpang0V1Y5eVUyR1o0WGhPRXM3UnFmQVRsZnhLLXNIcDE5REhLYkV5akZyVWlrYVV1aTRpLWF2NGZRNUw4M3lxWXhiQWhDWXpnS04wT19TWmotZzBmNDN6WlBVWjBOTUpvbHhINDVUWHhBbmhBQ2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "New $45 TSA fee to go into effect Feb. 1. Will you have to pay it? - OregonLive.com",
    "description": "New $45 TSA fee to go into effect Feb. 1. Will you have to pay it?  OregonLive.comNo REAL ID? TSA to charge travelers at airports $45 beginning in February  Fox Business$45 Fee Option for Air Travelers Without a REAL ID Begins February 1  tsa.govRDU REAL ID NC | Air travelers will pay $45 at Raleigh-Durham International Airport if they don't have proper identification  ABC11TSA tightens REAL ID rules: $45 fee hits those unprepared for February deadline  WCIV",
    "published date": "Thu, 15 Jan 2026 17:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQeFoxV2xMU2YwUUpiYXhKZzZpbU4yUjdRcHBsRXoyVDlmYk1ESGNSM3ZBZ0NHTmlUTXl3RndpMmdyTThIRFBLM0lMRF96OHp4NDhvYkJJM0VNWVBweTQ4WWRqeFRDeDFiU18zNGN3REhrc0xfMkdUeWhkN3VwY3V5cV83Yk5FTTRDR1FIQlZ5NTFBMTRnNkVwMlNlcWU5WlB1dXB6QXhUN0bSAbwBQVVfeXFMTW9HY09kUlpOYWVQUVdjX2w3M3hDWjhtM1h5aVNpeGhkOXhSOFJTYjhLTnBDTE9pdks1RWpxeTluaUI2S1M0ejJEeWJ0UG96WkNyYXNqbFRRbjFNNW45NzhvekhESXdYZ2ZlRVhEVHRBUHNMN2ZSTU1STDlMUjV2dC11ajdQS0xTLXlaakViNGxqM2Nwdm44ZXIwLXozcE9aSkg5Z1JmQW9iY1ZJWTdQenA4eC1pSktSSExFdmg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "What a wave of resignations means for Minnesota’s highest-profile federal cases - MPR News",
    "description": "What a wave of resignations means for Minnesota’s highest-profile federal cases  MPR NewsSix Prosecutors Quit Over Push to Investigate ICE Shooting Victim’s Widow  The New York TimesSix Federal Prosecutors in Minnesota Step Down Over ICE Shooting Investigation  The Wall Street Journal\"Darkest day\" for rule of law: Ex-federal prosecutors react to U.S. Attorney's Office resignations  CBS NewsFederal prosecutors resign over concerns about probe into Minneapolis ICE shooting, source says  NBC News",
    "published date": "Thu, 15 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPT19nRS0yR3ZHLS1PWFdaNi1VT3VWaEdQZHo5MjQ2OE8yd3ppamt3RUVobHRzc3ZIN2RtT2l1SmRiNEhmWm00d1E0X1FRZ2hBRVBWOG1IUzBXaHgwVjVSSl9rUWZzZ3BCTEl3N24zX2R0Q0ZVS0FRNjlYVUgyR3EwLXhPZGd3eXFZU0VQREhpSGJtNWZDV05NZHBlVjVsbDdaOHo2dUhKbU85QjR2bUVINA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "CBS News report on ICE officer’s injuries drew ‘huge internal concern’ - The Guardian",
    "description": "CBS News report on ICE officer’s injuries drew ‘huge internal concern’  The GuardianLeaked Emails Show ‘Concern’ in CBS Newsroom Over ICE Agent ‘Internal Bleeding’ Exclusive: Report  YahooICE agent who shot Renee Good suffered internal bleeding, officials say  CBS NewsICE agent struck by Renee Good's vehicle suffered internal bleeding to torso, DHS says  Fox NewsICE officer who fatally shot Renee Good suffered internal bleeding; extent of injuries unclear  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 16 Jan 2026 01:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPLVJjTXBsS0owazVmc0NGZW13dWtGeURhQUtuVGEwRkFwYnREb242M0x4bTFZNXYzTFVnVmFBX1NPXzYyWHgzLVlxU0ttT3ZmNEF5cTlUNV9BVEhoajB5clBPaEdLQl9JNE1XSXdvQ0VfdHZCZWtYRDBCSE50UVZqcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Why the Trump administration is holding millions of dollars from Venezuelan oil sales in a Qatari bank - CNN",
    "description": "Why the Trump administration is holding millions of dollars from Venezuelan oil sales in a Qatari bank  CNNVenezuela oil fetching 30% higher price, U.S. energy chief says, after first sale worth $500 million  CNBCDonald Trump’s first Venezuela oil sale deal goes to megadonor’s company  Financial TimesTrump is sending funds from Venezuela oil to a bank in Qatar: report  The IndependentUS completes first Venezuelan oil sales valued at $500 million, US official says  Reuters",
    "published date": "Thu, 15 Jan 2026 20:02:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5DLU5EVVVhOTBDME1Ydk9SeTJiVFpKdFBIX1lzNEZNQnhNME1wWW1wZFk3Nkh2dVdzM2dBbFJFTzFXUUVNWktuOHN1a1d1YUlNaThVSVBFdG83bVF5LUVGelJyRTNNZ2xVZWdiak5fOW02OS1pOW5CU0U4NVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Pentagon says it will ‘refocus’ Stars and Stripes content - Stars and Stripes",
    "description": "Pentagon says it will ‘refocus’ Stars and Stripes content  Stars and StripesPentagon moves to turn independent military outlet into a ‘mouthpiece,’ advocates warn  CNNPentagon says it's making Stars and Stripes, the independent military newspaper, \"woke\"-free  CBS NewsStars and Stripes job applicants are asked if they back Trump policies  The Washington PostDefense Department to overhaul military newspaper Stars and Stripes  Politico",
    "published date": "Thu, 15 Jan 2026 21:08:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPWTN5NWxSRUNZaWI5ZzNrQWhXdDRrVDREaWtRMEdQc0FmeDdtRVNOSWhpbDhscXRrdkJkZXB5ZDlGNlEwYko2OUFtTkJxcUVaMjB4U25lQTF6R3lTa3FLRENIQlRjRDlfQzNVMHJ1TEFfSHlzeWtKaU9LTHBldEVZbEhHUktaNzRiSWVsYks5emxZOHRjWkEzWmtYSGlnbDhDOEJIbDZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.stripes.com",
      "title": "Stars and Stripes"
    }
  },
  {
    "title": "Talarico up 9 points on Crockett in new Senate Dem poll - The Texas Tribune",
    "description": "Talarico up 9 points on Crockett in new Senate Dem poll  The Texas TribuneNew Poll Has Bad News For Jasmine Crockett In Texas Senate Race  Forbes‘We’re going to keep campaigning as the underdog’: Candidates react to new Senate poll  KXAN AustinTalarico leads Crockett in Texas Democratic Senate primary: Poll  The HillTexas 2026 Poll: Talarico Leads Crockett for Democratic Senate Nomination, Cornyn and Paxton Face Potential Runoff  - Emerson Polling",
    "published date": "Thu, 15 Jan 2026 17:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQUC03bHd5NkVUcXBVNFNsd3hYRDY1LVQ2LVJSMWVYbVVzOVNkbUtrQlNoZjJHTWFKdFZsdWJhekx0dHY2a29ENllTUnFkajhGTHBCdnZHcXJtaVhSeDdvT2lXcmZZYnAzN29IUU1IUGU3VGJ1X1hCVmxHZ0d3N3VKOWdGQWpCY3p5LVV0dDNNWTdUMnpuc1BQZUJ3Y3V6WThKRUptMUtTQURvNUdp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Majority of Americans say ICE agent’s shooting of Good was unjustified and inappropriate; ICE making cities less safe - ABC News",
    "description": "Majority of Americans say ICE agent’s shooting of Good was unjustified and inappropriate; ICE making cities less safe  ABC News1/13/26 - Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University PollOpinion | 2 Polling Experts on How the ICE Shooting Is More Trouble for Trump  The New York Times5 takeaways from new polls of the Minneapolis ICE shooting  CNNThe Tea, Spilled by Morning Joe: ‘Down, down, down’  MS NOW",
    "published date": "Thu, 15 Jan 2026 22:25:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxObWV5ZzdsZlU0aVdHTWwweVNVTEswaGtheXFiRWllVGY0VExJMUtacVdXSTl3UElWaWo1R1Q0aFJPbXpJTkNvaFYzblBrUjVBYW1TZndvMVZ3bmhKckRONi1pUHdDTVhFZFZGclNCU2N4eUo4UDV6czdicEZCYkJCN1ROVTRTN09RaGs5ZHdUVzh6MV8zXzZRdTBxaVJjc0s4aFpOajM1bXVVd1JyaEE2cmV4UHRqZFN6MTVwcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  }
]