[
  {
    "title": "Democrats amp up calls to ‘immediately fire’ Kristi Noem after Alex Pretti killing - The Guardian",
    "description": "Democrats amp up calls to ‘immediately fire’ Kristi Noem after Alex Pretti killing  The GuardianHouse Democrats to investigate Kristi Noem with eye on impeachment push  The Washington PostFetterman demands Trump fire Noem after deadly Minnesota shootings  Fox NewsHouse Democrats' support for impeaching Kristi Noem surges after Minnesota shooting  AxiosHomeland Security Democrats: Noem will be impeached if she is not fired, resigns  The Hill",
    "published date": "Tue, 27 Jan 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZDh6Rm9STnhQbU9uVHF6ZkdjRUpRZm00c1NsU3pYdzZBelhHZ3dENjRjMjRLNmdDYVZiczAyczJ1MTRJRFZra1BwMjBvcmliR2RpejNrTHZtZTFzQnZwcnhuTjFQWDlzQ2JlaEdjeVRwZFZUMVAyM3ZrajlJMEZBM2Zqb28yemliS3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Minneapolis Live Updates: Trump Pulls Bovino Out of Minnesota as Judge Orders ICE Chief to Appear in Court - The New York Times",
    "description": "Minneapolis Live Updates: Trump Pulls Bovino Out of Minnesota as Judge Orders ICE Chief to Appear in Court  The New York TimesTrump shakes up Minneapolis immigration operation as White House seeks damage control  ReutersLive updates: Top Border Patrol official set to leave Minneapolis as Trump sends border czar to state  CNNUS immigration chief Gregory Bovino set to leave Minneapolis after deadly shooting  BBCBorder Patrol boss Bovino out of Minnesota after Alex Pretti killing  MS NOW",
    "published date": "Tue, 27 Jan 2026 18:24:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTW9VaGc3dE83QnlGTnpkbHg5T2VyT2k2aGVfenZCQk1xMjQ4andxYTIwYVkwSDNESFpha3h1TFpOSUNfUzZfSW5jeko4STBucUxCOTVzMDRZUy1VelotXy1tc3ZHR0l1QlZpQ3E2eVBfQVNHRlAxLXVPUTc5M2JBQVhERQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Could another storm hit the East Coast soon? Here are the possibilities. - The Washington Post",
    "description": "Could another storm hit the East Coast soon? Here are the possibilities.  The Washington PostLive updates: Millions digging out, thousands without power as next winter storm threat looms  FOX WeatherAnother potential weekend snowstorm looms for NY, NJ: Early thoughts, forecast  fox5ny.comForecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios  CNNWeekend nor’easter could bring another shot of stormy weather for snow-weary New England. Here’s what we know.  The Boston Globe",
    "published date": "Tue, 27 Jan 2026 18:16:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZkpsQUs4UjBQbFZNYm9iUzZ1d1lZSnMyQWtZUEVnYTU5clloLUJuRlZ6QXQ0bFZiOWZFM0ZYRGs5aFlRMWt1aVUtcG5QNExURF8wUk1DbkIyNmFkek9Pd01TOUdtbkM2YThCOUJvMm9IVXJiVXRvTlFJTnU1b2E0VUU0WG55T0pWZkQ3cFVCWHlXcXkzYkJBZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "White House backtracks initial claims about Alex Pretti after intense backlash - The Guardian",
    "description": "White House backtracks initial claims about Alex Pretti after intense backlash  The GuardianTrump abandons attack mode as Minneapolis shooting backlash grows  BBCWhite House Distances Trump From Initial Response to Minnesota Killing  The New York TimesWhite House distances Trump from provocative claims by Noem, others on Pretti shooting  ABC NewsWhite House avoids Minneapolis tirade as signs suggest Trump backing down  The Guardian",
    "published date": "Tue, 27 Jan 2026 15:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQOU9EbjJpY2o5WjFDT3Q1OTd6YjNJZklwZ0taV3V5TFpWeHl3djQyTjFrdHlYZUI4RFNxWDFpeXhCYTNmQnlLQmluWlg0TUZHVUJTeXVhaXl3NlNxV2xSY0NZQm1DZzg1ZWcwM2xLb2ZzbnQxSWVBcnBYTkdBSlhBelZGQTNETUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "First wrongful death lawsuit filed against Trump administration over drug boat strikes - NBC News",
    "description": "First wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of two men killed in Trump’s military boat strikes sue US government  The GuardianTrinidadian Families File Wrongful Death Lawsuit Over Boat Strike by U.S. Military  The New York TimesFamily of Boat Strike Victims Sue U.S. for “Manifestly Unlawful” Killings  The InterceptTrump administration sued over 2 deaths in boat strike off Venezuela's coast  Reuters",
    "published date": "Tue, 27 Jan 2026 17:00:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNQ1hELWhUMTltWS1ueE1QUXNaM0R1TFpMcEtPQ0ozLWZRSTU0dXNpVGh1emt4MGJWT3kxZjM1UndLV0xpUnMtazdNd3JoZWVmN281LXZKdmJyZkJHNFpPZHAwNmdzdDRHNTdONjVIMXFmVTNwZU9XdF9JbXNlVHFxSjdmelMwOVZsWUpJNXlxQ2RmbUUzNE5wY1JkZFBNTUVxSDF4QmdKQjFHQTFZQkNpWEFSQUlpSHJiTnhNemFMeDctQk1y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling - CNBC",
    "description": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling  CNBCJudge Orders ICE Chief to Appear in Court Over Potential Contempt  The New York TimesJudge threatens contempt for ICE leader, orders him to appear in court  Fox NewsMinnesota raises unprecedented constitutional issues in its lawsuit against Trump administration anti-immigrant deployment  The ConversationAppeals court declines to reimpose restrictions on agents at Minnesota protests  The Hill",
    "published date": "Tue, 27 Jan 2026 14:57:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNV1FlZWhpUGhJbmczVldLSk1Sc01SaEI1bDE1ZEQwUVM2aGt4T2xUZHQtT0pwTWlxMWR3aGJWR1Q5Rk1VSTZjbW5tMERJMGg1VW9NVEdoMGd6Q3lKMWRZTmJEU0J0TmZQOUUxSU05VENSOGNjNi1JaHRnYl9JQ3kzaVhpbXBsbk14QWfSAY8BQVVfeXFMTmpYZ3ltTWQ0OFhvN0YzZDRoZC1ial9YM3lxSWptWXFUMFl6OVRoLUpCTlhFMThUMHlydG1DZ0E2X0ZpZjVfMzhwbTlqNGRmQlFjN1VjakVJVC1UemNGcUUyUHZiMHdNSElmOVB6azBxRlVKamJXWk1kUm5GUnNCSVY1MDVub3NSQmlzd1BPRTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers - The New York Times",
    "description": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesAlexander bros: Another NY jury will soon weigh the fate of men accused of using their celebrity and money to assault women  CNNFederal sex trafficking trial begins for luxury real estate brokers and their brother  NBC NewsWealthy Florida brothers face trial over alleged decades of sexual abuse  The GuardianAlexander brothers had sex trafficking playbook, prosecutor tells jury  Reuters",
    "published date": "Tue, 27 Jan 2026 08:00:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNnVzRjZCR0xCNmtRb3pBd2VZNjZLeG1wWllXRHBYdFBEak5EODZTTEpwdEJ1SDF5ajZ6ZnkyLXhHYlc5aFMyaTRsa01yQkh5aXVJRklnTThXT3ptYlV4WW15VlpSQjRGUUxmY2ZnZVVPQjRpTi0wXzV3aElndWJOblpDa09JSGdnYkZVNFprek03dTBINndvNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘It’s not like the SS are coming’: Italy bids to quell ICE furor before Winter Olympics - politico.eu",
    "description": "‘It’s not like the SS are coming’: Italy bids to quell ICE furor before Winter Olympics  politico.euICE Agents Will Join Olympics Delegation in Italy. Many Italians are Angry.  The New York TimesItalians furious over deployment of ICE agents to bolster US security at Winter Olympics  CNNUS to send ICE agents to Winter Olympics, prompting Italian anger  BBCReports: ICE agents to have security role at Milan Olympics  ESPN",
    "published date": "Tue, 27 Jan 2026 16:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQdzItZEdyWEx2NmlDX2QxVEVHVlFYeWlLenp2ZkMwaTNScFJmSFhZa1huVXA1V0w3XzJON3pSVTBUQVlMNVJlVU9uSzdhZmJzcXNzY2JkWFA1alZ1MFhHb09IY3VIN242VzY0MDIzQWdPRDRpaXFCdWZ6XzNmLUFEbHJjU3dsc0dFeFFnOVl0bmxVNFRPMG5wTHVHeGlCbHJWakk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Florida Republican Vern Buchanan won’t seek reelection - Politico",
    "description": "Florida Republican Vern Buchanan won’t seek reelection  PoliticoFlorida GOP Rep Vern Buchanan to retire, adding to wave of House exits  Fox NewsVern Buchanan to retire from Congress after 20 years of distinguished service  floridapolitics.com'Pass the torch': Southwest Florida's longest serving GOP Rep. Vern Buchanan to step down  komonews.comHouse Republican Vern Buchanan to Retire — Latest Domino to Fall in Capitol Hill GOP Exodus  Yahoo",
    "published date": "Tue, 27 Jan 2026 15:35:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNbzBpTFhxaVJTQTgxZFB0eDI5LVZtNzQ0aDVnT2hUcFlYbmFqazlqRHlITkFYRGxDZXgxYWItQUtHYUpSX0YyajRCRWhuTi1tVjZzeGR5Q1NNMG4yLW1aeENmNzNabF9OT3FGVk8zaE9UQ1lMQnpvS3gwa1Q0dG9sWUItZWE1ZWdKckVuN1Q2eGtyc1dvaW5tTVlZZVpSVWJw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The 'Doomsday Clock' is now 85 seconds to midnight — the closest it's ever been. What scientists say this means for humanity and how the time is determined. - Yahoo",
    "description": "The 'Doomsday Clock' is now 85 seconds to midnight — the closest it's ever been. What scientists say this means for humanity and how the time is determined.  YahooDoomsday Clock 2026: Scientists set new time  CNN\"Doomsday Clock\" moves to 85 seconds to midnight, closest point to catastrophe since its debut  CBS NewsDoomsday Clock moves closer to zero-hour  The Hill'Failure of leadership:' Doomsday Clock head explains current setting  USA Today",
    "published date": "Tue, 27 Jan 2026 16:19:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxQT1ZETzRWY0FpdzAyT2pHUUdXMF9veW55aTlSZE81cXhTZzYxX2NzU0NON2ZyUmVPN19CaTVoRk01Um5WaEl1SEkwMkV0ekZOdnJLcUw4OGVWSjJmSG9lSlFwalRFeGVLdmd0T1BtQm9RVDRSTS1hV3h1OERxMVRKbURhd0N1NVh2REFsQU1aMEpMaThSZGpGT1JtVFI3dnRkODFUaHk3ZVhJb1VKUlp6ckpSU19RODNJMlV3TEt5MHV3MGNsZFo0SFFWR01PS2g5c2lZRXNiWVdkbG9CUGdxOG1fMGpxQzc0S21TalhEUk4tUUgtWUp5MzlpQ3oyNW9CRUtOazVvbnRPaXpUX0dOLUo1VzQ1VXNxb1g2YTJyb0xTN0dzSWFwaUNlMU4zYlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices - NPR",
    "description": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices  NPRAs Trump Heads to Iowa to Trumpet Economy, Many Residents Feel Pain  The New York TimesCan Trump turn the page in Iowa?  PoliticoClive police stress safety, respect ahead of Trump visit and planned protests  kcci.comLIVE: Trump to pitch affordability amid outrage over protest killings  Al Jazeera",
    "published date": "Tue, 27 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPU1BsREwwMEpiSlVCWDJ2ZWxnb2VYRDZpbEdPUTJacnQyWWYweUVpd09XNWVVOVlrRVBkZUNuQ0dkMl9CNjBLOXhkNXVZaUpNR3RUbk5XVHdqZmZkV1ZlZEJXejRneG1DUWwxekZhcHJwd3Rya3BqNzZVVHBBRHJQNVphSkM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump raises US tariffs on South Korea imports to 25% - BBC",
    "description": "Trump raises US tariffs on South Korea imports to 25%  BBCTrump says he’s raising tariffs on South Korea because it’s ‘not living up’ to trade agreement  CNNTrump Threat on South Korea Jolts Trade Partners Who Thought They Had Deals  The Wall Street JournalSouth Korea scrambles to pass U.S. investment bill after Trump threatens higher tariffs  CNBCTrump Vows Higher Tariffs for South Korea Months After Trade Deal  The New York Times",
    "published date": "Tue, 27 Jan 2026 09:56:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE81UXpNM1dyWDFMc202dHlFcHp3NFRkb1JBRHNiSWwwaTdtRUhSS012aHZKbWF1SDg3UTdXUnpDRVhsNEJZVTVXU2ltQWRTMnZGT0c0MEFvSEs2Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Minneapolis shooting scrambles Second Amendment politics for Trump - AP News",
    "description": "Minneapolis shooting scrambles Second Amendment politics for Trump  AP NewsBiden: Minnesotans ‘have suffered enough at the hands of this Administration’  The Hill'It's starting to turn against us': White House reckons with Minnesota fallout  PoliticoHow We Determined That Minneapolis Videos Contradicted Federal Officials  The New York TimesDoctor Who Fought to Treat Alex Pretti Says Border Patrol Moved His Body to Count Wounds Instead of Doing CPR  People.com",
    "published date": "Tue, 27 Jan 2026 14:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPc3dzN1JZZENFY2VLbUR5V29zQ1BSb3hWVkZkdVFDNGJSMlZCRGdNVE9aVDRLaVEyMlowZGtBbUFqVDZZNjk5ZkFReUVzc1NOWm1KeExrRG42QkdHV1BSWE9PTDJvRHJ4U1JWUmlaMFotcUlpWlJQQ1BmSV9laG9nN1pDRkh6Q19fRW9YcldlZWllTTNaNkhkTlBkbHV2emItNDVkR253?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Alex Vindman, Trump impeachment witness, to run as Democrat for Senate - The Guardian",
    "description": "Alex Vindman, Trump impeachment witness, to run as Democrat for Senate  The GuardianAlexander Vindman, of Trump Impeachment Fame, Runs for Senate in Florida  The New York TimesTrump impeachment whistleblower Alexander Vindman launches Democratic Senate campaign in Florida  PoliticoTrump impeachment witness Alexander Vindman launches Florida Senate run  CNNAlex Vindman, key Trump impeachment witness, launches Florida Senate run  NBC News",
    "published date": "Tue, 27 Jan 2026 13:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPMVgyZTlSbG1scXg2Vkl6eGtJLUlVSF9iSlk5Zkg3bWNtOTdKZFpObV9oSDc4OV9EN3V1aEhyb2xmYzF2bG1xYko3S3NpWm14QXUzSFdERnY2WU85emRhZkNzeU80TzUxN3RpcDNORk4xUDBxeVE2QVJYZ21nLXVCQkk2NDFPX252bGJEUWRBaDhvaDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Iranians detail 'bloodbath' crackdown said to have killed 5,700 protesters, as internet blockade eases - ABC News",
    "description": "Iranians detail 'bloodbath' crackdown said to have killed 5,700 protesters, as internet blockade eases  ABC NewsDisappeared bodies, mass burials and ‘30,000 dead’: what is the truth of Iran’s death toll?  The Guardian'We all know someone who was killed': Iran protesters describe personal toll of crackdown  BBCAt least 6,126 people killed in Iran's crackdown on nationwide protests, activists say  NPR“I Witnessed Judgment Day”: A First-Hand Account from Tehran’s Kaj Square  IranWire",
    "published date": "Tue, 27 Jan 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPS1NfaVNfMmVJZVBwODVWSFNPWGlLdmt0ZWg4QXJIYTJ6THQ4VlIxbEFsbnVmd3lLbm1sVl9NVXpEZ1dBMDRwZEoxc0tXTmsweEV0UDJDMFVPZHZjckVjdjBOQmNRUkFEcVlaVjVQUnFUcmR5eGpQSHlqV0RaaUNORkNaeVhpOUMxVTlWRUJzdVdzdWx0dWJtMHJtNi1MYms0clhuN0FadUd1SmJNenhiS1Vn0gG3AUFVX3lxTE1wc0szM2RhVEgwYjl3a1lJbU5ldk5aMTFmNlZfdnFkaER4ejJfMWJVUVlmMXZiTkVkWTcxZThZYUl5em83aG1XWkNMS3hkYm1uUDZqTzdCUXYyVTF2Z1dIcXNnTXZocnJqMG4xbTVIQjVuZjh4XzBQZzNXbzIzWUhHTFRXSEZDcjJSZE1iLXU2WG1OQmlza0NpQkRnRjlBMXZMdkNZcXhrVk9ydGRuYjhxT2h2WXNMbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "House Democrat says he \"failed\" in voting for DHS and ICE funding - Axios",
    "description": "House Democrat says he \"failed\" in voting for DHS and ICE funding  AxiosCapitol agenda: No shutdown deal in sight  PoliticoRepublicans scramble to avoid shutdown amid public ICE backlash  The HillDemocrats Embrace a Shutdown Fight They Wanted to Avoid  The New York TimesMost of the government could shut down this weekend. ICE operations would carry on.  NBC News",
    "published date": "Tue, 27 Jan 2026 16:26:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOXzdleHloQmpVbkFaUEhiTW5wdU90TmV2Ymp0RXlnMmZJYmlBempBeXF4UzZSanJ1NU5xTW1oNkFPdm1fNm01RUJYdlhxY3JvYTFETXhwWTRKMWJOeUQ4WDRDbzM1c0FKRFJMV0ZzbW9UTkxscGh5em44RWtCZVVnNzB5Q2hWLXg4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump’s Immigration Polls Hit Record Low After Nurse Killing - The Daily Beast",
    "description": "Trump’s Immigration Polls Hit Record Low After Nurse Killing  The Daily BeastTrump's immigration approval drops to record low, Reuters/Ipsos poll finds  ReutersRepublicans are worried about Trump’s deportation campaign, and our new poll shows why  PoliticoToday more Americans support than oppose abolishing ICE  YouGovVoters Are Split on Deportations but Disapprove of ICE, Poll Finds  The New York Times",
    "published date": "Tue, 27 Jan 2026 09:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNeDdhUC1EM1BZNkZtZW5YYllUeGpNcjlhRERsMjY4RVlVWGpKM3VIY0d5VDlRT3JISWxHYktwMHpxVkdoR1FTMEhsalE3NVdEbi1PNjFiUUpIYWJINTVSTlk0ZnBIR3N1Y3RWaGhKeWtCU05zMlczVkhXMFJkNS1tcmt6VHVIdThSclJKVk5KRS1jOGk3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next - The New York Times",
    "description": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York TimesAmerica has reached a tipping point on fascism – and on opposition to it | Robert Reich  The GuardianAlex Pretti is the latest victim in the Trump administration’s drive for dominance  inquirer.comNear site of Alex Pretti’s killing, a Whittier church opens its doors  mprnews.orgTrump’s enforcers have unleashed a fascist fairytale on America  The Independent",
    "published date": "Tue, 27 Jan 2026 10:04:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQeGgzbUxpbzk4NElBX2FCVWhTaFV6ZkFYVV93cGRZU2ZCTmNiOEZ4aFU4alZ2bVRkaklKU0xFOU50OWJ1RVFnb2tPcDNHV1R0Z2gyM1pqS2lESWNqVE1nTDZRVnZHOWx0QXdvNHB4TmVDX2lPYzRuNVBEN2d3QlMxdVVLR0dGaktYZXBpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Winter storm snarls US travel, forces mass flight cancellations - Reuters",
    "description": "Winter storm snarls US travel, forces mass flight cancellations  ReutersLatest snow storm forecast maps show fresh predictions for where winter weather will hit hardest  CBS NewsDeep cold could last days, worsening storm’s impacts: ‘I’m just really, really tired’  The Washington PostStorm’s Death Toll Climbs as Officials Warn of Frigid Cold Ahead  The New York TimesWinter storm full coverage: Northeast blanketed in heavy snow while ice accumulation leaves 600,000 in the South without power  Yahoo",
    "published date": "Mon, 26 Jan 2026 23:41:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPbi15UkxIZlJYMTNtNUtyaUhNZ2tYMlRtS2NmUVdwUFQxQ3hSdkplemVoMkdDLXAzRGdndXNyYjRhVWZRdE9lZ2dRd2x0MnN3U2dJa3N0VkdhR1ROQ2VNTXhIT0FTWHZ5S2o2Q0xkTEdfYm9iNzMzb1dpMTkzc0RteTE0cWVFVlBXTFJEX0I1LV9YNm9TM1hHa2VaaVNZdnluSkdHdmhIQkRBZDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "N.J. weather: Snow chances increase for this weekend. Forecasters tracking coastal storm potential. - nj.com",
    "description": "N.J. weather: Snow chances increase for this weekend. Forecasters tracking coastal storm potential.  nj.comWeather blog: NJ Transit rail service resumes, NYC deaths under investigation  nbcnewyork.comTravel restrictions on New Jersey highways, including AC Expressway, Garden State Parkway and NJ Turnpike  6abc.comNJ Transit lifts suspension, will operate with limited service  app.comWinter Storm Limits New Jersey Commuting Options  The New York Times",
    "published date": "Tue, 27 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQRXp1Y1BnSE5QQVhKX0hMZ3Nvc1o5Qmk4cE85eUY2U2NVdXFrVWdTVUxLNDgxV1FRQjJLc3RrSG9IVTVwTTJuQWxJNDJfcV9xa0xoV0dHZF8wTGV1VFFmWnBGZF80QTNxN3dfRjhlQXVYNzFGZkEzTEZ0cURjZDRZaURXejZaU1B0VlV1X1hia3E1Y0tfNlQyaWdEd2Z0UklkdTFuR0pOcElGUXo2R05DS21ielV1VjlnR0N0MnZheGZHWHh4R0hpdHZaQVd1a0XSAeMBQVVfeXFMTkhLbG9WMzNpb0lsUk9BRnFjLWx6WkJGUDc3X3NycmJ0ODJJT1BROVBQY2VndjZwbVBxZ3NXWElZN0xKYm94YTloN2tEcnl2WlZvZElWdkpxa1pwRUhyc3Z1dXd1dTg3OFdTQjRRZE03ZGsyRHh0NUlqSWdKTlZpWWEyLWRiWTJvZ0R0eS1mQVkzQ1N5UkRRLUdJTVZTOUxjZ0dxWFF1SW1LN1JELUd2ZFE3OENPcHdpeXNNVldTT2l0NGZuX24zOFNCaU4zZzhMRVE0WG5XQk9YdWVNdmtOcWdOZk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "nj.com"
    }
  },
  {
    "title": "Bondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’ - CNN",
    "description": "Bondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’  CNNWhy Is the Trump Administration Demanding Minnesota’s Voter Rolls?  The New York TimesBondi's 'ransom note' to Minnesota shows Trump's real game there | Opinion  USA TodayTrump administration uses ICE to pressure blue states  The Washington PostBondi Sends Letter With ‘Rule of Law’ Conditions  The Wall Street Journal",
    "published date": "Tue, 27 Jan 2026 09:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOcW9RYVJfWlo4Skx5ZmhDemZIVS1fN05GZzA4djVsVEZlSE9XQlF0NW5ORzhUT1FzWTZuUDllbEFHUGtDRUdlS1NoZ0pienBBQjl0TlVUV1ktVnl3bjFHb0JQMmt3N2c4d05NX0Jlc3NMa2M3eVN1eVFMem9XOTk0MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "6 people on private plane tied to Houston law firm presumed dead after crash in Maine, officials say - abc13.com",
    "description": "6 people on private plane tied to Houston law firm presumed dead after crash in Maine, officials say  abc13.com6 people presumed dead in Maine plane crash, Bangor airport says  CNNFirst Victims Identified After Private Plane Crashed During Takeoff, Killing 6 Onboard  People.comPrivate jet with 8 aboard crashes on takeoff in Maine, FAA says  AP NewsBusiness jet crashes at Maine airport leaving all passengers presumed dead as winter storm pummels US  Fox News",
    "published date": "Tue, 27 Jan 2026 01:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPakxpWTZuMnM2eHpFY1ZXOW1yNXVYREt0YkVVSmU2Sms1SDV2b2pyS3VqaFd2RTNOSkI2ZHRRM0JqWVFCM2dySV9veVhuRTZMOXhXNkQ3aEVZbWNLYzcxWDAzMUZzMGFySkZSVnJBMU5YVmpfRU9WR05xTVhxQXVPWWRkQ3Y1RDJvX1FVZzJ2YmcySjZDVURpX2dIUkxDNWZuRE5mbXZQWXZvNUFzZjhqbjVpeHkxWlo40gG-AUFVX3lxTE5iZ1hKcXRCN0MxSW5XN2FOQmh1QnNUY3FRNU9ITzNWZUxQeHd4bE9jbXBpUVZ6VmJGR05hS214UGlrSXRpX1JWejVDMjRULVpQdkhkejU4OXNkWWNXbGJDSE1hR3RCRVdFTkM1Mjd3LWhibTFFbmlia0dSZW9oLTEwTW0wWk9PMC1zSVMwN3JYMGVRbDQxZXkyMjI5cHU3NFZVM0hxcGlJMTlZTHVpTXFZX19JblJON3hwbE5Gb0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc13.com",
      "title": "abc13.com"
    }
  },
  {
    "title": "US links security guarantees for Ukraine to peace deal ceding territory - Financial Times",
    "description": "US links security guarantees for Ukraine to peace deal ceding territory  Financial TimesHere’s the latest on the first trilateral talks between Ukraine, Russia and US as negotiators set plans for future meeting  CNNKremlin sticks to demand that Ukraine cede all of Donbas in talks, TASS reports  ReutersUkraine: Zelensky upbeat on US deal – but Davos showed the US president to be an unreliable ally  The ConversationRussia Says Talks to End War in Ukraine Will Continue  The New York Times",
    "published date": "Tue, 27 Jan 2026 05:00:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9hZlVJRWVSckxvMlBQckNuVHI0a2hJQVFVUGxUV0Vha2ZIekhHYUsyUWo4dXhWR245Z1Q0WU1kaEFnRmlVd05tZW5RR1Z4dDlIT0pVd2lPUDJGSmUyN0tLM3BoX2xpd1o1MFh1Z0NvMGU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "TikTok is investigating why some users can't write 'Epstein' in messages - NPR",
    "description": "TikTok is investigating why some users can't write 'Epstein' in messages  NPRTikTok users say they can’t upload anti-ICE videos. The company blames tech issues  CNNNewsom launches review of TikTok over claims of suppressed Trump criticism  The HillCalifornia governor Gavin Newsom accuses TikTok of suppressing content critical of Trump  The GuardianUsers say TikTok stifled posts about Minneapolis shooting as platform faltered  The Washington Post",
    "published date": "Tue, 27 Jan 2026 06:30:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPU0ZnUldoc2Z0c1ZuQnFuSDAtRzFkbzh2R3FsZ3dEYXFFTXlEcDMySFAydU9XTkZ0M0I0eVdQbFI5aS1UcE9DZkN2UkxmUC1qbDZfZmQ4NDlCckVCWVBjZUR4dHVxZ3hGbFpLM3ZiNzR1emVzWUUteWc0ZGFDVEhuWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Aircraft carrier reaches Middle East, bolstering Iran options for Trump - The Washington Post",
    "description": "Aircraft carrier reaches Middle East, bolstering Iran options for Trump  The Washington PostLIVE: US, Iran ratchet up rhetoric as carrier Lincoln forms in Middle East  Al JazeeraUS carrier strike group is now in the Middle East region, sources say  CNNTrump Briefed on Intelligence Saying Iran’s Government Is Weaker  The New York TimesU.S. aircraft carrier arrives as Iran's currency plunges to new low and protest death toll passes 6,000, activists say  NBC News",
    "published date": "Tue, 27 Jan 2026 06:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNMnVBdFBZbkU5VkRSeW1XME5TbmNVMjBPaGFPay1MQnlKdHBYTExFeXpnMTFVVU9OMEZsLXYyVUJvS0ZSSllKai1CdWh6QURmVUVBdi1yYk9uV3JDMDJ5ZTF0Z1l2WDBvQm9VQm9GT2tLd1JaTF82SFV5MHI5QUZ3OERBNFR3R0h5THozdGZ3MGNVeDlDdzdEVw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Pummeled by over a foot of snow, Mass. residents brace for more - wbur.org",
    "description": "Pummeled by over a foot of snow, Mass. residents brace for more  wbur.orgRegion digs out from biggest snowstorm in years; some communities slammed with nearly two feet of snow  The Boston GlobeMAP: Final snow totals, jackpot towns from this week's record-setting winter storm  nbcboston.comFrigid start, watching weekend pattern  whdh.comTown-by-town totals: How much snow has fallen in Mass. so far?  boston25news.com",
    "published date": "Mon, 26 Jan 2026 16:21:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPZ2MzLU00ME8tczVzZXZPRjJJUWZ2cU1xWlFRdHJkNmtiU3NBTGVsZWcwc1pBOGVTX0t1QVNNTkpHS3QyZkNLeEdTV2VZbzRORXNtV3d2X3NnMHJDX0hRdjkxM3NzbGhfOVRtN0dsY010YmdmMDNQUTFRUHNHU0Z6REVrZl9wX2l1djA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wbur.org",
      "title": "wbur.org"
    }
  },
  {
    "title": "Kaiser Strike Sees Thousands Walk Out in California, This Time With No End in Sight - KQED",
    "description": "Kaiser Strike Sees Thousands Walk Out in California, This Time With No End in Sight  KQEDMore than 31,000 nurses, health care workers strike at Kaiser Permanente, arguing for safe staffing levels, fair wages  ABC NewsOur Statement on the UNAC/UHCP Strike  Kaiser PermanenteTens of thousands of Kaiser Permanente healthcare workers launch open-ended strike  latimes.comBay Area Kaiser health care workers to join over 31,000 going on strike in California and Hawaii Monday  abc7news.com",
    "published date": "Mon, 26 Jan 2026 19:59:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPVFNjUnI5Rk5oRFVqLTBEckt4UHFIX1I0VE0zVXM4Tm1kd2NOeGRZLWZWeUpJYlQxckU1amxpRE9aR0R2WGhCSnh6UnJIUDVid0xZT0dGQ1FaQzhmWXNGcnhlTXJ0NklnV0ZvQTJTYnhHTElFdVE5NXRCSHlZOGxsYXFUSWlqTDhWNDRKVzRGNGdoNzk3RWlfeTJJZE5Wd3dXMXM2UFlUTUNXSHB0M3hOVFZqdzBud0ZX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Live updates, Jan. 26: More than 200 in Maine arrested by ICE so far, DHS says - pressherald.com",
    "description": "Live updates, Jan. 26: More than 200 in Maine arrested by ICE so far, DHS says  pressherald.comMaine’s Immigrant Students Stay Home as ICE Operation Ramps Up  The New York Times‘I want my mom’: Kindergartener left without her mother as ICE detains parents in Maine  The Boston Globe‘A dragnet approach,’ lawful residents detained in initial days of ICE operation in Maine  mainemorningstar.comAnti-ICE law set to take effect in Maine as governor faces increased criticism for allowing it amid Senate run  Fox News",
    "published date": "Mon, 26 Jan 2026 15:08:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNeEZOenY1RC01cVBSWlUxSV85VDRncmdfcl8tUXcwUkZBcWNYU2xwOTdjNGlxZXpXRXhUaEpfWU41d2QtaW1IOE1BcldIU0pqemY4dEg3YVZTa0lRQkRzckQ4eDlOSmYxbkxENkpuVzMzSnF3VWQxV0p5bG11b0hIZTdGUEJkNjluNmU1ZlUyUlZpWFZ3dVFIVWhwUFpoSzlhVG9fYkdxak9NVVVwMlE1WExWWUNrbm1tc0U5TTNZX3Q0VVo4N1pVci1nMTdHclU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pressherald.com",
      "title": "pressherald.com"
    }
  },
  {
    "title": "Week of action in honor of Alex Pretti, RN and all others killed by ice - National Nurses United",
    "description": "Week of action in honor of Alex Pretti, RN and all others killed by ice  National Nurses UnitedI grew up with Alex Pretti  The VergeMilwaukee interfaith leaders declare support for immigrants, condemn ICE during vigil speeches  YahooTeachers and friends of Alex Pretti share memories of his kindness  wbay.comNearly 500 gather in Stevens Point for Alex Pretti vigil & ICE protest  stevenspointjournal.com",
    "published date": "Mon, 26 Jan 2026 20:05:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxObm91OHpHeXRnNFV4U1JDTjlVdlJzNlBDb0U3Y0lZcTQ1Q3hwRGhQR1J3Z3VXUDdVb2dtd3J4ZTZTZ0JpNnM0ZmJuWXJIaE9LcTdkdDR0ckZweVVTcTUza1ZINkdYMm01QU9MQkdBNm9JMGRDeGs4X2d5QXVlSHBPNGlHNDk4WmluMnVPNXhYeWxxM2UtbksyMEtSMl9kMG5RcXdMMmlONElaSk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nationalnursesunited.org",
      "title": "National Nurses United"
    }
  },
  {
    "title": "Trump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting - The New York Times",
    "description": "Trump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting  The New York TimesLive updates: Donald Trump says Kristi Noem will not step down amid mounting resignation calls  The HillICE Barbie and Alleged Lover’s Emergency Trump Meeting Revealed  YahooTrump on Noem: Doing ‘very good job,’ won’t step down amid Minnesota shift  fox9.comNoem in the hot seat after Minneapolis shooting  Politico",
    "published date": "Tue, 27 Jan 2026 14:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQXzljdXlkTjliUGJkel9PMTBYZGdMZmx1bWNjemtMY0tmc0k0Y3huaHZKM3NfVkRpWUpKUjVJaVhESXZOdjdqb2F2bWtCUUQzdmZZNnJ0Y3UtM096YmxZM282WDZjS2Q1dTFGazdjMk9ua2RYVVZSajYtV2EwU3JLUjlyNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Carney downplays Trump’s threats while ruling out China trade deal - Politico",
    "description": "Carney downplays Trump’s threats while ruling out China trade deal  PoliticoCarney calls Trump's tariff threats bluster ahead of US-Canada free trade talks  ABC NewsChina says Canada deal does not target the US after Trump tariff threat  BBCTrump’s Tariff Threats Designed to Influence Pending USMCA Talks, Canada PM Carney Says  The Wall Street JournalBessent Sees Canada’s Carney Making ‘About-Face’ on China Trade  Bloomberg.com",
    "published date": "Mon, 26 Jan 2026 20:28:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQY1RDLUZWZkdyNENuNWZZWjhnWDdiRnRvYzZzNW1WRFh5Q3NVWENONHRSTWRfYkZxcmdPSlZxMFRQSTR4UmpXa1lrR0NFNWhScGRnY1dXYXQxM1dGem5BWTdzVTJaWjZsdTlHeFRhM0RLNWZfcGszdE4xZzcweHo2WS1EX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Ex-Olympic snowboarder pleads not guilty to running a drug smuggling ring - ABC News",
    "description": "Ex-Olympic snowboarder pleads not guilty to running a drug smuggling ring  ABC NewsFormer Olympic snowboarder Ryan Wedding pleads not guilty to running a drug smuggling ring  CNNFormer Olympian Ryan Wedding pleads not guilty to drug trafficking, murder charges  The New York TimesEx-Olympic snowboarder Ryan Wedding pleads not guilty to running billion-dollar drug empire, murder charges  Fox NewsWhy feds call Olympic snowboarder a 'modern-day Pablo Escobar'  ESPN",
    "published date": "Mon, 26 Jan 2026 22:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPUHQxYXdpYl9CRkxxODA5SkdRVWxheFMyUDM2Y0YxcElwSDNVREtfQTZRdklKNElOY05EOEpUeDRZQ2hYNkxjeTJZbkhsa01yVmMyVW5ibUFMd0FEVTE4NGY4TzQ2b0JtdF9DV2JrbDBUUHBZbDRLSmM5OGlCRlp0RlQ5cXFjcjd2OXBycks3ZHpWazE3QlUyYkI0bGFVLTJaSF8tTXI1TjDSAa4BQVVfeXFMT3BGVjhSN3JIQTR4NC1oN1p5RFVJalMwc2pVYVFxZmlJUDFjcFh3d2JqX0ZpekJreVJMSEhjWTVHdUZMb1BZclE3RkhfaUlWbFY3T0dDTHc5NVRQVWlCVDZhaVJlV2hxM3JsNWxTV1NTb2pOQXhqVnNqRnBnVUM3ZVFYdzlqX2RSVVpaN0s4TFNBaDVBZTBuRGtIY2RaWE1NRnBHTFV5dVFlWVVra3B3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Minnesota GOP candidate drops out of gubernatorial race, saying he can't support 'retribution' by Republicans - PBS",
    "description": "Minnesota GOP candidate drops out of gubernatorial race, saying he can't support 'retribution' by Republicans  PBSThe Lawyer for the Agent Who Shot Renee Good Thinks ICE Has Gone Too Far  The Wall Street JournalRepublican ends bid for Minnesota governor, citing ‘unconstitutional’ ICE surge  The GuardianChris Madel Ends Run for Minnesota Governor, Citing Immigration Crackdown  The New York TimesMonday’s Campaign Round-Up, 1.26.26: Pretti shooting jolts Minnesota’s gubernatorial race  MS NOW",
    "published date": "Mon, 26 Jan 2026 17:16:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNQl9rQ3lZOEZTRmlUMTZ4N2xlM0RnZXVfYTlTdTgtbTd2VUstODZzaXZnSFhDTll1UngxM09vakZfc0FoMUxmWWM0Skx4TmgwM2o4cTFGQy1mYXNmOVV4SUt3NTg4bUhDb0tqemFXU09qd1hjcXJ6V2k0TzFqaEpnLVNqTzg5R1E0OS1hSFdoZFUtNmVYN1ZXU3Fld2tNSG9MX0tibXNuVHVjREliLVVsMnAtdDBTdVotYllFYm1TelhLWHdRYTZ5UFcxQ2N0TFc3N1pCaW5iNnhLeHfSAeABQVVfeXFMUEhpNThPejZrOExTVFRBcFZDZ05yaFlvcWJubnJ1RkxkaUJ6UVJhU2VJeG9QWk92c0lkbnl0eEI1TVBtWGtRU2MzRng3LU14WFE3NEtPMHBDd0JxXzl6ZjdEYVg4QXJocTBKYl9SajlkUXpZME9hX0M5R3ZnaG9RM2J1YTVoUlAxUWtscUhsSU5RSnBPQlBHNGhzNDBTaHJpaWUzZi1aT3RWU0ZDT2JRRmFVXzJZYWRsVFZVNkdUQnNGWUdUZDVvUjd0RHdDNUNCM2plVjFMMEVaNlByVkZMMko?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "ICE Agents Want Out of Minnesota: Trump’s ‘Battle Is Lost’ - The Daily Beast",
    "description": "ICE Agents Want Out of Minnesota: Trump’s ‘Battle Is Lost’  The Daily BeastHow Trump's ICE Became an Agency in Crisis  Time MagazineOpinion | A Backlash Against ICE’s ‘Army of Occupation’  The New York TimesShootings in Minneapolis underscore how Kristi Noem has transformed DHS  The Washington PostThe videos don’t lie. End ICE’s presence in Minnesota.  The Hill",
    "published date": "Tue, 27 Jan 2026 12:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNUjNTZEJ4TVVzYktwdXBQMlZlR3pUU1BSNkZxREJ6Qkw5aXVhazVWcFBIWnJyeEtjSG53ZGhqZU14d3BqdTJwT3NzM1V3anVRamo5Y1lHOEJaSlpDU25iUlNOYWZpZU1HWHlhT1l1eVFOb3NxU1l5RXBrcGJuOXhYc1JWajBWUUtYbnIwb2ZlaDd6eVB4VWM2YjhBcmpyTFRheTQ1Ny14RnFFT29nV2liVUV3eE93Z0x4bTlNYmRVVGprZml6UjRyVmNQWlNveDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Minneapolis shooting: The Trump administration is admitting it lied about Alex Pretti - vox.com",
    "description": "Minneapolis shooting: The Trump administration is admitting it lied about Alex Pretti  vox.comThe Trump officials in hot water over Minnesota crisis  AxiosICE and America’s flailing autocrat  Financial TimesMajor editorial boards denounce Trump’s Minnesota crackdown as a ‘moral and political failure,’ ‘perversion of justice’  PoliticoDonald Trump Can Be Stopped  The Atlantic",
    "published date": "Tue, 27 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUGpFUV9MRTE1ZE1fZVdrT1JMLURtSUowUVIzUmhwRU5YcWwtWTIwNU5UQXM1T21Td0FET0lnN0Mwb21rQm44TzA4ZkFCRTB3c0NZX1pROGp4bmpwM1pGbm14bDVPWHdaMndLQjJkMHBhWEV2TmlSbElRXzVDeVRwNzhkSlI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "Trump Administration Social Media Posts Echo White Supremacist Messaging - The New York Times",
    "description": "Trump Administration Social Media Posts Echo White Supremacist Messaging  The New York TimesThe Trump Administration Is Publishing a Stream of Nazi Propaganda  The AtlanticA Piece of Work  The BafflerSocial media posts from the White House, Department of Labor and Department of Homeland Security have included images, slogans and even a song associated with far-right extremist groups.  facebook.comThe Trump administration has a Nazi problem | Mehdi Hasan  The Guardian",
    "published date": "Tue, 27 Jan 2026 10:02:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT2FiZ011XzFOT0dBUEFncXZWNDZwX0pJbEdRdkxaWnNMV3dCTkFMUnRHTjdHelk5TmVsOEs1MklkZ3JlTmhCb252U09McmcyNzJFTS14SG9xbS0zaHN1QjFCekxBX1ZfYUthelNOUGRkc3JybElEQ0NfbFZ5a3I0M3l6T3pjOExGTWpWeHZlZ3JHSkJUSWlSNmVsSktKeHA1TTd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]