[
  {
    "title": "Video in investigation into Nancy Guthrie's abduction raises questions about surveillance technology - AP News",
    "description": "Video in investigation into Nancy Guthrie's abduction raises questions about surveillance technology  AP NewsNancy Guthrie live updates: Person detained for questioning in her disappearance, police say  YahooThe Source with Kaitlan Collins  CNNNew activity in crypto wallet tied to Nancy Guthrie ransom note  AZ FamilyLive updates: Man detained for questioning in Nancy Guthrie's disappearance, source says  NBC News",
    "published date": "Wed, 11 Feb 2026 01:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQeWZYdXd2eTVoNTlRU3B3aTB3Tk1IVHlpNEk3OWhjX3E2QlpUcGNtLTE5MkllWk9TNEFvdHNHV2tQTTdjRnVuTHhsdjh4anh2Rkc3VjcyVFJUUWVId051UUxfR0lnOGNOWE1ncEVKRUhTaXUxRDR0TTlOY0trdzBqZTJWRnJJSFRBcm53OXA5OFhlMC1yZHJobk03OFhERkZSeGhELTdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges - Axios",
    "description": "Trump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosKhanna reads names of 6 men ‘likely incriminated’ in Epstein files on House floor  The HillTrump administration latest: DOJ un-redacts more names in Epstein files after pressure from lawmakers  CNNWho are the six men named in the unredacted Epstein files?  The GuardianJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC News",
    "published date": "Tue, 10 Feb 2026 21:01:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPbEFheWtaa0tJenNuSGdTN0N1QVAwUFF5Vk41UldpZ1p3cE9HWElDM1prM21BRTdWLXhDb1Axdy02QVhaQi1fRU41MzloTW9CeFNQRFh3dGsxTUVKSVpwcjh6eDJJeFlDcS0xSzZvQmdEaUZRNVlCZEVsMXplYU5Bc2Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Prosecutors Fail to Bring Charges Against Democrats Involved in Illegal Orders Video - The New York Times",
    "description": "Prosecutors Fail to Bring Charges Against Democrats Involved in Illegal Orders Video  The New York TimesGrand jury declines to indict Democratic lawmakers who urged service members to disobey illegal Trump orders  CNNTrump administration fails to indict Democrats involved in 'illegal orders' video  NBC NewsDC grand jury declines to indict Sens. Kelly, Slotkin for seditious conspiracy: MS Now  CNBCFederal prosecutors reportedly failed to secure indictments against six Democratic lawmakers over US military video – as it happened  The Guardian",
    "published date": "Wed, 11 Feb 2026 01:50:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPSXlQeENPOTdEYjRfRVE1bU9SRFZBMmk3OGI1cU0tMHVoVjk3TXNZRTd3X0dhY0lzcThJa2o1QlAydHBsUlFrSzJqZ0RTT29kaVRHWTF2cW5DWXpncGF3QlhYcm12TGt4VmY4dUktbTJ5RVNYMHFyOFhSVk9hWkpVVlpMU0dWTmNVWDhHTi1jYUYzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "GOP revolt sinks effort to block votes on Trump’s tariffs - Politico",
    "description": "GOP revolt sinks effort to block votes on Trump’s tariffs  PoliticoJohnson says it’s full steam ahead on tariff vote ban  PoliticoThree House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs  CNNHouse Defeats Republican Bid to Block Votes on Trump’s Tariffs  The New York TimesGOP rebels rebuke Trump tariffs, blocking ban on snap repeal votes  The Hill",
    "published date": "Wed, 11 Feb 2026 03:04:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPVi1ZMG1TR2Ita1JvN3pOeTl0Y1JXRUtqdy1Vb1VtdGhnRXpGZThTQUlGVzlYaUN0V3Q0SXNQSGM3djlONng1MmxxMG9zdWpmcFg4QW5wQmRxM0NQZ1BEX2YtT3duc1l2OFdIOVVrRmNaMWs0OUdWOTdkQmYxZklQVmw4V3FjcXlxbm9WQjJfM0wxNHhiYkNJQTRWNlNIb3k1WTRjUExZVXJ0U3RFWHBDbE8wTFhSNG02dDhST0xsNkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE And CBP Heads Refuse Questions On Alex Pretti And Renee Good’s Deaths In Heated Congressional Hearing - Forbes",
    "description": "ICE And CBP Heads Refuse Questions On Alex Pretti And Renee Good’s Deaths In Heated Congressional Hearing  ForbesICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoTakeaways from a tense House hearing with Trump immigration officials  CNNTrump Live Updates: ICE and Immigration Officials Pressed During Hearing After Citizens' Deaths  The New York TimesLive updates: Top Homeland Security officials defend immigration enforcement tactics at congressional hearing  NBC News",
    "published date": "Tue, 10 Feb 2026 18:35:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxNZk01S1ZDZGZtbmdUVXBzZV8ySUhOUXVGVDdqcmNJZEp0M3FnY1FfOFpVclRuWEZkeVItcDlFWS04SGJpRnBUNTFZcVdab0F1SDI4Q3NZVFl5OVVyZWNZRnNIbFNDNlFIT0U0VWhuOGpmRHhsMzNmTU1OanRUSGktMlk4aHc1bG82RURwbFFGc0VVc0hZZ2ZkRUxhZktFZnhPN0ZuWmJqTW0zcy03NDhQZWg4UHRZQW00Ykt2YWYwRW5NcXVoVVpuTmFLbEdHWHhCc1BjeWVTM0dody0ydjhtb1FtSjg3Q2ExM1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up - The New York Times",
    "description": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up  The New York TimesA Minnesotan nurse saved my refugee family’s life. Four decades on, we watched the news together in horror  The GuardianPHOTOS: Anti-ICE Demonstration in Downtown Athens  The Red & BlackThe Last Ring | VA Minneapolis Health Care  VA.gov Home | Veterans AffairsAlex Pretti Was More Than Just an Observer  National Review",
    "published date": "Wed, 11 Feb 2026 01:08:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ZSGRhTjdtMGVYamwyaDJhTkZNMlkxU20wYV9ydmJrZHNmY1Q0MHFMOV9zMXFUUTZWM0ZycDU4UnAxb2dLdUVmYmpXc05tUkx6TFFJeVllR19FWUlTMl9oQ3ZBWExlSHFYRjRaWFN1NnN4YmtMY1d5VEtpZ3U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Lutnick confirms an island lunch with Epstein while insisting they ‘did not have any relationship’ - CNN",
    "description": "Lutnick confirms an island lunch with Epstein while insisting they ‘did not have any relationship’  CNNLutnick Acknowledges Traveling to Epstein’s Island  The New York TimesThe White House is shrugging at Lutnick’s Epstein ties. His foes are too.  PoliticoHoward Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties  ABC NewsLeavitt brushes off Lutnick–Epstein heat with list of admin wins media ignored before ending briefing  Fox News",
    "published date": "Tue, 10 Feb 2026 18:06:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZmQyMHpudWJwNEpZTWJjc3NZcEdPaDBteUxiaXlJbmlaMU5fR3M5cTEtY1FLZDBsaXNJWFZZNEFMYnU4ak0taEo3d1c3V2xrb3d2VXhqUzJaOUhqdUxTMUUySHFBOGV3aWxMalMySURwQUlJTGdqM3dYaWRyU0tRbHBzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Filibuster fight comes full circle as GOP faces internal pressure on elections bill - Politico",
    "description": "Filibuster fight comes full circle as GOP faces internal pressure on elections bill  PoliticoSenate Leader Thune throws cold water on filibuster change in push for voter-ID bill  CNBCRepublicans clash over the Senate filibuster and Trump-backed voter ID bill  NBC NewsSenate GOP debates filibuster reform after Trump calls to ‘nationalize’ elections  The HillThune: ‘Not even close’ to enough votes to change filibuster rule to enact voting reform  The Hill",
    "published date": "Wed, 11 Feb 2026 01:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxONG9Jb2tFWTBmTlZWaVdBem1OVGFYc1JSbmhEa3VTd1Z2MmJuX3lsYURzUHFiM05WeHpuUWo5c0MxZlpRZ0t0Mm1IN0drZnRQUGVwM1FCTUlfT0ZiNWhVYjZOTWxmZFJWTENndDNTczNqRmQ0NDJxNDRWbVdOTmd3N05pLXdkNW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Former federal prosecutor who quit amid Trump administration dispute now representing Don Lemon - AP News",
    "description": "Former federal prosecutor who quit amid Trump administration dispute now representing Don Lemon  AP NewsDon Lemon hires ex-U.S. prosecutor who quit amid concerns over investigation into Renee Good's killing  NBC NewsDon Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case  The New York TimesDon Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe  CNNFormer federal prosecutor Joe Thompson joins Don Lemon’s defense team in church protest case  Star Tribune",
    "published date": "Wed, 11 Feb 2026 00:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQQlNqX2ROLTBYb0JvcTV2TmZRR0NLdzVzZFhZNVkyNklDOWVLN2hrWk0yMU1Eek9IdllhNTVjaFBXbmNkMHA1VjNnTGhLRW16WU1vNVItUUltblVmaG9tSGxjbGlhckpiaWZnaWo2aG95Y0JWR3FZTW1SLVdhOURNT1BHY2laNWdqbjU1ejVGS202NG81M1FocFFkV0RUcHdKWGlibG94UEZWemxpT1B3S3RNSWhUVzFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed - NBC News",
    "description": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed  NBC NewsHusband charged with murder of St. Cloud politician's daughter  St. Cloud TimesDaughter of Former St. Cloud Council Member Jeff Johnson Killed in Stabbing  KNSISt. Cloud police: Victim of attempted murder-suicide identified, suspect expected to face charges  5 EYEWITNESS NEWSCharges filed against suspect in fatal stabbing of daughter of Minnesota governor candidate  MPR News",
    "published date": "Tue, 10 Feb 2026 20:45:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNV0ZfRFhCMjlEUkNWbS0yRVZSSXZlQ1FlOG04TXFWTVI3czdxRTkxbHZLc1VDQ3FLZ1N4cWFTU2RvZjRsZlQ2dlAtVFl1Ny1ac1JfVmFKY1VlVVg3MFhUeXppc1BKZUxQZDQtZUk3LWJac3hwNFN5Z1hiTGZaeUI1bkJrMk1XMXltbjI0ZzR4SGhHc2hJbUdYUFN2UDFKNjBqd0s4UW9wYjBmMUJTUmVJdERvdEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Top Michigan Republicans defend Trump's Gordie Howe Bridge threats - The Detroit News",
    "description": "Top Michigan Republicans defend Trump's Gordie Howe Bridge threats  The Detroit NewsBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesU.S. promised to staff bridge's customs plaza. Trump's threats could upend the deal  The Detroit NewsTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressReport: Ambassador Bridge owner met with White House before Trump’s threat to block new bridge  ClickOnDetroit | WDIV Local 4",
    "published date": "Wed, 11 Feb 2026 02:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxOUUVRUFhwN2U2YTFKSnZtVVN1b1JvUlFmWDdqSHZtYVA4bGxaSjN3YmNkRVhTSHEzX2t4Z1lKTUhmZ1VFX1Y2Z0JJMmJhNlZIZDZUUERkZFhjZ2RnUkJvNW1MS2xpaUxqdl9IOTNUUGRMUWw3Rjhab2tvS1FIMFZ5eHRRT1hjVGlnQnd3SDd4ZWRfYlJBby1yNjNBQmpNYzBRY25yTHJoTHFPX281Q0J4VFpHY3F3OHczaVhwRk9CZHkwRjR6dFZfZkE3eUpXaDFxcE9QQXp5Rl9pWk9HY21XUHNXa1lrNi1ITm8tTUE0RVlyUkd3Q05N?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.detroitnews.com",
      "title": "The Detroit News"
    }
  },
  {
    "title": "FBI cited debunked claims to obtain warrant for Fulton County vote records, documents show - The Washington Post",
    "description": "FBI cited debunked claims to obtain warrant for Fulton County vote records, documents show  The Washington PostGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesThe Fulton County search warrant affidavit, annotated  CNNJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  PoliticoFormer Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit  CNBC",
    "published date": "Wed, 11 Feb 2026 02:58:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOX2RSTWRJZGM0bEZsdDVNZzdnd3BiQTRPWGQ4WmFURUFFV3JXM1NrbGY0bm9kbndmU2NGWWJYTHpRckRrYkFpbXFGVEZ2TGdoM0trZEJmQjJEcWNNYjBsNXBBV0tscWZfRk9admVmY2JCUmdkd0FGaGRqZFFzdk9rUUtPMmZEQnlPR2JSYVAwTlo3RHJ0cGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it - Politico",
    "description": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it  PoliticoPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesNYC officials vow to fly Pride flag at Stonewall, after Trump admin takes it down  GothamistTrump admin removes Pride flag from Stonewall National Monument  CNNPride flag removed from Stonewall monument  Axios",
    "published date": "Tue, 10 Feb 2026 18:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOHJGakFVUFN1TzFTS2VYT2JoUGRxTy1YcVpKZkZLMmt0ZWNrUEx0bWh4aDBZNHpyRGxJNGJvN3ViX3FxMk9hSml3MDNCa0FBbzN2blBNVGFyYmM0bkxJSjhxa0VieHpielpONEFvV0hiT0NhQWVXRVZUdFNaWlItUDVzcU1EZkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Annual governors’ gathering with White House unraveling after Trump excludes Democrats - AP News",
    "description": "Annual governors’ gathering with White House unraveling after Trump excludes Democrats  AP NewsGovernors won’t hold Trump meeting after only Republicans invited  The HillDemocratic governors pledge to boycott White House events after a Trump snub  PoliticoDemocratic governors threaten to boycott Trump dinner over exclusions  The Washington PostGov. Moore calls NGA dinner snub 'disrespectful'; Rep. Harris pushes back  WBFF",
    "published date": "Tue, 10 Feb 2026 19:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNNVVWaEoyc1hIS0w2cXM5UzlOLXBPQ0p5cVhTeUtmQ2JSU3JoWnZLbDV1akxMUzhHajlIcF9ySWJEWTZzdUVaZi1vQWFLS3Q1WG9keV85Y3ZtdFVtMWRSOXlmUENnZFR3Umc1anY0QXpTaFRIUjFDMTdoRUM1ODVKaGNPUlh4UmRQQjhaTnd2WENtNHpHYW1JWWljZXFBVTNKYTU3aW96aGRBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Malinowski concedes to Mejia in Democratic House special primary in New Jersey - NPR",
    "description": "Malinowski concedes to Mejia in Democratic House special primary in New Jersey  NPRAnalilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage  CNNWhat's next in New Jersey's special election: From the Politics Desk  NBC NewsAIPAC Strategy Backfires as Progressive Underdog Wins Key House Race in New Jersey  The InterceptOpinion | In the New Jersey Primary, ‘Abolish ICE’ Looks Like a Winning Message  The New York Times",
    "published date": "Tue, 10 Feb 2026 18:42:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQaFRqMXBtUnhOc1IybXpKWDZxbDFuNW5Uei14dXJKTGxycFRXUmJHYjhZZlltSHdLbDdVampxWFpQTXlrU0hWQWxWMXVqNTZHMDRSejhxMnNvT2lMcWVBUnByQ081VHVyTDRGbFRneEVDd3BsMHVIODFDMHFiR2prYU8wSkxxNzBy?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Dan Osborn cancels fundraiser after co-host’s Epstein link surfaces - Politico",
    "description": "Dan Osborn cancels fundraiser after co-host’s Epstein link surfaces  PoliticoPolitico: former Tim Johnson adviser named in Epstein files  South Dakota War CollegeSenate candidate scraps glitzy fundraiser as Democratic megadonor is flagged in Epstein files  Daily Mail",
    "published date": "Tue, 10 Feb 2026 23:04:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQN2sxdjhBWkhGRWFvOXpkVUs4Z0RsWUxaeXlyMkg5Szg0X2Naam9VZ1RKZWViTE9GeXFSbWNiODJNeTJHWnJ5MllVVkFIWGZacFlxUTY2dTJqUGs5OXZid2ROdF96NHVpWDAwOXVLa2Z1eW4tcXF2VEdPQjFjRmtYWkFrdzdBNU5hTl9LTnplQ0tBb2hqVWxwb1JVaG9GUFpuLUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Former Palm Beach Police Chief Said Trump Told Him ‘Everyone’ Knew About Epstein in 2006 - The New York Times",
    "description": "Former Palm Beach Police Chief Said Trump Told Him ‘Everyone’ Knew About Epstein in 2006  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldEx-police chief said Trump told him in 2006 'everyone' knew of Epstein's behaviour  BBCTrump told police chief 'everyone' knew about Epstein, FBI document says  KSL NewsWATCH: White House won't confirm whether Trump called Palm Beach sheriff about Epstein  PBS",
    "published date": "Tue, 10 Feb 2026 20:53:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBCbGVuaGQwc05ZN3d1ZGc2MksyQUp5VXczMk1jWjFkZkk2LUtxenNkWGE5X1RlVU04Ukl0NEJkTXNCVHR6QVRkX1BueEpweTg0WDFleFZEVnVzQWtZaUlfcjBybmNod2xJbTk3OEdiLTMwN00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]