[
  {
    "title": "Federal Agent Shoots Man in Minneapolis, Homeland Security Says - The New York Times",
    "description": "Federal Agent Shoots Man in Minneapolis, Homeland Security Says  The New York TimesMinneapolis ICE shooting live updates: Officer shot person after being attacked: DHS  ABC NewsImmigration agents shoot man in Minneapolis as tensions in city run high  The GuardianLIVE: Federal agent shoots man in leg, protest forms in north Minneapolis  kare11.comPerson shot in leg by federal law enforcement in Minneapolis after assaulting an officer, DHS says  CNN",
    "published date": "Thu, 15 Jan 2026 03:00:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQcGo4a0w5Ui1VTFNZNUNtNXdoTWdxZzV4Tk5pT3FGcl9CY1hsS2RqTUJJSXNrempmTFZkaVR3Tk9mSkd4ZUh0VzZNLUFoMV84dmdTeE5mQUU5dHg5QnJfV3FoZFJrU0FVSlZMYWM5Yk1RWDU4MEdEVzVjMlduMDFJUzBpQzN3V2hITC1aLUJXWTNkcnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "description": "Trump would want military action in Iran to be swift and decisive, sources say  NBC NewsTrump says he’s been assured Tehran has stopped killing protesters as Iran closes its airspace – live  The GuardianTrump says Iran has stopped killings as U.S. weighs military options  The Washington PostTrump told Iran has halted killings amid mounting protest pressure  Fox NewsTrump said to want an attack on Iran ‘to be definitive’ and not trigger sustained war  The Times of Israel",
    "published date": "Thu, 15 Jan 2026 00:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNkFfOS1ySTk0Rml4c3czdUNEUUdTVy00TUFGSG1BWVFnZFd2MmVSRURCcWtJRUpPZ0phd3Q4MUszUW1ZODdNSXhvNGhKdHhfbGJwd0E1WTlTenNXazRMRFRDa2lJTTI3ME01VzFPRGxWQnJRT2g1UWxuNWVaOEtJbktYQVNYYXdUeVVwSUpsUVZiQlM5THpoSVN0Rmx5X1UzV25VcE80cHlHVmVTeEtyd2FkT3LSAVZBVV95cUxPanVnQ2haU2JQd0VCd2JPWnJIQ3ZqU1BqeVNhM25YekdIM1d0YmUzWkNDMVMwTld1c2FXWUpMdVJzeHFmYVFwRVVlQ0NhV0d6b0tPdzl6Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "In a win for Democrats, court allows California's redistricting plan to proceed - NPR",
    "description": "In a win for Democrats, court allows California's redistricting plan to proceed  NPRFederal Judges Uphold California’s New Congressional Maps  The New York TimesDivided panel cites Supreme Court backing of Texas’ map to uphold California’s  MS NOWProp 50: appeals court rejects Republican bid to block California maps  The GuardianCourt upholds Prop 50, allowing California to use its newly redrawn congressional maps  CBS News",
    "published date": "Wed, 14 Jan 2026 23:19:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNVEZhNmszZmxfV1ZyaXVLdXZoS3ViNnR4TWYzU1dEMGJTQW9hSEpKa1VwUGw0RnZxLURQWVlEb2R2akxhOEtOTFBzTThhNWhHUXNRMU56NG5uSkI3Nk94MUNnZVpGbUhNejhKcnJEUFlFR29pR3cwajkxNVlVLWc3RXNwQ3I0ODVmOVhKNUhCZWVMWXhRRVNPRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Newsom rejects Louisiana effort to extradite abortion doctor - Los Angeles Times",
    "description": "Newsom rejects Louisiana effort to extradite abortion doctor  Los Angeles TimesNewsom Says California Will Not Extradite Abortion Provider to Louisiana  The New York TimesCalifornia Gov. Newsom says he's blocking Louisiana's push to extradite doctor accused of mailing abortion pills  NBC NewsLouisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it.  PoliticoGovernor Newsom rejects Louisiana’s attempt to extradite California doctor for providing abortion care  California State Portal | CA.gov",
    "published date": "Wed, 14 Jan 2026 23:55:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNVFB5dnRyUDRldjhzREZfZDVPR01WQkhGRFhGVXdsaU80bWJYb1hXZHl5SVVJbFQyREQ3NU5KaVNaUnBzeDdRam82UFdPNnlqaGU1NkpIOUNkUlhNSWNaWkpyY0xvTFFEakNjOVNSVUFocFBKdnpPQmpTNW5tbWFUbWdoWWhGQXByZ19mb3dsbHlEMDFPeFZWUzVOS3J2ZE1BR1ZDVXlxOGV6dEFwemREaHJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "A part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago - AP News",
    "description": "A part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago  AP NewsBoeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesNTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNNTSB says part on UPS jet that crashed was on Boeing’s radar  WAVE NewsBoeing knew of defect tied to fatal UPS plane crash in Louisville, NTSB finds  WDRB",
    "published date": "Thu, 15 Jan 2026 00:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPR21TQXpvNVBOLVdja2RyeS1DbUVDZHdkSjRScHZTSDJ6OHdYbkZIRFQtVkVCaDBKUDM3cERZN2xIYnI2NDdfcnJOeXJYRzZUa1dPT0lPQ1pNc1NkVlZwQ2ZqcWdXbVhjdEpDbk10a3NlX19hZDZNVWxzSWxaWktET0p0cTd0YWk0REpEOGhvT0F2elN2Wk5nRHFUZlA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation - Star Tribune",
    "description": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star TribuneSix Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow  The New York TimesTop federal Minnesota prosecutors officially terminated after dispute over ICE shooting probe  Fox NewsJustice Department sees ‘no basis’ for criminal investigation into ICE officer who shot and killed Renee Good, official says  WEAUTrump administration efforts to shift blame for ICE shooting wreak havoc on Minnesota US attorney’s office  CNN",
    "published date": "Wed, 14 Jan 2026 23:59:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNTHlrcWJZajZEZWd5Yk9BdlpSbzZydWEyWUxoRDdhdFdoOW9ScUFhRlg2ZTVWb3ZwRWlYQ0M5eHBYSDUyNHhlU1lRdFdOTGR4ZlNuMlJEQ1FvRkFJMVE2Z1NfVHpwZC1oZnZHTmgtZHotYW1mal91NFc2MWQ4UXBWcWtjell0aVVOa0tTUjBFU1VXWndPWEdKUjFSTm82WmF4cExncUZQUnJXdGZoRFJEYWpFWk5GZm5tUnI0OTh0M3VDc2hPbmUyS2ZQak4xQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Senate blocks Venezuela war powers bill after Vance breaks deadlock - The Washington Post",
    "description": "Senate blocks Venezuela war powers bill after Vance breaks deadlock  The Washington PostTrump Administration Live Updates: Republicans in Senate Block Effort to Check Trump’s Power in Venezuela  The New York TimesSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNNVance casts tiebreaking vote to kill Venezuela war powers resolution  ABC News2-bill spending package 1 step closer to House passage  Politico",
    "published date": "Thu, 15 Jan 2026 03:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQUDhmN1VvUzVKZTRmS2VhNEN1cC1Id2RzV3laaDVKa1VrWXdwUXdhZ1M4LTk4M3JXMVQ2SmctdzRnQVZCdTIxQktaMDUzQ21MRWNzV0E5ZVZySXJDRjhuWFhJQkxMN3Y2T2N4cF9BbWpxZ21EZlNLWTRWR0lDc256ZnlDbEtsdHRndjNjTFZzM3gxZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting - The New York Times",
    "description": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York TimesNo decision on request to stop immigration sweeps in Minnesota. Military lawyers may join the effort  AP News'Campaign of brutality': Gov. Walz encourages Minnesotans to remain peaceful during federal law enforcement presence  5 EYEWITNESS NEWSWhy this legal expert says the Minnesota and Illinois immigration lawsuits ‘are close to completely meritless’  CNN‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time Magazine",
    "published date": "Thu, 15 Jan 2026 01:22:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBMRWVnc0NHM2tQRjNldXZtUmxzQVkxakh0VFRNZEJXY1JTM0NiUUg2MExJeVVWUGVYUTlVZHJXODE4aVUzcnZ2U0J0Wmo4WkRITERQSFJUZl9GUnRjMDUtS2dwOE0tSEFBMTI4Z2ZWWmhGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Suspended Ford employee who heckled Trump sparks over $800,000 in GoFundMe donations - Business Insider",
    "description": "Suspended Ford employee who heckled Trump sparks over $800,000 in GoFundMe donations  Business InsiderTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The GuardianWhat UAW said about Ford worker being flipped off by President Trump in Detroit  ClickOnDetroit | WDIV Local 4",
    "published date": "Thu, 15 Jan 2026 00:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNRHZBM1dqeFJiSHh4aVlzTHMzNGg4dEd6dDhvcnpZTmlrSDhyY2lWaEo3ZHFZWTRlVWoxRWkxZHZXQk9tSnJyNFRkRlhnYmtwV3ZkNWZnZVBtbnN0U2ttaVRjdzJ5dXJITEYtbjVPU1lia1ppcmY5WEEyZnlnNUt6bGJBUjRLaGJE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "description": "Trump administration rolls back $2 billion mental health, addiction grant cuts  NPRView Full Coverage on Google News",
    "published date": "Thu, 15 Jan 2026 02:10:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYXphRGdydnVyTnhGNWZiamVZdGN0Z3QzZHRadEJLT095elBDS2ZvMjQxUHljZk5aZjhtZG5JTzI4aTVTV3FXVFE3NXlNTXJrOG1yOXRna0pIaElPMzJDLVE5bmRXLWE2emNTODk4dTB2bEJsMkc3SlVCX1pJUWhhZDJZZ21uaWhoVmh3WWJrbHBlWVJzd285Q2dGYlVDUFFhREczNnRVMXpUWG1LNnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam - Axios",
    "description": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosDemocratic lawmakers file articles of impeachment against Kristi Noem  The GuardianIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT MirrorDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOW",
    "published date": "Thu, 15 Jan 2026 01:56:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUVMxLWIzMFh1S2hoYkVHa0tQYmQybDh3MHlDTVd4Y3JFNTV5bTVEc2xFb2FUemo1QmNYMmtEcHlfSnc3Q2xDUXFoM1NYaHVQQ1RnNTdLSFUzR1NpWS0tbFF4SEVmQ0xCOFZ4ME90aFBhWHJfMm9wSjZ4SlhuUlV5TE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Iran: Massacre of protesters demands global diplomatic action to signal an end to impunity - Amnesty International",
    "description": "Iran: Massacre of protesters demands global diplomatic action to signal an end to impunity  Amnesty InternationalVideos show security forces firing into crowds in at least six cities across Iran  The Washington PostOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesIran signals it will hold fast trials and executions for protesters  PBSIranians in North Texas on edge after deadly crackdown on protestors  NBC 5 Dallas-Fort Worth",
    "published date": "Wed, 14 Jan 2026 18:21:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOUUM5ak54Q1FqazdGeVlRWmNza1ozT1NUVmpsUUVYT3ltV0FYRWgwZmlja09ueEp5aHdfeWRRbDFmVFU0SWhIY19JOUVSVS1ZNkgxLXpFQ3hsTjhCS0xQNGVVT09zVHF4VDBpSmVESGxiSU05ZHI1bExHZGJOaTBzZGJORnhvYmw4dnVzWU1YSnZsRmtBX3pLOEdGaDZhSzJCeW9xMWE5b1pfakdoeDJ2WVI5OHFyUzAzb1pMNWd4S2FMM2lyNy1GamxMaXdvOTQ5V3Vz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.amnesty.org",
      "title": "Amnesty International"
    }
  },
  {
    "title": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations - ABC News",
    "description": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesRep. Robin Kelly on Articles of Impeachment Against Secy. Noem  C-SPANHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The GuardianHillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry  Politico",
    "published date": "Thu, 15 Jan 2026 01:20:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQcTFXMUdSWFIwZjJUTWV2UG55QTJUU1ZPRGwwQUNTR3MxLXd1VVRzQmFnb2phUGhHRmJRVHFEVmhaUmZlMENfc3c3eTg4c0JsdVhsYXZkM0pIOXE2WDNzc24tSjQ4eWtDcXRHamhUMEV1XzcxeXdGQ29jb2JEb3JwRUgxcG55bTdDeHJabWdoal8tSWpPTHpicmNlMEFxa0JsT2RjQlZKU1BtQkNiaTh0OUlB0gG3AUFVX3lxTFBDUE8wVmNkU3paQlhzRDJONnlMenRfYS0wLUdsRnVGTGU5TFM1ekxrbENfcUNwMWxwMGg3QU5nN3VaaTFzcVVmUmNXeTdFZXlQamYySTFkTGU4bEZrQmROVDAwSGJHUmdtVXQ3enI1djJaNTNiNFFUR1dJcWl0am9wcVYyNk53LS1BX0c1RGRDUXp5RzRyYndoNGNmaUJuQTYzWEswVU5kSlhoQ0VpVXY4SlZTYjVtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights - Slate",
    "description": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights  SlateInside the SCOTUS hearing bound to be a turning point in the culture war over trans athletes in women's sports  Fox News5 takeaways from the Supreme Court’s showdown over transgender athletes  PoliticoKavanaugh and Roberts are already looking ahead to the next major transgender controversy  CNNSupreme Court appears likely to uphold transgender athlete bans  SCOTUSblog",
    "published date": "Wed, 14 Jan 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOUljOGY0b25hbjB0eU9KcXZva0VYR08xbkp2U0NrdC1LOGhPanhCemg1dTdYbllVUTh5eUEtVkZYaUZZQ2M2a1RVVWFfbGJvbDdwSkNmSEkzeEJoa0pXa2NLSnMtN19WbWZRcFRTUmFJYnlyOWVFZEJSM0xQVV9OY2hCNU9YeGVfdEVvR2pzNU5FSUhyTXdqV25FYXJWZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Trump administration investigates 5 Democratic lawmakers over their video message to troops. Here's what we know. - CBS News",
    "description": "Trump administration investigates 5 Democratic lawmakers over their video message to troops. Here's what we know.  CBS NewsDemocrat Elissa Slotkin says she is under investigation for video on illegal orders  NPR3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them  The New York TimesSlotkin says she is under investigation for November military video  PoliticoMichigan senator says she is being investigated for imploring US troops to refuse illegal orders  The Guardian",
    "published date": "Thu, 15 Jan 2026 01:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWHl6UUE2NFk1Q2V0QWdHTHRHY1dsX0Y4S2tNaFBiNmxQT0FiSW1uTmMyT3dGcVp5bXBuMFJCcVU5ZzF3UmRDMVdOWTRwcThidWpnQV9aTUNleHpQaV9mQ0ZjQTVFRFlKU3BwN2x3MlVlbWE1cmo2ODExUFZaVS1nUDBuakFFMS1zZnQ4c3BSeHpVdXlXYVRpUG02b25pWDQwcExVNm8ySFBWRHBiaU5mSlJIdFRmQWtNLV9pNDRn0gHDAUFVX3lxTFBTZmg4SGRFVlZkSkM4QkFSVnd2N29UUi0zTFhKYWJPVHRxbHZoOGRtdzZJS0Y4SGNHcnlWWmxRV3RJSldxT3RwUlRjajV6Zm41T0g0WEtfZ2V4bE15R0drcXRsaHBxTW0zY18zSW1zSXFKTThkRkc4eFRoX3dDR0twaml3TTRTblJDU1A0TWxkbllwWE1YQVlOb0I3T3E0ODJtSUQwQVdPY0JoWGlwNlNCUVdKcmtOdHRxQkRjRF9qUU94NA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Renee Good came to Minneapolis seeking a safe place. Less than a year later, she was killed. - Star Tribune",
    "description": "Renee Good came to Minneapolis seeking a safe place. Less than a year later, she was killed.  Star TribuneRenee Good's former father-in-law says she was a 'great person' and he prays for his grandson  NBC News'A beautiful light': Renee Good's family mourns her death amid push for 'transparency' after ICE shooting  ABC NewsRenee Good’s Time at Old Dominion Included an Award-Winning Poem  The New York Times‘The beautiful light of our family’: Renee Good’s family issues statement a week after ICE shooting  Sahan Journal",
    "published date": "Wed, 14 Jan 2026 19:55:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNbkhraFUzSS1YRU14M1JJekdHckZLR1ZRQ3RTRzl4d2lGZFc2MFhLbWlXU2xTemdXeUNOM0JodW1RVHVmMzl4T3BrTEsyUVF2YWN4RnVpUHhaS09YVXlZQlYyVllkd3VkbjRiT0lTdWhyQTFoaTE2WFNUeVU1UlFSZ3dlYTNBaHBZV1RLcWI5RF9zWjlCVzFDZQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him' - ABC News",
    "description": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him'  ABC News'She was terrified.' New details emerge in Ohio couple's killings  USA TodayNeighbor recounts meeting Ohio murder suspect at Chicago apartment: 'He was any ordinary person'  10TV'He just disappeared:' Nevada lawyer tried to track doctor months before Tepe murders  WSYXColumbus police have murder weapon in Tepe double homicide, chief says  The Columbus Dispatch",
    "published date": "Wed, 14 Jan 2026 15:49:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcmhuRlRDanZRNjI3SFR2dkloYmt3cUJSQkRMUmV1RXh6NEVmY01BMDRNTm5BdzVXTHpaVk5xY1RCcVRLci1aS2k2MlNuN3Q5TFFUUXdSa2NOVUxIbWpGZk5zX1dqRXdOVWpNVU5Ua0dRQm4zRG5fSTdJdjJfWTVQcm5May1yNXA1WmfSAY8BQVVfeXFMTk82T3BTRUdtcDN6QVloTFFZNkc4N0h4VlJ6TWh5dDRVZzN0SEpma0JrNERHc0UxSktaaU1yUlJXZmJndV9weE1mWm1rNFRheWk2cmF6QjI0MjZOQlZiT0FFRWFrYVYxM3U4TDBhN2JmNEdTajlVZmtnQjROejlJdWJpY29GYk5rSmxlaXpKTFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Virginia House committee advances 4 proposed constitutional amendments - VPM",
    "description": "Virginia House committee advances 4 proposed constitutional amendments  VPMVa. Democrats flex power on redistricting as General Assembly session begins  The Washington PostVirginia Senate Democrats pledge action on affordability as 2026 session begins  Virginia MercuryVirginia House passes amendment allowing redistricting to counter GOP gerrymanders  Democracy DocketVirginia Democrats look to decimate GOP seats in redistricting effort  Politico",
    "published date": "Wed, 14 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdmxqMVNicEc4dFczNjcwSHZWV3BLb1dDdFhlVGJNbXNMcDZwbnZoVHVKaWdYamQwM0lwVTkyZGVuRWtadFJabnFOOXV5QUFfUHd4QzZZUGZ5RWZVZmxONm8wM0hDd1Q2RWRiOGYzbjN6d0loVlZLRzV4aWZkcU4zcjE5d0Fybkl5dmxJWkZoTjFRVi0zN3JabXFuejI5QnNkVGlidEtJdTZBMmV3dU4xRDd4VW9tRTB3dHpEWEp4dWJKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Candidates have legal standing to challenge election laws, the Supreme Court rules - NPR",
    "description": "Candidates have legal standing to challenge election laws, the Supreme Court rules  NPRSupreme Court Sides With Conservative Congressman in Illinois Election Rules Challenge  The New York TimesSupreme Court revives GOP congressman’s absentee ballot suit that could spur more election litigation  CNNSupreme Court says candidates can challenge vote counting rules  PoliticoJackson says colleagues gave democracy short shrift in election-related ruling  MS NOW",
    "published date": "Wed, 14 Jan 2026 19:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNcC1kbTRPdERxbnVsV3IyQ2cwUkNmbGpOVWRWR1F0S3l5XzdzeC1INHI5ekNBclFWMEJkNlJEQkV1SDNjc3pnZjBOV05SSEhSWlBrc3duMFlEWEg5X2VqcUxKWDN0VlVLeHVuRHhFYkdGQUVieVFrYVVGczRxYnV4RTAyWElIQjVmRUNEeGJZVlB2TXlpd3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Minneapolis ICE shooting: Federal law enforcement involved in north Minneapolis incident, city says - FOX 9 Minneapolis-St. Paul",
    "description": "Minneapolis ICE shooting: Federal law enforcement involved in north Minneapolis incident, city says  FOX 9 Minneapolis-St. PaulWoman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says  The New York TimesNew documents shed light on Renee Good’s ties to ICE monitoring efforts in Minneapolis  CNNHow the feud between Trump and Minnesota is impacting the probe into the ICE shooting  NPRBREAKING: Another shooting 'involving federal law enforcement' in Minneapolis  Bring Me The News",
    "published date": "Thu, 15 Jan 2026 01:55:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPejFCdkFxRzFEbTgza0Z0QzJldmwta0dKd3VzU3VBUGlXel9lSk1NRWpnMXdTNmlkSkNUVUJkTXlLb05CemQ0ZHNTQkRrOW00Rnp6eTBsWEsxTGRvTHM1Y3BBdHFlRmJKcGJURDJkRFA1b1VUZDAtaTBhUFk1ODRqVTBsNGVfMDR6MGwyTFk2OFVBSUxqb3lSQWFETFN6cjF10gGmAUFVX3lxTE03SlBmVEpIMlZOZmNSU2lkbXA5djFSYzkzNVRBaGh2Z1pxbzY4NHdzZTVLeWNxSk9fay05R2tQVGtIME9aekNjV0VyS0g0QmJMTmsweVJpc0YtX1BFZXVyQkdnU1ZDMTA1Q1NVamhZZUktTWswUUdEb0Z6dEtYemNBNVUwSk1pazFTUkVEMmpYVFltZ2Q5djVjMVZMc3BjMFhxaFZaWWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fox9.com",
      "title": "FOX 9 Minneapolis-St. Paul"
    }
  },
  {
    "title": "House passes 2 more funding bills — with 4 more to go - Politico",
    "description": "House passes 2 more funding bills — with 4 more to go  PoliticoHouse passes 2-bill funding package ahead of shutdown deadline  CBS NewsRep. Edwards backs FY2026 funding bills, pushes for USPS accountability post-Helene  WLOSDHS at center of progressive revolt as House advances $80B spending package  Fox NewsA federal workforce census, targeted cuts and more key takeaways from the latest FY26 spending package  Government Executive",
    "published date": "Wed, 14 Jan 2026 22:42:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNRkliem5US1JFTG1tTmNtdXJVeHl1TUZETWZJV1VuajNka2JZd1BQS0tlUGJxRnMxWm5sSVVCMzhXckJpMVY4Y1JTbl85ZW1sTmlfd2YtVHdKUWN4MHJwNEp5UzJfRGo2eDJ5STZyZU81eHc3b05zOENRaFV2bzJici1nQ21NMW84am94RHZ6dlJBSVlMMUZRN01qb2F3RlhrMXg5Q0pabS1QR3hCekloclFzRFhkbFpxdW15aE5YZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Inside Schumer's plot to retake the Senate - Axios",
    "description": "Inside Schumer's plot to retake the Senate  AxiosOpinion | Mary Peltola Puts Alaska in Play for Democrats  The New York TimesOpinion | Chuck Schumer just showed why he’s a better leader than his Democratic base thinks  MS NOWSenate Democrats Carve Out Path to Senate Majority in 2026  dscc.orgPeltola raises $1.5M in first 24 hours of Alaska Senate bid  Politico",
    "published date": "Wed, 14 Jan 2026 16:04:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNYkJGaF93ZVBOVVFXMmc1ZXRXUjBWTkxWSFFJNDlMdVR2T2R3YUlxQ1p5SmI0eVBYZEl4bDZhbjZjbW5STXlRRElUSGZhMW5wYVNRYXpMMlBULTU3UEozTE1nalNCdDN1N254dGVKX2k3NFNGVExSZUVCaFRIVXpQTnFxdzYycnpL?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Scientists call another near-record hot year a 'warning shot' from a shifting climate - NPR",
    "description": "Scientists call another near-record hot year a 'warning shot' from a shifting climate  NPR2025 was the third-hottest year ever recorded on Earth, data shows  NBC NewsHow Hot Was Your Town Last Year? Look Up Where You Live.  The New York Times2025 was Earth's 3rd-warmest year as climate impacts intensify  ABC News11-year streak of record global warming continues, UN weather agency warns  UN News",
    "published date": "Wed, 14 Jan 2026 18:38:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPS3hFZi1QdE1JUGwtMWtnUEF1RFpNY19mWjRfa1NQQ0x2cHQwNHVFdnVlRnh2ZnlJU0JXZ2UzM3p2blZOQzV6ZDZLMUF0R1loMExSYWlNbkZ6VGNJSGJyYnZyX0ZObUZEckVhd29DbHo5Q1dTYndFV1NVZkRRRjFUbXV3LXFoVmNlS0ZhOXNGVjVZT2EyYThrbWJ2SnYtOEt3YnlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Half of Americans think ICE is making American cities less safe, CNN poll finds | CNN Politics - CNN",
    "description": "Half of Americans think ICE is making American cities less safe, CNN poll finds | CNN Politics  CNN5 takeaways from new polls of the Minneapolis ICE shooting  CNNMajority of voters think Minneapolis shooting was not justified, new poll shows  FOX 5 DCMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGovNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  Yahoo",
    "published date": "Wed, 14 Jan 2026 17:00:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBQQm1wY3ZrSVZqdU9Qb1hXU1ViNHQ4NGItMUw5RnV2SEZld3lkQkhuZm1Za1pmcXl4emgweHp1MnQ5Y3ZDb21xMVlZMFlKX0pIYTFOWWQ0NG1mRUpMRXhZLVpsZ2w4azhObnowS0I4cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Administration reinstates hundreds of health and safety officials who were laid off - ABC News",
    "description": "Administration reinstates hundreds of health and safety officials who were laid off  ABC NewsC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York TimesUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.comReversal brings back 900 federal workers at the National Institute for Occupational Safety and Health  TribLIVE.comHHS reinstates all laid-off employees at workplace safety agency NIOSH  Federal News Network",
    "published date": "Thu, 15 Jan 2026 00:55:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdHdEUDZVM3RyajVVZ1JDa0dva0VVQXM3akdiYkRtdTRreWJsT2JUTk5yOVBGbTI4bmwtTTJvcHlxWXpRaVRQNFg0eEl4QktUa0wwdENBTVNZc3ZVTF93enJPaGxmejdCYW11Y3BpVXhnZVprdnlWd2lZcS1sbzF2blo4QkM5WmxXSFNwV0lnQlJNVDNMQ0I5S0hNM0tSMmNWdHNVUjhMNXFfQWlqTm9UVnhR0gG3AUFVX3lxTE1ZZ3VqQlRBVU1vS3BBSllrNnNibFdPSm1leWc3ZmZnZnZvai1oWnpzdFQ0Uk9yeXNzbmloT3p5d2N5N2lGWDZPRUlmXzZGd1ZvdFAxOWRrcU1OdW54WnN0WXZERzFGc09aY1d5QkdJY3pyYldrOXJuY0NhdEFuY0xIZVR3QXRBMnkzcDNHQ0YzWFNjQ3pFbFg0Smp3QS1fRVZpOXozRkNQclJHejBXelk4Rkl5MzFqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Johnson pledges to push ahead on another party-line megabill - Politico",
    "description": "Johnson pledges to push ahead on another party-line megabill  PoliticoHouse conservatives pitch framework for second big GOP-only bill on affordability  The HillE&E News: Permitting, NEPA, Venezuelan oil: Republicans’ reconciliation plan  POLITICO ProGOP budget aims to address affordability, punish sanctuary states  NewsNationMike Johnson’s Dreams for a 2nd Reconciliation Bill Crash Into Reality  NOTUS — News of the United States",
    "published date": "Wed, 14 Jan 2026 20:32:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNN3B3Z1lfUkJWbFVkS0RQR2hHOWNZR0VPRUxmdGd1eXdua1JMRHJ5OFFFcXRibmtyeU1RQU9xT1RMc0VCNTc0blU4Qy1WOVVubVlQRjNZdFJPMzhBbENzeFFFRzBnektmTnN0T1V1Z1J4U1ZIWUViZ1owQUlXMHhNclNSZWdmT0lmOV91ekVUVFlGVnpTWlNjRmdoOWRjOWJ3eWluQ0JXNlItejJMRWZUeXFLLWhscnlCQ25hY1g5WVM2X0tyS3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States  The White House (.gov)Gold and Silver in Modest Retreat After Surging to Record Highs  Bloomberg.comTrump says no critical minerals tariffs for now, will seek overseas supplies  ReutersTrump sets 180-day deadline to counter China’s control of critical minerals  South China Morning PostThe $587B Strategic Surge: Why China's Export Ban is Scaling a North American Metal Boom  Investing News Network",
    "published date": "Wed, 14 Jan 2026 21:23:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxOblowNFl2Ri13UWdOQk1oNk1DNWY2czY5VU9pb1BvTWkyN1VBbnpFd1lMWWRaNC1EbTFhSThhWWsxdlR1NnJZYXEzemNFeWcxblBQakRYRUsxbW5MOHF6bFA1bzc5WXptaFZTRVVSMWFvU202bmkzemNMX3I3N3lfM3k1RDNmZEYzYmh1U0xjXzVHaElBM0JxM2JzUjh0TFJXOGR5MG5xR2Jzazh5X2E3T3dDOWhoQzhUSGo5U0I0NS1BaVlJbXZBZVMtaVFYT2NjYWtfZE5PLVlBSjJuTWdCZjU5c3pkWVdyeGc1Qkw2Ynpwc09mc003S0ZVazVPemlodFJIUHl3NkJ0MDFHV0dicjc1UzAyTjl4azUyWjk1bW1aTXFXeFdnX2pUWWk3S1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Federal investigation targets Champlain Valley School District over transgender athlete policy  WCAXTrump administration opens 18 new probes over trans athletes  The Washington PostUNR among schools under investigation for alleged Title IX violation  KOLO | 8 News NowTrump administration to investigate 2 Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday Telegram",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "US Supreme Court does not issue ruling on Trump's tariffs - Reuters",
    "description": "US Supreme Court does not issue ruling on Trump's tariffs  ReutersSupreme Court tariff ruling: It's not just about refunds. Volume of U.S. freight trade could hinge on decision  CNBCTrump tariffs live updates: Trump says 'we're screwed' if Supreme Court rules against his tariffs  Yahoo FinanceSupreme Court Doesn’t Rule on Trump’s Tariffs on Wednesday  Bloomberg.comThe longer the Supreme Court delays its tariff decision, the better it is for President Trump  Fortune",
    "published date": "Wed, 14 Jan 2026 15:33:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNX2p3czVGbVBUcVIwek1aeFY0T2wySlZfYzU2MnFCNDhtZnlhWGdSMWJSY25GLTJjaHk3QmVsSFhmR29EOVpYbmpDcl95OFM0ejZwWFBwM3BYVUdja1VEc21aX2hIX3lRMUFkMkM1Z0FWbHc3VmlTLU1zMmFEQVFJeGt4dTM5WlA5b0gyS1hBZzUzWDZpRkhXTHZSanVBZ2I0RDdhNlVYYVVQbFlnOERIX3FHSmdWQ0cxVVdwMHhTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Opinion | Renee Good’s Family Should Be Able to Sue the Officer Who Killed Her - The New York Times",
    "description": "Opinion | Renee Good’s Family Should Be Able to Sue the Officer Who Killed Her  The New York TimesIn wake of ICE shooting, Markey and Pressley introduce bill to end federal law enforcement immunity  The Boston GlobeMichigan Congressman Shri Thanedar to introduce Abolish ICE Act after fatal Minneapolis shooting  CBS NewsSwalwell, Goldman to offer bill stripping ICE agents of qualified immunity  The HillTranscript: Can Trump’s Thugs Be Reined In? These Dems Have an Idea.  The New Republic",
    "published date": "Wed, 14 Jan 2026 22:00:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPR2tqSGY5SXFULWhyd3EyOTNWenp2ODQzU0RnUVZ1TW1ucmpzVDM3cklBZGR0NFd6RHBKMU1FRVlieWp0Q19hdmhPU3lLeXlXaWQwUmJValo1SUZwbmpRWWU0cnRTMm9Bekl6NWRObEY2R3FOYndTZDA0dnZrWnFCWTNWTXlZUE5hUmRUbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe - The New York Times",
    "description": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesWhat US oil CEOs know about Venezuela that Trump doesn’t  The HillTrump moves to block courts from seizing Venezuelan oil revenue in US accounts  ReutersThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  FortuneExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Wed, 14 Jan 2026 22:02:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOSFJTZnZNWXdONjc5azcyaWRfZVdlTDhVMlNFQ3E5dzA0czhOb2FMVkxjWHBwN25ZeXF6ZTZvUGN3MVEzZERnX05Sa3dYRFpzUVEybUdjbzlIMjFxLWxhRmEycU1VamVHYnhwSGMyeEsyWk96bzdTaDBrUjcyeldtUXp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "After 3 years of repairs, Highway 1 through Big Sur fully reopens - Los Angeles Times",
    "description": "After 3 years of repairs, Highway 1 through Big Sur fully reopens  Los Angeles TimesHighway 1 fully reopens through Big Sur after three-year closure  KSBWGovernor Newsom announces early reopening of Highway 1 through Big Sur  California State Portal | CA.govCalifornia’s Highway 1 Fully Opens Through Big Sur Years After Major Landslides  KQED'Here we go': Motorists speed through Highway 1 in Big Sur for the first time in 3 years  SFGATE",
    "published date": "Wed, 14 Jan 2026 22:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxObDFpVmdHNlRtaThhTFpKTWp2cmVOdUNnRlBHM3FHalFaQjVUWU9GeTk3bG9qREFRWW5vLWJnWnN1Z0dNRVNmR2JEZDgzNEpqeXNISnJYbzk0MThGVVJvZXRDTzBDUmg1V0JHbmRxUks2LTJVYWkzRmNLM2ZQMGRhLXk4NFFTZ0dNWTlJT1FqNlliSElUWTM0M2VTZ0JzVm9KN3VZZDRZYXE4WDFpVk9ZbEU2U1Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Trump threatens to cut off funds to 'sanctuary' cities and their states starting next month - NBC News",
    "description": "Trump threatens to cut off funds to 'sanctuary' cities and their states starting next month  NBC NewsWhite House to end funding to sanctuary cities and states on Feb. 1  PoliticoTrump vows to cut federal funds to sanctuary cities, Seattle braces for impacts  KOMOCalifornia, L.A. brace for Trump’s new threats to cut funds over immigration stance  Los Angeles TimesPresident Trump says federal government will no longer fund sanctuary cities beginning Feb. 1; Mamdani vows to defend New York  ABC7 New York",
    "published date": "Wed, 14 Jan 2026 12:54:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOaTVBZWIxTExTVEF1YzVfRnJCM0txb0dfMVhUTFVfcFkwU0JpLTlYZUNjMWJ1U0JkdzRyaGwxaWR2VnM5LWNzLThyTVZTd1Nnd1ZjX1NiSlF4QmZEVHo4THlob1F5N0MtSXlGQUZ0ejRfQzlnUVhITTRuYU9iNzZ1dnRwVlg4VldZeFRiRmw1Sk9fZGlld2wzeEZMb01hRnM0MGxaSC1tLUpDT1ZDOXRPZmtJMWdhY3RpLXd0YW530gFWQVVfeXFMTXNTZVZDQ0dWRUhtSjVhdVpaQ1ZCS0U1LWtRNjhFRFMtZEkyWXFaWExBTVBnYnM3cFgyWE9mQ1QyY1dZRmZyZlR6bHlCQkk1bzJkLURoYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "US judge blocks Trump administration from cutting Minnesota's food stamp funding - Yahoo",
    "description": "US judge blocks Trump administration from cutting Minnesota's food stamp funding  YahooTrump plans to illegally stop over $2 billion in Medicaid payments, state says, in latest twist to fraud saga  MinnPostDr. Oz on Medicaid fraud ‘fact-finding mission’ in Minnesota, $2B could be at stake  5 EYEWITNESS NEWSTrump administration suspends $129m in benefit payments to Minnesota  The GuardianMinnesota appealing feds’ move to withhold $2B in Medicaid funds  MPR News",
    "published date": "Wed, 14 Jan 2026 23:23:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNd09IbWt6WV9wMjc1WTBENkg3YzdjMVkydFFranJrMmZIMUFTcElqZzlvXzhOTkFnY0x5eEp2VU1qQjV0OEZTOGdFX090TE41M2p2LUNiZmdrVlNJLVhEQnVLdksxTHZpVHRPWDZvbDVmR19rVXpGUzctWUIxVUhGQVFFM1phUlY5RkJOdTV4cWE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Exclusive: Trump questions Reza Pahlavi's ability to garner support in Iran - Reuters",
    "description": "Exclusive: Trump questions Reza Pahlavi's ability to garner support in Iran  ReutersReza Pahlavi, Son of Deposed Shah of Iran, Seeks Center Stage Amid Protests  The New York TimesWho is Reza Pahlavi? The exiled ‘prince’ urging Iranians to ‘seize cities’  Al JazeeraWould-Be Iran Monarch Reza Pahlavi Declares a Civil War in Iran  The InterceptScoop: Trump's envoy secretly met Iran's exiled crown prince  Axios",
    "published date": "Thu, 15 Jan 2026 01:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMXdEc2daZ3lCTEliRDYwMlhJRUVNTHkxdDF0ODBiS1U2cDZRVHowV0wyQUxSOHZNUERIbXNrNlFseWc3ZTdBd25LdVg2MW9EV0tTd0hNZW8yQW9ENjFuZlhyZi02OFpUMmJLWTI1cDd4MU42b3ktVl9OR2M3MnZsUklhN01saWEyV3NGcTNGSFdQY0NHTlNReHRzbkRCcGR4cXkzQ3hkblhKazlO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base - BBC",
    "description": "US and UK pulling some personnel from Qatar military base  BBCIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersLive Updates U.S. Withdrawing Troops From Key Middle East Bases as Precaution, American Official Says  HaaretzTrump warns Iran against protest executions as death toll jumps past 2,500, activists say  NBC NewsSome US personnel urged to leave largest Middle East base as fears of war spread among Iran’s neighbors  CNN",
    "published date": "Thu, 15 Jan 2026 01:31:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1ieTJ3bzRDQmhjeV9OaXpOSXZqeWFBbWNrQTZaeDNnQmVfVjZtM0JRMVRYbjFkVlp2RjFrbjNDMjEzdEFRRXc0YmlIV3NtR2RaQXlZWFJIV2Yzd9IBX0FVX3lxTE5hT0otNjJWZmVzbV84SGtwWjlpUHNOUlh2dHJhZ2FyelU3eGktVXFMLXlVT2liTGZpV3g5cnhFMFZHdDIzS0dTYzhjSFpoXzd5c096RzNvVW9YckQzOGtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies - CBS News",
    "description": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies  CBS NewsAu Pair Testifies of Lurid Plot in Virginia Double-Murder Trial  The New York TimesAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNBrazilian au pair testifies against former employer and lover in double homicide case  ABC NewsRomantic letters from au pair to boss revealed in double-murder trial  The Washington Post",
    "published date": "Wed, 14 Jan 2026 11:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNQVlsRVZqWlgxMUtnd2VPVjZXNWJ0NWs1ZEE1QlN6N2ZPVzBNR1JwaXg5THNQRk5aVlVPV29oTGVMeHd5SmFQdGY1OWh0bTEyVmlicV9nRW9JQTlIdjR4OEtEWDR6Vm1yZ0QwWFRhSDNlZWhUZUJOR2dYMVRHcUc0SWswb3dKaVVfN05XZ3NqM3pIS3hKeFRn0gGcAUFVX3lxTE0xS2tod0E5S05kN1FHeUFDMUNuZEt0MU5zalE4cXFPaEhYSUMzZnJTZmV1QlFhdDMyVG9KWmhOakEyWTdUaVQtbjhqdGFBSV9NVXB2SlY5UlRTNnBVX0lRc1B2WWlKaUhSN3M2bmNlaDZiZS0zeHRDTlN4UWhqcElHRllUamFuVjlqYms2bndVZk51MHB6RzQ3dzc5Mg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota - CBS News",
    "description": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota  CBS News‘I was flooded with fear’: Minnesotans describe their encounters with ICE, being detained  MPR News‘I heard screaming, I heard crying:’ Inside ICE detainment at the Whipple Building  Sahan JournalICE protester detained in Fort Snelling shares detention experience  5 EYEWITNESS NEWSMinneapolis duo details their ICE detention, including pressure to rat on protest organizers  AP News",
    "published date": "Wed, 14 Jan 2026 17:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPT2tES2FpNWFwT0hNdDJGZzZEVG42TE5Xb1ByaGFoZ2oyYVlidzFfdjRTWWtKSmVuZjQyS3JtZ3RybmtKSGpzZ3VScTJXeGVpMjJmcHFRV2hGMXZmQlNiWUNXQkFJYk5uMVVsUW5WemdkMmNvWHotbDZqWklJcjlYREpRLTVnY1h50gGOAUFVX3lxTE5jNG5SdmNFaGNfenZsZGJGaFpYNkNobkpXaGdqNldsdlM4R2VCQ3FCZ21jMUVUVjVqazZDYTA0NFBGVDJ2OHVtMVlhS25vajdFVk1TaXo2NGl1NlNBY1pPdDdsendGMVU3YTlEMlFvZXNRWmxFQ29EVE1ITzNvTWotNENCR0pzRFhQX3pQZEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Dems Are Begging Their Own to Drop ‘Abolish ICE’ - The Bulwark",
    "description": "Dems Are Begging Their Own to Drop ‘Abolish ICE’  The Bulwark‘Abolish ICE’? Many Democrats are ready to fund it — with conditions  PoliticoMinnesota ICE shooting raises chances for partial government shutdown  The HillDemocratic infighting ignites over surge of anti-ICE anger  AxiosCongressional progressives vow to block DHS funding without reforms  The Guardian",
    "published date": "Wed, 14 Jan 2026 16:01:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5jWG45UEtyR3FKY2dSbl9Gb0pENk5VRkdZUEpKZ3lLQkMydW1qUnM2a0tuSVBlczN4SElwV2FOMDMxOXh3enZkZUozdTFUenE4WEFvU1VGSW5Td3RFdkZOTlRXUW5qMGVjb056WVJYZjhSVzhkTUZfRWNKRENiTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Trump’s EPA is setting the value of human health to $0 - vox.com",
    "description": "Trump’s EPA is setting the value of human health to $0  vox.comE.P.A. to Stop Considering Lives Saved When Setting Rules on Air Pollution  The New York TimesThe EPA is changing how it considers the costs and benefits of air pollution rules  NPREPA says it will no longer consider health costs in pollution regulations  The Washington PostEPA to stop calculating deaths avoided and health care savings from air pollution rules  NBC News",
    "published date": "Wed, 14 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPOW9QVTROQmZGbjRnVV9mQTB4NGpIdU1qbUVUdFd2eThCR0F4M1VvOWExZUduWDRKb2FtSGpiMUpaT3g0ekpXR3BxT3RrU1lONFQwYWp6bHhfMXl2ejNfSnJjLU1JQWgzcERhc3dkYWRzNmtqb2hRUlU2WjlhNnhPOWlEMjNBcHFNSUw3bFZRWlk0YXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial - Texas Public Radio | TPR",
    "description": "'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial  Texas Public Radio | TPRJurors hear school police officer talk of ‘mistake’ before Uvalde shooting  CNNUvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there'  ABC NewsCourtroom sees former UCISD officer's interview with Texas Rangers  WOAILIVE BLOG: Day 8 of Uvalde trial  KXAN Austin",
    "published date": "Wed, 14 Jan 2026 12:33:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPSWxOM1FwVzkzVVhBVVYzeHhOckdEZ2ZtSDVWYWhCNTUzWGNUeXdDb0lCeDc3UHEzb0R5Z0Y2ZXpQS3RlZU5Zdl9yOEIxVnpqV3ZOVE85Zk1pWXpqbkFMdTU5bkE2TUlEWGh5bmVFVE1CSzVXa3RpbTN3b0Z6aWMyRTZyUk1PX3dZT0hIUWptdUdqMk80SkpEcGtPa25SNjl5bzdhX1JoMkRVN2xfRmpZYWo4d3ZTR21YdHhoaUJLeTgwUmNZY3pVaUhTMHhJWEN3UVlhLVZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tpr.org",
      "title": "Texas Public Radio | TPR"
    }
  },
  {
    "title": "Bipartisan health package still in play despite Obamacare rancor - Axios",
    "description": "Bipartisan health package still in play despite Obamacare rancor  AxiosOhio Democratic U.S. reps joined by three Ohio Republicans to restore Affordable Care Act subsidies  Ohio Capital JournalHouse passes bill to extend health care subsidies in defiance of GOP leaders  AP NewsTimeline slipping for potential Senate ObamaCare subsidy compromise  The HillThis GOP senator says reviving Obamacare subsidies would be ‘putting America first’  Politico",
    "published date": "Wed, 14 Jan 2026 11:44:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOay0wZlFGdnBtWEc0X1Mtby05UWU5aWNTRXo3U3NCeUxONXpycGc0RkNES0RfNzZZWE92aWZtWi1BY1BuaGRNcWRvRGtYSDRlUExaQ0RvMl9DVDZEZmlfSkJNQ0d6U2pWS0wtNGtna3RfY2Z3S3FRc3VzQ1d4WWNONA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  }
]