[
  {
    "title": "Jesse Jackson, a leading voice for civil rights, dies at 84 - The Washington Post",
    "description": "Jesse Jackson, a leading voice for civil rights, dies at 84  The Washington PostJesse Jackson, Charismatic Champion of Civil Rights, Dies at 84  The New York TimesTributes from Birmingham to 'humble' Jesse Jackson  BBCObama, Trump and Biden lead tributes to Jesse Jackson: ‘one of America’s greatest patriots’  The GuardianAndrew Young reflects on friendship and partnership with Jesse Jackson  PBS",
    "published date": "Wed, 18 Feb 2026 00:33:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWDN6UnVmdlc1SHlHQzZXZ3pKem9obzdmZlN1Wk9hZkNNckU1UVo5UnZlMjdiNTU0Q3F0TkZpQ013X2V1V3hadWZMS21DTjVpY004NlhWa1BWbHptRWxlQ284Z1dmNnd1OEVTZWpaTEd1ZmwzUkNWelVpSURIVFl5YWRLVFZJRkZEemRybWl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Someone knows who kidnapped Nancy Guthrie, authorities say. Video likely holds key - Los Angeles Times - Los Angeles Times",
    "description": "Someone knows who kidnapped Nancy Guthrie, authorities say. Video likely holds key - Los Angeles Times  Los Angeles TimesLive updates: Nancy Guthrie search: Glove DNA matches no one in federal database  CNNNancy Guthrie: No match found for DNA on glove recovered near home  Sky NewsInvestigators Think Savannah Guthrie’s Mom Nancy Guthrie’s Abductor Purchased Clothes From Walmart  YahooGun store owner says FBI asked him to check firearm sales against list of names, pics in Guthrie case  Fox News",
    "published date": "Tue, 17 Feb 2026 18:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZWcxTmEyMWRXQnZBOXFHQWlKVHdKeEV1TlhwU0hILTVDVE9EM21jQUczcU1JYkgzX0xBM3VFZThhaHdhQ19vV0VNMndjRy1IQkUzNkM0Vkp6eFk1VnNQdzd4UDVVY01JaVMxS3phb2ROaHlNMFEzYXg2MkY2S0FDMnliaEs4RDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Rescuers race to save 6 skiers trapped in California avalanche that’s left 10 more missing - AP News",
    "description": "Rescuers race to save 6 skiers trapped in California avalanche that’s left 10 more missing  AP NewsRescuers race to save 6 skiers trapped in California avalanche that left 10 more missing  CNNTen skiers missing after California avalanche  RTE.ieSix skiers found but 10 still missing after avalanche in California  The GuardianNorthern California storm coverage: Skiers missing after avalanche, all Sierra highways shut down  KCRA",
    "published date": "Wed, 18 Feb 2026 02:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQczM0OXZYTFo1aG1qb0JmdlY0WUFxeF95WkdkNTJWYVNHZEtrMkppUWJTSkhfLVpvTW40NVlRTEhqQUczVkVxdHhQV3NZMy1hT2RVakktdUlZbFV1b1k0bUVfb1A2N0w1c2ZvUlZwanVKdTlvQzY3S0RMRDNEMjVpdzdkRUYza2ZhZ2ViUjdSVEI3WnNOamJKM3hpZWRyVzlSU3JKVVUzLVhmR2dtTlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "California Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit - The New York Times",
    "description": "California Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit  The New York TimesOpponents of proposed California wealth tax ramp up their campaign  PoliticoHow would the California ‘billionaire tax’ really work? We break it down  San Francisco ChronicleFollow live updates on the Trump administration  The Boston GlobeBernie Sanders and Gavin Newsom become adversaries over push to tax California billionaires  Yahoo",
    "published date": "Tue, 17 Feb 2026 23:49:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNbmxDd2gwaXpvUk51dzA1SE9RTVkyNGdxVHBrREVGanBxeWxSLVpNbEpocUJFeGF4UzNvWkY0end0aGZOZXZySURYcGNBbC12T3JTWVU4SEhObGxhQWEzbWo0RnJjWjVlcHNtd0pGbGRSWlFqb0dRUnlaYnpGWkFIYU1LVDJQTHlvTVg3T0Y0SEQ1X0ZO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What to know about the \"equal time\" rule at heart of Colbert, CBS fight - Axios",
    "description": "What to know about the \"equal time\" rule at heart of Colbert, CBS fight  AxiosColbert Slams Trump Administration After CBS Pulls Talarico Interview  The New York TimesColbert slams CBS statement, accuses Paramount of not standing up to \"bullies\"  AxiosCensorship Comes for Stephen Colbert  The AtlanticAfter Colbert says CBS blocked interview, FCC commissioner weighs in on 'equal time'  PBS",
    "published date": "Wed, 18 Feb 2026 04:27:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5sWnhKX1RTem1VOGhGM1VSckc1YUJHdDZfVUN1ZDZST2FYVmRIaGY1ank2NlE5NjllRFdEVDFfWGpCMzZ6TlJHTGNEcEMxLVp1VXUwQW96Q080SE9oZnZJWWVXc3RVajBwTS1ad1FDLVJXdDRZc2lpNjJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Mamdani Warns of Nearly 10% Property-Tax Boost if No Tax on Wealthy - The Wall Street Journal",
    "description": "Mamdani Warns of Nearly 10% Property-Tax Boost if No Tax on Wealthy  The Wall Street JournalMamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed  The New York TimesMamdani to Hochul: Tax the rich, or I'll raise New Yorkers' property taxes  Spectrum News NY1Mamdani threatens 9.5% property tax increase to fill NYC budget gap if Albany won't tax rich  NBC New YorkMamdani proposes 9.5% property tax hike for budget gap if Albany doesn’t act  New York Daily News",
    "published date": "Tue, 17 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQQmQxaFN2dzJMOVlnV0NZa2lmMFBLNDFYVmRjUFd2cy1URW4wS3FIWDV3YUxhVmwyNWtZMkg5bXdFaWZCd3UtLTNxNHVyMWRJY2lQWGlhRUV6OGEydVFFWWY2R0JWbzQ4V080VEJ3SE8tZUhhUUthVFFIMFVfV3lvR1NOc21UcG9FYkVpZWpXUTlzUXptZjd0Nmt2RFh5OG1FamNRcTl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Trump blames Maryland, D.C. and Virginia for massive sewage spill, offers help if they ask \"politely\" - CBS News",
    "description": "Trump blames Maryland, D.C. and Virginia for massive sewage spill, offers help if they ask \"politely\"  CBS NewsPotomac Sewage Spill Becomes Ecological Disaster and Political Fight  The New York TimesPipeline that caused massive sewer spill into the Potomac River had been identified for repairs, DC Water officials say  WUSA9Trump directs federal government to intervene in Potomac sewage spill  The Washington PostDC Environment director contradicts Potomac River guidance  NBC4 Washington",
    "published date": "Tue, 17 Feb 2026 20:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOMXZGcFhWSUFhc1B3amxFQVphN0s0aWJZb1NSSllRblNxblVZVDZjTFNhQnJLY2VMbEpvbVlFMmxQN3g5RGN2UEJ4NDBaRXVVRW4wVTRFWVNDZl9JYzFjeVBkRElhRmhhWDFMWEh3UTBsTFpUQXhsY0I2dUxtV3F4TF9pNjdLRTdxYk1wVzU5WGJRdThUM1NveGxVaVhBeko1SVHSAacBQVVfeXFMUGUyNFJMOFljZ0tENTRza09uZ0UzbHZzSXc4QnJETG0tZ2w5TXJEcTcwZ3M5VllTRFA2ckNDejN2SENScHhiemRPTVlyRG5FUjNtbUhtRzNOZGR5SU9waDMzQ2Q4VzFucXhDSjlmVUc3TmtvWWRlbUd0OHp3bVFuekdPMk5GMmpvWW5jVzJMLUZfMEN4QWR6WUkxLUYtY2R2amdJWnR1NTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy - CNN",
    "description": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy  CNNUS envoys juggle two crisis talks, raising questions about prospects for success  ReutersU.S. and Iran Make ‘Good Progress’ in Geneva Talks, Foreign Minister Says  The New York TimesIran’s supreme leader threatens to sink US warships as nuclear talks continue  The HillIran says \"clearer path ahead\" to nuclear deal with U.S. after talks in Geneva under shadow of Trump's threats  CBS News",
    "published date": "Tue, 17 Feb 2026 22:04:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPSlZMNnVFd1dtS0xrMTRxaVJsWUV0aHpXY2N6ckRBb21SLWhGZGFxNk94V3J5YXZIQjNiMGdqSDNzSjBrUUczeDgyLUxUWm93RzNwcDIzaFl4R0hOcVJoMDY3TUotOFlhZmtDaV9zYjhCQzBlVUZ6VWlfZlUxTFJNZE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Here’s how much snow the Sierra got this weekend — and how much is on the way - San Francisco Chronicle",
    "description": "Here’s how much snow the Sierra got this weekend — and how much is on the way  San Francisco ChronicleWinter storm forces El Dorado County school closures as roads worsen  Yahoo\"Sit This One Out\": CHP Warns Skiers To Stay Home as I-80 Closes  POWDER MagazineWinter Storms Could Bring 8 Feet of Snow to Parts of California  The New York TimesSierra storm drops 28 inches in a day, shuts down I-80  SFGATE",
    "published date": "Tue, 17 Feb 2026 21:47:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQWGp0bWs0RmoyNlpfRXJ3SlBGWGh5dEhLZ1lGVmZZZ0FwTkM1bkpoS0E2Q3dXT0dldGZocm1GVFRiWE81UGNBRHRGeDRseXNUUldfRk1CMlVUdC11LV9mS0IyOGxIT1llajNTcGJ0NkJoOTFGWGR1d0FEek9kcklRNXEybkYwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Deadly shooting at Rhode Island youth hockey game was 'targeted event,' authorities say - PBS",
    "description": "Deadly shooting at Rhode Island youth hockey game was 'targeted event,' authorities say  PBSLive updates: All 5 Pawtucket ice rink shooting victims identified  The Providence JournalAfter Pawtucket shooting, records show suspect’s life was marked by conflict  The Boston GlobeSuspect in Rhode Island ice hockey shooting killed ex-wife and son  BBCRecap: New details on Pawtucket rink shooting, family releases statement  NBC Boston",
    "published date": "Tue, 17 Feb 2026 13:14:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxPZTZQSGNBQjF3ZkhTSldaQmNpMHQ5a0VQZFZUQ0E4bjNhUjJDT3JtMDZ3X3I5LVByUDhkbnN4ZllVQkRtX3p3bGxQT2VvRGNLbGNPMXBMc0oyODJ6M1VPUEQ5SmVaYjluLUQwTkNGdkE1ckVUYUlYOEtUd3htaEZNcmRMdjdVZzcteWotTnQ0VXNZQTR0cV9XejY4VGdId0NqQVVNU1BDZnREaU51VHM0SElzSXEyU0ZFSlJqOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Judge declares mistrial in Texas ‘antifa’ protest case over attorney’s T-shirt - The Guardian",
    "description": "Judge declares mistrial in Texas ‘antifa’ protest case over attorney’s T-shirt  The GuardianJudge declares mistrial in Prairieland ICE shooting trial over lawyer's 'politically charged' shirt  KERA NewsMistrial declared in Texas ICE detention center ambush trial over defense lawyer's T-shirt  Fox NewsMistrial in federal domestic terrorism case over Alvarado ICE facility attack  FOX 4 News Dallas-Fort WorthTrump wants to prosecute anti-fascists as terrorists. This Texas trial will test his power.  MS NOW",
    "published date": "Wed, 18 Feb 2026 01:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZWVaMlY3NVNYY2pnNjlBNEVaVlJuZkY2anZLeVpPRC10eUU4VEpMdUVzc2djbmxWbFI3bzRmTmpMYUpzTDNhcElKSEJfbmpLdnhjS3hjcVBiZ1FkdU1rS2lzRFJEeHU1dDhBZzBTb29rTld5dHBlSXNTRjd1T2hWTFA1eXJCUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Why California could be the big winner as EPA abandons climate policy - Politico",
    "description": "Why California could be the big winner as EPA abandons climate policy  PoliticoWhat Trump’s Emissions Rollback Means for Drivers  AutoweekOne of Big Oil’s Biggest Defenses Is Getting Blown Up  Bloomberg​Historic Climate Rollback Makes U.S. a Global Outlier on Tailpipe Rules  The New York TimesQ&A: What does Trump’s repeal of US ‘endangerment finding’ mean for climate action?  Carbon Brief",
    "published date": "Wed, 18 Feb 2026 00:49:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQM2paRUl3T3lBR2RPcU5QWmhCSk5mUkplQ1hqQkJCUXlhX1JidWJnam1qSGIwR2JWekgweENKeHk5cXRVQ3pkNGt4ZHdqYnpBQ2dfT2VNdE9vaVFEdUhybUl6VEw0SG9IWkV3WXd1cHJYUWtoUjc1NG0wWUxRNlUtLU8zUmlTRlpuMDhvaXE1UlVoQkMxXzRVaHM4MU1jTnlFcVBFRlVHVjZ4ZDlOZGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "description": "DHS spokeswoman who became a face of Trump deportation campaign steps down  The Washington PostDHS spokesperson to leave Trump administration amid agency turmoil  PoliticoThe many claims by Trump’s DHS that have fallen apart  CNNTop DHS spokesperson who became a face of Trump immigration policy is leaving  NPRTop DHS spokesperson to exit role amid growing outrage over Trump’s ICE raids  The Guardian",
    "published date": "Wed, 18 Feb 2026 05:02:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQQ1EyOUpnRktCLVR2cUxUa2x6ZjZqaGl4T3d2dlVpeEM2WTVpODBhYjRPalBiTHJGSEtqLXIyeWhFWWI5RmFsZkxYWVhDQ1ZyRUNSN3pWSDJZdE13Q0c2MURlVmQ1am5qZmJaRjhXcDlkMl9QWV9NU3hkQkN2WHRIZkFKMGFzSXRTMnBF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Governor says tax must return revenue to families, rejects income tax under $1M - KOMO",
    "description": "Governor says tax must return revenue to families, rejects income tax under $1M  KOMOWashington state Senate approves tax on personal income over $1M  Washington State StandardWashington Senate OKs income tax on millionaires  AxiosMillionaires Tax passes the Senate  Washington Senate Democrats (.gov)‘Millionaires tax’ clears first hurdle  The Seattle Times",
    "published date": "Wed, 18 Feb 2026 01:54:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTUNQZlpHREJ6aWZLNlFPOEZrZ0dNNE1kaTFOSFFobnFzS1hFQWFqdXZZMWMxYXhXQm9fYTBqSS1jaFJHdW1QeFlwWGpuSElmQnhpc3JHRG1iTE1VOHRkTkZFd3A5cEVQekVyV0xQTE1LM2c2SklrY3RxMUJ1X0IzU0g2LWtGaWpuODZVVVVaalY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Police arrest 18-year-old suspect for allegedly running at U.S. Capitol with shotgun - Axios",
    "description": "Police arrest 18-year-old suspect for allegedly running at U.S. Capitol with shotgun  AxiosMan in tactical vest with loaded shotgun arrested after charging US Capitol, police say  CNNUSCP Officers Stop & Arrest Man with Loaded Shotgun Outside the U.S. Capitol  uscp.govPolice Arrest Man Who Ran Toward the Capitol With a Loaded Gun  The New York TimesMan ran at U.S. Capitol with shotgun and tactical vest: Capitol Police chief  CNBC",
    "published date": "Wed, 18 Feb 2026 03:15:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQem9NYnBNaDJvSnNJbGFTeXB2cTdhTnFiVndEUWlfMDRHcncyS0xqcWZ4RVQyOVhIT0NxQU9ZeHcyazhzUDV4VVlTcFlLMkpZYVdwTW0tZ0FkNmtOdnZ6SkR1YnZPTDlaYVJoSkVBYldkajYyWEpIQTJRZXdENDRHU0hQZkFHUnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "AOC Just Debuted on a New International Stage. How Did She Do? - Slate",
    "description": "AOC Just Debuted on a New International Stage. How Did She Do?  SlateMarco Rubio’s Impressive Speech  The AtlanticOpinion | What the American Right Wants From Europe  The New York TimesSecretary of State Marco Rubio at the Munich Security Conference - United States Department of State  U.S. Department of State (.gov)Warmer words but relations remain frosty between the U.S. and its old friends in Europe  NBC News",
    "published date": "Tue, 17 Feb 2026 22:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOaHlVWkJTa1dHZFd5OGE2T2hiXzIyVHpNbXZFUG9yY1R6WlVSdG1Pd1dURzBwei1yOVpMeEVHNEFGek92LWlXcy1nU1Z3eFY4YzZzMkl4bXpIc282SkdPSmxHaENOUEtMelljQms4SVdWVG9sYXp6ODVhM3hBRHR0WmN2REJOX3l5S1VqdTI2YzYzYU9lR3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Epstein files suggest acts that may amount to crimes against humanity, say UN experts - The Guardian",
    "description": "Epstein files suggest acts that may amount to crimes against humanity, say UN experts  The GuardianThe Price of Admission to Epstein’s World: Silence  The New York TimesAllegations in Epstein files may amount to 'crimes against humanity,' UN experts say  ReutersThe Epstein files have brought a wave of resignations and investigations  The Washington PostEpstein files fallout: The high-profile people burned by past dealings with a predator  CNBC",
    "published date": "Wed, 18 Feb 2026 01:37:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLXNKLWdmT2RpTlh6ZDJCTEZleTN4em1Pc21XZFNyX0pyYS1JV1RBX0JQeWF6OXJOak1BMURFRG9fNXcxclQzakZ6YS12cEtWRm5YQ2wzUm5QRzdjSzRHSFNqaGxEYzRUTFpDSEdHOE9qdUE3dDlKWjVjcEdtbEgyYWJZRFNYQk04RjNkLXRvRnpIcTVReHJ5X2QyNFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "White House on DHS funding talks: 'Parties are still pretty far apart' - Politico",
    "description": "White House on DHS funding talks: 'Parties are still pretty far apart'  PoliticoWhite House Rejects Democrats’ Latest Proposal as D.H.S. Shutdown Drags On  The New York TimesDHS shutdown has no clear off-ramp: 5 takeaways  The HillDemocrats send Trump DHS funding counteroffer as agency shutdown grinds on  CNBCPartial government shutdown over DHS oversight seems poised to drag on  AP News",
    "published date": "Tue, 17 Feb 2026 20:42:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOdHVqeUtSVmFvMU4tOE1ldUc2dHpvbTV0STNUMXJiUC11WTRZNzhiaVhMWDlqX0pPVGVBOXd6dWlGYXZWYTVOZjN2akVGb25jWENoV213Y1VBd1VwQlVkVVhWd1BhQmdDRXJJUXYtb3NOMk9hREdtT095NFVkekhvLXEtbVdoZ01FVnMzbV9UQmVZVkJqNERnMU1jT0t3S1YtdF9MSDZKUUZEUnc2WjhZbFZONFV3ZkQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "GOP congressman who says he supports dogs over Muslims faces calls to resign - The Washington Post",
    "description": "GOP congressman who says he supports dogs over Muslims faces calls to resign  The Washington PostFlorida Rep. Randy Fine faces censure, resignation calls over anti-Muslim post  AxiosHouse Republican Faces Backlash to Islamophobic Post Suggesting He Prefers Dogs to Muslims  The New York TimesUS lawmaker Fine criticized by rights advocates, Democrats after anti-Muslim remarks  ReutersRepublican congressman's anti-Muslim remark prompts calls for his resignation  NBC News",
    "published date": "Wed, 18 Feb 2026 06:09:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPT2JNTkc2MTMwV1RpV2pDM3F6SThlYzQxSDFaVUpDeEF2ZHBMTlJwcGhvOGdVY0ZjcDktbVJGVlQ0STVJZ0JUYk9pVEU2aHUxNkIybjFqTjRLZEFnZk5xMHV1U1pSUFRXRWkxRDdxak4xbVdMdWItUU5iRkhsTWJ2SGlmNFd6VnA4UUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end - San Francisco Chronicle",
    "description": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end  San Francisco ChronicleBay Area storm timeline: Coldest system of the season sweeps through  KTVUTriple-punch series of storms forecast this week  KRON4Live storm updates: Thousands without power after thunderstorms move through Bay Area  ABC7 San FranciscoHere’s When Rain and Snow Will Hit the Bay Area and Tahoe This Week  KQED",
    "published date": "Tue, 17 Feb 2026 20:37:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNU0lnWDVIUWp5Z3FXMGZtWHc2dzFTbWVzVDJMX1daS29ZaVpxWV9yR0JZZG5jaVNBSFFXaFNSQ1hGUnU4dG1wLTByRmc5SmE0S3hhV2ExREZKd0hxMW00TGNSS1BVNGl4SnY3ckp2cVFZbEFmRDlBLVNmOURyN3FOVW1tWmJfa3pLLU5LVzl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Trump administration is erasing history and science at national parks, lawsuit argues - AP News",
    "description": "Trump administration is erasing history and science at national parks, lawsuit argues  AP NewsNew lawsuit challenges Trump order to remove ‘corrosive ideology’ from national parks  PoliticoTrump officials sued over effort to ‘erase history and science’ in national parks  The GuardianUS groups sue to block Trump effort to rid parks of history, science information  ReutersGroups sue Trump administration to block history purge in parks  Honolulu Star-Advertiser",
    "published date": "Tue, 17 Feb 2026 22:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOZnhkWndoTUFPZ1RoMkg5Z0ltMmwxVGd6Z09TNUZKeno4NHg3V3Q4TlJVSWdPTGc2NjB4T1hXbmdSNVZYaEpKbkVYOGl2bk50OVY3UUhsXzNMV3RrQWphRWh2amNlWERSbVFyanNFMWlVNEVVOVlqMWtjYWg4SWtZQXZDNWd2Sm9DdnhFcWZxNWFrazU5SDdDcU1Dc1RfdnVVSkt6dFo0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Republicans, Braced for Losses, Push More Voting Restrictions in Congress - The New York Times",
    "description": "Republicans, Braced for Losses, Push More Voting Restrictions in Congress  The New York TimesTrump's election bill tops 50 Senate votes, but Democrats could still block it  NBC NewsWhy The SAVE America Act Could Create New Obstacles For Millions Of Voters  ForbesWhat to know about the SAVE Act and proof of citizenship to vote  Milwaukee Journal SentinelAlaska congressional delegation split on GOP-backed bill to tighten voting requirements  Anchorage Daily News",
    "published date": "Tue, 17 Feb 2026 22:58:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOLUFsaDZLaEFhRHJmT2Yta3pyY21fWmxTZjFxT0xaY09Cdi13ZENrOEtMWGhVTUMya25TdXV4aU9GZ3lhcVc4dHp3Xy1SUWFlczFPQVZSTnh0OHhYMW1pYUNTVkpSRDBfME4wT0FBbldXdkpJNzcwSm50VFAzdVlvbERKMjJqWkFaOHZvYjc3MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Portland could get as much as 2 inches of snow starting Wednesday evening...or not - OregonLive.com",
    "description": "Portland could get as much as 2 inches of snow starting Wednesday evening...or not  OregonLive.comForecasters watch Wednesday night, Thursday coastal low that could drop valley snow  KATUCheck out photos of rare snow on the Oregon coast  OregonLive.comSnow narrows in on Thursday morning for Portland. Here’s what to know  KOIN.comSnow is finally falling in Oregon’s mountains and could hit the lowlands  NPR for Oregonians",
    "published date": "Tue, 17 Feb 2026 22:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPcmw0ek1RZ2ZfT3Z6OEJvbk16bHRZS2pxLWI0dENLVjZ5LXVkZnNNaGF0ejNUZHhKTUJkR1BNYTBjSjJyNlI2U3ZZWlYySFRTbkdraDg0SkY3Y0tqeXV6WXFxdkpQa1cwOUl5U0l4cjQ2QTNISGRyVHJ3ZHd4V1JfMW1SX3plTXg1SjNQWXlqMTZ3THBkYXNRNHFvSW56V01MbWczLVYybG1xVXkyaGgtUVZ1SW10RGZzMXYwbGVrbU51LVdiYWfSAdoBQVVfeXFMTWw4aUh2RHRSSTlOSmJFbGxsdllWdGFxZDdMMzZaVTBJbElJcGNzZ3U5VVRFdzB1R2NUaWVDbWZlMlB3akVYWnR3cVFRQWFVaHJGUU1LWGRWTl9NNHNxTnpaT0FxaDVHT05OdEhaTEZLWVh0SDRRYUZGbHAydUJCZ3REbEJBSjlaS3BQdkt4NW9pcGF6RFRBWEVBdUk3OU4wOTNOWFZTMlBIeTMyZkZ4akI0ZUpMc0ZlcGhpbVp6YS1BSkoxM0tJR0pQVndaSVptZkpZUHRNem5ubGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "Colorado State Patrol says 4 killed in crash on I-25 near Pueblo involving at least 30 vehicles - CBS News",
    "description": "Colorado State Patrol says 4 killed in crash on I-25 near Pueblo involving at least 30 vehicles  CBS News4 dead in 30-vehicle pileup in Colorado as powerful winds slam Plains, fueling multiple wildfires  CNN4 dead, more than 20 hospitalized following crash involving more than 30 vehicles on I-25 just south of Pueblo, northbound lanes remain closed  KKTV4 dead, 29 injured in I-25 crash involving 30 cars near Pueblo  Colorado Springs GazetteVictims identified from fatal multi-vehicle crash on I-25 during brownout conditions  9News",
    "published date": "Tue, 17 Feb 2026 18:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNYUQ4OXY3UzhOYWh3Zy01VlhRTk1KYTk1YkhHWnpmb3VrNkh2OUNPNmFKNE5mLWtDaTltbEx1WDAxVnVMNzhObkRPeFdyVDdnV1FQUmVqVVVYdkxYclI0cDZRcTA1YTBNTzFxSlNlcWptLVZqb1I1SHdlNGVmalJkcnk5TnZ5dVVudHo4Q2lB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Citing Orwell's '1984,' judge orders Trump administration to restore slavery exhibit it removed in Philadelphia - PBS",
    "description": "Citing Orwell's '1984,' judge orders Trump administration to restore slavery exhibit it removed in Philadelphia  PBSJudge orders Trump admin to restore slavery exhibits at President's House Site  6abc PhiladelphiaThe fight over Independence Hall’s slavery exhibit goes national  WHYYJudge orders slavery exhibit to be restored after Trump administration removal  The Washington PostIn a Scorching Order, Federal Judge Rejects Trump’s Attempt to Trample the First Amendment and Rewrite America’s Antebellum Past  Ms. Magazine",
    "published date": "Tue, 17 Feb 2026 15:47:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPc3FnaXFGQU42eE40WDMxMkNNSEJhclZPRE91UDRtZEhwZ2J4LUZuRjVXckxRS3lhN3pYbm10OTVlZWpnVUZiazlIZ2lETVFZVUVuUG1sSjVPcEtrUTFsM1prS0M2MmJNRVhHQm51Y2FJY2VyX1dhckRvZU9qN2ZPNFFmMjhrTmp2U0NSbHZISG9vTGJGbGNOaDhKWFJCVU11YjFuTjYyT3c5cHJ3RkNGNmltLV9JWk1ya295Y1ljN1hmLVVnUHp5Q3BXai11Y05lSmVlZWtQWmhfcGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Carrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar - USNI News",
    "description": "Carrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI NewsU.S. Navy’s Supercarrier Deployment Could Surpass Post-Cold War Records  ForbesUS increases military pressure on Iran as countries discuss a deal  CNNU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesTrump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S.  Axios",
    "published date": "Tue, 17 Feb 2026 20:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZEF3YUZnSWlKX0hJRGZ5ekFwOEZZRlBzTlJJRE9VcmNBWUp1cTkycGs1S2JydnB2VkxseVRiNms1aGY4REE2R2JWZWp1eHE2eE5FOHcybDMxQVBKM3FqdjVSamt1dmVRei0wNjdlT3JuZ3NsYW9xbVFLYkxWMm1zNGN3VktnMHJJLXlzb3ZUd2J6WHRlZVhsVUpjb2RRZmhiM2dqUjR4MW0xTlhpU2xiaDBrUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.usni.org",
      "title": "USNI News"
    }
  },
  {
    "title": "Linda Davis, a teacher in Savannah, Georgia, was killed when a man fleeing ICE crashed into her car - CNN",
    "description": "Linda Davis, a teacher in Savannah, Georgia, was killed when a man fleeing ICE crashed into her car  CNNWTOC Exclusive: Security video shows DHS pursuit before crash that killed Hesse K-8 teacher  WTOCMan arrested after DHS/ICE pursuit leads to fatal crash on Whitefield Ave  WSAV-TVDeadly Evasion: Illegal Immigrant Flees ICE, Crashes Car, and Kills Innocent Driver  Homeland Security (.gov)Georgia teacher killed in crash after illegal migrant flees ICE stop: DHS  Fox News",
    "published date": "Tue, 17 Feb 2026 21:45:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1DYWQ5dnp2Qkdzb0xLX1BtMXdpTkpzOVJZSVhhR1RScWdOUUxpVzJmaFdIaW5TdWxjblJ6VDRqYWpXR1NtdUpEc3ZQR2hoWkU3a0tUc2pfT3hPMUs1RXl5aFQ5aWhNLUNQYjI5SXpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Canada defense plan aims to reduce ‘dependency’ on US - Politico",
    "description": "Canada defense plan aims to reduce ‘dependency’ on US  PoliticoBuild it here or buy it there? Canada's defence plan meets Trump's new arms agenda  CBCCanada Gives U.S. Arms Makers the Cold Shoulder on Military Spending  The New York TimesCarney unveils ‘Buy Canadian’ defence plan, says security can’t be a ‘hostage’  Global NewsCanada’s Race to Rebuild Military Triggers a Defense-Tech Gold Rush  Bloomberg",
    "published date": "Tue, 17 Feb 2026 18:07:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOdi1qVlc3dlFvcTIwSUlVNnBTZm9rbjdaa1c4QXQyc2ZnR1YyanZfTDBSdG5kZFR6ZGcxMHBLeWNRNlFKaFBsQy1yWVNhbUM3VEJhVEczclNIN0hrM1FrVno2U3ZOakN6MmxWRHNnSXVpQ0tvMEIwcF83Vk9YNlRRTDJERGJ5Mzl6anQzOHRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]