[
  {
    "title": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case - statesman.com",
    "description": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case  statesman.comFBI releases description of suspect in Nancy Guthrie kidnapping  BBC'We Will Never Give Up' - CNN This Morning with Audie Cornish - Podcast on CNN Podcasts  CNNRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOAGoogle’s breakthrough in the Nancy Guthrie case is raising uncomfortable questions about how much it’s watching you  Yahoo",
    "published date": "Fri, 13 Feb 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcDNzRkR2NElGNjlyNVdNNTV1MFZhZk5mN0g5Q0x1SF93OUtVT2JvUjVOcUdobnF6X3Z3NUMxM0VnRE9kbHQ1Si1EZVZYaWJySTFWa3hvMmYwWlpJcG1zUFI0bGNKSlpvOU1RTVVUWFNCUy1WRWNiWkZfOVdXbE5VY0VDUmNQcm1fc2oydWEyZEFyRm9fczBuM1ZjSnVibjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statesman.com",
      "title": "statesman.com"
    }
  },
  {
    "title": "Trump sidelines climate contrarians in science rollback - Politico",
    "description": "Trump sidelines climate contrarians in science rollback  PoliticoTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesFive early conclusions from Trump's \"endangerment\" climate move  AxiosTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNNTrump’s Climate Rollback Draws Broad Backlash and Some Support  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 12:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOVlpmOTFQa1V4VUpvWEt5ZjZTMXBVaW5TSkgtc1lBazBoWFJlVU9OU1pMN2tHc0FreDVxaFlnQTlFdGkyQ2VnUS1kY0tZLUtEbkR6N2l5cjJtSmZwM2NrNHBQbU0yOGVmZW5xTmRlYnNnYkpiVU1nVWQxY3J3RUpmNzVqSTg3QWVwOVVKcXZUc1NZb1ZaVnM5Q0s5eWFwX3lBdkVldQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Fetterman lone Democrat to support Homeland Security funding bill, as DHS shutdown looms - 90.5 WESA",
    "description": "Fetterman lone Democrat to support Homeland Security funding bill, as DHS shutdown looms  90.5 WESAThe DHS Shutdown Could Affect ICE, Travelers, FEMA and More  The New York TimesHow popular are Democrats’ shutdown demands on immigration?  CNNHomeland Security Department poised to shut down as Congress leaves with no deal  NBC NewsDHS shutdown imminent as Senate leaves town without deal  Axios",
    "published date": "Fri, 13 Feb 2026 11:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNc3ViNVh1cm5qLVpNdXYyblRmaEl5bGhkOElwTzcyQkN5VUoyUXd6bWhGT2FibDhGWXJVSGpzVk42T2Fnd1ZEcnNIUS1lb2JkSDFLMms0eGk5Sm1nSFZ0b19Id0dfazdCSDRDY1dVS0VkZF9oSEhPSUZscWJoOGxYLTdtTXpkRWltZElaVXhLWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wesa.fm",
      "title": "90.5 WESA"
    }
  },
  {
    "title": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children - The New York Times",
    "description": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children  The New York TimesThe Kids Trump Sent to ICE’s Dilley Detention Center  ProPublicaChildren trapped in Texas immigration facility recount nightmares, inedible food, no school  NBC NewsReporter details life for children and families detained in Texas migrant facility  PBSAttorney on 9-year-old client in Dilley detention site: ‘She wishes she was no longer alive’  San Antonio Current",
    "published date": "Fri, 13 Feb 2026 14:04:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4Z2hLbVhFMHlFUlQ2bjBjM3A4MVB3aHV2bTVjVDFqOGYwSWNvRW1Idmt3S2FUYURNU1ZTY0NIQXZUV21vZ3o1Uk12UlB1Y2tRNlI0X2RQV2h5SVBPZEJTZ0pqUTZkdDFzS2lHOTh5dTNwNk9Ia1RxWm5BajZodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump nominates hospitality executive to lead National Park Service - The Guardian",
    "description": "Trump nominates hospitality executive to lead National Park Service  The GuardianView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 02:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOV240VGhiN2tFU0NrN0JtTXFZVFItMTRXYWRJMFM5VHpQeGcyWlUxSnZqU1JHREd3dTQtQm93NGZwaVp1bFVlOTVsdVM4T1dqMUxXMWE5TGNyWkRxLUF2T2tSV3VBRWdZcU85MUhkMEhIeGNkT0RlVFJ5Nl84dHdYNWc1aFpiQUhyUDNHcjBxZlJFTFlmWG5PdGM3Mng0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump sends second aircraft carrier to Gulf amid Iran threats - Axios",
    "description": "Trump sends second aircraft carrier to Gulf amid Iran threats  AxiosU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesUS sending world’s biggest aircraft carrier to Middle East as tensions with Iran increase  The HillU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street JournalPentagon to move carrier to Middle East from Caribbean, officials say  Reuters",
    "published date": "Fri, 13 Feb 2026 12:53:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE4tWC1WNV9tSUhBVE1LSUFEbmMyeEVVTEw4Wkw4MVhiU0tmU0tEbnVLYm14WVctcXg0bm02b3dCeEtWM0h5QWRZem5INDk3Zk1SaE81Q1R3TnpQUEpOMDlYY1RUNEFPdXUxSGJMX0ZzSmdJY2NGUmNkdVRKd0pMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’ - NJ.com",
    "description": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’  NJ.comDemocrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosCommentary: The unintended hilarity of Pam Bondi's finger-wagging testimony  Los Angeles TimesHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoThe Tea, Spilled by Morning Joe: ‘Yeah, they probably should be indicted’  MS NOW",
    "published date": "Thu, 12 Feb 2026 20:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOQ2tZc0FnN055YjFrWEZzNzFkN3h5TV9SdWZPMlR0UWp3b19XRDI1aGd2UjdqLTFyTm5CekExY2t5R1ltZ2dQWDBYTjRYenh3NGF2ai1TczZnS04tZ3Zsb3ZyRHp6Ny1oWEllMEFkTkdzMzh5NDZmWWtPUlNIaGRFUGwybjFUS2hsaTRkYXdYR3E3eTYxQUJ4VE1jZlVLYnEyMVZWaXpuYTRia3NLOVHSAcIBQVVfeXFMT1A1UEpyVmtTWkpSU2F1S2pLYWNTamtyTXZyRTIta0FfMHczaTkzb3JNS0xPakw1VERseGpxcjJwZGN4VzA0N1dISGxzLVRVM0lNN0N4TXdyU1dCZzBiYnMwRGNMTGJUWUdHd3JDdkxkb1lINGlsbDJUWEJmbWYtQVJfeWN5WHVCdHNPbmcyMmpWZXlWbmJqX2RPejF2T1ZidlQyOHhKLWRoWGpFT3ktOU1oVW4wVFl4NHR5TVgzSW9MMmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check - CBS News",
    "description": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check  CBS NewsThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticTrump’s Minnesota Retreat Points to the Power of Public Anger  The New York TimesEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulWith federal surge end nearing, Somali community works to rebuild and regain trust  5 EYEWITNESS NEWS",
    "published date": "Fri, 13 Feb 2026 04:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcGt6cWQxTzJ4c1lFcHNiZTl0WXd5eEFJdlNpYlFqb21aNmZZNGxBZGZQckJ4cTBHeEZTbGJRV3h0YlVNUE1fRnB6MzN3UzJ0NFNCRjYxY1JEMlYxSXkxRkV3cGNJOXozWU8yZkY5V2loUHM4WEZVUmtyYXRPaEdXaHpwazZwNUxPVi1qZXBMckw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Prosecutors to dismiss charges against men accused of assaulting ICE officer in Minneapolis - AP News",
    "description": "Prosecutors to dismiss charges against men accused of assaulting ICE officer in Minneapolis  AP NewsProsecutor Seeks Dismissal of Charges Against Man Shot by ICE  The New York TimesProsecutor moves to dismiss charges against men accused of violent encounter with federal agents in Minneapolis  NBC NewsGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 13 Feb 2026 15:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNOEtWQVNnTGFYWVpnSlNraWZrZW15LVBEY1ZmWlpXV0Z4T0MtTXB2X1U3dHBoS2xHUm9hVTJXd2VQSlNRV3k0UW1BYjloSmM4My0tU01PQ1J5ZFZWTDZ6Vm5FT1NxTWhMbmhhc192U3JoRUV5SGh0WHdQaEtVXzFYYURKTmZTeXdLX1dmSDFvTzM1MEhobFEzV2MwUXJZS0JyQjFObVQ3NDFHdWJ5YTNXYkU2QTFTSXFsZXZKcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers - The Washington Post",
    "description": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostSlotkin demands confirmation ‘illegal orders video’ investigation has ended  The HillEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC NewsTrump's revenge tour falls flat in the courts  AxiosHow Trump failed in his latest bid to weaponize justice  CNN",
    "published date": "Fri, 13 Feb 2026 15:41:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPb3BTZWxnWlBiZTNHUTNWYzFGbTlzcnNDLS1MVVEzelVuN1Vhay1UMThnNXpGVFowUVptNXF5YjBSZ1V0UGg4NzN1NVp4SU0zYkg1bTFZNXBRMVNLSl9ReGpDdnR5MnhwMnh1ZHpzYTd0djUwVlhOWHRoQy14a3BxUU5kVURqRVJ1dUl5UE9lZXR6aVB4OTI1VjRUQnEtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesPressure mounts for U.S. Congress to block funding for Homeland Security  The Globe and MailList of ICE raids, major updates in Minnesota on Thursday, Feb. 12  Bring Me The NewsActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateICE is pushing Minneapolis underground  The Verge",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states - NPR",
    "description": "Judge blocks Trump admin from rescinding health grants to Democratic-led states  NPRTrump's CDC is canceling $600M in HIV and STD funds to four Democrat-led states  Scripps NewsFederal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesMinnesota sues after CDC cuts millions of dollars in public health grants  MPR NewsJudge blocks Trump admin from blocking $600M in health care for Illinois, 3 other Democratic-led states  ABC7 Chicago",
    "published date": "Fri, 13 Feb 2026 07:31:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaFJlYUJ6QmQ2S1FhdDBkTlI0TEp2MlRmTkxmS1pldjBKUGpiNTFzXzFQcGVrVDNNN0tFYzNCNDd4Mm8yYmpEZlgyNkR6b2NLYmdEX1VJZlM1eFRlY3pZZFdBdm11cHhydGVHeUZQZ2d4QzZJRXZFUmZzanMzUm9DOE1KcEhNZ0NGZWdJOGFUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "RFK Jr. made promises to get his job as health secretary. He's broken many of them - NPR",
    "description": "RFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRRFK’s idea of making America healthy starts with making it politically sicker  The EconomistTrump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK Jr. promised to restore trust in US health agencies. A year later, it’s eroding  AP NewsWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOR0dUZnUzemNidUpDTl80Uzh6QnlZODJzS2Jrak9nNFU0R09RanFCaWhUVGVLRUJCekhHWTIxV2NyOURnUVUwaGgxQ1VLRDVmcUVGbXNWQUJOalNjdmhaVXBSY0lyR3dxcmg2VEFzRFBuOHRpYXcxZEhzQi1MbFRLMnplcGdzenZnWjNpZXVKT2tVeFJRZWlKZ24ycGtpY0FvdldjTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesInside Jeffrey Epstein’s network  The EconomistSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianThe Epstein files come for Hollywood royalty  CNNEpstein files: A list of people facing consequences over the DOJ's release  Business Insider",
    "published date": "Fri, 13 Feb 2026 14:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "February 12, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 12, 2026  Letters from an American | Heather Cox Richardson | SubstackTrump named ‘undisputed champion of beautiful clean coal’ by industry group  The Guardian“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)Trump orders Pentagon to buy coal power as the polluting fuel struggles to survive  The Washington PostCoal industry latest to reward Trump with an unnecessary, made-up award  MS NOW",
    "published date": "Fri, 13 Feb 2026 07:44:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5CbkZXVWM0ZlBodXJyR2ZVNlJaNlMzdjROYlNaaFBfTFYzVDVDRXpHbDQ3eXdKRkc5S1hTQUVSM3o1ODhkczdsMEZtdGlCbk1zelgySXNpWmYzb2xIX3o1QmtIX2l4bnJKNGhwMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNLaser weapon that shut down El Paso's skies was LOCUST system  AxiosClosing of El Paso Airspace Adds to Tension Between F.A.A. and Pentagon  The New York TimesSurprise US military plans to use counter-drone laser triggered El Paso airspace closure, sources say  CNN‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  Politico",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It. - ProPublica",
    "description": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It.  ProPublica‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston GlobeMoroun company lobbied Trump administration ahead of Gordie Howe Bridge threats  The Detroit NewsReport: Michigan-Canada bridge delay could cost up to $7M per week  Bridge MichiganTrump Has a Bridge He Wants to Sell You  The Atlantic",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPN2RBRm5yY3lIaHo5bFIyNFZITEVmYW43bDA4OWo4MGE0bXpRdVJqX3N4ZXNScVh1elJ6c3dtN1p6NmlROHA0YlJTYmdVS0pickxKLUJFc0JTOHdicXJ5aGRHR0Jqd1E5cEs1TzBFclJQaHhBM3g3NU9wai1fODJDWXNwRGE4Yk8yNVN5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "description": "Pride flag flies again at Stonewall Inn, challenging federal ban  The Washington PostN.Y.C. Officials Reinstate Pride Flag at Stonewall After Federal Removal  The New York TimesNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkActivists re-install Rainbow flag at Stonewall National Monument, defying Trump admin  amNewYork",
    "published date": "Fri, 13 Feb 2026 06:56:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTlZKcnY4SHdjSnFPWHhnQjVjcmdBMm5lR3pYeEFLck1XYVR0b25hWVhTczJONlRQSExha1ZMMUhfZ3c5Qk1qbDI2VTlCUUZ1VU0zYW5YemlSVmtLTnI5WnR6RnV4ZXNjbGhNcEwzMGhJbWRoNkp6VUNHb2FyTzRsNWlKZmI1NE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New YorkMamdani Says Budget Gap Has Shrunk, Easing Pressure on Albany to Tax the Rich  THE CITY - NYC News\"Honeymoon is over\" Zohran Mamdani grilled by lawmakers as he proposes to \"tax the rich\"  WRGB",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge: Government flouted constitutional rights of Whipple detainees  Star TribuneJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York TimesJudge: ICE must ensure non-citizen detainees have access to legal counsel  5 EYEWITNESS NEWS",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections - PBS",
    "description": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBSHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsHouse passes GOP elections overhaul  PoliticoWhat is the SAVE America Act that mandates voter ID?  BBCRep. Crow Holds Press Conf. Following Failed DOJ Indictment  C-SPAN",
    "published date": "Thu, 12 Feb 2026 17:52:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOY0ZzZXFwWk9laXpFVWJsaVlYLVdiQTUxbFpuYTZROERXSzBpOVRHYlpsTFUxNUFkbHhqQlM0UUFRa19LTFR0LTIwbW5hVE5yNWRVbnBkTVY4dHA4U09FempMdHFsSFFnY1F5ckpqRF9vbXRVV2YyWUZfZ0pqZFpoX3JMdnRMbm9HNVFydDV1M0FiYUk3Z1Zzd3R3MUxxOWhEUTdnbEpFcWdxYTdURllVLWV2eWlleG11a3hvV0c0WC1MZUdyQjFiTk5DSFjSAdIBQVVfeXFMT0dkZWJnbmZPMXJReUEzNEdVZkJFLWdIOE11c2UxYzVjQzZPNWtxOHo2RU9qQlFTN0ZRVUpmMlh0U0ViV2FEd1hJcU9vRzhJZ3lUYi1vcVJ4T3pmZnRxQVMzLVRlSXk1dDVzT1hIaEZ3LTBOWk1JRTU3T3VaTFM4T0UtZWZLQzZjNl9QbnM2Wmt5ekwtYVBMVnVxOXd1eWRvcDQ0bUlQeHNfTGhrRElURTZJRTVpbGVBVC1YdnpxcXFJY2lreC00QmZPZjdkMGktTV9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsGovernors association says all members now invited to White House meeting as Trump defends exclusion of some Democrats  CNNWes Moore says he won’t attend governors meeting at White House after dinner snub  The HillTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsMaryland's Democratic governor among those excluded from White House event  NPR",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York TimesFederal court blocks Hegseth effort to punish Democratic senator  PoliticoOpinion | Sen. Mark Kelly's legal win over Pete Hegseth is a First Amendment victory for all military veterans  MS NOWJudge says Pentagon 'trampled' on Sen. Mark Kelly's rights, blocks effort to demote him over 'illegal orders' video  NBC News",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRDemocrats’ tariff gambit sparks new headaches for Mike Johnson  The HillCongress’s Rejection of Trump’s Canada “Emergency” Is a Welcome—but Woefully Insufficient—Move  Cato InstituteTariff votes hand Republicans an unwanted referendum on affordability  PoliticoSix Republicans Break Ranks With Trump Over Canada Tariffs  Time Magazine",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump Offers Absurd New Excuse for Vile Obamas Video - The Daily Beast",
    "description": "Trump Offers Absurd New Excuse for Vile Obamas Video  The Daily BeastTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS News‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesThe lion speaks tonight – and what he says is despicable: Marvin A. McMickle  Cleveland.comTrump Says He Hasn't Disciplined the Staffer Who He Blamed for Posting Racist Video of the Obamas  People.com",
    "published date": "Fri, 13 Feb 2026 07:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQVBfNWNPbndCaWNGc2k1d3ByV2VISnNoRVlEcjRZd0pIUDZ3UWVUZk9OZm5kX2Ftc3hFa0xhTGotVGdiMkZXOHNGMVFybk5sVGZjUF9UQmp5c2Zfck5qN3ZVLUd6YkJPWXZaaXF0bUdWTzduaE5HRG5SdmlZNzg2WHhHZFFGMk9qQ2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNTrump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosIran’s Missile Program Tops Israel’s Concerns as Netanyahu Meets Trump  The New York TimesBenjamin Netanyahu says Israel skeptical of deal with Iran  The Jerusalem Post",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick - The Salt Lake Tribune",
    "description": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake TribuneBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNSenate Republican opposes Trump diplomatic nominee over anti-Israel comments  The HillUtah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post  PoliticoTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC News",
    "published date": "Thu, 12 Feb 2026 23:53:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVlplNU0tZDBIb2NoY09oc2VVQS1jd1ViUGpIVk1jdUFrbXZMTHhEb3hMRm9mbmgyWlMyTk9qQnZlOHZxcU9JQmVxdmY5aGE2S0lncUhQd3RHd0ozMVdzcXpqTExjZFRqeXo4R0ZCOU1iTEFfRnRBSllhb1hfLVpDRThQS3A2Rk9tV0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "Trump officials confronted with Pretti shooting video at Senate hearing - Axios",
    "description": "Trump officials confronted with Pretti shooting video at Senate hearing  AxiosSenators Press Immigration Officials on Minnesota Shootings  The New York TimesHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneCongressional hearing examines ICE presence in Minnesota  MPR NewsMinnesota & Immigration Enforcement Officials Testify Before Senate Committee  C-SPAN",
    "published date": "Thu, 12 Feb 2026 20:26:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQSllTajVsMDRtOWtDcThRZlQ2UHRmdFlXVU5wUUUtMTMtRVlsVkttcEdMcDNtSWpWS05BY0tCRzIwcVQtOU5rR3daR1BmWlRKRnkyZGR4ZEFHMElLWW5PVDY4Q0JkUTF4VS1HeHJSRm4wTE9KN3AtaFN0RS1EUVNxMjR4UFJCY245S1REN3ViTGlxdmx3OVdMbHhTaGQ0anNQQmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race - The New York Times",
    "description": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesNew Jersey House Primary Special Election 2026 Live Results  NBC NewsAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of IsraelWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al JazeeraAlmost every N.J. congressional Democrat has endorsed Mejia in both April special, June primary  New Jersey Globe",
    "published date": "Thu, 12 Feb 2026 23:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQRTJMWjJRVXZDR0lSV2hDbEJqalF0R2VMYmhPVGpzT2lPbUpnYXotM0VENDZtMmk3U0JDaFYyUWVTZmFDMXVnZzNrYUEtb1hnMHFRRHhLMlFUMVQzVUFkWTE3VjM1SGU5Um1qNGRoUXNlSnJJd3NNY0Z0TEJyM1hSSThQMFJRbVpWbVVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence - KTAR News 92.3 FM",
    "description": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence  KTAR News 92.3 FMSheriff Refutes U.S. Official's Damning Claim About The Nancy Guthrie Case  Yahoo News CanadaNanos pushes back on claims of withholding evidence in Guthrie case  KVOASheriff in Nancy Guthrie case withholding key evidence, FBI says  NewsNationSheriff leading Guthrie investigation spotted at basketball game as family pleads again with alleged ransomers  Fox News",
    "published date": "Fri, 13 Feb 2026 02:11:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB6eVRrWXBYMjdNc2YwdWFaMXpTNE1mcDZPa2ZkcF9zWU45UUFSYjdyQ1RHaHZ6WHBqT1J6cWJ5MHd0bUJlY01ycjBNS2JPY25IN0d2by1NXzl6VDRYUG5ZNDlTTWdvUWYtcmdUNDZjaFRGS2dSREVwZzVJZ2hOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ktar.com",
      "title": "KTAR News 92.3 FM"
    }
  },
  {
    "title": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts - KCUR",
    "description": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts  KCURWoman seen trying to set fire to South Kansas City warehouse tied to previous ICE detention proposal  KMBCCongressional reaction mixed as developers stop sale of KC warehouse for ICE detention center  KCTVWoman sought after setting fire to Kansas City, MO, warehouse once considered for use as ICE detention center  KSHB 41 Kansas CityKansas City police looking for suspect in attempted warehouse arson  FOX4KC.com",
    "published date": "Thu, 12 Feb 2026 21:55:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPX3UtWDN0YkVfYVBZX3ZPYXRpNnh1WExxaFRqSmJSb09sRDk4eUc0LUJ1dmEwQ3ZwRzZCLV9UZTYxRzlXbUcxa3hBZHZON3hNSmlFTGVUMkZhQ3VKeEdWcnYwN3Qybm8xb1ROb1p2dWxCeHFza1haazVNUXhvX2czSmxiRTRVSjlQa1RaS1gzSWVkLWstdkxwMXFZXzQ5NklMSC1meFpHMEtISGk1N1pQY1dTa3NkWDgtLU9ValN2b09haDloNExuVDJZa0l2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kcur.org",
      "title": "KCUR"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSImmigration authorities had surveilled Marimar Martinez, Chicago woman shot 5 times during 'Operation Midway Blitz': CBP Report  ABC7 ChicagoMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  YahooDHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times  Chicago Sun-TimesBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC News",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]