[
  {
    "title": "Nancy Guthrie disappearance: FBI reveals description of suspect and backpack he was wearing - Fox News",
    "description": "Nancy Guthrie disappearance: FBI reveals description of suspect and backpack he was wearing  Fox NewsExclusive | Investigators find black glove during hunt for Nancy Guthrie’s kidnappers — and The Post was there  New York PostRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOANancy Guthrie updates: FBI increases reward to $100,000, releases new details about suspect's physical appearance and backpack  YahooSecond video offers more clues in Nancy Guthrie abduction as authorities seek answers  Los Angeles Times",
    "published date": "Fri, 13 Feb 2026 07:42:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQTkZxV1ZyUEY2a2FwRjRPem9HNnE5WVFqTlF4ajgxSkxsczhaRUZMa29FanR0WjB0WV9wZGlsdVdmR3FHN19oQ1lWSHpDWEtudW9mc3N1bG9mNmhZdkhnSzI4NTdoMTVLY1ctRVFWZC1tajRiVjBRV3FjS3ZUaXZMR1dJLTN1SnFCamQxUjFRUlN6MXRzSER2WXJhY01ieFhvZzk5TGVXN3h0ejRLdVZielQtdVowamN1M0ZhaTlZOThlYWg5MG1wWEdUTk8zZ9IB0wFBVV95cUxOSWEyM2lkcG5xNGpyM2d1Q0thOHhBY2hhb01lWThmamdiTnY4WG44RmpXVjhGbENUZ2dlTENuZlV5Y1g2REt3RmhjeXB5YmJ6QUZDNldUSmhDUFh0b2NLdWprR1N4Y0w3RUVJWWRra0NyQWFCOV9Pc19qdlZHdzkwM0pCY0IzVFpBaks2UHZjS3d5ZGpqRmVsRGY1dmdDMlNiRE4yNWxwWlF6cDRJVmZpbFdNelhpdE5KeENfU3JYSWlvbFI3WjFIenQ1N3FmanNpRXpz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  },
  {
    "title": "Trump repeals U.S. government’s power to regulate climate - The Washington Post",
    "description": "Trump repeals U.S. government’s power to regulate climate  The Washington PostTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNNWATCH: Trump, EPA's Zeldin announce end of scientific basis for U.S. action on climate change  PBSCalifornia, environmental group plan to sue Trump administration over emissions repeal  CBS News",
    "published date": "Fri, 13 Feb 2026 03:43:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPT0tIWHEyTHpLclhSbjJwLXNzWE5Ydlg4Z0tmNEhKSElRcmJ5bnE1VjVtWEdNSktvNFhJZGZXbnhuZmxmcjQyaGlUcWVQVGRVQmd2X1JsM2RVOTNmc0JFX19DUXNrSXdZRHZwaDNpOE8teW5PTlVJSnVQSVZmMGFkZURvTGpDQjBuVTFYWnRIMVBhTGhI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "description": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosHouse Democrats think Pam Bondi just helped them in the midterms  Politico‘Pretty rich’: Republicans claim Democrats are the hypocrites in new DOJ ‘spying’ scandal  MS NOWPam Bondi’s Contempt for Congress  The New YorkerHouse speaker condemns Trump Justice Department monitoring of lawmakers’ Epstein document review  CNN",
    "published date": "Fri, 13 Feb 2026 03:33:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNdG5Bbnhmb0VxdEpLU0FVcFQ3WUZTbmJ1WU5WeTBJblZyVnpfZFdtZkhXMEdsei1WZk4yQ2QtNEZGcGwtRGxfandyMUJfN0drUVRtbEhyZWMwMkk0WEtpX1p1ZEZYNzdGQVNjdDFOaUFKOWNfQlYwNGFwNXdjaDd5czZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Lawmakers resign themselves to lengthy DHS shutdown - Politico",
    "description": "Lawmakers resign themselves to lengthy DHS shutdown  PoliticoDepartment of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight  CNNTrump Live Updates: Minnesota ICE Drawdown, DHS Funding Shutdown Standoff and More  The New York TimesDHS expected to shut down as immigration talks falter  NPRHomeland Security Department poised to shut down as Congress leaves with no deal  NBC News",
    "published date": "Fri, 13 Feb 2026 01:46:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNWjJ0TUp6TmFLRjBCTmkzRjNmSHNkdVRWUFcyRDNjRnRlWHM2Y0dGUElydzRTVHRhdjY0Q1dpWnh5RUh2bGljRTZ2ZW9YYlRZTWs4Qi1VXzA5Y2g5ZUVkejBPT3pZQ2tQU0dwOEpiX0pDb3RDOFpiRXB1N1k2SWdBRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings - AP News",
    "description": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings  AP NewsEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticMinneapolis Immigration Crackdown to End, Says Trump Administration  Time MagazineTakeaways: Enforcement surge ending in Minneapolis as state and DHS officials face tough questions in Senate  CNN",
    "published date": "Fri, 13 Feb 2026 00:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPOXdoam1OQUZhZ251b0NLM3F3TXRhamhrTHI2eUo5UmZNYktmSFhQb2pTamI1VG9NU1lXRkZrZUNnd0tIckVVamZRM3NVOVpJNVVlTTZNSU5CQ1A0MndrLXRXdDVoS2RRYS1oeUdleGszS3dkX1NuY3FiYTBFQVhxR3NnVjRDalFmQXVEVkVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge blocks US military from demoting Mark Kelly over 'illegal orders' video  BBCFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge says Pentagon 'trampled' on Sen. Mark Kelly's rights, blocks effort to demote him over 'illegal orders' video  NBC NewsJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Judge dismisses California deportation case for Mexican father of 3 US Marines - AP News",
    "description": "Judge dismisses California deportation case for Mexican father of 3 US Marines  AP NewsView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 01:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOVTFnUDhkVVNDSmFzbVVCTk43T1Z3cHZmMVFvTlYzeFhnY1hGMzZWY2FoWW5KOHVBb3RoTDR3dERHQUF1a3Vha3NBS1AwRFdoZFViRW0zMjBHWEpwRUtMdGJqWmcxckpvc1FUMkU1UnZEb3dnODZJMDdQNVpwX3dnRTlaMy01QnFwc0dqTnpSWnhSa1JYMlZBa1RTSFBvTnJlc25HOTBCbE9yMExSaTBlV1IyOUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNLaser weapon that shut down El Paso's skies was LOCUST system  AxiosDo Drug Cartels Actually Use Drones at the Border?  The New York TimesAP: Pentagon-FAA dispute over lasers to thwart cartel drones led to airspace closure  KFOX‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  Politico",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "What is the SAVE America Act that mandates voter ID? - BBC",
    "description": "What is the SAVE America Act that mandates voter ID?  BBCHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsRep. Crow Holds Press Conf. Following Failed DOJ Indictment  C-SPANHouse passes GOP elections overhaul  PoliticoHouse GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBS",
    "published date": "Thu, 12 Feb 2026 22:40:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5XalhoSGFGaTJrWU9qRFFBaHRkS1l2eVFlaEFHOVdPcGIwalBtazdOQTBwV3JfMUNyRTFWalFvSXppZ1dtcFB1RWFiZEFVZmg3enhGRWljeW5LZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "U.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say - The New York Times",
    "description": "U.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesUS readying another aircraft carrier for deployment amid Iran tensions  Al JazeeraExclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East  The Wall Street JournalUS aircraft carrier ordered to depart Caribbean for Mideast, as Trump pressures Iran  The Times of IsraelSecond US aircraft carrier to head to Middle East amid Iran tensions, US media reports  Reuters",
    "published date": "Fri, 13 Feb 2026 02:43:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBnN0ZtQ0hCN2o5MzFmY3lEYzIxQVJPZjdqNi1aNmo0ZVY4WlhKVDZ6X1RzaHhNeTVrejMzX2hNSU5DMU41NnlnNzVXcWg3YzJEaVdKampweU1lVFVXdlBGdFBSOUNvN1Fwd05qVmI5a25nMUdBOTRVS3ZxN1lUTUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece - CBS News",
    "description": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece  CBS NewsUS federal immigration officer charged with harboring undocumented person  The GuardianCPB supervisor accused of harboring undocumented migrant girlfriend who authorities say is also his niece  The IndependentBorder agent charged with hiding person in country illegally  KRIS 6 NewsCBP Supervisor Arrested in Laredo on Harboring Charge  Hoodline",
    "published date": "Fri, 13 Feb 2026 02:22:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNYVBkZVptOWFLSjJ5R19mdG9HZEQ3MkF1eEpNY04xbEpkQlEtS0VZXzVFSTZyblJBQlNfdko2V1BLYk51NW1EOFVNZW5mdk1UYlNpVmlPUFcxSEJVbHpzM29wVHVfajNfRTZtc1dpb0xqckloTnJraUlETDNuNUdXMXNzOFBSVXE2S3VGbV9ST2EybnJ2V0Vzd1U0LUdWQzlaUWhHYUJlamlFdEx6NEpiU2lseEowc3h1T2fSAb8BQVVfeXFMTXZYN0cwdjZ1QVFlTGt0MHAxdkZ0enRXdGVUNjJ0dTNkcjRnTDBvMWFjbGM0LVJvUXhzSDd1Nl90cjJTTFhfRGNaejlGRWtrZHVUSWxwUEFFNWJCQWJqSHdBOXE0cnBORzRYcGNFWjJJd2lYTVgxRXFaeGlRcjAzN2l0OVY5ZjlMMGtsZUFvVGNhbTJkRU1SeXFVTWRnRHFUR25YR3JQdU93Zk5iczlzWmVxRWNjS21TZU5lbWREM2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "description": "Pride flag flies again at Stonewall Inn, challenging federal ban  The Washington PostNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkNY officials raise rainbow flag at Stonewall in rebuke of Trump administration  YahooPride flag reinstated at Stonewall after it was removed by Trump administration  The Guardian",
    "published date": "Fri, 13 Feb 2026 06:56:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTlZKcnY4SHdjSnFPWHhnQjVjcmdBMm5lR3pYeEFLck1XYVR0b25hWVhTczJONlRQSExha1ZMMUhfZ3c5Qk1qbDI2VTlCUUZ1VU0zYW5YemlSVmtLTnI5WnR6RnV4ZXNjbGhNcEwzMGhJbWRoNkp6VUNHb2FyTzRsNWlKZmI1NE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump attacked this GOP governor while claiming Democrats were always included in annual meeting - PBS",
    "description": "Trump attacked this GOP governor while claiming Democrats were always included in annual meeting  PBSTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  PoliticoConfusion reigns over Trump meeting with governors  The HillGov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS News",
    "published date": "Thu, 12 Feb 2026 17:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNR1FKT3lEV3FDSGFzWm5hdnlFU3ZRZU1fbUlMM3QzcElpVEwtbFVYbU82MWRnX0ZDY1JjV0hONHlPQmFsdE5KZTItZUYteTh5STlFYXllT1hlYndZNGJFZ2Y1d3JIclRPOUpEclpvM2dTX0NCUENkeXI5WXV0TXplNlh0M1lOTmxscTBEOWxJV3lLZy1iUC1ROTk2RlJMRzcwOXZIb1Y2VkNxei00dkw0TXBPdldBNVVIM2ZiNGFwX19sTXkzcXpGN1RITG1MclXSAdQBQVVfeXFMTVFVa2pGdWFNQS03bDBQR1NQOWVjTVFyVUlTTTliS0pzcVl4MDJmdzBRR0dib052OUswSGtfQUZMb2dmbnFHSUZKbDNSNEtYVkgxbEhPYjF6Qm1ULWNOdENVYVpDY2Utb1kySzZXaHZRXzNUZGh2cU8yTndoS29yWDNiZVowUUJvQ0JFbVRGR3dkS2VWQXpaaFV1NWlBTTZXTHZlaWVPTTlGcnk5MkJzTHVHUWhSX2g3dGVwQzU3ZFpsYUhRY1N1bU1rZ011UDNtQWtsOFM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds - The New York Times",
    "description": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesJudge blocks Trump admin from rescinding health grants to Democratic-led states  NPRTrump Administration to Cut $600 Million in Health Funding From Four States  The New York TimesMinnesota sues after CDC cuts millions of dollars in public health grants  MPR NewsIllinois sues feds over $600M in cuts to HIV, lead poisoning prevention grants  Chicago Sun-Times",
    "published date": "Fri, 13 Feb 2026 01:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ1RtbW1BUUtqUGdIYzVMM1RGcVc2U254c2tNaF82aEFwN20zMWZmcjFFeXkxSUtlLUhKelhpSWVuMkU0YnlHVzlqeVcyMWhKODFhZUxsemhHaE4xNDFYbGpUdHI1T1JNSTJfWVIxcGkyYm9aM3doazVySndxNjhnNVQ3WjFySkFVZ0RaZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "A New Frontier in Timidity for Congressional Republicans - The Bulwark",
    "description": "A New Frontier in Timidity for Congressional Republicans  The BulwarkHow Trump failed in his latest bid to weaponize justice  CNNTrump's revenge tour falls flat in the courts  AxiosGOP senators express relief over failed DOJ effort to indict Democrats  The HillOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington Post",
    "published date": "Thu, 12 Feb 2026 20:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNNEpNNHFOM2hxRU4xUFJVMk02OVdkSkdtaFo0SlhoMllKYzFPN1RkSElLbGFSaXZlMmN5ZmpMSk9LTkRBTWZoSVQ2TEUyLXo2VERoQ2NUaDYxVU9ZeEhGR2Z0NTlFdkN5Z0xrN3lKN0o2Z2NYZ2s2ZjVQTC1UYUgwdXRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Charges against man shot and injured by federal agent to be dismissed - kare11.com",
    "description": "Charges against man shot and injured by federal agent to be dismissed  kare11.comGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSProsecutor Seeks Dismissal of Charges Against Man Shot by ICE  The New York TimesNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. PaulCharges dropped against men accused of attacking ICE officer during north Minneapolis shooting  MPR News",
    "published date": "Fri, 13 Feb 2026 00:14:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPSXAyNTRsRUREYldHdGxXYk12eFl3MjdmZmRtRkJvTHVOZjdFdG1aZGdRcXhqamsta1hqaDJJV21ubmNfOXNld0dCTWdrUW9GYndJQWptZXA5M1pNdU5jZ0NGNW1UWVBielRJNlhHVldpUWJPLXV6QmZ0dzluZ2ZOaG91Q29ZSV9kVWFLQzJrbXhWX0JoMzd6TXhlR2ZTRG5TYUNFVW1rX2R2V1dVSjREYzVqSmtlbTJqeWVtTS1SYVVDamNQX0JVOXJpc05UdmxId1JpR3NJYUNWWlp2VEhkUGRpVExUQm1CWW00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  YahooBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsImmigration authorities had surveilled Marimar Martinez, Chicago woman shot 5 times during 'Operation Midway Blitz': CBP Report  ABC7 ChicagoOpinion | We Have to Face What ICE Has Done to Us  The New York Times",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race - The New York Times",
    "description": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesAnalilia Mejia wins N.J. Democratic nomination for U.S. House seat  MS NOWWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al JazeeraOutside groups pour millions into NJ special election  New Jersey MonitorAlmost every N.J. congressional Democrat has endorsed Mejia in both April special, June primary  New Jersey Globe",
    "published date": "Thu, 12 Feb 2026 22:41:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQRTJMWjJRVXZDR0lSV2hDbEJqalF0R2VMYmhPVGpzT2lPbUpnYXotM0VENDZtMmk3U0JDaFYyUWVTZmFDMXVnZzNrYUEtb1hnMHFRRHhLMlFUMVQzVUFkWTE3VjM1SGU5Um1qNGRoUXNlSnJJd3NNY0Z0TEJyM1hSSThQMFJRbVpWbVVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act - NPR",
    "description": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act  NPRJudge says U.S. must allow deported Venezuelans to return for hearings  The Washington PostJudge orders Trump administration to help dozens of deportees return to the US  PoliticoJudge orders return of Venezuelans formerly detained in El Salvador if they choose to come back  NBC NewsAmericans could pay to bring back alleged members of 'foreign terrorist cartel' to US  Fox News",
    "published date": "Thu, 12 Feb 2026 19:05:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNZEdPVEZXd2xISUJOTHc1SW5tVkhGdmZnRDBSZmVHMTc0NE9KcHRhRFV5UmZSeGdHTS0wYkN4bzlsSUhOVVU4UWxtb3VySERJLUZWT0E2QlVsZGVjdEgzSnpSTm8yT1N1RXlBVTZMdTZTWEtaT1l0WF9IckczS0U0ZF9rcVhTZExSVEY5Uml5a2xCSmRqa0xRQkRtX0JfaGc5QUQzd1lCTzNyWmtrUEdVUmlXYnIzNk1RYmdpY2J4SzZtY2hBbmF3UkpnWWVJck9hdUt3aWxoNWRrTkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesThe Epstein files come for Hollywood royalty  CNNInside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosThe Epstein files tell a story of justice denied  The EconomistOpinion | The Real Epstein ‘Ring’  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 00:36:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Costs from Trump's tariffs paid mainly by US firms and consumers, NY Fed says - BBC",
    "description": "Costs from Trump's tariffs paid mainly by US firms and consumers, NY Fed says  BBCWho Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNNAmericans Are Paying the Bill for Tariffs, Despite Trump’s Claims  The New York TimesOpinion | How a supplier of nuts and bolts could curb Trump’s tariff overreach  The Washington Post",
    "published date": "Fri, 13 Feb 2026 01:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFB6WnR1Mi1xLWo1Qy0wa3kyX0JZejk0TnFybjR3bWVfbXpSNzZnNnZZbTRiT3Jwc3BGblVWaFUtOXQ2cGpaT1NjRlJhRGQ3ZE1XS1hkWXdpcUk3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump Offers Absurd New Excuse for Vile Obamas Video - The Daily Beast",
    "description": "Trump Offers Absurd New Excuse for Vile Obamas Video  The Daily BeastTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS NewsVance breaks silence on Trump’s racist video of the Obamas: ‘It’s not a real controversy’  MassLive.comNewsom: Everyone 'Should Be Disgusted' Over Trump's Behavior  Time Magazine‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQVBfNWNPbndCaWNGc2k1d3ByV2VISnNoRVlEcjRZd0pIUDZ3UWVUZk9OZm5kX2Ftc3hFa0xhTGotVGdiMkZXOHNGMVFybk5sVGZjUF9UQmp5c2Zfck5qN3ZVLUd6YkJPWXZaaXF0bUdWTzduaE5HRG5SdmlZNzg2WHhHZFFGMk9qQ2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing - AP News",
    "description": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing  AP NewsHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneWATCH: Minnesota officials, federal immigration leaders testify before Senate Homeland panel  PBSTakeaways from a tense House hearing with Trump immigration officials  CNNMinnesota & Immigration Enforcement Officials Testify Before Senate Committee  C-SPAN",
    "published date": "Thu, 12 Feb 2026 22:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaDB0WGFKUFRXOWxJSzFoRlF3YzJKVjVoeUxpZ0FlVGhQbjdGcUlvV3BXQlliX0ZnOENFb0VtNU1iRk5kMTY4cVVFWnpFRmJLZlhYNzJacFBqc05nTWxHbHc4N2p5MlZZNG5UT0wtbWlWUnA3c3JTc3NjNGJVRTJwVURZbXhwUEV6ajJWcjcwZXlnQU5FczBxbUdMMGkxa3kyendMQzM0bGhjdzg0dzc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Senate clamps down on DC tax bill - Politico",
    "description": "Senate clamps down on DC tax bill  PoliticoIn rare move, Congress exerts power over D.C. and blocks tax policy  The Washington PostSenate votes to overturn DC tax code though officials warned taxpayers may need to refile  NBC4 WashingtonBill to prevent DC from opting out of Trump tax cuts goes to president’s desk  WTOPRepublicans just f*cked D.C.’s tax-filing season. City leaders could fight back.  The 51st",
    "published date": "Thu, 12 Feb 2026 20:57:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNQVcxaG9tT1dpcjVoOE9CYlZfbU1UYUdLZmxOaVo1Qlgtb1lqUkVTQm81ci1JVVNsYjVjMzhKSUhHNnFmYkJDZndPbUVNbmVpazEwbmplT0k4SzczbXY0ZlVQUGJDN3hBWEI1YmRzc0FvajZ4eURfanpkTDE0VHFWY2JCSlFHMlZWV202d1hzVXJwOU9jeWNxbWpwRlZNd3VtZDJr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Utah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post - Politico",
    "description": "Utah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post  PoliticoBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC NewsTrump’s pick for top diplomatic role faces scrutiny over ‘white supremacist’ views  The GuardianBreaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake Tribune",
    "published date": "Thu, 12 Feb 2026 18:31:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOSEJCM0xvN0UxeDN3T1VMdGE0ZlkxYkJYaGVoVWo5STFkWm9DR2pqaTdhM3o5czZzejNfTFRZWVRWOFZBajRMOThEOC15dEdDWWhQMHJkU19iSHlPMzZubWZFOVE4WUdzcjZEcllJZFJ0Z2p1aUpVTFVVTUp0c3h3dTRmZm9oUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump judge slams DHS for blocking detainees' access to lawyers - Axios",
    "description": "Trump judge slams DHS for blocking detainees' access to lawyers  AxiosCourt rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoICE blocked detainees' access to lawyers in Minnesota, judge finds  ReutersJudge rules Whipple detainees must have access to attorneys, private calls  Star TribuneA judge orders DHS to give Minnesota detainees swift access to lawyers before transfers  AP News",
    "published date": "Fri, 13 Feb 2026 02:48:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQjFYQnhNWl9PZ2tCVm54bWMwSzM4a1BFMi1KYmhNVncyYzhpb2llR2pjYUc2ZnAtSGQzUWdVMHN1SnAxdlFFOWJGa1VzeDBoNFRUeThTUzUxNTMzVE9WSFZxeFNCaGdMaDZWNGdEM2RJUm44Z0ZRX3NOVS1NTkJ3b1h0TTNvOENDalln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Senate Republicans rally behind USMCA even as Trump’s support wavers - Politico",
    "description": "Senate Republicans rally behind USMCA even as Trump’s support wavers  PoliticoU.S. agriculture groups launch campaign backing trade deal with Canada, Mexico  CBCPress Release: Ron Wyden Advocates for Enhanced Enforcement of USMCA at Finance Committee Hearing  Quiver QuantitativeAdvaMed Supports United States-Mexico-Canada Agreement Renewal  AdvaMed® - Advanced Medical Technology Association®USMCA Reassessment and Tree Fruit  AG INFORMATION NETWORK OF THE WEST",
    "published date": "Thu, 12 Feb 2026 19:56:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxORXhCOUtCc1VaaWVXWXNHRnB1R29NRGhwYzNEY1EwZVFnXzZmRHJteHR4RUY1QnpjZ2FXZHFLSDV4bVAwbHBTbjVSZ0U3X1BoZVlPeXNYZnM1STRqU0tYeHdFUzdhdjZKR1Z5eEh1SndfZnluX2ZpNWlGbC1fZU5DanFvS1B4UkloQVIxMUF3b1pQazY0QXhoNUowUDJfQjdiT1ZwRXhOTnBWT1hPS1ctWTBEZ002dmcybl8tS0ZSSWNuZVljMTlSdHd3cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The 10 Funniest Reactions To Donald Trump's Latest Participation Trophy - BuzzFeed",
    "description": "The 10 Funniest Reactions To Donald Trump's Latest Participation Trophy  BuzzFeedTrump named ‘undisputed champion of beautiful clean coal’ by industry group  The GuardianTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York Times“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)Trump directs Pentagon to boost coal use as Energy Department announces $175M infusion for plants  The Hill",
    "published date": "Thu, 12 Feb 2026 17:30:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1yOTRTcDNuMDZ6SmpfRWQ5SFJ5OFZ1bkVPMi1rOFQ3X1c1RnhrRlpULTc1RVZiZlV1YWJFV3h0cVBhTllTVWhKTE5BVmhZenZHdEQwTGZPSlJ0OEZsNUFBTWZNZWowR2N1aXlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRSix House Republicans defy Trump to block his Canada tariffs  CNNWhite House expects ‘substantial’ GOP defections on Canada tariff vote in House  PoliticoColumn | A little Republican rebellion against Trump only goes so far  The Washington PostHouse votes to slap back Trump's tariffs on Canada in rare bipartisan rebuke of White House agenda  ABC7 Los Angeles",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Federal judges picked a new U.S. attorney in Upstate New York. The White House fired him four hours later - Democracy Docket",
    "description": "Federal judges picked a new U.S. attorney in Upstate New York. The White House fired him four hours later  Democracy DocketU.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House  The New York TimesDOJ fires acting US attorney in NY who was appointed by judges  PoliticoWhite House fires U.S. attorney in N.Y. hours after judges appointed him  The Washington PostNY senators rebuke Trump’s handling of upstate US attorney pick  Gothamist",
    "published date": "Thu, 12 Feb 2026 19:08:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPM1VvaG53ZXVrRVJVN3pCSTFfOHhaT2FCcmMyZkNZdG9UMW9ORWZhVHZtY1ozeTZtcDVtY294Z2N1cEV5ZmkxUDUybXc5YzYtRVd1aFNqV0hqLS1oTVVLX3VUNk9sbXdRcE9hSDhmT2lCMFJnbnZWZUUxWUQwS0IyQkdlWE8wWmRMNHZPanFiQlhFR081WlJnNDlTTlV6dzU0U043Qk1ac3l3c0M2XzZOX1hYeks3TmVEamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNTrump continues to threaten Iran to come to deal after meeting with Netanyahu  PoliticoNetanyahu Seeks to Kill U.S.-Iran Talks to Start Another War: Mouin Rabbani  Democracy Now!Benjamin Netanyahu says Israel skeptical of deal with Iran  The Jerusalem Post",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles - The New York Times",
    "description": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles  The New York TimesNational Guard troops were quietly withdrawn from some U.S. cities  The Washington PostTrump administration withdraws National Guard from Chicago, L.A., Portland  MS NOWBreaking News  The New RepublicTrump makes good on troop pullout promise, vows return if Democrat city crime worsens  Fox News",
    "published date": "Thu, 12 Feb 2026 20:26:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNkd1OV9VUGFlTWZEMzEtTjcwaFh3cG9QYkJuVHZiWGkxM3Z5cXczd2dHMmI5Qy1EWkJLUkxvWVdtRnhCUnRJMjFKVlRKbVBkSzRoVFFSTDdxb0UzTFpKbFhGa0VlVWVjLVFMTW4tN09LOFJ3NlZXZ3ZxT0FlVmV2NHRMbHA2LThvZ3lsd25YQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "About 6 in 10 think Trump has gone too far when it comes to deploying federal immigration agents in major U.S. cities. - AP-NORC",
    "description": "About 6 in 10 think Trump has gone too far when it comes to deploying federal immigration agents in major U.S. cities.  AP-NORCWhat independents think of Trump's recent immigration actions, according to a new AP-NORC poll  AP NewsPoll: Americans support ICE overhaul amid federal funding fight  NBC NewsThe Republican Party’s Advantage on Immigration Shrinks, Poll Finds  The New York TimesMinnesota’s suburbs are an election battleground. Trump’s immigration surge is unpopular there.  Star Tribune",
    "published date": "Thu, 12 Feb 2026 12:02:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNVXowLWIzT2xMbTRWS1RwckRiblVaOGlWOUkyZkpEOTd4bXNvSE1vRjNSelJZcmFrTDVGcFFIcEg3WDY1cUtxXzdCSWNNT3NIZzJjY3RPWk0yZ0xpRllCQllmcm9vY1dIdUp4Smtlc2NQRFFXcTVyZ3A2Tm1FMDc5SUZFNXdXQWgxWXFsc0tua29TbUdHSDVrX0wwZGJTS09GcDRYMjR6SjBfYlZXUlZHM0hqZDBXZ1pNck5uUXVIOTg3ZHh1M2xIXzRjdWZGM1h1cHJfZnRKbVQxdkdDWUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnorc.org",
      "title": "AP-NORC"
    }
  }
]