[
  {
    "title": "How the use of AI and 'deepfakes' play a role in the search for Nancy Guthrie - NPR",
    "description": "How the use of AI and 'deepfakes' play a role in the search for Nancy Guthrie  NPR‘We Believe Our Mom Is Still Out There,’ Savannah Guthrie Says in Video  The New York TimesEX-FBI Assistant Director Questions If Savannah Guthrie's Mom Was 'Really' Kidnapped In Chilling Remarks  Yahoo'Mum is still out there' - Savannah Guthrie issues new plea as ransom deadline passes  BBCFBI ‘not aware’ of Nancy Guthrie family talking with suspected kidnappers  AZ Family",
    "published date": "Tue, 10 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBaVWdvUkFSRWF2V3VKalFvX0x2UDVvT2tVaU5qQ19ZVEFTRV9CQWtNSzdGWV9uZDdZWGhYLXY2NHNYdlJvM0FfN1pXSUNleWdpSE9XVGRSbWx3bDFpc3ZLOF9lUlhHQTJPY2ZtVVFkdEZUc3JSUFB6QW54TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "US lawmakers call on Howard Lutnick to step down over ties to Epstein - Financial Times",
    "description": "US lawmakers call on Howard Lutnick to step down over ties to Epstein  Financial TimesHoward Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties  ABC NewsTrump Commerce Sec. Lutnick admits visiting Epstein island during family vacation  CNBCLutnick and Epstein were in business together, Epstein files show  cbsnews.comMassie, top Oversight Democrat call for Secretary Lutnick to resign for 'lying' about alleged Epstein ties  Fox News",
    "published date": "Mon, 09 Feb 2026 22:00:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9kaVluRmI5YjlDNkxKejZJa19WM2lYN2xmek5jUWFmekZ2VGt2TFdjUGJGallTRUg2UzJHM1lUU0tocE9GdTh5QXNkdWRheWdicmR4dmx0Zl9mYXRjeXZJcHNKWnpZWEhMTGhSQlZqc0I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Watch Live: ICE chief, immigration officials testify at House hearing - cbsnews.com",
    "description": "Watch Live: ICE chief, immigration officials testify at House hearing  cbsnews.comTop federal immigration officials answer lawmaker questions as DHS funding negotiations stall – live  The GuardianTop Immigration Officials Set to Testify Before House Panel  The New York TimesLive updates: Trump’s immigration chiefs testify in Congress following protester deaths  apnews.comModerate Republican willing to break with party is set to lead ICE hearing  The Washington Post",
    "published date": "Tue, 10 Feb 2026 16:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPWW1yd3VMYmxmN0NSUFhkZHF3bHpIaGl2UVN2YXlvaTd3OTlQOHVvX2x3ckE5VlZVZUc0Uk93a080ano1VDBVUFVCUURHUlhiLTBnTkZnLU01bWwzVzZ3MWJIYXB0dGpqOW9HR0FNY2E2UDF4NFdiSWtsWXhIQ3pvOGFsckJUVTTSAYwBQVVfeXFMTk0tMmp4ZUYybV9zclNCRFZNWmdGSVE0YnhVWXduUkdhSWNkQlZWYlUzT29venVZU2FZVGZXdjhPNlplUFBfdldCNTZTNDZlZzJITzFnZVhpZDNaOUFTdkFjQWxmbmhQelFRYUkwcXNEWWhlNGNPQ01ONWRYLWFJM1Jmd3pqcmlQcUlUMGE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "How ICE defies judges’ orders to release detainees, step by step - Politico",
    "description": "How ICE defies judges’ orders to release detainees, step by step  PoliticoJudges are regularly threatening contempt charges against the DOJ in immigration cases  cnn.comMore Immigrants Are Challenging Their ICE Detention Than Ever Before  ProPublicaTrump’s immigration crackdown is straining federal courts. Judges are raising the alarm  apnews.comImmigrants challenging their detention have hit a historic high. Here’s a look at the increase.  KSAT",
    "published date": "Tue, 10 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOY3pxNDk2QjhtTl82NzN4SDN4bTNuYTRjTThSSm1IXzZyMDN2UVd6QzdpQXFLSG0zVFJ2UlUwTXdIR1BVbU9zNlJLTXAxZ0NJNXlTZU51REc3X21aSmRYRDhNSHN4cFFXOUFOb1REOXlCbHZyZDROck42OTFsQjZvckFQVGNMbmZocU9pZENZZWE0QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump threatens to block opening of bridge between U.S. and Canada - The Washington Post",
    "description": "Trump threatens to block opening of bridge between U.S. and Canada  The Washington PostTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressCanada's Carney says issue of bridge that Trump threatened will be settled  The Detroit NewsTrump Threatens to Block Opening of Gordie Howe International Bridge to Canada  The New York TimesFuture of Gordie Howe Bridge questioned after Donald Trump post despite testing phase  ClickOnDetroit | WDIV Local 4",
    "published date": "Tue, 10 Feb 2026 16:10:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZi1wWUkwMHRWa2pWWjl4SDRmcTFQbFF4Q2liT2Npck1BaDJ3ZGtBTnVJSVJSNUxKbjd3NzRPd2RMc3FWbkF4Q2N0QnpRUHkyaWN5T3V4aXd0RU8teEZ3TlhQYTZaQVRRYU5CUzhxNDFfS2NSUUVKanNEdlFKT3JONUh4OEtHV2RDc1I1aGxNNHphQWwzcEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Local police aid ICE by tapping school cameras amid Trump’s immigration crackdown - The Guardian",
    "description": "Local police aid ICE by tapping school cameras amid Trump’s immigration crackdown  The GuardianHave Denver’s Flock cameras been used for immigration enforcement?  The Colorado SunConnecticut lawmakers to propose restricting license plate camera rules after out-of-state searches  CT InsiderHow Police–ICE Data Sharing Turns Public Safety Into Mass Surveillance  knowyourrightscamp.orgICE Taps into School Security Cameras to Aid Trump’s Immigration Crackdown  The 74",
    "published date": "Tue, 10 Feb 2026 15:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNVFVKQTdmWW0xTVNpbDZkdVhkcUFSM0dnV1FRM2pyd212U1lkWEtyWTNQUHlVOFA1ZXJyWHlWOVV1VS1GT0hNdHNwcjhUdVJ5UXJRTE9mZDV3VVMtY2F1dmJNSDV3R1VsR3JvNVZaaEEyWEJmbHcxcmEtM1d2VHlQLTRGel9BMjIyM3ctUkFQRHRGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Democrats demand new restrictions to Trump's immigration crackdown and threaten a DHS shutdown - apnews.com",
    "description": "Democrats demand new restrictions to Trump's immigration crackdown and threaten a DHS shutdown  apnews.comBacklash to Trump emboldens Democrats on DHS and ICE as partial shutdown looms  NBC NewsSchumer, Jeffries trash Trump's DHS proposal as 'incomplete and insufficient'  Fox NewsDemocrats Want to Rein In ICE. Their Ideas Are Facing Blowback.  The New York TimesSenate GOP set to go to battle over Trump’s ICE, CBP policies  The Hill",
    "published date": "Tue, 10 Feb 2026 05:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNZGhUTWV6RUI0bU1pd2loOVI3WHpKRmtDczF2dVBwLVl1aWtCVENyY3pNaEs4ckY4b2VzTTBfMGNKRGlic0k1bjUzMV9VQXhfYkVUTC1LZGJvSkJJcF96U3R4aW1nZk1pN05SV3BJUERFM2gzMEtIZFRHck9VazJwYVV5d3pSVi1XSU91azNzc0FmWFVZZU1XUFgzTkZkTFJKcHhqMEptbG9ibGIxX0Y5ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "apnews.com"
    }
  },
  {
    "title": "Without a Border ‘Invasion,’ Texas G.O.P. Turns to an Old Enemy, Islam - The New York Times",
    "description": "Without a Border ‘Invasion,’ Texas G.O.P. Turns to an Old Enemy, Islam  The New York TimesInside the Texas GOP’s Anti-Muslim Campaigning  Texas MonthlyWhen John Cornyn vilifies any single faith, this Christian is appalled | Opinion  Fort Worth Star-TelegramIncumbents like Cornyn shouldn't get comfortable in races | Opinion  Houston ChronicleTexas Republicans turn to anti-Islam, anti-Muslim rhetoric in pitch to voters ahead of March primary election  KVUE",
    "published date": "Tue, 10 Feb 2026 10:02:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQLU9UVHExQ01iTkk3OGdhbFRnV1kxT3FLV3BKUUd6QkYyVzhFR01LVU1BOWNIMW93Q21rYU16Zy1uZmo5TFBvYmE1UDRwc3ZGbjItZllmTkFIbzI5dHZwQnQzN0hCdm9rcnFFMlVjMlJfandwbjRVT2t2ampCVjg4Z0ltWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Daughter of Minnesota gubernatorial candidate Jeff Johnson \"killed in a violent crime,\" GOP says - cbsnews.com",
    "description": "Daughter of Minnesota gubernatorial candidate Jeff Johnson \"killed in a violent crime,\" GOP says  cbsnews.comDaughter of Minnesota governor candidate fatally stabbed in St. Cloud, leading him to suspend campaign  MPR NewsMinnesota gubernatorial candidate suspends campaign after daughter found fatally stabbed  NBC NewsDaughter of Former St. Cloud Council Member Jeff Johnson Killed in Stabbing  KNSISt. Cloud police investigating stabbing death of 22-year-old woman  Star Tribune",
    "published date": "Mon, 09 Feb 2026 23:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPOEEwQzdMZmptdHlFYTBwNVhMV19VLUJwLWZIMHN3LTBWbEk4SGE2MDVsai0tOFluVHJPUlBOeTFNTmxlUmlzaHc2XzBFWVpKcFRweXRYUFBDTzRBaHZ3NEtnN01uVDJiWjc1bVE4bmdoUzAzSFhVMlVQZC1IOHBxVm1TTnNxcUxUUnBwTmR1VjFCX0F5WDBLbmlnSW1CLVBRVWwyRmZQeXdpZVlaUlVFeDlTZTd0SnBaZnlSdnNnVi1yay1FX0c4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions - NPR",
    "description": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions  NPRFebruary 9, 2026 - Trump administration updates  cnn.comVirginia Giuffre family: Maxwell deserves to be ‘trapped in a cage forever’  The HillMaxwell Refuses to Answer Questions About Epstein Crimes in House Deposition  The New York TimesOpinion | Why Congress deposed Ghislaine Maxwell knowing she wouldn't talk  MS NOW",
    "published date": "Tue, 10 Feb 2026 06:30:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE4xRDVxTFdOOHdSVk9oZTRRMHRQM2NwcnNFZHpaS09DSGlzbGphcWdyYmZsbHZTTjFlSHFOTDAzaGJBRlpQbC1wa2dTRU1YREJ1UnBWY3BhYW9ha1FJRUIxcElNR0JCQmx1Ym5rQklkcXpkZkJvb0N3WnlZOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Susan Collins Runs for Re-election, in One of 2026’s Top Senate Fights - The New York Times",
    "description": "Susan Collins Runs for Re-election, in One of 2026’s Top Senate Fights  The New York TimesRepublican Sen Susan Collins says she's running for re-election  Fox NewsSusan Collins officially announces reelection bid in Maine  PoliticoRepublican US Senator Susan Collins Announces Bid for Re-Election  U.S. News & World ReportSusan Collins makes it official: She’s seeking a sixth term in the Senate  The Hill",
    "published date": "Tue, 10 Feb 2026 14:09:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOYlVwLXJHX3NJeUtLZFdYNW5DckJFWS02NXo4RzF1N2xGQTFmeUw5SDdrTGYyaHc5T2dnQnQ5M0JEMmpWazZ3WUhrY0V4RG02Q2c0TXZPTmFuQ0xWaS1lbXZtR2JmUUMxZU4wbjBHQVR3LU43amx3TEJ3LUFkT0puWklxU2IxUEZKV2dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Updated: Mejia lead grows to 889 votes in NJ-11 special Dem primary - newjerseyglobe.com",
    "description": "Updated: Mejia lead grows to 889 votes in NJ-11 special Dem primary  newjerseyglobe.comOpinion | In the New Jersey Primary, ‘Abolish ICE’ Looks Like a Winning Message  The New York TimesFormer Rep. Tom Malinowski concedes to progressive activist Analilia Mejia in special New Jersey primary  NBC NewsThe left smells blood after shocking Democratic primary result  AxiosMalinowski concedes in primary for Sherrill’s NJ House seat  The Hill",
    "published date": "Tue, 10 Feb 2026 01:29:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQjE4QW1MVk9HNVFXbEhpNHEzYnNURVNZUzZPSUhYdjFyVTl5ZVYtdWlPbG9GdmZlUFhZQ3otcDJzZGVjdHFwNlhGSy1tZFAzWUUwLVl1VkVCTEhBZUhDSnptOGV5TWdsbm52c3NaV3JWUThDOGpsNmJjSktXMzB5eWh4YW9ZQ1JlamxGcXl3cHZJMzFCZkF1SUJRWDE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "newjerseyglobe.com"
    }
  },
  {
    "title": "Court rules government can't deport Rümeysa Öztürk, Tufts student who criticized Israel, her lawyers say in filing - NBC News",
    "description": "Court rules government can't deport Rümeysa Öztürk, Tufts student who criticized Israel, her lawyers say in filing  NBC NewsRümeysa Öztürk’s deportation halted as immigration court ends proceedings  The Boston GlobeImmigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say  cnn.comImmigration Judge Says Trump Administration Cannot Deport Tufts Student  The New York TimesImmigration Court Drops Case Against Tufts Student Rumeysa Ozturk  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 02:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOempfcy1zZUR0LVVvTmVuMDZVYjhXOVNzZUoweFpfUF9GTjU4R1l0VXJpYW01ZXBJYkZ6Z2VmMFJmRXlyc21sUl9xWENMNzdaQnJuX1BqMjJwOVJNbkhOXzhfeTFod2dzQk1ZTllzMjkyT2lWd2Nxb0NjbDhad1RBb2xxUXItZ1d0NFBYVHFrUTYxUVVZYUtNbXV1UFdMa0R2bC1hSEpNeVlWNXFoSENwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Buddhist monks head to D.C. to finish a 'Walk for Peace' that captivated millions - NPR",
    "description": "Buddhist monks head to D.C. to finish a 'Walk for Peace' that captivated millions  NPRMonks Finish ‘Walk for Peace’ Across a Weary America  The New York TimesA Sacred Stop on the Walk for Peace  cathedral.orgTRAFFIC ALERT: Walk for Peace  Arlington CountyI drove hours to see the monks walking for peace. Five minutes with them was the gift of a lifetime  The Guardian",
    "published date": "Tue, 10 Feb 2026 06:56:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNWFVRFRXTVI5c2hlVnF1cnZJM240M3N2YXJkMGNYSjF5azZTQ2ZJQUFlQVVBV3RjYklKMW5pNGlaTW9NOVRNcm1MSGRreWNzWGxFeXJCOW9CN192THhKMl9VWTZIcTkwbFpycjFISDg2dndXMkJpLVRYTmNjRkZKVXRGZ3Brdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Ohio GOP leader says no to Trump election plan - Ohio Capital Journal",
    "description": "Ohio GOP leader says no to Trump election plan  Ohio Capital JournalWhy Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears  The New York TimesDemocrats will stop Trump from trying to nationalize midterms, Jeffries says  The GuardianJeffries accuses Republicans of ‘voter suppression’ over bill requiring voter ID, proof of citizenship  Fox NewsMarkey to introduce resolution denouncing Trump’s call to ‘nationalize’ elections  The Hill",
    "published date": "Tue, 10 Feb 2026 10:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdkdob2VRTzFIU3V1U3pFUHl1V0JQRTF2ck44ZW5qRHpZRDNsU3hLNGV5RlRvZm41SklTTTVoaWZoQk8zQTdNclZmZm9VMlNPalBxZXRXbjFnYnVVQTd1OUw2ME4tcmc1V3BqcHA2NTB2Z05rWVljOWZNLXRTc1FycDlPaEZqWU1IM2ZsSFp0Vkk5MFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ohiocapitaljournal.com",
      "title": "Ohio Capital Journal"
    }
  },
  {
    "title": "Trump set to gut U.S. climate change policy and environmental regulations: White House official - apnews.com",
    "description": "Trump set to gut U.S. climate change policy and environmental regulations: White House official  apnews.comTrump Allies Near ‘Total Victory’ in Wiping Out U.S. Climate Regulation  The New York TimesTrump admin to repeal Obama-era greenhouse gas finding in large-scale deregulation  Fox NewsTrump set to repeal landmark climate finding in huge regulatory rollback this week  ReutersEPA set to repeal landmark finding that climate change endangers the public  The Hill",
    "published date": "Tue, 10 Feb 2026 13:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNNnpBUk90WWwyN3hUWHN6bWNiWWxiZFRGeC1vSVBjQUx0NW5rdzgzRENxTHpmRW05UHRkRTBscEZzdUVkN1FPaWlFZVNpSV83OUhWNFZxM2FjMVRZQ2szS0R5bEYwT0h1SlROZXVHLWYxdUhaT1lWdGMyWXpESERTbzFDOTJSUU8zdk1uQW5sS3N4TmhsSDc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "apnews.com"
    }
  },
  {
    "title": "Federal judge strikes down California mask ban on immigration agents, but it may be revived - latimes.com",
    "description": "Federal judge strikes down California mask ban on immigration agents, but it may be revived  latimes.comJudge blocks enforcement of California’s law banning masks for ICE agents  PoliticoFederal judge blocks California from enforcing ICE mask ban  The GuardianFederal judge blocks California’s law enforcement mask ban  cnn.comJudge blocks California law banning federal law enforcement agents from wearing masks  cbsnews.com",
    "published date": "Tue, 10 Feb 2026 01:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQRzFVaUgwdDZrVFhNbHhSRndDb0ZaeDF6TTZKbmoyS3RmbEdEaFRQTzVCMU45RmJzSkl5RW5rOHVDTzVOdTJ0bGdfRTEwQWpHazJjemYyal82QTVGMFhKU0xTUzJvQTU5MTA2ZWxrTlpidjJwQVdfSHFraU9mVkVJX1paRlhBS0gzSmpyNTgwbkE2Z0M2WVNHeEF0NEtQOGlMbnVfNmt0V1p2TzlmZmhvQXlLTHVlM1NBanBBaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "‘Now we’re in a power struggle’: Europe’s resentment grows over Trump’s newest provocations - Politico",
    "description": "‘Now we’re in a power struggle’: Europe’s resentment grows over Trump’s newest provocations  PoliticoTrump’s Greenland Threats Spill Into Another Danish Territory  The New York TimesThe changing physics of the Arctic are the real defence threat  Financial TimesHow a Sacramento woman’s grandad made it possible for Trump to threaten Greenland  Sacramento BeeAfter Greenland  RealClearDefense",
    "published date": "Tue, 10 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPMTFSTnBTZGloN3Nyd0JoVGE4a05Md3BkT1NXNTJpLWJRWkxNUkxUNHJzVHdhRDZsQ1Y3QWNreVk0VUNhazJzMzl4U2kwRkloSTloeDljcGxMZGFObmhIeWVrTHVhVXE0Z2RBMmlINFpDamNDZlotZmw4UTNGbXNhMThsMmE3bUtPVWwwUVk3bzc0d241?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Donald Trump Faces Humiliating Defeat as Republicans Break With Him in Key Vote - The Daily Beast",
    "description": "Donald Trump Faces Humiliating Defeat as Republicans Break With Him in Key Vote  The Daily BeastJohnson moves to again block House from voting on Trump tariffs  PoliticoGOP lawmakers threaten to rebel on Trump tariff vote  The HillHouse Republicans Move to Keep Putting Off Vote on Trump Tariffs  Bloomberg.comJohnson says it’s full steam ahead on tariff vote ban  Politico",
    "published date": "Tue, 10 Feb 2026 13:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPa0JJMTJPOW1SVHdwbXVSMWdzdTdDWVZBT0xqblhWemlxbkRMQm9UcHFvbXlHMDk2eDUwbGxsTXVkV1Y4OG1fQ00ybEtRZlhyMFdQdGNUT3dqVThoTzBzZmdUT3BzMGZYYmhyamdmVnF0bXUydmpzNjJ5QkQ1T2Zycl9KUFRUWm1WdEZCS3V5NDBpTHA3cWxubDZGeHhOSGtNR1pSMWZxUGFnZk1LdEw0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "House approves housing bill, setting stage for tough Senate negotiations - Politico",
    "description": "House approves housing bill, setting stage for tough Senate negotiations  PoliticoHouse overwhelmingly passes sweeping bipartisan housing package  The HillHousing affordability package set to advance in Congress amid home-cost concerns  CNBCHouse passes bipartisan housing bill as Trump zeroes in on affordability crisis  Fox NewsCongress isn’t waiting on Trump to tackle high housing costs  cnn.com",
    "published date": "Tue, 10 Feb 2026 00:20:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOam81Q1UyMmQ4akVSSEllWDJKSVFNcTBBSmlkRlVxdzhJUVpzZTVGVnVRTzVJdHdyMFd5MkNpRnh5bV9DR0tiVDV2NVN2Zi10aUhOUU03LTRJalRCQ3lIaW9JUElNVUpWajRocWg5bTl3VW5ORVdLSF9UOFlDVVVudjY4TzRfYzREWlU3RFR1MWZST29TMEJRZlVSNzVyOWYtVTVLWVRFNVRwWVBTQTAtaTZWNXdnWVF2VGM4aWhrWGRGcV93X0NaenBwalFFaFczOUZPNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Student injured, another arrested in shooting at Wootton High in Maryland - The Washington Post",
    "description": "Student injured, another arrested in shooting at Wootton High in Maryland  The Washington Post16-year-old boy shot inside Wootton High School in Rockville, another student in custody  WTOP16-year-old charged after shooting classmate at Wootton High School: police  FOX 5 DCStudent facing attempted murder charge in connection with Wootton High shooting  Bethesda MagazineOne Person Shot At Montgomery County High School; Suspect In Custody  The BayNet",
    "published date": "Tue, 10 Feb 2026 16:45:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOeEx3Q1JjSFZ5ZGVYUGZYMklLZ2xFTkUzbHZNUnJrUEJGSnMyMGxIdHFfbUtuLVRidUl2c2JlbE10N0tiQkU1bDRTT3JtZ09BZTVtVmotWmt5TmplVHFWTHhWaC1fUHJuZEpRMVkwMndfYjl3UVRycmQybWZ3dFVxZm56VnJvU29pRDNXbHA0bGstTE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "New Epstein Details Rattle Washington, Hollywood and Beyond - The New York Times",
    "description": "New Epstein Details Rattle Washington, Hollywood and Beyond  The New York TimesUS lawmakers accuse justice department of 'inappropriately' redacting Epstein files  BBCEpstein Cover Up? - CNN This Morning with Audie Cornish - Podcast on CNN Podcasts  cnn.comJamie Raskin accuses DoJ of cover-up after viewing unredacted Epstein files  The GuardianLawmakers don’t rule out exposing redacted names of powerful men in Epstein files  Politico",
    "published date": "Tue, 10 Feb 2026 13:11:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQZi1YTTBsQVhGeGFKc2Vob1VhLXZjaEJiQW84dFA4eWN2WksyT1NnbG5WVFNRRXhPTXl0a0xrNXdPYnlVcVBqUGtXYkw5T2VSQWQ4YzZxekFDbnBHN0IzSjV2aXBfQVJudDgwb0FjTzR2UlFrRDdZaGt0Wi1jdkVNT2djRHVsa0o3UWJHclRVVWdmaVZWRGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Canadian airlines suspend Cuba flights as island set to run out of jet fuel - Yahoo Finance UK",
    "description": "Canadian airlines suspend Cuba flights as island set to run out of jet fuel  Yahoo Finance UKAir Canada Cancels Flights to Cuba as Cuba Runs Out of Jet Fuel  The New York TimesTrump's isolation of Cuba dries up nation's jet fuel supplies, forcing airlines to adjust  cbsnews.comAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  cnn.comCuba says international airlines can no longer refuel there as Trump turns up the pressure  CNBC",
    "published date": "Tue, 10 Feb 2026 03:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWWpUbFN4eTZhaUNyQUxDemh1QmtlQ2F2eXB0OGp5UFczTVpDVlVkVjBmaW1OWVFQNWx2WHE1ajN1REU4VlhhSTBHZmZGdTJFYmMtS0hLQ1pXQ0NtRE5qR0doSjlPbWpMYlJhMWRGUFg1S1lxMVpKNU4wQ3FjbXc0NE53?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://uk.finance.yahoo.com",
      "title": "Yahoo Finance UK"
    }
  },
  {
    "title": "Ex-police chief says Trump told him 'thank goodness you're stopping' Epstein in 2000s - ABC News",
    "description": "Ex-police chief says Trump told him 'thank goodness you're stopping' Epstein in 2000s  ABC NewsTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldTrump told police in mid 2000s ‘everyone has known’ about Epstein’s misconduct  cnn.comTrump thanked Florida police for Epstein probe in 2000s, flagged ‘evil’ Ghislaine Maxwell: FBI doc  Fox NewsEx-Florida police chief claims Trump told him ‘everyone’ knew what Epstein was doing in 2006  The Guardian",
    "published date": "Tue, 10 Feb 2026 03:44:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxON1NuRjZENVFWalR1bHk3XzlJQ1hyQmh6dFMtZ2xid25IT3FKVVhxa3pCNERnSTJERm95RzFQYTkzQjVaY0lhbWZOd2U4WU1wMXhHcEt5OHNFSWstOU1vRnVoT2JXdDQ2ekNJMVVpSjF3SGFKWFVrYVNERmlHenNaTkVNWm9yN3JhX3NRVXhZWExhNWxTOWpqMnM3dXh0ZFZC0gGmAUFVX3lxTFBSSERZMXp0VTNBR25zNzVEYlJaa0lfNWJrRFl4QkZoSllWSXNsVVRhbEdDbkV1c0NPLVBIbkVYYzNqVG9yUkdwSE95MmdHbXZsRXNJM05wLTVnQTRGTloyNnFXbC1KOXpyUnpYLUk1UHdIVk1DVDc2UGxkRTlXcjZrQlFZamVHbTVHeW9PVUtzVnMzNWIyNDRURXU1eExCVWE3TjBQZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "SFUSD teachers strike, Day One: Where have all the children gone? - The San Francisco Standard",
    "description": "SFUSD teachers strike, Day One: Where have all the children gone?  The San Francisco StandardSan Francisco Unified schools closed as teachers begin 1st strike in 47 years over pay and health care  ABC7 San FranciscoThese are the ugly facts and truths that are being ignored in the battle over SFUSD  San Francisco ChronicleSan Francisco Teachers Begin Strike, Closing School for 50,000 Students  The New York TimesLive updates: S.F. schools will stay closed Tuesday for teachers strike  Mission Local",
    "published date": "Mon, 09 Feb 2026 21:37:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNclZHS1BlMTVRaXU4Qm1vVnRQcFJtYWM3aThWNkIwZGdMUTN2ZnVEdWxCdlotNEFvRnlJOFNWdHZFOFRPNnNmN095UVJEMU9mT2lwbjMxcG1BcFlDWjNZeG1DUzhBc2FTQ1VuZkZwaXNQbDBSellxbHlhbHZuUDlyWldvSlF1ZWlLblNobHp0ZG9mQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Here’s What a Warm Night Looks Like for Homeless New Yorkers - The New York Times",
    "description": "Here’s What a Warm Night Looks Like for Homeless New Yorkers  The New York TimesExtreme cold in New York City leaves 18 dead  BBCExtreme cold: Sanitation Dept. works to clear snow; Citi Bike stations blocked by ice; School delays due to subzero weather  ABC7 New YorkNYC cold deaths climb to 18 amid frigid temps as tri-state eyes warmer week  NBC New YorkOutdoor death toll in New York City rises to 18 amid extreme cold  ny1.com",
    "published date": "Tue, 10 Feb 2026 01:36:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNRXpIMlpxZ3JZOFlPUDNCcE1zZUhFa2RiaUh0aWZ0UWlkczZYam1jaGNSakhfVVJxLUlqdFhiZkxJN1d5TnNZeUlldDc0UzNseGxEenNPZjZsTnJfeld2QVU5enJXYTlqR2h1QnNqRDcxVnkwUUtzNkRQNmlPdUJJVjIzajM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Striking NYC nurses reach tentative contract agreements at Mt. Sinai and Montefiore - Gothamist",
    "description": "Striking NYC nurses reach tentative contract agreements at Mt. Sinai and Montefiore  GothamistN.Y.C. Nurses Reach Deal to End Strike at Two Hospital Systems  The New York TimesNYC nurses' strike: Montefiore, Mount Sinai hospitals systems reach tentative agreement to end strike  ABC7 New YorkOver 10,000 NYC nurses reach a deal to end strike  PIX11Majority of striking New York nurses announce tentative deal with hospitals  Reuters",
    "published date": "Mon, 09 Feb 2026 21:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQNXBJRWtfanR6b1NKanJHWXVsU1VsemhOVVo1LW5iekZfTnp5dngxYld0RjZzYnFoRXJwdDhXWHc4VEFvWE5TYmotVlNMdjNQVm5UaExsWjNOSTNObThET0FBeS05R3dyM3BKVXBLeW9jQVJSalVjU1FtaHItTXhuUHhNVGQxQmpXZ2g3cFFOSnNRd1Nacy1UNzBDMGp1dlczZm5FR01aQXhaSHdDNHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "“A new low:” Trump’s racist Obama video finally compels some Ohio Republicans to draw a line - Cleveland.com",
    "description": "“A new low:” Trump’s racist Obama video finally compels some Ohio Republicans to draw a line  Cleveland.comReaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics  The New York TimesAnalysis | Republicans can’t afford more presidential distractions right now  The Washington Post'Indefensible': Black Trump allies grapple with fallout from racist video of Obamas  ABC NewsCatholic bishops call on Trump to apologize for racist meme  National Catholic Reporter",
    "published date": "Mon, 09 Feb 2026 19:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPLUYtM2M5ZHA0eThzQ2hWQnNvc2xnZGFvT0ZybEM5UFRuZWU0WU5PYnpUYzdrV2VET0xKU3RDRGxtRkdFcnM1Q2dybFBydTdyUjgxU210ZUd1ZWI0SWJYcDQwTE11MFJaRUhyTGRWRjM5Zy1GcG5zd0tHY1M2MFNjR1c4TFJBdldaTEpHbUkyRTRMYVNkWDBwTG5lWHZwN3I3cFd4akFnV2tVNWluZ2YyeTRmOXZTOHNLSERPU1N3NEVWM2ZaY3ZlWnFCaEXSAeABQVVfeXFMTlJwOWkwTE96QkxjQXdJNXhhelpYaEtUT2FGaTZOTjM0Szc1YkR0Y2x3b0pBREpOX19Cbmd2UmVQdUZ1ZFNZS19TM1E2VEROQkx3RG91elVvczNhUmFBWUtfNEdqeVdiekItSHhoWUF2bUZoVTNyTlZBR0VLR3pLUTczajYySXhBYzY1YnN5V29SWWx3TTBNeEN4cy1yb2ZEVXpzYXR3Skw1QVJRRGRjb3RJMERSZDZobzI4ZFJBcmZIaUxMcmhPWllmUEEzV3ViUklQNGRpQmg5X0pKd0FEQi0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Georgia judge deals fatal blow to MAGA election lawsuit - Alternet",
    "description": "Georgia judge deals fatal blow to MAGA election lawsuit  AlternetBody camera footage shows confusion inside Fulton County elections hub  USA TodayThe Conservative Researcher Being Linked to the FBI’s Seizure of Election Records in Georgia  ProPublicaIn Terse Ruling, Judge Shows Frustration Over Federal Seizure of Georgia Ballots  The New York TimesWhy the FBI search warrant affidavit for Fulton’s 2020 ballots matters  AJC.com",
    "published date": "Tue, 10 Feb 2026 03:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1RdFRhd0NQR1ZTd3JYVWlDaHdlcnpESnhhUHdmaWJmanhldWZyYy1BVkdyRi1lZXhKREd3VXJxYlQwZVYybkk1dzluc3J3QmlDaGhEYkJRZHAyajBFRTVoWG93?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.alternet.org",
      "title": "Alternet"
    }
  },
  {
    "title": "New poll finds Jasmine Crockett, Ken Paxton leading in their primary bids for U.S. Senate - The Texas Tribune",
    "description": "New poll finds Jasmine Crockett, Ken Paxton leading in their primary bids for U.S. Senate  The Texas TribuneTurning Point Action endorses Ken Paxton in heated GOP Senate primary in Texas  cnn.comTurning Point issues major endorsement in critical Senate race as Trump hints at weighing in  Fox NewsHere's who is leading the U.S. Senate race in Texas, according to a new poll  Austin American-StatesmanFor Senate GOP, It’s Texas: Hold It | WSJ Politics Newsletter for Feb. 10 - WSJ  The Wall Street Journal",
    "published date": "Mon, 09 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQYU9DS0FCTzR0RFRIVkxFMDJ0WVg3S0tqMmFJWjc4ZGdPYUIyQkxwZHZ1MGdNN1VHYjlkN1I3SFBRbk1oWVlTMHRSUDlwTW1QNnotS0xRTGlyZ19ZVHFXR0FqZUplaTgwZ2pNd0tnSjdvTlJfc1FiR3h3SjdDVkRTZzJPaEZZQ3VoX0hZdzNLZHVhc1NlcWxmTWIxTW1zcEdNSUt2YVhUQkVoV183?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "How Laura Loomer and a Sheriff Upended G.O.P. Plans for the N.Y. Ticket - The New York Times",
    "description": "How Laura Loomer and a Sheriff Upended G.O.P. Plans for the N.Y. Ticket  The New York TimesMadison County Sheriff Todd Hood selected to run for lieutenant governor on Republican ticket  WSYRBlakeman turns to Madison County Sheriff Todd Hood as running mate  NewsdayWell… this is embarassing  PoliticoChurchill: Bruce Blakeman didn't believe in Steve  Times Union",
    "published date": "Mon, 09 Feb 2026 23:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbnFvZ2M3WjNWSnpRNWx2ZGNyMEx4Nkl5NjM5Sk82QWpfZzhWdnAxVVVYMUZNa25lWGtsSzhyckp0MWlaa2llUzNnZ05OLXFrdWkzMVVPLU5hRHgweUFOc09IbXBXS3hHOXNiWW50WlB1NVFIT3BPYWg0cFItU1l2WG1kUnBFb29B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US Military Boards Oil Tanker in Indian Ocean - Newser",
    "description": "US Military Boards Oil Tanker in Indian Ocean  NewserView Full Coverage on Google News",
    "published date": "Mon, 09 Feb 2026 20:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNcGkyOGk4WnM1YXNITFBqUlBoVXpsUlFNTFptcm5uMXhMWlo3bm5kQ1p2UnVMeGJVRDRzQTVvR1FNNWFka2Q5a21wY1ZlNXNFTFJyc2hSa3hpdXRXRTdMd2l1c1R5WjVrMVl3ZEVRVlZYNzVpUEtMejFtNmxQcUFNZHRfSEhsVkhZbFBGNU1uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests - The New York Times",
    "description": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests  The New York TimesUS-Russia nuclear treaty called START expired. Should we be worried? | The Excerpt  USA TodayNukes Without Limits? A New Era After the End of New START  cfr.orgThe Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die  SlateThe Real Risk After New START Isn’t Arms Racing  foreignpolicy.com",
    "published date": "Mon, 09 Feb 2026 23:46:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdkR5U1RKaERQUzc2bkFoRjZuY1NSS0xKVU1YblZjQ0dGcEFKY3lTeFVCV2tKeUhnemI0UmpIU2xYZFBxanZsNTcySzR3eVA3c0xjV05RdWVrb05jUVNRRlFFaHJEWnNONmttVWhoX2xOSGdjTFdOX3VKOFF6X0dzUmNWZGViX1prcGlFLUVVbGJBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Immigration courts fast-track hearings for Somali asylum claims - NPR",
    "description": "Immigration courts fast-track hearings for Somali asylum claims  NPRView Full Coverage on Google News",
    "published date": "Mon, 09 Feb 2026 17:41:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNaDF4b3ZkRDdwR2hQSjluRVpCZkROU21HbXU4SHh0WGNQNW0tczNNbU1VZ2hHV1F1b3dMcGVyVW43Zm8yd2xhRVpJa1UwNU1IVGpSZ1hfR1RobHlPZHN3bVkxZFhmWHZfTHB2YzRfRlhueVJ0VFctd0FJWmsyQ2pTZ0l3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Small plane crashes into vehicles during emergency landing in Gainesville, just north of Atlanta - cbsnews.com",
    "description": "Small plane crashes into vehicles during emergency landing in Gainesville, just north of Atlanta  cbsnews.comSmall plane crashes into several cars during emergency landing, multiple injured  Fox BusinessPilot Sends Heartbreaking Message to Wife Before Making an Emergency Landing on a Busy Road: 'We're Not Going to Make It'  People.comGainesville plane crash today: Video shows emergency landing crash onto Georgia street; plane hits multiple vehicles  ABC7 New YorkGainesville emergency plane landing: Pilot describes 'remarkable' incident  FOX 5 Atlanta",
    "published date": "Mon, 09 Feb 2026 18:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQclZ4MU9FdFg2ekZ6bWQ5UXlZeWFhQW1mSXRHRzRnSDFVTmExTW1uRlVoNEVfdEFvMWJVMWgzLUdzQnVmQlF3YzRnRnZSZEROQzVNeUVqRHhpQno2NmxtbkV4a1BZdy0xZ01ONUNJOXRfR1NtWDhJN3QxbHpTdmxSUF9OX3puMnR0V3VpV1Ezd285WWJXUHhwVTlETmxMMmJ5UkQxTDk5ZGlma0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  }
]