[
  {
    "title": "Scoop: FBI chief ready to head to Tucson as Trump pledges help to find Guthrie's mom - Axios",
    "description": "Scoop: FBI chief ready to head to Tucson as Trump pledges help to find Guthrie's mom  Axios'We are ready to talk': US news anchor Savannah Guthrie pleads for return of her abducted mother  BBCSavannah Guthrie speaks out on alleged ransom note for missing mother  YahooSavannah Guthrie’s Missing Mother Has Nation Fixated on an Arizona Subdivision  The New York TimesCraig Melvin Is No Longer Going to the Olympics amid Ongoing Search for Savannah Guthrie's Mom  People.com",
    "published date": "Thu, 05 Feb 2026 02:37:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9VZk5iTHJEQUxOejdjVEpZUnlNV3huOTlNUWdqZWlMRkJLMHF2OFhNX295UV9qb3ZZVUR1ek8xczhzM1lzak5OMDlmR1J3U2dTeDhDZHp1UmYwZzVHTG5HdU1OXzdhOFVYMmdkYTczOE5XNnhsZGxuYjRPSWJaUDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Would-be Trump assassin sentenced to life in prison in Florida - Politico",
    "description": "Would-be Trump assassin sentenced to life in prison in Florida  PoliticoRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  cnn.comTrump shooter faces sentencing today. Here's his request to the judge  The Palm Beach PostCongress faces tight deadline to fund DHS. And, Ryan Routh faces sentencing  NPR",
    "published date": "Wed, 04 Feb 2026 20:50:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOMk5paHNPeEcwbGxiRXc5alNLMnkwbXBoNkN3U09IcFhxOXdBUWs1UENVWDFSMEQ3QjlSSHd2aUFZUmgtd2hzcE5zSnJhYVprUFZFWk5yY2FHV19fUURLQzZXZGw4VXpGU20ybmhKRlVENUZkNkdNQU9vRTc2Rk5jUktxejZxYVNabVh5VUQycml1ZzhnU1JhTGRNZjBsQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Fired after gender identity lesson, professor sues Texas A&M, arguing her free speech rights were violated - The Texas Tribune",
    "description": "Fired after gender identity lesson, professor sues Texas A&M, arguing her free speech rights were violated  The Texas TribuneView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 18:42:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPanB5bTdXejFIUXp4U1EyNC1RVWNvUms2Z19ZTWpWWEw2dHBPcm9QZ3hzWGZ3c194TlczZVI2RXJmYndEaFJSZkJIbHJ1QlRSdTYwbnZCcC1LMGFMc2VfcVlkdkdjRWZuU2cyS01jSzhGSkNuZmttcG9heThvUDFPcmxXQ3ZlUWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders - ABC News",
    "description": "'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC NewsTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  cnn.comSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York TimesICE attorney to judge: ‘This job sucks’  MPR News‘This job sucks’: Government lawyers, drowning in immigration cases, have had it  Politico",
    "published date": "Thu, 05 Feb 2026 00:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPOFh4Y1ZDMWZ5elpEWC1Jc2RINlJRZ0pJR3NlU185azJVYk5tQUluSUVhWm1yUTgzWGF1LTdaNGlEYlNRNXlXbWw5WVk5eVVNWDU2eEZfZndmbWYtWTN3Y25IbGU3Ul8xOGhVb21HR2daSXc5bEJfaXBlVUFzX2tYekhPRjVPUWV6UzlhQzl5U1FLeS00YjhfWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Border czar says 700 federal agents to leave Minnesota, around 2,000 remain - kare11.com",
    "description": "Border czar says 700 federal agents to leave Minnesota, around 2,000 remain  kare11.comTrump touts 'softer touch' on immigration as federal force is reduced in Minnesota  BBCMinnesota sheriffs group, border czar Tom Homan negotiating blueprint for federal drawdown  Star TribuneTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC News‘Nothing has really substantially changed’: Homan’s efforts leave Democrats unimpressed  Politico",
    "published date": "Wed, 04 Feb 2026 21:56:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNMDBxeHhMRDRUMHRZRi1aVmFxeFhNLWV0N0xRTGFQT0l5VUozZVdTOHVFX0pCSEJjSXBtcmQxdFRPRXdGZWE1VmsxV0FnbTBzMzIwMVAyWkhtZFRmN3N6NFpReXlYeGVLNTZ3aHVLblpNTkoyUUNPaWZyUFZaMUViU2R3LThjRXJIcVNXbVVjdXdZVzVKVldWUWhGWUxnQmlHRE1acmF6eVZLQTVJYVZZZWZsUi1sWFQ3MVpBWlJYdlRzSHUtcjZNVWJIZmRIVzJjM2Ffam9UQkVob2JEd0U2ZWpQZGh5Smxwa1daN0JBcXIxMXVaTjNBaA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Dems embrace \"law and order\" in ICE shutdown fight - Axios",
    "description": "Dems embrace \"law and order\" in ICE shutdown fight  AxiosHouse Democrats help Mike Johnson end government shutdown, fund DHS and ICE  AxiosCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  PoliticoPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News NetworkTrump Signs Bill to Reopen Government  The New York Times",
    "published date": "Thu, 05 Feb 2026 01:25:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQeUFzSGd1bjNGa2d5eUFMZWtOMG5TZlQwS0tMUVNLOVpOUFdVMFk4THRJLVBia3pOaTdfMmVRSldncERzMHBzQXpVOWNfRHZ6TnpUM0pNNjNnRlN3N3cwek56eDFkWUdiRmRwOVpFcThDQTFSdUM0RDNDZ3FobTdfNUthdEFDN2ZQaFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court lets California use new Democrat-friendly congressional map  cnn.comSupreme Court shuts down California GOP bid to block Newsom's new map  Fox NewsGovernor Newsom on Republicans losing challenge to new Congressional maps at U.S. Supreme Court  California State Portal | CA.gov",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches - AP News",
    "description": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches  AP News'Can you shut him up?\" - Democrat and treasury secretary clash over Trump's agenda  BBC'Can you shut him up?' House Democrats clash with Bessent in fiery hearing  ABC NewsMaxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  cnn.comTreasury Secy. Bessent Testifies on U.S. Economy  C-SPAN",
    "published date": "Thu, 05 Feb 2026 01:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQX25WazBtYTNNSFFadkNYNXVmU1g1OVo2ZTVpMnJsZm92dmhQblN3YXdRaHVadzhCTjJjNTVRczY4OU9MdzVvbFpCbkt3UUs3MHM1WHFUNTF1RVJ5NjRTUHNkWlRZUGVjNWQ3Z0V6dnlYckpKU2Iwa2hLRzYtOEgwekI2Q290bG9Kdnhud0lON0NQc2lUQVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasLas Vegas biolab: Answering some of the biggest questions still looming  KSNVSuspected biolab discovered in Las Vegas home sparks federal investigation  cnn.comPotential Biological Lab Found In Las Vegas Garage, More than 1000 Samples Sent for Testing  People.com",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPRJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comTrump says America should move on from Epstein - it may not be that easy  BBCThe Government Published Dozens of Nude Photos in the Epstein Files  The New York TimesLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Fulton County asks court to return 2020 election documents seized by the FBI - PBS",
    "description": "Fulton County asks court to return 2020 election documents seized by the FBI  PBSWhat does Tulsi Gabbard’s job as director of national intelligence have to do with elections?  cnn.comWhat is happening in Fulton county is a warning to America | Jamil Smith  The GuardianFulton County in Georgia Challenges the F.B.I.’s Seizure of 2020 Ballots  The New York TimesLegal fight escalates over Georgia voting records as Trump says he wants to ‘take over’ elections  AP News",
    "published date": "Wed, 04 Feb 2026 19:57:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQOXhhd3pzNnNoVnJLOC1HcERrbThYX0Npc1pCM252dUd3ZmNoVzRqdnhoT1Vfc0ZjdS13d0lYSWRpRjZHWE04VHh0VnZzWXVwemJ6MjBjeGFNcms1N1pJOEsyR0xEZmxDQVFkbUhHOElQTU5RTW0xNU0zY29wYmh6NEdUQ1JKeWF1TkdNOVFHQWhyRVVXNUFUUnd0SXdhYTF0VjA2YUhQSFY4Qlg4WDAyVzhQQU3SAboBQVVfeXFMTm5MMWFmODJjMUx0aW1YNmtIRlJRUW9nTkVjTW13WW5tV09Wck9kREdVQk1Ob2d5bnVWVWJ5ckVHdmNEQ1RSNjJicFlYeUl6RW9SazhGTWQyXzNNY2NWY3ZFUnlfWE9IRXdEM2VDQnQ4aHpYY3JEeDI0dWVIT3otdUpuZFpLMk5FdkNWaC1RRHNsUnRFdnRWSVhrc0syMVcyRXNQbDFGczdOTkJGaGtpaDJDNC1IOUNaSnFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "S.F. teachers on brink of a strike even as fact-finding report favors district - San Francisco Chronicle",
    "description": "S.F. teachers on brink of a strike even as fact-finding report favors district  San Francisco ChronicleState report moves S.F. teachers’ strike closer. Walkout could come in days.  Mission LocalSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoCalifornia faces teacher strikes across state for better pay and work conditions  The GuardianWhere will 50,000 kids go during teachers strike? SFUSD and union offer half-baked plans  The San Francisco Standard",
    "published date": "Thu, 05 Feb 2026 01:51:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTnRqVWctVGx4dkhuNUdjOG01U1lRRHdZU0dELWE5YktudTZqYlN0aVZ6ZWl6QUhSTG1temlhN0RBWVp0RmEwWUdsb3BqUEsydjJ0c2s4ZUVGNUtUUU1ITElpTk03WWRUVVdoRnNMcFpSQXhiWXhEQXlpWDdnSTROYS1JV05fbjA0dEozSWViQXRRX2tVT242UFpPUTN3U0hYLXpvRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Sherrill spoke with Trump before joining N.Y. in a lawsuit over the freezing of funds for critical tunnel pro - NJ.com",
    "description": "Sherrill spoke with Trump before joining N.Y. in a lawsuit over the freezing of funds for critical tunnel pro  NJ.comTrump Administration Sued Over Cutting Off Funds for $16 Billion Tunnel  The New York TimesGateway Megaproject Sues Feds for Withheld Funds Ahead of Looming Work Shutdown  THE CITY - NYC NewsNY and NJ pick fight with Trump on Gateway. We need to win | Opinion  Bergen RecordThe US Economy Needs the Hudson River Tunnel Project  Bloomberg",
    "published date": "Wed, 04 Feb 2026 22:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOSEtUYmtHZ2hTZ2xFSUg3dGFSUDBxZXV0S1pOY1R1WWFybkVIdFFJMjI3bF90TGlTTG5xMnpaQ28wbWFPMXhyRUxiNmVEZ0VxbFFQams4ZWFhWTFjNEwxMmUzdThtYTFRNXFQWVdPazJCeV9ZTlRFME5tMmpaQTRVWjRmSkw4Z181Mm1lQmNMdWdXT2VDYzN5WDU1MHRlOEN6NmthUkRZRU1qYy0ydS0yVmhGWW0xVXpfeUJFY1M1Slh0Y3N0VVVab0tFR0xjbXlGa2xxczAtS1VnM0NsTG5SRjZB0gH2AUFVX3lxTFBEX2xKamx2T1ZzLW0yRmhOVWJLTWhtZGJ3XzVRcWx0SWxLX3pEanJXUDlqZklxNWhHQUtEMzVQUnJIUS1RT0FTZk1JTXV6RmxvOGpPQ0lYRmcyaVJYWnVGN1VMT2UwY19vc0Jta2JHSWh5cWxaWGF3LTlaMFluWHlkU1lCT0paa1U4RzRxb3otemhHTnZIYXFvMDFlU3hPMl9jR3pEeFVJNFBFZ0FMTzdCVkVuVEdaNm9KUXV5QW90c2FCTTlaSHBHOEVSYlJRa08za3RtSVlYQkNXOGgyUmJxRGZobTF3cml5Snh3dHFSalRUb1c1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "US and Iran talks brought back from the brink after White House relents on move to Oman - The Guardian",
    "description": "US and Iran talks brought back from the brink after White House relents on move to Oman  The GuardianU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosIran-US talks will go ahead in Oman  France 24LIVE: US, Iran struggle to find common ground ahead of talks  Al JazeeraU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street Journal",
    "published date": "Wed, 04 Feb 2026 19:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbFdEdGc0cVJSNzBpeFdZSEpJQnVDU3Y5SlhfY0RzcFJIeVQ3dkQxOEU0X21KN0s4ek5ieHZieUpVdW81WHVKZ0JHY0FUUS1MLUdSYlBTb2pWRnltY3RFM3pCbHpPWjZzSDR6U0hpU3BaSTZ4TnZPREZOTFdtUmJLM043aTdlRFVKY0x5cklYaTRjWkVNUnpF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent - The New York Times",
    "description": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent  The New York TimesAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsEx-US President Bill Clinton, Hillary Clinton to testify in Epstein probe  Al JazeeraWhy the Clintons reluctantly reversed course on contempt strategy  The HillHouse GOP leaders set noon deadline for Clintons to reach deal on testifying  Politico",
    "published date": "Wed, 04 Feb 2026 21:23:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU2h2dDUwNk9TbHNIblNvaU5lTDZkR28wQU85NTNNUXNfMHJzczZhX2RjeGEzdXNTLWFqZ2RjbklfMlhWalpRSDVZSlJWTEROdU00VGUzTzFWWFFudWwyTTQyNC1mSTZyYnVTQkJoR05FMnVZZXlMSjFXcHV6OEpCMldwNXhJVk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "White House seeks critical minerals trade zone to curb China’s dominance - Financial Times",
    "description": "White House seeks critical minerals trade zone to curb China’s dominance  Financial TimesU.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalUS pitches plan to counter China's dominance of critical mineral supply  BBCU.S. proposes critical minerals trade bloc aimed at countering China’s grip  CNBCVance says US will establish price floor system for critical minerals  Reuters",
    "published date": "Wed, 04 Feb 2026 19:53:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1IbXY3UTBreUNtZkpRMTJDcVhzdWRHdDRlNzQzclpXVXBVWkV2cElkeUswUUZVU1p0Y0hZSDBkZ2djazBNYWpBdXVBalMtN2dJX0YwQXFkSl83ZnVwQUpjSVg1MnNYVWhsLWxBSXpaY2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Dems outline 10 demands in letter to GOP leaders in ICE funding fight - Axios",
    "description": "Dems outline 10 demands in letter to GOP leaders in ICE funding fight  AxiosDemocrats plan DHS funding offer as Thune floats long-term punt  PoliticoProspects for ICE deal sour on Capitol Hill as shutdown deadline nears for critical agency  cnn.comTalks in Congress to overhaul ICE are already breaking down  MS NOWOpinion | This good compromise would rein in ICE without undermining its core job  The Washington Post",
    "published date": "Thu, 05 Feb 2026 04:46:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOb182ZnVxQUkxdi16YWtRWFpXLS1OZmJSTEQzdE5haHc1X2JGbmNrbHM4NnNvS2kxbWsyWmVtclIzVTBiajFSVUVKdHNOenJ1YngyR3hlaW1YWlphNFg5V3hOVWhSQU5EOF9HTlVvYXpXY3NyamwtMk1CVnpCU3NITnBQanlPWkkyU3pYcFYya1RGa3Vt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  Los Angeles TimesSeven candidates faced off as KTVU Fox 2 aired California’s first statewide gubernatorial debate of the year  KTVUSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostThey want to be California’s next governor. At S.F. debate, it was hard to tell them apart.  Mission Local",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm - The New York Times",
    "description": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  cnn.comSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC NewsWhitmer, Winfrey respond to Trump’s suggestion to federalize Detroit elections  ClickOnDetroit | WDIV Local 4Trump doubles down on suggesting federal government 'get involved' in state elections  ABC News",
    "published date": "Wed, 04 Feb 2026 15:28:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOakM4RDB5eU1VUzc2NUpSQW9RMTJpaEx2R3BhWUtCTlhtd3NRVFZjVzFKdWJ1eGNLMXMybktzVFVYSlhHa2FUTkZ5M0xCb2dSelQwenl1dmJNdDB1elJPNkxtWlJSLURhdFV0Q2hySkpiM191aW1POEJ3YXJ1WFhLbjBjUDdicTJaT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal - ABC News",
    "description": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsPoll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement  NPRTrump’s massive self-own  vox.comNew Marquette poll finds majority of Americans say Renee Good shooting was unjustified  WISNPoll: 62 percent think ICE efforts go ‘too far’  The Hill",
    "published date": "Wed, 04 Feb 2026 22:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWlhVUnpBRVVkTE9pNTdMdlpxTlBob0puN2wxQ0RRcU42WWVobGt2M2drclB6OVJyR05QV3BKNXNrdUUyZjdEWi1mVE5rOWhkLUg3aTZ3T2pheGdNRFNDTEJMb3RZODBxcEtZUVBrYXZ0NEgyb2ZGeHl2bkZvNFNoU1ZfSzFEZ0ZMdVhib0tXbVpWT3VhVTJqVDJERjgzWllUYThR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show - NPR",
    "description": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPRThe Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesDozens of children suffer toxin poisoning symptoms following baby formula recall  The IndependentDoberman pinscher named Penny wins best in show at Westminster  ESPN2026 Westminster Dog Show highlights: Winners, results for Best in Show  USA Today",
    "published date": "Wed, 04 Feb 2026 13:36:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZGhHTHFvRHpyZ1VXMWgwV1FkdU9POHZUTzE4WGtNc3Q3aEc1alIzVktxb1hGRUlyQXk1VXZWcTBTNWtmRnktczdzdGh2aHlKTGNURVB1RjFmNmZDUlZsSXVBd1FNWjZDTEJKa3NDSlF2ZHNabHJpbkF3WGxkMzcxUXVCcDhOUjBQREtMaEN0VGJlbHpxRFRwSms5RHNmal84WVZXWjhhSEhqUEJHU0ZmbDJxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsRussia-Ukraine war live: Second day of US-led war talks start in UAE  Al JazeeraRussia's Dmitriev says progress made on Ukraine peace deal  ReutersUkraine war briefing: Zelenskyy voices hope for new prisoner exchange as talks continue  The GuardianRussia-Ukraine Peace Talks Stretch Into a Second Day  The New York Times",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Spanberger orders state law enforcement to exit federal immigration agreements - VPM",
    "description": "Spanberger orders state law enforcement to exit federal immigration agreements  VPMGovernor Spanberger signs Executive Order and Directive, establishing principles for Virginia Law Enforcement  WSLSMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.orgGov. Spanberger signs executive order to review law enforcement policies; GOP responds  WDBJ7",
    "published date": "Wed, 04 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOLTNVOWxjYXFzYkZUdFNtcHhJOXAxUkhPQ0tVb1JLS3pMSktqX3pTU1MxS1ZTck00ZzhtY1FlTGZhOU1CaFZEYWQ3MmhLYjROWkttY3BaejRnYVk4OWxiRW1KY0hsVWZsOGRuMFBzdnA3S3VaaHJhTEx5OWpoX0p6M3NGOG9LT1gzUVNPUmhqeU12V250UFRhOURRRDMycFFNMU8tbHFvTlpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Texas families can now apply for private school vouchers. Here’s what to know. - The Texas Tribune",
    "description": "Texas families can now apply for private school vouchers. Here’s what to know.  The Texas TribuneApplications open for Texas Education Freedom Accounts. Here’s what families need to know  Dallas NewsAfter years of debate, Texas' private school voucher application opens this week  ABC13 HoustonMore than 30K school voucher applications submitted on day one of Texas launch  Houston ChronicleApplications for Texas school voucher program open today  KBTX News 3",
    "published date": "Wed, 04 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOWktSR2hCWGhiOUZoN0RSR0tRb0RwQmktWC1GNm1UQ3RVRFRMWVZuX2J5akRWN1NzaXpiWXpLbklHczJCSWNwN2o3NVB5eldXenFoS2hhYVBVbVNWWHk3dklCY1Aydl8xTDI1SW1HTnVEc0xLbngwTEQ0Sk0zLW5kbWd5R3dXTjcwd1paSjBZVm4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoSteve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketSteve Bannon Proposes Using ICE in Elections  NewsweekBannon: ‘We‘re going to have ICE surround the polls’  The Hill",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan - Democracy Docket",
    "description": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan  Democracy DocketVirginia Supreme Court will hear redistricting challenge  PoliticoWith General Assembly Democrats deadlocked on maps, Texas results pose a question: Does Virginia really need to redistrict?  Cardinal NewsLucas says proposed new congressional maps are expected this week  WVTFDem infighting muddies Virginia redistricting  Punchbowl News",
    "published date": "Wed, 04 Feb 2026 16:50:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQdXNSTW9mN1J0RTAzN0JkREtGV1dZMmxaYlZwQ2lDRnlSaGRWcDdrS3FpYWdYWkpGUGluVnJPaGUzYnQxSEFtMG82Z25kMlZ2NjVWRDVFZ1M2OHVvcHRQMmVlQi1NRTJLX0tmeU1WMFZBbml2elI5T1ZEaXUzLWZJN0V2WTY1MnEtVVpmVjBFUjBMWTRJN0pRa0ljODNMUWpSMW1ocmhkeFFlazlpa1k1eFlRUTdiZ0NSZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win - Politico",
    "description": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win  PoliticoQueens voters pick Mamdani's successor — plus two other New York special election results  Crain's New York BusinessDiana Moreno’s Assembly win marks first electoral victory for Mamdani as mayor  City & State New YorkSpecial NYC elections 2026: Diana Moreno wins in Mamdani's Queens district  Spectrum News NY1‘Welcome to the People’s Republic of Astoria’: Diana Moreno cruises to victory in AD 36 special election to fill Mamdani’s old seat  qns.com",
    "published date": "Wed, 04 Feb 2026 15:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVWtTZm9HRGZ0Nzg2RjNsYTRHVFZEZk1ka3k1bTF2cjlycFk2LW4tYmluaFlaT2JWYXJuWFRoNHVXUEI2RkZZY0NwS2VhYzNETVQ3eDlfc2pIQ2x5RHFHckw2WVFPY2lRZ2ZnbWpGRVVrQzEycUxzMGNBS001czBxdzJSTWJpOElKeHZ0RmxrSkMtZW9KdDJEZkpfTTRTTE1DdE5qYzVhRjhIWmtlUzFiblpfYjU1YkxoaFQ3aFp4RURfMWUzenJPbQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hochul taps former NYC Council Speaker Adrienne Adams as her running mate - City & State New York",
    "description": "Hochul taps former NYC Council Speaker Adrienne Adams as her running mate  City & State New YorkBrooklyn Dems pull Hochul endorsement after LG pick  City & State New YorkHochul Chooses Adrienne Adams to Join Her Re-election Ticket  The New York TimesNY Gov. Kathy Hochul picks Adrienne Adams as her running mate  GothamistWhy Hochul chose Adrienne Adams as her lieutenant governor running mate  Times Union",
    "published date": "Wed, 04 Feb 2026 17:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPNms2NFJwUFB4N09RbEFCSkJVc3dya1U5Mm5TZ2ZLVWZnZWZ2SFNxLTRWTU51ZjMwS0VELWd4SjZtbDFZRnJhQkZmOXVudVBQYlJrV2t3VG10Q0NKazdjOEdSWlM1ZHViUGVNU2xET1FwSFd5dmlhMzZGWmM1Yi1TNmp2dmtLSTQzYl82bnBQbXhnb1NfbWpOSU05Y0xkRHJsMlRkVUptVk1PQlhNUTEzQ29qcEpvbzVK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cityandstateny.com",
      "title": "City & State New York"
    }
  }
]