[
  {
    "title": "Trump throws a temper tantrum after tariff loss at the Supreme Court - NPR",
    "description": "Trump throws a temper tantrum after tariff loss at the Supreme Court  NPR‘Murky Waters’ for Global Businesses After Trump’s Tariff Loss  The New York TimesJohn Roberts ends Trump’s big Supreme Court winning streak  CNNThe supreme court’s tariffs ruling puts Trump on notice with a bloody nose  The GuardianTrump’s New Trade Agenda Is on a Collision Course With Midterms  The Wall Street Journal",
    "published date": "Sat, 21 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE12bjNqX05hV19JYWZlZDdHVkdvNDl6MnkzTkZfanVkTGR6aUs5T1Z3TUx2WTVvMXZBWGZlR3Zqc013aERDLXlTVDVtODItYmd0cWtxakFOU21WQjNOZm1uMXFlc1FrR0tRLWd1d0hWNGw1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Speaker Johnson denies request for Jesse Jackson to lie in honor at the Capitol - The Washington Post",
    "description": "Speaker Johnson denies request for Jesse Jackson to lie in honor at the Capitol  The Washington PostHouse Speaker Johnson rejects request for Jesse Jackson to lie in honor at Capitol  CNNHow Jesse Jackson’s ‘radically inclusive’ vision shaped the Democratic party we know today  The GuardianJesse Jackson made a black president possible  The EconomistRev. Jackson's message of hope resonates well beyond Chicago  Chicago Sun-Times",
    "published date": "Sat, 21 Feb 2026 04:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNdVFxT0lWekNHNmtwNUdsQnVJLUFSeU5RR2xNTG9ZZ0pfdG9uU2QwYkdKY1J2REpFQXpEelpSTHdySS1lVzJYX1ZsQkhfXzBVRmc1MWxsdHZBUzlUbHdjQzNkbnVsUTJzelpEQlNFWE1CVTVhU1d3ZGN4Z2NIUVBuNmdKM3BTMVV2ZFIxTE45bmFISUloSnBuZV8xQjk1Qkl6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Officials investigate deadly California avalanche for possible criminal negligence - The Guardian",
    "description": "Officials investigate deadly California avalanche for possible criminal negligence  The GuardianThese Skiers Cleared Out as Group That Would Be Hit by Avalanche Arrived  The New York TimesA group of close friends embarked on a backcountry ski trip. Only two made it out alive  CNNOfficials probe possible criminal negligence after avalanche near Lake Tahoe  YahooCastle Peak avalanche: Six mothers identified as victims of deadly avalanche near Lake Tahoe  ABC7 Los Angeles",
    "published date": "Sat, 21 Feb 2026 02:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOdVliNzVZU0xxd0cxZ1R1VWpybHhiZXVJWlZhYk9wM1NxTS0xLTZpajIyNGFMVjRKdElib2lBTnVuckpmLUozdGwwUnMtVDZqQUJ5dFhaZVhzLW5iaDZzdmJIcENTYy1pRnNwZkprWTI0VThKVWFqVUhQYXBQWHdTRWdwdW9fVE16REZLWVJhcGhLV1ZndFEtb2xodm4zNVJmZVl4Zg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Bible's Ten Commandments are to be displayed in some Louisiana classrooms, appeals court rules - NBC News",
    "description": "Bible's Ten Commandments are to be displayed in some Louisiana classrooms, appeals court rules  NBC NewsCourt Clears Way for Louisiana Law Requiring Ten Commandments in Classrooms  The New York TimesCourt allows Louisiana law requiring Ten Commandments in schools to take effect  Reuters5th Circuit upholds Louisiana law requiring Ten Commandments displays in classrooms  Louisiana IlluminatorFederal appeals court allows Louisiana’s Ten Commandments law to take effect  NOLA.com",
    "published date": "Sat, 21 Feb 2026 05:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOc1VaSDJlelhtMW1lTHRrSEZ3cE9tcXlrS2ZFVTJlMkFmMngwNW8tbmdzbmtWeWNkdEVyalctTktmMXdIX3I2ZmhDYjdibGJDOTVVT0ZERWVWZVI3SnBpbmhkR1huSlVRaS02NEU0emlLeC1qMW9NdHUyWmRpS0xTeXpwOFdPcm5Cb1FNVkktRmtIWmNNTXZ3YXoydlZBZ1JJZmpBTklESDlFQWFPU1hoRzhYN2VLVGM4S2h0OU9iVlJ0T3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "New York Man Tried to Ram a Nevada Power Station in Act of Terrorism, Police Say - The New York Times",
    "description": "New York Man Tried to Ram a Nevada Power Station in Act of Terrorism, Police Say  The New York TimesMan crashed into power substation fence outside Boulder City in suspected terror attack  FOX5 VegasMan who crashed into Nevada substation found dead in car with arsenal in suspected terror incident: sheriff  Fox NewsUpstate NY law student dead after ramming Nevada power substation in possible act of terrorism  Syracuse.comFBI and Las Vegas police investigate suspected case of terrorism  The Guardian",
    "published date": "Fri, 20 Feb 2026 23:49:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1HRzlDUjc4Mk9ORFVRTC1ReTJtU0NpZlBIVzZlUTFwcVh5a2dCWXhCckc4RThQSG5LYnBQMGNtQ1BvSlg1eUdBTEJCU0hpM3c2RE1wX0hfZm5SMWsxWUlmbVctRzBodzBwMEtEYUUxWU1pMHJ0SjZNTjFuNkxRVGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump's Iran options: \"Token\" nuclear enrichment to taking out Khamenei - Axios",
    "description": "Trump's Iran options: \"Token\" nuclear enrichment to taking out Khamenei  AxiosDozens of U.S. Planes Are at Jordan Base, Satellite Images and Flight Data Show  The New York TimesWith U.S. forces in position, Trump mulls his options for Iran  NPRA look at the military hardware the US has positioned for potential war with Iran  CNNTrump pushes US toward war with Iran as advisers urge focus on economy  Reuters",
    "published date": "Sat, 21 Feb 2026 00:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOcDk5V2tlbFp0SlEyWUJWQTVkQ0ptQk1vUF8wOEN2d3B2Q29RN0FURnJqb2pvLXNiQ1hhRUh1d1hON3ZfV2hqc1FfVkJ0Wm43a2lrR3BPNi1pMXVuTjVPNjBibHhua0gxOXZPWmtVX1ZlbGU4RHRmZWpsYktsaU5CSVVKV2FKbUJw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates - 6abc Philadelphia",
    "description": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates  6abc PhiladelphiaPhiladelphia snow forecast: Winter storm watch issued, measurable snow expected Sunday  FOX 29 PhiladelphiaSeveral inches of snow, or more, possible | Latest models for track, timing, amounts  WGALLive updates: Nor'easter could bring up to a foot of snow to Philly region  NBC10 PhiladelphiaTemperatures in Pittsburgh return to normal on Saturday with scattered snow showers on Sunday  CBS News",
    "published date": "Sat, 21 Feb 2026 05:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQUElVNjVlMkhac1M1RlRuVmRXTy1hZUpYelJBbmkwRlN3YmxlUGRmcXB3dlR5eFFmVkZEaGZFMmZmT0FkRm5hMXFpaW8wX3B5c0xnWFpUdzYxajAxQncwbkw3WmwyRkZEbUtKVGN2MXRHRm5OdVNuWFRrTEtGdnpQU0Mxc0dfZUhTeVlLaThKb1hxOXZqekU1dXh4RENWeWFWLWZNWmZNajdLM3duNXl0Wg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://6abc.com",
      "title": "6abc Philadelphia"
    }
  },
  {
    "title": "NYC, NJ forecasts now warn up to 10 inches of snow expected for Sunday storm - Gothamist",
    "description": "NYC, NJ forecasts now warn up to 10 inches of snow expected for Sunday storm  GothamistWhen will the snow hit? See hourly radar for the weekend storm  NBC New YorkA powerful storm will hit some cities with a foot of snow. See the forecast for 12.  The Washington PostEast Coast Storm, Nor'easter Expected Sunday, Monday  The Weather ChannelOver 40 million Americans on alert for winter storm conditions over the weekend  Yahoo",
    "published date": "Sat, 21 Feb 2026 01:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQdjZqX3pNdC1VWkJob1FOU2h0b1REYXNmUHpBWngyRjd1SFNsVXpvTGZIZlZqVUhzVmZ0VEUwdFJ2dWsxUzhZb3NFNWw2N3V0eG95ZVduOU1FTGVha2F5ZUdpWEpFZ25ENVYydndsQzd4VVF2YWJfdnhvMGpxbjRRV1JncDBIT3JIMHlxZWxuRkFIaFNZc3JvVkkyMjIwQzdpWXdadFVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show - CBS News",
    "description": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show  CBS NewsSnow forecasted for Friday night; totals rising for Monday's storm  WCVBHigh potential for impactful nor’easter Sunday night, Monday  WHDHNew snowfall map: Weekend nor'easter could bring a foot or more to parts of Mass.  NBC Boston7 Massachusetts counties under a winter storm watch from Sunday to Tuesday – as much as 15 inches of snow  MassLive.com",
    "published date": "Fri, 20 Feb 2026 22:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5OWS1UODVzTWFvbmJ0MjFtSGh3QUdNQWNtZkg4NXVlOEJjUUFrMGNYa2x3bWtjWXE3OThpYmFpMnZKZ1JDR0tBSTFoWFFBbkx3QjJNUW85cjRnb3FGWFdXZHdpMlg2Wk1OZ0REREN6M2hEUThiUTNDaVV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "E.P.A. Weakens Limits on Mercury From Coal Plants - The New York Times",
    "description": "E.P.A. Weakens Limits on Mercury From Coal Plants  The New York TimesTrump’s EPA to roll back rule limiting hazardous mercury from coal plants  The GuardianEPA rollbacks on pollution limits could drive up health care costs, advocates warn  PBSTrump adminstration rolls back mercury rules for coal-fired power plants  The Allegheny FrontTrump administration eases limits on coal plant emissions of mercury and other toxins  NBC News",
    "published date": "Fri, 20 Feb 2026 20:54:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFAwVTRkdmlwQzdFZXdzaUllNjN5X2g0T2tranI1cGduMC1LRnVyOHpJN00xNTNTTUJjcEo4UU9RbUpPZDhLaW1nOXVRd1Q0U044OVBBRjlqcHJ6WVVnQWJJRDBkTnFPZ2d3em0xd2NHRHY4U2xFbWdTdVBVcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump hosts governors' breakfast after National Governors Association pulls out of event - PBS",
    "description": "Trump hosts governors' breakfast after National Governors Association pulls out of event  PBSTrump kicks reporters out of governors meeting. 'You can leave now.'  USA TodayMaine Gov. Janet Mills explains about-face on White House meeting  Portland Press Herald - Maine Sunday TelegramJosh Shapiro visits the White House as Mikie Sherrill skips governors meeting after clash with Donald Trump over Democrats’ attendance  Inquirer.comA White House dinner dispute shows the hurdles for Democratic governors in dealing with Trump  The Boston Globe",
    "published date": "Fri, 20 Feb 2026 14:22:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNQXplb3RsalVudlN3SEl0bjFtbWtETWRfVlV4LV9WUUl2UXVRaGtBRHM5bW9tZ0NxZFpQYjJFdng2ODlVd3VvdDMtTTlLSElRcHd5YWJjMGE0eG81eGFlZXotQldGclNQWGw3eE5hMHRIQXdvUkg5N2xfNVp1WnZwNnBROHBuYVhHenBrTDlPdkRPTEdvbXNvQXFWMW41TklYX1B4eHY0UnFfeWtTVU1GOGcxTWlYTl93ZHFYTDVlVGZITVMzSVNzd1dyeExtdmxvNEHSAdcBQVVfeXFMT25jTEVES0Q3MF9WNEQ3MDlLRVpKN0MwT2NEcGRpMnBZMzdJU19nbVU2Q3BfTE44eXNaaDBxT2NpQklMdHpDdEhtWld1TjE4anB5cXdZaXhybTNka3dERFJFb2lzVThMQk85bHAyU3JYTGd2SlNfTHpxWk16aGlBV29Yc2YyVDB1NWY5OVBrZDZjd01YeS13Z25NODB2R3B4NlRKZkZkWUxMREFYQ0NTWktETy1kUmZncUlpNFBqUkJxVXQ3dHhJVXVDV0ZCRXhQOTJZNGRFTzQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]