[
  {
    "title": "Alex Pretti identified as man fatally shot by federal officers in Minneapolis - Star Tribune",
    "description": "Alex Pretti identified as man fatally shot by federal officers in Minneapolis  Star TribuneWarriors-Timberwolves postponed amid Minneapolis unrest  ESPNAnother killing by a federal officer deepens Trump’s self-inflicted political nightmare  CNNVIDEO: Minneapolis protester fatally shot by federal officers identified as ICU nurse  kttc.comVideo contradicts Trump’s claim man killed in Minneapolis was a ‘gunman’  The Guardian",
    "published date": "Sun, 25 Jan 2026 02:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQUS1Dc1BWWkVVRVRSdzdSd01jN1huQ2ZDTzZuTzdSd3hOXzkwZWlqeW8xUERlSXZFbjdjanA4YkN1cnp6MXRqMWRVUUZXcGxZbmM5UFpVaDgwWjZSN0k5ejZabjExN0tubFRNaTRFd2pwaHFRUkdtNXJ0VUlQcHJ3UjBEZmNRY0ExaFlUY19ycFVjVGNKZjVWTExZZWxDNEZXNGg4MTZVUUdkbUJhYWR3X05KWXFPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Latest snow storm forecast maps show fresh predictions for where winter weather will hit hardest - CBS News",
    "description": "Latest snow storm forecast maps show fresh predictions for where winter weather will hit hardest  CBS NewsLive updates: Dangerous winter storm blasts the South as power outages skyrocket  foxweather.comWinter storm blankets US in snow and ice. See its path in maps.  USA TodayWinter storm live updates: More than 10,000 flights canceled as bitter cold blankets the U.S.  NBC NewsUS snowstorm triggers flight cancellations and power outages  Australian Broadcasting Corporation",
    "published date": "Sun, 25 Jan 2026 00:43:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1aQmJPTmNFcFJqMng0aGtaNWpYeDRLVTg3eGdhci1lSk9XdWc0WkZQbUM5dEN3SFpyYTFLX2d3Um9JWE5KcFNCMkZmd2VfeWVyczNOMU1BNkIxbUhEd1MtMXNXNzBwUzZOLUg5LTZtN3NSemFUTWtBZNIBfkFVX3lxTE5lczR4V1JRd19vUGV2LUVFRkNUT2UyLXJCdVl6SE5RZGdMZk5RMlh2SFZUREt6d3A4MVRnNmk4ZU9RelNUd2lUYVZ5ZUREUzEzTTZhblMzbTRNUlVEbWVIZnRNVHNGMVJia3FwWFQtZXlPTmxQdDA0UU9YNUQ5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Democrats Vow Not to Fund ICE After Shooting, Imperiling Spending Deal - The New York Times",
    "description": "Democrats Vow Not to Fund ICE After Shooting, Imperiling Spending Deal  The New York TimesSenate Dems revolt against DHS funding bill amid Minneapolis chaos, hiking government shutdown risk  Fox NewsSchumer: Democrats will block funding package if it includes homeland security money  The GuardianShutdown risk grows as Democrats revolt after Minneapolis shooting  PoliticoFurious Democrats float national guard, government shutdown over latest Minneapolis shooting  Axios",
    "published date": "Sun, 25 Jan 2026 01:03:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9OMlZKMmRxTW1KMDNOdWxlNUhjdzVZMi1PUGNmSXhQMUlhZ21VYVdDTUY5dXI1MTN0cFpXaHRRdHB5UF9pRDBoYzRnSzczYWNDUnRwT2M2aC1qTUVRYURNV0NFTXl0QV9ZclBPNEI3V2d6RlY3MVd4bGRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Democrats in Texas Senate race call for ICE overhaul, hours after Minnesota shooting - NBC News",
    "description": "Democrats in Texas Senate race call for ICE overhaul, hours after Minnesota shooting  NBC NewsTakeaways from the first Texas Senate Democratic primary debate  CNNKey takeaways from Crockett vs. Talarico Democratic US Senate debate  kxan.com5 takeaways from the Texas Senate debate between Crockett, Talarico  The HillAfter deadly shooting by immigration agents, Texas Democrats running for Senate say ‘clean house’ at ICE and ‘take that money back’  Fortune",
    "published date": "Sat, 24 Jan 2026 22:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNTXA4VHFVZGNZbEl3VHVtUXpDMHp3T1lYZGlhYzIzNDBEb00yU1ZROXF2LXUwemhMa09NZ05WeFpNUnlrektxSmVEYW13ZmJrYlZQNWZ2RXRtcjBKNW5MNk4wNU5SMWtqeTFybEJrd3phcGlpYWtkX01GQlVRWW5zdWcxQXc4bllaVXdKcU9pTWFZU0dVU3hic01QRGRnQzdzUnFFT1FIX0V3djF1bjNhemlFSFJ3ajFyM1FpNWdaSldSQjNWSzN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Ukrainian officials call talks with U.S. and Russia \"positive\" and \"constructive\" - Axios",
    "description": "Ukrainian officials call talks with U.S. and Russia \"positive\" and \"constructive\"  AxiosUkraine hails first trilateral talks with Russia and US as ‘constructive’ as Washington says mood ‘very upbeat’  CNNUkraine war briefing: Kyiv and Moscow set to hold more face-to-face talks as US hails ‘big step’ forward  The GuardianUS-brokered Russia-Ukraine talks close with no breakthrough  Al JazeeraUkraine Peace Talks End on Positive Note as Zelensky Teases Future Meeting  The New York Times",
    "published date": "Sat, 24 Jan 2026 19:46:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBucE1FYXFVMktsRXFrYmlLV0pWUE0xdWotaXhDNXJJZUt6OVA5aDRsbkdCSVFQeVAwaW5ReEdrMEFvZFVYWGFGT0pndHR6Ym03X0JvZl9vVTRZVnE2YjFBTFpXU1puWUV3dEE5TjU4RkdGYjRi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Governor Hochul Updates New Yorkers on State Preparations Ahead of Massive Winter Storm - governor.ny.gov",
    "description": "Governor Hochul Updates New Yorkers on State Preparations Ahead of Massive Winter Storm  governor.ny.govWinter Storm Warning for NYC, Tri-State as area braces for heavy snow on Sunday | Live updates  abc7ny.comNew York’s Latest Forecast Shows Heavy Snow, Then Sleet  The New York TimesNYC Mayor Zohran Mamdani warns it will be colder than it has been in 8 years  nbcnewyork.comGood old-fashioned snow day may be healthy for kids, doctors say: 'Permission to unplug'  Fox News",
    "published date": "Sat, 24 Jan 2026 23:43:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOXzlrOGZNTlRBVlVOelJNY2VxazdKVzdLVGgwOXFCTzFmWGFQXzljVEhqTThvaEJiVy1PMndtV1ROVXNwS3FGOXJyTUVOT3ZPeGhMSWZkZDU1VHRwZGlUaVoxazdpVXRIaHBZSGNjNTd6bE1xWGpUdGl5cFFwQVVVNlBGb1lJXzZuLTNkWW96SGhGNmhrMEtTNl9vOEtCQmNJWDJ5QkhvTTBTRVVhTDBRVXV5N0s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.governor.ny.gov",
      "title": "governor.ny.gov"
    }
  },
  {
    "title": "Large protests spread across US after Alex Pretti fatally shot by federal agents - The Guardian",
    "description": "Large protests spread across US after Alex Pretti fatally shot by federal agents  The Guardian‘We must stand up’: San Francisco anti-ICE protest underway at Embarcadero  sfchronicle.comHundreds of Minnesota Businesses on Strike in Protest Against ICE  The New York Times'It's time to start doing something.' Despite risks of violence, Minnesotans step up to take on ICE  ReutersSeattle group rallies in response to man killed by Border Patrol in Minneapolis  komonews.com",
    "published date": "Sun, 25 Jan 2026 01:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQNU56d1JiblFhT0FmUEZOUTdmYjJqYnFabEFzUlgxZ2dUdEdiWUlrak4yNC14dTdPLUZIY0hwN1ZpWjVkSXg5N3RqVG04TEN0cEdPcWRWSDhfTmhOUHRTbTQybXdmM1REM1k3U3F3M0VfQ29GM1N5cWhqbzlZWEVnWFo2cjU2clVvWEYzcVFCQ0I5czQtS2xLbU1ocw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Republicans are worried about Trump’s deportation campaign, and our new poll shows why - Politico",
    "description": "Republicans are worried about Trump’s deportation campaign, and our new poll shows why  PoliticoTrump privately frustrated that he risks losing control of immigration message amid Minnesota chaos  CNNAre Republicans Growing a Little Uneasy About the ICE Raids?  The New York TimesVOTE: Do you support Trump's efforts to deport dangerous criminals here illegally?  wjla.comVoters oppose ICE amid shootings in Minneapolis, polls show  The Washington Post",
    "published date": "Sat, 24 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQMU9iVEc5NXp0bjVHZm5mUGlYc0NMX1E4TEJITHM1WWlFQ3M2NC1lOXBEWFhNUjhpaTJFSm5wM2JiWV96SEZTaDF4UExRX0JEb2RVNXJGei1xMWtqTzF3NnJUZ1lJVmJFOEFtWUtSYmYwSWlKSWxJME1qTTZaWnl1ZlN4NnI4Z3dVZTVwWk1ZUFpadEc3VUt6SXltQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Appeals Court Rejects Justice Dept. Push for Arrest Warrant for Don Lemon - The New York Times",
    "description": "Appeals Court Rejects Justice Dept. Push for Arrest Warrant for Don Lemon  The New York TimesAppeals court rejects Justice Department’s push to charge more people over Minnesota church demonstration  ReutersAppeals court declines to order lower court to sign arrest warrants against Don Lemon, others in church protest  CBS NewsMinnesota judges continue to reject arrest warrants in ICE protests  MS NOWSeveral people were arrested for protesting at a St. Paul church. Here’s what we know  CNN",
    "published date": "Sat, 24 Jan 2026 22:24:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQSDRuTWQwUjg0T1lLZGRQRnZ2Vnp1ZW40VmV5VTEtcTM2LTN6WWFRMFJsQV9DUldrUWJBNm9rOEItNnFOd1hWb3VDZjcxdjZjVWdUanRZU2x5YnFhaS1FekhsOHJpQkVVUEZ1bGVqUHBkRnBLdGtia1FteXhSRVZiRUtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]