[
  {
    "title": "DHS: ICE officers in Minneapolis shoot Venezuelan man in the leg - NPR",
    "description": "DHS: ICE officers in Minneapolis shoot Venezuelan man in the leg  NPRFederal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesAnother shooting involving federal agent in Minneapolis sparks new protests  The HillLIVE UPDATES | ICE in Minnesota: What we know so far about the second ICE-involved shooting  FOX 9 Minneapolis-St. PaulAgitators clash with federal officers after another ICE shooting in Minneapolis  Fox News",
    "published date": "Thu, 15 Jan 2026 06:49:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNSHBTY2xQeERNUDlJdHRGbjlIWUxMLTdKSlQxYnVZYW4xLVZJZzU3X0h0X0VUZXJPVENZUnU4d2VKQXE1S2JjNmRDWUgycnd2a2xScm8yLUpRb0Njb1FNSHlKNFVGS0FWaFBzSThSQnNfZnlxS0VuU2p0TUtZUXlOWmRsX212VFhsQXZ0NDFvYV9sX3NlcG9Hd2lTN1lmUlJvUGR4eVA3M0hiT1pN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Boeing knew of flaw in part linked to UPS plane crash, US safety board report says - BBC",
    "description": "Boeing knew of flaw in part linked to UPS plane crash, US safety board report says  BBCBoeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesNTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNNTSB says part on UPS jet that crashed was on Boeing’s radar  WAVE NewsCracked part in fatal UPS crash flagged in 2011 by Boeing  CNBC",
    "published date": "Thu, 15 Jan 2026 12:49:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1Fc0pmd1lMcEstSGdTejJGQk9PdU5OZnZMQTJybjVRVzJ6dFpSNWZRUDVCTWhrMkttRlVFSEJkcEZ0bUlFQzh4endYZ2dVRk5IM2laQTNodEdJZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam - Axios",
    "description": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOWDemocrats Push to Impeach Noem After Minneapolis Shooting  Time MagazineUniversity of New Haven professor weighs in on impeachment effort against Secretary of Homeland Security Noem  NBC Connecticut",
    "published date": "Thu, 15 Jan 2026 10:27:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUVMxLWIzMFh1S2hoYkVHa0tQYmQybDh3MHlDTVd4Y3JFNTV5bTVEc2xFb2FUemo1QmNYMmtEcHlfSnc3Q2xDUXFoM1NYaHVQQ1RnNTdLSFUzR1NpWS0tbFF4SEVmQ0xCOFZ4ME90aFBhWHJfMm9wSjZ4SlhuUlV5TE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Colbert Jokes That Trump Has Found ‘a New National Bird’ - The New York Times",
    "description": "Colbert Jokes That Trump Has Found ‘a New National Bird’  The New York TimesTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The GuardianA Ford worker called out Trump. The president flipped him off. Now, he’s been suspended.  Michigan Advance",
    "published date": "Thu, 15 Jan 2026 07:53:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPc085WjFzSEo3bEJkck1Da3RucUdMVjlhdjd0OHlucU82TV9seXZiSllyR3paUFZneS1HOUphY1EtOWR6WS1fX0lZbHdwOFpUZVNBcmFKR3R2R2s2UXNnSEU0OER5cUgtVjlSam1ZcF96R2t6SGpCZ0FnblZoM2l0ZTdBNklxV1R2enBRb1VlLXptM3VLZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "FBI searches a Washington Post reporter's home as part of investigation - NPR",
    "description": "FBI searches a Washington Post reporter's home as part of investigation  NPRF.B.I. Searches Home of Washington Post Journalist in a Leak Investigation  The New York TimesFBI searches WaPo reporter's home. And, Trump restores $2B to public health funds  NPRJournalists confront new reality in reporting after FBI raid  The Washington PostFBI searches Washington Post reporter’s home  CNN",
    "published date": "Thu, 15 Jan 2026 06:42:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNSU9FQkZXc1g3MDZKeEtldjRRbDNBbzJKaHVibjNmUmFyY2tmc3VSbjRLRGVQZlR4b25kcHNrVmpXazEyUjd5cWRKVDBYZGFlcFVfaVdEU0V2N1M0aHphek1xLUIyTS14T3AzM0ZnaklhcjU4NEtndUw4Sk5GRWk5dmEtRU96VXNORFJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Democrat blasts HHS for creating confusion in cutting, then reinstating SAMHSA grants - AP News",
    "description": "Democrat blasts HHS for creating confusion in cutting, then reinstating SAMHSA grants  AP NewsH.H.S. Reverses Decision to Cut $2 Billion for Mental Health and Addiction Services  The New York TimesPresident Donald Trump terminates $2 billion in SAMHSA grants  Nashville BannerUS health officials reverse course and reinstate $1.9bn to mental health and substance use  The GuardianTrump administration sends letter wiping out addiction, mental health grants  NPR",
    "published date": "Thu, 15 Jan 2026 05:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNSTl3amU1Zm5QNlhxelkxcW5fc05EekVaSEQ1OWhvOFNrVU5TN2JyMWFDbnRpamdZTzM2MC1HcTY5SjdnZGZzbGJKT0lwemR1V3hVVmlDbk1qMTEwUGVYOGdkdkdGak5rQWRwa1RpWmUwLVc3M3Z0ZURsNXJ1aFRVYmFjUjZvWGFfZFNadm1meG0zTm5mRTR3Yldza21XSUhoSnJHREU5Yl9FaVl4MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Brazilian au pair testifies against former employer and lover in double homicide case - ABC News",
    "description": "Brazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu Pair Testifies of Lurid Plot in Virginia Double-Murder Trial  The New York TimesAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC NewsVirginia nanny’s jailhouse letters reveal conflicting loyalties in love triangle murder trial  Fox News",
    "published date": "Wed, 14 Jan 2026 18:16:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxORWU5ODdpdTZSZGtHZVlUVGJFMlFId1RhOVh6OGU5TkdybVZMRFRlSTlVNEY2RTBBNmdyRXN2RE5jZWlkaUdUYzI4SVVHQzhTZlNGOXhucmNBMTFWVkw4NDI5dFBlSTFUQmRMNDdPYm4wT0hsdlBUYXRYZG1YSHJUb21qaGpUWlZzMDJhbHE5UkdvLTFGaGtZc1daVTVpQVZWM0oxatIBqgFBVV95cUxOZjJ5ZW1ObTFESW96c09iREVHVW9rYV95RHBseG1SZWxaM0hfak1ZYUhRelFVR3NaMFFILVFQcmJlWjZtbk8xbGxCSzFRX3BZaDVyRE5qZmk5Sms1T2cxNTFLUS1DTVJKb3VhZUc1OXdyU0Y1WVpZUmJvb25RRzFHVmdIemZpSWpEWWdlMFJUdHZLa3VwVTZwOXNHVUhKaVU2TlFlaEx0YWdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Videos show security forces firing into crowds in at least six cities across Iran - The Washington Post",
    "description": "Videos show security forces firing into crowds in at least six cities across Iran  The Washington Post'It's horrifying': Videos of body bags and machine guns give rare glimpse of Iran's bloody crackdown  NBC NewsIran: Massacre of protesters demands global diplomatic action to signal an end to impunity  Amnesty InternationalOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesIran’s nationwide protests feel smothered after a weeklong crackdown and internet outage  AP News",
    "published date": "Thu, 15 Jan 2026 03:25:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPcDM5cHZYRnRZVG9qMDROT1JzS2IzellYUEZiUWFWdExudXQ2bGdscEJ6WlFUTEFTeFF5ODJqaUFZRWNnRkFVbHlab2hvSHZ0T3hucWczODBIN0wwdHlqZkVjQlM0V3RYYzVRTEV4ZlRrZ2hfU3E4MVprS2FtVXgxTThMcVk5RFh6c3dUbnZLS2FyN1dfLW1yeVJRV2UtbzJT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Walz calls for Minnesotans to record ICE, continue resistance to immigration crackdown - Pioneer Press",
    "description": "Walz calls for Minnesotans to record ICE, continue resistance to immigration crackdown  Pioneer PressMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNNLawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York Times'Campaign of brutality': Gov. Walz encourages Minnesotans to remain peaceful during federal law enforcement presence  5 EYEWITNESS NEWS'You've done enough' | Gov. Tim Walz addresses ongoing ICE presence  kare11.com",
    "published date": "Thu, 15 Jan 2026 00:09:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOd2JtdXVjYXNuNjdLVGJZWFVZYzBEc3gxMkIxWjdPbGVqYjJOd1AxeUxmUGVXd3lhODMwMzM0NjFkRFNYSFNpVTNQWjI0OG1BWTF3dV8wUFBid1FzQTNZUWNFVVB0emZZbTB0UnpNOHV4Y2owYl84OG05YnkzMklmYTYxTVR3Z0Q4MmhHNE9MVFk0WkM3eTdEOWVTdHNzaHpneTZPdHl2Q05ER1c0cjBOOXRDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.twincities.com",
      "title": "Pioneer Press"
    }
  },
  {
    "title": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "description": "Trump would want military action in Iran to be swift and decisive, sources say  NBC NewsTrump says Iran has ‘no plan for executions’ as US weighs military options against regime: Live updates  CNNTrump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops  The New York TimesOpinion | There is no U.S. downside to striking the Iranian regime  The Washington PostTrump sees Iranian crackdown easing, Tehran denies man to be executed  Reuters",
    "published date": "Thu, 15 Jan 2026 00:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNkFfOS1ySTk0Rml4c3czdUNEUUdTVy00TUFGSG1BWVFnZFd2MmVSRURCcWtJRUpPZ0phd3Q4MUszUW1ZODdNSXhvNGhKdHhfbGJwd0E1WTlTenNXazRMRFRDa2lJTTI3ME01VzFPRGxWQnJRT2g1UWxuNWVaOEtJbktYQVNYYXdUeVVwSUpsUVZiQlM5THpoSVN0Rmx5X1UzV25VcE80cHlHVmVTeEtyd2FkT3LSAVZBVV95cUxPanVnQ2haU2JQd0VCd2JPWnJIQ3ZqU1BqeVNhM25YekdIM1d0YmUzWkNDMVMwTld1c2FXWUpMdVJzeHFmYVFwRVVlQ0NhV0d6b0tPdzl6Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says - The New York Times",
    "description": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says  The New York Times‘Renee Good, ICE bad’: Minneapolis protests – in photos  The GuardianHow the feud between Trump and Minnesota is impacting the probe into the ICE shooting  NPR'Beautiful light of our family': Renee Good’s family reveals new details about morning she was killed by ICE  USA TodayExclusive: Trump calls Minnesota ICE shooting 'sad to see on both sides'  Reuters",
    "published date": "Thu, 15 Jan 2026 01:05:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1BRHdiUXd0RkJ0TmNLMkxrUmEzMFhSTldrMVBtVDZMSkVvaktrU3hvSndwenhmbDRvYkE0ZGl1LXM5SnVIdWhuSXBsZUw2dmlaWXBocWFkbzZuVTMySXQzNE41Z3g0TEppcllKSEgzWVZiS1hsbUtHYWFuRmMtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘The Supreme Court Debated My Right to Be on the Track Team’ - The Cut",
    "description": "‘The Supreme Court Debated My Right to Be on the Track Team’  The Cut'Save Women's Sports' activists react to Supreme Court trans athlete hearing  Fox News5 takeaways from the Supreme Court’s showdown over transgender athletes  PoliticoSupreme Court appears likely to uphold transgender athlete bans  SCOTUSblogKavanaugh and Roberts are already looking ahead to the next major transgender controversy  CNN",
    "published date": "Wed, 14 Jan 2026 17:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOUG8yYmdsekJlcU1tcTd4VHh5VzhjbTdWRUl1dXFiXzc2SlhYSjRfeVRCMTFnQmhiRWpfZGtUTklqUnF1WnJvQUVtWDU0V3lqRjFaemJtUUwwNi1iOFZsOFNTSzBVUTJydWZ4Z0VaQWROTG41Z2dyaVoyMnpZVFRYbFZXUlZvby04V252RHYwMVZDdmdDeFBiM1Vn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecut.com",
      "title": "The Cut"
    }
  },
  {
    "title": "US Senate defeats war powers resolution designed to rein in Trump - Al Jazeera",
    "description": "US Senate defeats war powers resolution designed to rein in Trump  Al JazeeraSenate Republicans Block Effort to Check Trump’s War Powers in Venezuela  The New York TimesSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNNVance breaks Senate tie, votes to block Venezuela war powers resolution  CNBC2-bill spending package 1 step closer to House passage  Politico",
    "published date": "Thu, 15 Jan 2026 01:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPWHBncENTekhTS3h3R19VblYtNDNYOUpwZkNHZHA2ME9uaWR2UkJLazFPYmw0bG93RzlkR3BwTDVRU09vVzZhQzdYcGtQRGZLX3ZCbUUzUXVHX3NpWTM2LVRJSUkySGhxQ1VTYzNFU0UxMFJVM3JZYnlMZTQ4end2UDJDa0I2MkdYMFFybmQ5R01hMnVaT2xvRHVEaThTajhaQ2djek9VbHhUd9IBrwFBVV95cUxQckVlYW9jV1pWNURRZlZfWEJMd21tbGVHN0JYejRiR081OEd0SExnUnVXdy1sVndPZnFKMUNUd2FXTzIyQllra1JENkpUZWNwX0lnSHhXb1FCM2FMVHNvLWhVLWs5dFZYQW05dHlJaVl0bHUtSHQ1RmhoZXhnU3pfeldDTkplVHZiVm5XSnoweXd0dEh3Q1lTZ0RRdHI1SFBpazh2QVlCY01JWEdXREZJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation - Star Tribune",
    "description": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star TribuneSix Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow  The New York TimesTop federal Minnesota prosecutors officially terminated after dispute over ICE shooting probe  Fox NewsWhat a wave of resignations means for Minnesota’s highest-profile federal cases  MPR News\"Darkest day\" for rule of law: Ex-federal prosecutors react to U.S. Attorney's Office resignations  CBS News",
    "published date": "Wed, 14 Jan 2026 23:59:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNTHlrcWJZajZEZWd5Yk9BdlpSbzZydWEyWUxoRDdhdFdoOW9ScUFhRlg2ZTVWb3ZwRWlYQ0M5eHBYSDUyNHhlU1lRdFdOTGR4ZlNuMlJEQ1FvRkFJMVE2Z1NfVHpwZC1oZnZHTmgtZHotYW1mal91NFc2MWQ4UXBWcWtjell0aVVOa0tTUjBFU1VXWndPWEdKUjFSTm82WmF4cExncUZQUnJXdGZoRFJEYWpFWk5GZm5tUnI0OTh0M3VDc2hPbmUyS2ZQak4xQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations - ABC News",
    "description": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesRep. Comer to launch contempt proceedings against Bill Clinton  The HillHillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry  PoliticoHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The Guardian",
    "published date": "Thu, 15 Jan 2026 01:20:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQcTFXMUdSWFIwZjJUTWV2UG55QTJUU1ZPRGwwQUNTR3MxLXd1VVRzQmFnb2phUGhHRmJRVHFEVmhaUmZlMENfc3c3eTg4c0JsdVhsYXZkM0pIOXE2WDNzc24tSjQ4eWtDcXRHamhUMEV1XzcxeXdGQ29jb2JEb3JwRUgxcG55bTdDeHJabWdoal8tSWpPTHpicmNlMEFxa0JsT2RjQlZKU1BtQkNiaTh0OUlB0gG3AUFVX3lxTFBDUE8wVmNkU3paQlhzRDJONnlMenRfYS0wLUdsRnVGTGU5TFM1ekxrbENfcUNwMWxwMGg3QU5nN3VaaTFzcVVmUmNXeTdFZXlQamYySTFkTGU4bEZrQmROVDAwSGJHUmdtVXQ3enI1djJaNTNiNFFUR1dJcWl0am9wcVYyNk53LS1BX0c1RGRDUXp5RzRyYndoNGNmaUJuQTYzWEswVU5kSlhoQ0VpVXY4SlZTYjVtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Colorado appeals panel appears skeptical of Tina Peters’ sentence - The Colorado Sun",
    "description": "Colorado appeals panel appears skeptical of Tina Peters’ sentence  The Colorado SunElection denier Tina Peters goes back to court after a boost from Colorado’s Democratic governor | CNN Politics  CNNHere’s what might come up at Tina Peters’ appeal hearing Wednesday  Colorado Public RadioGov. Jared Polis considers clemency for Tina Peters as he begins final year in office in Colorado  CBS NewsColorado Gov. Jared Polis on Tina Peters case: \"You can't give the president the headspace on this\"  CBS News",
    "published date": "Thu, 15 Jan 2026 00:53:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNWE5JLVVFZmFlMFFpSjgtakhZRFo0bDc0YmVYS1p6OHBDZHJXV0pJb3haS0lVa1prd1lxQndfdUNsQ1RWYUpsYVF2cXFWbmhnSzR1OEFTNk5qeHMtMGJvMG5RTi0wNjh6Zm9WelN0LWxnZEh1QnRJS05EbXpXZ1J6TmsxcHpPRjA2U1p3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them - The New York Times",
    "description": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them  The New York TimesDOJ wants interviews with Democrats as part of investigation into lawmakers’ ‘illegal orders’ video  CNNDemocratic lawmakers say they’re under investigation for military orders video  The Washington PostSlotkin says she is under investigation for November military video  PoliticoGoodlander says she's under investigation over 'illegal orders' video  New Hampshire Public Radio",
    "published date": "Thu, 15 Jan 2026 01:50:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPUmZEMF9DYVdieWVhQ2hpSXpNcFN6TjFOWUpGR2NLcmVsTjlob0pNNjlGRV9lUXpYSnZwX09lN0M2R21qc1U2dXJreDgzTDB6eXdMTmlNMk41WWRTRkU4VHlpeWpGOGY4enBZdEVDbmR4aUVwaHZSSDlyOGxvSE81NEUzdVEzZ2NKbFBTdkxpRndrQzhVdFpqQ0xDOUY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal court upholds California’s new congressional districts in a victory for Democrats - Los Angeles Times",
    "description": "Federal court upholds California’s new congressional districts in a victory for Democrats  Los Angeles TimesFederal Judges Uphold California’s New Congressional Maps  The New York TimesDivided panel cites Supreme Court backing of Texas’ map to uphold California’s  MS NOWProp 50: appeals court rejects Republican bid to block California maps  The GuardianIn a win for Democrats, court allows California's redistricting plan to proceed  NPR",
    "published date": "Thu, 15 Jan 2026 00:37:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPSS1KSC13eUtrQ1RZaUEzQUE5WXdwWnpSYklXUkl2TExtY19iM0xtb0JRdEhFTHBJYkpnek1PZWo3bU1KZF9WdTlrLVBQUlZmMGp2US1NcUUzTGQtWFdvWlRqN1FhTXNjdWRZVkNUTTlJV1NPalFRMUdHd3dBOC10NTdSWjBTYUliUkUwSUJYb2ZvYTlnbDROcmYwTmdiX2FpUG1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "More students are going to college. Affordability and workforce training are factors - NPR",
    "description": "More students are going to college. Affordability and workforce training are factors  NPRFall Enrollment Increased 1%, International Students Declined  Inside Higher EdEnrollment Ticked Up 1% Last Fall, With Most of the Growth at Community Colleges  The Chronicle of Higher EducationFall Undergraduate Enrollment Shows Overall Growth Despite Decline at Private Colleges  Corsicana Daily SunHere are 3 important areas of higher ed enrollment to watch  University Business",
    "published date": "Thu, 15 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPeHlRcWdGQmJqUE5xaGhHSVlDbVBWWFZuaTdBU2d1SFdDWHVZR3pqVENxMkVvbDhwX0ZSalFQX01LVjVMeUQ0b3Z4ZTl2VHY4UUFBcGh2TXdOcG8wamNzMUJTNHRaVE5UZ1pXMnBLeHRUb05nc0s0Q1B6VXZ3U0JZeHd5RTlfd0Z0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base - BBC",
    "description": "US and UK pulling some personnel from Qatar military base  BBCSome US personnel urged to leave largest Middle East base as regional powers urge Trump not to attack Iran  CNNIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersSome US military personnel told to leave Middle East bases, US official confirms  Fox NewsTrump warns Iran against protest executions as death toll jumps past 2,500, activists say  NBC News",
    "published date": "Thu, 15 Jan 2026 01:31:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1ieTJ3bzRDQmhjeV9OaXpOSXZqeWFBbWNrQTZaeDNnQmVfVjZtM0JRMVRYbjFkVlp2RjFrbjNDMjEzdEFRRXc0YmlIV3NtR2RaQXlZWFJIV2Yzd9IBX0FVX3lxTE5hT0otNjJWZmVzbV84SGtwWjlpUHNOUlh2dHJhZ2FyelU3eGktVXFMLXlVT2liTGZpV3g5cnhFMFZHdDIzS0dTYzhjSFpoXzd5c096RzNvVW9YckQzOGtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "House takes step toward averting Jan. 30 government shutdown - Axios",
    "description": "House takes step toward averting Jan. 30 government shutdown  AxiosView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 22:35:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lMGsyY0tTYmFkWEg0RFVxMGlNZGtzU09QdzdnSEdFaHBXcWdpSXVUZ3B3MUV3a1JvSXBXNWZ0bjhZaVlBSFZ1VExWUzF0S2JGbWY4eGUyd0ZPdEt5S2JKaGluVHhDR0wtTjY3MG5MWmt6aTll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him' - ABC News",
    "description": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him'  ABC News'She was terrified.' New details emerge in Ohio couple's killings  USA TodayBrother-in-law says Monique Tepe was 'willing to do anything' to leave Michael McKee  WSYXPolice chief touts gun link in Ohio dentist murders; records show three 9 mm casings found in killings  Fox NewsWeapons found on the property of Illinois surgeon accused of killing ex-wife and Ohio dentist, police say  NBC News",
    "published date": "Wed, 14 Jan 2026 15:49:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcmhuRlRDanZRNjI3SFR2dkloYmt3cUJSQkRMUmV1RXh6NEVmY01BMDRNTm5BdzVXTHpaVk5xY1RCcVRLci1aS2k2MlNuN3Q5TFFUUXdSa2NOVUxIbWpGZk5zX1dqRXdOVWpNVU5Ua0dRQm4zRG5fSTdJdjJfWTVQcm5May1yNXA1WmfSAY8BQVVfeXFMTk82T3BTRUdtcDN6QVloTFFZNkc4N0h4VlJ6TWh5dDRVZzN0SEpma0JrNERHc0UxSktaaU1yUlJXZmJndV9weE1mWm1rNFRheWk2cmF6QjI0MjZOQlZiT0FFRWFrYVYxM3U4TDBhN2JmNEdTajlVZmtnQjROejlJdWJpY29GYk5rSmxlaXpKTFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Virginia House committee advances 4 proposed constitutional amendments - VPM",
    "description": "Virginia House committee advances 4 proposed constitutional amendments  VPMVirginia House Democrats advance four constitutional amendments on opening day of 2026 session  Virginia MercuryDemocrats launch campaign for Virginia voters to join redistricting fight  The Washington PostVa. General Assembly returns to session with focus on bipartisanship and affordability  WSETAbortion, redistricting, data centers: What Va. lawmakers will prioritize during 2026 GA session  WTOP",
    "published date": "Wed, 14 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdmxqMVNicEc4dFczNjcwSHZWV3BLb1dDdFhlVGJNbXNMcDZwbnZoVHVKaWdYamQwM0lwVTkyZGVuRWtadFJabnFOOXV5QUFfUHd4QzZZUGZ5RWZVZmxONm8wM0hDd1Q2RWRiOGYzbjN6d0loVlZLRzV4aWZkcU4zcjE5d0Fybkl5dmxJWkZoTjFRVi0zN3JabXFuejI5QnNkVGlidEtJdTZBMmV3dU4xRDd4VW9tRTB3dHpEWEp4dWJKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Echoing Mamdani, Hochul Offers Plan for a More Affordable New York - The New York Times",
    "description": "Echoing Mamdani, Hochul Offers Plan for a More Affordable New York  The New York TimesWhat’s in the 2026 State of the State?  City & State New YorkNYers can get free college tuition for in-demand fields  PIX11Statement From CUNY Chancellor Félix V. Matos Rodríguez on Governor Hochul’s 2026 State of the State  The City University of New YorkGov. Hochul's State of the State; Iran \"Prepared\" for War; Supreme Court Hears Arguments on Trans Student Athletes; The 'People's Republic' of Astoria | The Brian Lehrer Show  WNYC",
    "published date": "Tue, 13 Jan 2026 17:09:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOVlpjOGk4T1diaFRNR2xBcnNidThHUkQxY2tkMWdFVV8yYXZLZk9NUmRpVVltS0trd3hIYnhnSC1MOVNNX0FFeUc2RUJKdjZYdlVwZ19nT25kVGJINk54MG1uN1hVU1BOWGZhWklpZEx0S1NnMkFNQ0l3SHJyQWtydVFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Texas breaks ACA health insurance open enrollment record - The Texas Tribune",
    "description": "Texas breaks ACA health insurance open enrollment record  The Texas TribuneInitial Obamacare Enrollment Drops by 1.4 Million as Expiring ACA Subsidies Drive Up Premiums  The New York TimesTexans defy expectations with ACA enrollment  Axios1.4 million fewer people enrolled in ACA plans as premiums spike, tax credits expire  ABC NewsFewer Americans sign up for Affordable Care Act health insurance as costs spike  AP News",
    "published date": "Tue, 13 Jan 2026 21:58:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPazhYQUxxcTByclpKaG5fMTNscGdhdlRlWTA4aGIwbUx0dXRDNzZ5U3R1RHI1OXlTeU50M29fUVVsVTM1UUxSQ1ZFSXhhSjFZTFY0b21uUklvRE54dXFRbjZVSDBHSjNJdjRaTWNDLV8tTjcwQ2ctc0ZDTl9qRFIxdTktZXhsbU5yTjFMV1BOT0p2WGNCRVBTS0NEZTNjNUhRN1dr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "With a tiny majority, House GOP leaders tell members to show up unless it's 'life or death' - NBC News",
    "description": "With a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsEmbarrassing floor meltdown has House Republicans questioning their leaders  PoliticoDemocrat takeover fears rise as GOP clings to slim House majority  Fox NewsThe House Republican Majority Is Down to Almost Nothing  The New York TimesWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOW",
    "published date": "Wed, 14 Jan 2026 23:29:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQRlJKMWxmWEwzTWFHaUZEQ0FrRGZXcTdYbEZhNTl5X200dUFLd09YcEFmSjM0UkJWLVJSdkdwNWhpNDFlS3hFWlNUVklVVmxpS28wa2NkcGpFMHBmQU1kWlF6ZnNiMWpoOEQ4LTJpUGlDTXFzYURjQ2ljMF9rMnBDNzVTRlYyakdNVENhV3RBYjNmS1pqeTc1RGFhSTRGZU5zTGMwazFnZDFlZkgzMmlYLXVNY1BmWDRYRlN6QdIBVkFVX3lxTE4yN0FwX0k1ci1Dd2txakoyY3lVTUVYU0JpMnpPM0ZZRUZVN0REN1NYWkhWSF84VGFpT2ZBY1BCazlIR0VnaHNYeU1XT3pjVWozRVg3N0pB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there' - ABC News",
    "description": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there'  ABC News'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial  Texas Public Radio | TPRZavala County deputy details ties to Robb, confrontation with shooter in ex-Uvalde CISD officer’s trial  KSATJurors hear school police officer talk of ‘mistake’ before Uvalde shooting  CNNLIVE BLOG: Day 8 of Uvalde trial  KXAN Austin",
    "published date": "Wed, 14 Jan 2026 17:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPZ0hodnhPc2hoWkhQN3Z3QVJTTHJSMUlUVXlrd3lKNHdfblNVeURCQ1JGWGZRMW5MaXlzSi1CUlBLemJlMFY1WmdOSnczYlNxWFhxYjhUaFNzRVJtOVpVVS1OU0Ewa0pwTjJqT0ZCdUZ3REkxMGRUYjhWU0NNVDlRaFk2UENRYWxaX2lzZ3BxZXVZc1VVN2JrYmVIWE5lZEZOSXV5OWU0SFE1MWpOWkhZ0gG0AUFVX3lxTE5ERVAtX0J3QzViMHpRUjg1UU9YcG9USHJxWWtRR1FqRV8wX2Mxd1dQVkFxem4xQ3lCSktObmNLVlU4TV9DT2dYVFBlcVVMalNVWmNzVi0zRWpBbFVZVm5wVHgwVDRQR1ZoRGFVaXNjMXpzaEZuR3lqdjlKTjY5dEcyaGdTWEc3bUlrcnVYbGhOTFRuMVd1UVFBaTVabzN1Zk1BYjlhZEJDVnlFWEtYbWh1ZEs4Xw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws - Quinnipiac University Poll",
    "description": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University Poll5 takeaways from new polls of the Minneapolis ICE shooting  CNNNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  YahooMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGovProgressive Democratic women take the lead in reviving ‘abolish ICE’ messaging  The 19th News",
    "published date": "Tue, 13 Jan 2026 17:55:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1sYVJOZTRIcFFwLXFwRDl0ZUgyRDQxMkpXSTBIM01jazhZR1A2YVA3S2cwekFMeG1EenpMQkFENGJOak15T0UwVTJBZGNMSExiSHowa1pabElhSTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "The big bills to watch as Colorado’s 2026 legislative session begins - The Colorado Sun",
    "description": "The big bills to watch as Colorado’s 2026 legislative session begins  The Colorado SunColorado begins another legislative session with more desires than money to spend  Colorado Public RadioTrump factor, budget cuts and Gov. Polis’ final year: Here’s what to expect in the Colorado legislature’s 2026 session  The Denver PostThe bills already in the works ahead of new state legislative session Wednesday  Denver7Senate friendship, shared grief set tone for opening day of Colorado’s 2026 session  Colorado Politics",
    "published date": "Wed, 14 Jan 2026 11:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5oYkh2VUV5dlBDQVZDZVVCM2NNWXVLdUdKYVZSNzh5TmxrN2ZiODhXVEJmZHZ3RE4tUG1mVUpnRy12MUFkcmlLOVBGRk9pdjRRLVo1UjJKcFIzX1JKb3p0M3JIWjN5OWFUYWZhVUtzNzZ2MlpjNDktMDIzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "Cuban soldiers killed during Venezuela attack to be returned - BBC",
    "description": "Cuban soldiers killed during Venezuela attack to be returned  BBCView Full Coverage on Google News",
    "published date": "Thu, 15 Jan 2026 11:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1SNjM0QV9DTl95T3RKcTh6X3JfX3FlZEhYUFNBZ1k2VmkyVmhEM2dhNWdvSTl2bFZ3VUhrQ050eWNXa05WeDJJX0Vaa3hFenVpcUxlM0JMVXBjd9IBX0FVX3lxTFBjMndwbUFtLVNCSlplQnJSYmZkRXVJc3dPVmxKbTBZSE5ELWw1dkFRQVpQYkZzcXN1bmxfMUgtSUxDcGU1cC1zRjh4alhlc1dxemRGTE41Z0ZBSGU5TlRJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Governor Newsom announces early reopening of Highway 1 through Big Sur - California State Portal | CA.gov",
    "description": "Governor Newsom announces early reopening of Highway 1 through Big Sur  California State Portal | CA.govHighway 1 fully reopens through Big Sur after three-year closure  KSBWAfter 3 years of repairs, Highway 1 through Big Sur fully reopens  Los Angeles TimesHighway 1 in Big Sur reopens early after 2024 slide repairs  KMPH'Here we go': Motorists speed through Highway 1 in Big Sur for the first time in 3 years  SFGATE",
    "published date": "Wed, 14 Jan 2026 18:47:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZC1kVERReEFPMl91R09wY2swYjZ6ZGJDTWlLTFY1LXVITm1sWERDSEd0amVxVFBrY2JoN1NPX3Yxd3RYMnlhdnhrdTJwcFhCOEVTcXFoYXpULXV2WURqdlE2cmthVFlXMVFlX1BBM21ZSDlET2gwQTl0MVJjSmpKZnVfT0Vwa1NFVVJ0T1FjcEt3TDk2YUY1cEloUUNzWm5aV1BPdHhLV0Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gov.ca.gov",
      "title": "California State Portal | CA.gov"
    }
  },
  {
    "title": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State - Iowa Capital Dispatch",
    "description": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State  Iowa Capital DispatchWhat the governor’s property tax plan could mean for city and county services in Iowa  KCCIThese words took priority in Gov. Reynolds' Condition of the State  The Des Moines RegisterRob Sand: ‘I would like to see the math on it’  KTIVGov. Reynolds calls for city and county spending limits as part of her $3B property tax relief plan  Iowa Public Radio",
    "published date": "Wed, 14 Jan 2026 02:37:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWC1mYmdQRUgtTW9mSExxTnpLczU3bDZmSUhELWpXRFVrV1pYSGRpSkJ3bmY5aFo3QXNYVW80cmgtdUQ4RDF1QTNldGJmaDVDLVVoZ2t0N09iWGQ4UGxLUVF6clIwSFlyX3lnbkVNRWZVYk9iaDRGWUxhLTVLQjdLczNFTGRqU2dycUV3VTVKU2tuVzFLckEtNC1WNVRpR2puNHR4c3ZsU0dQRFJIYmYzNlNsRkl4TEhVNk1IbEpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://iowacapitaldispatch.com",
      "title": "Iowa Capital Dispatch"
    }
  },
  {
    "title": "Newsom rejects Louisiana effort to extradite abortion doctor - Los Angeles Times",
    "description": "Newsom rejects Louisiana effort to extradite abortion doctor  Los Angeles TimesLouisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it.  PoliticoCalifornia Gov. Newsom says he's blocking Louisiana's push to extradite doctor accused of mailing abortion pills  NBC NewsLouisiana officials seek to extradite abortion provider from California  The GuardianLouisiana Indicts Another Out-of-State Doctor Over Abortion Pills  The New York Times",
    "published date": "Wed, 14 Jan 2026 23:55:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNVFB5dnRyUDRldjhzREZfZDVPR01WQkhGRFhGVXdsaU80bWJYb1hXZHl5SVVJbFQyREQ3NU5KaVNaUnBzeDdRam82UFdPNnlqaGU1NkpIOUNkUlhNSWNaWkpyY0xvTFFEakNjOVNSVUFocFBKdnpPQmpTNW5tbWFUbWdoWWhGQXByZ19mb3dsbHlEMDFPeFZWUzVOS3J2ZE1BR1ZDVXlxOGV6dEFwemREaHJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Bucks County sheriff ends ICE collaboration agreement - WHYY",
    "description": "Bucks County sheriff ends ICE collaboration agreement  WHYYBucks County Sheriff Danny Ceisler ends ICE partnership, fulfills campaign promise  6abc PhiladelphiaBucks County Sheriff's Office ends partnership with ICE  NBC10 PhiladelphiaBucks County sheriff terminates controversial alliance with ICE, prohibits deputies from asking about immigration status  Inquirer.comNew Bucks County Sheriff Ends ICE Partnership  LevittownNow.com",
    "published date": "Wed, 14 Jan 2026 21:10:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5qazVJeDVEMVdGclBZMW1MLU5JemlTcVpzT1l1TnRZNjJRanhfUlBpTlhWcFgtUldVMDVralJwSnI1X1VVUnZGWU5JcnpyY3A4cjdyaTgtRXF1Ui05MXNsdnZHRkJxV096dHlOUk9rQWhwQWpSd0lJSnJfRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://whyy.org",
      "title": "WHYY"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Trump administration opens 18 new probes over trans athletes  The Washington PostBellmore-Merrick schools under federal probe for alleged violation of gender-identity sports participation policies  News12 | Long IslandTrump administration to investigate 2 Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday TelegramChamplain Valley School District under investigation for alleged Title IX violations  WPTZ",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "Scoop: Trump's envoy secretly met Iran's exiled crown prince - Axios",
    "description": "Scoop: Trump's envoy secretly met Iran's exiled crown prince  AxiosExclusive: Trump questions support for son of Iran's last Shah inside country  ReutersTrump says Iran’s Reza Pahlavi ‘seems very nice’ but unsure if he can garner support  The Times of IsraelReza Pahlavi, Son of Deposed Shah of Iran, Seeks Center Stage Amid Protests  The New York TimesWould-Be Iran Monarch Reza Pahlavi Declares a Civil War in Iran  The Intercept",
    "published date": "Tue, 13 Jan 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOW5xN1ZSa0tLcy1INlFYV0U2M2VDVE40NTFPV2RGZ1c4TTh2VFp3NkwtZUtjUmFNd184OXhnZ3hfZjBSaWRIT1ltNXFOUGxUYjJ6ZzJibkdhUVMwWUIxRENxSnA1d1RYcEJfdmxXXzRmRWVVc2NQazhYNl8tc0ZxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump administration says Venezuela has released jailed US citizens - BBC",
    "description": "Trump administration says Venezuela has released jailed US citizens  BBCJames Luckey-Lange Among Americans Freed in Venezuela  The New York TimesInterim Venezuelan government frees at least 4 Americans  CNNMultiple Americans detained in Venezuela have been released, State Department says  NBC NewsWhat Will Become of Venezuela’s Political Prisoners?  The New Yorker",
    "published date": "Wed, 14 Jan 2026 11:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5odGtyOFNNajRyRGxaYzkwcUxvalhPdnZWUXd5c3FYeFlwWEs2UTVaZ3o5aEJoQ2FSNkhVR09HTHRxR3Yyd3NsZ2gwa292bEJPSEY5Q005ekNBQdIBX0FVX3lxTFB5LVJ4c2RqVGhjVXhjYVA0cGNIS0ttQXhYakhEa3J4Y1FRWF9QQUUwakFfaGExYnZBd3QwejVrR0JsaXpUS2xMYU1jdlE4MW1EM3pfaU5iQTM3TVNhZmRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "What to know about the new EPA rule on air pollution - ABC News",
    "description": "What to know about the new EPA rule on air pollution  ABC NewsE.P.A. to Stop Considering Lives Saved When Setting Rules on Air Pollution  The New York TimesIn the Eyes of Trump’s EPA, Human Health Is Now Literally Worthless  Mother JonesEPA says it will no longer consider health costs in pollution regulations  The Washington PostEPA to stop calculating deaths avoided and health care savings from air pollution rules  NBC News",
    "published date": "Wed, 14 Jan 2026 22:53:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9ta3lFcG13R29RaG9RNC1Kb2FsS2tzeURYVm1Od1J6WEdqZ1p5MjN3a3UxbGJFSUFMRW1KNUVVNDNxTzI0N2Exdy02LUVHOU5mRnRGeVAxR0pMUnN5OVhSTEN4RWIwbnJiSjIxMDh4LVNjWkE5OGI1WEh3a9IBgAFBVV95cUxQdndRWlp6OU91SElOVDRjZEIxM3I5Y3BNelowOGhzaVNXbm1qX1hwcDkwS3dqZUQ0ckk2WUJnS1FweTFYd013MVJ5Y19odUEwdHhLNGgzMjFic1h2bVpaMHNYdmVMMFJtancxSHNQU2xwTGxna0Jzd2Uzamh0RE05QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Justice Department accuses judge of abusing power in questioning prosecutor's authority - ABC News",
    "description": "Justice Department accuses judge of abusing power in questioning prosecutor's authority  ABC NewsTrump Loyalist Asserts She Can Keep U.S. Attorney Title  The New York TimesOrdered to explain herself, Lindsey Halligan invokes Jack Smith  MS NOWHalligan defends her use of U.S. attorney title in combative court filing  The Washington PostDOJ says Halligan is still a US attorney, despite a judge disqualifying her  Politico",
    "published date": "Tue, 13 Jan 2026 22:32:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPcGc4dnc5aG1SZ3pGamQwTjNIbXhFZzRLUk44RE5QNDlBR1JEeko2TWloNklGcm1hVFlVeFo1M3hwbnhXTUJ4dkdvVXhGcGZlTHpFMWRzVUhXWktGdklmQXM5eWxfQThiVmRJaWwxQzRpZVF4Qi1faHBsQm50dkpmdi1hS3dsc0pQNzh1SllXOTMtVks5c2ZTb3VwUElETlRfOHdEV2o2cmpsOEpkaFU0TlZnc3NlRFnSAbwBQVVfeXFMUFpDZjhEZVd2cUhBUThvTDlyWWYxMmN2SHRsWmZ3Ukh3dGgzMGFyWVJUSmVFcHdIbTRvdGRzazVFU29wM1FiaXg1VmR4TXU4Y1JwNUVCNklwVjl3QW9SV2FocU5WZVRSSmRXTi1ocm9OdWM2SnhEdGo1bHkzbGswZUs2NDFheV90bnR0RnY0VTdoUEVxMkZUMVBHMzRiaGdZYmdnakpUQnUxTFB4NTZMSkJBMXlLaElTWERqX2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Administration reinstates hundreds of health and safety officials who were laid off - ABC News",
    "description": "Administration reinstates hundreds of health and safety officials who were laid off  ABC NewsHHS reinstates all laid-off employees at workplace safety agency NIOSH  Federal News NetworkNIOSH workers put on leave by Trump administration have been asked to go back on the job, union says  WVXUUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.comC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York Times",
    "published date": "Thu, 15 Jan 2026 00:55:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdHdEUDZVM3RyajVVZ1JDa0dva0VVQXM3akdiYkRtdTRreWJsT2JUTk5yOVBGbTI4bmwtTTJvcHlxWXpRaVRQNFg0eEl4QktUa0wwdENBTVNZc3ZVTF93enJPaGxmejdCYW11Y3BpVXhnZVprdnlWd2lZcS1sbzF2blo4QkM5WmxXSFNwV0lnQlJNVDNMQ0I5S0hNM0tSMmNWdHNVUjhMNXFfQWlqTm9UVnhR0gG3AUFVX3lxTE1ZZ3VqQlRBVU1vS3BBSllrNnNibFdPSm1leWc3ZmZnZnZvai1oWnpzdFQ0Uk9yeXNzbmloT3p5d2N5N2lGWDZPRUlmXzZGd1ZvdFAxOWRrcU1OdW54WnN0WXZERzFGc09aY1d5QkdJY3pyYldrOXJuY0NhdEFuY0xIZVR3QXRBMnkzcDNHQ0YzWFNjQ3pFbFg0Smp3QS1fRVZpOXozRkNQclJHejBXelk4Rkl5MzFqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Man caught on camera saving 2 toddlers on Florida highway - ABC News",
    "description": "Man caught on camera saving 2 toddlers on Florida highway  ABC NewsMan runs into Florida street to save two young children who wandered away from rental home  Fox NewsWATCH: Man rescues wandering toddlers from middle of busy A1A traffic in Brevard County  WESH‘Terrified’ stranger rescues pair of toddlers who wandered onto busy Florida roadway: video  New York PostGood Samaritan rescues toddlers who wandered onto A1A in Cocoa Beach  FOX 35 Orlando",
    "published date": "Wed, 14 Jan 2026 23:29:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPbkxDc2JnRFdfa0tFZGszejdWajdXQXhmR0diWlVoQ0FKTGd5YkFyQ0Z5WWpJYVZkMV9SdnBlcnlPTEpnT28tOWhuWHlLY1hhOFYzOTY1bWZ2M2pkRl9PRmhWamRXNmVBelE4ZXVXNGsyd1B0dEpJbGdJQk8ydzktaC1VTGxiTEdSXzhLMmxfczNQSkJaVDdkOEFZMlZ6ckgxdHFwTGs0c9IBrAFBVV95cUxOMk9IeExYRlNJeVVsYnpWQWdRV255RTFLYWJBZnZhMVRqaHlrcVdGS2lTWERJaGhOZDJWdkxOWWpVbDM5SnRlV1NwTW1xRU5sdjZPc3VuQXNsbVhBVENtenpVcGk0eFBXTGdDeTYxY2lxT2ttNElEUGFnM05LQ29aRFdlTlZjdDNmYTRIdzBGN1BFRGUwbGJiUUg3X2lmWk1CMmw3Z2o2eFpoTUpj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "E.P.A. Moves to Limit States’ Ability to Block Pipelines - The New York Times",
    "description": "E.P.A. Moves to Limit States’ Ability to Block Pipelines  The New York TimesNew EPA Proposal Would Strip States’ and Tribes’ Authority to Block Oil and Gas Pipelines, Other Infrastructure Projects  Inside Climate NewsTrump set to limit states' ability to block energy projects in water rule  ReutersE&E News: EPA plans to curb states’ Clean Water Act permitting power  POLITICO ProProposed WOTUS rule could ease federal regulatory burdens, but questions remain for states  Brownfield Ag News",
    "published date": "Tue, 13 Jan 2026 17:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNU2NHRnRPQW9iZDBCdVREbUVkaWZRSTBRdHlaNHJGdmt4VURacWU3SFNCNklWVTdhc2VnSHZKbDNxbEZ5LVlKblZfTVVZdDJRRzZHc2d0ckg4Y181Y1BZQ0hTaHhxc0d1UlFzWE5yRjdBaDRQMkF2eWRXUFp6bW9vUTln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos - ABC News",
    "description": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos  ABC NewsMidlands state lawmaker, Freedom Caucus member writes letter of support for ex-SC Rep. RJ May  WIS News 10Ex-lawmaker who advocated protecting kids gets 17 years in prison for sharing child sex abuse videos  AP NewsJudge slams ex-SC Rep. RJ May with prison term on child porn distribution charges  The StateRJ May sentenced to over 17 years in prison  WSAV-TV",
    "published date": "Wed, 14 Jan 2026 05:45:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOVDRvZVdEb09JSmVLcm5yUDhPTTJFN1N2MWR0MzJxTElOcWtTR2RUclVVTWZYNWU3NWZNb1VLVURuNUlmaThibXBvdmFveFZyaTg2Y3BaNkZrRDEtV3ZYa3pueTRYaGllTXpKbHNXbkl1SUZKakdoYlNUWFhIV2ZOZ21fbXdzcENkLTFEclpyZ1dCRDdiRTR1bFpMZUVTYTYyOVRIQWxsUzNKQdIBrwFBVV95cUxNbWRuUjBzS1NycEM5NkVFZkh4TlozcVBRdFRPenM4d1NEb2VKQWU1cHQwbmdIM2NiV0hySy1wWUNYSFlDYTBkeDRfVl9aUVp1Q3VldUNFamxFQ3R4cHpXMzdtU000NEI2VllhbUFJZURhNllQOGtQOVh5LVhQOHllTWFyaDdCOUtzUE9qQ2VNZDhCanRxUVdwYXlKOFlKaW55Q1ZyUEdXRktjTEgzVzlZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax - Missouri Independent",
    "description": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax  Missouri IndependentQuote du jour: Kehoe's state of the state  AxiosGov. Kehoe asking legislature to have Missourians vote on phasing out income tax  Spectrum NewsGovernor's budget calls for major cuts to spending as revenues wane  Columbia MissourianNationwide Tax Competition Heats Up as Missouri Governor Calls for Zero Income Tax  Americans for Tax Reform",
    "published date": "Wed, 14 Jan 2026 01:35:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPSTRGZ2s2RXRzMlNOWUpUa3pUaXdVZk1ab2RGT3B3NGFKeWFxU1U4YWxxRV9DMFYzbEZkWjByQ3hUS05XTVZCaUF1QnllRWpZWEpDVHk4MVVPcHNWLVdTR1ZDQmRHMDRUdTNyWjkweGpESjNGTFRVMlZwLVE1VzBldXozeFNqTDBnVEYyN09iNUJCekdWVjNxQ1A2M2VDOXpWOUtFRWtEMExyY1hpYXBWVm41bVRuQVNZTXhxbWN1aEQ3TXE2eEVPcFlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://missouriindependent.com",
      "title": "Missouri Independent"
    }
  },
  {
    "title": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention - ABC News",
    "description": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention  ABC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 07:14:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQTUxMLVI3eVZRVS0zWlhhcU1HYXc1V0htZXNKa0E4VGw0blM4RG1qVE9tZFNuVGt0T2kyRnViVk1ibkVDTG5TNGdyUFNtVl9vTUUxSFJzdzU2Ynh0QnZJeU91akE2OVRoT2ttQ18wcTBCM24wZzZFZ3dLdnh0bnZkRkFQZzJMUjNhcENUS0pQZVk5MnJ5Ny10UXNuUTVjajRvWXZndUpVTdIBrAFBVV95cUxNUEFBbEJBd090c1Y0LVdnd0dHSkhseUlwOTRPZk9CdlM5dS1JRk9ON1ZiakY2RVd4UUQyM0FQNzZZVHlzY0psc2ZDeUExNHJPcXlNcV9neVRJVE9NWnVUelRtNE1sOTRDeDJTZWlkNFBOWWduc3hLbDZSd2R3d01IZXBveHZlOWV4UmxRV0ttc3JWOTFfSmJSQnJyZTJZS1hpcU00eFRFNXZOWWlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Why unlocking Venezuelan oil won’t mean much for US energy prices - The Conversation",
    "description": "Why unlocking Venezuelan oil won’t mean much for US energy prices  The ConversationU.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesHalliburton expects speedy return to Venezuela and plays down risks  Financial TimesTrump says US is taking control of Venezuela’s oil reserves. Here’s what it means  CNNExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Tue, 13 Jan 2026 18:39:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNQlZwbklfZW84Z1VyYzJLLTc1S3gtcUNWSC1ETjE4NlUwdXZDQ0VPREVvLWlXVk9CZFJHTkVZMDNPazZvVlRIWlBKcjNmRWVrS0VNODdITjhWWFRrR0ZOOEdObWY2UFM2cXFuX2E1S2l6SkZ3Z1lDNHZqMWYzdDUwSU5OZ3k1LVhSWi04Qm9BUzA5UkdRVWN0R3VrQTJhMVRi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders - WPR",
    "description": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders  WPRWisconsin Assembly passes bill to criminalize grooming  Channel 3000What to know about child grooming, E-Verify and other passed bills  Milwaukee Journal SentinelWisconsin lawmakers vote on affirmative action ban, other bills  FOX6 News MilwaukeeRep. Palmeri: Statement on first floor day of 2026  WisPolitics",
    "published date": "Wed, 14 Jan 2026 01:22:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS1hYZFdWLWJiR2p0dnZzT242REtlRDVCWTRUeWhVTWFUMFM3OTQxSUVKNXlaRERLMmtxVGlFdEVQcnJMbjJrZkJuSkw4UFFrNFRLTDVZYzRHS2t1aEpmak1xRlZtMVhDR2dNWDg3OTFQUFFleDFXSGw3V2lnS09SclpWSWZPS1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wpr.org",
      "title": "WPR"
    }
  },
  {
    "title": "Who is Erfan Soltani, Iranian protester whose execution was postponed? - BBC",
    "description": "Who is Erfan Soltani, Iranian protester whose execution was postponed?  BBCIran Says It Will Not Execute Protester Amid International Outcry  The New York TimesIran claims shopkeeper Erfan Soltani, detained during protests, was never facing execution  CBS NewsIranian Protester Set To Be Executed Despite Trump Warning  Time MagazineLive: Iran protester won't face death penalty, judiciary says  France 24",
    "published date": "Wed, 14 Jan 2026 21:39:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ycEdHaHlWd3A1a3VVOEVNOWVpYTVXUG8xdjFOdk14M3AzNjB0U2xnZE0xbDY0MXhZOHlWVU1JTWs5MGdsOUF0YVhCR0lTWEJBYjNYTERhcmRFUdIBX0FVX3lxTE41UFZULTVGeU5jVUFPazNwbDUwRkRYWWNZbHdHbzRmWHRPOFZ3QU9xSlRwMmlveG9WazVLaDJwRWl5UkpTS1ZvYy03Wmswc2xPQjQyNUpDcFJyYmx1OU9r?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival - The White House (.gov)",
    "description": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival  The White House (.gov)Trump in Michigan for speech to Detroit Economic Club: Watch replay  Detroit Free PressHere’s how Michigan voters feel about Trump’s handling of the economy, according to poll  ClickOnDetroit | WDIV Local 4Fact check: Trump litters Detroit economic speech with numerous false claims about economy  CNN‘It’s literally terrifying’: Hundreds protest in Detroit amidst clash with police, Trump supporters  MLive.com",
    "published date": "Tue, 13 Jan 2026 22:23:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQcUNTVDhuamswRjdtUEJka0Z2b3JzVmo2Z3RqWXRqem5DdXYzanBVX0VTWWdlNksyZTZpNUJMZVNuazA0U3NuZUFMYkVNelhHNlZTZzk3OWV5dHZlOXZuRUdBZzMxT3dRT1NIblg5NU4xSHZGWURXa1Y5SnVVLXR3VFlnNk5vb3VVY0ZfVU5vem4zQTdEX2lQMmhNdEJvdXRMdVJqZmo4ck10UUUzMDB2Zk5hYTMwdmtxR1gw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Immigration Detention Expansion in Trump’s Second Term - American Immigration Council",
    "description": "Immigration Detention Expansion in Trump’s Second Term  American Immigration CouncilDaily Briefing: ICE detention centers are booming  USA TodayFour migrants die in US immigration custody over first 10 days of 2026  ReutersICE Detention Expands Dramatically; 70,000 Immigrants Now Jailed, Deaths Increase  Democracy Now!Man dies in ICE custody after NJ arrest, cross-country transfer  FOX 29 Philadelphia",
    "published date": "Wed, 14 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5DdGwyR2ZLVE5jT2tZMWtkRXpER2E2ZUlnSFp4WS1JdUdVUVhhNldoZzd3bW1RdElfQzY2bXdFWFVieVFfQWI5VGd2dXY0TUVoWHBMcHJGczNseTlkdE9NYXJDTzI5eEFySXFZTDJIckdWREMteEZ6MkllTkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.americanimmigrationcouncil.org",
      "title": "American Immigration Council"
    }
  },
  {
    "title": "ICE Arrests Criminal Illegal Alien Employed by New York City Council - Homeland Security (.gov)",
    "description": "ICE Arrests Criminal Illegal Alien Employed by New York City Council  Homeland Security (.gov)DHS exposes background of NYC city council employee after Mamdani fumed over arrest  Fox NewsICE Arrests N.Y.C. City Council Employee at Routine Appointment  The New York TimesAnger Builds Over Arrest of Venezuelan Council Staffer As New Details Emerge  THE CITY - NYC NewsNYC Council employee detained by immigration officials in Nassau County, speaker says  Gothamist",
    "published date": "Tue, 13 Jan 2026 23:33:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWDBwSGcyMGNCWkZvUklodGhza0Nqc1RPaHBvQTlKRUV0M2IyNXpfQUtNMmNKN3pLN1RRT3RmMkpIaFNTaVcwVU5JZkdFYU9sU1NYd1NRYzF5ZG5lWTJNQWo3MmQyMmdEb2JGUlNwbDl4LThwdnhydVJnUEdfdEVucUtaRkNVTjQ4dVFPMHo0TjZ3cEwyZVcwQ1RiZTNLZ0pfZzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation - USCIS (.gov)",
    "description": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation  USCIS (.gov)Trump administration to end legal protections for Somalis, making them eligible for deportation  CBS NewsTrump administration ends temporary protected status for thousands of Somalis in US  Fox NewsTrump administration ends temporary protected status for Somalis in US  The GuardianTrump Administration Will End Deportation Protections for Somalis  The New York Times",
    "published date": "Tue, 13 Jan 2026 17:48:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPcWdVSmYxUUx0U3pNamF4WkdDMlZjTWVpcE94cUdSSTVNeTAzYlpSMEpMal96LXJtanRybVJFVFRiSXVFV0tnQ3JXQ1NaLW1XTjJBMVB0RGlEaHpMUlVyQmU0MnJQbkpJZlVaUHlqWG5BSl9EZC14LWVJdlp0bVRienVGREtDZmtWa0cyTW83M3ZzOTYtbHU2U3V2cU5MaEpzTlFza1dyR1ZQRmp2bmhEVld4SnNWZXpXS0V3X2hB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.uscis.gov",
      "title": "USCIS (.gov)"
    }
  },
  {
    "title": "Ferguson delivers optimistic WA State of the State, urges action on key issues - KOMO",
    "description": "Ferguson delivers optimistic WA State of the State, urges action on key issues  KOMOState of WA: Ferguson drops maverick tone, backs income tax on the wealthy  The Seattle TimesGov. Ferguson says his budget proposal is 'laser focused' on improvements  king5.comWA Gov. Ferguson calls for millionaires’ tax in State of the State address  FOX 13 SeattleWhat WA Gov. Bob Ferguson said, and left unsaid, in his State of the State address  Washington State Standard",
    "published date": "Wed, 14 Jan 2026 00:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugJBVV95cUxNT2pWdHpIZjhxb215MnpuanJtMUFVektwUUZmeTAxRUdmU3FZalVHcTgycWJ2eFFscXItUUJWZlBIcHFHbnNSZVN0azVwNjI2Z3NLRTlyUG16QTJfNFc2YnpzZkJ0cTNkdTNPbGZBY2lDa0ZENFdaMGsyNHQzb0s2bzh3NDI4QlNOOXlXVUpZWjNoNzRTVFVmZFEwSktkU2NGYURBUmxVQnoxOUpiZkMySzJ6YlpybnhlLXJNQ0dRYlRQWmc4MXpadTJuZmNvSmxmSXMxaVBURkt2R1dvRnMyaTJ6cFRPSE9FZkNhVWgwaXJMZDdsTGJmZ1pnY3NzanB5Zy1yaWgySUI5QlRjSE4zMUx3NW1TcWRpUHFXX0VqU3AwWHJxTVVOenZKNU5uRHRaSFdGb1BTS2lMQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Claudette Colvin, US civil rights pioneer, dies at 86 - BBC",
    "description": "Claudette Colvin, US civil rights pioneer, dies at 86  BBCClaudette Colvin, Who Refused to Give Her Bus Seat to a White Woman, Dies at 86  The New York TimesClaudette Colvin, US civil rights pioneer arrested for not giving up bus seat, dies aged 86  The GuardianClaudette Colvin, who helped spark the civil rights movement, has died  NPRClaudette Colvin, unsung civil rights pioneer, dies at 86  The Washington Post",
    "published date": "Tue, 13 Jan 2026 23:09:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1KcW5BUmZkaTBvT09SRkpmSWYzbEswTHFaaEhBTFlLMjl3bDdBbWRZRTg3alU4WEJZdUZDdHUydEEtbGhEdzdqbUZlUTZaQTFfY2hjaTQ0T0VnQdIBX0FVX3lxTFBDei1rd0R4S24zZzFGZDIyZmNNeUlHWklZTzRnaWJLVEZxY2R3RVRYTW5PV1dBTUt6RkwwY0FJV01Md1UyNF9RaEx4N09KS29lX2x1eFZ1Q3hMcmlLYjg4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors - NBC News",
    "description": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors  NBC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 08:58:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQOWZjOFI3RXBOel9qMEJGWnFrbVBnbW8xM1pHQjJxWVRVM3ZSWnoxTnk0LWNLbF9VT1BXZWFvaF9jWHVNSnZiVDNJbVp1ODIxSmFuREpHcTQ0WTQwVnZPVENkRTlZOE9MMVhLUFNuVlRsM3RWZkZWMXpiNkRIZjVTa29kRDFVM2JocEJJa0Q1bDdYWmJDTVJQNmRlaElLaHNzWlJBMk1JSXpuNW1EMzRVaEtUZVJaMEEyZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "States Race To Launch Rural Health Transformation Plans - KFF Health News",
    "description": "States Race To Launch Rural Health Transformation Plans  KFF Health NewsEverything you need to know about Montana’s rural health windfall  Montana Free PressDPHHS gives lawmakers updates on Montana State Hospital, rural health funding  KTVHIs the $50B Rural Health Fund Enough to Save Rural Hospitals?  Health US NewsProspects of Federal Clawback Loom Over Rural Health Funding  State Affairs",
    "published date": "Wed, 14 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQaEtZek5MUS1tNDNUY09WaVRia1VsN0JLTFBCU1ZKdkc4NmFsZC1xSDQ2TjdQempKUFlfUFh5VDRJUEREUEtqcGF6T01saHZJNXRNeTVQUlh0TmlISkUzOXNhMU8wZ1ZQN0RYbnlzTlNubVNWNFJXR1BoVUN1SXBXTHU1S3VtTUJQZVYxWm1Ycld1THlydV9SRzh2VmlGUE8xZ2JsZTI3YllpNG5RenlXdEVVNUtyQ1hpOEVLd0JrclA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kffhealthnews.org",
      "title": "KFF Health News"
    }
  },
  {
    "title": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity - The Columbian",
    "description": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity  The ColumbianMadison students walk out to protest ICE enforcement  Channel 3000Madison high school students walk out, protest ICE actions  WKOWSpokane high school students walk out to protest deadly Minneapolis ICE shooting  KREMMadison students walk out to protest woman killed by ICE agent  WMTV 15 NEWS",
    "published date": "Wed, 14 Jan 2026 02:32:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQNmlMbkVnLTJKalNOME9YR2VQTENlSXozN2piOGlfMlBCRHlmb2dKcHVVbEVjQXJ3OWllVnAyb29PZjZ3UXZ2cXl4SUl5d0xkZWREaERkYng1UWszc3lweE1RYnRTWjJJaGJjTUwxLXhoSjRaN1FIeGljYkx2MlZ4UGRSbjQ2dlJ6RGg1V0x6ZHZIVUtuczhVS0pqWVdWSU5jWHRuM0N1bWRsY2FRemVXOGxaa3dvSmRfdndKUEp2SmJVbWJGN0FYdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.columbian.com",
      "title": "The Columbian"
    }
  },
  {
    "title": "Proposed ban on police face coverings gains momentum in WA Legislature - Washington State Standard",
    "description": "Proposed ban on police face coverings gains momentum in WA Legislature  Washington State StandardOregon, Washington consider bans on law enforcement masks to conceal identities  KATUWA lawmakers move to ban law enforcement from covering their faces  The Seattle TimesOklahoma bill seeks to ban masks for local law enforcement in immigration operations  KOCOWashington Senate debates bill to ban law enforcement from wearing face-concealing masks  KOMO",
    "published date": "Tue, 13 Jan 2026 23:59:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQSTl5bjFJVUE0cExobjY4eFZ5U09WSWRjQ3JGSEgtQzBERHJib3phQTdzS3FqTVdEaXVraG1HWXJONm1ybWJZYzR2dGlPV3ZTZk1hQ09TdzJzV3VMaFJwRExzNTA4S0dTbkVhVVhvc1Zrd1F4NV9pd1IxZmg3NnNhcWVQYWFXTEV4eHdoVnBjWXdZZmtoSzUycTZya0d6ZjdEOXc1WFhXVkRPNEJBR082eURrSklmNWY5Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://washingtonstatestandard.com",
      "title": "Washington State Standard"
    }
  },
  {
    "title": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families - SF.gov",
    "description": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families  SF.govSan Francisco Expands Child Care Subsidies to Tackle Affordability Issues  KQEDSan Francisco to Offer Free Child Care for Families Earning Up to $230,000  Bloomberg.comMayor Lurie rolls out new affordability push. Here’s his first move  San Francisco ChronicleFamily Opportunity Agenda: San Francisco promising free or reduced cost child care; pathway for students to attend college  ABC7 San Francisco",
    "published date": "Wed, 14 Jan 2026 17:08:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNSlNxT0lHOTA5N3lkdVJldW5oNGVUZFJqWVV1MVlnUHpZVWRkb0hhVWZzd1R6X21pejBRYi1JWnpTZjN5ZEx6OWFVbzV0a2JaMkdmU00wbzM2MlFoV0pOYTFxN3VJdFExdmRNcTk0T1NZUkJ4bjNfczBXRS00V3hTdVZFNTFaVnIwT0owdTZ3TWNYeUhGV1NjTUFTZXd3Umtmc090NjQ5Zlgwc1hSSGZYeG5BRllyMXFOVVdNWFpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sf.gov",
      "title": "SF.gov"
    }
  },
  {
    "title": "Vanderbilt University to establish full-time academic campus in San Francisco - Vanderbilt University",
    "description": "Vanderbilt University to establish full-time academic campus in San Francisco  Vanderbilt UniversityBooming S.F. neighborhood will be home to new college campus — a blow for downtown  San Francisco ChronicleWhy California’s Oldest Private Art School Is Shutting Down  Artnet NewsPrestigious university to open new campus in San Francisco  SFGATEWhy a 150-year-old Nashville university is opening an SF campus  San Francisco Examiner",
    "published date": "Tue, 13 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNeVpVd1F3aWJ6M2VYYlpKMENZQTdmemVIMnJUZDcxZW5HZ19zam1hU2h5OGJEX2Ywc0prME9qcm00MU9UZFpVNWFQM0ozSHp6R3dTVmNGQ1NFUU1hTWZ2NE45VEU5NFpoYXpvUVpUN3p3VzFobDBQQ1liX2d6UW1CRkhXWXAwNEhmb3dYY2VaS2dOQ05zMU1LRElLWVdJeVdCSFlTSmhQX29obThJMFlMS1ZEZHcyUFZu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.vanderbilt.edu",
      "title": "Vanderbilt University"
    }
  },
  {
    "title": "24 members of Congress are 80 or older. More than half are running for re-election. - NBC News",
    "description": "24 members of Congress are 80 or older. More than half are running for re-election.  NBC News",
    "published date": "Thu, 15 Jan 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMGt3LXdRZjViRUtvaURGVmNOZHF5M0Y5RndINXdTMEg4RUFjNkF2VFhjVnd1c1ZXTUozOEl4LUF4LW5nUHhPUHdwTXBFREhDRkNnbWlMZzI2bk9LWEFvQkVwNThrSmJCVlRxc0dJUGtxMmpIbmNYUjRWWEk3Q2pRYmpnTUx4NTcyOXNIOE9aZHphNkhNYjZ0ZnhUb9IBVkFVX3lxTFBsNWR0VTZDWE1KRDNtbWp6WUVwellSWUlxVXZjVHctcEI2OURjeGMtaGZlM3F6NTVKRU9KTGdCX3I3ckk2cHVSLTF2MHBLYUZyU3BDV0ZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Fire displaces nine units at Atlantic City, New Jersey high-rise; residents recount evacuation - 6abc Philadelphia",
    "description": "Fire displaces nine units at Atlantic City, New Jersey high-rise; residents recount evacuation  6abc PhiladelphiaFirefighters battling high-rise condo fire near Atlantic City boardwalk  NJ.com12 people displaced after fire tears through Atlantic City apartment building  NBC10 PhiladelphiaHundreds evacuated from Atlantic City, New Jersey, high-rise building fire: \"It's organized chaos\"  CBS NewsOccupants of 12 units displaced by Atlantic City high-rise fire  Breaking AC",
    "published date": "Wed, 14 Jan 2026 11:37:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNNTJQSVpzRXNLRU9IU2didmdXMTBxSmROaWNOYmlNWUh3SFFpVVZkV1ExTnBjN2xFckhHeGVFUktmbF9ic3FGWEpOYnFmWGEyTXQ3ck1vSkFWTDAtaGFldXBycVgzeGJRcUNiekRIZ1NERW50cjRMdWRIR1hwdDNWci13Mms0cU1tRjZSTm1XeE1vemlaNEs1VXl1QnM0dS1YcVJMQzdaTmpPcUEtUzhCTWNSV1B4YkRlc1pwUlljeWtubmxkRHfSAcsBQVVfeXFMUGFna2hvSTgtYXlKdGpDVWRuZFZZSXk0QXJLamJLaEZBcFVjZm9oVk83MlJCaFdYM05TTmkwQmtwdlpKVWg2UDROeVc0cWlPcjJnTGw5UXNkU1J6VkRYMlNEV0w5SlhSUGJFSVQ2Y2JQNU1LaFpuV0pHNUtCRGdZMGV5RXRXNjlnU25Wc2F4d2pEUFU0LS1lU3pOUXoxOVc5OGRDWi1wX08tMk5kbk9EdEd1Q0ptRWxxa3dlYkMwblZZdkhOcXp1S3BXdW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://6abc.com",
      "title": "6abc Philadelphia"
    }
  },
  {
    "title": "The Costs of Using the Name \"Department of War\" - Congressional Budget Office (.gov)",
    "description": "The Costs of Using the Name \"Department of War\"  Congressional Budget Office (.gov)‘Department of War’ rebrand could cost up to $125 million, CBO estimates  CNNRenaming Defense Department Could Cost Taxpayers $125 Million  The New York Times'Department of War' rebranding could cost as much as $125M, hundreds of millions more if it becomes legal name: CBO  ABC NewsRenaming US defense department the Department of War could cost $125m  The Guardian",
    "published date": "Wed, 14 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiTkFVX3lxTE1EYm9xanNqSFNBTFRCSUJMNWhRNEJaTVRJZjVVOWJrUnlPUjFSUC1mYjVIMlE3enJ0OTVSdXZLbGlwcm5xVFBMbUlpaDd4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbo.gov",
      "title": "Congressional Budget Office (.gov)"
    }
  },
  {
    "title": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants - The Conversation",
    "description": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants  The ConversationA Texas A&M professor pushed back in a course review. His class was cancelled.  Houston ChronicleOpinion | An ancient Greek philosopher falls victim to campus culture wars  The Washington PostOpinion | This Is No Way to Run a University  The New York TimesTexas Sends Plato Back to His Cave  The Atlantic",
    "published date": "Wed, 14 Jan 2026 13:30:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNWGNBMmIybFR4RGVGQ1VMSVNXamJTTDY0U0lKT2xvMmcxZmxOZ2pqLUFEUWwwdnVXdzVaeGNsbmw5T1JYT2VYYUZkU2x1R3VvUDVDejRmVmlNRkNCaTYzblNqdVRuZUp2TXJVLVlVLWc5TUhwUjREalk0YllVRGtqRU03RklUcVhfUnJRZmk0c3V0V2RZblJQaVlYc1FERmtWT3M0NHJGYm9XVVM1UUltQ0YyRFRJSTZ2M0ZBUmlnWmo3TWZ2NmVJbmRPY0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Trump's mass deportations are in big trouble - Axios",
    "description": "Trump's mass deportations are in big trouble  AxiosRadical Rhetoric by Sanctuary Politicians Leads to an Unprecedented 1,300% Increase in Assaults Against ICE Officers and a 3,200% Increase in Vehicular Attacks  Homeland Security (.gov)Opinion | ICE Is Waging War on Blue Cities  The New York TimesThe violent “randomness” of ICE’s deportation campaign  vox.comMoving cars, panic, gunfire. Immigration shootings fit growing pattern  USA Today",
    "published date": "Thu, 15 Jan 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9wV1BhUnRWY0tNZjExMnRGVHdsOEZyT3VLeXE3TFVwOWN2ZEJQenk1OThPdkZaTVNOVXJOdjBnWGl6a3gyVTB5VHpHY21DalBnWDk5MkJfdXhUa2d2bmhQSDM0TjlBdC04cDVwZHN1WG9Wa2dIdk53c3Q0eFczUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds - Department of Justice (.gov)",
    "description": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds  Department of Justice (.gov)Casa Ruby founder sentenced to 33 months, $950K for wire fraud  NBC4 WashingtonOnce-revered trans activist Ruby Corado gets prison time in fraud case  The Washington Post'You betrayed this country' | LGBTQ activist Ruby Corado sentenced to 33 months in federal prison  WUSA9Previously celebrated transgender activist sentenced to federal prison for D.C. nonprofit fraud  Advocate.com",
    "published date": "Tue, 13 Jan 2026 21:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQMmIxOWFLSWtrMWplZl9NRW1EYkQ2UUI3czBqbFNZNGFlSGFNRTcyLTVuczFvVGVsYkpVbnNwLUdRc3d1U2ZOSm04NVA0aXF4X3Y0b1FMNEl4ZzJ6blR2cl9oMnoteGxCOUNETGZQV0FLaUt5cWV4QmxMcHNlUGI5aUltU3k2YndlNmZtWlVCeVFOQ0RtakNlRFFJbEdrSWY4RFB4d3VacmlFc2ZueVJheThiTUdIaWl1MVBoYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Metro Detroit school closings, delays: Check the list for Thursday, Jan. 15, 2026 - ClickOnDetroit | WDIV Local 4",
    "description": "Metro Detroit school closings, delays: Check the list for Thursday, Jan. 15, 2026  ClickOnDetroit | WDIV Local 4School Closings: List of closures across metro Detroit  WXYZ Channel 7Hundreds of schools in Southeast Michigan closed for Thursday due to heavy snow  CBS NewsJackson-area school closings for Thursday, Jan. 15  MLive.comSchool closing prediction for Thursday, Jan. 15  WOODTV.com",
    "published date": "Wed, 14 Jan 2026 22:28:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOaU1lSkJlNDRtT3pETTRjQng1QUhXTm54OFdPYk1DanlsUjJLZ1BSWWcyd056TUJiTjZQeGFnYTNwV2NvbmhMQnNkWVhSaUpMYnNiR2hSVW9hNkZSUHpzRmRQOENfczVRSXRETm90dFgyRnd3S0o1amQwN3JZd28zZ2tpYklPbWNucy1ZaGVsSnotVW4xV1duSTVNZWF0c1FiV2hZWG5WcFVzYXFwd0s4LXNaSHRJcWNpMWczTnAya00wX19naFNOUzlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.clickondetroit.com",
      "title": "ClickOnDetroit | WDIV Local 4"
    }
  },
  {
    "title": "Arab governments believe US-Iran tension ‘de-escalated’ - Financial Times",
    "description": "Arab governments believe US-Iran tension ‘de-escalated’  Financial TimesTrump’s Gulf Allies Do Not Want Him to Bomb Iran  The New York TimesIran’s Gulf Rivals Warn U.S. Against Strike on Tehran  The Wall Street JournalQatar warns U.S.–Iran escalation would be “catastrophic” for the region  IranWireUS-Iran tensions have ‘de-escalated,’ Arab governments believe  Financial Times",
    "published date": "Thu, 15 Jan 2026 12:41:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9xM29CWTZPR21vT1pFZGpOaUlpdEw0VjBKMjB2T2xUc21iZHNCZll0Qm12cUROaTVxRzlRZHY4eW5zMGRNeklvWDM5X1YySmgzdk1EUkNsTlNsUGJtdWQtVkZOZEFMNk5tZ0pWTnA5SzY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Best friends die in Florida after sand hole traps them underground: Sheriff - ABC News",
    "description": "Best friends die in Florida after sand hole traps them underground: Sheriff  ABC NewsTwo teens dead after hand-dug tunnel with 'sugar sand' collapses in Florida  FOX WeatherCitrus County family of teen who died after tunnel collapse donates organs: 'A blessing in all this tragedy'  FOX 13 Tampa BayCelebration of Life held in Gainesville for 2 teen boys after sandpit collapsed  WCJBChild dies after tunnel collapse near Citrus County park  Bay News 9",
    "published date": "Wed, 14 Jan 2026 16:53:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdGlKYnA5Z1Q1U20zUDJRMW1qNDc5Q3Vka0xFaTJFbG9MTjA3aG5xX1VZZWFHT0s2cUZ1WXdIWG5YVWlNSnluMnVOQmtUMzFTWmhVT3ZIMmtIQWcwRjdvcjM4MEdrRE1lUk5nMS1nRHRpR05JRG1tTWMyNm1ydV9lYmJ5Q1NSeTBycV9ELUxWQms5MWhvdUHSAZsBQVVfeXFMTTI4YXZtNVViMTBoSmVWX1B1SmQ2SWkwYVUtSUx1Y0JRRlZrWkJqT1JpUDJGYzBfN0JtN0RXdkdRYnZOMWNXSVpCUE1zMm11aVYyaVVPSml0eDBCeGJOSnlhcEJyclZ3T3ZXZjZNRGk3Qm9DVlFCTE9UY2ZDRnhnUVpSNmZOcVJ4cTRPbmc5bUQwZHVkN1l4aFp0bGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  }
]