[
  {
    "title": "8 dead in Tahoe avalanche; victims include moms of Sugar Bowl youth team skiers - San Francisco Chronicle",
    "description": "8 dead in Tahoe avalanche; victims include moms of Sugar Bowl youth team skiers  San Francisco ChronicleWhy did they go? Avalanche warnings couldn't stop deadly mountain disaster  USA TodayAfter Avalanche Warnings, a Sierra Nevada Tragedy  The New York TimesKey question in deadly Tahoe avalanche: Why did skiers leave shelter in blizzard conditions?  San Francisco ChronicleDeadly avalanches not uncommon in California mountains where skiers died  The Guardian",
    "published date": "Thu, 19 Feb 2026 04:33:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPc0swdHdwb01IM3VqMTNiNW9DTjJ4NDVhOXNIMFdESVg3OVVtWDF5N0lBMVlPdk04cF8xVmdpb2tYa1dncm5ydXRsTlFJTTRzV2x3Z242VGs5cExmdTJuMUpWSFY1M0kwMGtPTHJXOVFpRmdyekVRNEZucFNsNEFSbEZQT0l2djB2ektLX3NNa20?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Accomplice not ruled out in Nancy Guthrie disappearance, Arizona sheriff says - CBS News",
    "description": "Accomplice not ruled out in Nancy Guthrie disappearance, Arizona sheriff says  CBS NewsNo current evidence Nancy Guthrie was taken to Mexico, sources say  NBC NewsArmchair Detectives Complicate Nancy Guthrie Case  The New York TimesNancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold  Fox NewsNancy Guthrie: 'Biological evidence' found at her Catalina Foothills home  FOX 10 Phoenix",
    "published date": "Wed, 18 Feb 2026 21:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPNGE3U0NhUFhDR0czS0NvNUhtVWYwSFpCTjV4Z2lfbzZWSDlYVzFuQ1QtQUhxWll3VFpGX2ZPVGw3MGU5MmhFS1lxVTNhWGx4RW1fUnFJTEpRMXo1S3VpQzMxWDNLQXpWTlMzOUpuOFMtQ3pLTm9feHRPLWxmeVFFbldn0gGHAUFVX3lxTE1tdWl3WUhidGNNSDFxbi1RdHdWZTFxQ1RhenM3VTFVczBwNjdyT1dIT1VXNkVuc182ZlJHQ093UlF1SlZPb2EyVHhUaDdqbExLY2p5OVRaejEyaGswZWhOb28teHJ1ZUthZDJQenozZzRsRzMxZFhrUi1zRXpwVnJwTFhmajYyNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Bernie Sanders rails against billionaire ‘greed’ amid California tax battle - The Guardian",
    "description": "Bernie Sanders rails against billionaire ‘greed’ amid California tax battle  The GuardianBillionaires’ Low Taxes Are Becoming a Problem for the Economy  The Wall Street JournalCalifornia Wealth Tax Opponents Intensify Efforts Before Bernie Sanders Visit  The New York TimesBernie Sanders and Gavin Newsom become adversaries over push to tax California billionaires  Associated Press NewsCalifornia mulls a billionaire tax, revealing a deeply divided state  Al Jazeera",
    "published date": "Thu, 19 Feb 2026 06:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPWGExaHVrdmlkeEFUQ1hBYTB6QkZCeHRKcUhmbXBNLU9td040Y0VfTWZQMWZSc0cwX2hjYmU0UjZDVF9Ldy1XX0pScUZ4XzhpakI2Zzg3ZEc1WU5mWG9qUEtxTXlWbDdKRUl1UmMtcEJhV1VPNWtPdE40d2Z5ZXFxaXNDZ3ZmTEotQ1N4RW41U1JRUXIxODJnSXJpNDBvTDVIWjAwQmJ5dXhrVURuY29vcS00dzdWOTU1M3NLRFJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. military pushes more weaponry into the Middle East for possible strikes on Iran - NBC News",
    "description": "U.S. military pushes more weaponry into the Middle East for possible strikes on Iran  NBC NewsUS military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CNNIran and the U.S. lean into gunboat diplomacy as nuclear talks hang in balance  NPRU.S. Military Moves Into Place for Possible Strikes in Iran  The New York TimesCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI News",
    "published date": "Thu, 19 Feb 2026 04:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPNzVjOWJpRy1QMTl1Y0VYQ3dMVDFfRS1QNlNybDByb3M4TFMwZlllNnl3RTJrN0syTmN1NHljMFRrTHNvaVZtdDlVVkl1LWp1TE9KRzd3V0NpQV9jcnhfZHh6eTlwUGRueWh0dG10X29iZ0wwdTl0WVpsY0puWTdEN0ljZnQtN216amEzZ0NxS0lOdnNqbGNCTDNjWDQydDMybC1DYUJZNnNCaVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Texas Congressman’s Aide Told Co-Worker of Affair Before Killing Herself - The New York Times",
    "description": "Texas Congressman’s Aide Told Co-Worker of Affair Before Killing Herself  The New York Times'She was texting Tony:' Husband of Tony Gonzales aide breaks silence about affair  San Antonio Express-NewsMonths before death by suicide, aide texted colleague she had an affair with her boss, Rep. Tony Gonzales  CBS NewsAttorney: US Rep. Tony Gonzales had affair with aide who died by suicide  KSATRep. Tony Gonzales attacks primary opponent amid reporting of his affair with aide who died by suicide  The Texas Tribune",
    "published date": "Thu, 19 Feb 2026 03:55:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPVjJqN2xGSzYzNGZCQzNOYXhiNWJoWWdwQWIwOThQNXU1bkVUMTZnY3NZcDhhSjBqRDZNeVR4TlBJeEJFNjR2ME1oT2xCa3A0cjdyMzdLazdhS1pXYTRpZUtPbzE5bWlGUzVkWDlBMUEwQ1FPYnNvX0F5VU0zdzZZNnhtaXdsSWxz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Mass departures from Justice Dept. are boon for law firms, legal groups and political campaigns - CBS News",
    "description": "Mass departures from Justice Dept. are boon for law firms, legal groups and political campaigns  CBS News",
    "published date": "Thu, 19 Feb 2026 00:30:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNejk5N0stVGt6V0VIR1VlYTYtUlQyejhsWlI4RFlyRkxZLURfT1hXMHBPY01JUm9aZnJZWlZMejBEYjBvUkFGRW9WdElGdnpjLThhdmJFTG9ET0NuXzEtUy1qd3FtRVZweGM0NkR0YWR6eWZuSkZGTV9JcTU2Ym1mYzd6ekIwN041VWEyR21hRkVfM2ZRZzZFWDZlWEREZVlJT1HSAacBQVVfeXFMT2VCQUd5SkNYWHFpc3dpNEtYaWhwV3lJbnZvQ2oyMUpmX01NRUJxd0JxNkRzekhPZjBkdXpLY3YtU3JJbDdjeURFdzZ4TWR5Z0tPZVlRZ2Z5czA0Q1N4NnhXR1ZQNks0Z3p1cXNBd2pTWTUwb0VLbWpCT09KNnpUUlJrdmd5dUwxbVRqS2ozUFlJZjduSWdCZklTOWs0OU95WEFJRDdRRHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Bowser declares Potomac sewage spill an emergency, seeks federal aid for cleanup - The Washington Post",
    "description": "Bowser declares Potomac sewage spill an emergency, seeks federal aid for cleanup  The Washington PostPipeline that caused massive sewer spill into the Potomac River has been identified for repairs, DC Water officials say  WUSA9Political blame game pushes DC-area sewage spill onto national stage  WBFFTrump and Maryland governor feud over Potomac River sewage spill disaster  The GuardianWe visited the 'Pooptomac' sewer spill. Here's what we found.  USA Today",
    "published date": "Thu, 19 Feb 2026 06:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZlFOVUM0V1o1VXFONGhCRmd0OG9WSURmMTZ0NHpoMnpNcHc3ZHlGVGt2YkZmSTctTEJHVHBadVlTM3JfQlpsR05FUTZLZkhqQk9Edi16cFNlYWhLSWgySFItT2pRWWw0aDRoY01FV3Itc0JZaENlVXRaME9XWE91dUxTS3E0ZGs1RUs3ek9aR3kzZGV2R0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Stephen Colbert Just Gave Brendan Carr a Free Lesson in the Streisand Effect - Slate Magazine",
    "description": "Stephen Colbert Just Gave Brendan Carr a Free Lesson in the Streisand Effect  Slate MagazineHow an FCC ‘equal time’ letter to ABC pressured CBS into intervening with Colbert  CNNFCC chair Brendan Carr says media were ‘lied to’ over Stephen Colbert controversy  The GuardianColbert interview exposes flaw in Trump's TV rules  AxiosSenate candidate James Talarico raises $2.5 million after Stephen Colbert interview controversy, campaign says  Houston Public Media",
    "published date": "Wed, 18 Feb 2026 22:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOa3p3Q1pGUkZtbGdoM0FuZmpWX2J2Ry12dnU0eWZyaXE2cm9hMDc2Tk12X1E1YXJ3WmdsV3NzU19qVmJpeUF3UmdpT2I0Tkc2NkFhanUtV01GbzhqQkhJR3U3R3czU0s0OURNc0c1djNDQ0d0S01qUERjb1B4UWxOMVJwY2hRYzR1RXhNY2ZTY1NiT2VmaURJMWktbjk5dlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate Magazine"
    }
  },
  {
    "title": "Trump news at a glance: president’s ‘board of peace’ set to meet, minus some key US allies - The Guardian",
    "description": "Trump news at a glance: president’s ‘board of peace’ set to meet, minus some key US allies  The GuardianAuthoritarians, strongmen and dictators: who is on Trump’s Board of Peace?  The GuardianTrump launches his ‘Board of Peace’ with billions pledged for Gaza, but many allies are wary  CNNTrump gathers members of Board of Peace for first meeting, with some U.S. allies wary  NPRTrump’s Board of Peace to Pledge $5 Billion to Rebuild Gaza  The Wall Street Journal",
    "published date": "Thu, 19 Feb 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQdFFUaG9lM3ZJZGlOaUg3MDhLT2JrOGQ3UnF0NVNtUmswbDYzSWttaGt0a1B5MjEyMVV3bE5nTS1HTVpYUldya2R1LTRIQ21xd1k2QkZOY2ZkYm0xRUxUWU56QlRIRDhHWU5iYVVuOVE2dzIyN2MzVFFUZEdubGJfcV9RR0gxM21xZFE3TFhIT3pIVTRxSWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Minnesota weather: 2 to 3 feet of snow on North Shore; significant accumulations in the Twin Cities - MPR News",
    "description": "Minnesota weather: 2 to 3 feet of snow on North Shore; significant accumulations in the Twin Cities  MPR NewsMinnesota snowstorm mires traffic in Twin Cities and brings power failures in Arrowhead region  Star TribuneMinnesota weather: Snow totals across the state  FOX 9 Minneapolis-St. PaulStorm Reports: Wind gusts and snowfall  WDIO.comSnowfall, 60-mph winds cause power outages across Northland  Duluth News Tribune",
    "published date": "Wed, 18 Feb 2026 23:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxPeEMtVEg5Wnp0SUdkNFNVejVsOEhqVldMa0F3bC12Z2hUV3FzTVNzYmRVMFdXMXJOcjAyOUFPRzRFWVNZdzF6eV8xR1U1cXFES3hOVC1KVGxsdUNUcklrenNMZ3JiekxDUmw2Y1k0MXdSM3VWMUJGem9NOUlXazY4UUNYVXNVWFh2TXpjMXVGLUtkbWw0LWpXMjFTcE0ydzZDMVhZQzA0REtuM2JreldnR0hsSjVhUzVSZ05DTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Public health and green groups sue EPA over repeal of rule supporting climate protections - Associated Press News",
    "description": "Public health and green groups sue EPA over repeal of rule supporting climate protections  Associated Press NewsWhy California could be the big winner as EPA abandons climate policy  PoliticoAdvocacy groups sue Trump administration over endangerment finding’s repeal  Al JazeeraOpinion | Why the EPA’s emissions reversal is the responsible decision  The Washington PostE.P.A. Faces First Lawsuit Over Its Killing of Major Climate Rule  The New York Times",
    "published date": "Wed, 18 Feb 2026 23:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPOEU5Mi11VzlxUlY5MFI0ZElZNUVraXVjVmk0Q0duc092NEFCUnNJWjBuSHo2NlN6LTVsZWxDQWlKYV95OFBtNVdHcXNRcTN3NjRzZ09aM1lTUW9Dcy1BWGtQUUp4dlNBcjFUblh0enRTeUpYSVpERHRQSy1wREN5VlBULU5sS0xDajliRV9qeDhRYVY2UUdnZTZLQUdzcUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Jesse Jackson Knew Better Than to Forget - The Ringer",
    "description": "Jesse Jackson Knew Better Than to Forget  The RingerJesse Jackson, Charismatic Champion of Civil Rights, Dies at 84  The New York TimesJesse Jackson death: Reverend's kids, including daughters Ashley, Santita, speak in Chicago on late civil rights icon  ABC7 ChicagoHymietown Revisited  Tablet MagazineSports helped shape Jesse Jackson's career and inspired the ex-quarterback to fight for equal rights  Associated Press News",
    "published date": "Wed, 18 Feb 2026 15:43:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPeTBZSVZkNGlZdkdHV0FBY295YUoyTENUb0tnNG5YaVRkeVNVQVdpcTZDelZ0OGpzZGZVek1DQmNSak55bXB0ekdZLWJjd3NLRzJXTU15YXVMUUVzNkpMdUd6cENmS2NkUU0wWUljdlZmRVhEMEVldGdQN25MMFR3b0dXYW9IS2NRY3ZUdkJkM0hoQVM4ZnlYSXQycG80OU5taDJxUHBNcmJESFhySUVlRVNjOFQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theringer.com",
      "title": "The Ringer"
    }
  },
  {
    "title": "Talks break in Geneva with no end to Russia’s war or hard-line demands - The Washington Post",
    "description": "Talks break in Geneva with no end to Russia’s war or hard-line demands  The Washington PostUkraine war briefing: Trump sees conflict as ‘very unfair’ for war dead and US taxpayers, says White House  The Guardian'Difficult' Russia-Ukraine peace talks end without breakthrough  BBCThe Behind the Scenes Search for Compromise on Territory in Ukraine Talks  The New York Times'Difficult' peace talks spotlight Putin's chief negotiator and Ukraine antagonist  NBC News",
    "published date": "Wed, 18 Feb 2026 23:01:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdjdRcUY0UXFlUTNtczREMHVIVm9VU3JRaUFJME84LUJydkxaRGZHaVd1dXhfUFhRT3R4YU1TX1ppRHpUWnN1bEMyei02VlN4bFRPVGpCNHhsX0otZlg2cHdsazZWMkt6SEtYV054amZKZ0xDOTZHYm5yMk9WRHFVNGh0bXZCV0FtSUpkcFpiWDUyOENHV3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump’s Black supporters tout minority gains during White House ceremony - The Washington Post",
    "description": "Trump’s Black supporters tout minority gains during White House ceremony  The Washington PostTrump, weeks after backlash over racist post, hosts Black History Month reception  Associated Press NewsBlack allies praise Trump weeks after video depicting Obamas as apes  USA TodayTrump basks in Black History Month praise, dodging racism claims  ReutersTrump says Mike Tyson has defended him from accusations of racism  Fox News",
    "published date": "Thu, 19 Feb 2026 03:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdDRvb3hYQ3Y5bm12dTR0U3F5dzVzemcwMzN4SU9NM2R1dTFkTVVTSGdhOERjVDFUb3BIU0RVYm9Lcmh3bmRyUFk1czZ3ejIxcmh0Um9nLWExMjFqQlViTTFuNUtWSzExMFlKelVCX3Q1TWpHMmJ5M3J2dFNGakNPcG9obw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "DNA Results for Glove Found at Savannah Guthrie’s Mom’s Home Revealed as Officials Claim Her Kidnapper Had a ‘Target’ - Yahoo",
    "description": "DNA Results for Glove Found at Savannah Guthrie’s Mom’s Home Revealed as Officials Claim Her Kidnapper Had a ‘Target’  YahooView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 16:25:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNX0d1NnVmQ09FS3FFLUVSU09XZnVDZkZLR2FWWFFlMjlrc011Q0RGdW5zS2c5MVpUZkg5YmpBWTNDQ0VtOHBaT1B3R0V5WFZNWUhwcjh0dmhRSWVqblh3NGRnZ1BaRXI5VXhFbDlFRldJUGxTWUFsUzN6U19IZjBjMVpDRGRocUQydE9ycm8xNUlYQU8xTXhSbURKbmRCenpaVVNrRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Republicans are a no-show in Oregon Senate as contentious bill vote nears - Oregon Public Broadcasting - OPB",
    "description": "Republicans are a no-show in Oregon Senate as contentious bill vote nears  Oregon Public Broadcasting - OPBOregon Republicans stage walkout over Democrat-led transportation package  KOIN.comOregon Senate Republicans deny quorum to 'pause the process'  KATUOregon Republicans walk out of Senate ahead of vote on transportation referendum  Oregon Capital ChronicleWould you prefer to vote on the referendum on last year's statewide transportation funding package at the May or November elections?  newportnewstimes.com",
    "published date": "Thu, 19 Feb 2026 02:22:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQ0MzMXNaNFMzSnJ3OHA3OE1QNUJHa08wT1V1SHFlaGJGclhGcjV4TmZtampmYUdDZHktc2I5LWRGZmxvNGlPTEpIVmRrZFRUa2hleVdsZzhPYmNVeE1GMDlHLVcyYnkzUUk4LThOaVZRaW9scTJNck1PTFl2SWdDaFlaOGZBSnV0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Trump meets with top Iran advisers as war threat grows - Axios",
    "description": "Trump meets with top Iran advisers as war threat grows  AxiosTrump’s rationale is still opaque as he slides closer to war with Iran  CNNTrump has discussed timeline for Iran strikes — including as soon as this weekend — but no decision yet  CBS NewsTrump struggles to explain the point of his team’s nuclear talks with Iran  MS NOWWhite House says Iran would be 'wise' to make deal, as US ramps up military presence  BBC",
    "published date": "Thu, 19 Feb 2026 01:45:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE4xa196amxLQV96SXEtcUpDbkQyRTdybzhMYWp5ZzdMX2VnWlBlc0ZpRFNJbU1zc2ZySDUwMEpuTFFwQjdBcS1SUi1wVzNUNWs3T3M3MWw4QVdvdl9fUVlFVFF6VHdweUVJanAxLWM0WDE0RTdTaHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "California sues Trump administration over billions in canceled clean energy funding - Los Angeles Times - Los Angeles Times",
    "description": "California sues Trump administration over billions in canceled clean energy funding - Los Angeles Times  Los Angeles TimesCalifornia files lawsuit against Trump for illegally terminating $1.2 billion in energy and infrastructure programs  California State Portal | CA.govBlue states sue Trump administration over canceled green funds  The HillIllinois joins suit to halt federal energy and infrastructure cuts  Chicago Sun-TimesTrump is funding climate projects in red states but canceling them in California, lawsuit charges  San Francisco Chronicle",
    "published date": "Wed, 18 Feb 2026 22:11:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOckFUclgwRlI1NzNxdk1rNjc3c1ZsX0RXTUNDVXZCMG5VWHF6QXM2d1dYU21RUG1mOTRNYjVWNjY5QlVNSWd0OVJ6Q1d6VWI2eGY2RDVHUUpOcllxSFplQ0dJYkdjR2JmSS01Wm1UNzRJTXFIaldzRUJiQXRTV0lILXFiSkxlUE9lUXBYcDc5N2Zibm45dHo0Vkw1dmREWXVrUjdMbXVJeHVKSWFpcE1yUU5KajJpMngybTlUU3pHY0h6a2EyVWcyU29pSnZJeGFVWmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "US to withdraw troops from Syria as tensions mount with Iran - BBC",
    "description": "US to withdraw troops from Syria as tensions mount with Iran  BBCU.S. cuts forces in Syria as its new government fights terror threat  PBSUS is withdrawing all 1,000 troops from Syria: WSJ report  Al JazeeraSome US troops departing Syria, official says  ReutersU.S. planning to pull all troops from Syria, sources say  CBS News",
    "published date": "Thu, 19 Feb 2026 01:14:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1nMENSYWx0bTFibVV6SjZWMXRDc01URlI2eEl6emdkVlVrMFBjSjF5M3NSVWRIMm9ubjhOeGxNdDhkLVBtSFF5OEhPaGVOdWY5SXRHbTRjZHlJUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Bay Area man dies at Tahoe ski resort after collision - SFGATE",
    "description": "Bay Area man dies at Tahoe ski resort after collision  SFGATESkier dies at Northstar over the weekend  Sierra SunBay Area man killed in skiing accident at Truckee resort  The Mercury NewsSkier Dies After Accident, Marking Second Skier Death at Same Resort This Season  People.comSkier dies at Tahoe's Northstar over weekend, second death this month  Reno Gazette Journal",
    "published date": "Thu, 19 Feb 2026 00:46:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBfdkZncndOTTFGeWFuMzlOdXd0Q2FRRGcxRVJ2S2hhTHd3NnhyRjhRNHA1SzhnQ2R5eXk5OEpRQkdDcXZoX1BZOTZYVldPRHZxb01KbWFvY1hua2UtUG4wVmF5bTRMLVhVQlNhQ1VfZm9ZYVJ1VEY0VG53?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "Mamdani says tax hike is needed to stop 'fiscal crisis.' Critics aren't buying it. - Gothamist",
    "description": "Mamdani says tax hike is needed to stop 'fiscal crisis.' Critics aren't buying it.  GothamistShhh, listen. Did Mamdani say perCENT? Or percentage POINT?  City & State New YorkHouse Democrat: Mamdani’s proposed wealth taxes ‘not going to work’  The HillMamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed  The New York TimesMayor Mamdani Releases Balanced Fiscal Year 2027 Preliminary Budget  NYC.gov",
    "published date": "Wed, 18 Feb 2026 16:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPd2NmRFB2RDVYUms5d2sweVoybTRMY0F3Sm1pejVheEMtVXpVTkVsd3FQZ25uWW1hN09DMzJoVEZGenlHYUlmN3k3OFFpa25QdEk1eHdXWXJUNWNYcXZ1cERKbEsyQ0ZfNUtxZXNKeHFlVWdGa29vQ3lhZnpTQnhBd1JfMC1peVJTai1yaFFqNnAyU3BzMW85eGJ5TGdHMnRKODlnbHNQRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "Trump Order Aims to Boost Weedkiller Targeted in Health Lawsuits - The New York Times",
    "description": "Trump Order Aims to Boost Weedkiller Targeted in Health Lawsuits  The New York TimesTrump order pushes glyphosate production; Roundup chemical hated by MAHA  CNBCTrump signs order on domestic herbicide supply for defense purposes, White House says  ReutersPromoting the National Defense by Ensuring an Adequate Supply of Elemental Phosphorus and Glyphosate-Based Herbicides (Trump EO Tracker)  AkinTrump output boost for 'probable carcinogen' herbicide  香港電台新聞網",
    "published date": "Thu, 19 Feb 2026 04:45:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBHTlV2NmpOaFZGeFlMaE9WWUJDTkFnMXRzQjNpalF6eTFCTHU0WWRvblJGUmhrZGhyVGU5TDVnYVBrclhPcWQta2t5MEpUUTl6TGNRYlJqbTNOSkhFVmZrMzc4eURSSTVkYVlmUVN4NFRoR0lwbGo3NDJuYndmVUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Kansas Republicans force transgender bathroom restrictions into law, overriding a veto - KCUR",
    "description": "Kansas Republicans force transgender bathroom restrictions into law, overriding a veto  KCURSenate President Ty Masterson and Kansas Republicans just voted to send men into ladies' bathrooms  Kansas ReflectorKansas House overrides Gov. Kelly’s veto on bathroom bill  FOX4KC.comGovernor Kelly responds to override of bathroom bill veto  KWCHKansas Republicans override veto of anti-trans bill. What does law do?  The Topeka Capital-Journal",
    "published date": "Wed, 18 Feb 2026 18:14:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQYk1RTloySEE2emxXM0xYbV9hZDFmTWg4VFF4cmFBMFVpWEtfVU03Qmo0VGdaUE5EMklSa2E4Y3FBYkVSVXY5UlJUT1RiSnNQNGN1WUp3X3BqdmdzY2hCMmdQcG1BQ1dIdVdYeEp0YVA2QkJrSXBpdWNaOHc3LW94OXpRZ3ZLTEVVQmRSQVJzQ3RnUDZuQVNlbTBMVEI3TTUta1pDNlNsVnJKS0VKUEttdG1QanFYb3NXc2tmak5wSGNfQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kcur.org",
      "title": "KCUR"
    }
  },
  {
    "title": "Did you change your name when you got married? This proposed voting law could affect you - Cleveland.com",
    "description": "Did you change your name when you got married? This proposed voting law could affect you  Cleveland.comTrump's election bill tops 50 Senate votes, but Democrats could still block it  NBC NewsRepublicans, Braced for Losses, Push More Voting Restrictions in Congress  The New York TimesWhy the risks of requiring proof of citizenship to vote could outweigh the benefits  CNNSen. Dave McCormick says Chester County proves the need for national election rules. But the GOP proposal wouldn’t have solved the county’s problems.  Inquirer.com",
    "published date": "Wed, 18 Feb 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOYkZNZmIzazdWLXJfMXpTSFNuZVBmRTJlRVlFMWp3X0RkNERyOVpmOGNQZzlIVUlVZUxJZkRBZTlIeEZJcWhMbVE2VWJDLWhOaVBJNm1YTHBoNUp3cDFQRGIxR2FxRWtWOTd4XzFsc1pSNjlHc0dobWdhY2JibXZaSnpFdXB3RTJoaFdhX1FSSTYyMk5lYXBnNDZ2UGlmcmZjRjdoeThKdmRzSlpCa3pNcUYwYjFWaDB1M19FdWl2SmdYS3d4SmJQdmNwQdIB3wFBVV95cUxQV2s2b1dIaENKa05YMWxUNUlMbzRRUG1IbDBlUXllME45bUZaTDRUbVJsUmdVcDhVOE5fUzJzUkZ1UVhYTXk5NDJBUG0yUWoxNVZXZElfUllhb2VLcExkNGgxenFHZUpiQTJ6VU45S09lTWNNWTIwY19hTmR0QTI3N2lELWJhSzlxVkFSMW5wcDlpbEpTbDAtanlUaW9jamdmN2tuMmE4OXJWQ3JlZGNKQ0VnR1p5YTZsN0JrZDRFWll4YWw1WnVBWERJelFqS1pmUEx1ZjMxdmkwc01aMnFJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Senators decry surge in deaths at ICE detention facilities, citing poor medical care - Los Angeles Times",
    "description": "Senators decry surge in deaths at ICE detention facilities, citing poor medical care  Los Angeles TimesSick Detainees Describe Poor Care at Facilities Run by ICE Contractor  The New York Times6 Deaths in ICE Custody and 2 Fatal Shootings: A Horrific Start to 2026  American Immigration CouncilOpinion | Measles Just Hit an ICE Facility. I've Seen What Happens Next.  MedPage TodayAOA joins physician organizations urging oversight of medical care in detention facilities  American Osteopathic Association",
    "published date": "Wed, 18 Feb 2026 22:36:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPdWNBanpYVHp3MENaMEdHTmJOTGRrRDRqQ1E3OExCR2lpQ1dlYkpHNEk2UGZhYVJpa2NGNWFwNlhkNC1UQ3N0N2MzX2QwYXZiSElCaHFLOEdKNGdhd1NFbm94eEgzU0RkQTUzS0xWQUw4LXRuQ2o0TmZ1cEJjN1dlOEdFOHQxYXpOVThDUi1xZXE5cTV0N3ZUVkRGdTF4b2RqekdqR2xuRzIxR0FkbUstUDlwYmV6QUxJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Trump administration releases remaining Gateway funds — and then some - Politico",
    "description": "Trump administration releases remaining Gateway funds — and then some  PoliticoWork on Gateway tunnel project to resume next week  GothamistHow Not to Build Infrastructure Projects  The American ProspectTrump administration releases Gateway Tunnel funding, as NY AG vows to fight future freezes  ABC7 New YorkTrump administration releases $127 million in overdue funds for New York-New Jersey Gateway tunnel project president called a 'future boondoggle'  CNBC",
    "published date": "Wed, 18 Feb 2026 17:25:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOWlhYNzRRWHNtUkxpRmhtYzVQM1NtdE1taGE3Z2pObW9STjJGRFNzZS1PQWRqdGJodlJaUmNLLVFUSmFlMDRENjRFeV9zSmZjdnd4UHNrWHpuUG9Hb2lqU1dsM0JNZzhTQkhaLU5TUFNjeVJGSGd2TWlwTWNDaUNhTHA0UjFQVkI2Nm9MX2FB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Iran issues NOTAM over planned rocket launches on Thursday, US FAA says - The Jerusalem Post",
    "description": "Iran issues NOTAM over planned rocket launches on Thursday, US FAA says  The Jerusalem PostUS renews threat of military action as Iran, Russia announce naval drills  Al JazeeraIran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.  CNBCRussian Mi-28s And Su-35s Won’t Revitalize Iran’s Dilapidated Military  ForbesWhat Iran’s Naval Exercise With China And Russia In The Strait Of Hormuz Actually Means  The War Zone",
    "published date": "Wed, 18 Feb 2026 20:46:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFAxTWs4Sl9JQ0tOaTVfRnNJUzFfLUdRcFhZWG9XUTdBU0I0Q2tDeEFNZzVCVjFqbHhHWENUQVZIMHhQeXg5Ynp1aV9tbmt2M3dBVUY3NFdib0gtZjRpWGhOY0M2c1ZwajltcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "ICE drawdown? Indications point to steady enforcement activity outside the Twin Cities - MPR News",
    "description": "ICE drawdown? Indications point to steady enforcement activity outside the Twin Cities  MPR NewsBrooks and Capehart on what's next as ICE leaves Minnesota  PBSFeds say Operation Metro Surge is ending. Many Twin Cities immigrants don't believe it.  CBS NewsMinnesota House Republican leaders don’t want to talk about immigration enforcement  Minnesota ReformerIn Minnesota, Legislature braces for federal immigration fight as enforcement surge winds down  NBC News",
    "published date": "Wed, 18 Feb 2026 19:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQNmZLczV2c3ltdzFFTFBYWXNaTE1wdzNHdVJEQ1psSzI3RmpuUVpHNE1VdEVZSVZ2VExmR1BLRTc1Tm1EcjZUQXh4WkxhclFrT1Uxei11TUMwbXhxcTczM3RIWjFzdDROSzgyV2xzQmFyWDdjVGtSVm43UHZyeFZoVzZoa3ljU0ZyVnNvLXNPYzFaZzJCS3lCTzRhcHJCWWIzb0daSXZjb2tGWE14QkhUdWNIa3JyU2tFbzJtU3FIZFNOQU9ORVB0ZHRlWVpVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Texas Election Season Heats Up as Early Voting in Senate Primaries Begins - The New York Times",
    "description": "Texas Election Season Heats Up as Early Voting in Senate Primaries Begins  The New York TimesWhat the Texas primaries could reveal about the midterms  PBSTexas Primary Preview: Two House Democrats in Danger of Losing Primaries  Cook Political ReportIn upcoming vote, Republicans have a Texas problem — as do Democrats  Euronews.comCan Labor Candidates Help Texas Dems Win Back Power?  The Texas Observer",
    "published date": "Wed, 18 Feb 2026 23:06:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPWG1rQzhwdzBzLXVWNmVyRThiWC0zTkRVS29zQ2xmOFEyMW9wYWJkZkc3Q3QzYkh5NVVsQVktUnRQYTBaU3ozQjQ3dGoyVmp6V3Q0V3RBdkY5bHowSmcycGlhLVNUVGhPdnl5TWZfRWszaE1MZFowaU42dmpMVzc1S2o4QnhDQ1Z5Nnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Lapse in Federal Funding: Impact on DHS Web and Social Media Operations - Homeland Security (.gov)",
    "description": "Lapse in Federal Funding: Impact on DHS Web and Social Media Operations  Homeland Security (.gov)Democrats send counteroffer on ICE reforms to Republicans as DHS shutdown continues  CBS NewsWATCH: Democratic counterproposal on DHS funding 'very unserious,' Leavitt says  PBSWhere is Congress? Why there’s no urgency to end partial government shutdown  WTOPHouse Minority Leader Hakeem Jeffries Holds News Conference  C-SPAN",
    "published date": "Tue, 17 Feb 2026 18:48:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNaWFDNVA4SHREeXduV2RZQTZZV3B6MWlmYVJiOXZUTktpbzU5RVRKUExjakU1a0ZFc3JvQzlIM0pSbTlqb1JRZm5taHZhVVZ6bGk0ZW9rYUdsZEwtR0RJZHFicnV2VGtjX29qajhqWTNIQmJUVWtzLTF0UUJSSFBVN2JHZjlJVGVuLS1ReEtnS1FJZTdweFpDbnU2dndPaWlLOHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Trump looms over Texas attorney general race - Politico",
    "description": "Trump looms over Texas attorney general race  PoliticoGOP attorney general contenders clash over crime, zero in on Dallas County DA John Creuzot  Dallas NewsGOP attorney general candidates tout conservative bona fides at only debate in primary to succeed Ken Paxton  The Texas TribuneTexas Attorney General debate filled political agreements, personal attacks  KXAN AustinChip Roy is known for calling out GOP leaders. He says that’s what Texas needs in an attorney general.  KSAT",
    "published date": "Wed, 18 Feb 2026 21:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQYmsyb3FCaDVpc0x3ZDAtQ0FBVXFMTjZ3N2hfMllhUnJWcW1NaVY0RWhHYUoxTlNZNTBzdFRrUEdra0NIenhYczBrZG1SaDV1aVFhQVpvZHdqOHdKMExzMEMzdzR6U2tEc042QmxsUkZDUnlCYTJYRHAzSUtvS1B5aWs2M3Vza0pUUVgxRXVqWUMzRFQ2MkZXeGltSFBoazZTTlZZRjFTdnMzV00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy - CNN",
    "description": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy  CNNIran expected to make written proposal for resolving standoff with US, senior US official says  ReutersU.S. and Iran Make ‘Good Progress’ in Geneva Talks, Foreign Minister Says  The New York TimesUnited States and Iran at impasse after Geneva nuclear talks  DW.comIran’s supreme leader threatens to sink US warships as nuclear talks continue  The Hill",
    "published date": "Tue, 17 Feb 2026 22:04:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPSlZMNnVFd1dtS0xrMTRxaVJsWUV0aHpXY2N6ckRBb21SLWhGZGFxNk94V3J5YXZIQjNiMGdqSDNzSjBrUUczeDgyLUxUWm93RzNwcDIzaFl4R0hOcVJoMDY3TUotOFlhZmtDaV9zYjhCQzBlVUZ6VWlfZlUxTFJNZE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Paxton surviving cash dump in Texas Senate primary - Punchbowl News",
    "description": "Paxton surviving cash dump in Texas Senate primary  Punchbowl NewsJohn Cornyn warns of a GOP 'massacre' in Texas if Ken Paxton beats him in their Senate primary  NBC NewsElectability and enthusiasm: How the Texas Senate primaries are testing the direction of both parties  CNNNew poll finds Jasmine Crockett, Ken Paxton leading in their primary bids for U.S. Senate  Houston Public MediaTexas Senate race: Ken Paxton leads John Cornyn in new primary poll ahead of early voting  El Paso Times",
    "published date": "Wed, 18 Feb 2026 12:55:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE14eTE5YXg5Z09DM3d0eDZob1o4cmlXd1k1cW9pbnhFX2ZOVkJSUU5pR3VOazZ1NW5WR01rb09BaDc4bFF3WE0xM2VCdkVEZ1JtbUVfd2gzZ1FHTXJKZmtRYW5nQTB3VWU1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://punchbowl.news",
      "title": "Punchbowl News"
    }
  },
  {
    "title": "Yosemite National Park ends its reservation system for 2026 - ABC30 Fresno",
    "description": "Yosemite National Park ends its reservation system for 2026  ABC30 FresnoNo reservations needed for Yosemite National Park visitors in 2026  yourcentralvalley.comNational parks remove reservation systems despite crowds  SFGATEArches drops timed-entry program amid pressure from Grand County leaders  KSL NewsYosemite National Park eliminates summer reservations  San Francisco Chronicle",
    "published date": "Wed, 18 Feb 2026 20:26:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNQnNvbWc0cEh1LUU4SlZ1SGJOOE91SXYzeUR5bllxM1dOdnFvdkxVRy1GTlNyRW1WbnVZbkVGSng5bVpVMGZCa1NyY1dTRUZtbHN6UHFZNFd0Z3JiS2FSaVdKLVEzZHN0QlNMWWVya0ZhREhESm9jSWpNbVdrRUJpem4wd29zZVI4b280SdIBkgFBVV95cUxONHlDaTRibTl1YmMwY2s5UWF1NjJ0T2ZYSUc3cDJKZnZwdWlDYm84anFGMUpKR1lPVHphUktyNThLREVhT2ZsdkZPVklReEhJNVlERjJVblZuVDBfUXVkLUZfU1RYTGlrMUtuelZtT0VLTGJMbGhWdUJnRnByYTctZ2dkS2FfNlNDRnM1MjhjLUdtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc30.com",
      "title": "ABC30 Fresno"
    }
  },
  {
    "title": "At least 12 Democratic lawmakers plan to boycott Trump's State of the Union address - NBC News",
    "description": "At least 12 Democratic lawmakers plan to boycott Trump's State of the Union address  NBC NewsDemocrats Plan to Counter Trump’s State of the Union Speech With Rally  The New York TimesSome Democrats to boycott Trump State of the Union for rally  ReutersHouse Democrats try to shut down disruptions at Trump's State of the Union  AxiosDemocrats plot protests for Trump’s State of the Union address  The Hill",
    "published date": "Wed, 18 Feb 2026 17:08:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQX0NxcW9ZQVMwdWp4aDVRbE15LWhPVHlSWVlqX3pGcWpQQ2Y0SkNGaHJNX0ZVX3htT0JzUEJKZmVvaE1hV3hWRjRob05XbWlpclFaVHJuSHd3ZldjQ2JvV1ExeFZ1MXlsb2xjSmIzTGtueFlRaWc4VkdWV2Q0cXhWZklBcDZ1ak5iUnpaUmE2S0wyWjI2a2xGOWo1OUdLVHU1bVd3bnJHVllYbHNHSXZZZmVleThobGZkUEUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "US senators visit key Ukrainian port city as they push for fresh sanctions on Russia - Associated Press News",
    "description": "US senators visit key Ukrainian port city as they push for fresh sanctions on Russia  Associated Press NewsUS senators in Ukraine call for pressure on Russia, not just talks  ReutersSenate Dems visit Odesa for up-close look at war in Ukraine  AxiosSenators Meet Zelensky With Hopeful Message on Sanctions  The New York TimesWhitehouse Joins Congressional Delegation to Odesa, Ukraine  U.S. Senate (.gov)",
    "published date": "Wed, 18 Feb 2026 20:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMEZUQklyNFU3YlZSX3VtWTNjTktsNEE1eFJtd2JacFFMTGdvUzJNVGVfNDdEbDFpcHZWWTVzbzZCd1dYdkNhb0xrRFkyZ2RoX3kxdWhrRFA3NzdQRVgwNkRGUlhNTG10aU5vSVFBckJNLVZYQlVFS09IXzFWUjBXNDBremZodmNTNDZDSklPa2lvVkJrUUZUNEY0T3Z4TzZH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "RNC moves to block Virginia vote aimed at countering Trump gerrymanders - Democracy Docket",
    "description": "RNC moves to block Virginia vote aimed at countering Trump gerrymanders  Democracy DocketRNC sues to stop Virginia redistricting referendum  The HillVirginia to vote on redistricting within weeks  NBC4 WashingtonJeffries goes all in on gerrymandering — with House control on the line  CNN5 reasons why the redistricting referendum will pass; 5 reasons why it will fail  Cardinal News",
    "published date": "Wed, 18 Feb 2026 22:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOQ0tjU21xZkQzUDdkR1VYRERjSXhFWjZVQXhaaUpaeHFjeGdSY1JreXM0SUZCR3JUaWd6Z29RN19pSmJjNmt3bnRwUW1EWUVGV0Z4M2dkT3VwZlp4amJreEJmc24yWFF3dklVRzNXaDFKLVBqZU5xZHJjOVc2bHpIeUIyX1U1aFEteDFiRHBodTVIYlhPd1dGWVNOTUc2emVJa1QxNURoNXg5WlMyUmFmUUlSSk1jSjg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Ferguson outlines his requirements for WA ‘millionaires tax’ - The Seattle Times",
    "description": "Ferguson outlines his requirements for WA ‘millionaires tax’  The Seattle TimesTension rising over how to spend revenue from proposed WA income tax  Washington State StandardMillionaires Tax passes the Senate  Washington Senate Democrats (.gov)Governor says tax must return revenue to families, rejects income tax under $1M  KOMOWashington Senate OKs income tax on millionaires  Axios",
    "published date": "Wed, 18 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQaURsUHlkVlpiSElUZzIxZlZLQWptZC1NR3Bkeng1eGNsbkJ2ZHpYWlhWN0FFNElCZmE2NllobGRiUWJ1WU9UVlFPZDQwcjNZeG9pMzFMVHI3RnFnbDJycEZ3Qjc5RFlEdEN5aG1hcVpjLTNQbkh4dmxJMEh0UUM1MXEwX0hYWUh3RDZrRURVSDF0bzdxaUVoRXFYRHRpSEhaR1RnNUEwMUNIb0JHV2RF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Kansas, Idaho, Utah, Oklahoma in New Push to Restrict Transgender Rights - The New York Times",
    "description": "Kansas, Idaho, Utah, Oklahoma in New Push to Restrict Transgender Rights  The New York Times\"You Outlaw It\": Heritage Foundation President Announces Intent To Outlaw All Trans Adult Care  erininthemorning.comRepublicans push new anti-trans bills to expand restrictions to adults  The Oklahoman",
    "published date": "Wed, 18 Feb 2026 22:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPd1p6bnhsSXRDV1Jjei1kbmxaYnczZWZXX2VSMkRMcTVEVE95UGZMVnVLOVlRMHY1QU5SWURFdWQzWGM1RzY0aWgwOEJycDRTYUtKRDFkMk1XeVlydFFJekRlUUt4czE1dE5JOHA2blVJcXZVS0taRVBHSWZlSjNwT1hUcXBGdko3SVR2eHlZd2hHcFh0ZEpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge declares mistrial in Prairieland ICE shooting trial over lawyer's 'politically charged' shirt - KERA News",
    "description": "Judge declares mistrial in Prairieland ICE shooting trial over lawyer's 'politically charged' shirt  KERA NewsJudge declares mistrial in Texas ‘antifa’ protest case over attorney’s T-shirt  The GuardianMistrial declared in federal trial for 9 involved in alleged attack on officers at North Texas ICE facility  CBS NewsMistrial in federal domestic terrorism case over Alvarado ICE facility attack  FOX 4 News Dallas-Fort WorthMistrial declared in Texas ICE detention center ambush trial over defense lawyer's T-shirt  Fox News",
    "published date": "Wed, 18 Feb 2026 02:19:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQMXZGNGVFM0hrX2J3Z3hmazAxckd4YnNtcGd2VGdlbERlYjBCNlFSS196Z1FyQ1BkVWJqSGE2NEZHbEl2Q1dGUUo5VmpzNFBKbzEtZFY2ZTA1bXlFTkJrYkhrdkNvSVB2WElROGZ6ZXI5N2FKTFRYRjctLVZYUnVKN3ZIS2tCUEtmZUlPMzFOVlB5eWVYTWh1eUVzeTBtbE1IVzlJVllUUjY0QWtOZzlQZVBvdXUwQ3NqNlN2MEk4cXZPY295UEstYXhhRjVsT2NxSURMX0w3dEhkUFA1dGhrYW5KZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keranews.org",
      "title": "KERA News"
    }
  },
  {
    "title": "Trump blasts Starmer’s Chagos deal — hours after US backed it - politico.eu",
    "description": "Trump blasts Starmer’s Chagos deal — hours after US backed it  politico.euDo not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal  BBCTrump tells Starmer handing Chagos Islands to Mauritius is a ‘big mistake’  The GuardianUnited States and Mauritius to Hold Bilateral Security Discussions  U.S. Department of State (.gov)Trump could be about to force yet another Labour U-turn  Sky News",
    "published date": "Wed, 18 Feb 2026 19:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOWVpQMWQ2SmFTMl92ZHVvWmp4ckxIVUZvcFBKZVN3UXJ5Q1BZMUN0akJLYWt4Wi1ra0pxRkp6a0pIaWtTcnlNcmZxZDhWXzdaQnRob0pmZkE1RmNJZy1sWm1GMnVSOHZ1SVdIUDZYLWsxdGxXT0Y5djJScHpwdkZCbi1RY0hpbGpkY0E0ejd6V0VZUnZncGdXNEliTHdvMk1zRV9DV0g0OHVpRkZPQ0xZZTh5dWIwQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Colorado Democrats Push to Rip Up 2028 House Map for an Extra Edge - The New York Times",
    "description": "Colorado Democrats Push to Rip Up 2028 House Map for an Extra Edge  The New York TimesDemocrats would be favored to flip 3 Colorado congressional seats under new redistricting proposal  The Colorado SunColorado group seeks new congressional maps to counter Trump-backed redistricting push  AxiosColorado group pursues ballot measure to pave the way for a new congressional map  NBC NewsColorado looks headed to join the congressional redistricting fight  Colorado Public Radio",
    "published date": "Wed, 18 Feb 2026 21:01:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNTHVoOUVCZkt4alhpc3F6SmNKOVBwWmRweXZ3SzNSNGg4djN5b0FMb1B6TTlqMUxmREx4LUJRaHZ4SVZUVTVqeElaR2dkY082R2gtTnBJZzlYVWxZMGpoVVRTQndJU3dOMmNaWjFuNklyS1lpVVJKdlBLeU8xRnhHTTJ0dXlYT2RVcmFnMFl5Zk5BZXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump administration is erasing history and science at national parks, lawsuit argues - NPR",
    "description": "Trump administration is erasing history and science at national parks, lawsuit argues  NPRNew lawsuit challenges Trump order to remove ‘corrosive ideology’ from national parks  PoliticoTrump Hit With Fresh Legal Fight After Bid to Rewrite History Failed Miserably  Yahoo News CanadaGroups sue over Trump effort to ‘erase’ history, science in national parks  The Washington PostLawsuit accuses the Trump administration of censoring history ahead of Black History Month event  WBAL-TV",
    "published date": "Wed, 18 Feb 2026 07:09:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE0zRThUaWdnRGNQVk1DcmJVaXZsLUU2OTlRQTJZazhoa0pXM2RuZGlfNml3U3hKckhVbHJ5aW9sS3VRQnVlckY0SVRKOWxOYlpiVjlTejc0UTVGN0VZZWRYbFVzeUpPS3hNdXAzYjJ6WmwtTHRVdUZfeWFjZWFrUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump DOJ Can’t Answer, ‘What Law Did My Client Allegedly Break?’ - Above the Law",
    "description": "Trump DOJ Can’t Answer, ‘What Law Did My Client Allegedly Break?’  Above the LawA Case Against 6 Democrats Lacked Urgency. Then Came a Swift Bid for an Indictment.  The New York TimesTrump's DOJ is a clown show of failed revenge cases | Opinion  USA TodaySen. Mark Kelly's lawyer urges DOJ officials not to seek indictment for a second time over video  NBC NewsPirro Taps Dance Photographer-Lawyer in Lawmaker Video Case (1)  Bloomberg Law News",
    "published date": "Wed, 18 Feb 2026 19:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOY0xHbWtRWDM1d09DeWhneFBLNlc0eFljeE5vYVZ0cEpWLTRPYjUwbjluMDRkdi0zeFREdFBtclZQazlyVEtqYWpuYzFpM0FWZHljS0dPaklKQ0pDZVc2RWRLc1ZTcjdILWNSOUVIUGJ2VEhJQUZjWGJCR1hYTmlDMHZYWXpiM2tyelllOVE5d1ltNHdwYUZMeQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abovethelaw.com",
      "title": "Above the Law"
    }
  }
]