[
  {
    "title": "DOJ concludes Epstein files review with release of 3.5 million records - Axios",
    "description": "DOJ concludes Epstein files review with release of 3.5 million records  AxiosNew documents reveal the breadth of Jeffrey Epstein’s orbit  PoliticoCommerce Secretary Howard Lutnick Planned Trip to Epstein’s Island  The New York TimesDOJ releasing 3 million pages of Epstein files, 'didn't protect' Trump, deputy AG says  ABC NewsWhat We Know So Far About the Latest Release of Epstein Files  The Wall Street Journal",
    "published date": "Sat, 31 Jan 2026 04:27:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQcGdGMUV5NU42ZFFVR2N2WVEteVJYbENHMUJ3b3cxWE8wTURfNk1XTEtucjFUblp6dDdzdWFBRWp0ald2Um5Bejg1b1dHTG5qVE1kUDdMYmlnTl9URDUxcDRUNDJIWnA5aWNCYTVQVWI2WXZERThFeXIwR0ZqbXM4WmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Partial Government Shutdown Begins as Senate Sends Spending Deal to House - The Wall Street Journal",
    "description": "Partial Government Shutdown Begins as Senate Sends Spending Deal to House  The Wall Street JournalU.S. government partially shuts down; House vote could reopen it by Monday  CNBCUS government shuts down partially over homeland security funding  The GuardianSenate Passes Deal to Fund Government and Negotiate ICE Limits  The New York TimesGraham blocks Trump-backed spending plan, calls it a 'bad deal' as shutdown nears  Fox News",
    "published date": "Sat, 31 Jan 2026 05:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPLWFOU1hVb0RCMXZfZ2pMSE5OZEwybGJPeWY4eXh4LVBMazh0TUFybFpWYnRIWjB2c0hvVmZ0NW1yNDB1eW5EMnk5TjNyV1M5dThHM3MwVU94VUxqZ3JqUmxEUEpJbHVLRFVKdmhzbjVvUmxiM1JUMFJxLXJTd3NJbDdmV1E1ZHpzbktyZDBxYVhhV3d5R2pHUTJzbGctQ1A1RHdaWl9zVUpGTVlX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Don Lemon vows to fight charges in First Amendment showdown with Trump - Politico",
    "description": "Don Lemon vows to fight charges in First Amendment showdown with Trump  PoliticoDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesJournalist Don Lemon promises to fight federal charges following his arrest after Minnesota church protest  CNNFormer CNN anchor Don Lemon appears in court after being arrested over protest at Minnesota church service  CBS NewsJournalist Don Lemon charged with federal civil rights crimes after covering anti-ICE church protest  AP News",
    "published date": "Sat, 31 Jan 2026 00:26:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNeTdmWEZMZGFYU3c2bHcyd252UEtxY2tTSFpVcUV2Y05BR0xvWE55NklreG4yMUV5QTRnU2xHRDBkWkllYktlT2pQTk1hRVBITVlWTDcyZ2lSVnJTVkZYVDNVNHBJMS0xMVljTGVCVFNkZC1GWkR2SWNobzJvX1Ezc1JYb3ZCRkNyX0V5bE5TdnF6bmtuSzdHN0tzX04?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "US DoJ opens federal civil rights investigation into killing of Alex Pretti - The Guardian",
    "description": "US DoJ opens federal civil rights investigation into killing of Alex Pretti  The GuardianJustice Department opens civil rights investigation into Alex Pretti shooting  The Washington PostDOJ launches civil rights investigation in Alex Pretti's death  FOX 9 Minneapolis-St. PaulFBI now leading investigation into fatal shooting of Alex Pretti  CBS NewsAlex Pretti shooting by federal agents in Minneapolis prompts DOJ civil rights probe  NPR",
    "published date": "Sat, 31 Jan 2026 02:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPQlQ1bmROYXp1VDNWdE93cjdlQVlGUDNkZUxJMHN4M0pWTWppTXc0YnZ2clRPcGdkajlvcXBOcENEZWJqZ3pDRWpnazFud3lPNDB5bjJaTlJ3TlQ2cVMzYV9HNml0aEtSdUphVENQRzdEOXpRd25yeHJqWEpTc3NEbUZRRmZidTE5WnpNaHpTTjhhb2t1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Texas A&M University cancels programs in women's and gender studies - NPR",
    "description": "Texas A&M University cancels programs in women's and gender studies  NPRTexas A&M Provost: University cancels 6 courses to comply with policies regarding race, gender topics  KBTX News 3Texas A&M Ends Women’s Studies and Overhauls Hundreds of Classes on Race and Gender  The New York TimesRepublican states are censoring universities  The EconomistI'm an Aggie. I supported Texas' DEI ban. But we've gone too far. | Opinion  Houston Chronicle",
    "published date": "Fri, 30 Jan 2026 20:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZHRaRzBRVzRpeHVXY3hjQktrTGdSUDh4c1dkSU15X1JobXNKYlhYN2U4THFaNFU4Vko3aG9wN2kwUlVpeHd2Ty15eG1HbXRLT3JIeDhieUVCRDZFU2NBU0FXcVhpamdhODI1SmV5TlVZLTNoMnAtYmgxeUlHN0phNW0wdEFTOGpMck8tZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Protesters Denounce Trump Immigration Tactics in ‘National Shutdown’ - The New York Times",
    "description": "Protesters Denounce Trump Immigration Tactics in ‘National Shutdown’  The New York TimesSan Francisco's Roxie Theater closes doors to protest ICE  KTVUUS protesters begin nationwide strike as DOJ launches Pretti killing probe  Al Jazeera'No work, no school, no shopping': What to know about the national anti-ICE strike on Friday, Saturday  king5.comThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The Guardian",
    "published date": "Sat, 31 Jan 2026 02:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQNG45Y05BTFlMdzJlaC1HdXFQTXVLS01TMmUyUFN6RV9JbnhwUkZuXzNzRDRMNFJYRnktZ1M1SVk3Q2RYeG83VVA4b3RkRTdIWnF4X01CY0E4cFIzcWtWT3cxVDhBMHVjSXlUeG5xbmFYWF9SWkhVWWN0aE9uWG9saTBLQkRMXzV6cG9v?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty if convicted, judge rules - BBC",
    "description": "Luigi Mangione will not face death penalty if convicted, judge rules  BBCLuigi Mangione will not face the death penalty, federal judge rules  CNNLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersLuigi Mangione won't face death penalty in CEO murder case, federal judge rules  CNBCFederal Judge Drops Death Penalty Charge Against Luigi Mangione  The New York Times",
    "published date": "Fri, 30 Jan 2026 23:30:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9NQ0dtUW5iUjN1b2EyNU14Tzc1VklHWUkzTlpKdkFwMzJIZGhWVkpjQWkzTndBZFlxUi1hWldzMDJ4NWZmUWpydmVRX3NaRERlZjByMS1ZVlVyUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "More than a thousand Utahns protest ICE in Salt Lake City during ‘National Shutdown’ - The Salt Lake Tribune",
    "description": "More than a thousand Utahns protest ICE in Salt Lake City during ‘National Shutdown’  The Salt Lake TribuneHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNNOn day of anti-ICE protests, ‘Idaho chose solidarity,’ honored shooting victim  Idaho StatesmanShooting Aftermath Leaves Homeland Security Department in Turmoil  The New York TimesBattles Are Raging Inside the Department of Homeland Security  The Atlantic",
    "published date": "Sat, 31 Jan 2026 03:10:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVUdtejRsZ0V0cUQ2OERxSWkxellLYm9YRlN2V1NLZ243b1VTQ2RYT1dqZ3Y3VVhtMGNjdDd0NUowckxQaG9VMTdwVXBTT0dmUFlTYnN4SHowb1hSNGV1YTE3X1BLSDJZeEFJLXpXT3dieWliUzYyUVpRVnI3UXU0WklmOF95aTRfWFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "Thousands Gather in San Francisco, Businesses Close as Part of Nationwide ‘ICE Out’ Protest - KQED",
    "description": "Thousands Gather in San Francisco, Businesses Close as Part of Nationwide ‘ICE Out’ Protest  KQEDBay Area protests live updates: Thousands take to SF streets to protest ICE, Trump  ABC7 San FranciscoSCUSD students hold walkouts Friday to protest immigration operations, policies  KCRASan Francisco joins nationwide anti-ICE walkouts with Dolores Park rally  Mission LocalWatch the walkout: Palo Alto students say ‘Melt the ICE’  The Paly Voice",
    "published date": "Fri, 30 Jan 2026 23:26:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQWVdtRVF4czhWWnVwSldOX2lWNjlUOWpBMV9zRFhlbmZtS0FtZmJ3aTlLTFUwTVVsbzIxS0RFYkFxMWZPRnZsT2txdTh0bHJJdkpCaHdUSkVpQnRuRWhLdHdTZ0ZuWkNPckFmQl9KeXNJckJXTW9mZDhmY3pSalAxdlFHZ3NHaDJyTkpCMld4OGU5Tl9FOGNKTS1iVGFLUVRrcmNZT1g1VlNPeFRuM1FFN3FPZ0pWX2tpT3c5SUFRbGQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown - The New York Times",
    "description": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown  The New York TimesGreg Bovino Was Trump’s Rising Star. Then He Arrived in Minneapolis.  The Wall Street JournalWhy Trump sending Tom Homan to Minnesota is a stroke of absolute genius  Fox NewsGreen Bay officials prepare for possibility of ICE activity following Alex Pretti’s death  WBAYHoman says drawdown in Minnesota possible, state seeks immediate legal relief  FOX 9 Minneapolis-St. Paul",
    "published date": "Sat, 31 Jan 2026 01:07:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMWY0ODZtbkZtak5yZVNxVy1DQkcxX2NyMDVXRE1FVGNpN3AwMG90UU9Ob1BVQ0VUVXI5M2luLW1PNXduTVhVNHE4R0MxVzZiaE1oaXRlRHlocnpicGFXQlRVZjRjTUQ0OFRJRGRYSzNOOFJFcE5Xa2RzbzdpYWpDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show - NPR",
    "description": "Photos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show  NPRAnti-ICE protests touch every corner of the US as Minnesota officials stand off with the Trump administration  CNNICE Out march in Minneapolis, Bruce Springsteen is surprise guest at Defend Minnesota concert  FOX 9 Minneapolis-St. PaulMinnesota Live Updates: Thousands Protest ICE in Minneapolis and Nationwide  The New York TimesMinnesota Proved MAGA Wrong  The Atlantic",
    "published date": "Sat, 31 Jan 2026 02:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPczFBb09fVjN0M1FRekFYT21LVVM3RWFuOUdUSTJDVV80UEduNFlrRk9tRmNOM1hxa3VGeVNqczdSazlMTk1ydXZZNDRpU0ZUbG4zam1mSTEwRnNJX1ROVkQxS29lRW54SGM2U0JSYTBmcTcxdGVnTUVJTXNWZEVnTFZST2c4eDh3RV95QzR2MmNLM0M0MFJQSk9vbFE5cGtwOHlXOXVzc21ybC1VMnROMEhKOXZrTjFxajNoRDFMMUF2dVI4RlotZHkwWG1qUFNFeFM5Umk2WHgzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Iran wants to make deal rather than face military action, Trump says - BBC",
    "description": "Iran wants to make deal rather than face military action, Trump says  BBCTrump faces a weakened Iran but that doesn’t make his choices any easier  CNNPoll: Trump voters support military intervention in more countries  PoliticoIran puts ‘fingers on trigger’ as US armada arrives in Middle East  Military TimesMiddle East Scrambles to Find U.S., Iran a Diplomatic Off-Ramp  The Wall Street Journal",
    "published date": "Fri, 30 Jan 2026 21:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5JSW90eHlkSWs0RFRNYWlvNC10RTJnT0xQaFZvMFRRVVlhczJaM1pLbEFkUjFKWDE4MmdGczlNNks5WktGd1hFVHBjdmlyYWR1X2FIeS1TV3VvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump’s Lawsuit Against I.R.S. Creates ‘Enormous Conflict of Interest’ - The New York Times",
    "description": "Trump’s Lawsuit Against I.R.S. Creates ‘Enormous Conflict of Interest’  The New York TimesTrump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak  CNBCTrump sues IRS and Treasury Department for $10 billion over tax return leak  CNNTrump Rages at Reporter Confronting Him on $10 Billion IRS Grab: ‘You’re a Very Loud Person!’  YahooTrump & Sons Sue IRS & Treasury for $10B over Tax Return Leaks  Democracy Now!",
    "published date": "Fri, 30 Jan 2026 22:33:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQnNnX24zNW9vZkZJZWxsNzlkSU9hUzZpVHBaVmFMV0V6NERoU3ZfaGppZDAzamxCcjNUbnV2ZWxEVWE3cTBnNG5Ia3h4LWU3dFpSbmkzaE1DN0F6MTlDU2ZvQ2MtdUdiV2tDVDJIRTNjNjJMcmRqRWlKeUZLdXFXeg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "description": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest  ABC7 Los Angeles'National shutdown' brings protests to L.A., across the nation; demonstrators clash with police  Los Angeles Times'ICE Out' protesters swarm downtown LA calling for immigration raids to end  LAistCitywide tactical alert issues after anti-ICE protesters clash with federal officers in downtown LA  NBC Los AngelesLos Angeles protests: Thousands converge in downtown for national 'ICE Out' rally  ABC7 Los Angeles",
    "published date": "Sat, 31 Jan 2026 04:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "6 Missing as Search Continues for Boat Off the Coast of Massachusetts - The New York Times",
    "description": "6 Missing as Search Continues for Boat Off the Coast of Massachusetts  The New York TimesGloucester fishing boat with 7 on board feared lost, sending city into mourning. Again.  The Boston GlobeCoast Guard searching for survivors after commercial fishing boat sinks off Massachusetts; 1 body recovered  Fox NewsUPDATE: Brother awaits word after FV Lily Jean sinks off the Gloucester coast  Gloucester Daily TimesCommercial fishing vessel was carrying 7 people when it sank off Massachusetts  Boston Herald",
    "published date": "Sat, 31 Jan 2026 01:39:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTEdHR0huOEhPYVN6SDNsZnBEbDdtT2E3RklzYjl5dlhPMlp5aWtsdl85VlVhR3FFczEzaW1lQ0ZYWHhtT2xGWVozb0pIVlp3alFoZnN2OUNGLXRUeUVVTmtpcXdlYk5NZVppMGc5bWU1VEpTcUNFeG51R2pBZXlIRmJQQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "'It's been heavier than ever': Dozens of parents of Columbia Heights students detained by ICE - kare11.com",
    "description": "'It's been heavier than ever': Dozens of parents of Columbia Heights students detained by ICE  kare11.comProtesters gather outside Texas facility where detained child Liam Ramos is held  BBCICE detains two more students from Liam Ramos’s school, officials say  The Guardian‘Mommy, open the door’: Mother recounts her terror as her 5-year-old was taken by ICE  NBC News‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding  MPR News",
    "published date": "Sat, 31 Jan 2026 01:09:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQX1BreVVGS2tEbmtnOXJxaW9UbE5Hd0NGVGpnSUxQWFcxU284Z2tBUmNCRkJnajZsbmFFY2pFMUZEUlFyVndkVGdzakJSYTZxVHQ4VmxrN1l0Q3VSeURPaXRUZXFsNnp2ZjRKemR4S0Q2TzdsT3JEVlJUWGRRMjBEek1tb085S0duRkYtX2lBbm9HQmlxUWo2b0lZWlRnT2dwNmVaVTVEU01Ia2lVTEZVR01PSTVxdVUyUS1qWG94ZnZVMnR4ZmRQU3Y1VmZRSHRHWmdEemhfd3dpTFM5R195SmhVNDA5eDJQdVF3dFgySGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search - Politico",
    "description": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search  PoliticoTulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub  NBC News‘It’s a Five-Alarm Fire’  The AtlanticCould FBI raid in Fulton set the stage for takeover of county’s elections?  AJC.comAtlanta FBI boss ousted after balking at 2020 election probe  MS NOW",
    "published date": "Fri, 30 Jan 2026 19:00:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVl9ha3lPa2E5Tk51N0RsdktObFgxRzdTdkIzVGQ4MkUzOGlCRWo5bWNna1hSUmFsWWxrOHY4eEJ0RGNBRWZyR1R3NzB5a09iSGFSVjV1ek1DeXNXbGV3em44eTRNdmw0dHE4WHFETnltVzZmLVQ1bjFWdjA1ZFRjUEI2ZjFfYmhiTlpReXVhMlh6QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues - The New York Times",
    "description": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues  The New York TimesICE in NYC: Hochul moves to end local cooperation with federal agents agents in New York  ABC7 New YorkNew York governor proposes bill to ban local law enforcement from being deputized by ICE  ReutersDemocratic governors scramble to build a legal wall against Trump’s deportation agenda  PoliticoKeeping New Yorkers Safe: Governor Hochul Introduces the Local Cops, Local Crimes Act to Stop ICE from Co-Opting Local Law Enforcement  Governor Kathy Hochul (.gov)",
    "published date": "Fri, 30 Jan 2026 22:52:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9HVW9OVEhpSTZ1RElEZzBRb1ZfUWNXWldMaTBpQUNPakNkRFlYZEJnWVlSVGRqamRsd2xLNnlmY0hFN002MkZDa3l5TjFlUExmcGdkUVJTd2lnc1JTa0N1eEtJOVVrNFY2NG1ZRzk5TTk0dE1CVW1Nd2pVT2tQMUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long. - The New York Times",
    "description": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.  The New York TimesAhead of midterms, Democrats mobilize around immigration, anti-ICE sentiment  CBS NewsTrump is scared of the politics of ICE. And it’s showing.  CNNThe government’s winter of discontent  Federal News NetworkOperation Trump Rehab  The New Yorker",
    "published date": "Sat, 31 Jan 2026 02:45:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOTDRWYzdnQUZZZ1owUEwtN3RYNi1ZOGZUd3BNVUJmSGxURm9NaXIxb3l3SWkwaWtGWGpIS3pockNxVzFFR1h2OEVYQVpFblVXU1E2d3VFNENMS3hPT3U3MFlWRkJaNU1qZzBDWDlIbG5SZFp3SnpvQmpYSWpGbEpwTEhCZ1JwZVZ4cEhZelFrSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits - ABC News",
    "description": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits  ABC NewsOfficials urge Ohio SNAP recipients to prepare for new federal work requirements  WKYCNew SNAP work rules spark concerns at local food pantries  WGN-TVNew SNAP work requirements go into effect Feb. 1, threatening recipient eligibility  Capitol News IllinoisNew SNAP work requirements are coming on Feb. 1. What to know.  USA Today",
    "published date": "Fri, 30 Jan 2026 21:08:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPSkE1Yy0wRWI0Qk5CLUVMZE91bl9oNkFIN2tGazczT3FSUzE0d2ZxWHJ5Y2c5X0lOZVE4U3BtR2FKbFpzd1lBdGYyNGZhU2ZHS2RoWWczc1lGekg5c3VKdjlBYWVtcU9mYUFJa1VEOGlaYUx1SHBpUTlqUV9IT1JjdTdRTTUyZlhEb1ppZTZmN2pkd9IBlwFBVV95cUxQV0NzQWVzTHJ4TzIxOVdQLVY5UnFFakdmU0hwREI3ZDVKNlJ3bmxOdGg3V05vdUpBS0EzTXFYdnNEVGp3VUgyY3hFZmhoSzNRZHprVjc3UXhTUDBpZnhDV3hTNjNIX21sZjJZVUJZR0t4SDBWNzRUeF84VXZZR2FtYUI1X00xSVZSY20zbTkwT25XXzcxczQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Judges across the country rebuke ICE for defying court orders - Politico",
    "description": "Judges across the country rebuke ICE for defying court orders  PoliticoIn Minnesota, America’s Federal System Is Coming Apart  The New York TimesTrump-appointed judges are letting his immigration enforcement blitz continue  CNNJudge cancels ICE director Lyon's court hearing after immigrant's release  AxiosTensions Mount Over Compliance With Judges’ Orders in Immigration Crackdown  The Wall Street Journal",
    "published date": "Fri, 30 Jan 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQNmJjMFZzbWRHLTU1bGRCQW5jUDQ0XzFhMXJyZ0NSZnR0bFh0ZnZrRnJMeFlteDBhY2RwajBsS3E4aXZuY3A4MWhSUWN0bGNEWWhtY1VVdDlRSXI0OXpfbXVxdlB6T2F5UmJkUEtodWlzUXRfaS16bzZsMFh3ekpIQzh1eWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say - Business Insider",
    "description": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say  Business InsiderTrump Threatens Canadian-Built Aircraft with 50% Tariffs and Decertification  The New York TimesTrump says he’s decertifying Canada-made aircraft and threatens 50% tariffs  CNNCanada says jet dispute can be resolved after Bombardier shares fall on Trump threat  ReutersTrump Threatens to Ground Canadian Aircraft and Apply Tariffs to Imports  The Wall Street Journal",
    "published date": "Fri, 30 Jan 2026 20:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNZlRjOTltUDUxMzY2SHhGRGVYZERlWk5JSndCR1g0Wm1DeUNLWmF2aDB3WGdPZTVpakhMQ2p2S1NhNDRrWkN1RkNWa0NBZWpDdlpKOHFhWms5OVR0eUo3eFBlSzIyXzFuekZ6anpWYlA1UWJUSGpYX0UzZ3U3ZFRXV00yQkgxVXZPdWx3SmVUcE9kbWtQa1A0UFdVWmpUX2dRMnlmZ2NWSDdTWWJiMWRr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "U.N. Says It’s in Danger of Financial Collapse Because of Unpaid Dues - The New York Times",
    "description": "U.N. Says It’s in Danger of Financial Collapse Because of Unpaid Dues  The New York TimesUN risks 'imminent financial collapse', secretary general warns  BBCGuterres warns of UN's 'imminent financial collapse'  ReutersU.N. secretary general says global body is at risk of fiscal collapse  The Washington PostUN faces severe cash crisis as Trump admin ramps up pressure on world body  Fox News",
    "published date": "Sat, 31 Jan 2026 00:09:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPQUtUSVdLNFJRUlR6RWJDdndqdzJFcUQ5TlUwT213M1hYRGRsd1pkOEI5NmxIMHo0bkhFZWJxMmlyN2FEdlRyRWlWWmsyTVV0aUV6U2xlTUVyZkpxR3ZtZmxMbHNCR3pQN011aWdsTHRDRzQzTHA5MDJ3dldERXpaYXE3T2FQQ3lQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House - The New York Times",
    "description": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House  The New York Times‘Horrifying’: Judge blasts federal lawyers over removal of President’s House Site slavery exhibit  WHYYJudge chastises Trump administration attorney in hearing over dismantled President’s House exhibits  Inquirer.comJudge calls Justice Department's statements on slavery exhibit display 'dangerous' and 'horrifying'  AP NewsPhiladelphia presses case to restore President's House panels as judge questions federal authority  6abc Philadelphia",
    "published date": "Fri, 30 Jan 2026 23:34:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUWN6RUJmbUF6ZHBuRUlIMU9jQmlGZ25DTE00UUZIWU9FcG14VDQtYm85VC1IX3Y1RnhIWWdpcVBKUFYxYThZUTZtLWtiUUJ1b2lrUXhMV1A2ZS1wVWRycngyX0czdEd4Q0VsVGY3VjZFZUZjTlRUMWstZTZqS19tZURYSEJGb1RFNHdWZEdQRTJTdTJfUUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood - NJ.com",
    "description": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood  NJ.comWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelPowerful storm threatens East Coast including parts unaccustomed to heavy snow  ABC NewsMost snow in years, blizzard conditions possible in parts of Southeast from powerful bomb cyclone  CNNSnow this weekend? Latest weather forecast on possible nor'easter storm in Philadelphia, Pa., NJ, and Delaware  6abc Philadelphia",
    "published date": "Fri, 30 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxORU1JSDYxVTJEOGsxWWE0VWhIWFkzM183TWtnY2tXR1cxaDE2Q3BCazh3TFR5SGp1LWx5OG0wbjhWRGZWOXo0aVRQVnpOUGdjc2lnYjhMT0w1YWR1ckE4enJFcjEza1VrMHJITENtTHVtMm1renNjSjlOU19zSjJfdnpjTmdXeGY5aU9xSTNkZnVKeVhaMTVucGZWUkFBNTI4Wnc2c3NmRmNKMXZXNHhwTFNUem5odFBzSUtRSERuMnFQZVEwdERXT2xVWlRZeHUxcWFsXzRUdk5RVlI5THpPS9IB9AFBVV95cUxPUU9MNXpub2FPWHVHNWZCbzd2MGVFR19kWkRvak9QQk0zSE1ybmFCOGx3UTJ5RlhuQXFxMjI5cjlhRVVYQzI1bUhhWGJjekl5bkZ1ZFdzUWNMVzhUMjRUYy1FUGpiamVuQkduMGhTZHQtOHFsZHVtNzNNanZhYjN4aG84djhLMXp5VEU0bEVIZFJhZmxYQXpwRnNROHExdFdzdzNiWExuZ2Vvdi1LYnFEM1RqdlRrTDVQSTBqRlJDeDMzSFhQN1MySjkxVXQ5Mmg3dUxBSU1FRUVJY0lYYzFTeHl1OXlvdzgzTXE0ZHNkbW82cjFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S. - Axios",
    "description": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S.  AxiosIran says ready for ‘fair’ talks with US but not ‘under shadow of threats’  Al JazeeraIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsIran seeks to avert US military action with talks in Ankara  The GuardianIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNN",
    "published date": "Fri, 30 Jan 2026 17:04:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbGJJSUlaNm5BV1VOMmVYTHVNa3V3Y2ZnV1VyMXRkeFFNV01JSmNYTFJvMmxMRGJ0LVdHRTNSdHVwOGpVS3RaRC1UcDJSTnBkRS16b2ozUFNPdEVIdEdLX1N6OTJWSTgzcFhIdGxYQnk3YndwY3NaWGhzb2FqLVhfeHFYOXdhcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart) - Syracuse.com",
    "description": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart)  Syracuse.comWhen the Snow Won’t Melt, New York Brings Out the Hot Tubs  The New York TimesNYC rolls out snow-melting operations as cleanup continues  Spectrum News NY1New York City Department of Sanitation melts snow to improve accessibility for strollers, wheelchairs, carts, pedestrians, drivers  ABC7 New YorkGiant ‘hot tubs' are being used to clear snowy NYC streets. Here's how they work  NBC New York",
    "published date": "Fri, 30 Jan 2026 16:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQenZTWUZFS25jUDd6VXphNjRvYnczWl9aN3o1WEZBR2ZmRXNTNmZRR282blpCQUJHX2hLMFVCNzE5NXZVQmZ4X2tFMzB5UGN4c29ESTFETWFCdVVVVC16UTlWdkpBd05fZXlwN1J1Q0ZMdHVFYXM4UzUtQ1hqYUNyZE1xNWdIZF9ybFl5M200NTBFZHJGRUpYMzZsUGZHUVRVaWl4X3JKS1hyX19PWFAtaEZzZG1sbXh6WVVKTFU5NWhFWDlkdkpxR3NaUHB1RHJhc3ZyZWNaRVdlLXRuRms0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "China to take 'necessary action' after Panama port ruling - DW.com",
    "description": "China to take 'necessary action' after Panama port ruling  DW.comPanama High Court Gives Trump a Win Over Canal by Ousting Hong Kong Port Operator  The Wall Street JournalChina Is Losing More Than Just Two Ports in Panama  Bloomberg.comPanamanian Court Strikes Down Hong Kong Firm’s Canal Contract  The New York TimesPanama court rules Chinese control of canal ports unconstitutional  Al Jazeera",
    "published date": "Fri, 30 Jan 2026 10:07:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNLUtIS1ZsYThCM2N0My1NYVg2WjVaQk1Kamd4ZWFOWS1YeTRaMC1BX2lFclk1STBZV0x1SDFabVBhbVpQT0lzNTNQVFFfODliZGp0RjExZHBsVEFjWEZnRUNCTmFCdC02dG1wWTFsT0tVbXFtTjB3VmM2T0FNM2c0c01icjlPOG9mMm9rYVljOWFDd9IBkgFBVV95cUxNbmo0V3Zud1ZhWHRwcUdILWRDVndITHlFTDVDNGtnek1jbTlFamlRQUY1RkNvemtObUNuUzR0R0FFYnpYM2w4dG5sN0hPRFlpMVZiN1J1VDJJMkRXWnBaTW9NRU1rVC12Mk1TbzlCR3AyWXc0VFdLYW51MHhQM083MzN5T1VwSlo3dWNBLUtPQXRoZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\" - CBS News",
    "description": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\"  CBS NewsJury deliberates in Fairfax double murder trial connected to au pair affair  WTOPAccused double murderer Brendan Banfield testifies, proclaims innocence  The Washington PostJury in Virginia 'au pair affair' double murder must now decide husband's guilt  ABC NewsHusband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York Times",
    "published date": "Fri, 30 Jan 2026 11:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxObUNKaXZycWkzLWhrVTV2RklOanI1bEhrVmdLZFlyOUkteG1BelRQLUpsb2NCR0hhWkJNSzd6YnlwbjJ2cV9wRkJGQ3h4cDZGMUNYckJUeGFKcGlJalRlWlR6Q3RlUlRQSHdENUxqVUg3QUx3VWN5U3BHWXZlWkVXZ195QVZueWc4VWxUeFpKNE9xSzZHOExUUjZkcm1OQy1tRFhkWV9B0gGrAUFVX3lxTE1pY0R3WHpVcnJGMWxTblRPR00wSjB6QTlvV0VZeVJwbUw4VkxtOFdxZG9hY2NVblFfNEJCVUxxaWhEdjNQa1RjSWtCd1NBVkU0QlBMNWlWQ01DWThTc0ZuRnZEU0RmX2ZpUFVjQ2xESWxtNDd2a0pCdjFRVUFBM1dROFl6c0dBTkhjX0NsTHlza3QwT0NnZXFCdWFBRVFwYThzaHVOaDViWFU0SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  }
]