[
  {
    "title": "ICE agent shoots Minneapolis man in the leg - BBC",
    "description": "ICE agent shoots Minneapolis man in the leg  BBCPerson shot in leg by federal law enforcement in Minneapolis after assaulting an officer, DHS says  CNNFederal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesShooting involving federal law enforcement reported in Minneapolis; two in hospital, including federal officer  KTTCFederal agent shoots man in Minneapolis as tensions in city run high  The Guardian",
    "published date": "Thu, 15 Jan 2026 05:39:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBQeEtlbGFJTWp2bmZqV2pxbm5abWEzak9xVGluSDBxSDgyZXdQZmpJOExTdlhKeUk2ajZDVWNNZXlBZlBIZFZZQUR2OVhBQkF6ZVJlNkMzd0dmUdIBX0FVX3lxTE05VFl4cmpzT1VnX1Bhckc3OTFjeHJ4eGhzVDhVRlc0WlhJb25lOHpHM0VRUTM5eVN0Qkozdi1XQ0VOVV9wTVJGcTVjNVk0YW5JRWpEbVdHSFMyRk40UlBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "description": "Trump would want military action in Iran to be swift and decisive, sources say  NBC NewsInside Trump’s ‘crazy world’ of milk bottles, sled dogs and threats to bomb Iran  CNNTrump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops  The New York TimesTrump told Iran has halted killings amid mounting protest pressure  Fox NewsTrump says Iran has stopped killings as U.S. weighs military options  The Washington Post",
    "published date": "Thu, 15 Jan 2026 00:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNkFfOS1ySTk0Rml4c3czdUNEUUdTVy00TUFGSG1BWVFnZFd2MmVSRURCcWtJRUpPZ0phd3Q4MUszUW1ZODdNSXhvNGhKdHhfbGJwd0E1WTlTenNXazRMRFRDa2lJTTI3ME01VzFPRGxWQnJRT2g1UWxuNWVaOEtJbktYQVNYYXdUeVVwSUpsUVZiQlM5THpoSVN0Rmx5X1UzV25VcE80cHlHVmVTeEtyd2FkT3LSAVZBVV95cUxPanVnQ2haU2JQd0VCd2JPWnJIQ3ZqU1BqeVNhM25YekdIM1d0YmUzWkNDMVMwTld1c2FXWUpMdVJzeHFmYVFwRVVlQ0NhV0d6b0tPdzl6Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "No decision on request to stop immigration sweeps in Minnesota. Military lawyers may join the effort - AP News",
    "description": "No decision on request to stop immigration sweeps in Minnesota. Military lawyers may join the effort  AP NewsWhy this legal expert says the Minnesota and Illinois immigration lawsuits ‘are close to completely meritless’  CNNLawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York Times'Campaign of brutality': Gov. Walz encourages Minnesotans to remain peaceful during federal law enforcement presence  5 EYEWITNESS NEWS‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time Magazine",
    "published date": "Thu, 15 Jan 2026 01:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNNGVGY0ZSN1paXzVrcTFHMFdTenJ0OUhlaFpjRU9pUDVpOXpGNkNZaDBEMWRKeDRYWUNtd0hka0dwQm9IT19Jc0UxX2R4cW1TWklYV0NOTkJFRDgyUEpOS1ZoNGNCR1NXZEd4S2xxMjZYX3c2NTM2MkVQQ2ZyalQtTXNMM3NDLTN0V2lfNFE5MXBuLUNvVWx3Z3QwdWtpVGY1WG5VNw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam - Axios",
    "description": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosDemocratic lawmakers file articles of impeachment against Kristi Noem  The GuardianIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT MirrorDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOW",
    "published date": "Thu, 15 Jan 2026 01:56:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUVMxLWIzMFh1S2hoYkVHa0tQYmQybDh3MHlDTVd4Y3JFNTV5bTVEc2xFb2FUemo1QmNYMmtEcHlfSnc3Q2xDUXFoM1NYaHVQQ1RnNTdLSFUzR1NpWS0tbFF4SEVmQ0xCOFZ4ME90aFBhWHJfMm9wSjZ4SlhuUlV5TE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Newsom Says California Will Not Extradite Abortion Provider to Louisiana - The New York Times",
    "description": "Newsom Says California Will Not Extradite Abortion Provider to Louisiana  The New York TimesCalifornia Gov. Newsom says he's blocking Louisiana's push to extradite doctor accused of mailing abortion pills  NBC NewsLouisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it.  PoliticoGovernor Newsom rejects Louisiana’s attempt to extradite California doctor for providing abortion care  California State Portal | CA.govNewsom rejects Louisiana call to extradite California doctor over abortion pills  The Hill",
    "published date": "Thu, 15 Jan 2026 00:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOanFVLU5ZLUQzeWY3bHNPalZkTlo3dkNwZVJ1dGVlYkdMcGwxVldzN0ZaaG05Z2M1REZQYkpJaHRqOU02cXFpaW12ekxULUVyZzJOZkx4cGUwYmlfTHktS1NvbWVrR1k4OG1SRlVCeTBtSTdLeEVNUUVibElxN0dvRHFFZlpuUkZ0ckdJNEJPOU5maEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "description": "Trump administration rolls back $2 billion mental health, addiction grant cuts  NPRTrump administration sends letter wiping out addiction, mental health grants  NPRH.H.S. Reverses Decision to Cut $2 Billion for Mental Health and Addiction Services  The New York TimesTrump administration slashes funding for substance abuse and mental health programs nationwide  CNNHHS abruptly cancels then restores mental health, addiction grants, officials say  The Washington Post",
    "published date": "Thu, 15 Jan 2026 02:10:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYXphRGdydnVyTnhGNWZiamVZdGN0Z3QzZHRadEJLT095elBDS2ZvMjQxUHljZk5aZjhtZG5JTzI4aTVTV3FXVFE3NXlNTXJrOG1yOXRna0pIaElPMzJDLVE5bmRXLWE2emNTODk4dTB2bEJsMkc3SlVCX1pJUWhhZDJZZ21uaWhoVmh3WWJrbHBlWVJzd285Q2dGYlVDUFFhREczNnRVMXpUWG1LNnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "LIVE: Federal agent shoots man in leg, protest forms in north Minneapolis - kare11.com",
    "description": "LIVE: Federal agent shoots man in leg, protest forms in north Minneapolis  kare11.comWoman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says  The New York TimesHow the feud between Trump and Minnesota is impacting the probe into the ICE shooting  NPRAnti-ICE protests continue with demonstrations at Graduate hotel, Whipple Federal Building  5 EYEWITNESS NEWSExclusive: Trump calls Minnesota ICE shooting 'sad to see on both sides'  Reuters",
    "published date": "Thu, 15 Jan 2026 01:55:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxPQS02djh4WTBCVjFUWEFNd0NQbEJkaWxtd1M5R3dxWGxCbXZhZkRrUGxCNzBLT3Z6ZXVCYWhLU0Y5STdjM0pXV3FpcGpYeHdsT2JuaHRYdkVkY0VwZDJuOV9HUFpueVhJRmt4YVhLb0JNZFpWUVZKWThJdE9RVHhLOWRnc0s0TGNLMk9HWnN2V3pPdUcwaGc3NWQxUTFwd0kwTVB4Nnh5SE9ZUy1tYW1FNU5ZX3psUTZkSEhMVXNYcHV3SXlkblEyOTE1azRBcmFBMzJ2MnVTZ2s4TDMxbEJRNUVCMHJiSklXT1BodzVHMThIQTZqTFlWaTQ4bmpvOE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Suspended Ford employee who heckled Trump sparks over $800,000 in GoFundMe donations - Business Insider",
    "description": "Suspended Ford employee who heckled Trump sparks over $800,000 in GoFundMe donations  Business InsiderTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The GuardianA Ford worker called out Trump. The president flipped him off. Now, he’s been suspended.  Michigan Advance",
    "published date": "Wed, 14 Jan 2026 20:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNRHZBM1dqeFJiSHh4aVlzTHMzNGg4dEd6dDhvcnpZTmlrSDhyY2lWaEo3ZHFZWTRlVWoxRWkxZHZXQk9tSnJyNFRkRlhnYmtwV3ZkNWZnZVBtbnN0U2ttaVRjdzJ5dXJITEYtbjVPU1lia1ppcmY5WEEyZnlnNUt6bGJBUjRLaGJE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights - Slate",
    "description": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights  SlateInside the SCOTUS hearing bound to be a turning point in the culture war over trans athletes in women's sports  Fox News5 takeaways from the Supreme Court’s showdown over transgender athletes  PoliticoKavanaugh and Roberts are already looking ahead to the next major transgender controversy  CNNSupreme Court appears likely to uphold transgender athlete bans  SCOTUSblog",
    "published date": "Wed, 14 Jan 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOUljOGY0b25hbjB0eU9KcXZva0VYR08xbkp2U0NrdC1LOGhPanhCemg1dTdYbllVUTh5eUEtVkZYaUZZQ2M2a1RVVWFfbGJvbDdwSkNmSEkzeEJoa0pXa2NLSnMtN19WbWZRcFRTUmFJYnlyOWVFZEJSM0xQVV9OY2hCNU9YeGVfdEVvR2pzNU5FSUhyTXdqV25FYXJWZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Vance casts tiebreaking vote to kill Venezuela war powers resolution - ABC News",
    "description": "Vance casts tiebreaking vote to kill Venezuela war powers resolution  ABC NewsTrump Administration Live Updates: Republicans in Senate Block Effort to Check Trump’s Power in Venezuela  The New York TimesSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNN2-bill spending package 1 step closer to House passage  PoliticoSenate blocks Venezuela war powers bill after Vance breaks deadlock  The Washington Post",
    "published date": "Thu, 15 Jan 2026 00:10:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPMzVnaWF0SEEtREdKalpNTEZpemZNX0FGQU5Tck1ZemhHWVZZaU95T3BfUEgxazUwRHk1TGtWc1Y4TEd2aFl2enEtbWI5QnVneWVaQ0tGWWZvSl9tRVBrd2JXMWctNmZsZVNWYngtdnNXUm5jckE0U0VZdjhzUHI0Uy1kWk9qOV9JQUFmYjYzcGNLZjVEU2lvRXc0dXZ5d0ppd2FjYnBCTkfSAa4BQVVfeXFMT1U1QnVZOFJDbG9IMWV1eU5VS2dYSlRVT2FKc3g5STMzTENCSjNKZ3ZYNEhUQ0NXdUZwTW03dXIxXzAyZmxXSTJrbklpcUFZVXBBbng5dVhTUHEybFQta2xadUpKSXdFbHZ5V2VxeHRNTnkxd21DOUF4WkVOX2ExVHpZZUM5OXI0OUtMZE5xb05lTkhvRDlmNFFyNzN5TGE4OHZMRnBpQkhPTmp4VWRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base - BBC",
    "description": "US and UK pulling some personnel from Qatar military base  BBCIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersLive Updates U.S. Withdrawing Troops From Key Middle East Bases as Precaution, American Official Says  HaaretzTrump warns Iran against protest executions as death toll jumps past 2,500, activists say  NBC NewsSome US personnel urged to leave largest Middle East base as fears of war spread among Iran’s neighbors  CNN",
    "published date": "Thu, 15 Jan 2026 01:31:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1ieTJ3bzRDQmhjeV9OaXpOSXZqeWFBbWNrQTZaeDNnQmVfVjZtM0JRMVRYbjFkVlp2RjFrbjNDMjEzdEFRRXc0YmlIV3NtR2RaQXlZWFJIV2Yzd9IBX0FVX3lxTE5hT0otNjJWZmVzbV84SGtwWjlpUHNOUlh2dHJhZ2FyelU3eGktVXFMLXlVT2liTGZpV3g5cnhFMFZHdDIzS0dTYzhjSFpoXzd5c096RzNvVW9YckQzOGtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran: Massacre of protesters demands global diplomatic action to signal an end to impunity - Amnesty International",
    "description": "Iran: Massacre of protesters demands global diplomatic action to signal an end to impunity  Amnesty InternationalOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesVideos show security forces firing into crowds in at least six cities across Iran  The Washington PostOver 12,000 feared dead after Iran protests, as video shows bodies lined up at morgue  CBS NewsIran signals plans for fast trials and executions while promising retaliation against US, Israel  AP News",
    "published date": "Wed, 14 Jan 2026 18:21:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOUUM5ak54Q1FqazdGeVlRWmNza1ozT1NUVmpsUUVYT3ltV0FYRWgwZmlja09ueEp5aHdfeWRRbDFmVFU0SWhIY19JOUVSVS1ZNkgxLXpFQ3hsTjhCS0xQNGVVT09zVHF4VDBpSmVESGxiSU05ZHI1bExHZGJOaTBzZGJORnhvYmw4dnVzWU1YSnZsRmtBX3pLOEdGaDZhSzJCeW9xMWE5b1pfakdoeDJ2WVI5OHFyUzAzb1pMNWd4S2FMM2lyNy1GamxMaXdvOTQ5V3Vz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.amnesty.org",
      "title": "Amnesty International"
    }
  },
  {
    "title": "Federal judges allow California congressional map to stand - Politico",
    "description": "Federal judges allow California congressional map to stand  PoliticoFederal Judges Uphold California’s New Congressional Maps  The New York TimesDivided panel cites Supreme Court backing of Texas’ map to uphold California’s  MS NOWIn a win for Democrats, court allows California's redistricting plan to proceed  NPRProp 50: appeals court rejects Republican bid to block California maps  The Guardian",
    "published date": "Wed, 14 Jan 2026 21:32:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNN0w1QUV6bzg5cE9Kc0VFM2lqUlQzdUVvenlDdnctU2YybTdzRmhCOGJ5MF84X0c3eGNKRURqS2dDRXY5cFo2Y05JSUxKNGFVTlVtdjNBbFVCT3lkcWN1TjFqVHJ0eFZrTHVjYnNsQkxMZmU0Qi1JQnF2cEpOeWxPNjdDaktkNzRhcjhya2dSb3E2ZUlTTVd6TA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Colorado appeals panel appears skeptical of Tina Peters’ sentence - The Colorado Sun",
    "description": "Colorado appeals panel appears skeptical of Tina Peters’ sentence  The Colorado SunElection denier Tina Peters goes back to court after a boost from Colorado’s Democratic governor | CNN Politics  CNNColorado appeals court judges raise concerns about Tina Peters' sentence  9NewsHere’s what might come up at Tina Peters’ appeal hearing Wednesday  Colorado Public RadioColorado secretary of state urges governor not to pardon Tina Peters  Democracy Docket",
    "published date": "Thu, 15 Jan 2026 00:53:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNWE5JLVVFZmFlMFFpSjgtakhZRFo0bDc0YmVYS1p6OHBDZHJXV0pJb3haS0lVa1prd1lxQndfdUNsQ1RWYUpsYVF2cXFWbmhnSzR1OEFTNk5qeHMtMGJvMG5RTi0wNjh6Zm9WelN0LWxnZEh1QnRJS05EbXpXZ1J6TmsxcHpPRjA2U1p3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "FBI searches home of Washington Post reporter in classified documents probe - BBC",
    "description": "FBI searches home of Washington Post reporter in classified documents probe  BBCF.B.I. Searches Home of Washington Post Journalist in a Leak Investigation  The New York TimesPress freedom advocates worry that raid on Washington Post journalist's home will chill reporting  10tv.comFBI searches Washington Post reporter’s home  CNNJeff Bezos Needs to Speak Up  The Atlantic",
    "published date": "Wed, 14 Jan 2026 17:44:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9YTzhlU0Nybjg1ZXBwQTIyUm54eWVmQmFNOTU0a1BoYlo3UWdwVWVfQ3BrTDFkb1pzVUpjLXh4aDlwcUpiTldzSmtELWJrMlpLaG5oVDVYOVBqd9IBX0FVX3lxTE5FTHRyUnV5MU8wQkMwbGFMS01xc0RWZWV0aW1SRDJ3LTg4Zzc0U3FaNTF6a3pRbnkzdlVSU3BaZUZaZnhNOWlDVmFTUktKNHlJaUpobk1ERkxyVlVtMklB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Virginia House committee advances 4 proposed constitutional amendments - VPM",
    "description": "Virginia House committee advances 4 proposed constitutional amendments  VPMVa. Democrats flex power on redistricting as General Assembly session begins  The Washington PostVirginia Senate Democrats pledge action on affordability as 2026 session begins  Virginia MercuryVirginia House passes amendment allowing redistricting to counter GOP gerrymanders  Democracy DocketVirginia Democrats look to decimate GOP seats in redistricting effort  Politico",
    "published date": "Wed, 14 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdmxqMVNicEc4dFczNjcwSHZWV3BLb1dDdFhlVGJNbXNMcDZwbnZoVHVKaWdYamQwM0lwVTkyZGVuRWtadFJabnFOOXV5QUFfUHd4QzZZUGZ5RWZVZmxONm8wM0hDd1Q2RWRiOGYzbjN6d0loVlZLRzV4aWZkcU4zcjE5d0Fybkl5dmxJWkZoTjFRVi0zN3JabXFuejI5QnNkVGlidEtJdTZBMmV3dU4xRDd4VW9tRTB3dHpEWEp4dWJKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him' - ABC News",
    "description": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him'  ABC News'She was terrified.' New details emerge in Ohio couple's killings  USA TodayColumbus police have murder weapon in Tepe double homicide, chief says  The Columbus DispatchA suspect’s arrest in the killing of a Columbus, Ohio, couple leads to the next big question: What was the motive?  CNNPolice chief touts gun link in Ohio dentist murders; records show three 9 mm casings found in killings  Fox News",
    "published date": "Wed, 14 Jan 2026 15:49:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcmhuRlRDanZRNjI3SFR2dkloYmt3cUJSQkRMUmV1RXh6NEVmY01BMDRNTm5BdzVXTHpaVk5xY1RCcVRLci1aS2k2MlNuN3Q5TFFUUXdSa2NOVUxIbWpGZk5zX1dqRXdOVWpNVU5Ua0dRQm4zRG5fSTdJdjJfWTVQcm5May1yNXA1WmfSAY8BQVVfeXFMTk82T3BTRUdtcDN6QVloTFFZNkc4N0h4VlJ6TWh5dDRVZzN0SEpma0JrNERHc0UxSktaaU1yUlJXZmJndV9weE1mWm1rNFRheWk2cmF6QjI0MjZOQlZiT0FFRWFrYVYxM3U4TDBhN2JmNEdTajlVZmtnQjROejlJdWJpY29GYk5rSmxlaXpKTFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies - CBS News",
    "description": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies  CBS NewsAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNBrazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC NewsWATCH LIVE: Former au pair cross examined, pressed for details in Fairfax Co. double murder trial  WTOP",
    "published date": "Wed, 14 Jan 2026 11:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNQVlsRVZqWlgxMUtnd2VPVjZXNWJ0NWs1ZEE1QlN6N2ZPVzBNR1JwaXg5THNQRk5aVlVPV29oTGVMeHd5SmFQdGY1OWh0bTEyVmlicV9nRW9JQTlIdjR4OEtEWDR6Vm1yZ0QwWFRhSDNlZWhUZUJOR2dYMVRHcUc0SWswb3dKaVVfN05XZ3NqM3pIS3hKeFRn0gGcAUFVX3lxTE0xS2tod0E5S05kN1FHeUFDMUNuZEt0MU5zalE4cXFPaEhYSUMzZnJTZmV1QlFhdDMyVG9KWmhOakEyWTdUaVQtbjhqdGFBSV9NVXB2SlY5UlRTNnBVX0lRc1B2WWlKaUhSN3M2bmNlaDZiZS0zeHRDTlN4UWhqcElHRllUamFuVjlqYms2bndVZk51MHB6RzQ3dzc5Mg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "House takes step toward averting Jan. 30 government shutdown - Axios",
    "description": "House takes step toward averting Jan. 30 government shutdown  AxiosHouse passes 2-bill funding package ahead of shutdown deadline  CBS NewsHouse Republicans advance stock trading restrictions  PoliticoDHS at center of progressive revolt as House advances $80B spending package  Fox NewsSenate advances government funding measure as shutdown deadline looms  The Hill",
    "published date": "Wed, 14 Jan 2026 22:35:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lMGsyY0tTYmFkWEg0RFVxMGlNZGtzU09QdzdnSEdFaHBXcWdpSXVUZ3B3MUV3a1JvSXBXNWZ0bjhZaVlBSFZ1VExWUzF0S2JGbWY4eGUyd0ZPdEt5S2JKaGluVHhDR0wtTjY3MG5MWmt6aTll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney - ABC News",
    "description": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney  ABC NewsTrump Loyalist Asserts She Can Keep U.S. Attorney Title  The New York TimesJustice Department accuses judge of abusing power in questioning prosecutor's authority  ABC NewsOrdered to explain herself, Lindsey Halligan invokes Jack Smith  MS NOWDOJ Backs Virginia Prosecutor, Slams Judge Challenging Her Title  Bloomberg.com",
    "published date": "Wed, 14 Jan 2026 19:46:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPWXpwVUo2Vl9UNHhjNnVBeTcwMnV4ZW1ZRW1OYUNCZjVCdEt1N3BiUDNrRmpKamxSRU1VNGRIeUlhUjVfUUJCV1VkU2F2S2xVVHg1eGFXR2NXVUlwWWVzUzZrVHdjcUZDbFVVQ2dsSnJ6OXdDQ0xlb2pXSmdxbXVyZHc2dkF6RmJoSVZ0andqWEhkZURMbk5hbE12MEZaMExuZlp2QWI4N0Iwd9IBrwFBVV95cUxOaVlDMktCWWhiaXVQUDlqazU0MHdWVkJpOFBEOGNVaTgzeGw5WjBBeHI0ckV6ZUVUSTRMX1ZNa0gtWHpJaXZYTWRfby1mV3hzdXJZMDkxcGhQQ3NMbTh2R2ZHTDNCT0gxeTZLWDRBSWNncWRCcUJLRXgwSm9jUDhfcm9SdkYzcFJmVjAzSmpOcEVIWVM3anBDUmpwX1pTX1QyME9wMktDOVpYZTB6ZVZN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Administration reinstates hundreds of health and safety officials who were laid off - ABC News",
    "description": "Administration reinstates hundreds of health and safety officials who were laid off  ABC NewsHHS reinstates all laid-off employees at workplace safety agency NIOSH  Federal News NetworkUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.comReversal brings back 900 federal workers at the National Institute for Occupational Safety and Health  TribLIVE.comC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York Times",
    "published date": "Thu, 15 Jan 2026 00:55:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdHdEUDZVM3RyajVVZ1JDa0dva0VVQXM3akdiYkRtdTRreWJsT2JUTk5yOVBGbTI4bmwtTTJvcHlxWXpRaVRQNFg0eEl4QktUa0wwdENBTVNZc3ZVTF93enJPaGxmejdCYW11Y3BpVXhnZVprdnlWd2lZcS1sbzF2blo4QkM5WmxXSFNwV0lnQlJNVDNMQ0I5S0hNM0tSMmNWdHNVUjhMNXFfQWlqTm9UVnhR0gG3AUFVX3lxTE1ZZ3VqQlRBVU1vS3BBSllrNnNibFdPSm1leWc3ZmZnZnZvai1oWnpzdFQ0Uk9yeXNzbmloT3p5d2N5N2lGWDZPRUlmXzZGd1ZvdFAxOWRrcU1OdW54WnN0WXZERzFGc09aY1d5QkdJY3pyYldrOXJuY0NhdEFuY0xIZVR3QXRBMnkzcDNHQ0YzWFNjQ3pFbFg0Smp3QS1fRVZpOXozRkNQclJHejBXelk4Rkl5MzFqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there' - ABC News",
    "description": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there'  ABC News'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial  Texas Public Radio | TPRZavala County deputy details ties to Robb, confrontation with shooter in ex-Uvalde CISD officer’s trial  KSATJurors hear school police officer talk of ‘mistake’ before Uvalde shooting  CNNCourtroom sees former UCISD officer's interview with Texas Rangers  WOAI",
    "published date": "Wed, 14 Jan 2026 17:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPZ0hodnhPc2hoWkhQN3Z3QVJTTHJSMUlUVXlrd3lKNHdfblNVeURCQ1JGWGZRMW5MaXlzSi1CUlBLemJlMFY1WmdOSnczYlNxWFhxYjhUaFNzRVJtOVpVVS1OU0Ewa0pwTjJqT0ZCdUZ3REkxMGRUYjhWU0NNVDlRaFk2UENRYWxaX2lzZ3BxZXVZc1VVN2JrYmVIWE5lZEZOSXV5OWU0SFE1MWpOWkhZ0gG0AUFVX3lxTE5ERVAtX0J3QzViMHpRUjg1UU9YcG9USHJxWWtRR1FqRV8wX2Mxd1dQVkFxem4xQ3lCSktObmNLVlU4TV9DT2dYVFBlcVVMalNVWmNzVi0zRWpBbFVZVm5wVHgwVDRQR1ZoRGFVaXNjMXpzaEZuR3lqdjlKTjY5dEcyaGdTWEc3bUlrcnVYbGhOTFRuMVd1UVFBaTVabzN1Zk1BYjlhZEJDVnlFWEtYbWh1ZEs4Xw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States  The White House (.gov)Gold and Silver in Modest Retreat After Surging to Record Highs  Bloomberg.comTrump says no critical minerals tariffs for now, will seek overseas supplies  ReutersMinerals at War: Strategic Resources and the Foundations of the U.S. Defense Industrial Base  CSIS | Center for Strategic and International StudiesTrump inks executive order on critical minerals  E&E News by POLITICO",
    "published date": "Wed, 14 Jan 2026 21:23:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxOblowNFl2Ri13UWdOQk1oNk1DNWY2czY5VU9pb1BvTWkyN1VBbnpFd1lMWWRaNC1EbTFhSThhWWsxdlR1NnJZYXEzemNFeWcxblBQakRYRUsxbW5MOHF6bFA1bzc5WXptaFZTRVVSMWFvU202bmkzemNMX3I3N3lfM3k1RDNmZEYzYmh1U0xjXzVHaElBM0JxM2JzUjh0TFJXOGR5MG5xR2Jzazh5X2E3T3dDOWhoQzhUSGo5U0I0NS1BaVlJbXZBZVMtaVFYT2NjYWtfZE5PLVlBSjJuTWdCZjU5c3pkWVdyeGc1Qkw2Ynpwc09mc003S0ZVazVPemlodFJIUHl3NkJ0MDFHV0dicjc1UzAyTjl4azUyWjk1bW1aTXFXeFdnX2pUWWk3S1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday in Minneapolis Including Sexual Predators, Violent Assailants, Domestic Abusers, and Drug Traffickers - Homeland Security (.gov)",
    "description": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday in Minneapolis Including Sexual Predators, Violent Assailants, Domestic Abusers, and Drug Traffickers  Homeland Security (.gov)ICE arrests convicted sexual predator who was allowed to roam free in Minneapolis because of Governor Tim Walz and Mayor Jacob Frey’s sanctuary policies  ICE | U.S. Immigration and Customs Enforcement (.gov)ICE: 13 gang members illegally in US arrested in Minneapolis  NewsNationICE arrests in Minnesota surge include numerous convicted child rapists, killers  Fox News2,400 have been arrested by immigration officials in Twin Cities since Operation Metro Surge began, DHS says  kare11.com",
    "published date": "Wed, 14 Jan 2026 23:39:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQRElzN1FPdTJxRTQ4VkVOMUFjTzZWcnZFUlpoYmFLajBWQVdnenc0THI0NDl1UVRORjNieUlacDdQZEdPcXI1XzNzWktrM0hleDhQSEUyd2oySDgyLUdlOVA2X0FNUmFkSUZzT1R3LXVxQlJoR0FFWlNyZjRTdVh5WHljSlFBek9mZ2V0bzFGOWhKYnBGaXBNMXFxNW83WTBhWUQ1amM1RGNzZno3QUF1Y0libkowQVd1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Federal investigation targets Champlain Valley School District over transgender athlete policy  WCAXUNR under federal probe for alleged Title IX sports violations  mynews4.comTrump administration opens 18 new probes over trans athletes  The Washington PostTrump administration to investigate 2 Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday Telegram",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "Clintons refuse to testify in House Epstein investigation - PBS",
    "description": "Clintons refuse to testify in House Epstein investigation  PBSBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesClintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsWitnesses Testify on the Use of Chemical Abortion Drugs  C-SPANHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The Guardian",
    "published date": "Tue, 13 Jan 2026 16:50:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQNWhua1NnMWpKUlpiYnkzMW5jSE5heUE4RkN6cE5UT1lPRDQ4SDZ1cDN2Tl82QUwyMmFuZ0xUTGh0clVIM3FsX04wUG5Yc01GSmVEdkp3dUhZTmItS2N0b2I4MTNYXzNwRHhrb2FoeXQ1cXh5WUNoZ1dkV2pDLXJOMzJaRG91RDBPMUFJbnFNb1VGSnNTbzRNRkJXb9IBoAFBVV95cUxQSXFKX3VPU1J2VkxONWVudHdia0hMb2VoLVZycTFKeVhlVHdkQUVXRGFuUm1zZFlsaEtDZ2owTlFQQzIyYjhuei02ZVgycHZlLWREYTJEQmh3LWtYZ09DYWNDSkRxWjNFdEdpeTFQM1J6TWlHdG53MENyX1ZyZWpmMHFCUVAwYV9ES3BIVTBxR0V3WjBYV3VmT2s5YTI3Uk1W?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Six Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow - The New York Times",
    "description": "Six Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow  The New York TimesTop federal Minnesota prosecutors officially terminated after dispute over ICE shooting probe  Fox NewsJoe Thompson, Minnesota's top federal fraud prosecutor, quits over ICE shooting probe  MPR NewsJustice Department sees ‘no basis’ for criminal investigation into ICE officer who shot and killed Renee Good, official says  WEAU\"Darkest day\" for rule of law: Ex-federal prosecutors react to U.S. Attorney's Office resignations  CBS News",
    "published date": "Tue, 13 Jan 2026 17:28:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVWdaWUNoaGswUjdPVmp2M25Lc3FkdjgzVkhMOG5tRkZkLTcxRnJLenMwamFpaGJtNHRHQXdKRW1aWGtGdmxZek9mSF9OR2ZRRXRzREItdVdZV2hmTkwtM0FzcHFEd2RnaVR1cXJFd2hVVndUSm13N0Z2TEFLeGUtZ3ZKdDBmX3RGSjRv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Governor Kathy Hochul’s 2026 State of the State: Your Family. Your Future. My Fight. - Governor Kathy Hochul (.gov)",
    "description": "Governor Kathy Hochul’s 2026 State of the State: Your Family. Your Future. My Fight.  Governor Kathy Hochul (.gov)Gov. Hochul's State of the State; Iran \"Prepared\" for War; Supreme Court Hears Arguments on Trans Student Athletes; The 'People's Republic' of Astoria | The Brian Lehrer Show  WNYCStatement From CUNY Chancellor Félix V. Matos Rodríguez on Governor Hochul’s 2026 State of the State  The City University of New YorkLower Bills and ‘Go Bills’: 8 Takeaways From Hochul’s State of the State  The New York TimesWhat’s in the 2026 State of the State?  City & State New York",
    "published date": "Tue, 13 Jan 2026 20:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNU2FEWnJUNnRkVzBUbWZjaXhseURFUjBPWkJ2R1Z6eGJhcVFVemNSZ21uMGk0N0dBVEt5MnZLd0pNQkg5ZWEweFZRazg3VGs3UjJLbzlQMzZQcVVTdzNXaEVubVVaNTlhc1V6MnUzNVpxMTRrS1dZNk5VNlBvX2d1OWo0aEVYYlNDeHU3SE5yaDduS1IxeXBVTmwwSlo2c2Q4cDhNZTFZelM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.governor.ny.gov",
      "title": "Governor Kathy Hochul (.gov)"
    }
  },
  {
    "title": "Texas breaks ACA health insurance open enrollment record - The Texas Tribune",
    "description": "Texas breaks ACA health insurance open enrollment record  The Texas Tribune1.4 million fewer people enrolled in ACA plans as premiums spike, tax credits expire  ABC NewsInitial Obamacare enrollment drops by more than 3,000 Alaskans after subsidies lapse  Anchorage Daily NewsACA enrollment sinks sharply as coverage costs soar in 2026  CBS NewsInitial Obamacare Enrollment Drops by 1.4 Million as Expiring ACA Subsidies Drive Up Premiums  The New York Times",
    "published date": "Tue, 13 Jan 2026 21:58:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPazhYQUxxcTByclpKaG5fMTNscGdhdlRlWTA4aGIwbUx0dXRDNzZ5U3R1RHI1OXlTeU50M29fUVVsVTM1UUxSQ1ZFSXhhSjFZTFY0b21uUklvRE54dXFRbjZVSDBHSjNJdjRaTWNDLV8tTjcwQ2ctc0ZDTl9qRFIxdTktZXhsbU5yTjFMV1BOT0p2WGNCRVBTS0NEZTNjNUhRN1dr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "2025 was Earth's 3rd-warmest year as climate impacts intensify - ABC News",
    "description": "2025 was Earth's 3rd-warmest year as climate impacts intensify  ABC News2025 was the third-hottest year ever recorded on Earth, data shows  NBC NewsHow Hot Was Your Town Last Year? Look Up Where You Live.  The New York TimesScientists call another near-record hot year a 'warning shot' from a shifting climate  NPR11-year streak of record global warming continues, UN weather agency warns  UN News",
    "published date": "Wed, 14 Jan 2026 03:04:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPSURaVkZMbG1OZ2p4ZXh4SlVfN1lQcG9VUGNJbjdCT0tOdXJ3eEhuOVFrYW9wNGdrSVZrWDhYTnlneWlwbFBaS2dOLWJ6LWtDT2pxXzBlSXpFZW5teFF0VkJUTDBLLXU2YVlBejNFT0RVU0pHUGd3OGxRTC1Iby1VVlRBWk45NWZMVFdObWZ1YlJYaVU5SE1aN0FWTzNvUFdE0gGmAUFVX3lxTE1Yem85NXJlZUNWTENlY0thQk05U1NxYjB2VEI2enI0ek1Wa1VYbWxXTDA2dGNmYjlvTDBIXzZ3d29ZUGhwT00zYkpsMlYzdVNHeXlTemhNbEIyWjVxMV93amxpV3hUMGlSaUM4MHZtenprNkJRSmpocWhWNzhWRHhObEN1UXZFV2xUYU9rYmZhTUxfN0ZuTU10N1ctXzlvUzRPNVIwakE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival - The White House (.gov)",
    "description": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival  The White House (.gov)Trump in Michigan for speech to Detroit Economic Club: Watch replay  Detroit Free PressHere’s how Michigan voters feel about Trump’s handling of the economy, according to poll  ClickOnDetroit | WDIV Local 4‘It’s literally terrifying’: Hundreds protest in Detroit amidst clash with police, Trump supporters  MLive.comTrump boasts of 'economic boom' as voters remain concerned about high prices  ABC News",
    "published date": "Tue, 13 Jan 2026 22:23:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQcUNTVDhuamswRjdtUEJka0Z2b3JzVmo2Z3RqWXRqem5DdXYzanBVX0VTWWdlNksyZTZpNUJMZVNuazA0U3NuZUFMYkVNelhHNlZTZzk3OWV5dHZlOXZuRUdBZzMxT3dRT1NIblg5NU4xSHZGWURXa1Y5SnVVLXR3VFlnNk5vb3VVY0ZfVU5vem4zQTdEX2lQMmhNdEJvdXRMdVJqZmo4ck10UUUzMDB2Zk5hYTMwdmtxR1gw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State - Iowa Capital Dispatch",
    "description": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State  Iowa Capital DispatchRob Sand 'concerned about what we didn't hear' in Reynolds' address  The Des Moines RegisterRob Sand: ‘I would like to see the math on it’  KTIVWATCH AT 6PM: Iowa’s 2026 Condition of the State Address  KWQCWhat the governor’s property tax plan could mean for city and county services in Iowa  KCCI",
    "published date": "Wed, 14 Jan 2026 02:37:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWC1mYmdQRUgtTW9mSExxTnpLczU3bDZmSUhELWpXRFVrV1pYSGRpSkJ3bmY5aFo3QXNYVW80cmgtdUQ4RDF1QTNldGJmaDVDLVVoZ2t0N09iWGQ4UGxLUVF6clIwSFlyX3lnbkVNRWZVYk9iaDRGWUxhLTVLQjdLczNFTGRqU2dycUV3VTVKU2tuVzFLckEtNC1WNVRpR2puNHR4c3ZsU0dQRFJIYmYzNlNsRkl4TEhVNk1IbEpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://iowacapitaldispatch.com",
      "title": "Iowa Capital Dispatch"
    }
  },
  {
    "title": "E.P.A. Moves to Limit States’ Ability to Block Pipelines - The New York Times",
    "description": "E.P.A. Moves to Limit States’ Ability to Block Pipelines  The New York TimesNew EPA Proposal Would Strip States’ and Tribes’ Authority to Block Oil and Gas Pipelines, Other Infrastructure Projects  Inside Climate NewsTrump set to limit states' ability to block energy projects in water rule  ReutersEPA proposes limiting power of states and tribes to block major projects over water concerns  AP NewsProposed WOTUS rule could ease federal regulatory burdens, but questions remain for states  Brownfield Ag News",
    "published date": "Tue, 13 Jan 2026 17:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNU2NHRnRPQW9iZDBCdVREbUVkaWZRSTBRdHlaNHJGdmt4VURacWU3SFNCNklWVTdhc2VnSHZKbDNxbEZ5LVlKblZfTVVZdDJRRzZHc2d0ckg4Y181Y1BZQ0hTaHhxc0d1UlFzWE5yRjdBaDRQMkF2eWRXUFp6bW9vUTln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families - SF.gov",
    "description": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families  SF.govSan Francisco Expands Child Care Subsidies to Tackle Affordability Issues  KQEDMayor Lurie rolls out new affordability push. Here’s his first move  San Francisco ChronicleSan Francisco to Offer Free Child Care for Families Earning Up to $230,000  Bloomberg.comFamily Opportunity Agenda: San Francisco promising free or reduced cost child care; pathway for students to attend college  ABC7 San Francisco",
    "published date": "Wed, 14 Jan 2026 17:08:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNSlNxT0lHOTA5N3lkdVJldW5oNGVUZFJqWVV1MVlnUHpZVWRkb0hhVWZzd1R6X21pejBRYi1JWnpTZjN5ZEx6OWFVbzV0a2JaMkdmU00wbzM2MlFoV0pOYTFxN3VJdFExdmRNcTk0T1NZUkJ4bjNfczBXRS00V3hTdVZFNTFaVnIwT0owdTZ3TWNYeUhGV1NjTUFTZXd3Umtmc090NjQ5Zlgwc1hSSGZYeG5BRllyMXFOVVdNWFpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sf.gov",
      "title": "SF.gov"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax - Missouri Independent",
    "description": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax  Missouri IndependentMissouri revenue surplus nearly gone as Gov. Mike Kehoe unveils his budget plan  Missouri IndependentGov. Kehoe asking legislature to have Missourians vote on phasing out income tax  Spectrum NewsNationwide Tax Competition Heats Up as Missouri Governor Calls for Zero Income Tax  Americans for Tax ReformGovernor's budget calls for major cuts to spending as revenues wane  Columbia Missourian",
    "published date": "Wed, 14 Jan 2026 01:35:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPSTRGZ2s2RXRzMlNOWUpUa3pUaXdVZk1ab2RGT3B3NGFKeWFxU1U4YWxxRV9DMFYzbEZkWjByQ3hUS05XTVZCaUF1QnllRWpZWEpDVHk4MVVPcHNWLVdTR1ZDQmRHMDRUdTNyWjkweGpESjNGTFRVMlZwLVE1VzBldXozeFNqTDBnVEYyN09iNUJCekdWVjNxQ1A2M2VDOXpWOUtFRWtEMExyY1hpYXBWVm41bVRuQVNZTXhxbWN1aEQ3TXE2eEVPcFlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://missouriindependent.com",
      "title": "Missouri Independent"
    }
  },
  {
    "title": "19-year-old suspect in Mississippi synagogue fire indicted on state hate crime charges - ABC News",
    "description": "19-year-old suspect in Mississippi synagogue fire indicted on state hate crime charges  ABC NewsStephen Spencer Pittman: What we know about Mississippi synagogue fire suspect  CNNBurned books, children’s questions: The aftermath of an attack on Mississippi’s largest synagogue  NBC NewsFather pleaded with son to come home prior to starting synagogue fire, court docs show  WLBTOpinion: For Memphis Jews, the arson attack in Jackson is painfully close to home  Daily Memphian",
    "published date": "Tue, 13 Jan 2026 13:31:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPM2RRNW9nUXZHYVYtTXB5YVhUMFdsM2J6XzZNU1k5YTRJNm9ITC1Ra1lORmxad0k5aTNaM3NrV2gzQUg2QlN0dzdVRTZzQjR6OWpHQlZ4dmQwYTEwbnhqeml5MmVvYWpmUUVldkNaSzVpVVpjTk9uZS1XQ2tab2N5NlpSVjVybk1sUk4zMzR3UmFtVEREb1dMMmFZU0swNXRlbHVyeUlRSXZfbVZH0gGyAUFVX3lxTE5hRWF4eTVzeFBpVEZqZm13cm1yQy1lcDlVY1I4TkRoc292OEc5ZWE2N3c1T2pyOEt1eUlOU2NEbnNPam1CWnBsdXV0X1FYQXdXREhwZWI3bE1BbkUzdFB1YnQxZ0FTSXgxblIxUENuUnVuY05jNVBwTnFHV1JrMTZIa2RXU1JpWVItek5XV2pzRHgzSWl3YlYzek80SFZSNHBmd2RjSDM2QWJrZGRpS200ZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Man caught on camera saving 2 toddlers on Florida highway - ABC News",
    "description": "Man caught on camera saving 2 toddlers on Florida highway  ABC NewsWATCH: Man rescues wandering toddlers from middle of busy A1A traffic in Brevard County  WESHGood Samaritan rescues toddlers who wandered onto A1A in Cocoa Beach  FOX 35 OrlandoDad of 5 Rushes to Save 2 Toddlers from Busy Road. Family Had No Idea Children Had Escaped, He Says  People.com‘Terrified’ stranger rescues pair of toddlers who wandered onto busy Florida roadway: video  New York Post",
    "published date": "Thu, 15 Jan 2026 04:57:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPbkxDc2JnRFdfa0tFZGszejdWajdXQXhmR0diWlVoQ0FKTGd5YkFyQ0Z5WWpJYVZkMV9SdnBlcnlPTEpnT28tOWhuWHlLY1hhOFYzOTY1bWZ2M2pkRl9PRmhWamRXNmVBelE4ZXVXNGsyd1B0dEpJbGdJQk8ydzktaC1VTGxiTEdSXzhLMmxfczNQSkJaVDdkOEFZMlZ6ckgxdHFwTGs0c9IBrAFBVV95cUxOMk9IeExYRlNJeVVsYnpWQWdRV255RTFLYWJBZnZhMVRqaHlrcVdGS2lTWERJaGhOZDJWdkxOWWpVbDM5SnRlV1NwTW1xRU5sdjZPc3VuQXNsbVhBVENtenpVcGk0eFBXTGdDeTYxY2lxT2ttNElEUGFnM05LQ29aRFdlTlZjdDNmYTRIdzBGN1BFRGUwbGJiUUg3X2lmWk1CMmw3Z2o2eFpoTUpj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Office of Public Affairs | Kaiser Permanente Affiliates Pay $556M to Resolve False Claims Act Allegations - Department of Justice (.gov)",
    "description": "Office of Public Affairs | Kaiser Permanente Affiliates Pay $556M to Resolve False Claims Act Allegations  Department of Justice (.gov)Kaiser Permanente Settles Medicare Fraud Claims for $556 Million  The New York TimesKaiser affiliates to pay $556 million in Medicare fraud scheme  San Francisco ChronicleKaiser Settles Medicare Fraud Allegations for $556 Million  Bloomberg.comWhistleblower Partners: Kaiser Permanente to Pay $556 Million to Resolve Whistleblower Litigation Over Medicare Advantage Risk-Adjustment Practices  WV News",
    "published date": "Wed, 14 Jan 2026 20:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQcHdJb2laY3NsVVRtQ1Z1dmJVWHlYYnI0bXJ3ak1MS0MxNVBKU0tGWG9wMzJzZTJLRU5kSnc4MDlNZzU3YVVTTmhTbmNqRERYcG9QdlVWb0VIRThnbjJKNXB1b3lrUGQ5TmZyRGFjT29Xd2hLaTNxZEY0NlJ0MnJVQnpjVm5yb2ppTVM5cnJZLXJjOUZuUEJlbU9WZ2NFZm5VTk1qdUE2VEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Trump administration drops fight to tie transportation funding to immigration - Politico",
    "description": "Trump administration drops fight to tie transportation funding to immigration  PoliticoUS drops appeal of order blocking Trump plan to tie state transportation funds to immigration enforcement  ReutersDOT ‘Accepted Defeat’ in Fight to Tie Funds to Immigration: California AG  NOTUS — News of the United StatesUSDOT drops case after court’s decision to block it from withholding funds over immigration enforcement  CDLLifeTrump Administration Waves White Flag on Transportation Funding Immigration Fight, But the War is Far From Over  FreightWaves",
    "published date": "Tue, 13 Jan 2026 19:48:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOdTE5TzhKSTF2MUZYZE1jby1Zb0lnSko1NFR3bFVTTjFsM1VQWENKVjhrTkJOQ2NLU1lsd3hHeVRPbFhDS21DTWVSR3VfWUI3UjZ6eFlpUzN5SG56STNWc1paLUVha05DLWJnZU10azlsNTFEZ2VoQTNRVnZfbVJpbGxZZGJDQkh5eU1Dc0lkYTJrRVpE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders - WPR",
    "description": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders  WPRWhat to know about child grooming, E-Verify and other passed bills  Milwaukee Journal SentinelWisconsin Assembly passes bill to criminalize grooming  Channel 3000Assembly approves constitutional amendments on discrimination, closing places of worship during emergencies  WisPoliticsState Assembly returns for first floor session of 2026  Spectrum News 1",
    "published date": "Wed, 14 Jan 2026 15:39:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS1hYZFdWLWJiR2p0dnZzT242REtlRDVCWTRUeWhVTWFUMFM3OTQxSUVKNXlaRERLMmtxVGlFdEVQcnJMbjJrZkJuSkw4UFFrNFRLTDVZYzRHS2t1aEpmak1xRlZtMVhDR2dNWDg3OTFQUFFleDFXSGw3V2lnS09SclpWSWZPS1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wpr.org",
      "title": "WPR"
    }
  },
  {
    "title": "Immigration Detention Expansion in Trump’s Second Term - American Immigration Council",
    "description": "Immigration Detention Expansion in Trump’s Second Term  American Immigration CouncilFour migrants die in US immigration custody over first 10 days of 2026  ReutersICE Detention Expands Dramatically; 70,000 Immigrants Now Jailed, Deaths Increase  Democracy Now!Five key ways ICE detention centers are booming under Trump  USA Today4 migrants die in US custody over first 10 days of year  The Hill",
    "published date": "Wed, 14 Jan 2026 15:03:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5DdGwyR2ZLVE5jT2tZMWtkRXpER2E2ZUlnSFp4WS1JdUdVUVhhNldoZzd3bW1RdElfQzY2bXdFWFVieVFfQWI5VGd2dXY0TUVoWHBMcHJGczNseTlkdE9NYXJDTzI5eEFySXFZTDJIckdWREMteEZ6MkllTkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.americanimmigrationcouncil.org",
      "title": "American Immigration Council"
    }
  },
  {
    "title": "Scoop: Trump's envoy secretly met Iran's exiled crown prince - Axios",
    "description": "Scoop: Trump's envoy secretly met Iran's exiled crown prince  AxiosExclusive: Trump questions Reza Pahlavi's ability to garner support in Iran  ReutersReza Pahlavi, Son of Deposed Shah of Iran, Seeks Center Stage Amid Protests  The New York TimesWho is Reza Pahlavi? The exiled ‘prince’ urging Iranians to ‘seize cities’  Al JazeeraWould-Be Iran Monarch Reza Pahlavi Declares a Civil War in Iran  The Intercept",
    "published date": "Tue, 13 Jan 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOW5xN1ZSa0tLcy1INlFYV0U2M2VDVE40NTFPV2RGZ1c4TTh2VFp3NkwtZUtjUmFNd184OXhnZ3hfZjBSaWRIT1ltNXFOUGxUYjJ6ZzJibkdhUVMwWUIxRENxSnA1d1RYcEJfdmxXXzRmRWVVc2NQazhYNl8tc0ZxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos - ABC News",
    "description": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos  ABC NewsEx-SC Rep. RJ May sentenced to federal prison on child sex abuse material charges  WIS News 10Ex-lawmaker who advocated protecting kids gets 17 years in prison for sharing child sex abuse videos  AP NewsJudge slams ex-SC Rep. RJ May with prison term on child porn distribution charges  The StateDisgraced former lawmaker RJ May sentenced on child porn charges  WCIV",
    "published date": "Wed, 14 Jan 2026 05:45:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOVDRvZVdEb09JSmVLcm5yUDhPTTJFN1N2MWR0MzJxTElOcWtTR2RUclVVTWZYNWU3NWZNb1VLVURuNUlmaThibXBvdmFveFZyaTg2Y3BaNkZrRDEtV3ZYa3pueTRYaGllTXpKbHNXbkl1SUZKakdoYlNUWFhIV2ZOZ21fbXdzcENkLTFEclpyZ1dCRDdiRTR1bFpMZUVTYTYyOVRIQWxsUzNKQdIBrwFBVV95cUxNbWRuUjBzS1NycEM5NkVFZkh4TlozcVBRdFRPenM4d1NEb2VKQWU1cHQwbmdIM2NiV0hySy1wWUNYSFlDYTBkeDRfVl9aUVp1Q3VldUNFamxFQ3R4cHpXMzdtU000NEI2VllhbUFJZURhNllQOGtQOVh5LVhQOHllTWFyaDdCOUtzUE9qQ2VNZDhCanRxUVdwYXlKOFlKaW55Q1ZyUEdXRktjTEgzVzlZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Everything you need to know about Montana’s rural health windfall - Montana Free Press",
    "description": "Everything you need to know about Montana’s rural health windfall  Montana Free PressStates Race To Launch Rural Health Transformation Plans  KFF Health NewsRural health program will send $181 million to Washington state  Gig Harbor NowIs the $50B Rural Health Fund Enough to Save Rural Hospitals?  Health US NewsState outlines plan for $213M rural health award as lawmakers weigh SNAP waivers  Carolina Journal",
    "published date": "Tue, 13 Jan 2026 18:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNOWFVb0RFOEJtc2k1V1I3R3VXZnBLcUlRUXJ6UnctTkFPN2diZDdhT0FYU2l1ckwwQzhFZzlWMTRfZW92WF9kaWZ5VURjWlk4RjVONkx4LUVJUURnaXI4eDc5ZFk4S1kyRnVhcnpld2VMQk5UakZ1dC1FYVN1eTk2eFU0b0NGaGEzLWxQLUVhUkZPNGRQaUktWnVCM1pBaDZwVWZRcEZjN3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montanafreepress.org",
      "title": "Montana Free Press"
    }
  },
  {
    "title": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad - PBS",
    "description": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad  PBSWhat Americans think about Trump's military intervention abroad, according to a new AP-NORC poll  AP NewsAmericans not on board with Trump's military interventions, polls say  USA TodayFewer want the U.S. to take an active role in global affairs  AP-NORCSupport for military action in Venezuela is growing though more still oppose it  YouGov",
    "published date": "Wed, 14 Jan 2026 18:26:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNaWNFR2hpYkk1RVdfU0syYl9uZXJkc2FXeVBwOVJzR0xZeDU4cG5FUXd0Q0JpUDdzVjNmTjVpWDNkWTVkYXFjNzc5ZWRESFBJWEJvb2lBTlVEbjR6OFg3YnJYbVdVOXZaZE1yVnhHeXI5VUVkaFlPTzJrOFpnSG12UjNRb2laRzZ5SFNiNWxleDNiZzhmS3NDQ2F6dWZuU0lQZ3Y2VmtSZktTallXN194SGhDUnVyblZJU0pBckVfMHpkZVXSAcgBQVVfeXFMT3k0VjRzcDc0a1g1RUdkOWdlcUxKYlhoY2xJX1Npa2pYbGNSdi1TOHhscjl3TzBFUjg5UWZ6ZC1sNEpEUlBaYXp1M21pUl9fejhoMmV2WU9ydGpsMFNZdi1RbHpVY3BHNnBNRTRMT2otbHl5akFJcXpVeHlNUGJ6Q0VNLVVLQ1VHV3VBZ1dJanRJaVhWVjVUazU3SU9nSFlibGlWNFhrTml5aUpQekFsU25teHhWZVk1ZVREUS1yNktpVEJTUW1Jcng?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Why unlocking Venezuelan oil won’t mean much for US energy prices - The Conversation",
    "description": "Why unlocking Venezuelan oil won’t mean much for US energy prices  The ConversationU.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTop Atlanta CEO: U.S. action in Venezuela ‘massive pivot’ in energy  AJC.comThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  FortuneExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Tue, 13 Jan 2026 18:39:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNQlZwbklfZW84Z1VyYzJLLTc1S3gtcUNWSC1ETjE4NlUwdXZDQ0VPREVvLWlXVk9CZFJHTkVZMDNPazZvVlRIWlBKcjNmRWVrS0VNODdITjhWWFRrR0ZOOEdObWY2UFM2cXFuX2E1S2l6SkZ3Z1lDNHZqMWYzdDUwSU5OZ3k1LVhSWi04Qm9BUzA5UkdRVWN0R3VrQTJhMVRi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Proposed ban on police face coverings gains momentum in WA Legislature - Washington State Standard",
    "description": "Proposed ban on police face coverings gains momentum in WA Legislature  Washington State StandardOregon, Washington consider bans on law enforcement masks to conceal identities  KATUOklahoma bill seeks to ban masks for local law enforcement in immigration operations  KOCOWA lawmakers move to ban law enforcement from covering their faces  The Seattle TimesFerguson urges lawmakers to ban law enforcement from wearing masks  The Spokesman-Review",
    "published date": "Tue, 13 Jan 2026 23:59:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQSTl5bjFJVUE0cExobjY4eFZ5U09WSWRjQ3JGSEgtQzBERHJib3phQTdzS3FqTVdEaXVraG1HWXJONm1ybWJZYzR2dGlPV3ZTZk1hQ09TdzJzV3VMaFJwRExzNTA4S0dTbkVhVVhvc1Zrd1F4NV9pd1IxZmg3NnNhcWVQYWFXTEV4eHdoVnBjWXdZZmtoSzUycTZya0d6ZjdEOXc1WFhXVkRPNEJBR082eURrSklmNWY5Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://washingtonstatestandard.com",
      "title": "Washington State Standard"
    }
  },
  {
    "title": "CONGRESSMAN PAT RYAN LAUNCHES HUDSON VALLEY WIDE PETITION TO STOP PROPOSED ICE FACILITY IN CHESTER - House.gov",
    "description": "CONGRESSMAN PAT RYAN LAUNCHES HUDSON VALLEY WIDE PETITION TO STOP PROPOSED ICE FACILITY IN CHESTER  House.govICE Opening Huge Lockup 50 Miles North of New York City  THE CITY - NYC NewsConcerns raised about potential plan to turn vacant Woodbury warehouse into ICE detention facility  kare11.comPossible ICE detention center in Orange County, N.Y., has residents concerned. Here's what we know.  CBS NewsTrump preparing to warehouse immigrants like cargo  Baptist News Global",
    "published date": "Tue, 13 Jan 2026 17:09:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNa2UxbGxrME92dHA0eEFDRmlqN25YQ2dzVEwtVjh0Z3hYWEZmMTJScWxVLXlXMnh5RXZ0NXNOYXBxS3lYdTA3anZibEJISVVlSXpfWUpCSDUtR3pCRUNQamhQd2FHME5zT2Vob0NOUGd2aWNlYWFfa3BCOGhETFc5aGJ6QktUdXRjdEdzSm5RM3VFaFZHa2ZRVm9zWS1SYVIxV21rZlQzUXA3LWtiMlZxR01qMDByNmhWR2RXbVJTNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://patryan.house.gov",
      "title": "House.gov"
    }
  },
  {
    "title": "Claudette Colvin, who refused to move seats on a bus at start of civil rights movement, dies at 86 - ABC News",
    "description": "Claudette Colvin, who refused to move seats on a bus at start of civil rights movement, dies at 86  ABC NewsClaudette Colvin, US civil rights pioneer arrested for not giving up bus seat, dies aged 86  The GuardianClaudette Colvin, US civil rights pioneer, dies at 86  BBCClaudette Colvin, who helped spark the civil rights movement, has died  NPRClaudette Colvin, Who Refused to Give Her Bus Seat to a White Woman, Dies at 86  The New York Times",
    "published date": "Tue, 13 Jan 2026 22:33:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTFdydVc5X3hMcl9ZTUZfY0lFcG5LN2VkanpXWnZLcy1BQndSVXFhZ1BwNkozdHFuRXpCTjY4MWwyYktJTXFCdmRrWi1rT2pUUHZEZ2Y3YkUyM3BDMGp2bGp6TjlYcDU3VUtfLS1LZXlHd1hWYjFrYXUydWVYS0xtMFVQcGpQTGpIbGlkNXlfcDNJTmc4VGJPU0NyVWNZZ9IBowFBVV95cUxNeWE0WWxFLU4tRW9vVjFYY0ZLV0NBOUFxb2pqUVM2R2RyNDRUc0NMVzl0UHJBMk1IeDBXYWQ3UDJkU01uWGFleTlIN1hvUm8wLVFubmdqQUxwdFJ4U2VpYzFaT1VCREZKbDJEX0o1WDdMNjhTS1o5Qjk2RGh0TUppOFRvLTRmMHNpQUt1Nkwwc3JFMlVyWHcxUjR6STJzaEZDSkJZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Vanderbilt University to establish full-time academic campus in San Francisco - Vanderbilt University",
    "description": "Vanderbilt University to establish full-time academic campus in San Francisco  Vanderbilt UniversityExclusive: Vanderbilt deal includes second property — an upscale East Bay site slated for housing  San Francisco ChronicleThe California College of the Arts will close in 2027  The Art NewspaperPrestigious university to open new campus in San Francisco  SFGATEWhy a 150-year-old Nashville university is opening an SF campus  San Francisco Examiner",
    "published date": "Tue, 13 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNeVpVd1F3aWJ6M2VYYlpKMENZQTdmemVIMnJUZDcxZW5HZ19zam1hU2h5OGJEX2Ywc0prME9qcm00MU9UZFpVNWFQM0ozSHp6R3dTVmNGQ1NFUU1hTWZ2NE45VEU5NFpoYXpvUVpUN3p3VzFobDBQQ1liX2d6UW1CRkhXWXAwNEhmb3dYY2VaS2dOQ05zMU1LRElLWVdJeVdCSFlTSmhQX29obThJMFlMS1ZEZHcyUFZu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.vanderbilt.edu",
      "title": "Vanderbilt University"
    }
  },
  {
    "title": "ICE Arrests Criminal Illegal Alien Employed by New York City Council - Homeland Security (.gov)",
    "description": "ICE Arrests Criminal Illegal Alien Employed by New York City Council  Homeland Security (.gov)DHS exposes background of NYC city council employee after Mamdani fumed over arrest  Fox NewsICE Arrests N.Y.C. City Council Employee at Routine Appointment  The New York TimesNYC Council employee detained by ICE, Speaker Menin reports  FOX 5 New YorkAnger Builds Over Arrest of Venezuelan Council Staffer As New Details Emerge  THE CITY - NYC News",
    "published date": "Tue, 13 Jan 2026 23:33:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWDBwSGcyMGNCWkZvUklodGhza0Nqc1RPaHBvQTlKRUV0M2IyNXpfQUtNMmNKN3pLN1RRT3RmMkpIaFNTaVcwVU5JZkdFYU9sU1NYd1NRYzF5ZG5lWTJNQWo3MmQyMmdEb2JGUlNwbDl4LThwdnhydVJnUEdfdEVucUtaRkNVTjQ4dVFPMHo0TjZ3cEwyZVcwQ1RiZTNLZ0pfZzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation - USCIS (.gov)",
    "description": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation  USCIS (.gov)DHS announces termination of protected status for Somalis after group targeted by Trump  ABC NewsTrump administration ends temporary protected status for thousands of Somalis in US  Fox NewsPhotojournalist's notebook: Watching a woman dragged away pleading, 'I'm just trying to get to the doctor'  MPR NewsData reveals estimated Somali immigrant population in Ohio as White House ends TPS  WLWT",
    "published date": "Tue, 13 Jan 2026 17:48:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPcWdVSmYxUUx0U3pNamF4WkdDMlZjTWVpcE94cUdSSTVNeTAzYlpSMEpMal96LXJtanRybVJFVFRiSXVFV0tnQ3JXQ1NaLW1XTjJBMVB0RGlEaHpMUlVyQmU0MnJQbkpJZlVaUHlqWG5BSl9EZC14LWVJdlp0bVRienVGREtDZmtWa0cyTW83M3ZzOTYtbHU2U3V2cU5MaEpzTlFza1dyR1ZQRmp2bmhEVld4SnNWZXpXS0V3X2hB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.uscis.gov",
      "title": "USCIS (.gov)"
    }
  },
  {
    "title": "Best friends die in Florida after sand hole traps them underground: Sheriff - ABC News",
    "description": "Best friends die in Florida after sand hole traps them underground: Sheriff  ABC NewsCitrus County family of teen who died after tunnel collapse donates organs: 'A blessing in all this tragedy'  FOX 13 Tampa Bay‘God’s got him’: Honor walk held at Gainesville hospital for teen killed in sandpit collapse  WCJBChild dies after tunnel collapse near Citrus County park  Bay News 9Two teens dead after hand-dug tunnel with 'sugar sand' collapses in Florida  FOX Weather",
    "published date": "Wed, 14 Jan 2026 16:53:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdGlKYnA5Z1Q1U20zUDJRMW1qNDc5Q3Vka0xFaTJFbG9MTjA3aG5xX1VZZWFHT0s2cUZ1WXdIWG5YVWlNSnluMnVOQmtUMzFTWmhVT3ZIMmtIQWcwRjdvcjM4MEdrRE1lUk5nMS1nRHRpR05JRG1tTWMyNm1ydV9lYmJ5Q1NSeTBycV9ELUxWQms5MWhvdUHSAZsBQVVfeXFMTTI4YXZtNVViMTBoSmVWX1B1SmQ2SWkwYVUtSUx1Y0JRRlZrWkJqT1JpUDJGYzBfN0JtN0RXdkdRYnZOMWNXSVpCUE1zMm11aVYyaVVPSml0eDBCeGJOSnlhcEJyclZ3T3ZXZjZNRGk3Qm9DVlFCTE9UY2ZDRnhnUVpSNmZOcVJ4cTRPbmc5bUQwZHVkN1l4aFp0bGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Ferguson delivers optimistic WA State of the State, urges action on key issues - KOMO",
    "description": "Ferguson delivers optimistic WA State of the State, urges action on key issues  KOMOState of WA: Ferguson drops maverick tone, backs income tax on the wealthy  The Seattle TimesGov. Ferguson says his budget proposal is 'laser focused' on improvements  king5.comWA Gov. Ferguson calls for millionaires’ tax in State of the State address  FOX 13 SeattleWhat WA Gov. Bob Ferguson said, and left unsaid, in his State of the State address  Washington State Standard",
    "published date": "Wed, 14 Jan 2026 00:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugJBVV95cUxNT2pWdHpIZjhxb215MnpuanJtMUFVektwUUZmeTAxRUdmU3FZalVHcTgycWJ2eFFscXItUUJWZlBIcHFHbnNSZVN0azVwNjI2Z3NLRTlyUG16QTJfNFc2YnpzZkJ0cTNkdTNPbGZBY2lDa0ZENFdaMGsyNHQzb0s2bzh3NDI4QlNOOXlXVUpZWjNoNzRTVFVmZFEwSktkU2NGYURBUmxVQnoxOUpiZkMySzJ6YlpybnhlLXJNQ0dRYlRQWmc4MXpadTJuZmNvSmxmSXMxaVBURkt2R1dvRnMyaTJ6cFRPSE9FZkNhVWgwaXJMZDdsTGJmZ1pnY3NzanB5Zy1yaWgySUI5QlRjSE4zMUx3NW1TcWRpUHFXX0VqU3AwWHJxTVVOenZKNU5uRHRaSFdGb1BTS2lMQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws - Quinnipiac University Poll",
    "description": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University Poll5 takeaways from new polls of the Minneapolis ICE shooting  CNNMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGov46 percent in new poll support abolishing ICE, 43 percent oppose  The HillNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  Yahoo",
    "published date": "Tue, 13 Jan 2026 17:55:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1sYVJOZTRIcFFwLXFwRDl0ZUgyRDQxMkpXSTBIM01jazhZR1A2YVA3S2cwekFMeG1EenpMQkFENGJOak15T0UwVTJBZGNMSExiSHowa1pabElhSTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad - Homeland Security (.gov)",
    "description": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad  Homeland Security (.gov)Trump admin drops one-year religious visa wait period  The PillarHomeland Security cuts down wait times for religious worker visas  wng.orgUPDATE: Homeland Security Department says rule will address religious worker visa backlog  Catholic News AgencyUS bishops praise DHS policy change on wait times for religious worker visas  TheCatholicSpirit.com",
    "published date": "Wed, 14 Jan 2026 16:58:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOZEVpTTFkOHJHZHF6OHpybDNKaXN6SmJ0WGttQ1NiWHF5Q1NGMjBIdWJSMzYzQmxjYWQzRjlPVnJsS2JRNjcwNm1PT2ZzaWhvSXdHMEhqUDNaV3JVUmJJckNMUkVjUUFQV1MyRkZseHFuSkZyRV90WkpaMnNWbzNEMUh2bDVxUm1YSUt3cFlCbHo0ODgzaEczYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Trump administration says Venezuela has released jailed US citizens - BBC",
    "description": "Trump administration says Venezuela has released jailed US citizens  BBCMultiple Americans detained in Venezuela have been released, State Department says  NBC NewsInterim Venezuelan government frees at least 4 Americans  CNNWhat Will Become of Venezuela’s Political Prisoners?  The New YorkerVenezuela Frees US Citizen Amid Gradual Prisoner Releases  Bloomberg.com",
    "published date": "Wed, 14 Jan 2026 11:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5odGtyOFNNajRyRGxaYzkwcUxvalhPdnZWUXd5c3FYeFlwWEs2UTVaZ3o5aEJoQ2FSNkhVR09HTHRxR3Yyd3NsZ2gwa292bEJPSEY5Q005ekNBQdIBX0FVX3lxTFB5LVJ4c2RqVGhjVXhjYVA0cGNIS0ttQXhYakhEa3J4Y1FRWF9QQUUwakFfaGExYnZBd3QwejVrR0JsaXpUS2xMYU1jdlE4MW1EM3pfaU5iQTM3TVNhZmRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity - The Columbian",
    "description": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity  The ColumbianMadison high school students walk out, protest ICE actions  WKOWMadison students walk out to protest ICE enforcement  Channel 3000'The next voice of America': Hundreds of students across Spokane skip class in protest of ICE, killing of Minneapolis woman  The Spokesman-ReviewSpokane high school students walk out to protest deadly Minneapolis ICE shooting  KREM",
    "published date": "Wed, 14 Jan 2026 02:32:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQNmlMbkVnLTJKalNOME9YR2VQTENlSXozN2piOGlfMlBCRHlmb2dKcHVVbEVjQXJ3OWllVnAyb29PZjZ3UXZ2cXl4SUl5d0xkZWREaERkYng1UWszc3lweE1RYnRTWjJJaGJjTUwxLXhoSjRaN1FIeGljYkx2MlZ4UGRSbjQ2dlJ6RGg1V0x6ZHZIVUtuczhVS0pqWVdWSU5jWHRuM0N1bWRsY2FRemVXOGxaa3dvSmRfdndKUEp2SmJVbWJGN0FYdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.columbian.com",
      "title": "The Columbian"
    }
  },
  {
    "title": "Kansas City’s Liberty Tree is coming down. The giant oak is older than the United States - KCUR",
    "description": "Kansas City’s Liberty Tree is coming down. The giant oak is older than the United States  KCURKansas City bids farewell to one of Missouri’s oldest oaks  KCTVFamous 250-year-old Kansas City tree 'Frank' officially being removed Wednesday  KSHB 41 Kansas CityCenturies-old 'Frank the Liberty Tree' gets cut down  NPRLiberty Tree Removal Sparks Memories and Collaborations  Northeast News KC",
    "published date": "Tue, 13 Jan 2026 09:02:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPS3BRRXNNa1ljNGJCRUZUS0d5NW1UaEFvcjVxekVTbUpJS1Jwd3hUOHJUeVcyNjRpRVh1c2VOWkltZmJzMm5YWUctN1lTSnp5QVpvOGp0M1JvRVNCUENnQmhKenpMMFJBUDczcklSSF84WUpObVNfR3d3U0VnMTk3NEtHQWw0RUJqeW82UHozU1BJdnpXZVRUckJSa21acGZUSVB5YjdvTTVOQXE1VTdJaFd4bzJBNGhITHhKeHcwMVRpTlFKdmNLdUFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kcur.org",
      "title": "KCUR"
    }
  },
  {
    "title": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds - Department of Justice (.gov)",
    "description": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds  Department of Justice (.gov)Once-revered trans activist Ruby Corado gets prison time in fraud case  The Washington PostCasa Ruby founder sentenced to 33 months, told to pay nearly $1M for ‘diversion of COVID-relief funds’  WTOP'You betrayed this country' | LGBTQ activist Ruby Corado sentenced to 33 months in federal prison  WUSA9Casa Ruby founder ordered to pay $956k restitution for stealing from LGBT nonprofit  WJLA",
    "published date": "Tue, 13 Jan 2026 21:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQMmIxOWFLSWtrMWplZl9NRW1EYkQ2UUI3czBqbFNZNGFlSGFNRTcyLTVuczFvVGVsYkpVbnNwLUdRc3d1U2ZOSm04NVA0aXF4X3Y0b1FMNEl4ZzJ6blR2cl9oMnoteGxCOUNETGZQV0FLaUt5cWV4QmxMcHNlUGI5aUltU3k2YndlNmZtWlVCeVFOQ0RtakNlRFFJbEdrSWY4RFB4d3VacmlFc2ZueVJheThiTUdIaWl1MVBoYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors - NBC News",
    "description": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors  NBC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 08:58:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQOWZjOFI3RXBOel9qMEJGWnFrbVBnbW8xM1pHQjJxWVRVM3ZSWnoxTnk0LWNLbF9VT1BXZWFvaF9jWHVNSnZiVDNJbVp1ODIxSmFuREpHcTQ0WTQwVnZPVENkRTlZOE9MMVhLUFNuVlRsM3RWZkZWMXpiNkRIZjVTa29kRDFVM2JocEJJa0Q1bDdYWmJDTVJQNmRlaElLaHNzWlJBMk1JSXpuNW1EMzRVaEtUZVJaMEEyZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "47 ways Trump has made life less affordable in the last year - Economic Policy Institute",
    "description": "47 ways Trump has made life less affordable in the last year  Economic Policy InstituteOpinion | The Affordability Problem in One Chart  The Wall Street JournalNew Economic Policy Institute Report - ‘47 Ways Trump Has Made Life For Working People Less Affordable in the Last Year’  WNY Labor TodayMillions of Americans are grappling with years of declining economic wellbeing and affordability needs a rethink  Yahoo FinanceHow Trump Is Making Life Affordable Again  The Heritage Foundation",
    "published date": "Tue, 13 Jan 2026 13:01:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQd2NQSDFOX1VISUxhWjBEQVZENElQTjNKenRmNENQcTVnQVEyT3ZNaXNHQzNzekxCeE9jMGE4OWVYMGZFSGFxMkFoQWQydDVfZXY3SkI5SGduSGlDalBCMkxEU05uYWxiTHlDcmQ5NW9hU1UyTjBhcFkzRm95RHRZOXRaN1lpYlNzbkJCcmtpN3dZbi1SWlJCVzdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.epi.org",
      "title": "Economic Policy Institute"
    }
  },
  {
    "title": "Mass Deportations Are Improving Americans’ Quality of Life - The White House (.gov)",
    "description": "Mass Deportations Are Improving Americans’ Quality of Life  The White House (.gov)White House links falling home prices to mass deportations, experts disagree  KEYEIt’s not just illegal immigration driving the housing crisis; it’s all immigration  The HillDeportation cuts rents but not in Sanctuary States  FM News 101 KXLThe comfortable lie about the housing affordability crisis  Washington Times",
    "published date": "Wed, 14 Jan 2026 21:10:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNQjJZN1J5ZHV3dGh2QTV2SkZuTjZBeFBIMFI0d3VJRk8tSWx5N3VHWTl4Y1phS010MkJiRnphcWJZNHctbVhMWXBFNU5xNENoLV93T0IwQmtsS1FKZlgwazVhX1Eya1NoSF9NVXZQQU5qYmdHZGpaMHNrV0cyZE5fMkVtZmMwZm03Ml9zZ1J5Slh3bmtsME9DR21sWDdiQWJKVFh1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants - The Conversation",
    "description": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants  The ConversationOpinion | This Is No Way to Run a University  The New York TimesA Texas A&M professor pushed back in a course review. His class was cancelled.  Houston ChronicleTexas Sends Plato Back to His Cave  The AtlanticNational education group condemns Texas A&M course material changes  KBTX News 3",
    "published date": "Wed, 14 Jan 2026 13:30:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNWGNBMmIybFR4RGVGQ1VMSVNXamJTTDY0U0lKT2xvMmcxZmxOZ2pqLUFEUWwwdnVXdzVaeGNsbmw5T1JYT2VYYUZkU2x1R3VvUDVDejRmVmlNRkNCaTYzblNqdVRuZUp2TXJVLVlVLWc5TUhwUjREalk0YllVRGtqRU03RklUcVhfUnJRZmk0c3V0V2RZblJQaVlYc1FERmtWT3M0NHJGYm9XVVM1UUltQ0YyRFRJSTZ2M0ZBUmlnWmo3TWZ2NmVJbmRPY0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "US aircraft that attacked suspected drug boat reportedly disguised as civilian plane - The Guardian",
    "description": "US aircraft that attacked suspected drug boat reportedly disguised as civilian plane  The GuardianU.S. Attacked Boat With Aircraft That Looked Like a Civilian Plane  The New York TimesPainted plane used in 1st military strike in Caribbean was part of fleet disguised as civilian aircraft: Sources  ABC NewsDid US military commit perfidy in boat strike? What law says  Detroit Free PressMilitary plane part of secretive, classified fleet used in first Caribbean boat strike  CNN",
    "published date": "Wed, 14 Jan 2026 02:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQa1dhVUVRdU1JUW1pVmo1b29zdmU3cWpOUkRSWHZtaDZubkNDSVhGczRsY1F4NWZDd1dsVXVDdFJCanFlOThiVjcyMFVvTlRuREs0cjQ1MXpFWGl6dktHaU9KN0RMYlZMTkFEdUdRajhNdkN0TUJmUHBLUGw4NWRSdGhackFpcS1aLV9BZ1dFZkdnZWdzY09tcThfWmdRTjBQdkVyMG9Edw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "United States Department of Justice Files Lawsuit Against Minnesota’s ‘Affirmative Action’ Regime - Department of Justice (.gov)",
    "description": "United States Department of Justice Files Lawsuit Against Minnesota’s ‘Affirmative Action’ Regime  Department of Justice (.gov)Justice Department sues Minnesota over affirmative action policies  Star TribuneDOJ sues Minnesota over affirmative action policies  CBS NewsDOJ sues Minnesota over affirmative action  The HillFederal government sues Minnesota over affirmative action in state hiring  5 EYEWITNESS NEWS",
    "published date": "Wed, 14 Jan 2026 16:51:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOdUFkY1B2a1Z1QzlzY1JfYkw5Y1ZqTFNvM2dmbi1aOHE2NXFxS1R0U0FodTlyMDRCMFkxQkJSNlotVGFQVGlWakxhbVUtYnRMd25TQ3AwR2hMbldVZVhIRUJhVFFraW1nQ3hLd1U4NGRJVEdCMzk1WGxQSHFuYXBTQjlsd1FJQVIwaFV1dU5BTXZRRm9jQVYxdDBPVHNkZzc5Y1lTcFRtYjdtaWhsTlhRUUJ0VFBJV2VfbzdBcjhBYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Oregon Gov. Tina Kotek taps Republican rival to boost business relations - Oregon Public Broadcasting - OPB",
    "description": "Oregon Gov. Tina Kotek taps Republican rival to boost business relations  Oregon Public Broadcasting - OPBFormer senator Tim Knopp named Oregon's chief prosperity officer to boost economy  KATUOregon’s Democratic governor taps Republican rival to boost business climate  OregonLive.comKotek taps Bend Republican Tim Knopp for chief prosperity officer role  Central Oregon DailyKotek prosperity plan: FastTrack permitting, $40M in incentives and more  The Business Journals",
    "published date": "Wed, 14 Jan 2026 21:19:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQYTg2YjZJYVYtTWJVME03Qzg5M1VRT3JxMGVmQ0J0dTBPV0QtbS1IYzhkVjhBdGtra0dKYWhRMWFQNGxXcVdOWGhMMlliM3NCOTZwZS1ZU0lxdjAybi1QenNWME05UVVOWnBnVXExNk1kSE5vTGlaWXhRVEJvdnFmdWdCMXBEZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  }
]