[
  {
    "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown - The New York Times",
    "description": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown  The New York TimesDemocrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms  The GuardianDemocrats' immigration enforcement reforms face rough waters in Congress  Reuters'An impossibility': Negotiations to reform ICE sputter as shutdown looms for DHS  NBC NewsSenate Dems Who Pushed Meatier ICE Reform Shy Away From Criticizing Schumer’s Softer Package  The Intercept",
    "published date": "Fri, 06 Feb 2026 00:21:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPd2NUeWZSdVlyenp3VW9LX0Jtank4OHBiN1pZWTV4emRHWlZIdE53OWM5Nmx6X3RMc094Z0lQUmRud2huQzJXZk4wbC04bHRIRDYtekZ2Qks2eEp4MjN0VUZJNF9KYm5Pd0FIanYyM1VGRy1iVHJVQjFsSmhLUmpFMHlaNDV3Zi1EUFgtWDhWS2EyQWI0SV9ITVhvTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Savannah Guthrie's missing mom Nancy is \"still out there,\" sheriff says, as FBI offers $50,000 reward - cbsnews.com",
    "description": "Savannah Guthrie's missing mom Nancy is \"still out there,\" sheriff says, as FBI offers $50,000 reward  cbsnews.comOfficials believe Savannah Guthrie's mother, Nancy, is 'still out there' but have no suspects as abduction investigation enters 5th day  YahooLive updates: The search for Savannah Guthrie’s missing mother Nancy  cnn.comSavannah Guthrie’s Brother Addresses Suspected Kidnappers of Mother Nancy Guthrie in New Video  The Hollywood ReporterThe Guthrie's ransom demand is in Bitcoins for a reason  USA Today",
    "published date": "Thu, 05 Feb 2026 17:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1fN1BUcVdaUHU2clNYM1RTdS1LbWpzU1luWE5RZElZOXhfVl9HSXNEOXV6elNBdklQYXFXUVAxRmFLOHhNQV9mVUZ4YmlhODY1cmxVSVhHTWFNOG1fZk03cnBOb2hVbW4zVDctSkNPQWh5UG8zaVQ0RUhR0gF_QVVfeXFMUG4ybzFLREtwdWxDTGQ3SkFob2ZKN0VudlA4VExLVnNMSTVOOEV4VWp1TVJ5bzZheVhzQ005X0NGWTBKempJN0xMOHozb19BWFB3dW5ZOGFOcndQeGFZZktEbmFLb3dwbEZqOVhoSXBGOERqNUdhTmViZTFBd0w0OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Border czar: End of Operation Metro Surge depends on behavior of Minnesota’s activists - Star Tribune",
    "description": "Border czar: End of Operation Metro Surge depends on behavior of Minnesota’s activists  Star TribuneTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsWhat Is Minnesota’s Policy on Cooperating With Federal Immigration Enforcement?  The New York TimesIn rare move, this northern Minnesota county is working with the feds to make arrests amid ICE surge  Star TribuneDHS to pull 700 officers from Minnesota, leaving about 2,000 officers on the ground. Here’s what we know  cnn.com",
    "published date": "Wed, 04 Feb 2026 23:25:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5zUkRKVjRDUlZKc2xULW5Fd1dwMUNUOHRzYnNBNGtXVzdCTmNDWUdhanQxazJqSUc2b21udlh2d0RtNTFXOHZvYXdvWnFUM1hXby1MVk0yNUNnZFZLS2I0QzhRVUp1VTZvX25TVGRVOGFDRWNJaVp2elZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "White House unveils TrumpRx website for medication discounts - NPR",
    "description": "White House unveils TrumpRx website for medication discounts  NPRWhite House launches direct-to-consumer drug site TrumpRx. Here's what to know  CNBCTrumpRx Is Set to Go Live on Thursday  The New York TimesPresident launches TrumpRx.gov website offering Americans discounted prescription drug prices: ‘Historic’  Fox BusinessWhite House Debuts Drug-Buying Site TrumpRx, With Roughly 40 Medications  The Wall Street Journal",
    "published date": "Fri, 06 Feb 2026 03:43:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13bmhiSXB0UlNOMV9YZW9fOGdqY01hNHZJMmZyRTF6dUdjREoxTW1mX0FWUGlWbGR3cUdwUHpHUXg1V0dfX0tSYURVaEl4bXpkV0FKYlBLdDVoNDVQZTdsMzRFOURDMXlUeUNJQ1ZPT1NXeHI1ZnpWMnNzc2Vnb1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Houston doctor indicted for allegedly altering medical records, making patients ineligible for organ transplants - KHOU",
    "description": "Houston doctor indicted for allegedly altering medical records, making patients ineligible for organ transplants  KHOUMemorial Hermann physician charged with falsifying records, making transplant recipients ineligible for donations, DOJ says  ABC13 HoustonTexas Surgeon Faces Federal Charges That He Falsified Patient Records  The New York TimesHouston doctor indicted on charges he falsified records to block patients' liver transplants  ABC NewsMemorial Hermann physician accused of falsifying records to deny patients life-saving care indicted on federal charges  Click2Houston",
    "published date": "Thu, 05 Feb 2026 23:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNS0hMZkhCOEtFOVd2S2JJWGpLdnRvTUVWUEdiMEVlbFdvc3VtN2xlemNNUVlUVklHa0hxZ2Z3U2syX21ETzVORUJTODY3cDFrNDZGNktPSWJqWVdCMk82bVR2Yk1rUGJ6ZTdQSGVwZHpWdVI0VDA4aFBzRkhseVF5SDNRblVvVU5BcTlUZVNad1k3U1RaV0ZkTWtSUkc0cm5NUVVqWWM2ckNTOHg5aXB1WmxMTFBoejliR2FvZ0hYUFdzRElSQTRaZk1WV3hRVHBoWDVBdWV2VjY1ZFBuWWlmeUhUcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.khou.com",
      "title": "KHOU"
    }
  },
  {
    "title": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos - MPR News",
    "description": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos  MPR NewsFather says 5-year-old son has nightmares and wakes up crying since immigration detention  NBC NewsA judge stands up to Trump, delivers a win for the rule of law  The HillFive-year-old Liam Ramos and his father released from Texas detention center  The GuardianIn Under 500 Words, a Judge Weaponized Wit to Free the Child Detained by ICE  The New York Times",
    "published date": "Fri, 06 Feb 2026 02:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQSUM1S2QySXY1cjRFdFdxSUNfczdQbTRaUzdYZFp2NEFyc1pSU21RSHVTVmFTZWpkMGN4eUl1eXBydVplb0hyWHJGbnF4Y2FXN3cwSDBGTEh2cWlkN3JzVEJ3bkhkSlNQN3JnWUFzUkJFQTVsenhVOHlfakZWbUxWSWl2MExOYUtnTEFTaGJ1bVc2X0FxMUhJQmhTTEs3dlI4MEtWdzE5UGxKVWNsaFUyekNpVjVxYk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "N.Y. House Democrats Unite to Endorse Hochul on Eve of Convention - The New York Times",
    "description": "N.Y. House Democrats Unite to Endorse Hochul on Eve of Convention  The New York TimesNew York City Mayor Zohran Mamdani to endorse Gov. Kathy Hochul  PoliticoSocialists not thrilled with Mamdani’s guv endorsement: ‘Even Zohran gets it wrong sometimes’  City & State New YorkWith Hochul endorsement, did Mamdani lose tax-the-rich leverage?  GothamistZohran Mamdani: Why I’m Endorsing Kathy Hochul  The Nation",
    "published date": "Fri, 06 Feb 2026 01:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPc0dPREVsYVZUcUQtbEI0Q1Bpa2RhZ3lHM0ZYUlNFaVV5MUpyX2M2eXFnWnh6ZVJsY0t6UlNJTmJUQ0dTZHBWM1dWc2lBVm90QjlUNVdqSWgwRHREWXplUHFfZEd0Z0RjOHlWSXZWRkZhUldhQnYwY2NFWkNRUnQ2WTlSUEg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPRJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comTrump says America should move on from Epstein - it may not be that easy  BBCFiles Reveal Epstein’s Money Mingled with Silicon Valley’s Tech Start-Ups  The New York TimesLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Iran, US start crucial talks in Oman as confrontation looms - Reuters",
    "description": "Iran, US start crucial talks in Oman as confrontation looms  ReutersUS-Iran talks live: Key negotiations begin in Oman in push to prevent war  Al JazeeraIran and US to reopen nuclear talks in Oman after weeks of tension  ABC NewsU.S. and Iran Set for Talks in Oman as Regional Leaders Seek to Prevent War  The New York TimesU.S. and Iran Gather for High-Stakes Nuclear Talks  The Wall Street Journal",
    "published date": "Fri, 06 Feb 2026 04:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOb3p0c1g3bm8zM2liWFBtLWtFOEJvWi15NTdQY0djRXlLbjB6cS1vcEZ2akNWTENrWnEyTWFiZ1lzX2wzSmNESkllM3lIckpHcTJVQmRrSE5DRmQwcHZEUGNrQWJiM3FGNmF6d0FFU0JqaExRVHBSckRfaTZCREpJNnVrYTNablZrU1lkUVpTMmc3bE1NSjFxdVhRcG9odVc4blhZSTNxMmZXMEdVWG5fSw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "NJ-11 primary too close to call between Mejia, Malinowski - newjerseyglobe.com",
    "description": "NJ-11 primary too close to call between Mejia, Malinowski  newjerseyglobe.comNew Jersey 11th Congressional District Special Primary Election Results 2026  The New York TimesSteve Kornacki: Democratic primary season kicks off with an anti-establishment earthquake  NBC NewsMejia in Dogfight with Malinowski for CD-11 Seat as Mejia Surges into First Place  Insider NJMalinowski, Mejia locked in tight primary race for Sherrill’s House seat in New Jersey  The Hill",
    "published date": "Fri, 06 Feb 2026 03:36:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPX0YzOU8xR0hrSjB0NzYzUHlmcHRUTl9tdGVfVkVnaVVULXMzdzlHME5XdENYVUc3N0tMYTF1VUdyZlg4VzNzQ0ZOdlMzbXE5TVE2NGwzRjY5ZmJxX3RjalItNHU2VDM3Smp3dU16YlFaUklKcGQ4cTVwblQ1TnlaQTVmeXE5UTlSM2YyRXlrSl93MDRicTBwSA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "newjerseyglobe.com"
    }
  },
  {
    "title": "Democrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station - Axios",
    "description": "Democrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station  AxiosTrump wanted Dulles Airport, Penn Station named after him — in exchange for releasing federal funds  NBC NewsNew York, New Jersey ask federal judge to restore Gateway Tunnel project funding frozen by Trump administration  ABC7 New YorkOne of America's biggest construction jobs halts as Trump defunds Hudson River tunnels  Gothamist‘I Can’t Believe This Is Real’: Dan Abrams Shocked at Trump’s ‘Bonkers’ Quid Pro Quo  Yahoo",
    "published date": "Fri, 06 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPNUc1WFY2ZW5nTmxnM0RxMEtVeXBfSXV3a1BLcnFDb1JQR09ZRWd6T3FFSmZfWmc0c3pCWmtNMkQ5LXl5c0R1SnFpQmFnUlpONEFMbHhwNmNQNmZleXliV3dZd3ZaY05Da2oyR2pvNEJLMFc1dXVfUHFxSlNSODdscFIta1FGSXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "description": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid  ABC NewsTulsi Gabbard went down to Georgia — and no one in the Trump administration wants to take credit  cnn.comTrump says Bondi directed Gabbard to attend Georgia raid  AxiosFulton County challenges FBI’s seizure of its 2020 ballots in court  PoliticoWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – as it happened  The Guardian",
    "published date": "Fri, 06 Feb 2026 04:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOd1BfNC1kZjU4Z0Z5N2VCUG1zX2VFZXpDOTFVdTk2VU8xVV9FRW1XRXZETjBWMjBVYjROZ21EMm1DNHZQZWx1N2MwNmRqYXY5eTBqMDVMZ1hqSEZpNjc1enUtV3FMY1VNN2YwVGxwOGxtelBrTEVGaW9fUklhYVFtNG4wbUF1Y1dtdWEzWnIxNEROTmVwX3N4NjN2bDZneGZUZ1gxSTlMMDhBdE9S0gGyAUFVX3lxTE0wOThjeV9OU1llYWRBVUtnaWdtMzAwMngweGlOQjA2MGN4MFFWVU11cGVCaUdsX3AxU2tBUVp2d1dadjY5cmwyUVY0YW5ENG52aFFtcVFiMU9xWVlnRnQzWnRHaS1EUFNQOWc1R2ZjUnBPbUh2SDZNZmNDTG5IN2swR2VPRFBvNTFRTmxFeW9Zbmp0ZjFjNDRuMlBFTHVITDZyOXFzNlZuMWNGbmcwSWpxVkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms - The New York Times",
    "description": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms  The New York TimesVirginia Democrats show map to counter Trump redistricting but its future is unclear  NPRVirginia Democrats release long-awaited 10–1 congressional map  Virginia MercuryVirginia Supreme Court will hear redistricting challenge  PoliticoGeneral Assembly Democrats release redistricting map  Cardinal News",
    "published date": "Fri, 06 Feb 2026 02:56:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNF9WcUh4NVNuaEF1Y0Fib1R4aTVjel90S0Z4WHJmLTU4R3A4bHprVGhoOTVZZmowbjZwMlJMOXRMNy1QRXdXdzRBVEN4QnJ5eGo3LWFtLVFuNnllX3hXUWk0SmllbjEzOVVBOExSME8xa21MSWEtb0daZ3I5cnVrV1FMZXVaenpsa3czekt5YjJhZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Late Night Finds Trump Out of Place at Prayer Breakfast - The New York Times",
    "description": "Late Night Finds Trump Out of Place at Prayer Breakfast  The New York TimesWATCH: Trump says he will revoke church tax exempt status if leaders 'say something bad about' him  PBSRep. Ted Lieu Claims President Trump is Accused of Raping Children in the Epstein Files  C-SPANTrump announces May 17 event to rededicate U.S. as ‘one nation, under God’  EWTN NewsTrump says he ‘probably should’ get into heaven, needed 2024 win for 'own ego'  USA Today",
    "published date": "Fri, 06 Feb 2026 07:09:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRGpDbGhzTE9yQ0h4c2oxUERoRklCVk8wQUY5d1F4UFZ1UnFDQllUZnhHNjYySHROdXB1VTVZbW5kYThYcnVXM0Z6dlFrTUpkd25CUkpOYlZha1drYzU3MnlZcUlFaWxma1hXY2ZPbnJnYWlzTmdkUDJtb0FkaTdsOWNnNWRFOGlCeHhCUVdSeGZMMlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "3 dead, several injured after car crashes into 99 Ranch Market in Westwood - latimes.com",
    "description": "3 dead, several injured after car crashes into 99 Ranch Market in Westwood  latimes.com3 killed, 6 injured after elderly driver crashes into Westwood grocery store  KTLA3 Killed as Vehicle Crashes Into Grocery Store in Los Angeles  The New York Times3 dead, 6 hurt after 92-year-old driver hits bicyclist and crashes into Los Angeles grocery store  AP NewsAt least 3 dead, 6 injured after car crashes into 99 Ranch Market in Westwood  ABC7 Los Angeles",
    "published date": "Fri, 06 Feb 2026 00:47:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQSElxeHFjY2xmckcxeWdrVkdxaEJWRzZMOWstcFg0RzhaYkphMDNpdGprN0dpQTFYTE50RkFsUE5yT3JQR3loUHRtXzVCYmZGX0xsdXVrQWlfTVVRLVhKcVNzRXFRXzd3eHhLckxTSF9JLWQ5SktQWkMyOS0yR1htUU9aZ0RycUZwTmRELXI1azJtT29NeWZJZVR5Y1NGSFhWNGZCdjliaXdYTGtyeFNRUDVDeWd2RTZvcnlKZmNucw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Democrats involved in 'illegal orders' video say they won't cooperate with DOJ probe - NBC News",
    "description": "Democrats involved in 'illegal orders' video say they won't cooperate with DOJ probe  NBC NewsLawmakers Say They Will Not Cooperate With Inquiry Into Illegal Orders Video  The New York TimesSlotkin, Houlahan refuse to sit for DOJ interviews over ‘illegal orders’ video  cnn.comSlotkin rejects Justice Department request for interview on Democrats' video about 'illegal orders'  AP NewsSlotkin declines DOJ interview request in ‘illegal orders’ video case  The Washington Post",
    "published date": "Fri, 06 Feb 2026 03:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPckYxUXlvVlJ2UDhFRWN4Vk1mVDdGelVhMHJkRVJoZ2VDcWx3Z1hiY0Y0QWtaVFZjdGZPS0I0Yjh3ejBvNVh0UDFrdGRiNFExR1luRzdMejh6bmVMNXozTjZNa0FjS1NXVXdtZ0FBT3BieVc1NXRMaXppWVFTU2F3S0lkOFBXMlUtcUZBMkdYTVNUd0lWRVFIbktSVmNKaXVkZDB1NldxR01TemJfRmNTR2FnZ2VfdDlFTnFka05R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump officials push citizenship question in test survey for 2030 census - Axios",
    "description": "Trump officials push citizenship question in test survey for 2030 census  AxiosTrump officials propose testing a citizenship question amid a push to alter the census  NPRColorado Springs dropped from list of U.S. Census test sites  Colorado Public RadioCensus Bureau plans to use survey with a citizenship question in its test for 2030, alarming experts  AP NewsTrump administration cuts number of sites for testing the 2030 census, focusing on the South  PIX11",
    "published date": "Fri, 06 Feb 2026 05:45:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPczUyZnBET2VJZlhIWElkNWkwdnZtaXFnMm5jQjlGa1UzZXVrOWo0MHdscmtiNE1sallGRFJtZ1lXSHZZRUpfMG1RZ2RVOGNOdjdncXNqREM1YTdoTmk3b25XS3VGOExnamtKZ3ZFVXEtZ0VuSlFXVmtabUo4OU5zZ2NxZk8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "US strikes another boat in the eastern Pacific, killing 2 - cnn.com",
    "description": "US strikes another boat in the eastern Pacific, killing 2  cnn.comUS military kills two people in latest attack on vessel in the Pacific  Al JazeeraUS military says two killed in strike on alleged drug boat  BBCU.S. strikes another alleged drug boat, killing 2 'narco-terrorists'  NBC NewsUS military says it killed two people in strike on suspected drug vessel in Eastern Pacific  Reuters",
    "published date": "Fri, 06 Feb 2026 02:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9QMlQ0Wkl6b3JYaWRRU2M0SlF2dHV4eUtMbGpQUjkxeG05U1M4bkQxemVWS01QM0ZEYlJ2LWNxcDhoOEdPa0ljR2dlbmEtMHFtUEJ2eXhQbHU4QVk0bjg3ZWZHdEYtQUhzRmVMcE5oNHdCUHZFNm8ybnN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "DHS’ problems go farther than Minneapolis. Republicans are noticing. - Politico",
    "description": "DHS’ problems go farther than Minneapolis. Republicans are noticing.  PoliticoHow bad was Alex Pretti’s killing for the Trump administration? New data tells us  cnn.comNew national poll shows most Americans want Kristi Noem out at DHS  MS NOWMost Americans support independent investigation into Alex Pretti shooting  AxiosUS House Democrats call for Kristi Noem’s firing in rally outside ICE headquarters  News From The States",
    "published date": "Thu, 05 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQYU9iMk5jSGk4aURQWmhzQWxQMlBxOTFTbW1yOHhZdjNJakdleVFGUUdaLWhDVWpRWS1Ndzc0VGdoU3NkZk9ZSWtxUlc2M3BMRjNHdmt0SklOZDZiMmIySmxtbm1ZQjNyaFJyMHZGakRMcXlRYkNtcHJjdHBjbmxlWG83SFNLQndLX3hxcEg1RXkxLUMxZjlWSTNCekhXU0pkYXZaZldjVU9LdDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - dw.com",
    "description": "Why Trump and his Republicans can't take over US elections  dw.comTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comRand Paul on Trump call to ‘nationalize’ elections: ‘That’s not what the Constitution says’  The HillIt’s already too late to change the voting rules for November  MS NOWTrump’s comments on nationalizing elections worry Colorado election officials  Colorado Public Radio",
    "published date": "Thu, 05 Feb 2026 22:29:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "description": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration  AxiosA key nuclear weapons treaty is ending. It’s a blow to Russia’s ‘superpower’ myth  cnn.comTrump says he won’t extend nuclear arms treaty with Russia  PoliticoTrump rejects call from Russia’s Putin to extend cap on nuclear deployments  Al JazeeraExperts debate whether U.S. should extend its nuclear arms treaty with Russia  PBS",
    "published date": "Thu, 05 Feb 2026 23:31:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB5eUdzWFhsVTFZODh4RXpZMFJ6T0o1TEx1TU1kSWhNMjRwUWdVNHFldDI1T2c4UjUySzQzYjN4Tm4zYm9WNXUwMnBUcXItdGpDQlN2bk41R2p4amx2Vzl4dWhPNTdVeHJreTBKcl81bmJnZG5uczNpNFhBakw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "DED, Pillen no-bid contract fight with auditor heads to State Patrol, AG - Nebraska Examiner",
    "description": "DED, Pillen no-bid contract fight with auditor heads to State Patrol, AG  Nebraska ExaminerNebraska State Auditor testifies on bill that makes new requirements for emergency contracts  ketv.comFormer state senator McKeon calls for investigation of no-bid contract awarded to Pillen associate  Central Nebraska TodayAmid fight with Pillen, State auditor pushes bill to require notification of emergency no-bid contracts  WOWTState auditor turns over records on suspicious no-bid contract to attorney general, state patrol  Nebraska Public Media",
    "published date": "Fri, 06 Feb 2026 03:10:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQN2FKeDNNQzFTWUVLbVlkYWxsZ0VTSmE0WGRKWThSU0pySjZVWG1QbGpxWC1WdG93NkhCQTNTVTlRU3V1QXJZbFFOVWFPVDdlUEZTakpzQ1d6bG5Dc1VmZ0FEdy1Ma1lvOTQ2em1menlRblpZRV9ZZTJqMXpiSzZGZEowUzI1UTdMdjlkRGItRnN3eUkxMW9Damtxazk3ZFlsOC12MjdreS1FWnZWNzkyOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nebraskaexaminer.com",
      "title": "Nebraska Examiner"
    }
  },
  {
    "title": "U.S. and Russia agree to resume high-level military-to-military communication - cbsnews.com",
    "description": "U.S. and Russia agree to resume high-level military-to-military communication  cbsnews.comU.S., Russia to resume high-level military talks  The Washington PostUkraine-Russia Talks End With Little Progress and Hints of Impasse  The New York TimesRussia's Dmitriev says progress made on Ukraine peace deal  ReutersUS and Russia agree to resume regular military contact  BBC",
    "published date": "Thu, 05 Feb 2026 17:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE02MTRaM1dVVUMzTTR4MTg3SEFJcGlxd0FYVjBtcVYxNnZSdzAtR2RnNjdGS2JmOWpjN2tFOUdQZUw0YkFOd2pXS0NEb1BQbjkwVG5UUU1LYmFCWkJ2dGRSUTk5X05PbzJiNThZS1pmUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Hillary Clinton calls for public hearing in House Epstein investigation - PBS",
    "description": "Hillary Clinton calls for public hearing in House Epstein investigation  PBSHillary Clinton presses Comer for public hearing instead of Epstein investigation deposition  The HillClintons keep pushing for public hearings as Comer digs in his heels  PoliticoAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsAyanna Pressley and Stephen Lynch draw a line on Epstein  The Boston Globe",
    "published date": "Thu, 05 Feb 2026 19:55:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOS0IzMkdNTGczSFAxbUV4bXc0ZkhYZDZJYmtNcUVWZmhLWVlndmVZZXFlMFUzMXpUQmFGWnU3ZHdSSElPSlV6aDlNdGVHRXlWeUZrUXNlZG92R3F5UFJrMXR0YVFpcXk1OElyaG13LXl3T0lMemw1SUdxOXRBS3NzWl9TLUZoakJXNDBfVzNPelo2LXlPWkFBU1dPTzhzN2RTNVR6d1RvSjUySGVhWnfSAbMBQVVfeXFMTmZLcDlVaG9hdllCVmRLaXdLTnFhNnh6aDFzVS1pZzBUYXdJSmlyNkdvVEp2WUlUSHYxbUpqZ2ttVXdORTZXajVyX1lDQktnN2dFUEJRZmpGVDBxcmlnUnZkSE5HaE5nMVpjUHJfNl9sQTY1MXF4REFnYVRKZ250UE5BdGFzdmFUMWxLbjBsOExnU2E3bGI3ck5SM2tTMFhJdDc1a2dEQ2dXVER3ODFFeGN2U2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "2 dead in police helicopter crash as officers responded to 'active shooter' - ABC News",
    "description": "2 dead in police helicopter crash as officers responded to 'active shooter'  ABC News2 DPS troopers killed in helicopter crash after shootout in Flagstaff  AZ FamilyAriz. DPS helicopter crash kills pilot, trooper during shooter response  Police1Arizona DPS helicopter crashes while responding to shooting, killing both on board  NBC NewsDeadly AZDPS helicopter crash; search for Nancy Guthrie enters 5th day l Morning News Brief  FOX 10 Phoenix",
    "published date": "Thu, 05 Feb 2026 23:35:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOUXdmWWFNbVVDdmZoQTZfdnh1bkhsZWhNWV9IaExMZmxaeUNUOERPMkR2OWQzTVpFN1dsUjQ0cF9xeVdiTGtCdXBWV1hvanZOdWFkdzdHa0poM0Zpd1JYQkVvM1Y5OHkwZTI1MlR4OVBiRlVEMVFIb3FKYUZNM3gtal96bHJ1LWN3WF94bk5VZWFlNmE5d1RMV1l1ejNlRUR1ZHdF0gGoAUFVX3lxTFA3aW5oSENVcTBmVU1ZcG10QmpCanNxczlyM0g4cUN1Qks4VTItMzZoVFA4Qks1Rk1FWWg3cWstTV9GMEUtc05famFkdG55R2tiRmxPb1E5OXNialNxU0JEc2hONzdXVVMwZHh6dFdEWW9RelNYLWZESHE0NkhrTzBqdk9POXhvekF3TGlVakUxZXA3bkZ1aS1rdWsxUHFJRThld2t2UDZ1dg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "New York City Forecast to See More Snow and then Bitter Cold - The New York Times",
    "description": "New York City Forecast to See More Snow and then Bitter Cold  The New York Times'Coldest air of the whole winter' in forecast. Blame the polar vortex.  USA TodayColdest air of the season, snow to hit parts of the Northeast  ABC NewsDangerous cold, snow this weekend | Live updates  ABC7 New YorkNew York is locked in a deep freeze. Here’s when it will warm up.  Times Union",
    "published date": "Thu, 05 Feb 2026 18:52:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNd0dtcFg0QUVJNmJveGJQVGs4SWVyT0tEa2UyNHZFUlZyTVpiLTg0dGFsSF9GaHhlRWVQeTNDZFd5a2hCSTY5Wk5HQVhIaTBDN1dxdlQyZ0FucERuSUJoNTd4bmxPaU5uc1JpUW9JOXRkRERYUjdCZndIX1pFNG9lQXdNZU9UTEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield. - The 19th News",
    "description": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th News‘This fight is far from over.’ Ohioans react to federal judge blocking TPS ending for Haitians  Ohio Capital JournalCompany lays off Haitian caregivers despite court order protecting work authorization  GBHOhio’s GOP governor: Ending TPS for Haitians would be ‘blow to the economy’  The HillOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York Times",
    "published date": "Thu, 05 Feb 2026 20:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5GVDZFcTVPS3dZMGt2bkZTVHAwVkYyR1dkU0tvbXlpdTdXc2hUZkl0N0JndU1BNVBLMF90TnlEVlJsN2dERjFqaEtTM3pKUUVMUTUtWERmU2RNUmlZd1JITjg1UUhUbVZWeHptYW01SUtGdmYxcVV2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says - The Chronicle of Higher Education",
    "description": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says  The Chronicle of Higher EducationOklahoma governor launches accelerated degree study to boost jobs, cut costs  News 9Oklahoma Gov. Kevin Stitt unveils plans for faster degrees and university oversight  KOCOStitt orders higher ed to create plan to tie funding to performance  The OklahomanTenure Eliminated at Oklahoma Colleges  Inside Higher Ed",
    "published date": "Fri, 06 Feb 2026 01:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQb0dZRFdMWHNRZGE2ZTE3VTFxdy14azBSQTBfWlhITWUyQXR6YXZKVkRCNDJGSm5HTkprTDJBQXlkazUwbnJIZVEwa3hZVnFILUNfcTdPRHlERnJKZDlCclpmVHZxak1Ia2ZEVkFMQVlNem5XakViR0dESUpLNUFaZloySmFvZWNSQlhvbXdteXg4ZmMwcWNISTZFN0dTb29tSmRYZWJ2S2VSRzhYTHg0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chronicle.com",
      "title": "The Chronicle of Higher Education"
    }
  },
  {
    "title": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s - OregonLive.com",
    "description": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s  OregonLive.comWanted suspect shot, killed by police during warrant search at Pearl District apartments  KATUPortland police shoot and kill suspect during standoff at Pearl District apartment  KGW‘I was freaking out’: Neighbors react to ‘utter chaos’ of officer-involved shooting at Portland apartment  KOIN.comPortland police say man killed by officers wrote threats against Trump on bullets  KPTV",
    "published date": "Thu, 05 Feb 2026 22:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPdzlFSG4wLWduWE0xNzBVdjZkdXZmS2RSb2VydXA1RE1Uczh0dmhzTnFoVXBZRzU4MzJxelJsQ2ZCUndUQ21pb1hTdTVvR2RHNkdYcVl2RzlQMEdOWnNTY25zdm1vcmptc01mX1hDbXk0b05lQ2NLMjhrNGFsemstSUdBTnl3aHpvSDk1V2JIYlkzMmp5MHRCZi1uaVB2N0xaWW9LLU5KNzcweW1BVFdVQ0prU2pJbTh0SFo0X1FoXzE0UmRtRHp1cDhqUjVMOWItRzNSRnVFc3FZalNwOFRoRGRWM1JFckpOVERiTdIBgAJBVV95cUxQb0VBbWVHVGUzUHV6alF5eXhRbDRITG03c1VDMVhtbksyRzhYak8tLWFUUXM5Z1NoZ3hoU3lvczhodEY1ZWUwOENYYzJxaWpNRi1lOHd2al9va0tTTl9zOWxpdUpxWkhxU0RIdENXaFlReVNmV21hMnlCSXRzLU9qOG1PcVZwM3JpX3phNHE0bWtwNVh0eTRBS0FWa0ItM2ZxQnNuZ1pfMWhhUFM4LXlkdFJjSFNDS3BIeGZyN1BjTmQtaFNBTFNEMDdtN0ZmU016QjdfLTJBT2Q0akplNTFMQ1BkZmZnZVpoeHU3Z295TFM3Rlo0VV9oQ1pjUGVuSFV6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "L.A. mayor’s race is in major flux, days before deadline - latimes.com",
    "description": "L.A. mayor’s race is in major flux, days before deadline  latimes.comL.A. mayoral candidate Austin Beutner exits race after daughter’s death  KTLAAustin Beutner drops out of Los Angeles mayor race  ABC7 Los AngelesAustin Beutner drops out of mayoral campaign in wake of his daughter’s death  Los Angeles Daily NewsTop Challenger In LA Mayors Race Drops Out After Daughters Mysterious Death  Patch",
    "published date": "Fri, 06 Feb 2026 00:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQeVJzOEstbFlEUzItbUpocUM4S2NYOFZYU2dGZ3BzMEVLRElWTUJxSTJQNHBHZEptSFByaFVKOG5DcEwyLTlScEFzT1ltN1NVazNzN3pfRldHVl9XSjB1U2M3SGxoa1Z5dmxHSGY2dFFaalhDaHJEeS15VWdrNGRUVkNab3Yyenp4QmF4eEZwNVJjTmZlZWZMSlh4b0hCUXdkc1FDeGFQaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuba to introduce plan to address fuel shortage amid US blockade  Al JazeeraCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba ready for US talks ‘with no preconditions’ as energy shortages bite  Financial TimesWhat a Deal Between Trump and Cuba Might Look Like  foreignpolicy.com",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "House Democrats pass sweeping gun control package over GOP objections - Virginia Mercury",
    "description": "House Democrats pass sweeping gun control package over GOP objections  Virginia MercuryVirginia House Democrats pass new gun laws, but not all Democrats voted for them  WVTFVirginia gun bills move forward amid sharp debate  WSETHouse of Delegates passes gun-reform laws  CBS 19 NewsSenate panel approves 11% tax on manufacturers of firearms, ammunitions  Richmond Times-Dispatch",
    "published date": "Thu, 05 Feb 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQRHJ1RDZsVGRSeXZuV2c5NXBHb3BDRTFrN2kxMWkwSjJiY2tGdEJtTGVPeXNfeDdqRkdGTkxnU180YUVYUERacWJLY2tVNkpWT0xSYlNNdGR0UVQ5bmdUQjhrMEZlN09IeGNzUkdrazRtVkJsdEVfeXpYWmhQcmNFWWxZajFub0ljUWFJM1dNOUxfdWJFVG9LZFg0UkdiZ1hJMEdDd3RQcDlXYjR4ZVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://virginiamercury.com",
      "title": "Virginia Mercury"
    }
  },
  {
    "title": "S.F. teachers on brink of a strike even as fact-finding report favors district - San Francisco Chronicle",
    "description": "S.F. teachers on brink of a strike even as fact-finding report favors district  San Francisco ChronicleSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoS.F. teachers call for strike Monday, city’s first educator walkout since ’79  Mission LocalCalifornia faces teacher strikes across state for better pay and work conditions  The GuardianWith strike looming, SF parents’ loyalties are with teachers — for now  The San Francisco Standard",
    "published date": "Thu, 05 Feb 2026 01:51:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTnRqVWctVGx4dkhuNUdjOG01U1lRRHdZU0dELWE5YktudTZqYlN0aVZ6ZWl6QUhSTG1temlhN0RBWVp0RmEwWUdsb3BqUEsydjJ0c2s4ZUVGNUtUUU1ITElpTk03WWRUVVdoRnNMcFpSQXhiWXhEQXlpWDdnSTROYS1JV05fbjA0dEozSWViQXRRX2tVT242UFpPUTN3U0hYLXpvRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show - The New York Times",
    "description": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesSee adorable photos of dogs from 2026 Westminster Kennel Club Dog Show  USA TodayWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBCFort Wayne Yorkshire terrier wins Best of Breed at Westminster Dog Show  WANE 15Photos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPR",
    "published date": "Wed, 04 Feb 2026 17:37:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOdGdOV3EyZWtzVndlek84NmR1ajZPWHFhODlkVVpVaDRaNk15aGFKanAydEJwRTg0bE9rUkpqNDFBcmdjQXhoNjlfOUctRG9kR3RtT3JqYVdTN1NVSUJiNjJNZUJyajA4NTk3QXYwS2M2OXU5bmZMd3o4ZVRoaXMyVmxHSWlqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Frustrations from judge, prosecutor in Minnesota boil over amid Trump's ICE surge: \"Not above the law\" - cbsnews.com",
    "description": "Frustrations from judge, prosecutor in Minnesota boil over amid Trump's ICE surge: \"Not above the law\"  cbsnews.comTop Minnesota prosecutor says ICE cases are sidelining ‘pressing priorities’  PoliticoTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  cnn.comSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York Times'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC News",
    "published date": "Thu, 05 Feb 2026 22:16:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTVA0SjFxbHl0SVc1UVdQNEdzX21ZWHZURktLSUw5aThHSmR5Z2MyaVhCZHliWXAzajV2ejdzcjdSYVJDOWF2bEFSSldQLVpNZU5nYTdIbWFWdmdTS25Fc2UzSzRLSWdaZ0YyX3pqMkgyMko3ZzgxclRVdUpmZ1lnaFJhTzN5d2dkVUg4RHJlZTc5VndkZlNyN2tkWjVNTWNidEx5amg2bWnSAa4BQVVfeXFMUFdQZnd5VWF3NWlnLURyMm5HbjZtZFUzSDNMUFJOT2xKLVBwRXFtbHB0V1JIYWNoNVhRRzJVSU1XaFpDNXI3Q21RenZKcmRUYnEtY3ZBR3BVZU9hWm0waTJ1U3l0R256UlNDM2VBLUNiY1BSTGc2dG5ZR0diTjM3UGdlRmtDRVpnaU5FTXRudDJfWFIwQ0ljX3ZaTmJla0RtUkVTbkFEUUw0T3Q4YkZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown - The Daily Beast",
    "description": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown  The Daily BeastOpinion | I Was Arrested for Doing My Job as a Reporter. Who’s Next?  The New York TimesFederal prosecutors in Minnesota are cracking down on dissent  The EconomistDon Lemon says he offered to turn himself in but federal agents were sent for him anyway  cbsnews.comDon Lemon arrested after covering protest at Minnesota church  NBC News",
    "published date": "Thu, 05 Feb 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNM1NZQVFTZnJkMlQ5ZW5nUEJ0eUJMWUYxT0VaYTZQbFFyRS1oYTRTM0Z3ZWxhT0JqME9CMm5oRDJNaS1ySFIxNnA1b1dNZWdsdGFaUnd0eDdyVktXTVdhZ0pMV2x1S0lxb1Exd0g3bi1GR00xWl81VUlUdmxLQnFvblZST0Z5cVAwcU02RTlXX04zcjFncjFoR2RpbkEtV0hwOTJ0SFhxeGJ6M0RhamJN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release - BBC",
    "description": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release  BBCBrad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout  The New York TimesTop lawyer, art world exec resign in more Epstein files fallout  MS NOWBrad Karp: Wall Street law firm boss resigns after emails to Epstein released  The GuardianKarp Advised Epstein on Fight Over Plea Deal Months Before Death  Bloomberg Law News",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Vance announces price floor effort for minerals - The Hill",
    "description": "Vance announces price floor effort for minerals  The HillU.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalMP Stock Is Tanking as Vance, Rubio Talk Critical Minerals  Barron'sTrump’s Hot New Critical Minerals Club  foreignpolicy.comSecretary of State Marco Rubio at a Press Availability  U.S. Department of State (.gov)",
    "published date": "Wed, 04 Feb 2026 22:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPOXJCZGFlOXliV3FZN0ltVmk0eTE0dWlYazB5eGJtYW5veU1ZNnRsVm05Mmp4eDU5WTJCQm5WVldudEIwNlB5MXcyQ1A1bFgwR2tLaGk0Nk5ieG01cHJyQV92a1Z6UXpuWjg2UGhmbUt4ZE54ZXRyVlN5cWg5ckhtWDJkajJEVWZpMXhkV0lzZEZQZ3lHUWZLWHJhS3NiRkR2ejd2WWVkWl9DRGvSAbABQVVfeXFMTzhVOFZneGxaQ3IyM1U0MTdDMEFRYW91alRVTk9pc0o3NGhPWndMQVgxV2U1V1NodDI0WlpFajFib0x2UG1rZm5WZ3pmRlVFRHJkZ3FRQlpycW05eFl6VTZVaXlDTWdWTUYtX1dJamFBd0pjZTZWUFhYR2k5R0hLVHllYzJnN1htdnEzeG14WDBHM05Ld3dScW5oX2VhY1ZSQ29EZnJjRXJnRmhoMkxMOWI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehill.com",
      "title": "The Hill"
    }
  },
  {
    "title": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks - Politico",
    "description": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks  Politico\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosGOP game-plans for a DHS shutdown, as skepticism grows over talks  The HillPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News NetworkHomeland Security shutdown grows more likely as Republicans rebuff Democrats' ICE demands  AP News",
    "published date": "Thu, 05 Feb 2026 20:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNQkpMTzk0SGJpRlYyMnVfWHRjODlLeXFqU0ZERWtVMElhRDdFNmhpNEdtT3hLYnNtM1pVYnNPVVg4eHdoei13S1ZlNXd4dUpDTUotUjQ2N2VwSFdHcEw4ZUlvNi1tYkZmTEtkenFKelNvWXF3VnU0VXg3WGVCZ004YUxFUm9jMGhWaS04clFtaXliczZ6U2Noc2lIUzltMjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "After crushing protests, Iran's supreme leader now tries to avert a U.S. attack - PBS",
    "description": "After crushing protests, Iran's supreme leader now tries to avert a U.S. attack  PBSTrump warns Iran’s supreme leader should be ‘very worried’  cnn.comAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsTrump's objectives in Iran are unclear ahead of talks, sources say  NBC NewsDonald Trump wants to end America’s half-century conflict with Iran  The Economist",
    "published date": "Wed, 04 Feb 2026 21:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQVE5OQVJ0TmhQOUNYdlpXWGpXRGYwVThhTUlqM3VJckZGY3dGNFdqckNLbUxMSi11N21NY3FKYUlnTVFtOWptNGExcEZHcU42REtjRmVxd280d1hQLWxBZG13SnJBWFhydVlSN2Qxd1RMN0ZYMTNrdlN2QXA3VG1SRF9hQXF2TGZWVmxwU2xhejh6M2l2WXJoaFdJWEZ2SnZGWGs5R0t6SU5aR1hVUGlsZdIBtgFBVV95cUxNZXlmTG9yZVJXRW5neHN0VzhNUHhwUmhxa0xnWWE2aENhYTBnZm92WG1ONDZJd3NPellPTnJhcGZCT2hWWVpBU0ZpUWUxYlplZjAtYU5PQUw5ZGpQNGZNdTRicUJ1dVM4b0EydGlib3dYcUZzZzZGR0J6LWlTeFBvOFB2SXFSZTJGNV91ZTU4OVBqaWdzeF9tM0lyRXpLa3A4UVpZdHVuOF9Janc2WWgtaXFzX2xOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Attorney General Ken Paxton Sues the Muslim Brotherhood and CAIR to Stop the Terrorist Groups from Operating in Texas - Office of the Attorney General (.gov)",
    "description": "Attorney General Ken Paxton Sues the Muslim Brotherhood and CAIR to Stop the Terrorist Groups from Operating in Texas  Office of the Attorney General (.gov)Attorney General Ken Paxton asks judge to shut down Muslim advocacy group CAIR  The Texas TribuneCiting 'radical Islamic terrorists,' Ken Paxton sues to shut down CAIR-Texas  Houston ChronicleTexas Gov. Abbott demands Attorney General Ken Paxton take action against CAIR  cbsnews.comPatrick announces first round of interim charges for Texas Senate  The Center Square",
    "published date": "Thu, 05 Feb 2026 15:47:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxPUHJxN2FxYnhsb3VGb3AyVnctS3phY2Jzd3hzTnZva2I2UDRZZW15TXhCaUFxMFBxZDlpMWZUcXZuNzdCX1Y0bXhoYlFwSk95c1JLTlRfRmJKdjU5MlhfcDlWVUJJWW5zTE5hZjdKd0paRTZlQ1p5S3VtTXZnRGp5bnQxSUo4d2F3Y1lTYmNpT0xSbFRrNTBiaTRLUHE1Vnc5bmJLemVVYk83N0tKbEVpcUlNWHQ4dHg0OXBXT0xfTThPR1BUbDJyOUVfeTRDNGR2QTJVSmZYdmJVa0tTWHAyNVA4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texasattorneygeneral.gov",
      "title": "Office of the Attorney General (.gov)"
    }
  },
  {
    "title": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms - San Francisco Chronicle",
    "description": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms  San Francisco ChronicleWhy a Republican Supreme Court just handed a victory to Democrats  vox.comSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court allows California to use congressional districts that favor Democrats  PBSSupreme Court lets California use new Democrat-friendly congressional map  cnn.com",
    "published date": "Wed, 04 Feb 2026 20:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPOG5mbjN5REhFbmN6bFFxcF81X1I4Q3pjYjBUOV9hN29YZ25odTdkZE43QjlOeG83cm44TjRRV1Z2MVlHVktkWWRGbGhsZVVOSWJtNEV4c3V4U0lGeWxKT2tQVzZsby1GWWJHajBkV2dfRHBjVHZ3M1I3b255OWI1VnR2X0kzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal - ABC News",
    "description": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsOpinion | Calls to ‘defund ICE’ are horrifying  The Washington PostTrump’s deportation push is scrambling New York’s suburban politics  PoliticoPoll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement  NPRThe Actions of ICE, February 2026  Marist Poll",
    "published date": "Wed, 04 Feb 2026 22:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWlhVUnpBRVVkTE9pNTdMdlpxTlBob0puN2wxQ0RRcU42WWVobGt2M2drclB6OVJyR05QV3BKNXNrdUUyZjdEWi1mVE5rOWhkLUg3aTZ3T2pheGdNRFNDTEJMb3RZODBxcEtZUVBrYXZ0NEgyb2ZGeHl2bkZvNFNoU1ZfSzFEZ0ZMdVhib0tXbVpWT3VhVTJqVDJERjgzWllUYThR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  latimes.comSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostCalifornia Dems lash out at ICE during gubernatorial debate  foxnews.comDem CA governor candidates seek daylight during first debate  Sacramento Bee",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico - Houston Public Media",
    "description": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico  Houston Public MediaTexas special election emboldens Democrats heading into federal midterms  The Washington PostWhat a Democratic upset that sent 'shockwaves' through the Texas GOP could mean for November  KUTTexas loss delivers stark warning to Republicans in critical election year  BBCWhy Democrats’ upset in a Texas state Senate race is a big deal  cnn.com",
    "published date": "Wed, 04 Feb 2026 21:35:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakNLdVNVRWRJdmhPSUppRTlrdmZqTFdPY21pMk1ZSXNWX0lIWXowaFgtSFVTYk9kVEd3cUh3NEdoNngxVjdMT0FPaUFHYWt3MTdMSXV6NjVTSzVORGRIWVdhcVZnMVlIa0lUYnZyLWxLbHNrcnVKOEpuamJiNW55Tk92MU1aWmJBbTZGR1pIUUEyUTZod0JMMXZkU0tkdFJDTTNzcGUxSlcxY0xVcWg4UHF1UUJIZ3dMVkFuSHExSFEyRUI1eWtNbk84UdIB0wFBVV95cUxPMVd1blgySThkZE8zU1hEVW9VdlZFck9Za3dYS1FrbnV6bWYyRmRYcWNjWXZPRnNJUHcwVDAxdENqUk5kT01UeXU3V3hLXzNvaDZrRk5Nd0I1bzI2dXp4dmRyWWxpOFE3SHl3OHprcVltVnFyZmFudGFkU3l5WGR0YV9kN0Z5cmVkZG1FNjRrTEhCV0taQmVCVkctUzVFNkM1Qy03ZkNsZzZORlRsMjFGclBFNmJhdFRzNllQYlp2blVPdWRMc3lEX19jMHR3N3dKcHlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.houstonpublicmedia.org",
      "title": "Houston Public Media"
    }
  },
  {
    "title": "Jersey City Faces ‘Staggering’ $250M Budget Deficit. Solomon Slams Fulop - Jersey City Times",
    "description": "Jersey City Faces ‘Staggering’ $250M Budget Deficit. Solomon Slams Fulop  Jersey City TimesBudget  jerseycitynj.govSolomon smacks Fulop for $254M Jersey City deficit, $667M in one-shot revenues  Hudson County ViewMayor Of NJs Second Biggest City To Take $1 Salary After Finding $250 Million Deficit  PatchJersey City Faces a Stunning Budget Deficit, Report Shows  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:39:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQeURhdTVGTkprYTVUX3lPMmZyeVVnMnhPR1ZjczVhVHI0M1RVczRhRWQ0QXNhdDNjWktZcndtYmlMeUpTTWkyM3Vkc3pielNrdHNBWjJoVHE3ejFUd2hudnBTWGlKZG1OaG1Hc3VtbUhOREhSTnN5Vk5aRmU1RlQ2S0dvcDE0Sk5EbzY3R0o2b241X0FwLVJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jcitytimes.com",
      "title": "Jersey City Times"
    }
  },
  {
    "title": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida - cbsnews.com",
    "description": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida  cbsnews.comRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  cnn.comRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesUS: Would-be Trump assassin gets life without parole  dw.comCongress faces tight deadline to fund DHS. And, Ryan Routh faces sentencing  NPR",
    "published date": "Wed, 04 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUkR3RU1fOEs3eVVBRGMxZnRYckZmclB5aEN4MVowRDVZU0x4X2pock8tTFFaT01JVUZ1c1VMS29qcWhyMjRuZFMzRlliZUsxb0FjbmdjMzkwaVRuV21paUtxaE1FZ0hfVVI5MGdaNjE0MDlUUGd1dWdQU3l5VURHUE1UcjdYUlBFcFVQS0FKb9IBlAFBVV95cUxPMUhweVBsNFVDRjBXa0VaV0xHNFVnOVlabFA0UER1OVQ5RlJtYWtpU0g4TU5CRkJyT0hKRDExME5ZekFzWDZkWlJEbmhQdzctem05czdSenItVEpIUTJDVFBvSldIZlYzaFVjRXEtSWNGNndsU3p4WmNUREJQYUFsSWxDaTBVb0lXQ2xNU2dNZ29CVEFK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches - AP News",
    "description": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches  AP NewsUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  ReutersMaxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  cnn.comTreasury Secy. Bessent Testifies Before Congress  C-SPAN'Can you shut him up?' House Democrats clash with Bessent in fiery hearing  ABC News",
    "published date": "Thu, 05 Feb 2026 01:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQX25WazBtYTNNSFFadkNYNXVmU1g1OVo2ZTVpMnJsZm92dmhQblN3YXdRaHVadzhCTjJjNTVRczY4OU9MdzVvbFpCbkt3UUs3MHM1WHFUNTF1RVJ5NjRTUHNkWlRZUGVjNWQ3Z0V6dnlYckpKU2Iwa2hLRzYtOEgwekI2Q290bG9Kdnhud0lON0NQc2lUQVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "73 arrested, 4 victims rescued in Stanislaus human trafficking sting - Modesto Bee",
    "description": "73 arrested, 4 victims rescued in Stanislaus human trafficking sting  Modesto BeeCalifornia trafficking crackdown 'Operation Reclaim and Rebuild' leads to 600 arrests and 170 victims rescued, including children  ABC7 Los Angeles3 arrested at 2 brothels in Walnut; 3 women rescued  San Gabriel Valley TribuneOfficials announce significant update in massive California human trafficking sting  KTLAAuthorities announce hundreds of arrests in California human trafficking investigation  NBC4 Los Angeles",
    "published date": "Wed, 04 Feb 2026 17:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1tZ01PS1ZDX1NkNFNtRm52T2trbVJXMjB3ZTNnUjd6UFVGQURrNXVMNXZJaHF1VmFVZnVreWk1QklENzRhR1d4RHdhM2Y4UXhtazNidWFCQnpfWXJYUzQxV2ZCZTZFWkN1cTYwYUJR0gFuQVVfeXFMUEdrY18wMGE0YU5ra2VXWExDelBLVnJSb2xST0h3Vk5Ha1pWY1RTYlFtcnNJbDZlNV9zNEpyTDlmbmc4M1Vsanpma0xlUUIydDlSRUZEZG5mMldIcXdBNkNsODA0bERndUh1SUdFVHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.modbee.com",
      "title": "Modesto Bee"
    }
  },
  {
    "title": "House rejects D.C. tax changes, potentially costing the city $600M in revenue - The Washington Post",
    "description": "House rejects D.C. tax changes, potentially costing the city $600M in revenue  The Washington PostHouse passes measure to force DC’s hand on tax cuts  PoliticoHouse approves bill to prevent DC from opting out of Trump tax cuts  WTOPU.S. House votes to overturn part of D.C. tax code  NBC4 WashingtonRepublican bill targeting D.C. could create tax season chaos  The 51st",
    "published date": "Thu, 05 Feb 2026 07:19:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBXbHBBYmJFdTgyWDd0Y3pDWkpHSExpNW5hT0ljdHZzM3ZVVHNLZnhMM0tLRlo5Z1RuNS1WQjJGazlIeVhkM2V3YjdBWExrdzhYVUZWRGVjQjYyWGpwek1TME1vZlhWTl9yeDd3Zk80c1JwZEN1alptUFdGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Woman killed, man wounded in shooting on South Side of Chicago near St. Sabina Church - cbsnews.com",
    "description": "Woman killed, man wounded in shooting on South Side of Chicago near St. Sabina Church  cbsnews.comChicago shooting: 2 shot, Gabryel Ayers killed, baby unharmed in vehicle on South May Street in Gresham, crash, CPD said  ABC7 ChicagoAuburn Gresham double shooting leaves woman dead, man injured  WGN-TV2 shot inside vehicle near Chicago's St. Sabina Parish, one fatally: police  FOX 32 ChicagoWoman killed, man injured in Auburn Gresham shooting  Chicago Sun-Times",
    "published date": "Thu, 05 Feb 2026 05:51:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOWmRyMFVTUmVMSnVwZHdxcmZyZ2Q5YThtUEdvUVBCMzB3bVFIQ2tiZ1prVUlCV2VaTnVrOFhXSjZIVUF2NWtUdGdOR3RwejFCcnZlOEtKSXpuRThESDR1YlFIX2NWOFdpNWtNXzJ6RmVXd3NNcGg3dDRFczZjLTl4RnBMbW9BMEhyZmR5WmFNOE1sYjhRby16dQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Federal judge blocks immigration agents from making warrantless arrests in Oregon - Oregon Capital Chronicle",
    "description": "Federal judge blocks immigration agents from making warrantless arrests in Oregon  Oregon Capital ChronicleICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesCongress must hold the line: ICE cannot be allowed to break into our homes  The HillLawsuit challenges ICE ability to enter homes without warrants from US judges  Reuters",
    "published date": "Thu, 05 Feb 2026 17:00:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPX1d2SXVFSXdxb2lkMnprU0VuajFxRGNnMUM4Tl9uRzRiQW1tYmo2Q010Nmkycmk5Wlo4TkVEQ1BfdE8zTV9tUkZoMnZOMEF6c2NndUdUMFZTQjVuM0d4RkhxbGJ3aXc2UXVoYTBSQkhxTHl5bHRTQTFQNGh2ajc1TnBnanBGQ2p3R3FMd2RBT01NSzRId3djY1VYbG16UWdwcG84VTQtSWV2MXRmZUxfcTl4aVFsWjE4bkFnd3BCREVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oregoncapitalchronicle.com",
      "title": "Oregon Capital Chronicle"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasSuspected biolab discovered in Las Vegas home sparks federal investigation  cnn.comMeet members of the expert team that responded to the suspected illegal biological lab found in Las Vegas  ktnv.comBio lab found in Las Vegas is similar to scene discovered in California, raising questions from officials  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Parents of Evergreen High School shooter won't face charges, sheriff's office says - 9News",
    "description": "Parents of Evergreen High School shooter won't face charges, sheriff's office says  9NewsEvergreen High School Shooting Investigation Complete  Jefferson County‘I feel like we got a slap in the face’: Parents upset with Evergreen HS shooting investigation  kdvr.comParents of Evergreen High School shooter will not be charged  Colorado Public RadioEvergreen High School shooting investigation closes without charges or answers to major questions  9News",
    "published date": "Wed, 04 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxPM3pJSXhsVkdnNG1ySHdtV0l5ay1adlRhNUFnRElPVk5NVjI4TUJub0RBb1RLSHpWcDlWTnNaWXRvOEd1TzJfUnpFOEllTWpqMnIxeC1UQUI0M1N1OE5kazFsajQ0ZXdMWFFpTE90ZmItb2xIQjdBZ0lfT21iYTJNWndVQ1dnVGUtSkFpclVVSnZRajVseVIzbjk0ekNUYUhBQl9CZGFoYzBCelI5UHhFckZ0eXNTdjNSWWtfZG9aVGlqRTNqbkFjbU1BV25VdUstQ19aanU3ZUZoMjZFQWdCNHEzVmFFOXdMMm5xNUFrbGxnVzBMQjdxTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.9news.com",
      "title": "9News"
    }
  },
  {
    "title": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university - The Independent",
    "description": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university  The IndependentFired professor says Texas A&M ‘ran roughshod’ over her rights in new lawsuit  KXAN AustinTexas A&M professor files lawsuit after firing over gender identity lesson  ABC NewsTexas A&M Lecturer Who Was Fired Over Gender Lesson Sues University  The New York TimesAn Instructor Was Fired After a Viral Recording of a Gender Lesson. Now She’s Suing the University.  The Chronicle of Higher Education",
    "published date": "Wed, 04 Feb 2026 21:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMDM1bU1zSkNTTkdKc08ydzZsMWNZYU11emFFUGtoU3pXOVBkay1qalNpSzA5c3MweFFyNzM3alZHOEVoNzRzQnh5S3UybGZyRGtaRXgwZDdfN3ZUNFVOX3RwaU13NkZlbmJXNEpNdXhKU2xoZ1EtLXVVWlhZMEdVemFqSGhMeWM1NG1WMjlHQzFnbmN2YXV2TUE1cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.independent.co.uk",
      "title": "The Independent"
    }
  },
  {
    "title": "Spanberger orders state law enforcement to exit federal immigration agreements - VPM",
    "description": "Spanberger orders state law enforcement to exit federal immigration agreements  VPMVirginia governor orders end to state agency partnerships with ICE  The HillMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.orgSpanberger takes further steps to remove Virginia from ICE operations  The Washington Post",
    "published date": "Wed, 04 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOLTNVOWxjYXFzYkZUdFNtcHhJOXAxUkhPQ0tVb1JLS3pMSktqX3pTU1MxS1ZTck00ZzhtY1FlTGZhOU1CaFZEYWQ3MmhLYjROWkttY3BaejRnYVk4OWxiRW1KY0hsVWZsOGRuMFBzdnA3S3VaaHJhTEx5OWpoX0p6M3NGOG9LT1gzUVNPUmhqeU12V250UFRhOURRRDMycFFNMU8tbHFvTlpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "2nd teen identified in Rainier Beach double homicide; $5K reward offered for leads - KOMO",
    "description": "2nd teen identified in Rainier Beach double homicide; $5K reward offered for leads  KOMO'Mourn today, act tomorrow.' New Seattle Schools superintendent emphasizes safety following fatal shooting near South Shore  KUOWTeens identified in Rainier Beach shooting as SPD extends police presence in neighborhood  KOMOVictims of Seattle shooting near Rainier Beach HS identified  FOX 13 SeattleSecond student killed in Rainier Valley shooting identified  The Seattle Times",
    "published date": "Thu, 05 Feb 2026 00:38:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxOUXh3WjY5eFM3YnlNSTFrTF9UT0hSZkF0S2h6Tm02cWtOaHpaRFIyWjF3c3REeVYwUFJBekFSRGl2TWNac0hZblRpcDN5VXRiNDdvOVVxcS1pM3cwVW9WY2t3MldXY2ZMMkg5N3UyMnhWaGJnV0JQSU5DaU9neWZHQVFOazF6MFV0aHlkbERXeGhpbG5JMGkyZGhFdFg2VXRESEFGdHRZNkxUZ2JSQW44VU5KdGhBMVFYZW45TFVkMEJROE82NVJ3aDI3RHFmLUdLYUVYYWU1QWxvcFVkY1BacTFNWFZzYW1wb2JDTWFXdUFHQTgzM3V1Qi13NlhsTzVuZHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers - HuffPost",
    "description": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers  HuffPostTrump’s $10 billion lawsuit against the IRS raises conflict of interest concerns  AP NewsTrump shares his plan for the $10 billion he expects to receive from his IRS lawsuit  MS NOWTrump sues IRS for $10B over leaked tax returns  PoliticoTax Filing Deadline May Be Pushed Back, Bessent Says. No Word From Trump’s Team on His $10B IRS Lawsuit.  Barron's",
    "published date": "Thu, 05 Feb 2026 05:21:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZXh3OFpsdm5GYXEtTUJaVVVQTW5rc2lCdDFpNWV4ZUpyZVpRdU1ZNGxpQTNhVUVCUWZnRFRZWi1hTFVDMmV6WFg2U0VueHdBQ2loY2pLcjZETjlNSjdSb0huNGpNekVyajFLaXBET0gxejdqbjhiNkNZM1VlaDA0S2pqeXpHZ9IBiwFBVV95cUxPRkJtUUFGODV2VkZDTkllSjB3MVItRkdpVWdwNm9RcndaRnBWQzJjUkJiRE1Cam5NcU9sTlVvSU54N1pXSU0xTmdsWkQ1OUVObE0wZGphQk1kcjhoR2Z1ZlE2MFd2YzVYa3JiM01ScDU1UFVaVm5adlBoMC1QVHV4UGxudlN1T2RGbG9Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "NY Gov. Kathy Hochul picks Adrienne Adams as her running mate - Gothamist",
    "description": "NY Gov. Kathy Hochul picks Adrienne Adams as her running mate  GothamistBrooklyn Dems pull Hochul endorsement after LG pick  City & State New YorkWhy Hochul chose Adrienne Adams as her lieutenant governor running mate  Times UnionHochul Chooses Adrienne Adams to Join Her Re-election Ticket  The New York TimesGovernor Hochul names running mate in NY Democratic primary  wivb.com",
    "published date": "Wed, 04 Feb 2026 22:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQd2VQZmNlR1RnVEhvWVJwN0dCR3YxTVFVdl8zUjA4NzM1NmxkdW1vTjVZaGExWUJscFAzeGJoUDZ5ZlozVmQ1aW4yVVgxRjZzckQ2R091ckZRbGhiQXJoTDBYdHp5U2lOUjEwcWNONVJjTE9WcHh4QlEyaDY3NlpkZFpEQWVJWnZiVnRxZExzdnU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "TikTok trend Needoh cube: Boy burned after social media trend; Loyola Medicine shares urgent warning - ABC7 Los Angeles",
    "description": "TikTok trend Needoh cube: Boy burned after social media trend; Loyola Medicine shares urgent warning  ABC7 Los AngelesTikTok trend Needoh cube: Plainfield boy, Caleb Grubb, burned after social media trend; Loyola Medicine shares urgent warning  ABC7 ChicagoTikTok trend leaves 9-year-old boy with severe burns from microwaved ‘NeeDoh’ toy  WGN-TVMother warns of TikTok trend involving Needoh cubes that left her 9-year-old son with severe burns  cbsnews.comMom shares warning after 9-year-old son suffers burns after microwaving toy  ABC News",
    "published date": "Wed, 04 Feb 2026 15:04:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNcFFwS0VzeFZPTm91Vl8zak1rcW1KRW10bWFjQU5wWFhWa0llZW1Dak5qbjl0VnNOSFBjU3pQYmNFbEtTd3JJSkVzWmJ2X0pBSWV0SkEzX3hKZ21xZ1c2OWtyVm05N2JaZTNWUk1rMWl3bjUzTWJCb2dCYUxMODZOblpQSFBnZ2hoTkwyOG9vUzJuS2kwUVZJQkxPc3N6cUxHYlFpTVJ4YVNlaExKcjlvd1R3R0c0bmZCdEHSAb8BQVVfeXFMUHJYRUFxLXFWcU1hQ0dEMkFyNjkwT2NmS0tRSGt4MWkxYWQwQnpuU3ZabkF3ejhGMzNCNjFTV1dpbm9pTlY0Ymp3YVByTDNXUnZSRGhNRnNsX1lhckVMVEdPSlFaS1JPaUgyTW9oYXk1VGg4WG1peVV5a1c5V0NLWTJhM3lzX1hjSDcxUFdGN2h1dzZCRmJiaHFxcmR6bjl4aF9rOGRXSkpobVljZXBLbF9hTXVlbjcwRkdaMGxXYUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets - The White House (.gov)",
    "description": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets  The White House (.gov)Chief public defender outraged by immigration detainments inside Hennepin County courthouse  Star TribuneHennepin County Attorney says ICE detained 2 people at government center  kare11.comWhite House cheers 4,000 arrests in Minnesota Operation Metro Surge as deportations loom  KOMOMinnesota Democrats Protected This Violent Illegal Alien. The Trump Administration Is Deporting Him.  The White House (.gov)",
    "published date": "Wed, 04 Feb 2026 21:19:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOb0RaQTY5QnR0QWpBXzdpY2VHSENIUUFLWm40MW5kRWtWblAtMFlleDFfdkpiV2JRaXVUaXY1a0RlUG9KTTVobTE1NjVXaGpBNjBZRUpFV2tqb20wMkxIa2FKODNEMWM5QUotZDRRUnVCU1Z3VjNPR3V6ZDhYR1htdk9JOHZiS05DbTNSNllFdlBsa29MMnpxMXk1aDFDaWRkRDVZSVhnT3ZKY01ZUXJvUENJaG5RUHZuZVRwS2IxWVRKZEFOV25KbDVLYzNUWnltOG1N?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Trump likely to lose latest fight over felony convictions - All Rise News",
    "description": "Trump likely to lose latest fight over felony convictions  All Rise NewsJudge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’  cnn.comTrump waited 'too long' to seek moving hush money conviction to federal court, judge says  ABC NewsTrump tries a third time to move hush-money case to federal court in bid to get conviction tossed  NBC NewsJudge appears skeptical of Trump’s latest bid to nix his hush money conviction  Politico",
    "published date": "Wed, 04 Feb 2026 19:08:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE90U2IxS0p4WGxORkRFR3NxdVVRd3RJazJHSVh3eExyWmJ4VzlxczhhTUhXRGNORGd4dGhYaS1jMWsyVzMydGdHMHhCcmdFXzRDZDgwZUlyeVlDcUJWV0xxNU5IRG55WDdBd1c1R19KcFk0aWhSMHV6Yg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.allrisenews.com",
      "title": "All Rise News"
    }
  },
  {
    "title": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost. - The New York Times",
    "description": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost.  The New York TimesTrump-style unpredictability isn’t just political theatre – it’s a regulatory problem for your brain  The ConversationTrump’s brain is 'deteriorating disproportionately' — and it’s getting worse: psychiatrist  AlternetHow to cover Donald Trump’s failing mental health  LGBTQ NationTrumps Brain Sparks Debate Over Cognitive Aging and Health Information Marketing  accessnewswire.com",
    "published date": "Wed, 04 Feb 2026 23:36:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPYUxYZlgyc1h4cWM0SlZZTzhJcXJxSXQ2RTZwdTRYcHNobjlyOHZwa3pEVjh0STlwbzFvUGcwYl84RHNaWkFCNmM5RHpkWmZRSkgweE9LY3FsTXZGSmVVb2t4TUxtWVYyNWR3aEVDYmVVMWtSWXdsaGZqRlNKbUp3WTRablhHZVJfamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "JD Vance’s latest take on Alex Pretti killing will enrage you - Daily Kos",
    "description": "JD Vance’s latest take on Alex Pretti killing will enrage you  Daily Kos'For what?' Vance refuses to apologize for Alex Pretti claims  USA Today“For what?”: JD Vance stumped on why Alex Pretti’s family might deserve an apology  MS NOWThe Recap: ‘Border czar’ says ICE is doing A-OK, and JD Vance ups the ugliness  Daily Kos'A vile human being': Don Lemon calls out JD Vance, says he's foregone his humanity for Trump  We Got This Covered",
    "published date": "Wed, 04 Feb 2026 20:00:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMUhicmpEemVxd0RYbEtuVHBqY0RKNUpzUjJGUVVhdUZiTEthWFFTVWFsU056NWs3dDVwUnpiV2I1ZDZTSFpzV2NpdWZnRENoT3RVRmFmaEV3dnkwb1h1QmVTQUFMSkQyTWE3YW9FWGtJdmU1OVQ5ODBhVFBWVlhCZVFzNDhhckMtWGtNMDdYY2Y3enBGcV9XVWJaWnFDUkRGRmU2eER1NUV1LWZrZjU2LVJiRHY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailykos.com",
      "title": "Daily Kos"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoWhite House ‘can’t guarantee’ ICE won’t send agents to midterm voting sites  The IndependentBannon Calls for ICE to Engage in Voter Intimidation During the Midterms  TruthoutWhite House ‘can’t guarantee’ ICE won’t be at polls  Democracy DocketBannon: ‘We‘re going to have ICE surround the polls’  The Hill",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed - Quinnipiac University Poll",
    "description": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed  Quinnipiac University PollView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 18:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBhWU1ibUFWZmkwZFozSlpXNUlCZE5QSEZka2JUVG92dGJENGVUMlNRRnppejB1d3h1QlFMbEU5NGRaR2pWR1lhTzljZ1BkTm10M0Q0UTVFaGJJcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto Rico - cnn.com",
    "description": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto Rico  cnn.comTulsi Gabbard reportedly oversaw probe of Puerto Rico voting machines last year – as it happened  The GuardianTrump administration team seizes Puerto Rico voting machines in election security probe  The Jerusalem PostGabbard's office examined voting machines in Puerto Rico  NBC NewsExclusive: US spy chief's office investigated voting machines in Puerto Rico  Reuters",
    "published date": "Thu, 05 Feb 2026 04:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOc05kRzJieWlWeC1ZZS1sSkF0cGwxY1loUE5sU3o0UnZCUXhvQWRybTZMSzctNnhuckhBVHVCZmVmNWg5RVhTQXJ4NzBtdG1sZnlQaVZuSHdjb0NnNGktMWJwUGlEV1JVSXlCT3NrS1ltOHJZcHQybDBNaEw1QWdrYVJ4VjgtOHZ3ZjVWYTE3LWFOcFVfUWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  }
]