[
  {
    "title": "Search for Nancy Guthrie, mother of 'Today' show host Savannah Guthrie, enters 4th day - NPR",
    "description": "Search for Nancy Guthrie, mother of 'Today' show host Savannah Guthrie, enters 4th day  NPRSavannah Guthrie’s Missing Mother Has Nation Fixated on an Arizona Subdivision  The New York TimesInvestigators return to Nancy Guthrie's home as search for NBC host's mother continues  Fox NewsWho are Annie Guthrie and Tommaso Cioni? Here's what we know  azcentral.com and The Arizona RepublicFamily friend calls Nancy Guthrie's disappearance \"heart-wrenching\" as search continues  CBS News",
    "published date": "Wed, 04 Feb 2026 16:33:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxORy1EVDNvMnkwdDZ6cEVtUEZIS3JoMUh5ODhfdVdSM190WGR4WU9aVGhiQXpZamZkWFN5RmtPUy11a25ScWNDSHk2ZXpwdlhHNFlHZ1J0WE9maGNXQV9FcDRiZW4zUTdZbVVYU0YxNkVsbVVybkdiNmdSV1pYUlFPMDdjaFF1SUo5OEhfOThqcFk4Umc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately - AP News",
    "description": "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately  AP NewsTrump touts 'softer touch' on immigration as federal force is reduced in Minnesota  BBCTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsMinnesota sheriffs group, border czar Tom Homan negotiating blueprint for federal drawdown  Star TribuneTrump administration is pulling 700 agents from Minnesota. Democrats say not good enough.  Politico",
    "published date": "Wed, 04 Feb 2026 21:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNd094S2hfeUdZWTFsMkRTZjh0LVhSZDQzVi11STZYT2g5WEdKQ1AxdnQyekhkQmRycXlDV2EwOXFMazZtV3FOQWFuUTRwZUZVRktsRjZzSmdydDBEQzJOSFlzX0VqZS1rWmdFaUNDU0JpWUVPcnlWRF8yaE1MRjBCdXVfVW83WE1mSzZHdHd0RlBuRzU0am5TME5OQVN2OGxTajNFMlY5Q25nZ3lP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Ryan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence - The New York Times",
    "description": "Ryan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  CNNTrump shooter faces sentencing today. Here's his request to the judge  The Palm Beach PostRyan Routh sentenced to life in prison for Trump assassination attempt  AxiosMan sentenced to life in prison for 2024 attempt on Trump's life  BBC",
    "published date": "Wed, 04 Feb 2026 21:32:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQa3lYVWQ1d2RFUXVQcFp6OEVaNV9uTnl4Z0VsU18xSUxTamNrRXdoeHNDaThpWmo0S0hkRU1BNTdob1dKdHljd3VIOGwwVFpXWS1JZkdwQ2d4TzIwLUY1ZUNQbXVMdmQ0ZE5ES3F6Mm1SWVUtRmNHQTlfQXpleWs1OWhPYmFJX0plaGFvajlWTkdvcW9D?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘This job sucks’: Government lawyers, drowning in immigration cases, have had it - Politico",
    "description": "‘This job sucks’: Government lawyers, drowning in immigration cases, have had it  PoliticoTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  CNNDOJ removes attorney after telling judge, 'This job sucks.'  kare11.comProsecutor Fired After Voicing Frustration With Immigration Caseload  The New York TimesICE attorney to judge: ‘This job sucks’  MPR News",
    "published date": "Wed, 04 Feb 2026 20:16:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNnBsbVlTQVg4R2haY3BTOTZlNjZrWldQSkF0clRQZnZTSlNuZDFJcElWay1nVmRnZFgxVzJFVHEydkM3b0hTeDBuLTlJLUpaN3kwOXdxUUhqTlhYNEVyWnR5UmhCdjR1cUpfeGdTVmhyVUwyZ1FBZVpqNHI3SHNwVW9fTFRvbXRxZ1dHamV1UWNYVTBwRUxwQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Steve Bannon calls for immigration agents at polling sites during midterms - The Guardian",
    "description": "Steve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketSteve Bannon Proposes Using ICE in Elections  NewsweekMAGA Architect Comes Clean on Election Campaign for Midterms  The Daily Beast",
    "published date": "Wed, 04 Feb 2026 18:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSnd5eG1SZ1RycTZmS0wzbHlFTG53LW45cGtDbW93RU8tNHpZQU1oTDdEeERnSTVZN3g3UEo0TWtYZG5rZHp0RDdXRm5OMHRmazgyTlZOVlliWXEzSmotX3ItbzAzVV9ZV1FTYmdScFc3Z0VGeGRTUWd3cDFFQXdEcW1TOU9ESE5aQWJhUVkwY0UwWjFnRnhSNXllVW5fbEVmZVlyNlBraTFTSkFZOTNZNU5WNXI4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "With latest Minnesota fraud case looming, the lead prosecutors have quit - CBS News",
    "description": "With latest Minnesota fraud case looming, the lead prosecutors have quit  CBS NewsAnother wave of departures in Minnesota’s U.S. Attorney’s Office  Star TribuneU.S. Attorney’s Office in Minneapolis faces “crisis” after Good, Pretti shootings  MS NOWMore prosecutors leaving MN US Attorney's Office over frustrations: Report  FOX 9 Minneapolis-St. PaulMore departures at the US attorney’s office in Minnesota, AP sources say  AP News",
    "published date": "Wed, 04 Feb 2026 21:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE95VHZMdFMtTnQwWnR4T1dOcUI3N05jVFAyYmM5YzBZUmxDWFhNSVB6Zk9WZUJoSzVuZEFQN0R3cFEtSFE5ODEzUWhjdjZfMzNkZllQdE1IVlg1VGdUNm0ySnVPVmNETHZyWHdzbmVscHdRdWIybnfSAXtBVV95cUxPU2dtU3pWc0FpNE9MWHhPWjlHb0IwVkx0NGdaajVEaHdINzZoVThLTVdMaVFxeHMxTERkQnpMUWUzZGhzVTlBM0N4Y0NUX1VfbEV0eGY3bnF2UjdnWmR0cEpkUmdsd2VRUUxBSHRZM0l3eFpUS01Ybl9hdXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Standoff over ICE tactics could trigger another partial government shutdown - The Washington Post",
    "description": "Standoff over ICE tactics could trigger another partial government shutdown  The Washington PostProspects for ICE deal sour on Capitol Hill as shutdown deadline nears for critical agency  CNNWhat to know about the congressional fight over ICE restrictions, and another possible government shutdown  ABC NewsDemocrats plan DHS funding offer as Thune floats long-term punt  PoliticoTrump Administration Live Updates: President Says He Ordered 700 Agents to Leave Minnesota  The New York Times",
    "published date": "Wed, 04 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOY1RvMWdpVXJndTNMTGEtMWxLaThFeE5yeU1SeXNJS2p2OTdvMzFZR1h3dHN5Q1QtMkN6b2VKeDgwTmVlaDBjekR6Qm4xOEtEaDNpVEE2UlQxWVZrT05VRDFkTXVXekVTTkJSdC1xYjlTc0VSdUhnbldNVVFwZW1xdGJ0Z2N0TDd5S29lR19DRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court lets California use new Democrat-friendly congressional map  CNNSupreme Court clears way for California voting map that bolsters Democrats  The Washington PostCalifornia can use new congressional maps in November, supreme court rules  The Guardian",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPRTrump says America should move on from Epstein - it may not be that easy  BBCThere are many famous names in the Epstein files  CNNEpstein files rife with uncensored nudes and victims’ names, despite redaction efforts  AP NewsLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "U.S., Iran Agree to Discuss Nuclear Issues Friday in Oman - The Wall Street Journal",
    "description": "U.S., Iran Agree to Discuss Nuclear Issues Friday in Oman  The Wall Street JournalU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosU.S. and Iran to Hold Talks in Oman on Friday  The New York TimesIran’s president seeks ‘fair and equitable’ negotiations, while US shoots down drone  AP NewsIran conditionally agrees to nuclear talks with US, first since Trump’s military strikes last summer  CNN",
    "published date": "Wed, 04 Feb 2026 22:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNFlTcW1KSHVrb2FvVXhhWmIySTlRZVFyN0JPYXlvVTl2VHR2U044SmFnR090OUhIWHRoS1pDSFRxUDRwS1pENlJ1NXMtZzgtVXZBN1hhSnlEYU52Zmo0dndiY2tPZnF1U1NiSzFvQlhnOE9xbG9oOUN2Z1JSbHl3aENtMlo0eDVaMEFsaDhQQnFtemFHWk14cDlFTkZVZXhLMVlWQlVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "What the Crackdown Has Done to Minneapolis Children - The New York Times",
    "description": "What the Crackdown Has Done to Minneapolis Children  The New York TimesEducators Sue to Keep Immigration Agents From Schools and Bus Stops  The New York TimesMinnesota teachers sue to keep ICE off school property  The Washington PostWalz demands DHS stop detaining Minnesota children  Star TribuneInside a Minneapolis school where 50% of students are too afraid of ICE to show up  Los Angeles Times",
    "published date": "Wed, 04 Feb 2026 16:53:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPS3Q4QVp1Qk9LNjFIZTVtQ0lqeUtXSHRrYUl0dGUtZmN0UUZZQi1xMWtVcUV0N2xpREVlTGNVWVJGRWRudDdLOW1HdE1uZ1ZtTjl6S1FvX2V5RnJCVzc3LWFCNTFKRS1nbVEtRHVObVNzNHRoQ3k4dW5fcUIyenBtQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Maxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained - CNN",
    "description": "Maxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  CNNBessent Says Fed Lacks Accountability and Has Lost Public Trust  The New York Times'Can you shut him up?': Waters and Treasury's Bessent clash over Trump's economic agenda  Fox NewsTreasury Secy. Bessent Testifies on U.S. Economy  C-SPANUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  Reuters",
    "published date": "Wed, 04 Feb 2026 18:05:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOZnA3ZlFNMUFjYUUzZThDUDM0RGtYUjdsbVdtZWxKbWtwZEpTSERzQzdiUWk5amhsUGFoWldfVnE1MVlOSWZrVEtZRy04d2tueDBucXY5WGo2aUQtMldQNUt2UGk0dkZYcVlRZzg4ZFJMTFpJQWpPRkZaQ1A0ckU0b0wyd1Z5Y3dpOUdtajNJNWk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Nike facing federal probe of alleged discrimination against white employees - Axios",
    "description": "Nike facing federal probe of alleged discrimination against white employees  AxiosNike, Accused of Bias Against White Workers, Is Under Federal Investigation  The New York TimesFederal agency probes Nike over alleged discrimination against White employees  CNNTrump administration alleges Nike discriminated against white workers  NBC NewsTrump administration EEOC sues Nike in DEI race discrimination probe  KATU",
    "published date": "Wed, 04 Feb 2026 18:53:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9tcDNVa2ZPcW4tU0hWVV9GM1M3ZGlndVhseTdlc3VwQmgtZi1yQWtHbUp6SGZVTzBXbTh6bEIzUXp3cDZKLVRNS3dGTnFWQ0laXzBOOVdPaUw4eEZtY281QnpneVlVbDUybVo5T3Y4cWl6dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Fulton County asks court to return 2020 election documents seized by the FBI - PBS",
    "description": "Fulton County asks court to return 2020 election documents seized by the FBI  PBSGeorgia's Fulton County seeks return of 2020 election documents seized by FBI  ABC NewsLegal fight escalates over Georgia voting records as Trump says he wants to ‘take over’ elections  AP NewsGabbard says Trump asked her to attend FBI raid at Georgia elections hub  Axios‘It’s a Five-Alarm Fire’  The Atlantic",
    "published date": "Wed, 04 Feb 2026 19:57:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQOXhhd3pzNnNoVnJLOC1HcERrbThYX0Npc1pCM252dUd3ZmNoVzRqdnhoT1Vfc0ZjdS13d0lYSWRpRjZHWE04VHh0VnZzWXVwemJ6MjBjeGFNcms1N1pJOEsyR0xEZmxDQVFkbUhHOElQTU5RTW0xNU0zY29wYmh6NEdUQ1JKeWF1TkdNOVFHQWhyRVVXNUFUUnd0SXdhYTF0VjA2YUhQSFY4Qlg4WDAyVzhQQU3SAboBQVVfeXFMTm5MMWFmODJjMUx0aW1YNmtIRlJRUW9nTkVjTW13WW5tV09Wck9kREdVQk1Ob2d5bnVWVWJ5ckVHdmNEQ1RSNjJicFlYeUl6RW9SazhGTWQyXzNNY2NWY3ZFUnlfWE9IRXdEM2VDQnQ4aHpYY3JEeDI0dWVIT3otdUpuZFpLMk5FdkNWaC1RRHNsUnRFdnRWSVhrc0syMVcyRXNQbDFGczdOTkJGaGtpaDJDNC1IOUNaSnFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets - The White House (.gov)",
    "description": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets  The White House (.gov)SCOOP: Thousands of violent illegal immigrants arrested in Minnesota as admin vows ‘we will not back down’  Fox NewsQuestions raised after DHS releases new Operation Metro Surge arrest data  5 EYEWITNESS NEWSICE arrests criminal illegal alien, sexual predator with final order of removal in New York  U.S. Immigration and Customs Enforcement (.gov)White House slams Minnesota Democrats for protecting illegal migrants charged with crimes  WJLA",
    "published date": "Wed, 04 Feb 2026 21:19:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOb0RaQTY5QnR0QWpBXzdpY2VHSENIUUFLWm40MW5kRWtWblAtMFlleDFfdkpiV2JRaXVUaXY1a0RlUG9KTTVobTE1NjVXaGpBNjBZRUpFV2tqb20wMkxIa2FKODNEMWM5QUotZDRRUnVCU1Z3VjNPR3V6ZDhYR1htdk9JOHZiS05DbTNSNllFdlBsa29MMnpxMXk1aDFDaWRkRDVZSVhnT3ZKY01ZUXJvUENJaG5RUHZuZVRwS2IxWVRKZEFOV25KbDVLYzNUWnltOG1N?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed - Quinnipiac University Poll",
    "description": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed  Quinnipiac University PollHow bad was Alex Pretti’s killing for the Trump administration? New data tells us  CNN6 in 10 say Trump administration hasn’t given honest account of Pretti shooting: Survey  The HillMajority of voters don’t trust Trump admin’s account of Alex Pretti killing, poll finds  PoliticoMost Americans support independent investigation into Alex Pretti shooting  Axios",
    "published date": "Wed, 04 Feb 2026 18:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBhWU1ibUFWZmkwZFozSlpXNUlCZE5QSEZka2JUVG92dGJENGVUMlNRRnppejB1d3h1QlFMbEU5NGRaR2pWR1lhTzljZ1BkTm10M0Q0UTVFaGJJcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "Donald Trump: Iran's Ali Khamenei 'should be very worried' - The Jerusalem Post",
    "description": "Donald Trump: Iran's Ali Khamenei 'should be very worried'  The Jerusalem PostTrump’s Iran threats face ‘Obama red line’ test as White House pivots to diplomacy  Fox NewsAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsSatellite imagery shows where the U.S. military is positioned near Iran  The Washington PostOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBC",
    "published date": "Wed, 04 Feb 2026 19:19:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5pb3R5a1pocTFiNldhcDRWbjE2V3NjWjhsUC1BLVEtLWNfbld3bXdsU05UalYwcUlCbGN0TnJjWnFDNlFGVzdmdmFoM2M0OE5PTUZZN0xKaXoySVVqUzNV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Judge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’ - CNN",
    "description": "Judge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’  CNNTrump waited 'too long' to seek moving hush money conviction to federal court, judge says  ABC NewsJudge appears skeptical of Trump’s latest bid to nix his hush money conviction  PoliticoTrump tries a third time to move hush-money case to federal court in bid to get conviction tossed  NBC NewsTrump’s new ammo to toss hush money case conviction  The Hill",
    "published date": "Wed, 04 Feb 2026 21:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQMTZQVjNLUmFwQmhJR3pFYnJaaVZJd3pjOHBTNlEzbEMySmgyRUk5WjBqLUxUS3QzTVFIQS1raU5FbjVzOV83SVhCQ21vVS16aVhObV90ZURMTXZFLUM0Y0IyaUp4VHZuWjM2R0RyMkd1bTZUZHd4R1E3aWpWZEFqX1pJUFgtRTA4cDZuLWM2LUhKc1FQb3FDWWVWVHVvM2lIQXE0TnZ2VDM1NXl4NTcwcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Capitol agenda: Lawmakers brace for a DHS shutdown - Politico",
    "description": "Capitol agenda: Lawmakers brace for a DHS shutdown  PoliticoCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  PoliticoDems embrace \"law and order\" in ICE shutdown fight  AxiosTrump Signs Bill to Reopen Government  The New York TimesThese 21 House Democrats voted with Republicans to end partial government shutdown  The Hill",
    "published date": "Wed, 04 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNY0gtTHdCeG1qd1RRa25TeklhSGd3WEo3XzUzdDgtOTlYMklGaGZOQ0paY21iaDI5MGdGcFdwZk00d1A1WXBpZVMtY0FXR2RxYTNXM0RSTVVpMU1ZSGgzUWhfRVBsUXNWaVYwSUN0WlEteC1KVkhHSkpvcDV1M3JVNkV2UGkxY3BYR0lXemtIRUJnZ0lvTkF0bFVzSUVJRlI5N3J5VWlpZ2IwekVq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE Was Terrorizing Worshipers Long Before Don Lemon Entered a Church - The Bulwark",
    "description": "ICE Was Terrorizing Worshipers Long Before Don Lemon Entered a Church  The BulwarkDon Lemon Takes Stage at NYC Event After Arrest Over Minnesota Protest  The New York TimesThe Army Veteran Arrested for Protesting at a St. Paul Church Was Just Set Free  Mother JonesOpinion | Don Lemon and the First Amendment  The Wall Street JournalDon Lemon says he offered to turn himself in but federal agents were sent for him anyway  CBS News",
    "published date": "Wed, 04 Feb 2026 15:48:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxOWUNPekY2dDc2YlpxV0NxeE9HMWpPMmtkWnhsZVE4Y3JCa3dFTE1TZWhQS1FRXzNxcURjeVVWakl3VXMtcFpVSEFjazh3N1hlT3p1TlBxeW45Rk1zamcxcWpEMmFQZDM5OXpSS0NuSFhxT2F3eUE2d2JzUGtsNXk3UDU0QVlvX2NjVHo4dDVtSm5ZcDJCMnF3dndZaV9iTVh3aWhLQ2xkdkpMRFpZa1h0ZEQ4QUVoYWN5dHhzVVRYbEhhTmRtLVkyUXVfU1pkckYySEdjbG9hbnNhUWNvdDlkLXpTN2x6UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Democrats lay out demands for DHS funding, urging GOP to \"get serious\" with both sides far apart - CBS News",
    "description": "Democrats lay out demands for DHS funding, urging GOP to \"get serious\" with both sides far apart  CBS NewsJeffries outlines Democrats’ demands for changes at DHS and ICE amid funding battle  PBSHouse Republican Leaders Hold News Conference  C-SPANSchumer, Jeffries mend rift, present united front on DHS reforms as deadline nears  Fox NewsWatch live: Schumer, Jeffries give remarks as DHS funding battle heats up  The Hill",
    "published date": "Wed, 04 Feb 2026 17:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9JRHBVUWo0TGJ3eElwdjJ3bGxyYy1XcWJ1eXZ2Yk0zU0kzSHRNbE1xMXBtaURjNDVra3lnS1lBcVBTb21FcXZlMlQyMUJ0ZGUyUFlZTi1ZUi1semVkMGlrR0F5YUt0TDJUbzlvNG9KdDXSAXZBVV95cUxNNUFGNmZTclJYNUoxd2FVMGp6YnJ2bEhRSTA5a0tvalM3QnpEN0NkMmMzcFJfV04xbm5Zazg0N1N5bmEyS005MmVYWTlpRDVhQXFINXQ3MFdYZVI1WlVmR2xSSEpIQ2Q5dHp1VVpsS3VlWmxPaVd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Hochul Chooses Adrienne Adams to Join Her Re-election Ticket - The New York Times",
    "description": "Hochul Chooses Adrienne Adams to Join Her Re-election Ticket  The New York TimesHochul taps former NYC Council Speaker Adrienne Adams as her running mate  City & State New YorkNY Gov. Kathy Hochul picks Adrienne Adams as her running mate  GothamistWhy Hochul chose Adrienne Adams as her lieutenant governor running mate  Times UnionNew York’s Kathy Hochul forms first women-led ticket, selecting Adrienne Adams as her running mate  Politico",
    "published date": "Wed, 04 Feb 2026 19:37:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTklaU0Z5eHhJU0hONi1XV19wd1YySjVYNmg5R182LWJfTEhMOTZQejNVTHYyU1JrdFRPWUg2RXNYTFNJVTZ1dWxHVktQOE9Jb2x4MGNGbVVBV1dGY1UweTVlNDExVzJiNzlnWW85Q0tPQUYtM3lvX0JQOHI0b09PMkM3Rm02WHRNcnhqYmlTVWdwQ1A5a19HYklSZUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm - The New York Times",
    "description": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  CNNOhio GOP leader says no to Trump election plan  News 5 Cleveland WEWSSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC NewsTrump's 2020 grievances fuel election power grabs  Axios",
    "published date": "Wed, 04 Feb 2026 21:02:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOakM4RDB5eU1VUzc2NUpSQW9RMTJpaEx2R3BhWUtCTlhtd3NRVFZjVzFKdWJ1eGNLMXMybktzVFVYSlhHa2FUTkZ5M0xCb2dSelQwenl1dmJNdDB1elJPNkxtWlJSLURhdFV0Q2hySkpiM191aW1POEJ3YXJ1WFhLbjBjUDdicTJaT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Spanberger orders state law enforcement to exit federal immigration agreements - VPM",
    "description": "Spanberger orders state law enforcement to exit federal immigration agreements  VPMMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.orgGov. Spanberger signs executive order to review law enforcement policies; GOP responds  WDBJ7Spanberger draws 'line in the sand,' instructs state law enforcement to stop working for ICE  Richmond Times-Dispatch",
    "published date": "Wed, 04 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOLTNVOWxjYXFzYkZUdFNtcHhJOXAxUkhPQ0tVb1JLS3pMSktqX3pTU1MxS1ZTck00ZzhtY1FlTGZhOU1CaFZEYWQ3MmhLYjROWkttY3BaejRnYVk4OWxiRW1KY0hsVWZsOGRuMFBzdnA3S3VaaHJhTEx5OWpoX0p6M3NGOG9LT1gzUVNPUmhqeU12V250UFRhOURRRDMycFFNMU8tbHFvTlpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Virginia Supreme Court will hear redistricting challenge - Politico",
    "description": "Virginia Supreme Court will hear redistricting challenge  PoliticoVirginia Supreme Court gets chance to revive Democrats’ redistricting plan  Democracy DocketLucas says proposed new congressional maps are expected this week  WVTFWith General Assembly Democrats deadlocked on maps, Texas results pose a question: Does Virginia really need to redistrict?  Cardinal NewsNew Virginia AG seeks to join legal effort to support redistricting  The Washington Post",
    "published date": "Wed, 04 Feb 2026 21:04:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPMGpDcS02QmJUTGZhcjdZR0dCWnRZbnBaZ3lYNHJaRlltNkJGbW52YzlVS1dZOWhzaXN3dG1iTnQxSUFIdHdhZ3AzalFXZndUZkRxX0RjWGVXcGxaalVWVVgyNTl0Wl9oWUEtYWJGcUdueGUteURKUWtwVzJCU0NJVXJTYl8yOFhXOGkxczBTQTNxS1E3Y3plRGZ1Mlk2OU95ZGZaYkk3aDJiQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win - Politico",
    "description": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win  PoliticoDiana Moreno’s Assembly win marks first electoral victory for Mamdani as mayor  City & State New YorkQueens voters pick Mamdani's successor — plus two other New York special election results  Crain's New York BusinessSpecial NYC elections 2026: Diana Moreno wins in Mamdani's Queens district  Spectrum News NY1‘Welcome to the People’s Republic of Astoria’: Diana Moreno cruises to victory in AD 36 special election to fill Mamdani’s old seat  qns.com",
    "published date": "Wed, 04 Feb 2026 15:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVWtTZm9HRGZ0Nzg2RjNsYTRHVFZEZk1ka3k1bTF2cjlycFk2LW4tYmluaFlaT2JWYXJuWFRoNHVXUEI2RkZZY0NwS2VhYzNETVQ3eDlfc2pIQ2x5RHFHckw2WVFPY2lRZ2ZnbWpGRVVrQzEycUxzMGNBS001czBxdzJSTWJpOElKeHZ0RmxrSkMtZW9KdDJEZkpfTTRTTE1DdE5qYzVhRjhIWmtlUzFiblpfYjU1YkxoaFQ3aFp4RURfMWUzenJPbQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "How a Labor Leader Took Down a Culture Warrior in Ruby Red Texas - Rolling Stone",
    "description": "How a Labor Leader Took Down a Culture Warrior in Ruby Red Texas  Rolling StoneRepublicans are freaking out about Hispanic voters after a Texas upset  PoliticoA Democrat flipped a state Senate seat in Texas. Republicans say it’s a ‘wake-up call’ for the midterms  CNNOpinion | The Message From Texas Voters: We’re Neighbors, Not Enemies  The New York TimesTexas Democrat who flipped reliably red district says people are 'tired of campaigns of outrage'  ABC News",
    "published date": "Wed, 04 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOcHBqWmN5UVdUVGNzaV91UkxfVHl6NnpOSUdLVnNCVFdNNE1zNTl6anBVRjA0dWNoalZGMjIzeHBJUTRCTUpDZ3JlLW9HMEQyZm1iTGhwZ192YWJYSUZiR2pZM1U1RFRwSmJLNDdOM0ZuU3h0VHctWnU3VzJPejhVN1hRT29Mazc0MjBSN09SNEgyU3JoLVFaMWw1SF8tSG1NTlZGSXRSMmh0NlZxbXVBWVRMUXhCZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsRussia and Ukraine Resume Talks After a Huge Attack by Moscow  The New York TimesRussia-Ukraine war: Second round of peace talks begin in Abu Dhabi  Al JazeeraIs Putin ready for peace? Abu Dhabi talks will tell.  politico.euUkraine and Russia hold ‘productive’ first day of US-led peace talks in Abu Dhabi  The Guardian",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "February 3, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 3, 2026  Letters from an American | Heather Cox Richardson | SubstackJudge Blocks Trump Administration From Ending Legal Protections for Haitians  The Wall Street JournalOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesSouthern Ohio Episcopalians continue support for Haitian immigrants as Trump administration seeks to end protected status  Episcopal News ServiceFederal judge postpones Trump administration's termination of TPS for Haitians  NBC News",
    "published date": "Wed, 04 Feb 2026 06:22:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9NT24zQkpodkk0Z2lWcXNTdHR3QzhxZFl1dWs4d1pyM1FjSlMtWW53QXV2VnJsTEtDSWxQRUpTOGFOa3FzUmtYcFdFWVphcFlCTkNHNmdTNGk3cFgtSW5BUzNqSk96RUJnSDBv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "Brothers of Renee Good describe family’s grief, urge action at Democratic forum on ICE force - Los Angeles Times",
    "description": "Brothers of Renee Good describe family’s grief, urge action at Democratic forum on ICE force  Los Angeles TimesRenee Good’s Brothers Call on Congress to Rein In Immigration Crackdown  The New York TimesSeveral of these Americans experienced aggressive encounters with Trump’s DHS. Now, they’re telling their stories  CNNRenee Good's brothers and a woman shot five times by CBP decry DHS' tactics  NBC News‘Our family feels deep distress’: Renee Good’s brothers plead for Democrats’ help at hearing  The Guardian",
    "published date": "Tue, 03 Feb 2026 22:17:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOcnhZbE5obVNfcExUc0JudWZtbjVJMWwweENibFRHWTYtZENTelZwXzRiSWVRcEZIZ3dSVl9jdW9PRWdndjlYRlhYODgwUUhRTWl1Yk8tUmhCZ255SE84dXJnemJCeEx5dEhaTVkzbUJQeXlucTlsNTgzYVg4U3Z3TmtHYjFnWDNjd25Ud2tNeTlkc0p6YXV1Z0dTRUVVQjQwZXVfbS1KelFjbFBHVFVyQWZ1cDg4VlVISzljbFFfTkVjWFRUbW9DNlhnRzJ5aEdkTlFWOUNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Judge restricts federal use of tear gas, munitions at Portland ICE protests - OregonLive.com",
    "description": "Judge restricts federal use of tear gas, munitions at Portland ICE protests  OregonLive.com‘It is brutal’: Portland couple captures video of chemical munitions deployed at Saturday protest  KPTVJudge temporarily bans use of tear gas at protests near Portland ICE office  The Washington Post‘Joyful’ bike ride turned terrible as Trump thugs tear-gassed innocent marchers  BikePortlandResidents, protesters speak out after gas deployed at Portland ICE facility  KATU",
    "published date": "Wed, 04 Feb 2026 04:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOVVc5cGdkS3hRclJva3Q2Sm1nbVdjMXE1Zy15NVJNWk4tT0lmZ1h4MTFvMDI1VDUyZmRpS01DUUFTZl83ZXo4X3hzeTZxVzVZQ29zYjlNcnlOTWE4VU1uQTdkcDJFaTJqaUlkNktmQ3IwTDh4WHpqQW5heFZqNXlSVF9MMFBzT3E4NWVxSHZUQkpBTGdNejc3OHNZU2JBWGgwZWNfVWw3azl1dkd3Yk51ZmxGRzQ3QTDSAcsBQVVfeXFMTkVYS3drQm1SWFpINGFKV3VUTUpwelhlcU9Ed19HYXZBbW9TeHNsOVgtRE9NS0NLNUI2UDcxS2pnd1FGNThPOU9XUjhrTHB2azMyaExtTUk1TzNzcS1tR3lZQlh6aVFCeWFkT3FJWmZwX1F3cjBWSXhCRFVhTkNhd3o5OTFwVFFwdlc5ZnFBNGRMcndoSERVdnZuWjhMaXo2SGNKckM4bEZpWmROblQyYkVnQ1QtX3haZDIxVWVIbmJOczdQYXV1SHBIM0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  }
]