[
  {
    "title": "'We believe Nancy is still out there': Latest on search for Savannah Guthrie's missing mother - ABC News",
    "description": "'We believe Nancy is still out there': Latest on search for Savannah Guthrie's missing mother  ABC NewsInvestigators detail new timeline in Nancy Guthrie’s late-night disappearance. Here’s how the evening unfolded  cnn.comSavannah Guthrie’s Video Shows a Rare and Anguished Reality  The New York TimesFBI Makes 1st Arrest Related to Savannah Guthrie Mom’s Abduction Case After the Host Pled For Her Kidnappers to ‘Bring Her Home’  YahooLive updates: Authorities offer new details on Nancy Guthrie investigation as search enters fifth day  NBC News",
    "published date": "Thu, 05 Feb 2026 19:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNbk4yN2ZVVWotSm1uT0NrTWVKVG9BemVhVUpYNEh2cS1fbC1SX1hoNDQwZmV2TERGdXZydFF2bEZKZllOX3VFT296dTVqYlR5aks4MUk5bUhERklRVjQ2S29iN0VYWEdYTEdHNW9qNmNadzVocHNkdWRVTkh6YW45bEl4TnZhcERmcldmZWI1SlB2S1hTU0pDb1RfbVVpSmU3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms - The Guardian",
    "description": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms  The GuardianSenate Dems Who Pushed Meatier ICE Reform Shy Away From Criticizing Schumer’s Softer Package  The InterceptDemocrats plan DHS funding offer as Thune floats long-term punt  PoliticoWhat Restrictions Are Democrats Demanding for Immigration Agents?  The New York TimesDHS Shutdown Even Likelier After Dems Issue ICE Demands  New York Magazine",
    "published date": "Thu, 05 Feb 2026 20:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPelU5dmotUnI5TVFOY0FiNEhtOFNQYUFvbW1YYVVCNEJ2X3lvTmwwTDJ4UVM1OGRJQW85eHNac1pXVzBlTVVLbERiMlN2ZVB1TmgzRXoyU2tlbjQzRlhNN2VQallXUWdON1gtbnB3Ykh1RmtNdVdmUmlRc2ptay1DQ1N4MlJrVkdJWUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Poll: Nearly two-thirds of Americans say ICE has gone too far in immigration crackdown - PBS",
    "description": "Poll: Nearly two-thirds of Americans say ICE has gone too far in immigration crackdown  PBSTrump’s deportation push is scrambling New York’s suburban politics  PoliticoOpinion | Calls to ‘defund ICE’ are horrifying  The Washington PostPoll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement  NPRICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC News",
    "published date": "Thu, 05 Feb 2026 10:00:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNms1Q1hyNzNnVzVfblZVclJmM3o1SGp4ODZQUHBJN0xmSkpWVjM4eFU4WkRtM01ZX3p4Ty1WMmZ6ZU9YZWs4RjNLNTE0cG9kakdPc2lWRS1yY1lpZlBsUGdZdXVHNjFhUFd3clhkTndST1JkTndINzZaeGJCNk4tRFZ2SUJUQ0dZMS1Zd0VkZHFCWlJGRk1TTnA4dkxaTlNOcVBjLUVNTFRlOWxWRUhNRGdIdW5nQVAwbEduRnFMVXHSAcYBQVVfeXFMTVJoOVA4cnRGVWtYWlItVEdRSm81WnhjRm5icHRoQWxzRm15UzZzS1pqZEx0c0Z4aGl0MHRnRE55YU5jc2JJRl9ha0pxUzFSWVFvYkFRZEF2dWRfQ3psTjA2azFrSGRhR0cwUWRveFVVVXJIakw2TDBoVUk1TGlPcFhFWEt0NWFRYlY2WVhmcFZSNFBySTBZZkhyRkNEYWhmRW1YUUt5RzJZcDdhM2M3X2pwOTZ0Q3RyQ0NEMkZJelQwcHZfSUxB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Austin Beutner drops out of L.A. mayor’s race, citing daughter’s death - Los Angeles Times",
    "description": "Austin Beutner drops out of L.A. mayor’s race, citing daughter’s death  Los Angeles TimesAustin Beutner drops out of Los Angeles mayor race  ABC7 Los AngelesL.A. mayoral candidate Austin Beutner exits race after daughter’s death  KTLALos Angeles Civic Leader Austin Beutner Drops Out of Mayor’s Race  The New York TimesFormer LAUSD Superintendent Austin Beutner announces end to run for LA mayor  NBC4 Los Angeles",
    "published date": "Thu, 05 Feb 2026 20:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNTmZxQ3k5cjBvYzZldEdnZ01ReFpmM0p6XzZCVGVSdXVsSk1uMjhYSlllSGpseng4enJiUjg0RG1aWHZ6aVo1eG9ORkFlWldIc2M2OWdYWnIxcTM1LWV4bGZGNTNyRGl5dWhHZzdZanNGcm9PVW5QTEd0ZTViTVNlOGpZdWMtN3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Federal judge blocks immigration agents from making warrantless arrests in Oregon - Oregon Capital Chronicle",
    "description": "Federal judge blocks immigration agents from making warrantless arrests in Oregon  Oregon Capital ChronicleICE agents can’t make warrantless arrests in Oregon unless there’s a risk of escape, US judge rules  cnn.comICE Isn’t Just Breaking the Law. It’s Trying to Rewrite It  BloombergOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesCongress must hold the line: ICE cannot be allowed to break into our homes  The Hill",
    "published date": "Thu, 05 Feb 2026 17:00:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPX1d2SXVFSXdxb2lkMnprU0VuajFxRGNnMUM4Tl9uRzRiQW1tYmo2Q010Nmkycmk5Wlo4TkVEQ1BfdE8zTV9tUkZoMnZOMEF6c2NndUdUMFZTQjVuM0d4RkhxbGJ3aXc2UXVoYTBSQkhxTHl5bHRTQTFQNGh2ajc1TnBnanBGQ2p3R3FMd2RBT01NSzRId3djY1VYbG16UWdwcG84VTQtSWV2MXRmZUxfcTl4aVFsWjE4bkFnd3BCREVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oregoncapitalchronicle.com",
      "title": "Oregon Capital Chronicle"
    }
  },
  {
    "title": "Trump says the lesson from Minneapolis is to use a \"softer touch\" in federal immigration enforcement - CBS News",
    "description": "Trump says the lesson from Minneapolis is to use a \"softer touch\" in federal immigration enforcement  CBS NewsThe tension at the center of Trump's retooled immigration message: From the Politics Desk  NBC NewsList of ICE raids, major updates in Minnesota on Thursday, Feb. 5  Bring Me The NewsProtesters react to federal agent drawdown in MN  FOX 9 Minneapolis-St. PaulTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The Guardian",
    "published date": "Wed, 04 Feb 2026 21:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdEVqMWhRTFlBNWRnOUdwbG9BYV9iWndDVlZQRjdXblR4N0YtRGFLNFpzZk1SOXp4REo2ZWxzcndtU0lCcFluS3RPZ1otV0xId05lLTRsV21URU5QSWJiQ2JocENaMjAxQnBlYkRVZlp5c3QtbUhSaVhPbUlLZXFvdGxXcXBJZW84dEJJdXRYcjVMMUhvRnfSAZsBQVVfeXFMTzNmUHJXSjhBMWQ0U0pHd3FGNkg1UWJvNlR2aHdnUl9vckJ5ejlubFpPOEpfaWRKRnVYdzk2aXg5bm5MdFlCdm9aVXBTRTlaZ2tIOUxJWDlmSVpTY242MFNFSTJ6NFhESWppRmVGVlVnY1Y5VW95NjFHVWl2d0pqTmtwYW00VV9RVVNkU2VzbDg4LTRBQ3ZuRDJ1eUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - dw.com",
    "description": "Why Trump and his Republicans can't take over US elections  dw.comTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comWisconsin lawmakers respond to Trump's calls to nationalize elections  WLUKTrump’s comments on nationalizing elections worry Colorado election officials  Colorado Public RadioWhitmer, Winfrey respond to Trump’s suggestion to federalize Detroit elections  ClickOnDetroit | WDIV Local 4",
    "published date": "Thu, 05 Feb 2026 15:30:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Clintons keep pushing for public hearings as Comer digs in his heels - Politico",
    "description": "Clintons keep pushing for public hearings as Comer digs in his heels  PoliticoHillary Clinton presses Comer for public hearing instead of Epstein investigation deposition  The Hill‘Comeback Kid’ no more: Dems aren’t protecting the Clintons from Epstein scrutiny  PoliticoHillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'  CNBCAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC News",
    "published date": "Thu, 05 Feb 2026 20:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNano1bWdmTjhjX2JCUzBUM2FYeTBVZ2tLRTV6V2tFWmFZS2hDQTJjNV9fQzFNajk2TGJSR19OZnExX0xXa2pzbC1ocFl1THh3bW5TSGNGcEppM2VRbnpxWWd4NFVBU1Fwc1NFRlRBa0l0Nmp3WVR4R1NLTVlhQkVpOVRvUGcxNTRwNFdWbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks - Axios",
    "description": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosSenate is not ‘anywhere close’ to a funding deal as ICE fight intensifies  Los Angeles TimesLatest on the Trump administration: Democrats and Republicans sharply divided over DHS funding  cnn.comHomeland Security shutdown grows more likely as Republicans rebuff Democratic demands for ICE  AP NewsPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News Network",
    "published date": "Thu, 05 Feb 2026 12:26:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5Ga0oyRmVOUDV2ZlpSZkk3QlFzQzhQeVI3QXQxV1kzbUk2V1lLVDhfR2dfUlAycnRtdWhqYk82YnN5aTRuTUFPUHd2RDhyUzlROVZnT3lYd1Y5UzAwc090WllKUmY0TU1yTlZRYldnSTBRVEozV3plNWdQd3Nqems?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "At least 3 dead, 7 injured after car crashes into 99 Ranch Market in Westwood - ABC7 Los Angeles",
    "description": "At least 3 dead, 7 injured after car crashes into 99 Ranch Market in Westwood  ABC7 Los Angeles3 killed, 7 injured after elderly driver crashes into Westwood grocery store  KTLA3 dead, several injured after car crashes into 99 Ranch Market in Westwood  Los Angeles TimesCar crashes into LA grocery store; 3 dead, several hurt: Officials  ABC News3 people dead, several others injured after car slams into Westwood grocery store  NBC4 Los Angeles",
    "published date": "Thu, 05 Feb 2026 20:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeERTUURpOTZkYVQ4VkhFUHVyZFNVTHdER1gwck9UMzVuYzR3ZThFWm9oeXJtTWxSUkYtVTIxWFg0YVJ4N0VyRW9oWU95SzJBZjdPb2JWMGlFbi1STU1HSTU3X2EwVFVPNU5tV3p4UG5ubEdvcndXSTdSODVKN2lnS2dCVnhvemZrY1k00gGQAUFVX3lxTE1YV1Yxd0pOY0VyZEdlUWdsdWZybzdDaTN6ZktDSjZmd0hCUm9oS3hUZFBHUEdsZDc2Ul92VFN3Y1p0TTNtaEFWamV1dzQ2MU5OM3BLSUlwY0RlWkE5M3lWYnBaMXRzbTkxam10OU9QXzhqTDdtQlNxNFB6bm5mT09PM0NEM1BYeGFtSmdjWC1WNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "White House Offers Shifting Story on Gabbard’s Presence at Georgia Raid - The New York Times",
    "description": "White House Offers Shifting Story on Gabbard’s Presence at Georgia Raid  The New York TimesWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – live  The GuardianWhat does Tulsi Gabbard’s job as director of national intelligence have to do with elections?  cnn.comFulton County challenges FBI’s seizure of its 2020 ballots in court  PoliticoJudge dismisses claims in lawsuit that sought Fulton County 2020 ballots  AJC.com",
    "published date": "Thu, 05 Feb 2026 19:04:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPaE1FdEc5VFQtdXp2Y09VdWNGUWtxNjdCVFdTd3pEZWpOdExrRDR3ZHpFWEhYTzJmbm9mbFJmME9kaktvcmt2TkhnSGU3RXhBQ0tHbF9uZ0dGdWx5T1Y1d1l5MFVlTnhXXzg0M1NUVno2dTU1QUlteGZYVVdzdG1sR2JEVlRTQldEdW80VkxGZWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Chairman of major US law firm steps down after Epstein files release - BBC",
    "description": "Chairman of major US law firm steps down after Epstein files release  BBCBrad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout  The New York TimesChairman of major law firm resigns after Epstein emails become public  cnn.com‘Call Brad Karp’: Epstein’s Fondness for Lawyer Ends in Downfall  BloombergExclusive | A Revolt Inside Paul Weiss Over the Epstein Files Took Down Brad Karp  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump to launch TrumpRx.gov, branding his push to lower prescription prices - The Washington Post",
    "description": "Trump to launch TrumpRx.gov, branding his push to lower prescription prices  The Washington PostThe White House is launching direct-to-consumer drug site Trump Rx. Here's what to know  CNBCTrumpRx Is Set to Go Live on Thursday  The New York TimesTrump to launch discount drug platform Thursday evening: What to know  NBC NewsTrump to launch TrumpRx drug discount site. Here's when  Axios",
    "published date": "Thu, 05 Feb 2026 22:09:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPUWRNM1lxRUhOcGdzSHc2N0lzUlZRWlltRmRSeHpBdU9zazRSSzhjNXRSZ2JvRW1tM2RnNml4VTl6dS1MMEROWEI4MzEzSjd0Zm80WTk1LVo1Tzh1U015N2l0U2Y3aEJaR0RyNVhFWTZBM2ZMOHljSGRNUElFa1pRMldLaS1pQWZqcGd0S3BB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Fears of nuclear arms race rise as US-Russia treaty expires - cnn.com",
    "description": "Fears of nuclear arms race rise as US-Russia treaty expires  cnn.comA key nuclear weapons treaty is ending. It’s a blow to Russia’s ‘superpower’ myth  cnn.comTrump's nuclear arms control push with Russia hinges on China  BBCLast Russia-US treaty on nuclear arms control set to expire  Al JazeeraTrump calls for nuclear experts to work on 'new, improved, and modernized treaty'  Fox News",
    "published date": "Thu, 05 Feb 2026 05:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNZ2JCVGtFTlZQaF9hdVZHMlFEaUs1SEY5QUZiWmZxaWhGQmxjTU5qa2tGZWI5c2FyTDhfYzd6bDlNcC10Y2FoMlRWbjRRbzJtOVdlUl9RUEdEcjRtWFJzLTlEY3p1MUw4THZhbEM2NFo1QmdMNldlT19WX3FKelFnVFhUNGQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Arizona Department of Public Safety helicopter crash kills 2 while responding to shootout - AP News",
    "description": "Arizona Department of Public Safety helicopter crash kills 2 while responding to shootout  AP News2 Arizona DPS Troopers killed in helicopter crash after shootout in Flagstaff  AZ FamilyDPS crew members killed in helicopter crash while responding to Flagstaff shooting  FOX 10 PhoenixAriz. DPS helicopter crash kills pilot, trooper during shooter response  Police1Arizona DPS helicopter crashes while responding to shooting, killing both on board  NBC News",
    "published date": "Thu, 05 Feb 2026 21:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPYmZkazRITTZBalViT3Y3LWhhRnhHR1A5NmkzV3g2Sm1Vc0hUYW9HSEhmT3lEdVlpR0tYZWR3N2tEa0ZjWm5ScEVRVU9wOTdiZGxZTU9McjBHMDFFZGROYVlFUTFlY0FESGlpa3hpV3FpaDlZZlU3VTZUcTkwVjR2RE15OEdROWViWWRwOEpVa0NCWmpHbUFORw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Woody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files - The Guardian",
    "description": "Woody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files  The GuardianTrump says America should move on from Epstein - it may not be that easy  BBCJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comJeffrey Epstein’s Money Mingled With Silicon Valley Start-Ups  The New York TimesLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Thu, 05 Feb 2026 08:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxObzBCRnZoYVptZ3A1eVF5QTNyX3llRzFiVThHcmhOLWhza1hDU1duSHRmUWtpVG1uRHFLeFFRaGs3UTdYT3REYXhrV3NYMjlkS1hEekVJR0FKUUFmTnZDVGhzTk0zYVRJa1lJbWktWlV4Y3ZDSlpGY1hlZmtwT2VGZzk4dVJuV2ktSmlGZURVSjQ2NGF0dXB1YjFTRGgzTGpOMG0tQVA1eU5CWVJhcVJrbnV2LVVGRVZMOFdIdlJGRkRQY0NoSVpOaEFFS1FOUGhhREJoeHYzaWNBVXoydTVCeDVZZXNSSXRTYXMyTkEzYTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Spanberger takes further steps to remove Virginia from ICE operations - The Washington Post",
    "description": "Spanberger takes further steps to remove Virginia from ICE operations  The Washington PostSpanberger orders state police end ICE cooperation; delegates face questions about move  WJLAGovernor Spanberger signs Executive Order and Directive, establishing principles for Virginia Law Enforcement  WSLSMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.org",
    "published date": "Thu, 05 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNUJLTndRdUJMelBUY21pbVVubkV1QlJBWEZBUE9nMF9UcXF3MzQ3SkZXQUl0R21EeDhObk1kTWhycUNUN1lTaGx0eEt1ZXl1UERIZ18tS3M0X192aGxMSkVaaDdlWjBtd210OUlqVDNUcWJvTjV3YXcwaG5TeExFZ1NHV0VxTkRtSjQwZ1pUQUFNOUN3Zm1KOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Top Minnesota prosecutor says ICE cases are sidelining ‘pressing priorities’ - Politico",
    "description": "Top Minnesota prosecutor says ICE cases are sidelining ‘pressing priorities’  PoliticoSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York Times'This job sucks.' Trump administration attorney leaves Minnesota post  USA Today'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC News\"Tsunami\" of immigration detention cases strains U.S. Attorney's offices across America  CBS News",
    "published date": "Thu, 05 Feb 2026 14:26:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNYVdkcWVBT3RfU3JGRXBlODNsMzlhMldDdmV3dkZKZTNBal9KT2RoOEdFLWFTel8wSGo2ZWNtX0pBdWdGX09iSFlIQ29fR0ZFbjVZREtzam96X083WlVWOTFCNl9nSFNiZV9xN2h2T2NDb1ppOG9GRVNfWF9xMFN6aHU2YVV6V2pramJGZWJkMHR1SDIwMkNjdGhHUVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Bio lab found in Las Vegas is similar to scene discovered in California, raising questions from officials - CBS News",
    "description": "Bio lab found in Las Vegas is similar to scene discovered in California, raising questions from officials  CBS NewsHousecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasIllegal Reedley biolab linked to Las Vegas lab; Fresno County and city officials say Reedley is safe  ABC30 FresnoLas Vegas biolab: Answering some of the biggest questions still looming  KSNV",
    "published date": "Thu, 05 Feb 2026 15:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPN2tSa1o0cHpyUU4zWW41aDAtOVd0RW1EbmZwNU5WelpNS1pBMGw2WnhnWG1WU3I2STZGeEhzLUswU1FmazVQckYxWHZQc2lheVYya0djM2tJaXE0OXgzQ1VuRWcyQUdTSTNtUzlTXzRZckgtZXI3Q3UyT1RFckR4Zlhn0gGHAUFVX3lxTE1Kb3JNZTJkYWx3Y2p2c1g4dXNHVWlrVGtTbUxYOWMtblRaQlp1aXpYVkpNNlBYcGVuU3RISDZJWm9iQ1U3eWNLWk90UkMtcmEzZy1JU2tOVlJsU096SmhPaGVnUWxUaEp3ZE5SNk1VQWVuYWJmdzFCUXhHalNoRHVIMGEzMVd4Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "What's at stake in the race to replace Mikie Sherrill in Congress - Gothamist",
    "description": "What's at stake in the race to replace Mikie Sherrill in Congress  GothamistA US House special election in New Jersey becomes a Democratic testing ground  cnn.comWhat a crowded congressional primary in N.J. says about the state of Democrats  NPRAIPAC Donors Flood Last-Minute New Jersey House Pick With Cash  The InterceptPro-Israel lobby group pressures ‘moderate’ US Democrat in new strategy  Al Jazeera",
    "published date": "Thu, 05 Feb 2026 11:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOZmphM2prclN3bzcyLUdIaVJ3VE5WNHBHTXVieWdwbmZKN2VWNGxkSjZmZjliTzM5TUFaMnlsdDF3cDd6dDhGa0JfZThWQ01OS05VZkQ1eU10OENpdEFQWUhMQjhvSzBxaS1tQ0Q0bGxQTWxYckFER2VkSnh2STdkdTlVMlROVmtkd3VOc1R6U3E4dGNna1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba ready for US talks ‘with no preconditions’ as energy squeeze bites  Financial TimesCuba Says It Is Ready to Engage With Trump as Fuel Shortages Worsen  The Wall Street JournalA deal that Cuba (and Trump) cannot refuse?  Responsible Statecraft",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Marco Rubio out as acting head of National Archives - Federal News Network",
    "description": "Marco Rubio out as acting head of National Archives  Federal News NetworkMarco Rubio drops one of his job titles, while still juggling several other hats  cnn.comSecretary Rubio Gives Up Role as Acting U.S. Archivist  The New York TimesMarco Rubio has one less job in the Trump administration  PoliticoRubio out at NARA; illegally names ineligble political appointee to serve as Archivist  Anthony Clark | Substack",
    "published date": "Thu, 05 Feb 2026 01:09:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQbzNsRFBSM2d2ZTFDYW1OenRNVWNEbDU5RlVyaEZMUG5nQjNQYzA5UlRQaGhMVEsyM0xTaTZlVGhGU1d0cFFkVnRqMlhXNVFwVWZKMkNjUW5icjJYeU5FZmFYTE96TXpNcjZud1lKcElrWkF4OTdqU0dZeGpocTg5REVmVDZXRURBQzFKSHdNbXBRTjlpWUtpbTVlVTZzRms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://federalnewsnetwork.com",
      "title": "Federal News Network"
    }
  },
  {
    "title": "Police close streets after ‘critical incident’ in Portland’s Pearl District - OregonLive.com",
    "description": "Police close streets after ‘critical incident’ in Portland’s Pearl District  OregonLive.comSuspect shot and killed during confrontation with Portland police in Pearl District  KGWOfficer-involved shooting in Pearl District leaves suspect dead during warrant service  KATUMan shot, killed by officers serving arrest warrant in Pearl District  KPTV‘Utter chaos’: Suspect shot, killed by police in NW Portland apartment building  KOIN.com",
    "published date": "Thu, 05 Feb 2026 15:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNVUxNOUVLbEZhaUdwajRSN2lIOVFMRkJUZWprZTFULUxFUnV1ck9mZGhBaWVfWmZUZW5CaE5oRmdleTVOUzZoU08xQVc4LVl5UHBHUFN3WTlHaG1wM2I2U2RhX282NWNHWE1OeG5SMFFrSUNmb2JNbFN5TXBEQ2RnRzk2SG5ibFFQaXM3Mmc0WFozU2NlT3RFTFdha1BGSjU1dmZLWjhDemcwSXZkNlFUcnVWbl92ZWJHSUt3YmVybHVrWWVVUkhJQndqbUI0OGpMY2h3cNIB6AFBVV95cUxOaXhodjZKMzgyTEdtdzR0d08wTWNMTUpFVlkyQ1lMMlNKQTlWb2gtRENKWjRUeFc1M1I5QlpmQkNCeUFrRll1S0F6dUN4TWw4OXZmUVU0RTJITm04X3JnTVd0MG5jM3ZKVTllQ0R4WkhqUjhKVUV1M01kM3ZxTkJXNEJCN3Nvc1d2XzZxbHRLVTVTY0dEZFpUUW83YVBGakdGbk5mTmEtSHNtM08zYlIzNmlXT3lZVm5jbGUtRUNqMkctZmtYVkxqSlgyYU5LRXBiemtjb0UyMFV6eDZHeEczOGtjM0VLZnpx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "Scott Bessent’s ‘gotcha’ moment on Trump’s tariffs and inflation - Fortune",
    "description": "Scott Bessent’s ‘gotcha’ moment on Trump’s tariffs and inflation  FortuneWarren and Bessent erupt into shouting match over Trump's Warsh joke  Fox News'Can you shut him up?\" - Democrat and treasury secretary clash over Trump's agenda  BBCMaxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  cnn.comUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  Reuters",
    "published date": "Wed, 04 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSnFaU0kxb0NBcFB0enR5cTR4UUx5ZF9TendoRjRjeDhpTmp3RUg5QkI4N0Z6aW9jZ05xVm5YcFJlZ2g4S0MtLTVrUmpwUmNGbnRRWDNVd21lSlN6RHhDN1hqTWFEMHNNOUhfNTdQSXNyRWc5MUgzUzhOYnA1VU56SDRiZU5LeUExX29vUDRVUlBtMTg3YVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Trump Humiliated as Another Peace Plan Goes Up in Smoke - The Daily Beast",
    "description": "Trump Humiliated as Another Peace Plan Goes Up in Smoke  The Daily BeastU.S. and Iran to Hold Talks in Oman on Friday  The New York TimesU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosUS says Trump prefers diplomacy with Iran but warns he has military options  ReutersUS and Iran agree to hold nuclear talks in Oman on Friday  BBC",
    "published date": "Wed, 04 Feb 2026 20:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPSm1nYmxOQmhHWnp4UVVJZHZsSmhzd2Z2T01uSEFZbmlnWnhFLWFNeWJ6ZnRSRFJNVjZ5LU5NOVpETml6YzVxUWNkQU54dk5HSzlvU0xVdmpjZEJTNUdxdkFFNmdOY2lnMTMxX19Db1FBUnpEMDhaQ1JkU2VTSGFKRzY2VVFpRl81V2ZfZkxKVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoTrump has no plans to send ICE to polling sites, White House says  USA TodaySteve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketTrump has no 'formal plans' to deploy ICE at polling sites, White House says  The Detroit News",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show - The New York Times",
    "description": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesPenny the Doberman pinscher wins best in show at 150th Westminster Kennel Club Dog Show  CBS NewsPhotos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPRAs Westminster’s Best in Show is crowned, The Post goes behind the scenes for the real action  New York PostThis Dog Breed Just Won Westminster—37 Years After Its Last Victory  marthastewart.com",
    "published date": "Wed, 04 Feb 2026 17:37:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOdGdOV3EyZWtzVndlek84NmR1ajZPWHFhODlkVVpVaDRaNk15aGFKanAydEJwRTg0bE9rUkpqNDFBcmdjQXhoNjlfOUctRG9kR3RtT3JqYVdTN1NVSUJiNjJNZUJyajA4NTk3QXYwS2M2OXU5bmZMd3o4ZVRoaXMyVmxHSWlqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Minnesota activist Kyle Wagner arrested and charged with threatening ICE agents - CBS News",
    "description": "Minnesota activist Kyle Wagner arrested and charged with threatening ICE agents  CBS NewsMinneapolis man is charged with threatening and cyberstalking ICE officers  AP NewsMinneapolis Antifa member charged in Detroit with threatening ICE agents  The Detroit NewsSelf-identified Antifa member arrested after allegedly threatening ICE agents, DOJ says  Fox NewsFeds charge Minneapolis man with threats after early morning raid  Star Tribune",
    "published date": "Thu, 05 Feb 2026 16:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5QekwtMjR0ZWpDUWZ6TXJmaUdaa3ZVZ0tlTnQ3YkZhbFp4TnBVcHZtQ3pzU2ZlQVRRbm9LV0xtcXQ3b05yY21seDVZRzN2TGw0VG1TZHk0Tlo4RjN4MW9kbWFqVHhWMDFfQjBWVnRMRlFmcHdCcHFLM1RsONIBgAFBVV95cUxQTEstejlkbGZKV3ZPV01HbUxHRHB3T0NXTXZrcGJWMUdIQThLa0tLWm5NcjRKb1lYajhTc2hRVTVsZVRYVW5fdzFiUmtkOTlRcHdHQkFiVU54WDE0eXJsUjVSck1EbzJHQjJGM25IRWowVkl2WXo4Yk91R1htcGNQQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Harris relaunches her old ‘Kamala HQ’ account as an online organizing project - cnn.com",
    "description": "Harris relaunches her old ‘Kamala HQ’ account as an online organizing project  cnn.comKamala Harris gives campaign accounts new life in fight against Trump  MS NOWKamalaHQ is Now Headquarters: An Online Organizing Project for Next-Generation Campaigning  People For the American WayKamala Harris Goes Low: New Trolling Accounts Flip Off The GOP, Mock Trump’s Bruised Hands  ForbesHarris campaign accounts relaunch on X, TikTok in new partnership  The Hill",
    "published date": "Thu, 05 Feb 2026 11:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5YM05wYlZYN2VlbFlsYmRaRlo1ZVMzMlVtTWMxUjFFTXVfX0RvNUF2cGd1SlhfZWNEVWdNekk1cUVKOHJaMXBILVdURTNTd0FYQ3lrMUl5ZEdZYzB4MDRlLVIzSXd6U1czMVNDRHUxc2ZPa0N1RDJ0OHJCbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Vance announces price floor effort for minerals - The Hill",
    "description": "Vance announces price floor effort for minerals  The HillU.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalUS pitches plan to counter China's dominance of critical mineral supply  BBCSecretary of State Marco Rubio at a Press Availability  U.S. Department of State (.gov)The U.S. calls for trade bloc to counter China's leverage in critical minerals  CNBC",
    "published date": "Wed, 04 Feb 2026 22:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPOXJCZGFlOXliV3FZN0ltVmk0eTE0dWlYazB5eGJtYW5veU1ZNnRsVm05Mmp4eDU5WTJCQm5WVldudEIwNlB5MXcyQ1A1bFgwR2tLaGk0Nk5ieG01cHJyQV92a1Z6UXpuWjg2UGhmbUt4ZE54ZXRyVlN5cWg5ckhtWDJkajJEVWZpMXhkV0lzZEZQZ3lHUWZLWHJhS3NiRkR2ejd2WWVkWl9DRGvSAbABQVVfeXFMTzhVOFZneGxaQ3IyM1U0MTdDMEFRYW91alRVTk9pc0o3NGhPWndMQVgxV2U1V1NodDI0WlpFajFib0x2UG1rZm5WZ3pmRlVFRHJkZ3FRQlpycW05eFl6VTZVaXlDTWdWTUYtX1dJamFBd0pjZTZWUFhYR2k5R0hLVHllYzJnN1htdnEzeG14WDBHM05Ld3dScW5oX2VhY1ZSQ29EZnJjRXJnRmhoMkxMOWI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehill.com",
      "title": "The Hill"
    }
  },
  {
    "title": "Sherrill spoke with Trump before joining N.Y. in a lawsuit over the freezing of funds for critical tunnel pro - NJ.com",
    "description": "Sherrill spoke with Trump before joining N.Y. in a lawsuit over the freezing of funds for critical tunnel pro  NJ.comNew York sues Trump ad­min­is­tration over $16B funding freeze for Hudson River tunnels  Spectrum News NY1Feds sued a second time over halting Hudson River tunnel cash, this time by NY and NJ  GothamistThe US Economy Needs the Hudson River Tunnel Project  BloombergTOM KEAN JR. STILL WON’T CALL ON TRUMP TO RELEASE GATEWAY FUNDING AHEAD OF FRIDAY DEADLINE  Insider NJ",
    "published date": "Wed, 04 Feb 2026 22:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOSEtUYmtHZ2hTZ2xFSUg3dGFSUDBxZXV0S1pOY1R1WWFybkVIdFFJMjI3bF90TGlTTG5xMnpaQ28wbWFPMXhyRUxiNmVEZ0VxbFFQams4ZWFhWTFjNEwxMmUzdThtYTFRNXFQWVdPazJCeV9ZTlRFME5tMmpaQTRVWjRmSkw4Z181Mm1lQmNMdWdXT2VDYzN5WDU1MHRlOEN6NmthUkRZRU1qYy0ydS0yVmhGWW0xVXpfeUJFY1M1Slh0Y3N0VVVab0tFR0xjbXlGa2xxczAtS1VnM0NsTG5SRjZB0gH2AUFVX3lxTFBEX2xKamx2T1ZzLW0yRmhOVWJLTWhtZGJ3XzVRcWx0SWxLX3pEanJXUDlqZklxNWhHQUtEMzVQUnJIUS1RT0FTZk1JTXV6RmxvOGpPQ0lYRmcyaVJYWnVGN1VMT2UwY19vc0Jta2JHSWh5cWxaWGF3LTlaMFluWHlkU1lCT0paa1U4RzRxb3otemhHTnZIYXFvMDFlU3hPMl9jR3pEeFVJNFBFZ0FMTzdCVkVuVEdaNm9KUXV5QW90c2FCTTlaSHBHOEVSYlJRa08za3RtSVlYQkNXOGgyUmJxRGZobTF3cml5Snh3dHFSalRUb1c1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms - San Francisco Chronicle",
    "description": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms  San Francisco ChronicleSupreme Court Clears Way for California Voting Map  The New York TimesWhy a Republican Supreme Court just handed a victory to Democrats  vox.comSupreme Court lets California use new Democrat-friendly congressional map  cnn.comSupreme Court clears way for California voting map that bolsters Democrats  The Washington Post",
    "published date": "Wed, 04 Feb 2026 20:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPOG5mbjN5REhFbmN6bFFxcF81X1I4Q3pjYjBUOV9hN29YZ25odTdkZE43QjlOeG83cm44TjRRV1Z2MVlHVktkWWRGbGhsZVVOSWJtNEV4c3V4U0lGeWxKT2tQVzZsby1GWWJHajBkV2dfRHBjVHZ3M1I3b255OWI1VnR2X0kzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsUkraine-Russia Talks End With Little Progress and Hints of Impasse  The New York TimesUS and Russia agree to resume regular military contact  BBCZelenskyy says Ukraine-Russia talks ‘not easy’ but ‘constructive’ after prisoner swap agreed - as it happened  The GuardianUkraine and Russia carry out first prisoner exchange in months as U.S. touts \"tangible results\" in peace talks  CBS News",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Strike date set: SFUSD teachers to walk off jobs Monday - The San Francisco Standard",
    "description": "Strike date set: SFUSD teachers to walk off jobs Monday  The San Francisco StandardS.F. teachers call for strike Monday, city’s first educator walkout since ’79  Mission LocalFor many district parents, an SFUSD teacher strike would be unacceptable  San Francisco ChronicleSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoCalifornia faces teacher strikes across state for better pay and work conditions  The Guardian",
    "published date": "Thu, 05 Feb 2026 15:51:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBDbHBkQXkyREZCMF9qYW1CNXBfMEtEeUhYbFM3eDI5VFR3N3Buek8xSUZHdVVmdXNVV09XVWJHMDJkVk42MC04UnFPbHQwNUpjQWxDRUUzamlrZDVlRk04Mko2MlIxOHpFVk9wemNpY2FmTW5zamhwbVFmNDFLMU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown - The Daily Beast",
    "description": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown  The Daily BeastOpinion | I Was Arrested for Doing My Job as a Reporter. Who’s Next?  The New York TimesDon Lemon arrested after covering protest at Minnesota church  NBC NewsDon Lemon says agents sent to arrest him despite offer to turn himself in  The GuardianUS Attorney General Pam Bondi announces 2 more arrests in the St. Paul church protest  ABC News",
    "published date": "Thu, 05 Feb 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNM1NZQVFTZnJkMlQ5ZW5nUEJ0eUJMWUYxT0VaYTZQbFFyRS1oYTRTM0Z3ZWxhT0JqME9CMm5oRDJNaS1ySFIxNnA1b1dNZWdsdGFaUnd0eDdyVktXTVdhZ0pMV2x1S0lxb1Exd0g3bi1GR00xWl81VUlUdmxLQnFvblZST0Z5cVAwcU02RTlXX04zcjFncjFoR2RpbkEtV0hwOTJ0SFhxeGJ6M0RhamJN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan - Democracy Docket",
    "description": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan  Democracy DocketVirginia Democrats expect to release proposed new congressional map this week  PoliticoDem infighting muddies Virginia redistricting  Punchbowl NewsWith General Assembly Democrats deadlocked on maps, Texas results pose a question: Does Virginia really need to redistrict?  Cardinal NewsVirginia Democrats reach agreement on 10-1 map  Virginia Scope",
    "published date": "Wed, 04 Feb 2026 16:50:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQdXNSTW9mN1J0RTAzN0JkREtGV1dZMmxaYlZwQ2lDRnlSaGRWcDdrS3FpYWdYWkpGUGluVnJPaGUzYnQxSEFtMG82Z25kMlZ2NjVWRDVFZ1M2OHVvcHRQMmVlQi1NRTJLX0tmeU1WMFZBbml2elI5T1ZEaXUzLWZJN0V2WTY1MnEtVVpmVjBFUjBMWTRJN0pRa0ljODNMUWpSMW1ocmhkeFFlazlpa1k1eFlRUTdiZ0NSZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "House rejects D.C. tax changes, potentially costing the city $600M in revenue - The Washington Post",
    "description": "House rejects D.C. tax changes, potentially costing the city $600M in revenue  The Washington PostHouse passes measure to force DC’s hand on tax cuts  PoliticoHouse approves bill to prevent DC from opting out of Trump tax cuts  WTOPHouse GOP moves to block DC from stopping Trump tax cuts for tipped, overtime workers  Fox NewsRepublican bill targeting D.C. could create tax season chaos  The 51st",
    "published date": "Thu, 05 Feb 2026 07:19:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBXbHBBYmJFdTgyWDd0Y3pDWkpHSExpNW5hT0ljdHZzM3ZVVHNLZnhMM0tLRlo5Z1RuNS1WQjJGazlIeVhkM2V3YjdBWExrdzhYVUZWRGVjQjYyWGpwek1TME1vZlhWTl9yeDd3Zk80c1JwZEN1alptUFdGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  Los Angeles TimesWATCH: California governor debate  FOX 11 Los AngelesSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostCalifornia gubernatorial debate underway in San Francisco  KTVU",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida - CBS News",
    "description": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida  CBS NewsRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  cnn.comAttempted Trump assassin Ryan Routh sentenced to life in prison  ABC NewsCongress faces tight deadline to fund DHS. And, Ryan Routh faces sentencing  NPR",
    "published date": "Wed, 04 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUkR3RU1fOEs3eVVBRGMxZnRYckZmclB5aEN4MVowRDVZU0x4X2pock8tTFFaT01JVUZ1c1VMS29qcWhyMjRuZFMzRlliZUsxb0FjbmdjMzkwaVRuV21paUtxaE1FZ0hfVVI5MGdaNjE0MDlUUGd1dWdQU3l5VURHUE1UcjdYUlBFcFVQS0FKb9IBlAFBVV95cUxPMUhweVBsNFVDRjBXa0VaV0xHNFVnOVlabFA0UER1OVQ5RlJtYWtpU0g4TU5CRkJyT0hKRDExME5ZekFzWDZkWlJEbmhQdzctem05czdSenItVEpIUTJDVFBvSldIZlYzaFVjRXEtSWNGNndsU3p4WmNUREJQYUFsSWxDaTBVb0lXQ2xNU2dNZ29CVEFK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "4 murders of homeless people including ex-NFL player may be connected: Police - ABC News",
    "description": "4 murders of homeless people including ex-NFL player may be connected: Police  ABC NewsMurder of ex-NFL player Kevin Johnson possibly connected to 3 other murders in Willowbrook area, sources say  ABC7 Los AngelesEx-NFL player's death may be linked to 3 slayings, authorities say  USA Today4 people have been killed in an L.A. County homeless encampment since October. Are the deaths connected?  Los Angeles Times‘Gentle Giant.' Son of ex-NFL player Kevin Johnson mourns father's murder  NBC4 Los Angeles",
    "published date": "Wed, 04 Feb 2026 19:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRmRoNkUwcGczUlNwQVkteEJsWFYyaEdibXhIdEpsWE9xVlUyeXJiaGNyN1lCa0gwU19iT3FkTWlKaGdXc0xSOUpaVGpVbFFEVU1KaVhmV3FzT1Vycm52X0tjVElDc0xuZXNJRGI1dFVMYWFVV2tmYXQ0SlBkal8yTFh6eEYtOE9icXBLZV9tUTZtZ0lCd1RfZ2paT1ZSZG02LXVv0gGoAUFVX3lxTE02bTg2RnlLU19rSllJWDR0LUNyUGdkZ0tSNlNmMG03c3RsY3RuNXhxazlDdEs5THNuZEktV2lnYTlZc29lTUlXMGdWbTh2YU5BSmlqTzZ5c05KMDhiWXE0eGs1WE8yNDN5Y2ExSGprb09jVDJ3VXAxWHdRdkdEa0lKQTdxRmdyODBJUy05czBDTTBsLW9ubFJxWnVQUXhRenBUY0tabVBGMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico - Houston Public Media",
    "description": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico  Houston Public MediaTexas special election emboldens Democrats heading into federal midterms  The Washington PostWhat a Democratic upset that sent 'shockwaves' through the Texas GOP could mean for November  KUTTexas loss delivers stark warning to Republicans in critical election year  BBCA Democrat flipped a state Senate seat in Texas. Republicans say it’s a ‘wake-up call’ for the midterms  cnn.com",
    "published date": "Wed, 04 Feb 2026 21:35:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakNLdVNVRWRJdmhPSUppRTlrdmZqTFdPY21pMk1ZSXNWX0lIWXowaFgtSFVTYk9kVEd3cUh3NEdoNngxVjdMT0FPaUFHYWt3MTdMSXV6NjVTSzVORGRIWVdhcVZnMVlIa0lUYnZyLWxLbHNrcnVKOEpuamJiNW55Tk92MU1aWmJBbTZGR1pIUUEyUTZod0JMMXZkU0tkdFJDTTNzcGUxSlcxY0xVcWg4UHF1UUJIZ3dMVkFuSHExSFEyRUI1eWtNbk84UdIB0wFBVV95cUxPMVd1blgySThkZE8zU1hEVW9VdlZFck9Za3dYS1FrbnV6bWYyRmRYcWNjWXZPRnNJUHcwVDAxdENqUk5kT01UeXU3V3hLXzNvaDZrRk5Nd0I1bzI2dXp4dmRyWWxpOFE3SHl3OHprcVltVnFyZmFudGFkU3l5WGR0YV9kN0Z5cmVkZG1FNjRrTEhCV0taQmVCVkctUzVFNkM1Qy03ZkNsZzZORlRsMjFGclBFNmJhdFRzNllQYlp2blVPdWRMc3lEX19jMHR3N3dKcHlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.houstonpublicmedia.org",
      "title": "Houston Public Media"
    }
  }
]