[
  {
    "title": "Democrats, White House strike spending deal that would avert government shutdown - AP News",
    "description": "Democrats, White House strike spending deal that would avert government shutdown  AP NewsTrump strikes deal with Democrats in government shutdown funding fight  NBC NewsHow Democrats want to reform DHS – and why some Republicans are open to their demands  NPROpinion | ICE tensions are melting from Maine to Minnesota to Capitol Hill  The Washington PostSenate Democrats reach deal to avert partial government shutdown  The Guardian",
    "published date": "Fri, 30 Jan 2026 00:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQbFJXdmsxZkpZblVJRGVkN3dKLS1yalF3aXU1cU50THVEUTh6WFFDMGNiaG5lRHpOcjNlLVA0c0pWTG54aThrYk5lbGVFYmpLOEwzdHpIUThqclNKTGNubmlaeEdhUG5LV1h0R3VUQnA2a0l6NGJtM3NtaFBuQ2tZOGNxVGFlcVVpYWRuTlNnV0RvQWFXci0tdE50VnQ4UDBPaDBWVjN3WHBfVlpPQUU0X19Ib2syeVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Man allegedly tried to break Luigi Mangione out of jail by impersonating FBI agent: Sources - ABC News",
    "description": "Man allegedly tried to break Luigi Mangione out of jail by impersonating FBI agent: Sources  ABC NewsMan arrested on charges of impersonating an FBI agent in alleged attempt to free Luigi Mangione from jail  CNNMan poses as FBI agent to try to free Luigi Mangione from jail, source says  CNBCPizza Cutter and a Fork: A Bizarre Bid to Break Mangione Out of Jail  The New York TimesMan allegedly bearing fake court tries to free Mangione from jail  BBC",
    "published date": "Thu, 29 Jan 2026 19:56:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPSjF0XzExVWkzdXBIOWZtaTdzbmVFUFpDTHF1eWZ3V3BSc3FtRFhCYzdLMk9XZmVEakF1WVBuWXJ2RVNOQ1V2WHZCRjh1dnZaaEtUMVJjbEM3bVhzZEpPLW9KdzBGNHE0ZjZ4aVhxa3BqLTlodS1COEp6OU1LZnJ6N0JMQ2ZJbnpsR0RiREZkZ0pDQTQydFJ5TGxqX0cyUjhjVXBtR9IBqgFBVV95cUxQRDkxZ0tjLTBrU1BXTEFzSk1iTDZfTXRORV9aVDh6enVlZ01kS2hqVHV3cHI5eDJGMGFkSWtnMUVhbTJzUmxFTVBYc0pfZzUtajh1YUw4UTZ3WWIyZlhDa3ViY1IwYmhEeUZWamhYZjNWRy1CcDlPUm0xNHhfWnFmNVlKNmpMUWpjQkl2Wm13NnpibWRrUE1nYjFGNzBNbTcxZ1dzQTZQMjNqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "‘Bizarrely and personally lurking’: Gabbard’s appearance at FBI election raid alarms Dems - Politico",
    "description": "‘Bizarrely and personally lurking’: Gabbard’s appearance at FBI election raid alarms Dems  PoliticoExclusive | Spy Chief Tulsi Gabbard Is Hunting for 2020 Election Fraud  The Wall Street JournalElection officials push back against Trump administration after Fulton County raid and voter roll demands  NBC NewsPatel defends FBI raid as Georgia officials demand answers  AxiosTrump posts discredited conspiracy theories following seizure of 2020 ballots in Georgia  ABC News",
    "published date": "Fri, 30 Jan 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOYUVMODV1aVhubzdxd3B4Y21jRUFINjdFQkpnNjF1UHJDZWdzOFZqNEI2eC1lYkxRREFkZWo4Y1pybC00eUVWanpZVU1DMGlwU3pPNWFsYlZuSnFoSDlSRktoZ3hRNkw4MEdrYWIyQ0ZiTUdwVDczRjh1QUsyUVVrZmw3VUoyckhBN1FGOTNOVHZvcDYwSUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Former Deputy Sentenced to 20 Years in Fatal Shooting of Sonya Massey - The New York Times",
    "description": "Former Deputy Sentenced to 20 Years in Fatal Shooting of Sonya Massey  The New York TimesWhite former downstate cop gets 20-year sentence for murdering Sonya Massey  wbez.orgA former Illinois deputy is sentenced to 20 years in prison for killing Sonya Massey  ksl.comFormer Illinois deputy is sentenced to 20 years in prison for killing Sonya Massey  CNNFormer deputy gets 20-year sentence in killing of Sonya Massey  The Washington Post",
    "published date": "Thu, 29 Jan 2026 19:41:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNQXN5WnBIV1NtRDFkbE4xRGQ4czA1SG16U25GSGp3TEF0ZGRUMFlCNG1lRUhxOXRsUGktdHpyQ1U4RnBaSE5xMjJ5VDdKYnpVRGtiN25OcnkweGM4MS12QzNmOFNBYS1UdXBELWhOLXdZWFVmVkFnb2xwaDEyanhjdDA0YkNxd3lNNWYzYlRUZjc4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "San José Mayor Matt Mahan, a Newsom critic and political moderate, enters race for California governor - latimes.com",
    "description": "San José Mayor Matt Mahan, a Newsom critic and political moderate, enters race for California governor  latimes.comSan Jose Mayor Matt Mahan running for California governor, entering crowded race  ktvu.comCan Silicon Valley make a governor? Matt Mahan is betting yes  PoliticoMatt Mahan, mayor of San Jose, announces run for governor of California  The GuardianSan Jose Mayor Matt Mahan Will Run for California Governor in 2026  The New York Times",
    "published date": "Thu, 29 Jan 2026 18:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRTVEcC1rR1ZXRXRFUWNVYkdQMU9RTlk0aU14Y0ZDbktfM01Md0g1NGJ5SGFoZ3hrTUV5NVFPSU1CenVMY1NpNGEtbmsxWFNsc1VsdUJQS3EzMG9Sclc4alF3amh5RW1Zck9HdGVRemNrZTBINURET3pvMVh2bXN2V1NIem1MOGk5eEJvRENGZmhxa01aOVBCVzlkWlVoZHJUU0tWNWZ3QnlSMnhLUUhFVk1B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Handling of Pretti investigation has some prosecutors on verge of quitting - The Washington Post",
    "description": "Handling of Pretti investigation has some prosecutors on verge of quitting  The Washington PostJustice Department bracing for more resignations in Minnesota  CNNProsecutors in Minneapolis warn more could resign over handling of fatal shooting cases, sources say  CBS NewsDOJ in Uproar Over Official Response to Alex Pretti  The New RepublicJAGs are becoming federal prosecutors in Minneapolis. Experts warn it’s new territory  Defense One",
    "published date": "Thu, 29 Jan 2026 23:52:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOTk1peGxrU05LaGJhUWtFakFCS0ZmbmhiOTdfTEVqOXZiUnJCeHhiYW5XNW1LbGlXSFFqM0pnMWhmbFhBbjNNQ3dRZnBaQ0YyNkNZT1ZPUVdUckhSVHF5NkpPemRQOExPTE44WjNpb1ZXODRlYW5oUGhoaEtxeXd3RUJlcUxVSnRfOENYLVBxRG9zRDEtTFBrNXZjVVhDd3BaZWxuNm80TGZDZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "SBI: One person dead, three people injured in Mount Airy shooting - wral.com",
    "description": "SBI: One person dead, three people injured in Mount Airy shooting  wral.comThree shot, one killed, on Welcome Baptist Church Road in Mount Airy, NCSBI says  wxii12.com4 people shot, 2 killed in Mount Airy, North Carolina  CBS News1 killed, multiple injured in shooting in Mount Airy, NCSBI confirms  myfox8.comSBI investigating mass shooting in Mount Airy  witn.com",
    "published date": "Thu, 29 Jan 2026 22:56:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNWm1XSHdkUjJOS0JmWTRCS0JfSURoN3QyVXdVX0c0bkE0UVBRbHpHUGVJc3RZaGxHWXh6QUdMbWtDbEx6QTBSMURSRkdUNlNMTWtEeWZhUkhEbjcybkdWRFhCZ3FTdWduLWlxcFRPRXA5bGxTVXV1Z2tjMVdOYjU4WW1WUnl2ejZEVHpja3E4ZXZlQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wral.com",
      "title": "wral.com"
    }
  },
  {
    "title": "Keystone Kash Accidentally Sets Off Crisis With Social Media Blab - The Daily Beast",
    "description": "Keystone Kash Accidentally Sets Off Crisis With Social Media Blab  The Daily BeastEx-Olympian Ryan Wedding pleads not guilty to running drug ring  ESPNKash Patel Sets Off Diplomatic Incident With FBI Operation in Mexico  The New RepublicInstagram photo raises questions over Mexican and US versions of the downfall of drug kingpin Ryan Wedding  EL PAÍS EnglishFormer Olympic snowboarder on FBI's most-wanted list is arrested in Mexico, faces drug charges  AP News",
    "published date": "Thu, 29 Jan 2026 16:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQQXBITVRyU1BLWkxjNGdVNWF1MktFUk9EVDdzdmJRYWJ2RERuZFI2OGdfUk4wSFd3VHlBOGoyZjlKT0x0allYQUVRYzhQbHBxQjJmcEVrdWxaUTktcnZNRFhSNDFMb3ZWYU1YVks1RG03UDNnUGZZV3NRZDJLZVpYbVZIc05fVF9kM1lwOUdPTllPZnd6SFgwakMyODF6S213WklfLUt6WS1oUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Trump's border czar suggests a possible drawdown in Minnesota, but only after ‘cooperation’ - AP News",
    "description": "Trump's border czar suggests a possible drawdown in Minnesota, but only after ‘cooperation’  AP NewsAgents in Minneapolis could be pulled back if local officials cooperate, border tsar says  BBCBorder Czar Tom Homan says shift in strategy will lead to a drawdown of fed agents in Minneapolis  ABC NewsBorder czar says he plans to \"draw down\" ICE and CBP operations in Minnesota  NPRWhite House: Federal agents will draw down, but state must cooperate  startribune.com",
    "published date": "Thu, 29 Jan 2026 21:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOZ0hFb0NkdHI0TE9sdGY2ZHo5dmZ6UlJUeTV0eVpUeDdfdUdRYjhCUjlzb0Roc1k4aEhxRzFVOGNWV3RlZ1o5X3FiX0RSYldVR3p1TENZTU5xOFhwQmE0cVU0elBCb1ZUdzFCNy1jb2FVdFNZN1ItWW0tR1YwdTlQdFZEakpBSDR2ZWFVRGVWbVVWOEx4b1c0UUMxYzF3QmY4cnZv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Severe cold persists as forecasters track another potential East Coast storm - CBS News",
    "description": "Severe cold persists as forecasters track another potential East Coast storm  CBS NewsWinter Storm Forecast to Bring Deep Snow to the Carolinas and Virginia  The New York TimesBomb cyclone forecast for Massachusetts: Cape Cod could face blizzard-like conditions  bostonherald.comWeekend Nor'easter A Major Winter Storm With Heavy Snow, Wind In Carolinas, Virginia, Then Coastal New England  weather.comNor'easter seems likely for Southern Delaware this weekend, but will it snow?  wdel.com",
    "published date": "Thu, 29 Jan 2026 18:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQbkZVdUI2UWFicWRKbTg0WGNYbkJvSDhUSEdvQ3RmdEVsR2ptNGZCM0R6dDVUVUlnNXBoRjhxTWhOazV0TXZYQklyWnhYMG1MQWVFY2k1Z1Y3SDJlWkZDTEVwNTdkOFlXNDVSeHl6bmxRU0RXaTFrSllqNjRUVFNWQ2xIX3JYWHZUdzZFTEZSZWszenNiNXdnaHVvTDhrYzJyYXpYTFFTZjJ0UdIBrwFBVV95cUxQZVQ0ZzJJYl9KQkJCRHhoSThVc2lPMGIwd0F4eVNZRjFKeDBNVUZLNzZHZXU1QlE0X3hoazZMclkzZmhoSlp6em1oZmFFMkhVSjhKWUcxOENHVy00SWFEeVktUnZxbkN0a1c2TlItaHd1ME5uMldNYXZFWTR3M3VDSDdYd0h0QzN0MXB1UHRRbjhrS2psdEdQa1VjM0ZZREdnaVgxaW5ZQUF2Nm5RaktF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump looks ready to bomb Iran again. Why? - vox.com",
    "description": "Trump looks ready to bomb Iran again. Why?  vox.comTrump warns Iran 'time is running out' for nuclear deal as US military builds up in Gulf  BBCTrump Warns Iran With Military Muscle, but Risks a Regional War  The New York TimesDestroyer Delbert D. Black Now in Red Sea Following Lincoln Strike Group Shift to Middle East  USNI NewsTrump weighs Iran strikes to inspire renewed protests, sources say  Reuters",
    "published date": "Thu, 29 Jan 2026 22:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPV3JzVEtTd3NBN21DZlk3bFRnaXdfZTlHaXhKbXV0OGEyNXJ3S1J3RTJYWW9WWVJhUW1qbEFRa01YelVrQlF3dlBUZ3Fia28zSHRBTDhaMTJfcm5NcjdVNzRBSnpiazJ1czV0dUg0SkxLS1cyd2RlYkZ5XzRrUXN0UVhIVGY0OEgzYjd5eFFPTTkwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "Man Accused of Squirting Ilhan Omar With Vinegar Is Charged With Assault - The New York Times",
    "description": "Man Accused of Squirting Ilhan Omar With Vinegar Is Charged With Assault  The New York TimesOmar says Trump's 'hateful rhetoric' causes threats against her to 'skyrocket'  ABC NewsJohnson said he ‘hasn’t seen any evidence’ that Omar staged attack  The HillTrump, 79, Called Out for ‘Dementia’ After Shocking Smear  The Daily BeastJustice department charges man accused of attacking Ilhan Omar at town hall  The Guardian",
    "published date": "Thu, 29 Jan 2026 22:58:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNZTFoY2NLZlBOYnRxSnpNUFViMEo0Vm9QVGZIZVlDbjZFODdDRkhBcHRrZjM5VWhqczZEQUYydmFPRkp4TVkzZlNzQ2QybVlKMVVsU0x3R1poR1lvWkJ0N09iVHFWd29saDFXRTh0TUtITWVTVktSYXV2NGs1REdfdHN1UElmRng2ak5kWS1PSjQtZ0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘ICE Out’ strike and protests: what to know about demonstrations across the US - The Guardian",
    "description": "‘ICE Out’ strike and protests: what to know about demonstrations across the US  The GuardianNo work, no school, no shopping: Jan. 30 nationwide general strike to protest ICE gains celebrity endorsements  Business InsiderBay Area rock climbing gym to ‘stand with the people,’ close for economic blackout  kron4.com‘National Shutdown’ set for Friday: What to know  The HillAvondale coffeeshop among Chicago small businesses closing Friday for national general strike  chicago.suntimes.com",
    "published date": "Thu, 29 Jan 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOcGVlMkY1ZHU4Vm11S182VExJNkxlaVhmMDBfVWN5UDB3WUlIWndPclU5WmRVZUpLSnVRUC1XeGEyMzB5dHFZU3VMNWtTVWVncDdJYTNqbVhvN3JPdmlOMko0cTlKYXV3cU9LZ2FLR3pNQlBtaEtyTF8wQkMzZUh1aldoalN3YlAt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Treasury opens Venezuelan crude oil trading up to more companies - Politico",
    "description": "Treasury opens Venezuelan crude oil trading up to more companies  PoliticoLake Maracaibo: Venezuelans in run-down oil heartland hope Trump's plan will bring revival  BBCThe elephant in the room between Trump and oil execs: Iraq  CNNUS eases sanctions on Venezuelan oil industry  ReutersOpinion | Venezuela Can Learn From an Iraq Mistake  The Wall Street Journal",
    "published date": "Thu, 29 Jan 2026 23:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNdW5DbzhJb2FTZXpYbmNPbG1yTERjZU1GMUVIUFlSSS1fYWtQSXdzVWxfcTB5OC1GdnVtRUticVJzZnh6RmxjQkxabUJFOUVTVGZqek13Z1dyTF9wTjlGbWFzTXhpVU5mdHZNTmZVLWhIWDZSZFlWR2FmUzIwMDhCcHZ5Z2dDaFI2WWV3X2lB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Sen. Susan Collins announces end to ICE large-scale operations in Maine after talks with Noem - AP News",
    "description": "Sen. Susan Collins announces end to ICE large-scale operations in Maine after talks with Noem  AP NewsCollins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesSen. Collins says Homeland Security ended enhanced ICE operation in Maine  mainemorningstar.comICE ceases enhanced operations in Maine after Collins presses Noem  The HillICE arrests more than 200 illegal aliens during 1 week of Maine operation  ICE | U.S. Immigration and Customs Enforcement (.gov)",
    "published date": "Thu, 29 Jan 2026 23:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQZnZ3VGRIR3NuVGFvVVRDVUVmYzBjc1REaWpwNFBWUy1UYnZneDRaNDBfYkJUV1NUT1F5OFZrOUJnWi16MTI0cHdOcldXWjFzdkNoOWFqdE9Rd1hlcFJta3RZUUV5bkhkVThlYkhPN19keHVtQnR6ZDlSblpVZWJSQnd3ZHY4Y3R5VGY0VElMTEhZQ3R2YWtNc3RsVVdsZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Amy Klobuchar’s governor run sets up Senate leadership shakeup - Politico",
    "description": "Amy Klobuchar’s governor run sets up Senate leadership shakeup  PoliticoKlobuchar declares Minnesota governor run as Walz vows not to seek office again  The GuardianUS Senator Amy Klobuchar announces bid for Minnesota governor  BBCEscape from Washington? Senators look to start new chapters as governors  AP NewsButtigieg endorses Klobuchar’s Minnesota governor bid after they clashed in 2020 Dem primary  The Hill",
    "published date": "Thu, 29 Jan 2026 19:49:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNVUp2M1JYWXd5enEzd0JMRi1ray1xLXIxS0I2UG15WWs2NFVzWUY2RzJJbktCU1BjS0JOdjJDU3JlMHprM05zcTBMcWFWTk9aYlg4eFF3bXdDc2VvUGhSSE9fYk1OcEU4WDF1bnRYbmNEODRiRlIyMlBJc0VYRmZDUkk0dnVsa2I3LWJxZDU5a3hucndpMGNUbmJoMDY5TlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Unearthed videos show Alex Pretti scuffling with federal officers in Minneapolis days before his death - PBS",
    "description": "Unearthed videos show Alex Pretti scuffling with federal officers in Minneapolis days before his death  PBSHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNNVideo shows another angle of Alex Pretti's prior scuffle with federal agents, blocks away from where Renee Good died  CBS NewsBattles Are Raging Inside the Department of Homeland Security  The AtlanticShooting Aftermath Leaves Homeland Security Department in Turmoil  The New York Times",
    "published date": "Thu, 29 Jan 2026 14:17:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPaFVIUEhKc0VJWi04eElpTmVYOEZ2MDdqZ1dyZWg4UW0tTi1tNTdKSTF6Y09EZmQ2SlVuNm90LWlHVnhZVGtXN3ppZl95Q0M5c2dzSDN6djkweWhoRHN2Si1nVVpla29FVURWN3NqNlpyYWpNNUlYZXdiVlpJWlR5cnIyNWVCX01jX3VyMVMtTlBiM2lCLXZPWnVQekFhS1VXQXFoeGtjb1pjbjFtbXVSM1dFY0JteEdadEExWWstUVRoajdBaE9DUko3UzJJeHZDUEhmcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Addresses Threats to the United States by the Government of Cuba - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Addresses Threats to the United States by the Government of Cuba  The White House (.gov)‘A hurricane is coming’: Havana prepares people for war as US shuts off Cuba’s oil valve  CNNTrump threatens tariffs on goods from countries that sell oil to Cuba  The GuardianTrump administration weighs naval blockade to halt Cuban oil imports  PoliticoTrump threatens tariffs for countries that sell oil to Cuba  BBC",
    "published date": "Thu, 29 Jan 2026 23:02:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxOMVNYbGxMVTBFV1JmU1dXS3ZUa0V0RXp3djBTVWNKMHRPYmFkZ2NxLW4xR0hnNVZxa0hYSTJTWl8xR05mM05kQlh0VE5mV285U0JEUVUyVENXeE1HNDNiOWpKS2NMdmNDSGtGdm10Njl2UWVtWnAxSGRBOWtmMl9aWWZXalhCbng3b0FJdXcxM3NOZFZTc29zTS12WkpibjRwVTdxdWFvcVZ4TmxOaE9qNUhTOWJFa0R3OGxodmJJZXRVUGF3X3lTTW82ZjFhbWVqcUVKVWF0NFJlZlc5YW1WRVh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Man Charged With Hate Crimes After He Rams Car Into Chabad Headquarters - The New York Times",
    "description": "Man Charged With Hate Crimes After He Rams Car Into Chabad Headquarters  The New York TimesChabad headquarters crash: Video shows car ram into Lubavitch building in Crown Heights, Brooklyn  abc7ny.comNew details about driver who repeatedly rammed vehicle into Brooklyn Chabad headquarters  nbcnewyork.comChabad attack suspect had previously sought ‘spiritual guidance’ from rabbi  The ForwardCar rams into Chabad headquarters in New York City, damaging doors  6abc.com",
    "published date": "Fri, 30 Jan 2026 00:12:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOMEZmZHlpZk5pRENyYXBHRktNWDNkblowaDFrVUI5Um1YVDdOWms3aERIUjdMdktXdHB1ei05UWR3WFpSa19uellnZ3E2N0lidEdqS1JManNiaElLRXk4MzQ2WWtjMk5TMjJNdDVjWTZBN09ESXRoMlE5bE9oNG51WnR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Melania Trump Doc Pulled From Theaters in South Africa - Variety",
    "description": "Melania Trump Doc Pulled From Theaters in South Africa  VarietyWho Was at the ‘Melania’ Premiere?  The New York TimesMelania Trump is chic in black at movie's Kennedy Center premiere  USA TodayWe Found Two Theaters With Sold-Out ‘Melania’ Opening Day Screenings  WIREDThe Canceled Hollywood Director Spinning the Melania Movie Into His Comeback  The Wall Street Journal",
    "published date": "Thu, 29 Jan 2026 13:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOODB0V0lzeDdkeEJ5Y1QzQlFuTXVEcXdaV3pFTTZHQkxCWmwxWVJfQzFJeEd6MHk3dHhCM0hQdmxrZ2t0M2NJZ1JCdHdMb1BBY1NBUk9PdXlGSzJFVmN5S0I0Z1VGWHpUX21YNGswd2NJLURURWpOLUthSVhZcHBBS0dZVVVUS1cyczA1NWVtbXZNZDRGbmRGMUtnSUhGSmxibFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Why Democrats won't rush to force Noem impeachment vote - Axios",
    "description": "Why Democrats won't rush to force Noem impeachment vote  AxiosWNY Congressman Tim Kennedy calls for withdrawal of ICE, resignation of Kristi Noem  wivb.comNoem’s Handling of Shooting Put Her in Trump’s Penalty Box, but Just Briefly  The New York TimesSen. Jacky Rosen: It's time for my colleagues in the House to impeach Kristi Noem  MS NOWJeffries threatens quick Noem impeachment push, says Stephen Miller also ‘needs to go’  The Hill",
    "published date": "Thu, 29 Jan 2026 19:38:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPeEVoUUlSYV9wNW9KLVBRMkZOZXo3b2ttX0RPZW42WV93RXdrZzhmU3pzanZTUndMUFF3Qk1aRk4zMDc1M3hhX0l4WktDMWFra3lJQW1jOVdVLWc5THJGWHI4b0hlcFZhZGZYMm9VbFFZTTdmOWIwc3ByUVl6SE9Xam1Ib2dpTnBSX0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Husband accused in double homicide case testifies he did not plot wife's killing despite affair with au pair - CBS News",
    "description": "Husband accused in double homicide case testifies he did not plot wife's killing despite affair with au pair  CBS NewsIn 'au pair' double murder trial, Brendan Banfield testifies he confronted stranger fatally stabbing his wife  NBC NewsEx-IRS special agent accused of double murder, affair with live-in nanny  YahooBrendan Banfield Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York TimesLive updates: In salacious testimony, Banfield details the morning of the killings  nbcwashington.com",
    "published date": "Thu, 29 Jan 2026 11:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQbVpqQVJsQy12WTczaE9CVHdvNl9HSlg5WkctMU5YVGRYYXJsMHhGNTNRUXdiRkl4OGpBQ3ItcXdMbHhCN1p5TTdlXzhwSUxWeUVzVjFwSXpWQVptTlVkN25YTncwb2Vlb1FTclNWNTFhWlV5SHFYck8xUmZ6TE05SVlmQmZnOGJUSW5lNUdwTFl0QVBvSHgw0gGcAUFVX3lxTE9vV2pvVzVoblhNYkdocW95dHZrNTVSVnhKMnhqOHlwNGNSZXN5Yk9MVF90cUVhOWp3MnpFY0dTWTQzb08tZG5EdnF1OEZCMlNSQnVtdnVEM05ZS2w3eTJYclpDVDBHbTRudmZfUDY0OVh2MnpfLWRYRklHM1hWR05VaEZtUUptNWNMMnFsOU5DekhOeTVBTGRNQXJHYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Minneapolis ICE watchers face violence, teargas and arrests. They keep showing up - The Guardian",
    "description": "Minneapolis ICE watchers face violence, teargas and arrests. They keep showing up  The GuardianMinnesota Proved MAGA Wrong  The AtlanticThe week in 32 photos  CNNSome small businesses in the metro will stay open despite 2nd anti-ICE protest, economic blackout planned for Friday  kstp.comMinnesota farm communities say ICE surge \"is going to be very damaging\" for business this year  CBS News",
    "published date": "Thu, 29 Jan 2026 22:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9udEVCQXFTamRMM2Q5cWJhSjJ5dURCZkc1MmdJckNCQjhMUHlQWU5LOWZFbnpiNjQ3SWZRMFVwTE45UlpfQ1dORUFNOWhGUjhpMEJWLWxvc3BiWjQ2VXIyOUFPeFhkQ201VE9qOC0zZENob2E4NjAwdUVMR18xQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "'Respect Canadian sovereignty', Carney tells US officials after they meet Alberta separatists - BBC",
    "description": "'Respect Canadian sovereignty', Carney tells US officials after they meet Alberta separatists  BBCCanada separatists accused of ‘treason’ after secret talks with US state department  The GuardianCarney says he expects Trump to ‘respect Canadian sovereignty’ after Alberta separatists meet with US officials  CNNTrump officials met group pushing Alberta independence from Canada  Financial TimesCarney urges US not to meddle in Alberta independence movement  Politico",
    "published date": "Thu, 29 Jan 2026 21:32:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA2ZGh1ZVBzT1YyU0ZHaFhlcXFPb3JGaGcxZWVmSmItNzAyUFp1N00xcE81UUU2UG9nY0k0bXBGd2ZTbDlfeEtpNGl6d0dyUnE1bkllSXNXUmpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Eliza Morales, pregnant woman killed in Illinois, suffered 70 stab wounds; Nedas Revuckas charged: court docs - abc7.com",
    "description": "Eliza Morales, pregnant woman killed in Illinois, suffered 70 stab wounds; Nedas Revuckas charged: court docs  abc7.comEliza Morales, pregnant woman killed in Downers Grove, suffered 70 stab wounds; Nedas Revuckas charged: court docs  abc7chicago.comEliza Morales murder: Suspect in killing of pregnant woman in Chicago suburb ordered to remain in custody  fox32chicago.comJudge denies pretrial release for 19-year-old Westmont man charged with murdering pregnant woman in Downers Grove  wgntv.comJudge detains teen accused of stabbing pregnant Downers Grove mom 70 times after Facebook Marketplace dispute  chicagotribune.com",
    "published date": "Thu, 29 Jan 2026 15:55:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPZUdyOGVXdEhTR09fVHlKaGlLa3ZLSFdpejVidDFSZ1FQdlhFbHp2MXl0a19TZ1l4dVpxVmd0bnFuc2dvVmN6emJ6MUEwWG9CSVUtbGdUcDhXbzJHTC1BRU41OExYSTNhZVVGUkZwamFsX3RYOVczbmJBcGFBYjNLQlU5SGxZT1pLb0pPTWdfcENEOFU2ZHRsZ1BBNmR6Wi1aU2g3ajh2TjV4WFBsY3BNeTk4bzg2S3FjdUEzal9kUDRqSExsRzNaMC00MTdCanfSAdQBQVVfeXFMTjBycS15RlMzcEl4NTA4dXNmXzQ0cUZuLWVTSDBranJEQk9zWnpfXzdlc1BEd3k3SWpIVTdwRERIT2FvVzZtbVZrY2ZwOUpMQVZlSFU4ZnNINXZYZWhFbVBlRDh5RDhyZExHYWx0TktzQVZOekhwc0F1b0JYV2dZVGpxTnBFQlFBN09BZ3d3aU1RMXRYSWUtd2Y1STdEVEZtTjJ4Wk43X254VXZyaVJNZG55Sng4UmZBT0cwVVZXaDlRQnFjWnVSM0FWWW94TDFYa2lrTW4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "abc7.com"
    }
  },
  {
    "title": "Minnesota chief federal judge cancels contempt hearing requiring ICE director’s appearance, lambasts agency - startribune.com",
    "description": "Minnesota chief federal judge cancels contempt hearing requiring ICE director’s appearance, lambasts agency  startribune.comPatrick Schiltz, an Ethicist, Is the Minnesota Judge Blasting ICE  The New York TimesMinnesota judge counts ICE violations at nearly 100 court orders: \"ICE is not a law unto itself\"  CBS NewsJudge cancels ICE director Lyon's court hearing after immigrant's release  AxiosTrump administration releases Minnesota detainee after judge threatens to hold acting ICE director in contempt  NBC News",
    "published date": "Thu, 29 Jan 2026 17:27:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPNm1LTXA4dk1IVThiZndweWFBb0tDcmxmZHZ0TFFCWmJWWm85MHprMW5TaTNKQi1TVkN2OWc5Z1g0UVl0XzRjUU5BU1pPUjZqN2U4aGI0a0xMbW80ei10OFlpS1k3ZVYxVGZNVGJKS2NBWWt1eEJwOTFSTU94NTJkbEt5MzNvWUNsaXluUDZ2cWZ2QVJRdGd5VzVsem1fMjdSaEJPNWxUV0x6VzgtY1BzSG9VWDlVVTg4djgtVkl2aFgzdDVoTVZuamJGenJPUThwNjVkMzFSSmJxZGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "startribune.com"
    }
  },
  {
    "title": "Texas Democrats Call for Release of Liam Ramos, 5-Year-Old Detained by ICE - The New York Times",
    "description": "Texas Democrats Call for Release of Liam Ramos, 5-Year-Old Detained by ICE  The New York TimesDetained 5-year-old immigrant is depressed and lethargic, Texas congressman says in demanding boy’s release  CNN‘ICE conveyor belt’ illegally detaining, moving Minnesota children to Texas faster than courts can respond  mprnews.orgProtesters and lawmakers gather outside Texas facility where Minneapolis child is held  BBCUS congressman meets five-year-old Liam Ramos and his father at ICE detention center – as it happened  The Guardian",
    "published date": "Thu, 29 Jan 2026 18:31:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPZmhTV2dPQ0U5OGhid1dWWXNTUEljVTA2Ty1NV01STEpFdjg2U0Jsd2ktdm52amU5S1NCQ3pLYzR4Z3VQRnFOWmlRczM3S0VBeGRBWTBaWkdDTllibVUtSjZTaGwtU181RldSbGo5d2JHMjNobHBHazdfOTF3X005cWwxeHo3NEw2RzNmaVZuZXQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Stephen Miller Is the Worst White House Aide in History - Rolling Stone",
    "description": "Stephen Miller Is the Worst White House Aide in History  Rolling StoneScoop: Stephen Miller behind misleading claim that Alex Pretti wanted to \"massacre\" agents  AxiosHow Stephen Miller micromanages Trump’s immigration policies  CNNTrump officials trade blame as political pressure mounts over Minneapolis  PoliticoWhite House blasts top House Democrat as a 'buffoon' after Jeffries brands Stephen Miller a 'hateful bigot'  Fox News",
    "published date": "Thu, 29 Jan 2026 18:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNOUhnczFQOEptazFnaDBJaExBQlEtRVA0TFVzTFVKMXNNRE55NGRIdDE3NTNVbHM3YkhMSW96UjJacWlJTWl3aXg4eXBDYTBJQWhDWTE3cl8wT3VPQXFhNjZaOFo1LWRkaDE0ZDVuNHFqSjlxUndBc1B1bWVscWQwUmxicmk0QVFVQ2NkR0N1b3E0STRONkNaZDhoT3o3V3FqOU1wTFM2UjlLc21NSnp4VU1hUlc0ak0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Trump claims Putin promised to stop bombing Ukraine's cities due to extreme cold - Axios",
    "description": "Trump claims Putin promised to stop bombing Ukraine's cities due to extreme cold  AxiosTrump says Putin will not attack Ukraine cities during cold week  BBCUkraine's Zelenskiy expects implementation of agreement not to fire on Kyiv  ReutersDonald Trump says Vladimir Putin has agreed to suspend attacks on Ukraine’s capital  Financial TimesTrump Says Putin Agreed to a Weeklong Pause in Attacks Amid Extreme Cold  The New York Times",
    "published date": "Thu, 29 Jan 2026 22:27:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZmVScGZkdWdQcjIyM0wwR2N1VjJ4MXlQU2pQcERLNEZPSDVxaWZOWHNpaXVVLVFkMGdyT1o3eUtqWTNpUUlFZXlCU010NGZJQnlOQ2pWdHQycnFSSl9FSW05a1dVcnBZVjJhcG02dWQ0cXpBZ1BuejNURWhnVmgzWVhlZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Troop deployments to U.S. cities cost nearly half a billion dollars in 2025 - CBS News",
    "description": "Troop deployments to U.S. cities cost nearly half a billion dollars in 2025  CBS NewsThe 2025 tab for the National Guard deployment in D.C. is in  AxiosThe American taxpayer spent nearly half a billion dollars deploying federal troops to U.S. cities in 2025, CBO finds  FortuneTrump Has Already Spent $500 Million Deploying Troops to U.S. Cities  The InterceptTrump's National Guard deployments could cost $1.1 billion this year, CBO estimates  ABC News",
    "published date": "Thu, 29 Jan 2026 20:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPVDJEVl9nOEtocVp1ZVVfNWdzMUNUeVB1WFJUNk5zblZNaVJIR3RrMUtqN0drZmtfVjZSQkk3bDhma2Y0MEVwUXpCSzhzYjVjX3ZyV240eGIwTmNlWHVNcldNZXJYLWIwNTZDUndKVlZJSXBSQnU4SV9kOXd3NXU0d000YlFuNjROSk5QVG96WG5MVllDQ01paHprdUl3UTZaYW5PbDR2ONIBrAFBVV95cUxPVXNBT0F5VVB4YlZXNzBxSENtMEl4bXdaajdaaU1jWkdsQmgwNDJ1MlB4alU4dHh0aHg5OGg1VHFuYmdSX296UXpaUzJWUWwxTlNPWVB2UUE1U0ZmNndkMVFmZURVVHNRVXRpNFdmS0UxUUdDTkpNcXpFQkVPV2dVTFo5bzhOSUo4SFE5M1FrMkEzR2xGZ2pZWUhoYmtDSTZacUtYYk15bWx0LS10?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "New GOP anti-voting bill may be the most dangerous attack on voting rights ever - Democracy Docket",
    "description": "New GOP anti-voting bill may be the most dangerous attack on voting rights ever  Democracy DocketHouse Republicans unveil election reform bill dubbed Make Elections Great Again Act  The HillHouse Republicans propose voting changes as Trump administration eyes the midterms  AP NewsThe Sweeping Elections Changes Republicans Are Proposing  Time MagazineHouse Republicans push election overhaul with voter ID, mail-in ballot changes ahead of midterms  Fox News",
    "published date": "Thu, 29 Jan 2026 21:44:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQWWJLd2xGRDh4MnZiSEVSY2lMMU9xaXBhZ2Nta3pINl8tY1Q5ZjVydmFqOEozNkd4TkxzNkNFOGJRby1xazk0THVhWVNneVZ1UkJJVFNPaXF3azVLOTNiZjhJUy1UNC1WZktkdENOLVNzeGQ1Q0xjLUhTeGloQks1dFlrSEt1NlpHRzQ2QzhaUEZ5VHV3UHRqSlN4YzkxdEhYdjBlbHRlcGxzR3dYOXZhaEJoSWpxcU5IUFF4T3N6VURBZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "A Texas man detained by ICE was his disabled son’s sole caregiver. His son will be laid to rest without him - CNN",
    "description": "A Texas man detained by ICE was his disabled son’s sole caregiver. His son will be laid to rest without him  CNN‘Wael’s last wish’: ICE denies release of Texas man for son’s funeral  Al JazeeraDisabled man dies as caretaker father remains in ICE custody in Dallas  fox4news.comAn Arlington father was arrested by ICE. Now his son will be buried without him  dallasnews.comFamily of Arlington man detained by ICE calls for release to attend son's funeral  keranews.org",
    "published date": "Thu, 29 Jan 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9FTjVQT3gtc2ZqemN1aVRTLXQ5cDBXWmFvV3o5RDJaNUVpT1ZBUURxYmlNVWtyc0lxc1dXZl9sbFZzUFlBQmx1YzN5cVh6X3pqNTBqSW11dlFoTUtzaFdnMkN2Q1NYd0Jrem9aMGx6UjdaTV9ZZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Justice Dept. Playbook in Minnesota: Investigate Foes, Protect Allies - The New York Times",
    "description": "Justice Dept. Playbook in Minnesota: Investigate Foes, Protect Allies  The New York TimesICE’s No. 1 Ally  The AtlanticJustice Department investigating a growing number of Trump political foes  NBC NewsLetter: Gov. Walz is no martyr  inforum.comDOJ subpoenas Minnesota state, city leaders' offices  13newsnow.com",
    "published date": "Thu, 29 Jan 2026 12:51:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNQk5fTEhtcW1xZ2FhVlN4cF83NnVrMWQyWGs4SmlSaHk2eFFLQ1QyU01jZmY4SEpSY3N3YkhRZzY4YUdZMXRuV3JXRFFMWi1Cenh6d0pSMUtBWXExeDF5bEdqWi1VRnFSbkRjVUZxNEUzdGxvSDVMSmwzSGx1Zm0zSDFYR0ZRSDR6cUpQRjlGNHNySk9v?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "American Airlines becomes the first airline to reconnect Venezuela with the United States - American Airlines Newsroom",
    "description": "American Airlines becomes the first airline to reconnect Venezuela with the United States  American Airlines NewsroomAmerican Airlines to fly to Venezuela for first time since 2019, marking return of U.S. service  CNBCAmerican Airlines to restart flights to Venezuela after Trump announcement  PoliticoWATCH: Trump says he's opening up all commercial airspace over Venezuela  PBSTrump orders immediate reopening of commercial airspace over Venezuela  The Guardian",
    "published date": "Thu, 29 Jan 2026 17:15:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxOaFlFRGVNRG1CVlo2eFZSRGR4ZGtESWF6eXlBZ0pBMXVLanlNVG1qeWJhUFlnUjhTUW1SekQweHFwbWhzVzM4emxVN1o3NnViSjJENnlFaGlqR2xlOEhtZkEyS3JWa3gxVDgxNnk5a0wwUS1lb05HeTZBT0ttUTMzbzAxTURfRWR2UTFHQ3N3WXFUbndXX3RIaTFhOXFSc1RESEZ6THZoLU5CSXNjcVdUbWhRc1VnM0gwUENRM0lNbl9vYXJKNGtGWHVvd2FDNHJJMWpSTkZxeXU3VmRkcGg2V3BSNjJla0Q0bzFNTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.aa.com",
      "title": "American Airlines Newsroom"
    }
  },
  {
    "title": "Venezuelan Lawmakers Approve Sweeping Overhaul of Oil Sector - The New York Times",
    "description": "Venezuelan Lawmakers Approve Sweeping Overhaul of Oil Sector  The New York TimesVenezuelan lawmakers approve new law opening oil industry to foreign companies  CNNVenezuela’s Rodriguez signs oil reform law while the US eases sanctions  Al JazeeraSweeping oil reform in Venezuela approved, operators expected to gain autonomy  ReutersVenezuela’s acting president signs overhaul easing state control of oil industry into law  PBS",
    "published date": "Thu, 29 Jan 2026 23:35:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVFF1UEZHN2VXbzlMak84T0N2aUtqSDRxd1ozMkxDM1I4VGlRaWpQV2d3VjhyekpjM1NFVTctN01MU2NSYUNmQkVnUDFvSmo2ZnRESlZwNlhLMFZ5MXJrem5mbDB5bEQ2OS04QnFNU2R0LXhsZHJqSERZeWh3cndiQ0ZTREstWFg0N3VlMlB5Q2Z6V1N5bXRJOHVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The GOP is losing one of its best issues - Politico",
    "description": "The GOP is losing one of its best issues  PoliticoTrump is scared of the politics of ICE. And it’s showing.  CNNIn a battle over how to carry out Trump's immigration agenda, one faction has triumphed — for now  NBC NewsTrump's Minnesota de-escalation lasts less than 48 hours  AxiosOperation Trump Rehab  The New Yorker",
    "published date": "Thu, 29 Jan 2026 10:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPcnZBWlFTRC1BaGhvR0h6R0NPYVF6TDFGTjZqMWZrQkhrcXlFM19YVm1GMjVXeXFjVVZ2ck9LX1lCc1RVZjNVMElLLVZ2YzRaYk12SEs4NXdveUdHRWx0MzJBTDVnQkRMU0FMS0M2U1lqUzRnTU5kVk9nSUhFOWFIMjZRY3ptSGJhbU5IYW5nZEdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump says he’s decertifying Canada-made aircraft and threatens 50% tariffs - CNN",
    "description": "Trump says he’s decertifying Canada-made aircraft and threatens 50% tariffs  CNNTrump Says US to Decertify, Levy Tariff on Planes From Canada  BloombergTrump threatens Canada with 50% tariff on aircraft sold in US, expanding trade war  AP NewsTrump’s Tariff Threats Designed to Influence Pending USMCA Talks, Canada PM Carney Says  The Wall Street JournalUS Treasury chief Bessent warns Canada on trade fights, slams EU-India deal  South China Morning Post",
    "published date": "Thu, 29 Jan 2026 23:56:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5md3FIcHM4YVB2QUZXZTJEcXIxVTEyTEZzcGZJeTF6QllCZlJ5ajVJVmVnN2NjYU14TER1TXFLekRFTWEtVDd0cjAwTzJtRlU5dXhlemxycjdZQ2c1bFlfU1ZyemVla3dSWEFLLU5JVXZvRjNPU0Rr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Metro Atlanta under winter storm watch with heavy snow possible - wabe.org",
    "description": "Metro Atlanta under winter storm watch with heavy snow possible  wabe.orgWinter storm watch expands to metro Atlanta as Georgia preps for weekend snow  ajc.comCould Atlanta see snow this weekend? Second winter storm on the move  USA TodayGeorgia school cancellations: Hazardous conditions force some districts to remain closed on Tuesday  CBS NewsWinter Storm Watch for weekend expanded to include metro Atlanta  11alive.com",
    "published date": "Thu, 29 Jan 2026 20:34:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNNUZnOXU4b21qVkVoOWFFbm55akp3aTZubzluUWhJMmhoYTZIeVgzRTMyd1RCSjR3bWJvTGxFYS1nR3UxOEtRUGhpYkNNQkdFcnNuQmRrdDZaMjFNZlZ5OWg0ZzFOcjFLNm9GNVVFWlhERnFSZFQyZVZyR2t5VkZhWkpyYU53X0o5dVlEM2NR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wabe.org",
      "title": "wabe.org"
    }
  }
]