[
  {
    "title": "Justice Department releases millions of pages of documents in Epstein investigation - CNN",
    "description": "Justice Department releases millions of pages of documents in Epstein investigation  CNN5 early takeaways from DOJ’s big Epstein files drop  CNNNew documents reveal the breadth of Jeffrey Epstein’s orbit  PoliticoCommerce Secretary Howard Lutnick Planned Trip to Epstein’s Island  The New York Times'Thank you for . . . an incredible visit': New docs show Kamen spent time on Epstein's island  New Hampshire Public Radio",
    "published date": "Sat, 31 Jan 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5DSEtzNE9oZVJZZElUMV9KT2hLYkdDTlFyMnA5S19hYTdBSXItQ09fY0FPbWxlSlBFbHcxaVF2MDdZMXdkY000aWlBR3A4X1Rla1dudlc0X3E0dERaSno0aUJIVU5YQ3pyOG1YTGdCMmxjTlU1X0JqVHBMczFrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Former CNN anchor Don Lemon arrested in Beverly Hills. Was it an attack on the 1st Amendment? - Los Angeles Times",
    "description": "Former CNN anchor Don Lemon arrested in Beverly Hills. Was it an attack on the 1st Amendment?  Los Angeles TimesDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesJournalist Don Lemon promises to fight federal charges following his arrest after Minnesota church protest  CNNJournalist Don Lemon charged with federal civil rights crimes after covering anti-ICE church protest  AP NewsDon Lemon after release: ‘I will not stop now, I will not stop ever’  The Hill",
    "published date": "Fri, 30 Jan 2026 23:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOGpkemF4cjh1amYzcVctZXk1OFJRVVhsVmthQ1hQQkdlUDdmVWd1N3hrQTQ0TlFGMXVaME1jOWxfQlpSV0UwVW1hUmxpVFZnVEIwN09SbFhqSUMweVFSYXJvU0FQXzNtTDQ4WmN0bUFoazNoQVVsZUlHdU1kYWJNRFIwT0hwcUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Trump Administration Live Updates: Senate Passes Spending Package but Partial Shutdown Looms - The New York Times",
    "description": "Trump Administration Live Updates: Senate Passes Spending Package but Partial Shutdown Looms  The New York TimesSenate passes funding deal, but government will still partially shutdown at midnight  CNBCUS Senate approves spending package, but short government shutdown likely  Al JazeeraTrump-backed funding bill clears the Senate, putting pressure on House to quickly end shutdown  CNNSenate Passes Deal to Fund Government and Negotiate ICE Limits  The New York Times",
    "published date": "Sat, 31 Jan 2026 02:56:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1qUHV1V1h2WUU2VjR2UGVXU2RHT2NvQ2lIV3lPZlN5X082aXRYNlRmMHkyZDJDWU83Sk96SFdpQ2N0WnRaSl9UYTgxYW1kMS0tVnFSVkZlY3lSeV9DMGo0X3dhTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US DoJ opens federal civil rights investigation into killing of Alex Pretti - The Guardian",
    "description": "US DoJ opens federal civil rights investigation into killing of Alex Pretti  The GuardianLive updates: Massive crowds turn out at anti-ICE protests as DOJ opens civil rights probe into Pretti’s shooting death  CNNJustice Dept. Opens Civil Rights Inquiry Into Killing of Alex Pretti  The New York TimesDOJ launches civil rights investigation in Alex Pretti's death  FOX 9 Minneapolis-St. PaulTrump Administration Expands Investigation of Pretti Killing  The Wall Street Journal",
    "published date": "Sat, 31 Jan 2026 02:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPQlQ1bmROYXp1VDNWdE93cjdlQVlGUDNkZUxJMHN4M0pWTWppTXc0YnZ2clRPcGdkajlvcXBOcENEZWJqZ3pDRWpnazFud3lPNDB5bjJaTlJ3TlQ2cVMzYV9HNml0aEtSdUphVENQRzdEOXpRd25yeHJqWEpTc3NEbUZRRmZidTE5WnpNaHpTTjhhb2t1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Texas A&M University cancels programs in women's and gender studies - NPR",
    "description": "Texas A&M University cancels programs in women's and gender studies  NPRTexas A&M Ends Women’s Studies and Overhauls Hundreds of Classes on Race and Gender  The New York TimesTexas A&M Provost: University cancels 6 courses to comply with policies regarding race, gender topics  KBTX News 3Republican states are censoring universities  The Economist'Don't cheapen our degrees': A&M students, faculty protest for academic freedom  Houston Chronicle",
    "published date": "Fri, 30 Jan 2026 20:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZHRaRzBRVzRpeHVXY3hjQktrTGdSUDh4c1dkSU15X1JobXNKYlhYN2U4THFaNFU4Vko3aG9wN2kwUlVpeHd2Ty15eG1HbXRLT3JIeDhieUVCRDZFU2NBU0FXcVhpamdhODI1SmV5TlVZLTNoMnAtYmgxeUlHN0phNW0wdEFTOGpMck8tZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Judges across the country rebuke ICE for defying court orders - Politico",
    "description": "Judges across the country rebuke ICE for defying court orders  PoliticoIn Minnesota, America’s Federal System Is Coming Apart  The New York TimesTrump-appointed judges are letting his immigration enforcement blitz continue  CNNJudge cancels ICE director Lyon's court hearing after immigrant's release  AxiosTensions Mount Over Compliance With Judges’ Orders in Immigration Crackdown  The Wall Street Journal",
    "published date": "Fri, 30 Jan 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQNmJjMFZzbWRHLTU1bGRCQW5jUDQ0XzFhMXJyZ0NSZnR0bFh0ZnZrRnJMeFlteDBhY2RwajBsS3E4aXZuY3A4MWhSUWN0bGNEWWhtY1VVdDlRSXI0OXpfbXVxdlB6T2F5UmJkUEtodWlzUXRfaS16bzZsMFh3ekpIQzh1eWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hundreds of students walk out of class across Portland to protest ICE - Oregon Public Broadcasting - OPB",
    "description": "Hundreds of students walk out of class across Portland to protest ICE  Oregon Public Broadcasting - OPBNo work, no school, no shopping: Jan. 30 nationwide general strike to protest ICE gains celebrity endorsements  Business InsiderFort Wayne businesses closed in solidarity with ‘ICE out’ day of action  WANE 15US protesters begin nationwide strike as DOJ launches Pretti killing probe  Al JazeeraSeveral Sacramento businesses join national protest against ICE  KCRA",
    "published date": "Sat, 31 Jan 2026 01:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQMDMtRW1STkhaQjB4elRKN0xfaS1vWFBnLVJJRkc5dzR4bXlQa2IybEM4aWxYWFdVUVBGb1l5SGh0N0VaWWxRa2k3RFYtTjJnREpSU0lkNWRCRFg1WkN1LUdrcU1Cc3k4X2pKeW9DYUN6UnZJY2NVeEExamFSWk9OUGtMYlRXamJZWXNLa1pWdm9lNHhFTlV2d3dyUUYzcVFYSmdxc0FNZkI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty if convicted, judge rules - BBC",
    "description": "Luigi Mangione will not face death penalty if convicted, judge rules  BBCLuigi Mangione will not face the death penalty, federal judge rules  CNNLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersLuigi Mangione won't face death penalty in CEO murder case, federal judge rules  CNBCFederal Judge Drops Death Penalty Charge Against Luigi Mangione  The New York Times",
    "published date": "Fri, 30 Jan 2026 23:30:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9NQ0dtUW5iUjN1b2EyNU14Tzc1VklHWUkzTlpKdkFwMzJIZGhWVkpjQWkzTndBZFlxUi1hWldzMDJ4NWZmUWpydmVRX3NaRERlZjByMS1ZVlVyUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran wants to make deal rather than face military action, Trump says - BBC",
    "description": "Iran wants to make deal rather than face military action, Trump says  BBCIran Rules Out Talks With U.S. Until Trump’s Threats Stop  The New York TimesWhat Are the Chances Trump Attacks Iran?  The AtlanticTrump says Iran already has US terms as military strike clock ticks  Fox NewsTrump weighs imminent Iran strikes, but what’s the mission?  The Washington Post",
    "published date": "Fri, 30 Jan 2026 21:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5JSW90eHlkSWs0RFRNYWlvNC10RTJnT0xQaFZvMFRRVVlhczJaM1pLbEFkUjFKWDE4MmdGczlNNks5WktGd1hFVHBjdmlyYWR1X2FIeS1TV3VvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "More than a thousand Utahns protest ICE in Salt Lake City during ‘National Shutdown’ - The Salt Lake Tribune",
    "description": "More than a thousand Utahns protest ICE in Salt Lake City during ‘National Shutdown’  The Salt Lake TribuneHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNNShooting Aftermath Leaves Homeland Security Department in Turmoil  The New York TimesTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC NewsBattles Are Raging Inside the Department of Homeland Security  The Atlantic",
    "published date": "Sat, 31 Jan 2026 03:10:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVUdtejRsZ0V0cUQ2OERxSWkxellLYm9YRlN2V1NLZ243b1VTQ2RYT1dqZ3Y3VVhtMGNjdDd0NUowckxQaG9VMTdwVXBTT0dmUFlTYnN4SHowb1hSNGV1YTE3X1BLSDJZeEFJLXpXT3dieWliUzYyUVpRVnI3UXU0WklmOF95aTRfWFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "Thousands Gather in San Francisco, Businesses Close as Part of Nationwide ‘ICE Out’ Protest - KQED",
    "description": "Thousands Gather in San Francisco, Businesses Close as Part of Nationwide ‘ICE Out’ Protest  KQEDBay Area protests live updates: Thousands take to SF streets to protest ICE, Trump  ABC7 San Francisco'This isn't America anymore': Thousands rally against ICE in SF's Dolores Park  SFGATESCUSD students hold walkouts Friday to protest immigration operations, policies  KCRABay Area protesters join ‘Stop ICE Day of Action’  KRON4",
    "published date": "Fri, 30 Jan 2026 23:26:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQWVdtRVF4czhWWnVwSldOX2lWNjlUOWpBMV9zRFhlbmZtS0FtZmJ3aTlLTFUwTVVsbzIxS0RFYkFxMWZPRnZsT2txdTh0bHJJdkpCaHdUSkVpQnRuRWhLdHdTZ0ZuWkNPckFmQl9KeXNJckJXTW9mZDhmY3pSalAxdlFHZ3NHaDJyTkpCMld4OGU5Tl9FOGNKTS1iVGFLUVRrcmNZT1g1VlNPeFRuM1FFN3FPZ0pWX2tpT3c5SUFRbGQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Trump’s Lawsuit Against I.R.S. Creates ‘Enormous Conflict of Interest’ - The New York Times",
    "description": "Trump’s Lawsuit Against I.R.S. Creates ‘Enormous Conflict of Interest’  The New York TimesTrump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak  CNBCTrump sues IRS and Treasury Department for $10 billion over tax return leak  CNNTrump & Sons Sue IRS & Treasury for $10B over Tax Return Leaks  Democracy Now!Trump and sons demand $10 billion payout in new lawsuit against IRS  Democracy Docket",
    "published date": "Fri, 30 Jan 2026 22:33:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQnNnX24zNW9vZkZJZWxsNzlkSU9hUzZpVHBaVmFMV0V6NERoU3ZfaGppZDAzamxCcjNUbnV2ZWxEVWE3cTBnNG5Ia3h4LWU3dFpSbmkzaE1DN0F6MTlDU2ZvQ2MtdUdiV2tDVDJIRTNjNjJMcmRqRWlKeUZLdXFXeg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Anti-ICE protests take place nationwide following fatal shootings in Minneapolis - ABC News",
    "description": "Anti-ICE protests take place nationwide following fatal shootings in Minneapolis  ABC NewsMinnesota Live Updates: Thousands Protest ICE in Minneapolis and Nationwide  The New York TimesMinneapolis: Thousands rally against Trump immigration blitz  DW.comProtesters take to streets nationwide to decry ICE tactics in Minneapolis  The Washington PostPhotos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show  NPR",
    "published date": "Fri, 30 Jan 2026 23:08:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQb29uanhIdUdZOTdSNWF5MU5TWFpPam5ybVp2M1hnVGZ2WHhUQXh4YTRTeXNndTBXSnNQanR6M0NkMGI2WC1yX2k4dlVvUElwdDZKaE9vM0NFeU5paHUySzFKR0lRRDlyQW50WnpKMURfeWs0VUhuSFM2SHdpc1NFVFFlbWxxOWlITkNsX2JPb1VzaTdtOFpOT2ZqZnA0RWx1U2RIaFFhLVRhcmfSAbABQVVfeXFMTnRFNTFxbm1OY1ZIWmZHdWlOMjktZHI1U21Yd2lWTXYyek1ZQ3hGOV8tMUhLZzBscHlKSDN5NUg5Q1ZLZUJkSEJGeHVlUkJiSFRFWldVMmdyVVZYN0Y1dl94Wm5NVldHS21yUUdVT1pDejg4QWFnQzRDQlZNbmxFSU5heG9KTHk5NTR0UFhmSWlVcWFWSXNxVmgydWFrS2RhVU82ZjZuRTlUSXFSZjFnUXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump Admits He Is “Not at All” Deescalating ICE Raids After Democrats Fold on Government Shutdown - Truthout",
    "description": "Trump Admits He Is “Not at All” Deescalating ICE Raids After Democrats Fold on Government Shutdown  TruthoutAfter Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown  The New York TimesAgents in Minneapolis could be pulled back if local officials co-operate, border tsar says  BBCGreen Bay officials prepare for possibility of ICE activity following Alex Pretti’s death  WBAYTrump signals retreat on immigration even as he doubles down  MS NOW",
    "published date": "Fri, 30 Jan 2026 19:47:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVlhqV1Y2ZFVYUTdUWk1fdWZrUEV3c1ZXU3ZtMGhCa2p2dkIwMmxBSUJRV1FlLVJUdTJYWGtWRTV3Y2FrelJGTFRmb1J5M0tZTVhqaVEydDNxSWVCbXNhMUJIanAwRWphblA0NlFMSkRRVUZaMUF6Q1hiNzBtMzZCY2JwLUlPdWFmekJ6MVRHenF4ejRjU0pRZ0dWbUtWNVJlM2xyNU0xM0s1SEFs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://truthout.org",
      "title": "Truthout"
    }
  },
  {
    "title": "6 Missing as Search Continues for Boat Off the Coast of Massachusetts - The New York Times",
    "description": "6 Missing as Search Continues for Boat Off the Coast of Massachusetts  The New York TimesGloucester fishing boat feared lost, one body recovered  The Boston GlobeOne dead, 6 missing after vessel sinks off North Shore coast as search continues  WCVBCommercial fishing vessel was carrying 7 people when it sank off Massachusetts  Boston Herald1 dead, 6 missing after fishing vessel sinks off Cape Ann  NBC Boston",
    "published date": "Sat, 31 Jan 2026 01:39:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTEdHR0huOEhPYVN6SDNsZnBEbDdtT2E3RklzYjl5dlhPMlp5aWtsdl85VlVhR3FFczEzaW1lQ0ZYWHhtT2xGWVozb0pIVlp3alFoZnN2OUNGLXRUeUVVTmtpcXdlYk5NZVppMGc5bWU1VEpTcUNFeG51R2pBZXlIRmJQQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search - Politico",
    "description": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search  Politico‘It’s a Five-Alarm Fire’  The AtlanticCould FBI raid in Fulton set the stage for takeover of county’s elections?  AJC.comAtlanta FBI boss ousted after balking at 2020 election probe  MS NOWF.B.I. Search in Georgia Shows Trump’s Willingness to Pursue 2020 Grievances  The New York Times",
    "published date": "Fri, 30 Jan 2026 19:00:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVl9ha3lPa2E5Tk51N0RsdktObFgxRzdTdkIzVGQ4MkUzOGlCRWo5bWNna1hSUmFsWWxrOHY4eEJ0RGNBRWZyR1R3NzB5a09iSGFSVjV1ek1DeXNXbGV3em44eTRNdmw0dHE4WHFETnltVzZmLVQ1bjFWdjA1ZFRjUEI2ZjFfYmhiTlpReXVhMlh6QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Agencies prepare for partial shutdown, as lawmakers look to minimize its impact - Federal News Network",
    "description": "Agencies prepare for partial shutdown, as lawmakers look to minimize its impact  Federal News NetworkHere’s what federal programs are headed for a (possibly brief) shutdown  PoliticoLooming government shutdown threatens service members, FEMA, TSA amid ICE impasse  Fox NewsMajor airlines urge Congress to pay air traffic controllers if government shuts down  ReutersThese services are at risk if the government shuts down again  Axios",
    "published date": "Fri, 30 Jan 2026 23:41:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNRDAtc3h0NDUza1BtVmFUVFZmU1BUVEhycE5xbFNNeDdFZngxc1dsM2lLckNycm9HUFlGU1ZXNEpVc0NrYjFBVWxDQ1JLVkpna2RVeEFINjBnTlB0MFZ6SFdHMHNoRDNqZlBhOUZZWGdQUXV5QXRmbXFlUkZPYzZ4OUxzR0VNU3lGb0JMZUFtZXVvNktTOXZPLURqU1A1enZNSTlFcnJ3SmVnb0pIWm44ZS1ocUhvbzNjUVNZVEFGbUQydnM0cEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://federalnewsnetwork.com",
      "title": "Federal News Network"
    }
  },
  {
    "title": "Texas May Be Losing Its Grip as America’s Fastest-Growing State - The New York Times",
    "description": "Texas May Be Losing Its Grip as America’s Fastest-Growing State  The New York TimesCensus: Texas led U.S. in population growth in 2025, but immigration slowed  The Texas Tribune2024 State-to-State Migration Flows Statistics Now Available  Census.govThe states people have moved to – and left – the most: Census data  The HillHere's where people in your state are moving to (and from)  LiveNOW from FOX",
    "published date": "Fri, 30 Jan 2026 22:08:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQTQ2OUJuYTBleXFiamhvXy02Mmp0cG5oRU43MTloNkxXU0xrWFhiZEFjRzVWT21WeDBSZlZLRU5UalVPb1RTOG1ULU1RZGY4TVlzXzNMLVZPTWdxS0xrSnJUUnRsWE9pTFhWNTVIMW1qcXJ6c3RUMTZsOGt4NDM1Wk94Y005Y0xoMUlJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Demonstrations against ICE continue in Denver - Colorado Public Radio",
    "description": "Demonstrations against ICE continue in Denver  Colorado Public Radio2 Colorado school districts to close Friday due to staff absences  kdvr.comTucson businesses closed for national anti-ICE general strike  KOLDStudents walk out of Mapleton schools for ICE protests after Denver-area district tells them they can’t leave  The Denver PostLive updates: January 30 shutdown in Tucson  AZPM News",
    "published date": "Sat, 31 Jan 2026 00:56:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE84N3ZFWFRCWnJEMGVKQm5oT2tTRFk3cDJNY3pSQ3laekZfemQzOHhIcTh5SDNvWHhPR1FCQTJjTEhEVjFod0hFNWw0NWFyRVJVSVBpMVV6TURkQTg0WXNHajdqQTFyRG8z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cpr.org",
      "title": "Colorado Public Radio"
    }
  },
  {
    "title": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long. - The New York Times",
    "description": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.  The New York TimesAhead of midterms, Democrats mobilize around immigration, anti-ICE sentiment  CBS NewsTrump is scared of the politics of ICE. And it’s showing.  CNNThe government’s winter of discontent  Federal News NetworkOperation Trump Rehab  The New Yorker",
    "published date": "Sat, 31 Jan 2026 02:45:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOTDRWYzdnQUZZZ1owUEwtN3RYNi1ZOGZUd3BNVUJmSGxURm9NaXIxb3l3SWkwaWtGWGpIS3pockNxVzFFR1h2OEVYQVpFblVXU1E2d3VFNENMS3hPT3U3MFlWRkJaNU1qZzBDWDlIbG5SZFp3SnpvQmpYSWpGbEpwTEhCZ1JwZVZ4cEhZelFrSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE detains two more students from Liam Ramos’s school, officials say - The Guardian",
    "description": "ICE detains two more students from Liam Ramos’s school, officials say  The GuardianProtesters gather outside Texas facility where detained child Liam Ramos is held  BBC‘Mommy, open the door’: Mother recounts her terror as her 5-year-old was taken by ICE  NBC NewsMinnesota toddler taken into ICE custody with father and flown to Texas is returned to mother next day, lawyer says  CNN‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding  MPR News",
    "published date": "Fri, 30 Jan 2026 22:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQNU00dFNpU2s3dGtzczFSYW1IUmdRRzBuRWoxdThWQXpsamE5dFg3aHlIUHBMUWtnbXFMYUY0Ym5rV2tlajlDR2FReV83OFFhNlNVUWxzUF8wNTJWbFRsSmxLS0d1aU1Jc19UZGlGbE5QLWJWTE5jSTdoNVdzcTFKUmxlbFQ1eUMyUzJTVkN2TFp4UkxVcV9V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Gov. Kemp issues state of emergency for winter weather this weekend - WSB-TV",
    "description": "Gov. Kemp issues state of emergency for winter weather this weekend  WSB-TVGeorgia under state of emergency as winter storm nears metro Atlanta  WABEWeather Impact Alert | Snow arrives overnight as metro Atlanta drops below freezing for 60+ hours this weekend  11Alive.comKemp issues state of emergency as Georgia preps for snow, bitter cold  AJC.comState of emergency issued, Cobb under winter storm warning ahead of snow  Marietta Daily Journal",
    "published date": "Fri, 30 Jan 2026 16:32:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxONDNjVWo3dERkNGlva0xlRk9kNHJhLXhTUzUxcjE1UkZHUzBENEVWdXVFOWJtZWRQaGhJSDRZb0JWVnVmb2ticC1fRHFreGtEUmtoNWhlU2NLc3VyZVlkQ0lJd3U1amhNTERMb2Q1My05VEJ6WXFLdHJCcFFRdV96TmZWdnBONmdRUDhCdlpvOUd5dldNb0Q0d1dXOHl3Mm9ZOXZTMmpLN2Y0RlR6ZU1mZk5YMUd6ckJob2xuLdIB0AFBVV95cUxOczRYMG9PTTNQVTlxLXZ1SGtKTV80WG9yZ0NnT25hOGFnMktvSUVvWEp4dFQyYUtwRTFvM2RVeEIybmN5emM4WEFDczI1cTdaS0VqX1JIUUMtRFhTNV9hZDh4T3ZnZjVLc2liWnZ5U1FrMFRLeFlVQS12Nk5MNjRCQkM1T1VDMHRrTTFVbDFTeXhuT1ptbmtyVkxJMDM1VS1xVFpMS09MR1J1YXRFSDREMVJlUkdVZF9YWWlFZG1ZWmNSaXhyaUEtSTFNb2pveklH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsbtv.com",
      "title": "WSB-TV"
    }
  },
  {
    "title": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues - The New York Times",
    "description": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues  The New York TimesICE in NYC: Hochul moves to end local cooperation with federal agents agents in New York  ABC7 New YorkDemocratic governors scramble to build a legal wall against Trump’s deportation agenda  PoliticoNew York governor proposes bill to ban local law enforcement from being deputized by ICE  ReutersHochul seeks to end local NY law enforcement agreements with ICE, citing ‘tyranny’  Gothamist",
    "published date": "Fri, 30 Jan 2026 22:52:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9HVW9OVEhpSTZ1RElEZzBRb1ZfUWNXWldMaTBpQUNPakNkRFlYZEJnWVlSVGRqamRsd2xLNnlmY0hFN002MkZDa3l5TjFlUExmcGdkUVJTd2lnc1JTa0N1eEtJOVVrNFY2NG1ZRzk5TTk0dE1CVW1Nd2pVT2tQMUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "House GOP leaders eye bipartisan path for spending package - Politico",
    "description": "House GOP leaders eye bipartisan path for spending package  PoliticoMike Johnson braces for conservative revolt over ICE funding deal  AxiosJohnson backs fast-track process requiring Democratic support to swiftly end shutdown  The HillSenate deal gives Johnson a new headache  Punchbowl News'Opening Pandora's Box': Mike Johnson backs Trump after warning White House about deal with Democrats  Fox News",
    "published date": "Fri, 30 Jan 2026 22:30:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNb3ZTN19fdko2eTVzNXV2VGcxQVdEY0EwV2trb3c0SlRiLVpJVjdONVhPYWZkOFFNRkNJOWhEbU84WnhrR1NMaEk0ME9ZSE1jR2RiWVZxdXAyeWtmYjEtbkVBUHppdU5DbFNSNVZOZ0JIWGRlTUxUSDJLeGpfRTR6cXVXcXRBYWFIWmswQzBKMlAweTdGRnlhbmZnTXpteHJiTDVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say - Business Insider",
    "description": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say  Business InsiderTrump Threatens Canadian-Built Aircraft with 50% Tariffs and Decertification  The New York TimesCanada says jet dispute can be resolved after Bombardier shares fall on Trump threat  ReutersTrump says U.S. will decertify Canadian-made planes, threatens 50% tariff  The Washington PostTrump threatens new 100% tariffs on Canada over possible trade deal with China  CNN",
    "published date": "Fri, 30 Jan 2026 20:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNZlRjOTltUDUxMzY2SHhGRGVYZERlWk5JSndCR1g0Wm1DeUNLWmF2aDB3WGdPZTVpakhMQ2p2S1NhNDRrWkN1RkNWa0NBZWpDdlpKOHFhWms5OVR0eUo3eFBlSzIyXzFuekZ6anpWYlA1UWJUSGpYX0UzZ3U3ZFRXV00yQkgxVXZPdWx3SmVUcE9kbWtQa1A0UFdVWmpUX2dRMnlmZ2NWSDdTWWJiMWRr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood - NJ.com",
    "description": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood  NJ.comWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelMost snow in years, blizzard conditions possible in parts of Southeast from powerful bomb cyclone  CNNNor'easter forecast for Massachusetts: Cape and Islands to see heavy snow, face strong wind gusts  Boston HeraldBitter cold holds on before strong storm brushes parts of Massachusetts on Sunday  WCVB",
    "published date": "Fri, 30 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxORU1JSDYxVTJEOGsxWWE0VWhIWFkzM183TWtnY2tXR1cxaDE2Q3BCazh3TFR5SGp1LWx5OG0wbjhWRGZWOXo0aVRQVnpOUGdjc2lnYjhMT0w1YWR1ckE4enJFcjEza1VrMHJITENtTHVtMm1renNjSjlOU19zSjJfdnpjTmdXeGY5aU9xSTNkZnVKeVhaMTVucGZWUkFBNTI4Wnc2c3NmRmNKMXZXNHhwTFNUem5odFBzSUtRSERuMnFQZVEwdERXT2xVWlRZeHUxcWFsXzRUdk5RVlI5THpPS9IB9AFBVV95cUxPUU9MNXpub2FPWHVHNWZCbzd2MGVFR19kWkRvak9QQk0zSE1ybmFCOGx3UTJ5RlhuQXFxMjI5cjlhRVVYQzI1bUhhWGJjekl5bkZ1ZFdzUWNMVzhUMjRUYy1FUGpiamVuQkduMGhTZHQtOHFsZHVtNzNNanZhYjN4aG84djhLMXp5VEU0bEVIZFJhZmxYQXpwRnNROHExdFdzdzNiWExuZ2Vvdi1LYnFEM1RqdlRrTDVQSTBqRlJDeDMzSFhQN1MySjkxVXQ5Mmg3dUxBSU1FRUVJY0lYYzFTeHl1OXlvdzgzTXE0ZHNkbW82cjFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "UN risks 'imminent financial collapse', secretary general warns - BBC",
    "description": "UN risks 'imminent financial collapse', secretary general warns  BBCGuterres warns UN faces ‘imminent financial collapse’  Al JazeeraU.N. Says It’s in Danger of Financial Collapse Because of Unpaid Dues  The New York TimesU.N. secretary general says global body is at risk of fiscal collapse  The Washington PostUN Says It Could Have Zero Cash by July as US Withholds Dues  Bloomberg",
    "published date": "Fri, 30 Jan 2026 16:24:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9rTkF2cnhfeTJ2R2lsN1FDckpfREVnRElSRG1YQWFENkRPQWNnNWx0RkZpaHNsNW1wMjRkYVpEQzFURmV3VmxWRnU4cUt2S1Q4VlMyUFBIX3ZuUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House - The New York Times",
    "description": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House  The New York TimesJudge requests to see Philly slavery exhibit panels ‘by Monday’ in court hearing  WHYYJudge chastises Trump administration attorney in hearing over dismantled President’s House exhibits  Inquirer.comJudge calls Justice Department's statements on slavery exhibit display 'dangerous' and 'horrifying'  AP NewsTrump administration scrubs info on NH woman who escaped slavery  New Hampshire Public Radio",
    "published date": "Fri, 30 Jan 2026 23:34:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUWN6RUJmbUF6ZHBuRUlIMU9jQmlGZ25DTE00UUZIWU9FcG14VDQtYm85VC1IX3Y1RnhIWWdpcVBKUFYxYThZUTZtLWtiUUJ1b2lrUXhMV1A2ZS1wVWRycngyX0czdEd4Q0VsVGY3VjZFZUZjTlRUMWstZTZqS19tZURYSEJGb1RFNHdWZEdQRTJTdTJfUUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Department of Homeland Security intensifies surveillance in immigration raids, sweeping in citizens - PBS",
    "description": "Department of Homeland Security intensifies surveillance in immigration raids, sweeping in citizens  PBSThe Tech Arsenal That ICE Has Deployed in Minneapolis  The New York TimesICE’s surveillance app is a techno-authoritarian nightmare | Moustafa Bayoumi  The GuardianThe powerful tools in ICE’s arsenal to track suspects — and protesters  The Washington PostICE has expanded its mass surveillance efforts. Online activists are fighting back.  Politico",
    "published date": "Fri, 30 Jan 2026 18:05:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQMUpKZXctZFMzVzBYcVZmQ0RwWG9WRGFTSEppYVVYcm4tWVB6eDJSLTJCcUl3OTdad1Vzb29pZF9JWjVnWFFMSHM4M0JHbUtCUEVPcFhCQVo3T3hEMWpmYmpfZ3ZaV2xENjN3VWFGRjYwekR6alBCbHFwVHF2LUdEeGFNcnJyNzIyc2F4ZmZ3dGUyT1hFYldiYW5PamNwNGFkanlPTGVycnVNLU9HS0o2V0FZQ0lBdzJDTTBWaUFLM2Q2NExNQXF1WDA1dUNBMFFOcmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart) - Syracuse.com",
    "description": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart)  Syracuse.comNew Yorkers grade the city’s snow clean up  YahooArctic chill in no hurry to leave  WSYRMorning Briefing in Buffalo: Jan. 29  Spectrum NewsIt’s cold, snowy and snowblowers are hot  Watertown Daily Times",
    "published date": "Fri, 30 Jan 2026 16:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQenZTWUZFS25jUDd6VXphNjRvYnczWl9aN3o1WEZBR2ZmRXNTNmZRR282blpCQUJHX2hLMFVCNzE5NXZVQmZ4X2tFMzB5UGN4c29ESTFETWFCdVVVVC16UTlWdkpBd05fZXlwN1J1Q0ZMdHVFYXM4UzUtQ1hqYUNyZE1xNWdIZF9ybFl5M200NTBFZHJGRUpYMzZsUGZHUVRVaWl4X3JKS1hyX19PWFAtaEZzZG1sbXh6WVVKTFU5NWhFWDlkdkpxR3NaUHB1RHJhc3ZyZWNaRVdlLXRuRms0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "Sen. Lindsey Graham held up shutdown deal over provision letting him and others sue DOJ - NBC News",
    "description": "Sen. Lindsey Graham held up shutdown deal over provision letting him and others sue DOJ  NBC NewsSenate votes to fund government ahead of Friday deadline but will negotiate restrictions on ICE  ABC NewsGraham threatens shutdown deal over House-backed repeal, warns Johnson: 'I won't forget this'  Fox NewsSenate set to pass government funding bill Friday after Graham pledges to lift hold  The HillLindsey Graham signals path to defuse funding threat  Politico",
    "published date": "Fri, 30 Jan 2026 21:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPMGNEY05mUUVLUkVlQ3RBclYxdU84MzZ0cmFHNW5KbmxSNHBBXzMyeG10bW9iX2t6dWExNjJpcE5mYzd6bWJyT3FhTjZVb3duR0Y1dS0zdGRBanFKYnVUQ2huMjNMblhQOGd6Si1rWGVZWDFQLWtTb05DT0xsS2lJcDdFdV9ibkxVdkotSlhWWDBYSFJtMC1qdmJBRGR5SnBlZU5SWlBSSHpZdlFESmlXWWotYjFzQjZMVWJERzNyYjk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\" - CBS News",
    "description": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\"  CBS NewsJury deliberates in Fairfax double murder trial connected to au pair affair  WTOPAccused double murderer Brendan Banfield testifies, proclaims innocence  The Washington PostClosing arguments Friday in Brendan Banfield trial after he testifies he saw his wife stabbed before shooting attacker  CNNHusband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York Times",
    "published date": "Fri, 30 Jan 2026 11:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxObUNKaXZycWkzLWhrVTV2RklOanI1bEhrVmdLZFlyOUkteG1BelRQLUpsb2NCR0hhWkJNSzd6YnlwbjJ2cV9wRkJGQ3h4cDZGMUNYckJUeGFKcGlJalRlWlR6Q3RlUlRQSHdENUxqVUg3QUx3VWN5U3BHWXZlWkVXZ195QVZueWc4VWxUeFpKNE9xSzZHOExUUjZkcm1OQy1tRFhkWV9B0gGrAUFVX3lxTE1pY0R3WHpVcnJGMWxTblRPR00wSjB6QTlvV0VZeVJwbUw4VkxtOFdxZG9hY2NVblFfNEJCVUxxaWhEdjNQa1RjSWtCd1NBVkU0QlBMNWlWQ01DWThTc0ZuRnZEU0RmX2ZpUFVjQ2xESWxtNDd2a0pCdjFRVUFBM1dROFl6c0dBTkhjX0NsTHlza3QwT0NnZXFCdWFBRVFwYThzaHVOaDViWFU0SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S. - Axios",
    "description": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S.  AxiosIran says ready for ‘fair’ talks with US but not ‘under shadow of threats’  Al JazeeraIran seeks to avert US military action with talks in Ankara  The GuardianIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNN",
    "published date": "Fri, 30 Jan 2026 13:03:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbGJJSUlaNm5BV1VOMmVYTHVNa3V3Y2ZnV1VyMXRkeFFNV01JSmNYTFJvMmxMRGJ0LVdHRTNSdHVwOGpVS3RaRC1UcDJSTnBkRS16b2ozUFNPdEVIdEdLX1N6OTJWSTgzcFhIdGxYQnk3YndwY3NaWGhzb2FqLVhfeHFYOXdhcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "China to take 'necessary action' after Panama port ruling - DW.com",
    "description": "China to take 'necessary action' after Panama port ruling  DW.comPanama High Court Gives Trump a Win Over Canal by Ousting Hong Kong Port Operator  The Wall Street JournalChina Is Losing More Than Just Two Ports in Panama  BloombergPanamanian Court Strikes Down Hong Kong Firm’s Canal Contract  The New York TimesPanama supreme court cancels Hong Kong company’s canal contracts  The Guardian",
    "published date": "Fri, 30 Jan 2026 10:09:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNLUtIS1ZsYThCM2N0My1NYVg2WjVaQk1Kamd4ZWFOWS1YeTRaMC1BX2lFclk1STBZV0x1SDFabVBhbVpQT0lzNTNQVFFfODliZGp0RjExZHBsVEFjWEZnRUNCTmFCdC02dG1wWTFsT0tVbXFtTjB3VmM2T0FNM2c0c01icjlPOG9mMm9rYVljOWFDd9IBkgFBVV95cUxNbmo0V3Zud1ZhWHRwcUdILWRDVndITHlFTDVDNGtnek1jbTlFamlRQUY1RkNvemtObUNuUzR0R0FFYnpYM2w4dG5sN0hPRFlpMVZiN1J1VDJJMkRXWnBaTW9NRU1rVC12Mk1TbzlCR3AyWXc0VFdLYW51MHhQM083MzN5T1VwSlo3dWNBLUtPQXRoZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Noem says her response to Pretti shooting may have been wrong - Politico",
    "description": "Noem says her response to Pretti shooting may have been wrong  PoliticoHouse Republicans fume at Kristi Noem as impeachment push looms  AxiosTrump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting  The New York TimesLongtime KC congressman signs bill to impeach Kristi Noem over ‘misused power’  Kansas City StarJeffries threatens quick Noem impeachment push, says Stephen Miller also ‘needs to go’  The Hill",
    "published date": "Fri, 30 Jan 2026 03:59:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5iUlcyQnl2SW02MkZKN3Z1clhOSGFGQkdydlgwNjc0QkFFM2ZJVFlJVmhwb1lQRWtRa2x3OWtWMjhnT0JaLV9ZazZrYmlOVUgxNkJkYTVMZ2NweTZyQTMzYTJnRTJxaW9uY3I1YVJOc2o0dU5OZERtSU5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]