[
  {
    "title": "DOJ concludes Epstein files review with release of 3.5 million records - Axios",
    "description": "DOJ concludes Epstein files review with release of 3.5 million records  AxiosWhat 3 million new documents tell us about Trump’s ties to Jeffrey Epstein  CNNLatest Epstein revelations dig even deeper hole for Andrew  BBCEpstein files: Trump, Howard Lutnick, Steve Tisch among prominent names that appear in latest Justice Department release  CNBCBill Gates denies allegations after Epstein email about 'trysts' and an STD is released  Business Insider",
    "published date": "Sat, 31 Jan 2026 14:09:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQcGdGMUV5NU42ZFFVR2N2WVEteVJYbENHMUJ3b3cxWE8wTURfNk1XTEtucjFUblp6dDdzdWFBRWp0ald2Um5Bejg1b1dHTG5qVE1kUDdMYmlnTl9URDUxcDRUNDJIWnA5aWNCYTVQVWI2WXZERThFeXIwR0ZqbXM4WmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "2nd Amendment advocates issue dire warning over Trump’s Pretti gun remarks - Politico",
    "description": "2nd Amendment advocates issue dire warning over Trump’s Pretti gun remarks  PoliticoAgents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story.  CBS NewsHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing  The InterceptTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC NewsFormer officials say DHS tactics undermine public trust after series of contradictory statements  ABC News",
    "published date": "Sat, 31 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPbTExR1hNVXdpV1g5OTZvQ291Z2h2WjRpRkN5a3d2cVp1c3lIcmM0bWR3VWtFaG1wUW4zYU03VXUtYUZHUUQwbG9qbUtfNzhuVGNBQjBSSEpsTzFFc2RGSGlNbnV2UVEwNDlWU1VVcVc2UnBpM05OaEd2X0FfSmVIZFcyTkNsVEtLY0UwcTdNWHV3dXlaLWFtMWFnVkJiQUJTZi1RNXB1aTB5VEQtazZfU1NDRWw5dHFqcElmcEpiMUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Partial government shutdown begins as funding lapses despite Senate deal - CBS News",
    "description": "Partial government shutdown begins as funding lapses despite Senate deal  CBS NewsUS government partially shuts down despite last minute funding deal  BBCAfter air travel chaos, FAA shuts down — again  PoliticoPartial Government Shutdown Begins as Senate Sends Spending Deal to House  The Wall Street JournalUS government shuts down partially over homeland security funding  The Guardian",
    "published date": "Sat, 31 Jan 2026 14:59:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNN0drZUh1TUtpMV9LZjJPYVZ6SUpoTzBEbG1sdE5ZcmlJcmZicFl1R0pVcERjMS1vZDY4bHhFNENxa1ZjTS1aeGp3cEw4dVdNT2VPQTN5RXlJZWRrZ25FOThYdEdnYXR0Y1duaEVUTkpaN0dLcW44WHEybnZCbV9MczRSTC1zM0YwSFhIZm52b9IBlAFBVV95cUxOdzhtQzhpMWVONjBLTVdtTThSYk5HWFVLczc5SXY1QzVIMW4wYVhOcVMxcGNaRzVQZGNVQ1VHNUQxZFdFbTVIalFNU1J3WDJlLTZFMy1PRGF5bmZsclhtMnVYUVlBUUVXdTR3UW5HcjY0dFN3RWx0Sll6cEpBZU1iM21GZUNJTC1Jb0h6Wks0WHdielZH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Federal agents arrest journalists Don Lemon and Georgia Fort for filming protest at St. Paul church - Minnesota Reformer",
    "description": "Federal agents arrest journalists Don Lemon and Georgia Fort for filming protest at St. Paul church  Minnesota ReformerDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesFormer CNN anchor Don Lemon appears in court after being arrested over protest at Minnesota church service  CBS NewsDon Lemon vows to fight charges in First Amendment showdown with Trump  PoliticoWhat to know about charges against Don Lemon tied to Minnesota church protest  The Hill",
    "published date": "Fri, 30 Jan 2026 22:16:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQczgxQ1pIcHRLdHZ6LUowcklNby1ra1E3WUF2TVFmTzB5eFg5MHppb3pzTFJfVnNIVHg2cmRENGZUdlVNTHlveUx0aVpRUGg0cXZWeVRoWlNyQ0FkZm9vZGt4YnBSTHZ1ZmotVjhFd1dxb0xCVmhOczFHQnUwVlViLVR0TG5NcVpRWDBrRWZ5T2RzMDRxU3hKZU82SUxlaHNzVThrdDZCMlRZQTJCOTJmb0R3UHNkdDJUbEJnY1hla1R4YjRN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://minnesotareformer.com",
      "title": "Minnesota Reformer"
    }
  },
  {
    "title": "More than 300 anti-ICE protests planned across US this weekend - The Guardian",
    "description": "More than 300 anti-ICE protests planned across US this weekend  The GuardianWhat to Know About Anti-ICE Protests This Weekend  The New York TimesThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The GuardianAustin businesses lock doors, shoppers swear off big box stores, in national ICE protest  KXAN AustinUS protesters hold nationwide strike against Trump’s immigration policies  Al Jazeera",
    "published date": "Sat, 31 Jan 2026 11:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBqQzNzY0ZRRFJES1VsS3BlcDhGREZMT3RMQThmSUktNGVBbVgzRTZHS3NiUkpUVHdaZmI5NFZtNy1lWnZrMlY3TDY3bk1pZEdpeVlyalNuaXpIX1NQN3BySkpmUU9OTHlYZmpkeUVncnEwcXJzclhXdFZ3OFN5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "This Minneapolis family has been in hiding for weeks, fearful of being deported - NBC News",
    "description": "This Minneapolis family has been in hiding for weeks, fearful of being deported  NBC NewsNonprofit puts together care kits for Minnesota families facing uncertainty  CBS NewsMothers of massive resistance: PTA members organize Minneapolis relief efforts  MinnPost'It's terrifying': Dominicans in Minneapolis on the front lines of ICE surge  Global Sisters ReportAmid ICE Raids, MN Immigrant Parents Plan for Children’s Care  The Imprint",
    "published date": "Sat, 31 Jan 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQLWh0Nlc0UTFjcElpbjJudDd1YzVyWDFUUTk1dWVvWTE5QU5LcGpHMXVmQmdhalpmSFIzemRUd01mY3JqQWQ2ZWh5RmRpRkw5V3B1SmwwZk01T25JZ2pidEU5ZzV6UnpIYWNCMHdvSFFfQ3p0czhYSXJNRGo0NGJKNGNUalFUbGplUm5BUHlqaS1CQUoxSUxhMkpVeC1tdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "LIVE UPDATES: Snow falling across north Georgia, starting to accumulate - WSB-TV",
    "description": "LIVE UPDATES: Snow falling across north Georgia, starting to accumulate  WSB-TVLIVE UPDATES: Snow begins in metro Atlanta; North Georgia feeling effects  FOX 5 AtlantaGeorgia winter storm updates: Snow beginning to accumulate in north Georgia  CBS NewsWeather Impact Alert | Snow arrives overnight as metro Atlanta drops below freezing for 60+ hours this weekend  11Alive.comState of emergency issued, Cobb under winter storm warning ahead of snow  Marietta Daily Journal",
    "published date": "Sat, 31 Jan 2026 13:05:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxORlZfdXVGT1ZBRTZJRmdvRWM1MnBlTDZlQlBaUUdkWGtPel9zeW0xaklDOFpVZEQ5QWxYNFIzNmpUdGR0YmJFb2p3TVdyYVM0TTlWdmxCdHdUQ1lHb29ZLVF3QnBrNjNQU1E2NHVGalE3S3BHdXJsQWVQa0d4cVByZEN0cU12Z2hySDhrNENOONIBowFBVV95cUxOZ3NiRlpmVnotTkNmYWNJeTlmRksxUW90Wk1GbUNKYmRwV2U2RV9LZkw1UXZaYU9mRGJoenZMek5vSktiRmQyRmhTeFY3d05EWTBlZHBaYkJFVWtaUUUxdFBwUnhjcHZTQUJ6UExJUlRMSkpIWlRrVTZtcEJFRFZ3eG16YWRQOHBJampOVF85bmRGbEl1ZUdxTjRMSllxN0hPTjVF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsbtv.com",
      "title": "WSB-TV"
    }
  },
  {
    "title": "Houston runoff sets up next Democratic generational fight - Politico",
    "description": "Houston runoff sets up next Democratic generational fight  PoliticoA US House special election in Texas is set to narrow the GOP majority even further  CNNHouse GOP majority on the brink as all-Democrat Texas special congressional election underway  Fox NewsDemocrats Menefee and Edwards compete for a House seat that will narrow GOP's slim majority  ABC NewsWhat to expect in Texas' 18th Congressional District special runoff election  PBS",
    "published date": "Sat, 31 Jan 2026 12:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5kLW1pbzgzSC1WSERoRUZka1IyRTN4V2VLRXN6U3N1andUUmJkMDBWdGlUZGUwSXhtalV2Ul92djR2ckE5NTl4SGJfYnMwMjJfT2lWUU10bUxpMXhwbnJKOG9qODlOTmN4cHExYThYVWIwSk41REpObUVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Justice Department opens civil rights investigation into Alex Pretti shooting - Star Tribune",
    "description": "Justice Department opens civil rights investigation into Alex Pretti shooting  Star TribuneJustice Dept. Opens Civil Rights Inquiry Into Killing of Alex Pretti  The New York TimesUS DoJ opens federal civil rights investigation into killing of Alex Pretti  The GuardianAlex Pretti shooting by federal agents in Minneapolis prompts DOJ civil rights probe  NPRDOJ launches civil rights investigation in Alex Pretti's death  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 30 Jan 2026 19:50:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxONDRJRXEwb2l1VTZKZTE5SkxRMjJ1Si1LU2dyMmhpU2JtUVp5NzdCblhvVE1wSkhhOWdEa0JnalAwa25YX3UxX0ViS1hfOVhMRzRhYVdjUW9uMVRNOFBXMGhIbEhtRnFhLU85YzJvd1Azc2d6MFVCN0tqSVJnQXBHMHZLeWFPX3V1cDhRX1VQZTJPQkJ0OXU3ZjNBaHlvTXhQWEVOYlczU0NXTWVyaVhpWmUzWWY3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "What We Saw in Minneapolis - ProPublica",
    "description": "What We Saw in Minneapolis  ProPublicaAnti-ICE protests touch every corner of the US as Minnesota officials stand off with the Trump administration  CNNPhotos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show  NPRList of ICE raids, major updates in Minnesota on Saturday, Jan. 31  Bring Me The NewsICE Out march in Minneapolis, Bruce Springsteen is surprise guest at Defend Minnesota concert  FOX 9 Minneapolis-St. Paul",
    "published date": "Sat, 31 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1xMXd4dTE5aVIyaFp0dC1vV2t0cmswdmV1cl9xSEJDN01LRVpfMWVsUE9oU2paUmg2OG1HMkhwbEVleDktTGtySDMyV1RoaHM1X1A2dWxiU0Z5ZFQwZUpqNXlSS1FNdjZhaDBiQWlMU2MtLURxWG40RTdPeUlJanc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Hundreds of Texas public school students walk out to protest ICE killings - The Texas Tribune",
    "description": "Hundreds of Texas public school students walk out to protest ICE killings  The Texas TribuneBay Area protests live updates: Thousands take to SF streets to protest ICE, Trump  ABC7 San FranciscoSCUSD students hold walkouts Friday to protest immigration operations, policies  KCRAWatch the walkout: Palo Alto students say ‘Melt the ICE’  The Paly VoiceSan Francisco joins nationwide anti-ICE walkouts with Dolores Park rally  Mission Local",
    "published date": "Sat, 31 Jan 2026 03:24:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQkR4Sk4yWDBvYV9SaDJKRGVwM0JEQ3hJR1l2TTBJV2d1RFFqUDR4bkNHVGVpSG5wdjZNaV9BalNUT1pRRUJwWF9uY1o3dURSVlFCMEcwUDJ3bk91T05WSV80ZWU4RmV0dzlza2pmYnNnRU5nM1JCbEVIUG1xdlJrMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Texas A&M University cancels programs in women's and gender studies - NPR",
    "description": "Texas A&M University cancels programs in women's and gender studies  NPRTexas A&M protesters continue push for protected academic freedom  KBTX News 3Republican states are censoring universities  The EconomistTexas A&M Ends Women’s Studies and Overhauls Hundreds of Classes on Race and Gender  The New York TimesTexas A&M eliminates women’s and gender studies degree program  The Texas Tribune",
    "published date": "Fri, 30 Jan 2026 20:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZHRaRzBRVzRpeHVXY3hjQktrTGdSUDh4c1dkSU15X1JobXNKYlhYN2U4THFaNFU4Vko3aG9wN2kwUlVpeHd2Ty15eG1HbXRLT3JIeDhieUVCRDZFU2NBU0FXcVhpamdhODI1SmV5TlVZLTNoMnAtYmgxeUlHN0phNW0wdEFTOGpMck8tZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "A Minnesota School District Guards Against ICE, From Dawn to Dusk - The New York Times",
    "description": "A Minnesota School District Guards Against ICE, From Dawn to Dusk  The New York TimesICE’s Assault on a Minnesota School District  The New YorkerHow federal immigration activity is affecting Minnesota schools  MPR NewsFormer Manitobans living in Minnesota wracked with fear, disgust as turmoil continues to unfold  Winnipeg Free PressICE Is Circling Minnesota Schools, Looking For Children to Take  HuffPost",
    "published date": "Sat, 31 Jan 2026 10:02:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOanFFZ09TejNKbVpjM3BJNm5JTmVWM2g4YXNaRkZRZS1ibEJaWlBBbFU2MUlNOEJIelZBQTY3LVR0ZU5Hczh2a1NMNEwwNGJ1eTRvM1NCN2QxNXhONzJMdWY0Zk5vR1Ixb0FUQlpHUkNMRldDS2VsWTJUZTBEQkZ0R01ZWEpETV9S?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C. - The Washington Post",
    "description": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C.  The Washington PostBitter cold grips DC region this weekend but a freeze reprieve is coming  WTOPCold air remains to end January and begin February in Maryland  CBS News5 things to know | Snowstorm to narrowly miss Baltimore  WBAL-TVDC Forecast | Frigid temperatures last through Monday morning with wicked wind chills on the way  WUSA9",
    "published date": "Sat, 31 Jan 2026 05:25:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVndZMUd4WC1sQkFiZDhYSUJaY3JyOTU4WjA4alB6azJudTYxdlcxazFmbmw4UGYtajl0Z0RwdVdsRWt1NWw1WHl6QVVDZDU2UFVqMzlKYVRMTF9UeUt4a2VGRE10b19TT19YMWQzT0dERTVNU1VSWm5TZ0FHeUIxV1NkQ1Jrc3RPdXZJLWJTcVB1MTEwOE5QcDlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown - The New York Times",
    "description": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown  The New York TimesTrump signals retreat on immigration even as he doubles down  MS NOWGreg Bovino Was Trump’s Rising Star. Then He Arrived in Minneapolis.  The Wall Street JournalBorder Czar Tom Homan says shift in strategy will lead to a drawdown of fed agents in Minneapolis  ABC NewsHoman says drawdown in Minnesota possible, state seeks immediate legal relief  FOX 9 Minneapolis-St. Paul",
    "published date": "Sat, 31 Jan 2026 01:07:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMWY0ODZtbkZtak5yZVNxVy1DQkcxX2NyMDVXRE1FVGNpN3AwMG90UU9Ob1BVQ0VUVXI5M2luLW1PNXduTVhVNHE4R0MxVzZiaE1oaXRlRHlocnpicGFXQlRVZjRjTUQ0OFRJRGRYSzNOOFJFcE5Xa2RzbzdpYWpDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood - NJ.com",
    "description": "N.J. weather: Snow forecast drops as weekend storm track shifts. Jersey Shore still faces 45 mph winds, flood  NJ.comWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelA bomb cyclone is forecast to hit the Southeast this weekend, with snow, wind and flooding. Here are the possible impacts and timing.  YahooLive updates: Nor’easter slams Carolinas with snow, vicious winds as storm intensifies to ‘bomb’ out  FOX WeatherNor'easter forecast for Massachusetts: Cape and Islands to see heavy snow, face strong wind gusts  Boston Herald",
    "published date": "Fri, 30 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxORU1JSDYxVTJEOGsxWWE0VWhIWFkzM183TWtnY2tXR1cxaDE2Q3BCazh3TFR5SGp1LWx5OG0wbjhWRGZWOXo0aVRQVnpOUGdjc2lnYjhMT0w1YWR1ckE4enJFcjEza1VrMHJITENtTHVtMm1renNjSjlOU19zSjJfdnpjTmdXeGY5aU9xSTNkZnVKeVhaMTVucGZWUkFBNTI4Wnc2c3NmRmNKMXZXNHhwTFNUem5odFBzSUtRSERuMnFQZVEwdERXT2xVWlRZeHUxcWFsXzRUdk5RVlI5THpPS9IB9AFBVV95cUxPUU9MNXpub2FPWHVHNWZCbzd2MGVFR19kWkRvak9QQk0zSE1ybmFCOGx3UTJ5RlhuQXFxMjI5cjlhRVVYQzI1bUhhWGJjekl5bkZ1ZFdzUWNMVzhUMjRUYy1FUGpiamVuQkduMGhTZHQtOHFsZHVtNzNNanZhYjN4aG84djhLMXp5VEU0bEVIZFJhZmxYQXpwRnNROHExdFdzdzNiWExuZ2Vvdi1LYnFEM1RqdlRrTDVQSTBqRlJDeDMzSFhQN1MySjkxVXQ5Mmg3dUxBSU1FRUVJY0lYYzFTeHl1OXlvdzgzTXE0ZHNkbW82cjFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Iran wants to make deal rather than face military action, Trump says - BBC",
    "description": "Iran wants to make deal rather than face military action, Trump says  BBCTrump faces a weakened Iran but that doesn’t make his choices any easier  CNNTrump’s ‘massive armada’ near Iran mirrors military buildup in Caribbean  The HillUS-Iran tensions: The diplomatic scramble to prevent a war  Al JazeeraIran Rules Out Talks With U.S. Until Trump’s Threats Stop  The New York Times",
    "published date": "Fri, 30 Jan 2026 21:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5JSW90eHlkSWs0RFRNYWlvNC10RTJnT0xQaFZvMFRRVVlhczJaM1pLbEFkUjFKWDE4MmdGczlNNks5WktGd1hFVHBjdmlyYWR1X2FIeS1TV3VvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "China to take 'necessary action' after Panama port ruling - DW.com",
    "description": "China to take 'necessary action' after Panama port ruling  DW.comPanama High Court Gives Trump a Win Over Canal by Ousting Hong Kong Port Operator  The Wall Street JournalPanamanian Court Strikes Down Hong Kong Firm’s Canal Contract  The New York TimesPanama Canal ports will keep operating after court finds concession unconstitutional, president says  AP NewsShipping giant Maersk to take over Panama Canal ports after court ruling  Al Jazeera",
    "published date": "Sat, 31 Jan 2026 01:32:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNLUtIS1ZsYThCM2N0My1NYVg2WjVaQk1Kamd4ZWFOWS1YeTRaMC1BX2lFclk1STBZV0x1SDFabVBhbVpQT0lzNTNQVFFfODliZGp0RjExZHBsVEFjWEZnRUNCTmFCdC02dG1wWTFsT0tVbXFtTjB3VmM2T0FNM2c0c01icjlPOG9mMm9rYVljOWFDd9IBkgFBVV95cUxNbmo0V3Zud1ZhWHRwcUdILWRDVndITHlFTDVDNGtnek1jbTlFamlRQUY1RkNvemtObUNuUzR0R0FFYnpYM2w4dG5sN0hPRFlpMVZiN1J1VDJJMkRXWnBaTW9NRU1rVC12Mk1TbzlCR3AyWXc0VFdLYW51MHhQM083MzN5T1VwSlo3dWNBLUtPQXRoZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "One person dead, 6 missing after fishing boat Lily Jean sinks off Gloucester - CBS News",
    "description": "One person dead, 6 missing after fishing boat Lily Jean sinks off Gloucester  CBS NewsCoast Guard searching for survivors after commercial fishing boat sinks off Massachusetts; 1 body recovered  Fox NewsGloucester fishing boat with 7 on board feared lost, sending city into mourning. Again.  The Boston Globe6 Missing as Search Continues for Boat Off the Coast of Massachusetts  The New York Times‘We stand together’: Gloucester lawmaker says of Mass. community shaken by fishing boat tragedy  MassLive",
    "published date": "Fri, 30 Jan 2026 19:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE04ZGpsbHFjZWhCckRCX3FxbWlOUkdCWDRYemxfU2l0bldVYXRabDFFNWlrMldXcHluWU5rYXpLRk8yNW8zRXJTTC1ubDNRenZFbGpHVnBQa1ZHNHV1VWRxVjg0OWNDUHIzMWV1VmxneFZmQTF3MW5LQ1A1MXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Judge rules Luigi Mangione should not face death penalty - NPR",
    "description": "Judge rules Luigi Mangione should not face death penalty  NPRLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersLuigi Mangione won't face death penalty in CEO murder case, federal judge rules  CNBCLuigi Mangione will not face death penalty if convicted, judge rules  BBCFederal judge drops murder rap in UnitedHealthcare CEO case  DW.com",
    "published date": "Fri, 30 Jan 2026 22:34:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPOGFtM21Ha2MxWlJwY2dwS1JSak1LeHRSUGFLYlNTRDhQMEVEeG1oUDR1bk1GbXVRcWh4bEwtRW9JSlVUOVR3amtKNlNIU3pCVlB1cWRGUmVRbmszaW1BajlWRWFJeFgxNjhibkZHcW1HSHYzNWNITUlWSG9FSlpvQjQwQ3haQWd6cVEzVTA2ckhjS1FWdkpHLW9YZ216U2FO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search - Politico",
    "description": "Justice Department defends Tulsi Gabbard’s presence at Atlanta election search  PoliticoTulsi Gabbard inserts herself into 2020 election fraud probe  CNN‘It’s a Five-Alarm Fire’  The AtlanticTulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington PostF.B.I. Search in Georgia Shows Trump’s Willingness to Pursue 2020 Grievances  The New York Times",
    "published date": "Fri, 30 Jan 2026 19:00:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVl9ha3lPa2E5Tk51N0RsdktObFgxRzdTdkIzVGQ4MkUzOGlCRWo5bWNna1hSUmFsWWxrOHY4eEJ0RGNBRWZyR1R3NzB5a09iSGFSVjV1ek1DeXNXbGV3em44eTRNdmw0dHE4WHFETnltVzZmLVQ1bjFWdjA1ZFRjUEI2ZjFfYmhiTlpReXVhMlh6QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\" - CBS News",
    "description": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\"  CBS NewsClosing arguments Friday in Brendan Banfield trial after he testifies he saw his wife stabbed before shooting attacker  CNNJury Deliberations Begin in Au Pair Double Murder Trial  YahooJury deliberates in Fairfax double murder trial connected to au pair affair  WTOPHusband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York Times",
    "published date": "Fri, 30 Jan 2026 11:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxObUNKaXZycWkzLWhrVTV2RklOanI1bEhrVmdLZFlyOUkteG1BelRQLUpsb2NCR0hhWkJNSzd6YnlwbjJ2cV9wRkJGQ3h4cDZGMUNYckJUeGFKcGlJalRlWlR6Q3RlUlRQSHdENUxqVUg3QUx3VWN5U3BHWXZlWkVXZ195QVZueWc4VWxUeFpKNE9xSzZHOExUUjZkcm1OQy1tRFhkWV9B0gGrAUFVX3lxTE1pY0R3WHpVcnJGMWxTblRPR00wSjB6QTlvV0VZeVJwbUw4VkxtOFdxZG9hY2NVblFfNEJCVUxxaWhEdjNQa1RjSWtCd1NBVkU0QlBMNWlWQ01DWThTc0ZuRnZEU0RmX2ZpUFVjQ2xESWxtNDd2a0pCdjFRVUFBM1dROFl6c0dBTkhjX0NsTHlza3QwT0NnZXFCdWFBRVFwYThzaHVOaDViWFU0SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Lewiston High School students march in protest of ICE - ​​Lewiston Sun Journal​​ ​​​ ​​​",
    "description": "Lewiston High School students march in protest of ICE  ​​Lewiston Sun Journal​​ ​​​ ​​​Collins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesJanet Mills’ first TV ad hits ICE  PoliticoHundreds of students walk out of Maine classrooms to protest ICE  WGMEICE ceases enhanced operations in Maine after Collins presses Noem  The Hill",
    "published date": "Fri, 30 Jan 2026 21:06:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdU0xSVpkaG83OUpiRVpia19wSzJad0pfWGNVUmlsalhvU3E0RDRBQlQ3OFdSeXpGRy12UWlZYlVFS1Q4YVRidWtNTDA2VFV6SUQ3UGxmRFczN0NnRVRJMDB5NTVHR1pGaGJ4QUpNSm1vcDVYRjZLRU9CSTE1MjQ5Rk1SeUFhdDRGbEN1bld0UUoxdmJkWmNz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sunjournal.com",
      "title": "​​Lewiston Sun Journal​​ ​​​ ​​​"
    }
  },
  {
    "title": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S. - Axios",
    "description": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S.  AxiosIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNNTrump news at a glance: Turkey steps in as president maintains threats of US-Iran war  The GuardianIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsIran ready for 'fair' talks with US but not on defence capabilities  Reuters",
    "published date": "Sat, 31 Jan 2026 05:11:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbGJJSUlaNm5BV1VOMmVYTHVNa3V3Y2ZnV1VyMXRkeFFNV01JSmNYTFJvMmxMRGJ0LVdHRTNSdHVwOGpVS3RaRC1UcDJSTnBkRS16b2ozUFNPdEVIdEdLX1N6OTJWSTgzcFhIdGxYQnk3YndwY3NaWGhzb2FqLVhfeHFYOXdhcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Scoop: Saudi defense minister says Trump not bombing Iran would embolden regime - Axios",
    "description": "Scoop: Saudi defense minister says Trump not bombing Iran would embolden regime  AxiosSaudis won’t let the US use its bases or airspace for an attack on Iran, senior Gulf official reveals  Fox NewsTrump’s Iran moves rattle Arab allies  PoliticoUS-Iran tensions: Arab states and Israel navigate tightrope  DW.comArab allies urge restraint from US and Iran as Trump demands deal on nuclear program  AP News",
    "published date": "Sat, 31 Jan 2026 00:49:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE13VWVKcnhRLXZXRFJZX2VXdjdoMlRKRzJ1SlZyazFwM0Zob0RGeFlWb2dxOVVkbUpjY0Ffb1hTUi00T1prSjg5bng2bXhxc3lyUGFtVVgtcER5V050Tmlfc3Utcjh5UWlzOXRZR1BQY3A?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "description": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest  ABC7 Los AngelesLAPD arrests violent agitators after protests erupt outside federal detention center in Los Angeles  Fox NewsCitywide tactical alert issues after anti-ICE protesters clash with federal officers in downtown LA  NBC Los Angeles'National shutdown' brings protests to L.A., across the nation; demonstrators clash with police  Los Angeles TimesICE protests spread across Southern California amid nationwide shutdown; L.A. protesters clash with police  KTLA",
    "published date": "Sat, 31 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long. - The New York Times",
    "description": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.  The New York TimesTrump’s immigration agenda is colliding with a midterms reality  PoliticoSenate Republicans try to regain footing on immigration after Minneapolis blowback  The HillAhead of midterms, Democrats mobilize around immigration, anti-ICE sentiment  CBS NewsOperation Trump Rehab  The New Yorker",
    "published date": "Sat, 31 Jan 2026 02:45:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOTDRWYzdnQUZZZ1owUEwtN3RYNi1ZOGZUd3BNVUJmSGxURm9NaXIxb3l3SWkwaWtGWGpIS3pockNxVzFFR1h2OEVYQVpFblVXU1E2d3VFNENMS3hPT3U3MFlWRkJaNU1qZzBDWDlIbG5SZFp3SnpvQmpYSWpGbEpwTEhCZ1JwZVZ4cEhZelFrSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE Expands Power of Agents to Arrest People Without Warrants - The New York Times",
    "description": "ICE Expands Power of Agents to Arrest People Without Warrants  The New York TimesLawsuit challenges ICE ability to enter homes without warrants from US judges  ReutersLocal groups sue ICE over policy on warrantless home entries  The Boston Globe‘You don’t have to open the door’: ACLU warns Utahns of ICE entry limits  KSLTV.comAP exposes a major policy shift where federal immigration officers can forcibly enter homes without a judge’s warrant  ap.org",
    "published date": "Sat, 31 Jan 2026 02:53:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOc2VucVZxcEI0NTBUcUpxVGc5cHF6dWtsb21LWW5VME52QjNCWUxEcHN2bFVpcVY1cmRWWHZpUlZGVy02OWtfR3JBUjI3eEZiMHhFcEczOWJYbElGMmozN3ZFbHREMllsdXdKUGxPOXRETjlkS0pyNV9MZ0UwQXpfQzE2dmdGWHlKMHV6cVNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding - MPR News",
    "description": "‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding  MPR NewsTwo Students From Same School as 5-Year-Old Taken by ICE Are Also in Custody  The New York Times‘Mommy, open the door’: Mother recounts her terror as her 5-year-old was taken by ICE  NBC NewsProtesters gather outside Texas facility where detained child Liam Ramos is held  BBCICE detains two more students from Liam Ramos’s school, officials say  The Guardian",
    "published date": "Fri, 30 Jan 2026 23:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQaXlwVng5N09BSTllRlREcWVFNXlNLXpRUi0wcURYaE9JdFpGalpRdDdQVi1WQU00V2l1dEpBLW96bG1GYzU0d25TTU9yNGdwNkJSM0steXpJVXJVT2M4YzRIemxNR0dWNEVNaXVieTI0cUliVVhYb3VyNlBCVlpIQ2JLQkprSTAydWQ2SW1mUXE0SWdNR01YVVFTdTd5TC1RaC1WNXRjNGJscjlXWFhXMzJWWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms - CNN",
    "description": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNImmigration raids, election office search stir midterm concerns for Democratic election officials  AP NewsMinnesota secretary of state, other Dems preparing for Trump to interfere in the midterms  Democracy DocketTop Dem lambasted for demanding Congress ban ICE from polling places: ‘Wait, why...?’  Fox News‘A pretext to rig the election’: Democrats scramble to block ICE crackdowns near polling sites  Politico",
    "published date": "Sat, 31 Jan 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeFhfU0xOTFg5Q0thZWhCWDFzNm5qZzc1YzNSSkxVVl9OMFhKY3YyeFhabnI3UFJSZGVfbW5zcWg5dWtFYVNucVdUc3dJVG51aWFMM3VPOENSejZGYkk5WEw1czVFVU5idS10S1lUeWJ1amhlbEx2TDlyWnR0NGhsTWhiaVNIbDFHUVBvR1BhVktMUTMwU0xBZWdwNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "A red hat, inspired by a symbol of resistance to Nazi occupation, gains traction in Minnesota - NPR",
    "description": "A red hat, inspired by a symbol of resistance to Nazi occupation, gains traction in Minnesota  NPRView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5NQnFkQjE4UU5hZkhpTnVSalk1NEVyN3lRcXFLc1U1a1V5WXhzSjBGQTB4S01PYTg3TEF0bjJjOEZmeExnVkgyUk9lRUZPcGlHaUJOMnpWd0Z2U2FBVUFaaVI2UWJhQ3lIUDYtdUs1LTRLRmdQMnFfWXpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Thousands still without power as brutal temperatures head to the South - ABC News",
    "description": "Thousands still without power as brutal temperatures head to the South  ABC News‘People have died. People are dying.’ Nashville leaders push NES to release restoration timeline for all customers immediately  WSMV51,000 NES customers without power one week after ice storm  WZTVNashville Electric Service adds outage updates as frustration grows  The TennesseanAs outages drag on, city and state press Nashville Electric Service for answers  WKRN News 2",
    "published date": "Sat, 31 Jan 2026 00:04:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQNzRwMjdDWlVMWkt0VVVqSUVWWi12VUdTT2txX0NaT0R0d25wOWdrV0RNYldUbDFBTERwazYzeUUxMktqZVhxOVBjRDRjbXdObHNveUFGZDZZUFh1OU5jU2ZkanFXem1wTTRTZVZiMV9UekxWaTVsdHJoQllnMWJjcXFaZ3hSMWJ6bFBnaDIyd1ZWaHB6TFHSAZsBQVVfeXFMTWNtYXRZS2lnbVVZc09JVm1LTzVlLXBYUEVHTWZNdWJjTVZiVE02YklKM3pSTUxEcDFXdE96d0hhT3hiS3ZBdmwxZlR4amN4SHVVM0Z5Uk9IWk9XTjk0TVBVUzFaODQwUVgyUGw4d01CeFJzLUl6U0sycXhuYlpSdDREdDFRcjctT0RRT2pFUkNlVmtETkhKZDJMWGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Democratic governors scramble to build a legal wall against Trump’s deportation agenda - Politico",
    "description": "Democratic governors scramble to build a legal wall against Trump’s deportation agenda  PoliticoHochul campaign quickly weaponizes immigrant announcement against Blakeman  City & State New YorkHochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues  The New York TimesNew York governor proposes bill to ban local law enforcement from being deputized by ICE  ReutersAlbany Police Chief Brendan Cox Full Comments in New York City  WRGB",
    "published date": "Fri, 30 Jan 2026 19:33:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPeFFIZ0Rzc1F1bXcwTjhWYjd1LXU1RGhVWFNLa2NmYld6cC0wOXQ4ZmRhQjFsN0dSV05teE9LOVdoWkd0RTBwQmZnV1VCaXJvb0JDS01nakY3dDRqdU5NZm96dy13SUdFQkR3NW5OYXpIclhlVDh1bXJOSTNaUnVzcENDMFgzdUlxVDZINmpsMHRnRk9SMnBaUEFtX1Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "‘A Terrifying Line Is Being Crossed’: Mayor Jacob Frey on the Turmoil in Minneapolis - The New York Times",
    "description": "‘A Terrifying Line Is Being Crossed’: Mayor Jacob Frey on the Turmoil in Minneapolis  The New York TimesMinnesota Dems are trying to walk a tightrope with Trump  PoliticoMinneapolis tensions deepen again as Trump accuses mayor of 'playing with fire'  ReutersTrump reportedly sues US Treasury and IRS for $10bn; US Senate reaches deal to avert partial government shutdown – as it happened  The GuardianThe Mayor of an Occupied City  The New Yorker",
    "published date": "Sat, 31 Jan 2026 10:15:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFA1blhpYUprbXpONHNiclZZTDdSbTBIYkdnUGQzb0RvMlpVR196dVYyWW5oWXJ2SS1aM0xHQlRTbWFqdEgwWkM4bzl2UWRUSFFWLXE1REdtR1BJYTVUY0xoNTNVTjNnQnZvajJqTFNSUy1VZ0cwMzhpQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judges across the country rebuke ICE for defying court orders - Politico",
    "description": "Judges across the country rebuke ICE for defying court orders  PoliticoIn Minnesota, America’s Federal System Is Coming Apart  The New York TimesTrump-appointed judges are letting his immigration enforcement blitz continue  CNNFix is in in Minnesota, where anti-ICE federal judge leaves his lane to side with mob  Fox NewsMinnesota’s Compelling 10th Amendment Case Against Trump’s ICE Surge  Lawfare",
    "published date": "Fri, 30 Jan 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQNmJjMFZzbWRHLTU1bGRCQW5jUDQ0XzFhMXJyZ0NSZnR0bFh0ZnZrRnJMeFlteDBhY2RwajBsS3E4aXZuY3A4MWhSUWN0bGNEWWhtY1VVdDlRSXI0OXpfbXVxdlB6T2F5UmJkUEtodWlzUXRfaS16bzZsMFh3ekpIQzh1eWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House - The New York Times",
    "description": "Judge Weighs Trump’s Removal of Slavery Markers From George Washington’s House  The New York TimesJudge calls Justice Department's statements on slavery exhibit display 'dangerous' and 'horrifying'  AP NewsJudge chastises Trump administration attorney in hearing over dismantled President’s House exhibits  Inquirer.com‘Horrifying’: Judge blasts federal lawyers over removal of President’s House Site slavery exhibit  WHYYPhiladelphia presses case to restore President's House panels as judge questions federal authority  6abc Philadelphia",
    "published date": "Fri, 30 Jan 2026 23:34:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUWN6RUJmbUF6ZHBuRUlIMU9jQmlGZ25DTE00UUZIWU9FcG14VDQtYm85VC1IX3Y1RnhIWWdpcVBKUFYxYThZUTZtLWtiUUJ1b2lrUXhMV1A2ZS1wVWRycngyX0czdEd4Q0VsVGY3VjZFZUZjTlRUMWstZTZqS19tZURYSEJGb1RFNHdWZEdQRTJTdTJfUUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Confusion reigns as Russia says it was only asked to stop attacking Kyiv until Sunday - The Kyiv Independent",
    "description": "Confusion reigns as Russia says it was only asked to stop attacking Kyiv until Sunday  The Kyiv IndependentUkraine sees quieter night as Trump says Putin will not attack its cities  BBCRussia reveals Ukraine energy ceasefire pushed by Trump is nearly over  The Washington PostZelenskyy cautious on Russian bombing pause during extreme cold weather  The GuardianUkraine's Zelenskiy expects implementation of agreement not to fire on Kyiv  Reuters",
    "published date": "Fri, 30 Jan 2026 10:41:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOQ3VoaVo0VWI2SFdndlRNWGd6SW9KTU81S1RCMWo3NVhmX2dNZS0zYzZCbV9hNWhudWwwWE95VXFTWmpFbW50Y21MUGFZNVRuYVpSSm1WckFWZWxfVDlPYVVrYUpDUVpMaXdyOVFMUC1YTHBodlZMMWEwcHNUUXp1dkN5aEpUNlBZM2RJMGZhdHlvRXZwZndFaWZramxGYWtNS1UyN2V6a3ZyU3pXZXU4T3RpdGw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "California Gov. Newsom files civil rights complaint against Dr. Oz in latest clash with the Trump administration - PBS",
    "description": "California Gov. Newsom files civil rights complaint against Dr. Oz in latest clash with the Trump administration  PBSNewsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video  The New York TimesNewsom files a civil rights complaint against Dr. Oz over allegations of hospice fraud  AP NewsNewsom fights back after Dr Oz accuses LA’s Armenians of healthcare fraud  The GuardianDr. Oz video alleging fraud in Van Nuys prompts response from Armenian community  NBC Los Angeles",
    "published date": "Fri, 30 Jan 2026 16:39:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxPamFraGxyWFFaX0o3cGJfR2RubEM4R3BrWTlDLWtPNHY0a3dxRVhkcXdEaVFadjZ3aHBuc0JUYjhFZXdNaGlSelhrMTkzT1R5MlNUQkZ0MXVhUmpoNmtvYVY4TEdPVXV5Z0lTb2lXc1ZkR05BWWVoLUZfaEJfSU1DSEszYzhvb0FTdVkxZUpkSWZBVzRrUVVxbEk2emNwbEtfSDVXRzNGVzhuVWllajlyNUQtX3BMTnpHeHc4VDJpTzBaR3BZUlVfSGJrWDQ2OTRvUWtKeUNxRXpXTmVYVzI5VzlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "U.N. Says It’s in Danger of Financial Collapse Because of Members’ Unpaid Dues - The New York Times",
    "description": "U.N. Says It’s in Danger of Financial Collapse Because of Members’ Unpaid Dues  The New York TimesGuterres warns of UN's 'imminent financial collapse'  ReutersU.N. secretary general says global body is at risk of fiscal collapse  The Washington PostUN faces severe cash crisis as Trump admin ramps up pressure on world body  Fox NewsUN risks 'imminent financial collapse', secretary general warns  BBC",
    "published date": "Sat, 31 Jan 2026 00:09:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPQUtUSVdLNFJRUlR6RWJDdndqdzJFcUQ5TlUwT213M1hYRGRsd1pkOEI5NmxIMHo0bkhFZWJxMmlyN2FEdlRyRWlWWmsyTVV0aUV6U2xlTUVyZkpxR3ZtZmxMbHNCR3pQN011aWdsTHRDRzQzTHA5MDJ3dldERXpaYXE3T2FQQ3lQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits - ABC News",
    "description": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits  ABC NewsNew SNAP work requirements are coming on Feb. 1. What to know.  USA TodaySNAP users in Illinois face new work requirements. What to know  The State Journal-RegisterNew SNAP work requirements in Ohio take effect in February  10TVExpanded work requirements for SNAP are kicking in for more states  WITN",
    "published date": "Fri, 30 Jan 2026 21:08:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPSkE1Yy0wRWI0Qk5CLUVMZE91bl9oNkFIN2tGazczT3FSUzE0d2ZxWHJ5Y2c5X0lOZVE4U3BtR2FKbFpzd1lBdGYyNGZhU2ZHS2RoWWczc1lGekg5c3VKdjlBYWVtcU9mYUFJa1VEOGlaYUx1SHBpUTlqUV9IT1JjdTdRTTUyZlhEb1ppZTZmN2pkd9IBlwFBVV95cUxQV0NzQWVzTHJ4TzIxOVdQLVY5UnFFakdmU0hwREI3ZDVKNlJ3bmxOdGg3V05vdUpBS0EzTXFYdnNEVGp3VUgyY3hFZmhoSzNRZHprVjc3UXhTUDBpZnhDV3hTNjNIX21sZjJZVUJZR0t4SDBWNzRUeF84VXZZR2FtYUI1X00xSVZSY20zbTkwT25XXzcxczQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Department of Homeland Security intensifies surveillance in immigration raids, sweeping in citizens - PBS",
    "description": "Department of Homeland Security intensifies surveillance in immigration raids, sweeping in citizens  PBSThe powerful tools in ICE’s arsenal to track suspects — and protesters  The Washington PostICE’s Use of AI Will Lead to Big Mistakes. Maybe That’s the Point  Rolling StoneICE’s surveillance app is a techno-authoritarian nightmare  The GuardianThe Tech Arsenal That ICE Has Deployed in Minneapolis  The New York Times",
    "published date": "Fri, 30 Jan 2026 18:05:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQMUpKZXctZFMzVzBYcVZmQ0RwWG9WRGFTSEppYVVYcm4tWVB6eDJSLTJCcUl3OTdad1Vzb29pZF9JWjVnWFFMSHM4M0JHbUtCUEVPcFhCQVo3T3hEMWpmYmpfZ3ZaV2xENjN3VWFGRjYwekR6alBCbHFwVHF2LUdEeGFNcnJyNzIyc2F4ZmZ3dGUyT1hFYldiYW5PamNwNGFkanlPTGVycnVNLU9HS0o2V0FZQ0lBdzJDTTBWaUFLM2Q2NExNQXF1WDA1dUNBMFFOcmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]