[
  {
    "title": "DHS: ICE officers in Minneapolis shoot Venezuelan man in the leg - NPR",
    "description": "DHS: ICE officers in Minneapolis shoot Venezuelan man in the leg  NPRFederal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesFederal agent shoots man officials say assaulted officer in Minneapolis, prompting protests  CNNThe US in brief: ICE fires  The EconomistAgitators attack federal agents in Minneapolis after second ICE-involved shooting and more top headlines  Fox News",
    "published date": "Thu, 15 Jan 2026 06:49:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNSHBTY2xQeERNUDlJdHRGbjlIWUxMLTdKSlQxYnVZYW4xLVZJZzU3X0h0X0VUZXJPVENZUnU4d2VKQXE1S2JjNmRDWUgycnd2a2xScm8yLUpRb0Njb1FNSHlKNFVGS0FWaFBzSThSQnNfZnlxS0VuU2p0TUtZUXlOWmRsX212VFhsQXZ0NDFvYV9sX3NlcG9Hd2lTN1lmUlJvUGR4eVA3M0hiT1pN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Louisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it. - Politico",
    "description": "Louisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it.  PoliticoNewsom Says California Will Not Extradite Abortion Provider to Louisiana  The New York TimesLouisiana officials seek to extradite abortion provider from California  The GuardianCalifornia Gov. Newsom says he's blocking Louisiana's push to extradite doctor accused of mailing abortion pills  NBC NewsGovernor Newsom rejects Louisiana’s attempt to extradite California doctor for providing abortion care  California State Portal | CA.gov",
    "published date": "Thu, 15 Jan 2026 00:31:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOV3hWa2UwRVd0Rl9xbUtadWNteTV1STcxaU9Cd0FUVzJFR2ZOMWJRN1liVklXc3FGWU1wRjBTV0RSZFdzZHVWbHQ0cGI0V0dLN0NiSE5fR01CeGwwSllMeE4xcUk4WFRpSW40SHZmT1ZkRG9Ic2Zhc0lFa09vSVd1dVloSXpwS2tYNm85VXIyS0xjN1lBaG9rRXdiNmVESXNlSllr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says - The New York Times",
    "description": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesNTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNA part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago  AP NewsCracked part in fatal UPS crash flagged in 2011 by Boeing  CNBCBoeing 2011 Warning May Offer Clues Into 2025 UPS Jet Crash  Bloomberg.com",
    "published date": "Thu, 15 Jan 2026 01:51:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9LOFNxc2QyLTMtbkZjMVpremhnYTFmSnNLeUZpbTlGdW5Wa2drZkhjRnY1Z0p2YzlMTExYeUtzUEx6d2dvVHRIVnVrUW9IUU83MWctMlpqWDc1QkJzTjlsaHNmcXgtSU8tci1URFczNTJpUzdS?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "FBI searches a Washington Post reporter's home as part of investigation - NPR",
    "description": "FBI searches a Washington Post reporter's home as part of investigation  NPRF.B.I. Searches Home of Washington Post Journalist in a Leak Investigation  The New York TimesJournalists confront new reality in reporting after FBI raid  The Washington PostFBI searches Washington Post reporter’s home  CNNJeff Bezos Needs to Speak Up  The Atlantic",
    "published date": "Thu, 15 Jan 2026 06:42:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNSU9FQkZXc1g3MDZKeEtldjRRbDNBbzJKaHVibjNmUmFyY2tmc3VSbjRLRGVQZlR4b25kcHNrVmpXazEyUjd5cWRKVDBYZGFlcFVfaVdEU0V2N1M0aHphek1xLUIyTS14T3AzM0ZnaklhcjU4NEtndUw4Sk5GRWk5dmEtRU96VXNORFJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Colbert Jokes That Trump Has Found ‘a New National Bird’ - The New York Times",
    "description": "Colbert Jokes That Trump Has Found ‘a New National Bird’  The New York TimesTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNA Ford worker called out Trump. The president flipped him off. Now, he’s been suspended.  Michigan AdvanceSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The Guardian",
    "published date": "Thu, 15 Jan 2026 07:53:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPc085WjFzSEo3bEJkck1Da3RucUdMVjlhdjd0OHlucU82TV9seXZiSllyR3paUFZneS1HOUphY1EtOWR6WS1fX0lZbHdwOFpUZVNBcmFKR3R2R2s2UXNnSEU0OER5cUgtVjlSam1ZcF96R2t6SGpCZ0FnblZoM2l0ZTdBNklxV1R2enBRb1VlLXptM3VLZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says - The New York Times",
    "description": "Woman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says  The New York TimesHow the feud between Trump and Minnesota is impacting the probe into the ICE shooting  NPRExclusive: Trump calls Minnesota ICE shooting 'sad to see on both sides'  Reuters'Beautiful light of our family': Renee Good’s family reveals new details about morning she was killed by ICE  USA TodayAnti-ICE protests continue with demonstrations at Graduate hotel, Whipple Federal Building  5 EYEWITNESS NEWS",
    "published date": "Thu, 15 Jan 2026 01:05:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1BRHdiUXd0RkJ0TmNLMkxrUmEzMFhSTldrMVBtVDZMSkVvaktrU3hvSndwenhmbDRvYkE0ZGl1LXM5SnVIdWhuSXBsZUw2dmlaWXBocWFkbzZuVTMySXQzNE41Z3g0TEppcllKSEgzWVZiS1hsbUtHYWFuRmMtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump would want military action in Iran to be swift and decisive, sources say - NBC News",
    "description": "Trump would want military action in Iran to be swift and decisive, sources say  NBC NewsTrump says Iran has ‘no plan for executions’ as US weighs military options against regime: Live updates  CNNTrump leaves U.S. military action unclear as Iran says it won't execute protesters  NBC NewsTrump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops  The New York TimesIran Averts US Strikes for Now With Pledge Against Executions  Bloomberg.com",
    "published date": "Thu, 15 Jan 2026 00:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNkFfOS1ySTk0Rml4c3czdUNEUUdTVy00TUFGSG1BWVFnZFd2MmVSRURCcWtJRUpPZ0phd3Q4MUszUW1ZODdNSXhvNGhKdHhfbGJwd0E1WTlTenNXazRMRFRDa2lJTTI3ME01VzFPRGxWQnJRT2g1UWxuNWVaOEtJbktYQVNYYXdUeVVwSUpsUVZiQlM5THpoSVN0Rmx5X1UzV25VcE80cHlHVmVTeEtyd2FkT3LSAVZBVV95cUxPanVnQ2haU2JQd0VCd2JPWnJIQ3ZqU1BqeVNhM25YekdIM1d0YmUzWkNDMVMwTld1c2FXWUpMdVJzeHFmYVFwRVVlQ0NhV0d6b0tPdzl6Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Colorado appeals panel appears skeptical of Tina Peters’ sentence - The Colorado Sun",
    "description": "Colorado appeals panel appears skeptical of Tina Peters’ sentence  The Colorado SunElection denier Tina Peters goes back to court after a boost from Colorado’s Democratic governor | CNN Politics  CNNHere’s what might come up at Tina Peters’ appeal hearing Wednesday  Colorado Public RadioGov. Jared Polis considers clemency for Tina Peters as he begins final year in office in Colorado  CBS NewsColorado Gov. Jared Polis on Tina Peters case: \"You can't give the president the headspace on this\"  CBS News",
    "published date": "Thu, 15 Jan 2026 00:53:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNWE5JLVVFZmFlMFFpSjgtakhZRFo0bDc0YmVYS1p6OHBDZHJXV0pJb3haS0lVa1prd1lxQndfdUNsQ1RWYUpsYVF2cXFWbmhnSzR1OEFTNk5qeHMtMGJvMG5RTi0wNjh6Zm9WelN0LWxnZEh1QnRJS05EbXpXZ1J6TmsxcHpPRjA2U1p3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "Protesters and federal agents repeatedly square off in Minnesota - PBS",
    "description": "Protesters and federal agents repeatedly square off in Minnesota  PBSMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNN'Campaign of brutality': Gov. Walz encourages Minnesotans to remain peaceful during federal law enforcement presence  5 EYEWITNESS NEWSLawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York Times‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time Magazine",
    "published date": "Tue, 13 Jan 2026 18:20:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPcXFSbFJlOFMyT05iRzhxMlJwT3luWTJuZjJzMm1jWC1oMVYyMHlJQkd6XzRUOWVGWElkMHZmb2tpWEZyRkFhV2pLMmNHU3BJNmt1RzNlVjNnWi1IY1JZUmg5cW9aZWFOUk5JckVSWkxnZFEyMDVFWjhCbkQ1NmRFMms0MnhCTGJMd1NDOFB0LUNmczhaTjI5dk5qcDJpaUxGanc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base - BBC",
    "description": "US and UK pulling some personnel from Qatar military base  BBCIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersSome US personnel urged to leave largest Middle East base as regional powers urge Trump not to attack Iran  CNNLive Updates U.S. Withdrawing Troops From Key Middle East Bases as Precaution, American Official Says  HaaretzSome US military personnel told to leave Middle East bases, US official confirms  Fox News",
    "published date": "Thu, 15 Jan 2026 01:31:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1ieTJ3bzRDQmhjeV9OaXpOSXZqeWFBbWNrQTZaeDNnQmVfVjZtM0JRMVRYbjFkVlp2RjFrbjNDMjEzdEFRRXc0YmlIV3NtR2RaQXlZWFJIV2Yzd9IBX0FVX3lxTE5hT0otNjJWZmVzbV84SGtwWjlpUHNOUlh2dHJhZ2FyelU3eGktVXFMLXlVT2liTGZpV3g5cnhFMFZHdDIzS0dTYzhjSFpoXzd5c096RzNvVW9YckQzOGtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Scoop: Over 50 House Democrats sign onto Kristi Noem articles of impeachment - Axios",
    "description": "Scoop: Over 50 House Democrats sign onto Kristi Noem articles of impeachment  AxiosDemocratic lawmakers file articles of impeachment against Kristi Noem  The GuardianIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS News\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOW",
    "published date": "Tue, 13 Jan 2026 20:43:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxONEk5bkNlZUxheTd3eWI2WmxpOS11bUNPdjhvMHdoVWRUQ2dlQmJEX0JVUVNSR3lKVGhkME5qVE1LdDhXOHRGdlVMbXhHczNBUVl4RXltT1JReWgybWF5cklVTUVzdkNOYkQzVWtnbFpRVTNsYUVPckowRXBfVjJLV1dNc0FOdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Anti-regime protests in Iran and around the world – in pictures - The Guardian",
    "description": "Anti-regime protests in Iran and around the world – in pictures  The Guardian'It's horrifying': Videos of body bags and machine guns give rare glimpse of Iran's bloody crackdown  NBC News‘The world needs to know what’s happening’: families of protesters killed in Iran tell of heartbreak  The GuardianOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesVideos show security forces firing into crowds in at least six cities across Iran  The Washington Post",
    "published date": "Wed, 14 Jan 2026 06:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORHI3RXE0NWZEVmRyajFrOElYcXlWM1poNE9wUmVOUzQ5WTIwLVhvVnpFR1ZmWUpaaDFJOXBHUy1qWWJCTmxzcnQ1c01rMGliTy1HRDhqdkZ4ZGc4RHkxNWVSY3ZVc3lGMkg5Mm9qTXUtRG5QRjNnZjdUZVdUb3BydHRwa1NxeFNHZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US Supreme Court appears likely to uphold restrictions on trans athletes - BBC",
    "description": "US Supreme Court appears likely to uphold restrictions on trans athletes  BBC'Save Women's Sports' activists react to Supreme Court trans athlete hearing  Fox News5 takeaways from the Supreme Court’s showdown over transgender athletes  PoliticoSupreme Court appears likely to uphold transgender athlete bans  SCOTUSblogKavanaugh and Roberts are already looking ahead to the next major transgender controversy  CNN",
    "published date": "Wed, 14 Jan 2026 03:40:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE14bEpjeUhIVWxReDA3VlhOZjRKWXA0RXFHVm05QzM3ck5oT1p2ZUNCZGVKRFhmSkNkZjhaTDFObDRGNGVITFpxT2tIWTBjM2NVeHh0Mkw3MjVVUdIBX0FVX3lxTE1HVDNxV05qazctR0NhOGRkTDlTaFRab1lLdGlYSEkxXzljM0VYdEtGQlN3aXFCWHBvOW9kZVZHT0ZvX2JzQVR3UGpFWTZDYXNMY3lzN0pOV0FmalgyRnBV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "National Council Statement on Cuts by the Substance Abuse and Mental Health Services Administration - National Council for Mental Wellbeing",
    "description": "National Council Statement on Cuts by the Substance Abuse and Mental Health Services Administration  National Council for Mental WellbeingH.H.S. Reverses Decision to Cut $2 Billion for Mental Health and Addiction Services  The New York TimesChaos for mental health and addiction treatment providers as Trump administration cuts — then restores — grants  WBURDemocrat blasts HHS for creating confusion in cutting, then reinstating SAMHSA grants  CNNDeLauro Statement on HHS Reinstating Billions in Addiction and Mental Health Grants After Abrupt Cancellation  House.gov",
    "published date": "Wed, 14 Jan 2026 05:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5panlDMk5RV2ZybE5sWElWZVJwSlh3U3RDRDdKVVIyLXMxVEtMblhGVkY3Nm5nWldKMjVOWUUwTHcwM0lzZTROYnhBWElWcmozUXAyc2FrZ0lBUm5LZTFyRXpSTUJfQ3lGeDliYnB5cUpZYzQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thenationalcouncil.org",
      "title": "National Council for Mental Wellbeing"
    }
  },
  {
    "title": "Virginia House committee advances 4 proposed constitutional amendments - VPM",
    "description": "Virginia House committee advances 4 proposed constitutional amendments  VPMDemocrats launch campaign for Virginia voters to join redistricting fight  The Washington PostVa. General Assembly returns to session with focus on bipartisanship and affordability  WSETVirginia Senate Democrats pledge action on affordability as 2026 session begins  Virginia MercuryVirginia Democrats look to decimate GOP seats in redistricting effort  Politico",
    "published date": "Wed, 14 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdmxqMVNicEc4dFczNjcwSHZWV3BLb1dDdFhlVGJNbXNMcDZwbnZoVHVKaWdYamQwM0lwVTkyZGVuRWtadFJabnFOOXV5QUFfUHd4QzZZUGZ5RWZVZmxONm8wM0hDd1Q2RWRiOGYzbjN6d0loVlZLRzV4aWZkcU4zcjE5d0Fybkl5dmxJWkZoTjFRVi0zN3JabXFuejI5QnNkVGlidEtJdTZBMmV3dU4xRDd4VW9tRTB3dHpEWEp4dWJKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Trump blasts Murkowski and other Republicans trying to limit his powers in Venezuela - Alaska Public Media",
    "description": "Trump blasts Murkowski and other Republicans trying to limit his powers in Venezuela  Alaska Public MediaSenate Republicans Block Effort to Check Trump’s War Powers in Venezuela  The New York TimesSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNNSenate blocks Venezuela war powers bill after Vance breaks deadlock  The Washington PostTrump dials Collins with ‘profanity-laced rant’ over Venezuela war powers vote  The Hill",
    "published date": "Wed, 14 Jan 2026 02:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQQ0o3NUxmQURlV1hkczRrN1E1bnJCc1g4RlkyMFE1MW1FOW5pa0RDT3U4OWQydHdFV2cwUXkxc0x3UkRkV1RZS0UzazhOSU5kX1huOUhENUZaQlpFWmFfVmp5d2VwUzVFeDkyU3BpaWZNWTA5RnVQdUFCaTJDa2tCUnNicG1PejhJLWNyckNpMUZQNi12Y0t3YjRzaU1VSzFFbzY2aVg3a3dkTE50VmZmSXNfenJUcDM0aDhYUml5NmU5Y0VlRWdTQlA0ZGhFVlIyV2tzUVo1cFM0SUZna2ppYzRnVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://alaskapublic.org",
      "title": "Alaska Public Media"
    }
  },
  {
    "title": "Brazilian au pair testifies against former employer and lover in double homicide case - ABC News",
    "description": "Brazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu Pair Testifies of Lurid Plot in Virginia Double-Murder Trial  The New York TimesVirginia nanny’s jailhouse letters reveal conflicting loyalties in love triangle murder trial  Fox NewsAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC News",
    "published date": "Wed, 14 Jan 2026 18:16:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxORWU5ODdpdTZSZGtHZVlUVGJFMlFId1RhOVh6OGU5TkdybVZMRFRlSTlVNEY2RTBBNmdyRXN2RE5jZWlkaUdUYzI4SVVHQzhTZlNGOXhucmNBMTFWVkw4NDI5dFBlSTFUQmRMNDdPYm4wT0hsdlBUYXRYZG1YSHJUb21qaGpUWlZzMDJhbHE5UkdvLTFGaGtZc1daVTVpQVZWM0oxatIBqgFBVV95cUxOZjJ5ZW1ObTFESW96c09iREVHVW9rYV95RHBseG1SZWxaM0hfak1ZYUhRelFVR3NaMFFILVFQcmJlWjZtbk8xbGxCSzFRX3BZaDVyRE5qZmk5Sms1T2cxNTFLUS1DTVJKb3VhZUc1OXdyU0Y1WVpZUmJvb25RRzFHVmdIemZpSWpEWWdlMFJUdHZLa3VwVTZwOXNHVUhKaVU2TlFlaEx0YWdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Six Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow - The New York Times",
    "description": "Six Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow  The New York TimesTop federal Minnesota prosecutors officially terminated after dispute over ICE shooting probe  Fox News\"Darkest day\" for rule of law: Ex-federal prosecutors react to U.S. Attorney's Office resignations  CBS News6 MN federal prosecutors resign amid investigation into Renee Good's widow: report  FOX 9 Minneapolis-St. Paul33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star Tribune",
    "published date": "Tue, 13 Jan 2026 17:28:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVWdaWUNoaGswUjdPVmp2M25Lc3FkdjgzVkhMOG5tRkZkLTcxRnJLenMwamFpaGJtNHRHQXdKRW1aWGtGdmxZek9mSF9OR2ZRRXRzREItdVdZV2hmTkwtM0FzcHFEd2RnaVR1cXJFd2hVVndUSm13N0Z2TEFLeGUtZ3ZKdDBmX3RGSjRv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him' - ABC News",
    "description": "Family of couple allegedly killed by ex speaks out: 'She just had to get away from him'  ABC News'She was terrified.' New details emerge in Ohio couple's killings  USA TodayTepe case puts a spotlight on Ohio's rising domestic violence deaths  AxiosPolice chief touts gun link in Ohio dentist murders; records show three 9 mm casings found in killings  Fox NewsAlleged psycho surgeon Michael McKee would 'torment' ex Monique Tepe: 'She had to get away'  New York Post",
    "published date": "Wed, 14 Jan 2026 15:49:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcmhuRlRDanZRNjI3SFR2dkloYmt3cUJSQkRMUmV1RXh6NEVmY01BMDRNTm5BdzVXTHpaVk5xY1RCcVRLci1aS2k2MlNuN3Q5TFFUUXdSa2NOVUxIbWpGZk5zX1dqRXdOVWpNVU5Ua0dRQm4zRG5fSTdJdjJfWTVQcm5May1yNXA1WmfSAY8BQVVfeXFMTk82T3BTRUdtcDN6QVloTFFZNkc4N0h4VlJ6TWh5dDRVZzN0SEpma0JrNERHc0UxSktaaU1yUlJXZmJndV9weE1mWm1rNFRheWk2cmF6QjI0MjZOQlZiT0FFRWFrYVYxM3U4TDBhN2JmNEdTajlVZmtnQjROejlJdWJpY29GYk5rSmxlaXpKTFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Republicans vow to hold Bill Clinton in contempt as he skips Epstein testimony - BBC",
    "description": "Republicans vow to hold Bill Clinton in contempt as he skips Epstein testimony  BBCClintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The GuardianBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesHillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry  Politico",
    "published date": "Tue, 13 Jan 2026 18:51:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBfRmJCXzVkLUIzaVphWW5Oa0JLUXJZekViUVIwR01xR2JyYThlYmZpNzNyc25Da1dMaDFjY25uRHFMZkMtN3dJSm81cFZzTXpPZDRGcjd2amREd9IBX0FVX3lxTFAwWHBhMzBYNXdTZFhWNVhxdmlab2tPazJES2xYbWFYaEs1RmZDX3VudkdpSlZNc2xLRVY2MWJKSmJxOHRTMl9ibXdHTF9GblNXeV9TOU1YMm5DYVM3bURn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "House takes step toward averting Jan. 30 government shutdown - Axios",
    "description": "House takes step toward averting Jan. 30 government shutdown  AxiosCongress is rolling on spending bills, but the toughest fights remain  The HillHouse OKs more spending bills; Senate negotiations continue  E&E News by POLITICO",
    "published date": "Wed, 14 Jan 2026 22:35:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lMGsyY0tTYmFkWEg0RFVxMGlNZGtzU09QdzdnSEdFaHBXcWdpSXVUZ3B3MUV3a1JvSXBXNWZ0bjhZaVlBSFZ1VExWUzF0S2JGbWY4eGUyd0ZPdEt5S2JKaGluVHhDR0wtTjY3MG5MWmt6aTll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "HHS reinstates all laid-off employees at workplace safety agency NIOSH - Federal News Network",
    "description": "HHS reinstates all laid-off employees at workplace safety agency NIOSH  Federal News NetworkAdministration reinstates hundreds of health and safety officials who were laid off  ABC NewsNIOSH workers put on leave by Trump administration have been asked to go back on the job, union says  WVXUC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York TimesUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.com",
    "published date": "Thu, 15 Jan 2026 00:11:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOb0VHd1lKbVZqX1pmMnBoVUNrN19rdTFOVlh2RnVJdDM3azVFcGtBREFfYmtDVjZkSjA4YmFaMjBJT0trXzZKTllseXFtMkUwU3lZTlJ6NUdyVm5FeWF1RDRkMDB3OVdQOHk2ZzRaM3ItQWoxLU03V0JyUWd2dU9HWHJTMWxIWlZ3YmQ0ZlJxZXNCenRWQ25HNTdJTUV0QklkVEZRS3FYTkpDbGVCbk9USWo5TndXZVVwM2JVdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://federalnewsnetwork.com",
      "title": "Federal News Network"
    }
  },
  {
    "title": "Texas breaks ACA health insurance open enrollment record - The Texas Tribune",
    "description": "Texas breaks ACA health insurance open enrollment record  The Texas TribuneTexans defy expectations with ACA enrollment  Axios1.4 million fewer people enrolled in ACA plans as premiums spike, tax credits expire  ABC NewsInitial Obamacare Enrollment Drops by 1.4 Million as Expiring ACA Subsidies Drive Up Premiums  The New York TimesFewer Americans sign up for Affordable Care Act health insurance as costs spike  AP News",
    "published date": "Tue, 13 Jan 2026 21:58:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPazhYQUxxcTByclpKaG5fMTNscGdhdlRlWTA4aGIwbUx0dXRDNzZ5U3R1RHI1OXlTeU50M29fUVVsVTM1UUxSQ1ZFSXhhSjFZTFY0b21uUklvRE54dXFRbjZVSDBHSjNJdjRaTWNDLV8tTjcwQ2ctc0ZDTl9qRFIxdTktZXhsbU5yTjFMV1BOT0p2WGNCRVBTS0NEZTNjNUhRN1dr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Echoing Mamdani, Hochul Offers Plan for a More Affordable New York - The New York Times",
    "description": "Echoing Mamdani, Hochul Offers Plan for a More Affordable New York  The New York TimesNYers can get free college tuition for in-demand fields  PIX11Gov. Hochul's State of the State; Iran \"Prepared\" for War; Supreme Court Hears Arguments on Trans Student Athletes; The 'People's Republic' of Astoria | The Brian Lehrer Show  WNYCStatement From CUNY Chancellor Félix V. Matos Rodríguez on Governor Hochul’s 2026 State of the State  The City University of New YorkWhat’s in the 2026 State of the State?  City & State New York",
    "published date": "Tue, 13 Jan 2026 17:09:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOVlpjOGk4T1diaFRNR2xBcnNidThHUkQxY2tkMWdFVV8yYXZLZk9NUmRpVVltS0trd3hIYnhnSC1MOVNNX0FFeUc2RUJKdjZYdlVwZ19nT25kVGJINk54MG1uN1hVU1BOWGZhWklpZEx0S1NnMkFNQ0l3SHJyQWtydVFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws - Quinnipiac University Poll",
    "description": "Majority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University Poll5 takeaways from new polls of the Minneapolis ICE shooting  CNNMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGovNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  YahooSupport for ICE Is Collapsing  puck.news",
    "published date": "Tue, 13 Jan 2026 17:55:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1sYVJOZTRIcFFwLXFwRDl0ZUgyRDQxMkpXSTBIM01jazhZR1A2YVA3S2cwekFMeG1EenpMQkFENGJOak15T0UwVTJBZGNMSExiSHowa1pabElhSTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "The big bills to watch as Colorado’s 2026 legislative session begins - The Colorado Sun",
    "description": "The big bills to watch as Colorado’s 2026 legislative session begins  The Colorado SunColorado begins another legislative session with more desires than money to spend  Colorado Public RadioTrump factor, budget cuts and Gov. Polis’ final year: Here’s what to expect in the Colorado legislature’s 2026 session  The Denver PostColorado legislative session kicks off with affordability bills, resolution changing governor's title from \"His Excellency\"  CBS NewsThe bills already in the works ahead of new state legislative session Wednesday  Denver7",
    "published date": "Wed, 14 Jan 2026 11:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5oYkh2VUV5dlBDQVZDZVVCM2NNWXVLdUdKYVZSNzh5TmxrN2ZiODhXVEJmZHZ3RE4tUG1mVUpnRy12MUFkcmlLOVBGRk9pdjRRLVo1UjJKcFIzX1JKb3p0M3JIWjN5OWFUYWZhVUtzNzZ2MlpjNDktMDIzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney - ABC News",
    "description": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney  ABC NewsTrump Loyalist Asserts She Can Keep U.S. Attorney Title  The New York TimesJustice Department accuses judge of abusing power in questioning prosecutor's authority  ABC NewsOrdered to explain herself, Lindsey Halligan invokes Jack Smith  MS NOWHalligan defends her use of U.S. attorney title in combative court filing  The Washington Post",
    "published date": "Wed, 14 Jan 2026 19:46:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPWXpwVUo2Vl9UNHhjNnVBeTcwMnV4ZW1ZRW1OYUNCZjVCdEt1N3BiUDNrRmpKamxSRU1VNGRIeUlhUjVfUUJCV1VkU2F2S2xVVHg1eGFXR2NXVUlwWWVzUzZrVHdjcUZDbFVVQ2dsSnJ6OXdDQ0xlb2pXSmdxbXVyZHc2dkF6RmJoSVZ0andqWEhkZURMbk5hbE12MEZaMExuZlp2QWI4N0Iwd9IBrwFBVV95cUxOaVlDMktCWWhiaXVQUDlqazU0MHdWVkJpOFBEOGNVaTgzeGw5WjBBeHI0ckV6ZUVUSTRMX1ZNa0gtWHpJaXZYTWRfby1mV3hzdXJZMDkxcGhQQ3NMbTh2R2ZHTDNCT0gxeTZLWDRBSWNncWRCcUJLRXgwSm9jUDhfcm9SdkYzcFJmVjAzSmpOcEVIWVM3anBDUmpwX1pTX1QyME9wMktDOVpYZTB6ZVZN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Governor Newsom announces early reopening of Highway 1 through Big Sur - California State Portal | CA.gov",
    "description": "Governor Newsom announces early reopening of Highway 1 through Big Sur  California State Portal | CA.govHighway 1 fully reopens through Big Sur after three-year closure  KSBWAfter 3 years of repairs, Highway 1 through Big Sur fully reopens  Los Angeles TimesHighway 1 in Big Sur reopens early after 2024 slide repairs  KMPH'Here we go': Motorists speed through Highway 1 in Big Sur for the first time in 3 years  SFGATE",
    "published date": "Wed, 14 Jan 2026 18:47:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPZC1kVERReEFPMl91R09wY2swYjZ6ZGJDTWlLTFY1LXVITm1sWERDSEd0amVxVFBrY2JoN1NPX3Yxd3RYMnlhdnhrdTJwcFhCOEVTcXFoYXpULXV2WURqdlE2cmthVFlXMVFlX1BBM21ZSDlET2gwQTl0MVJjSmpKZnVfT0Vwa1NFVVJ0T1FjcEt3TDk2YUY1cEloUUNzWm5aV1BPdHhLV0Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gov.ca.gov",
      "title": "California State Portal | CA.gov"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Trump administration to investigate 2 Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday TelegramDOE investigating 2 Maine school districts for potential Title IX violations  WGMETrump administration opens 18 new probes over trans athletes  The Washington PostUNR among schools under investigation for alleged Title IX violation  KOLO | 8 News Now",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State - Iowa Capital Dispatch",
    "description": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State  Iowa Capital DispatchRob Sand: ‘I would like to see the math on it’  KTIVRob Sand 'concerned about what we didn't hear' in Reynolds' address  The Des Moines RegisterWATCH AT 6PM: Iowa’s 2026 Condition of the State Address  KWQCWhat the governor’s property tax plan could mean for city and county services in Iowa  KCCI",
    "published date": "Wed, 14 Jan 2026 02:37:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWC1mYmdQRUgtTW9mSExxTnpLczU3bDZmSUhELWpXRFVrV1pYSGRpSkJ3bmY5aFo3QXNYVW80cmgtdUQ4RDF1QTNldGJmaDVDLVVoZ2t0N09iWGQ4UGxLUVF6clIwSFlyX3lnbkVNRWZVYk9iaDRGWUxhLTVLQjdLczNFTGRqU2dycUV3VTVKU2tuVzFLckEtNC1WNVRpR2puNHR4c3ZsU0dQRFJIYmYzNlNsRkl4TEhVNk1IbEpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://iowacapitaldispatch.com",
      "title": "Iowa Capital Dispatch"
    }
  },
  {
    "title": "Trump administration says Venezuela has released jailed US citizens - BBC",
    "description": "Trump administration says Venezuela has released jailed US citizens  BBCJames Luckey-Lange Among Americans Freed in Venezuela  The New York TimesInterim Venezuelan government frees at least 4 Americans  CNNMultiple Americans detained in Venezuela have been released, State Department says  NBC NewsWhat Will Become of Venezuela’s Political Prisoners?  The New Yorker",
    "published date": "Wed, 14 Jan 2026 11:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5odGtyOFNNajRyRGxaYzkwcUxvalhPdnZWUXd5c3FYeFlwWEs2UTVaZ3o5aEJoQ2FSNkhVR09HTHRxR3Yyd3NsZ2gwa292bEJPSEY5Q005ekNBQdIBX0FVX3lxTFB5LVJ4c2RqVGhjVXhjYVA0cGNIS0ttQXhYakhEa3J4Y1FRWF9QQUUwakFfaGExYnZBd3QwejVrR0JsaXpUS2xMYU1jdlE4MW1EM3pfaU5iQTM3TVNhZmRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Scoop: Trump's envoy secretly met Iran's exiled crown prince - Axios",
    "description": "Scoop: Trump's envoy secretly met Iran's exiled crown prince  AxiosExclusive: Trump questions support for son of Iran's last Shah inside country  ReutersReza Pahlavi says Iran is undergoing a revolution  The EconomistWould-Be Iran Monarch Reza Pahlavi Declares a Civil War in Iran  The InterceptReza Pahlavi, Son of Deposed Shah of Iran, Seeks Center Stage Amid Protests  The New York Times",
    "published date": "Tue, 13 Jan 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOW5xN1ZSa0tLcy1INlFYV0U2M2VDVE40NTFPV2RGZ1c4TTh2VFp3NkwtZUtjUmFNd184OXhnZ3hfZjBSaWRIT1ltNXFOUGxUYjJ6ZzJibkdhUVMwWUIxRENxSnA1d1RYcEJfdmxXXzRmRWVVc2NQazhYNl8tc0ZxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "What to know about the new EPA rule on air pollution - ABC News",
    "description": "What to know about the new EPA rule on air pollution  ABC NewsE.P.A. to Stop Considering Lives Saved When Setting Rules on Air Pollution  The New York TimesThe EPA is changing how it considers the costs and benefits of air pollution rules  NPREPA says it will no longer consider health costs in pollution regulations  The Washington PostEPA to stop calculating money and lives saved by curbs on air pollution  The Guardian",
    "published date": "Wed, 14 Jan 2026 22:53:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9ta3lFcG13R29RaG9RNC1Kb2FsS2tzeURYVm1Od1J6WEdqZ1p5MjN3a3UxbGJFSUFMRW1KNUVVNDNxTzI0N2Exdy02LUVHOU5mRnRGeVAxR0pMUnN5OVhSTEN4RWIwbnJiSjIxMDh4LVNjWkE5OGI1WEh3a9IBgAFBVV95cUxQdndRWlp6OU91SElOVDRjZEIxM3I5Y3BNelowOGhzaVNXbm1qX1hwcDkwS3dqZUQ0ckk2WUJnS1FweTFYd013MVJ5Y19odUEwdHhLNGgzMjFic1h2bVpaMHNYdmVMMFJtancxSHNQU2xwTGxna0Jzd2Uzamh0RE05QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump administration drops fight to tie transportation funding to immigration - Politico",
    "description": "Trump administration drops fight to tie transportation funding to immigration  PoliticoUS drops appeal of order blocking Trump plan to tie state transportation funds to immigration enforcement  ReutersDOT ‘Accepted Defeat’ in Fight to Tie Funds to Immigration: California AG  NOTUS — News of the United StatesUSDOT drops case after court’s decision to block it from withholding funds over immigration enforcement  CDLLifeTrump Administration Waves White Flag on Transportation Funding Immigration Fight, But the War is Far From Over  FreightWaves",
    "published date": "Tue, 13 Jan 2026 19:48:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOdTE5TzhKSTF2MUZYZE1jby1Zb0lnSko1NFR3bFVTTjFsM1VQWENKVjhrTkJOQ2NLU1lsd3hHeVRPbFhDS21DTWVSR3VfWUI3UjZ6eFlpUzN5SG56STNWc1paLUVha05DLWJnZU10azlsNTFEZ2VoQTNRVnZfbVJpbGxZZGJDQkh5eU1Dc0lkYTJrRVpE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "E.P.A. Moves to Limit States’ Ability to Block Pipelines - The New York Times",
    "description": "E.P.A. Moves to Limit States’ Ability to Block Pipelines  The New York TimesNew EPA Proposal Would Strip States’ and Tribes’ Authority to Block Oil and Gas Pipelines, Other Infrastructure Projects  Inside Climate NewsTrump set to limit states' ability to block energy projects in water rule  ReutersEPA proposes limiting power of states and tribes to block major projects over water concerns  AP NewsProposed WOTUS rule could ease federal regulatory burdens, but questions remain for states  Brownfield Ag News",
    "published date": "Tue, 13 Jan 2026 17:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNU2NHRnRPQW9iZDBCdVREbUVkaWZRSTBRdHlaNHJGdmt4VURacWU3SFNCNklWVTdhc2VnSHZKbDNxbEZ5LVlKblZfTVVZdDJRRzZHc2d0ckg4Y181Y1BZQ0hTaHhxc0d1UlFzWE5yRjdBaDRQMkF2eWRXUFp6bW9vUTln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday in Minneapolis Including Sexual Predators, Violent Assailants, Domestic Abusers, and Drug Traffickers - Homeland Security (.gov)",
    "description": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday in Minneapolis Including Sexual Predators, Violent Assailants, Domestic Abusers, and Drug Traffickers  Homeland Security (.gov)ICE arrests convicted sexual predator who was allowed to roam free in Minneapolis because of Governor Tim Walz and Mayor Jacob Frey’s sanctuary policies  ICE | U.S. Immigration and Customs Enforcement (.gov)ICE: 13 gang members illegally in US arrested in Minneapolis  NewsNationICE arrests in Minnesota surge include numerous convicted child rapists, killers  Fox News2,400 have been arrested by immigration officials in Twin Cities since Operation Metro Surge began, DHS says  kare11.com",
    "published date": "Wed, 14 Jan 2026 23:39:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQRElzN1FPdTJxRTQ4VkVOMUFjTzZWcnZFUlpoYmFLajBWQVdnenc0THI0NDl1UVRORjNieUlacDdQZEdPcXI1XzNzWktrM0hleDhQSEUyd2oySDgyLUdlOVA2X0FNUmFkSUZzT1R3LXVxQlJoR0FFWlNyZjRTdVh5WHljSlFBek9mZ2V0bzFGOWhKYnBGaXBNMXFxNW83WTBhWUQ1amM1RGNzZno3QUF1Y0libkowQVd1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos - ABC News",
    "description": "Prosecutors want 20-year sentence for ex-South Carolina lawmaker for sharing child sex abuse videos  ABC NewsEx-SC Rep. RJ May sentenced to federal prison on child sex abuse material charges  WIS News 10Ex-lawmaker who advocated protecting kids gets 17 years in prison for sharing child sex abuse videos  AP NewsJudge slams ex-SC Rep. RJ May with prison term on child porn distribution charges  The StateDisgraced former lawmaker RJ May sentenced on child porn charges  WCIV",
    "published date": "Wed, 14 Jan 2026 05:45:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOVDRvZVdEb09JSmVLcm5yUDhPTTJFN1N2MWR0MzJxTElOcWtTR2RUclVVTWZYNWU3NWZNb1VLVURuNUlmaThibXBvdmFveFZyaTg2Y3BaNkZrRDEtV3ZYa3pueTRYaGllTXpKbHNXbkl1SUZKakdoYlNUWFhIV2ZOZ21fbXdzcENkLTFEclpyZ1dCRDdiRTR1bFpMZUVTYTYyOVRIQWxsUzNKQdIBrwFBVV95cUxNbWRuUjBzS1NycEM5NkVFZkh4TlozcVBRdFRPenM4d1NEb2VKQWU1cHQwbmdIM2NiV0hySy1wWUNYSFlDYTBkeDRfVl9aUVp1Q3VldUNFamxFQ3R4cHpXMzdtU000NEI2VllhbUFJZURhNllQOGtQOVh5LVhQOHllTWFyaDdCOUtzUE9qQ2VNZDhCanRxUVdwYXlKOFlKaW55Q1ZyUEdXRktjTEgzVzlZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax - Missouri Independent",
    "description": "Gov. Mike Kehoe wants voters to decide whether Missouri should eliminate its income tax  Missouri IndependentMissouri revenue surplus nearly gone as Gov. Mike Kehoe unveils his budget plan  Missouri IndependentGov. Kehoe asking legislature to have Missourians vote on phasing out income tax  Spectrum NewsNationwide Tax Competition Heats Up as Missouri Governor Calls for Zero Income Tax  Americans for Tax ReformGovernor's budget calls for major cuts to spending as revenues wane  Columbia Missourian",
    "published date": "Wed, 14 Jan 2026 01:35:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPSTRGZ2s2RXRzMlNOWUpUa3pUaXdVZk1ab2RGT3B3NGFKeWFxU1U4YWxxRV9DMFYzbEZkWjByQ3hUS05XTVZCaUF1QnllRWpZWEpDVHk4MVVPcHNWLVdTR1ZDQmRHMDRUdTNyWjkweGpESjNGTFRVMlZwLVE1VzBldXozeFNqTDBnVEYyN09iNUJCekdWVjNxQ1A2M2VDOXpWOUtFRWtEMExyY1hpYXBWVm41bVRuQVNZTXhxbWN1aEQ3TXE2eEVPcFlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://missouriindependent.com",
      "title": "Missouri Independent"
    }
  },
  {
    "title": "Why unlocking Venezuelan oil won’t mean much for US energy prices - The Conversation",
    "description": "Why unlocking Venezuelan oil won’t mean much for US energy prices  The ConversationU.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesHalliburton expects speedy return to Venezuela and plays down risks  Financial TimesTrump says US is taking control of Venezuela’s oil reserves. Here’s what it means  CNNThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  Fortune",
    "published date": "Tue, 13 Jan 2026 18:39:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNQlZwbklfZW84Z1VyYzJLLTc1S3gtcUNWSC1ETjE4NlUwdXZDQ0VPREVvLWlXVk9CZFJHTkVZMDNPazZvVlRIWlBKcjNmRWVrS0VNODdITjhWWFRrR0ZOOEdObWY2UFM2cXFuX2E1S2l6SkZ3Z1lDNHZqMWYzdDUwSU5OZ3k1LVhSWi04Qm9BUzA5UkdRVWN0R3VrQTJhMVRi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders - WPR",
    "description": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders  WPRWisconsin Assembly passes bill to criminalize grooming  Channel 3000What to know about child grooming, E-Verify and other passed bills  Milwaukee Journal SentinelWisconsin lawmakers vote on affirmative action ban, other bills  FOX6 News MilwaukeeRep. Palmeri: Statement on first floor day of 2026  WisPolitics",
    "published date": "Wed, 14 Jan 2026 01:22:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS1hYZFdWLWJiR2p0dnZzT242REtlRDVCWTRUeWhVTWFUMFM3OTQxSUVKNXlaRERLMmtxVGlFdEVQcnJMbjJrZkJuSkw4UFFrNFRLTDVZYzRHS2t1aEpmak1xRlZtMVhDR2dNWDg3OTFQUFFleDFXSGw3V2lnS09SclpWSWZPS1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wpr.org",
      "title": "WPR"
    }
  },
  {
    "title": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention - ABC News",
    "description": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention  ABC NewsFour Oglala detainees located, three still in ICE custody  ictnews.org'A deep irony': Native American legal expert weighs in on racial profiling  MPR NewsMinneapolis Native community works to protect each other as ICE surges in Twin Cities  CBS NewsHomeland Security responds to Oglala Sioux Tribe  KELOLAND.com",
    "published date": "Wed, 14 Jan 2026 07:14:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQTUxMLVI3eVZRVS0zWlhhcU1HYXc1V0htZXNKa0E4VGw0blM4RG1qVE9tZFNuVGt0T2kyRnViVk1ibkVDTG5TNGdyUFNtVl9vTUUxSFJzdzU2Ynh0QnZJeU91akE2OVRoT2ttQ18wcTBCM24wZzZFZ3dLdnh0bnZkRkFQZzJMUjNhcENUS0pQZVk5MnJ5Ny10UXNuUTVjajRvWXZndUpVTdIBrAFBVV95cUxNUEFBbEJBd090c1Y0LVdnd0dHSkhseUlwOTRPZk9CdlM5dS1JRk9ON1ZiakY2RVd4UUQyM0FQNzZZVHlzY0psc2ZDeUExNHJPcXlNcV9neVRJVE9NWnVUelRtNE1sOTRDeDJTZWlkNFBOWWduc3hLbDZSd2R3d01IZXBveHZlOWV4UmxRV0ttc3JWOTFfSmJSQnJyZTJZS1hpcU00eFRFNXZOWWlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival - The White House (.gov)",
    "description": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival  The White House (.gov)Trump in Michigan for speech to Detroit Economic Club: Watch replay  Detroit Free PressTrump’s Auto Jobs Record Looks Nothing Like What He Claimed in Detroit  Bloomberg.comHere’s how Michigan voters feel about Trump’s handling of the economy, according to poll  ClickOnDetroit | WDIV Local 4‘It’s literally terrifying’: Hundreds protest in Detroit amidst clash with police, Trump supporters  MLive.com",
    "published date": "Tue, 13 Jan 2026 22:23:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQcUNTVDhuamswRjdtUEJka0Z2b3JzVmo2Z3RqWXRqem5DdXYzanBVX0VTWWdlNksyZTZpNUJMZVNuazA0U3NuZUFMYkVNelhHNlZTZzk3OWV5dHZlOXZuRUdBZzMxT3dRT1NIblg5NU4xSHZGWURXa1Y5SnVVLXR3VFlnNk5vb3VVY0ZfVU5vem4zQTdEX2lQMmhNdEJvdXRMdVJqZmo4ck10UUUzMDB2Zk5hYTMwdmtxR1gw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation - USCIS (.gov)",
    "description": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation  USCIS (.gov)Trump administration to end legal protections for Somalis, making them eligible for deportation  CBS NewsTrump administration ends temporary protected status for thousands of Somalis in US  Fox NewsTrump administration ends temporary protected status for Somalis in US  The GuardianDHS announces termination of protected status for Somalis after group targeted by Trump  ABC News",
    "published date": "Tue, 13 Jan 2026 17:48:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPcWdVSmYxUUx0U3pNamF4WkdDMlZjTWVpcE94cUdSSTVNeTAzYlpSMEpMal96LXJtanRybVJFVFRiSXVFV0tnQ3JXQ1NaLW1XTjJBMVB0RGlEaHpMUlVyQmU0MnJQbkpJZlVaUHlqWG5BSl9EZC14LWVJdlp0bVRienVGREtDZmtWa0cyTW83M3ZzOTYtbHU2U3V2cU5MaEpzTlFza1dyR1ZQRmp2bmhEVld4SnNWZXpXS0V3X2hB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.uscis.gov",
      "title": "USCIS (.gov)"
    }
  },
  {
    "title": "Claudette Colvin, who refused to move seats on a bus at start of civil rights movement, dies at 86 - ABC News",
    "description": "Claudette Colvin, who refused to move seats on a bus at start of civil rights movement, dies at 86  ABC NewsView Full Coverage on Google News",
    "published date": "Tue, 13 Jan 2026 22:33:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTFdydVc5X3hMcl9ZTUZfY0lFcG5LN2VkanpXWnZLcy1BQndSVXFhZ1BwNkozdHFuRXpCTjY4MWwyYktJTXFCdmRrWi1rT2pUUHZEZ2Y3YkUyM3BDMGp2bGp6TjlYcDU3VUtfLS1LZXlHd1hWYjFrYXUydWVYS0xtMFVQcGpQTGpIbGlkNXlfcDNJTmc4VGJPU0NyVWNZZ9IBowFBVV95cUxNeWE0WWxFLU4tRW9vVjFYY0ZLV0NBOUFxb2pqUVM2R2RyNDRUc0NMVzl0UHJBMk1IeDBXYWQ3UDJkU01uWGFleTlIN1hvUm8wLVFubmdqQUxwdFJ4U2VpYzFaT1VCREZKbDJEX0o1WDdMNjhTS1o5Qjk2RGh0TUppOFRvLTRmMHNpQUt1Nkwwc3JFMlVyWHcxUjR6STJzaEZDSkJZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Ferguson delivers optimistic WA State of the State, urges action on key issues - KOMO",
    "description": "Ferguson delivers optimistic WA State of the State, urges action on key issues  KOMOState of WA: Ferguson drops maverick tone, backs income tax on the wealthy  The Seattle TimesGov. Ferguson says his budget proposal is 'laser focused' on improvements  king5.comWA Gov. Ferguson calls for millionaires’ tax in State of the State address  FOX 13 SeattleWhat WA Gov. Bob Ferguson said, and left unsaid, in his State of the State address  Washington State Standard",
    "published date": "Wed, 14 Jan 2026 00:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugJBVV95cUxNT2pWdHpIZjhxb215MnpuanJtMUFVektwUUZmeTAxRUdmU3FZalVHcTgycWJ2eFFscXItUUJWZlBIcHFHbnNSZVN0azVwNjI2Z3NLRTlyUG16QTJfNFc2YnpzZkJ0cTNkdTNPbGZBY2lDa0ZENFdaMGsyNHQzb0s2bzh3NDI4QlNOOXlXVUpZWjNoNzRTVFVmZFEwSktkU2NGYURBUmxVQnoxOUpiZkMySzJ6YlpybnhlLXJNQ0dRYlRQWmc4MXpadTJuZmNvSmxmSXMxaVBURkt2R1dvRnMyaTJ6cFRPSE9FZkNhVWgwaXJMZDdsTGJmZ1pnY3NzanB5Zy1yaWgySUI5QlRjSE4zMUx3NW1TcWRpUHFXX0VqU3AwWHJxTVVOenZKNU5uRHRaSFdGb1BTS2lMQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors - NBC News",
    "description": "Maui braces for possible end to FEMA rental assistance and more housing strain for fire survivors  NBC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 08:58:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQOWZjOFI3RXBOel9qMEJGWnFrbVBnbW8xM1pHQjJxWVRVM3ZSWnoxTnk0LWNLbF9VT1BXZWFvaF9jWHVNSnZiVDNJbVp1ODIxSmFuREpHcTQ0WTQwVnZPVENkRTlZOE9MMVhLUFNuVlRsM3RWZkZWMXpiNkRIZjVTa29kRDFVM2JocEJJa0Q1bDdYWmJDTVJQNmRlaElLaHNzWlJBMk1JSXpuNW1EMzRVaEtUZVJaMEEyZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Vanderbilt University to establish full-time academic campus in San Francisco - Vanderbilt University",
    "description": "Vanderbilt University to establish full-time academic campus in San Francisco  Vanderbilt UniversityExclusive: Vanderbilt deal includes second property — an upscale East Bay site slated for housing  San Francisco ChronicleWhy California’s Oldest Private Art School Is Shutting Down  Artnet NewsPrestigious university to open new campus in San Francisco  SFGATEWhy a 150-year-old Nashville university is opening an SF campus  San Francisco Examiner",
    "published date": "Tue, 13 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNeVpVd1F3aWJ6M2VYYlpKMENZQTdmemVIMnJUZDcxZW5HZ19zam1hU2h5OGJEX2Ywc0prME9qcm00MU9UZFpVNWFQM0ozSHp6R3dTVmNGQ1NFUU1hTWZ2NE45VEU5NFpoYXpvUVpUN3p3VzFobDBQQ1liX2d6UW1CRkhXWXAwNEhmb3dYY2VaS2dOQ05zMU1LRElLWVdJeVdCSFlTSmhQX29obThJMFlMS1ZEZHcyUFZu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.vanderbilt.edu",
      "title": "Vanderbilt University"
    }
  },
  {
    "title": "With uncertain future and bumpy session ahead, DeSantis touts 'results' in final State of the State - Politico",
    "description": "With uncertain future and bumpy session ahead, DeSantis touts 'results' in final State of the State  PoliticoWhy is DeSantis not running for Florida governor in 2026? What to know  Tallahassee DemocratDeSantis delivers final State of the State Address as Florida governor  NBC 6 South FloridaDeSantis’ State of the State wasn’t what I expected | Opinion  Miami HeraldFlorida's 2026 legislative session: Property insurance, redistricting, education and more  WESH",
    "published date": "Tue, 13 Jan 2026 19:02:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPR2JnaDJ3WmV3LUluZm5oQ2E5UjFqN0lDdno2bk1oQnBfWmk1bWVtMkd5ZGF2SU5DYW0wdW50QnMwVmNwdy05VFl6VlByN3FKd1RxbEgtc0xuNEZLeTJLSWFFWFJZSThBcXFVWEkwekEzenBfU193a0dnOC1VX29ubnZSNFFwTWs0TS1JVG4wN29VUjFNUWhMRFoxd0d1Ni1jUUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Everything you need to know about Montana’s rural health windfall - Montana Free Press",
    "description": "Everything you need to know about Montana’s rural health windfall  Montana Free PressStates Race To Launch Rural Health Transformation Plans  KFF Health NewsDPHHS gives lawmakers updates on Montana State Hospital, rural health funding  KTVHRHT funds to help local hospitals  Magee Courier-Simpson County NewsState outlines plan for $213M rural health award as lawmakers weigh SNAP waivers  Carolina Coast Online",
    "published date": "Tue, 13 Jan 2026 18:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNOWFVb0RFOEJtc2k1V1I3R3VXZnBLcUlRUXJ6UnctTkFPN2diZDdhT0FYU2l1ckwwQzhFZzlWMTRfZW92WF9kaWZ5VURjWlk4RjVONkx4LUVJUURnaXI4eDc5ZFk4S1kyRnVhcnpld2VMQk5UakZ1dC1FYVN1eTk2eFU0b0NGaGEzLWxQLUVhUkZPNGRQaUktWnVCM1pBaDZwVWZRcEZjN3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montanafreepress.org",
      "title": "Montana Free Press"
    }
  },
  {
    "title": "Immigration Detention Expansion in Trump’s Second Term - American Immigration Council",
    "description": "Immigration Detention Expansion in Trump’s Second Term  American Immigration CouncilDaily Briefing: ICE detention centers are booming  USA TodayFour migrants die in US immigration custody over first 10 days of 2026  ReutersICE Detention Expands Dramatically; 70,000 Immigrants Now Jailed, Deaths Increase  Democracy Now!Man dies in ICE custody after NJ arrest, cross-country transfer  FOX 29 Philadelphia",
    "published date": "Thu, 15 Jan 2026 06:38:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5DdGwyR2ZLVE5jT2tZMWtkRXpER2E2ZUlnSFp4WS1JdUdVUVhhNldoZzd3bW1RdElfQzY2bXdFWFVieVFfQWI5VGd2dXY0TUVoWHBMcHJGczNseTlkdE9NYXJDTzI5eEFySXFZTDJIckdWREMteEZ6MkllTkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.americanimmigrationcouncil.org",
      "title": "American Immigration Council"
    }
  },
  {
    "title": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families - SF.gov",
    "description": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families  SF.govSan Francisco Expands Child Care Subsidies to Tackle Affordability Issues  KQEDSan Francisco to Offer Free Child Care for Families Earning Up to $230,000  Bloomberg.comMayor Lurie rolls out new affordability push. Here’s his first move  San Francisco ChronicleFamily Opportunity Agenda: San Francisco promising free or reduced cost child care; pathway for students to attend college  ABC7 San Francisco",
    "published date": "Wed, 14 Jan 2026 17:08:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNSlNxT0lHOTA5N3lkdVJldW5oNGVUZFJqWVV1MVlnUHpZVWRkb0hhVWZzd1R6X21pejBRYi1JWnpTZjN5ZEx6OWFVbzV0a2JaMkdmU00wbzM2MlFoV0pOYTFxN3VJdFExdmRNcTk0T1NZUkJ4bjNfczBXRS00V3hTdVZFNTFaVnIwT0owdTZ3TWNYeUhGV1NjTUFTZXd3Umtmc090NjQ5Zlgwc1hSSGZYeG5BRllyMXFOVVdNWFpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sf.gov",
      "title": "SF.gov"
    }
  },
  {
    "title": "Proposed ban on police face coverings gains momentum in WA Legislature - Washington State Standard",
    "description": "Proposed ban on police face coverings gains momentum in WA Legislature  Washington State StandardOregon, Washington consider bans on law enforcement masks to conceal identities  KATUWA lawmakers move to ban law enforcement from covering their faces  The Seattle TimesOklahoma bill seeks to ban masks for local law enforcement in immigration operations  KOCOWashington Senate debates bill to ban law enforcement from wearing face-concealing masks  KOMO",
    "published date": "Tue, 13 Jan 2026 23:59:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQSTl5bjFJVUE0cExobjY4eFZ5U09WSWRjQ3JGSEgtQzBERHJib3phQTdzS3FqTVdEaXVraG1HWXJONm1ybWJZYzR2dGlPV3ZTZk1hQ09TdzJzV3VMaFJwRExzNTA4S0dTbkVhVVhvc1Zrd1F4NV9pd1IxZmg3NnNhcWVQYWFXTEV4eHdoVnBjWXdZZmtoSzUycTZya0d6ZjdEOXc1WFhXVkRPNEJBR082eURrSklmNWY5Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://washingtonstatestandard.com",
      "title": "Washington State Standard"
    }
  },
  {
    "title": "Man caught on camera saving 2 toddlers on Florida highway - ABC News",
    "description": "Man caught on camera saving 2 toddlers on Florida highway  ABC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 23:29:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPbkxDc2JnRFdfa0tFZGszejdWajdXQXhmR0diWlVoQ0FKTGd5YkFyQ0Z5WWpJYVZkMV9SdnBlcnlPTEpnT28tOWhuWHlLY1hhOFYzOTY1bWZ2M2pkRl9PRmhWamRXNmVBelE4ZXVXNGsyd1B0dEpJbGdJQk8ydzktaC1VTGxiTEdSXzhLMmxfczNQSkJaVDdkOEFZMlZ6ckgxdHFwTGs0c9IBrAFBVV95cUxOMk9IeExYRlNJeVVsYnpWQWdRV255RTFLYWJBZnZhMVRqaHlrcVdGS2lTWERJaGhOZDJWdkxOWWpVbDM5SnRlV1NwTW1xRU5sdjZPc3VuQXNsbVhBVENtenpVcGk0eFBXTGdDeTYxY2lxT2ttNElEUGFnM05LQ29aRFdlTlZjdDNmYTRIdzBGN1BFRGUwbGJiUUg3X2lmWk1CMmw3Z2o2eFpoTUpj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "ICE Arrests Criminal Illegal Alien Employed by New York City Council - Homeland Security (.gov)",
    "description": "ICE Arrests Criminal Illegal Alien Employed by New York City Council  Homeland Security (.gov)ICE Arrests N.Y.C. City Council Employee at Routine Appointment  The New York TimesDHS exposes background of NYC city council employee after Mamdani fumed over arrest  Fox NewsAnger Builds Over Arrest of Venezuelan Council Staffer As New Details Emerge  THE CITY - NYC NewsNYC Council employee detained by immigration officials in Nassau County, speaker says  Gothamist",
    "published date": "Tue, 13 Jan 2026 23:33:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWDBwSGcyMGNCWkZvUklodGhza0Nqc1RPaHBvQTlKRUV0M2IyNXpfQUtNMmNKN3pLN1RRT3RmMkpIaFNTaVcwVU5JZkdFYU9sU1NYd1NRYzF5ZG5lWTJNQWo3MmQyMmdEb2JGUlNwbDl4LThwdnhydVJnUEdfdEVucUtaRkNVTjQ4dVFPMHo0TjZ3cEwyZVcwQ1RiZTNLZ0pfZzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds - Department of Justice (.gov)",
    "description": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds  Department of Justice (.gov)Once-revered trans activist Ruby Corado gets prison time in fraud case  The Washington PostCasa Ruby founder sentenced to 33 months, told to pay nearly $1M for ‘diversion of COVID-relief funds’  WTOP'You betrayed this country' | LGBTQ activist Ruby Corado sentenced to 33 months in federal prison  WUSA9Casa Ruby founder ordered to pay $956k restitution for stealing from LGBT nonprofit  WJLA",
    "published date": "Tue, 13 Jan 2026 21:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQMmIxOWFLSWtrMWplZl9NRW1EYkQ2UUI3czBqbFNZNGFlSGFNRTcyLTVuczFvVGVsYkpVbnNwLUdRc3d1U2ZOSm04NVA0aXF4X3Y0b1FMNEl4ZzJ6blR2cl9oMnoteGxCOUNETGZQV0FLaUt5cWV4QmxMcHNlUGI5aUltU3k2YndlNmZtWlVCeVFOQ0RtakNlRFFJbEdrSWY4RFB4d3VacmlFc2ZueVJheThiTUdIaWl1MVBoYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity - The Columbian",
    "description": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity  The ColumbianMadison students walk out to protest ICE enforcement  Channel 3000Madison high school students walk out, protest ICE actions  WKOWSpokane high school students walk out to protest deadly Minneapolis ICE shooting  KREMPhotos: Madison area students walk out in response to fatal ICE shooting in Minneapolis  Wisconsin State Journal",
    "published date": "Wed, 14 Jan 2026 02:32:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQNmlMbkVnLTJKalNOME9YR2VQTENlSXozN2piOGlfMlBCRHlmb2dKcHVVbEVjQXJ3OWllVnAyb29PZjZ3UXZ2cXl4SUl5d0xkZWREaERkYng1UWszc3lweE1RYnRTWjJJaGJjTUwxLXhoSjRaN1FIeGljYkx2MlZ4UGRSbjQ2dlJ6RGg1V0x6ZHZIVUtuczhVS0pqWVdWSU5jWHRuM0N1bWRsY2FRemVXOGxaa3dvSmRfdndKUEp2SmJVbWJGN0FYdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.columbian.com",
      "title": "The Columbian"
    }
  },
  {
    "title": "47 ways Trump has made life less affordable in the last year - Economic Policy Institute",
    "description": "47 ways Trump has made life less affordable in the last year  Economic Policy InstituteGeorgia hit by higher power bills, less clean energy jobs one year into Trump’s term  Macon TelegraphOpinion | The Affordability Problem in One Chart  The Wall Street JournalA Record of Historic Harm in the First Year of Trump’s Second Term  Center on Budget and Policy PrioritiesNew Economic Policy Institute Report - ‘47 Ways Trump Has Made Life For Working People Less Affordable in the Last Year’  WNY Labor Today",
    "published date": "Tue, 13 Jan 2026 13:01:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQd2NQSDFOX1VISUxhWjBEQVZENElQTjNKenRmNENQcTVnQVEyT3ZNaXNHQzNzekxCeE9jMGE4OWVYMGZFSGFxMkFoQWQydDVfZXY3SkI5SGduSGlDalBCMkxEU05uYWxiTHlDcmQ5NW9hU1UyTjBhcFkzRm95RHRZOXRaN1lpYlNzbkJCcmtpN3dZbi1SWlJCVzdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.epi.org",
      "title": "Economic Policy Institute"
    }
  },
  {
    "title": "Fire displaces nine units at Atlantic City, New Jersey high-rise; residents recount evacuation - 6abc Philadelphia",
    "description": "Fire displaces nine units at Atlantic City, New Jersey high-rise; residents recount evacuation  6abc PhiladelphiaFirefighters battling high-rise condo fire near Atlantic City boardwalk  NJ.com12 people displaced after fire tears through Atlantic City apartment building  NBC10 PhiladelphiaHundreds evacuated from Atlantic City, New Jersey, high-rise building fire: \"It's organized chaos\"  CBS NewsOccupants of 12 units displaced by Atlantic City high-rise fire  Breaking AC",
    "published date": "Wed, 14 Jan 2026 11:37:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNNTJQSVpzRXNLRU9IU2didmdXMTBxSmROaWNOYmlNWUh3SFFpVVZkV1ExTnBjN2xFckhHeGVFUktmbF9ic3FGWEpOYnFmWGEyTXQ3ck1vSkFWTDAtaGFldXBycVgzeGJRcUNiekRIZ1NERW50cjRMdWRIR1hwdDNWci13Mms0cU1tRjZSTm1XeE1vemlaNEs1VXl1QnM0dS1YcVJMQzdaTmpPcUEtUzhCTWNSV1B4YkRlc1pwUlljeWtubmxkRHfSAcsBQVVfeXFMUGFna2hvSTgtYXlKdGpDVWRuZFZZSXk0QXJLamJLaEZBcFVjZm9oVk83MlJCaFdYM05TTmkwQmtwdlpKVWg2UDROeVc0cWlPcjJnTGw5UXNkU1J6VkRYMlNEV0w5SlhSUGJFSVQ2Y2JQNU1LaFpuV0pHNUtCRGdZMGV5RXRXNjlnU25Wc2F4d2pEUFU0LS1lU3pOUXoxOVc5OGRDWi1wX08tMk5kbk9EdEd1Q0ptRWxxa3dlYkMwblZZdkhOcXp1S3BXdW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://6abc.com",
      "title": "6abc Philadelphia"
    }
  },
  {
    "title": "Who is Erfan Soltani, protester due to be executed in Iran? - BBC",
    "description": "Who is Erfan Soltani, protester due to be executed in Iran?  BBCIran says protester Erfan Soltani not sentenced to death as it reopens its airspace – live  The GuardianIran Postpones Execution of Protester as Trump Threatens ‘Strong Action’  The New York TimesIran claims shopkeeper Erfan Soltani, detained during protests, was never facing execution  CBS NewsIranian Protester Set To Be Executed Despite Trump Warning  Time Magazine",
    "published date": "Wed, 14 Jan 2026 21:39:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ycEdHaHlWd3A1a3VVOEVNOWVpYTVXUG8xdjFOdk14M3AzNjB0U2xnZE0xbDY0MXhZOHlWVU1JTWs5MGdsOUF0YVhCR0lTWEJBYjNYTERhcmRFUdIBX0FVX3lxTE41UFZULTVGeU5jVUFPazNwbDUwRkRYWWNZbHdHbzRmWHRPOFZ3QU9xSlRwMmlveG9WazVLaDJwRWl5UkpTS1ZvYy03Wmswc2xPQjQyNUpDcFJyYmx1OU9r?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Best friends die in Florida after sand hole traps them underground: Sheriff - ABC News",
    "description": "Best friends die in Florida after sand hole traps them underground: Sheriff  ABC NewsTwo teens dead after hand-dug tunnel with 'sugar sand' collapses in Florida  FOX WeatherCitrus County family of teen who died after tunnel collapse donates organs: 'A blessing in all this tragedy'  FOX 13 Tampa BayCelebration of Life held in Gainesville for 2 teen boys after sandpit collapsed  WCJBChild dies after tunnel collapse near Citrus County park  Bay News 9",
    "published date": "Wed, 14 Jan 2026 16:53:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdGlKYnA5Z1Q1U20zUDJRMW1qNDc5Q3Vka0xFaTJFbG9MTjA3aG5xX1VZZWFHT0s2cUZ1WXdIWG5YVWlNSnluMnVOQmtUMzFTWmhVT3ZIMmtIQWcwRjdvcjM4MEdrRE1lUk5nMS1nRHRpR05JRG1tTWMyNm1ydV9lYmJ5Q1NSeTBycV9ELUxWQms5MWhvdUHSAZsBQVVfeXFMTTI4YXZtNVViMTBoSmVWX1B1SmQ2SWkwYVUtSUx1Y0JRRlZrWkJqT1JpUDJGYzBfN0JtN0RXdkdRYnZOMWNXSVpCUE1zMm11aVYyaVVPSml0eDBCeGJOSnlhcEJyclZ3T3ZXZjZNRGk3Qm9DVlFCTE9UY2ZDRnhnUVpSNmZOcVJ4cTRPbmc5bUQwZHVkN1l4aFp0bGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants - The Conversation",
    "description": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants  The ConversationOpinion | This Is No Way to Run a University  The New York TimesA Texas A&M professor pushed back in a course review. His class was cancelled.  Houston ChronicleTexas Sends Plato Back to His Cave  The AtlanticWere your Texas college courses reviewed or changed this semester? Tell us.  The Texas Tribune",
    "published date": "Wed, 14 Jan 2026 13:30:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNWGNBMmIybFR4RGVGQ1VMSVNXamJTTDY0U0lKT2xvMmcxZmxOZ2pqLUFEUWwwdnVXdzVaeGNsbmw5T1JYT2VYYUZkU2x1R3VvUDVDejRmVmlNRkNCaTYzblNqdVRuZUp2TXJVLVlVLWc5TUhwUjREalk0YllVRGtqRU03RklUcVhfUnJRZmk0c3V0V2RZblJQaVlYc1FERmtWT3M0NHJGYm9XVVM1UUltQ0YyRFRJSTZ2M0ZBUmlnWmo3TWZ2NmVJbmRPY0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Chicago business news: Harold's Chicken Shack CEO Kristen Pierce-Sherrod, founder's daughter, dies at 55, family says - ABC7 Chicago",
    "description": "Chicago business news: Harold's Chicken Shack CEO Kristen Pierce-Sherrod, founder's daughter, dies at 55, family says  ABC7 ChicagoView Full Coverage on Google News",
    "published date": "Thu, 15 Jan 2026 01:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPYVZZdFVEdDItdjhuOVVJT20tR3VzMDlaeTVxT19rWHh1Z2R0eWJWUlZOc2Y2SHlQRl9JQWVrZVZMUEV4amFzNXktZnNQb0JCQ3lpYnp6ajk3bUdvTFZmMEhjQVAxWnJXU09xOWlIOEdIVTF2VjdlTDR0aXBiNFdqdWY1eURIVDg2dml0RjVROGZKWHJNNjhuYTVORUpiSjQxZXNidktiR2VGakEwdXlkdFl1TkU5Zk9zMGtXMXA1MFFEcl9jZFhlMWVWTXFudVZQc2hLODh0aEJIcmxobVZJZtIB5gFBVV95cUxORjZ1MUFvTkVHZmZHV0IxeTlfZC1MYXBJQTFBZWFmZVZlRWRKWFRRWVBoRHZITHc1VHBNS1FvNzBXRlFCLWpwMldYdW9XNXFyZjdoc0QyV0h4ZWc1eE85WEoyX0djOHhGQTRlZVZTMXotbVp0RW1HLUtCcU5JeWNzak9ad2pGeDZaQ3RLMGlURjlTemVNeFg5NFpKY0FyYVBZeGp2THo3WWEtV1VoSERrMXhLdkxDeHZuQ1VYb2dEbWF0RXRmUnBLeUNERGFnSm8tcnZRVXdfQUgyTmdpRHJCbVU0OFJpQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "The Costs of Using the Name \"Department of War\" - Congressional Budget Office (.gov)",
    "description": "The Costs of Using the Name \"Department of War\"  Congressional Budget Office (.gov)Renaming Defense Department Could Cost Taxpayers $125 Million  The New York Times'Department of War' rebranding could cost as much as $125M, hundreds of millions more if it becomes legal name: CBO  ABC NewsRenaming the Department of Defense the ‘Department of War’ could cost up to $125 million  AP NewsChanging Defense Department's name to Department of War could cost up to $125 million, CBO estimates  CBS News",
    "published date": "Wed, 14 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiTkFVX3lxTE1EYm9xanNqSFNBTFRCSUJMNWhRNEJaTVRJZjVVOWJrUnlPUjFSUC1mYjVIMlE3enJ0OTVSdXZLbGlwcm5xVFBMbUlpaDd4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbo.gov",
      "title": "Congressional Budget Office (.gov)"
    }
  },
  {
    "title": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad - Homeland Security (.gov)",
    "description": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad  Homeland Security (.gov)Trump admin drops one-year religious visa wait period  The PillarHomeland Security cuts down wait times for religious worker visas  wng.orgBishops praise change allowing foreign priests to stay in US  aleteia.orgUPDATE: Homeland Security Department says rule will address religious worker visa backlog  Catholic News Agency",
    "published date": "Wed, 14 Jan 2026 16:58:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOZEVpTTFkOHJHZHF6OHpybDNKaXN6SmJ0WGttQ1NiWHF5Q1NGMjBIdWJSMzYzQmxjYWQzRjlPVnJsS2JRNjcwNm1PT2ZzaWhvSXdHMEhqUDNaV3JVUmJJckNMUkVjUUFQV1MyRkZseHFuSkZyRV90WkpaMnNWbzNEMUh2bDVxUm1YSUt3cFlCbHo0ODgzaEczYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Attorney General James Stops Violence, Harassment, and Intimidation from New York Extremist Group - New York State Attorney General (.gov)",
    "description": "Attorney General James Stops Violence, Harassment, and Intimidation from New York Extremist Group  New York State Attorney General (.gov)Betar, a Militant Pro-Israel Group, Agrees To Halt Operations in New York  The New York TimesLocal group accused of bias against Arabs, Muslims and Jews agrees to quit NY, AG says  GothamistFar-right Jewish group Betar to halt activities in NY, state attorney general says  The Times of IsraelFar-right group targeting pro-Palestinian voices to close New York operation, NY AG says  Reuters",
    "published date": "Tue, 13 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPQ3pVZFdFT3lnWjFfeXRqbmZ3SVJES29wdGxmSXZtaTNjWndVcUpnZGplSkxYRWVOMkxmUHMxY3VmcXRXS0lodlVoZHQwblkyQmFsbDN6ZHM1aGt4NDY2bU9ZaGhjZlkwdmpFLV9iemdnd0hGZWpnNkNjMmtUcVJDTUwzMllUWUpheTlEdHBNYnZJc0l2M3k0NFhfLW1pVWw5X3E2elFVVDNvZGJsd085Vw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ag.ny.gov",
      "title": "New York State Attorney General (.gov)"
    }
  },
  {
    "title": "US aircraft that attacked suspected drug boat reportedly disguised as civilian plane - The Guardian",
    "description": "US aircraft that attacked suspected drug boat reportedly disguised as civilian plane  The GuardianU.S. Attacked Boat With Aircraft That Looked Like a Civilian Plane  The New York TimesPainted plane used in 1st military strike in Caribbean was part of fleet disguised as civilian aircraft: Sources  ABC NewsUS faces war crime allegation for ‘disguising’ aircraft in drug boat attack  Al JazeeraDid US military commit perfidy in boat strike? What law says  Detroit Free Press",
    "published date": "Wed, 14 Jan 2026 02:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQa1dhVUVRdU1JUW1pVmo1b29zdmU3cWpOUkRSWHZtaDZubkNDSVhGczRsY1F4NWZDd1dsVXVDdFJCanFlOThiVjcyMFVvTlRuREs0cjQ1MXpFWGl6dktHaU9KN0RMYlZMTkFEdUdRajhNdkN0TUJmUHBLUGw4NWRSdGhackFpcS1aLV9BZ1dFZkdnZWdzY09tcThfWmdRTjBQdkVyMG9Edw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad - PBS",
    "description": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad  PBSWhat Americans think about Trump's military intervention abroad, according to a new AP-NORC poll  AP NewsAmericans not on board with Trump's military interventions, polls say  USA TodayFewer want the U.S. to take an active role in global affairs  AP-NORCSupport for military action in Venezuela is growing though more still oppose it  YouGov",
    "published date": "Wed, 14 Jan 2026 18:26:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNaWNFR2hpYkk1RVdfU0syYl9uZXJkc2FXeVBwOVJzR0xZeDU4cG5FUXd0Q0JpUDdzVjNmTjVpWDNkWTVkYXFjNzc5ZWRESFBJWEJvb2lBTlVEbjR6OFg3YnJYbVdVOXZaZE1yVnhHeXI5VUVkaFlPTzJrOFpnSG12UjNRb2laRzZ5SFNiNWxleDNiZzhmS3NDQ2F6dWZuU0lQZ3Y2VmtSZktTallXN194SGhDUnVyblZJU0pBckVfMHpkZVXSAcgBQVVfeXFMT3k0VjRzcDc0a1g1RUdkOWdlcUxKYlhoY2xJX1Npa2pYbGNSdi1TOHhscjl3TzBFUjg5UWZ6ZC1sNEpEUlBaYXp1M21pUl9fejhoMmV2WU9ydGpsMFNZdi1RbHpVY3BHNnBNRTRMT2otbHl5akFJcXpVeHlNUGJ6Q0VNLVVLQ1VHV3VBZ1dJanRJaVhWVjVUazU3SU9nSFlibGlWNFhrTml5aUpQekFsU25teHhWZVk1ZVREUS1yNktpVEJTUW1Jcng?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Wednesday Snowstorm Will Pass Quickly — But Could Pose Danger - Block Club Chicago",
    "description": "Wednesday Snowstorm Will Pass Quickly — But Could Pose Danger  Block Club ChicagoChicago-area weather forecast: Snow storm blows through Chicago; Winter Storm Warning in effect for parts of NW Indiana  ABC7 ChicagoWednesday’s wind-whipped snow squall accompanied a sharp temperature drop  WGN-TVJanuary 14, 2026: Morning Snow Squall and Strong Winds  National Weather Service (.gov)Chicago area hit with snow squalls during morning rush: 'Blowing sideways'  FOX 32 Chicago",
    "published date": "Wed, 14 Jan 2026 15:30:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQVll6dHNSNG1xZkZXZzllT2dpd3hZdklxYlZndlZOZXczSVJiQTBwNmcxMjNZcHAwTnVTWExNRGNvakU0WVJUcUtyUU50OXlEQTZkcFo2ckthTV9UM3dFc0h5ZTNLd0dINnlWZGdqaEMwcUplZWpkSHVMcDB1UFI5cEJVTUl1aVhqX2F5SENzdUJLZ0xlaWZFM1E1UlRlZlFjMFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://blockclubchicago.org",
      "title": "Block Club Chicago"
    }
  },
  {
    "title": "Food Prices Keep Climbing, Rattling Consumers and Trump - The New York Times",
    "description": "Food Prices Keep Climbing, Rattling Consumers and Trump  The New York TimesTrump picks the wrong time to lie to the public about grocery prices  MS NOWTrump said grocery prices are falling; here's how much you're paying  Asbury Park PressGrocery prices are down claims Trump, netizens ask Grok to factcheck. Here's some BIG revelation  WIONTrump claims prices are way down: ‘We’ve done a great job on the word affordability’  The Independent",
    "published date": "Wed, 14 Jan 2026 20:42:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE84OHktR1NwYXJGZ3RSTjc5bTFNRWRGeUEtc01CMmZqNWY0RF9yXzlvNHdPdnNZMV92ejcxTE1BUVV1a2M4Xy1RV2dHU25hcVk0YmlNZnJEczlWdTBybXZobWhIQUZralpxR2x4LWsyX0t6a1ZQLW5mbFhNQ09XMDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]