[
  {
    "title": "Missing mom of ‘Today’ show host Savannah Guthrie has Vermont family ties - WCAX",
    "description": "Missing mom of ‘Today’ show host Savannah Guthrie has Vermont family ties  WCAXThe Guthrie's ransom demand is in Bitcoins for a reason  USA TodaySavannah Guthrie’s Video Shows a Rare and Anguished Reality  The New York TimesSavannah Guthrie's family renews plea to mother's kidnapper, while sheriff says they have no suspect  AP NewsNancy Guthrie: A neighbourhood left stunned by a crime that's mystifying America  Sky News",
    "published date": "Thu, 05 Feb 2026 22:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYXg1al9YdzJoTVB4eU55NGpCVzlUX2RlOHBGMUZDeTFiUVNqODRONGw2TmVsYnJtank4UDdfaVIyTDdkVnlXaXVYNGdaNWx0cWtmSzBid193bC1sLUJaRXN6R3ItNkRxM05fdnM2b3F0dWxWeVZrc2h5RnlJaldxMFZkZUtYeEpMTjdYNGtUZlNhT0lmSW1QLTZwY29fSDNJbW9J?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcax.com",
      "title": "WCAX"
    }
  },
  {
    "title": "Inside Jeffrey Epstein’s social Ponzi scheme - Financial Times",
    "description": "Inside Jeffrey Epstein’s social Ponzi scheme  Financial TimesFiles Reveal Epstein’s Money Mingled with Silicon Valley’s Tech Start-Ups  The New York TimesTrump says America should move on from Epstein - it may not be that easy  BBCJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Fri, 06 Feb 2026 05:00:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE93cFlJRVBmdTduSng1MmlPQVAzZjA5bHlVdzFnRWFpTlZHSjd3YkNWUGdmQXdqUGJtV3kzOS04SDY5NndSaUFvUllpWmRYX29NY0pDckJlVlo0Tl9WUkFsYmlkcjhsY3JkMVdWeW93bjI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change - The New York Times",
    "description": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change  The New York TimesTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsSheriffs in two biggest metro counties mum on whether they’ll agree to ICE deal to end surge  Star TribuneMinneapolis Mayor Jacob Frey on federal agent drawdown: ‘I’ll believe it when I see it.’  5 EYEWITNESS NEWSTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The Guardian",
    "published date": "Fri, 06 Feb 2026 01:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13RVQtNmJxMVNtbjQ1SE9ZY1FHV3lMMml6VGFDR3JuaVRzMmNMU2ZZd3RxRTdBdFpCM0hlUE5LMjZkVFpLWHFCbmZLaFBBWGJfZTQyTWpZSFY5MjdQZ0I3am5qZVh1Nm9TS2NDV0RPZ185UHpzam1faFB1c3lINWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "White House unveils TrumpRx website for medication discounts - NPR",
    "description": "White House unveils TrumpRx website for medication discounts  NPRWhite House launches direct-to-consumer drug site TrumpRx. Here's what to know  CNBCTrump’s Online Drugstore Opens for Business  The New York TimesTrump launches TrumpRx prescription drug website  USA TodayTrump to launch TrumpRx drug discount site. Here's when  Axios",
    "published date": "Fri, 06 Feb 2026 03:43:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13bmhiSXB0UlNOMV9YZW9fOGdqY01hNHZJMmZyRTF6dUdjREoxTW1mX0FWUGlWbGR3cUdwUHpHUXg1V0dfX0tSYURVaEl4bXpkV0FKYlBLdDVoNDVQZTdsMzRFOURDMXlUeUNJQ1ZPT1NXeHI1ZnpWMnNzc2Vnb1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms - The Guardian",
    "description": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms  The GuardianSenators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown  The New York Times'An impossibility': Negotiations to reform ICE sputter as shutdown looms for DHS  NBC NewsDemocrats' immigration enforcement reforms face rough waters in Congress  ReutersWhat to know about the congressional fight over ICE restrictions, and another possible government shutdown  ABC News",
    "published date": "Thu, 05 Feb 2026 20:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPelU5dmotUnI5TVFOY0FiNEhtOFNQYUFvbW1YYVVCNEJ2X3lvTmwwTDJ4UVM1OGRJQW85eHNac1pXVzBlTVVLbERiMlN2ZVB1TmgzRXoyU2tlbjQzRlhNN2VQallXUWdON1gtbnB3Ykh1RmtNdVdmUmlRc2ptay1DQ1N4MlJrVkdJWUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "AOC and NY House Dems endorse Hochul - Politico",
    "description": "AOC and NY House Dems endorse Hochul  PoliticoNew York City Mayor Zohran Mamdani to endorse Gov. Kathy Hochul  PoliticoSocialists not thrilled with Mamdani’s guv endorsement: ‘Even Zohran gets it wrong sometimes’  City & State New YorkN.Y. House Democrats Unite to Endorse Hochul on Eve of Convention  The New York TimesWith Hochul endorsement, did Mamdani lose tax-the-rich leverage?  Gothamist",
    "published date": "Fri, 06 Feb 2026 04:13:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOeDc3RzVvNmU1SFdHWmlaazNDMkIxNlhkLWY2RVBjUXd5ZW12cjAySkUwMkFrTmZyN2F3NHJJeHk3aDV1UXRiWEZySktJNHlqd0pyYi1vMlIzaFVKcmM3QlU1dG9CM0VXMUR5Sl9wMmRad3FSbHVudTJ2RVJDaU5kTjdDLWN0eWloVWIzM18zMUpHblk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Democrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station - Axios",
    "description": "Democrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station  AxiosTrump promises Schumer funding for NY tunnel project — if Penn Station and Dulles Airport are renamed after him  cnn.comTrump wanted Dulles Airport and Penn Station named after him as condition of releasing rail tunnel funds  PoliticoTrump wanted Dulles Airport, Penn Station named after him — in exchange for releasing federal funds  NBC NewsOne of America's biggest construction jobs halts as Trump defunds Hudson River tunnels  Gothamist",
    "published date": "Fri, 06 Feb 2026 04:06:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPNUc1WFY2ZW5nTmxnM0RxMEtVeXBfSXV3a1BLcnFDb1JQR09ZRWd6T3FFSmZfWmc0c3pCWmtNMkQ5LXl5c0R1SnFpQmFnUlpONEFMbHhwNmNQNmZleXliV3dZd3ZaY05Da2oyR2pvNEJLMFc1dXVfUHFxSlNSODdscFIta1FGSXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "3 dead, several injured after car crashes into 99 Ranch Market in Westwood - latimes.com",
    "description": "3 dead, several injured after car crashes into 99 Ranch Market in Westwood  latimes.comAt least 3 dead, 6 injured after car crashes into 99 Ranch Market in Westwood  ABC7 Los Angeles3 killed, 6 injured after elderly driver crashes into Westwood grocery store  KTLADeadly crash in Westwood  LAist3 Killed as Vehicle Crashes Into Grocery Store in Los Angeles  The New York Times",
    "published date": "Fri, 06 Feb 2026 00:47:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQSElxeHFjY2xmckcxeWdrVkdxaEJWRzZMOWstcFg0RzhaYkphMDNpdGprN0dpQTFYTE50RkFsUE5yT3JQR3loUHRtXzVCYmZGX0xsdXVrQWlfTVVRLVhKcVNzRXFRXzd3eHhLckxTSF9JLWQ5SktQWkMyOS0yR1htUU9aZ0RycUZwTmRELXI1azJtT29NeWZJZVR5Y1NGSFhWNGZCdjliaXdYTGtyeFNRUDVDeWd2RTZvcnlKZmNucw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "New Jersey House Primary Special Election 2026 Live Results - NBC News",
    "description": "New Jersey House Primary Special Election 2026 Live Results  NBC NewsNew Jersey House Primary Remains Too Close to Call  The New York TimesAnalilia Mejia and Tom Malinowski locked in a tight Democratic primary for US House from New Jersey  cnn.comWhat a crowded congressional primary in N.J. says about the state of Democrats  NPRAIPAC Donors Flood Last-Minute New Jersey House Pick With Cash  The Intercept",
    "published date": "Fri, 06 Feb 2026 04:21:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNRmYwM2ZDVHVwZWdrd3dBNkZLTG95RnhRR1ZmR09sRnJkWGRwM1BOZU1ubUFpSy1SdnpqNC1QdC0xY2szN09sdmVCVmkySjN6cElrNmszWVYySG5xRmxWak5FTE9ISWJYbVVTcVpFaS03eVdRaXBGWlk1Q0RZTC1DQnNnNlExYWtrb1VYckFtcG9iZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Donors give over $3 million to boost tech-friendly California governor candidate - Politico",
    "description": "Donors give over $3 million to boost tech-friendly California governor candidate  PoliticoA Democratic Critic of Newsom Will Run to Succeed Him  The New York TimesAre too many Democrats running for governor in California? Republicans see an opportunity  ABC NewsWith primary election four months away, race to replace Newsom still lacks a front-runner  latimes.comSparks fly as San Jose mayor fends off rivals from left and right in first gubernatorial debate  The Mercury News",
    "published date": "Fri, 06 Feb 2026 01:48:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE16QTVVcVFpVDI2SFVNTDVKUURETGN3RWppY0QzcmFFQVVBY1lnaE9iSnVGUDc2dmx6eHM3amlGZF9zTzZLRlZaZ3ZITTRyOTUtMnZvNG91Y1Z3cmNVTkJVRzFlRFRsdDNyVHVOLWhZQjVLeHM2MHNscWtZU24xdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump admin moves to finalize return of Schedule F - Government Executive",
    "description": "Trump admin moves to finalize return of Schedule F  Government ExecutiveTrump Strips Job Protections From Thousands of Federal Workers  The New York TimesExclusive | Trump Administration to Make It Easier to Fire 50,000 Federal Workers  The Wall Street JournalTrump administration advances plan to strip job protections from career federal employees  Federal News NetworkTrump administration plans to reclassify 50,000 federal workers, making them easier to fire  cnn.com",
    "published date": "Thu, 05 Feb 2026 22:48:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNUkhWcnNxRlR2NVA1ZzVVUFpmdlVGSU9CQ1R0OG5Kb0xNdExmdTIxd0hFcVIwNVNWOEdyYzB5R3FFWk1xWDB6bV93NXlMMDhKbWZkbkVxMWZRVy01RTlFRUM2WmZocWNvb3RZVmNnbkUwQk5qUE5ZQ3RpbU1PYUI2R2tRalJ3cTJ0N1VWT3g5VkVDVnBIY01pSXNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.govexec.com",
      "title": "Government Executive"
    }
  },
  {
    "title": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms - The New York Times",
    "description": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms  The New York TimesVirginia Democrats propose congressional map that could boost their party in the midterms  NBC NewsVirginia Democrats release long-awaited 10–1 congressional map  Virginia MercuryVirginia Democrats show map to counter Trump redistricting but its future is unclear  NPRVirginia Supreme Court will hear redistricting challenge  Politico",
    "published date": "Fri, 06 Feb 2026 02:56:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNF9WcUh4NVNuaEF1Y0Fib1R4aTVjel90S0Z4WHJmLTU4R3A4bHprVGhoOTVZZmowbjZwMlJMOXRMNy1QRXdXdzRBVEN4QnJ5eGo3LWFtLVFuNnllX3hXUWk0SmllbjEzOVVBOExSME8xa21MSWEtb0daZ3I5cnVrV1FMZXVaenpsa3czekt5YjJhZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "description": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid  ABC NewsTulsi Gabbard went down to Georgia — and no one in the Trump administration wants to take credit  cnn.comTrump says Bondi directed Gabbard to attend Georgia raid  AxiosFulton County challenges FBI’s seizure of its 2020 ballots in court  PoliticoWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – as it happened  The Guardian",
    "published date": "Fri, 06 Feb 2026 04:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOd1BfNC1kZjU4Z0Z5N2VCUG1zX2VFZXpDOTFVdTk2VU8xVV9FRW1XRXZETjBWMjBVYjROZ21EMm1DNHZQZWx1N2MwNmRqYXY5eTBqMDVMZ1hqSEZpNjc1enUtV3FMY1VNN2YwVGxwOGxtelBrTEVGaW9fUklhYVFtNG4wbUF1Y1dtdWEzWnIxNEROTmVwX3N4NjN2bDZneGZUZ1gxSTlMMDhBdE9S0gGyAUFVX3lxTE0wOThjeV9OU1llYWRBVUtnaWdtMzAwMngweGlOQjA2MGN4MFFWVU11cGVCaUdsX3AxU2tBUVp2d1dadjY5cmwyUVY0YW5ENG52aFFtcVFiMU9xWVlnRnQzWnRHaS1EUFNQOWc1R2ZjUnBPbUh2SDZNZmNDTG5IN2swR2VPRFBvNTFRTmxFeW9Zbmp0ZjFjNDRuMlBFTHVITDZyOXFzNlZuMWNGbmcwSWpxVkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration - Axios",
    "description": "Scoop: U.S. and Russia agree to observe New START nuclear pact after expiration  AxiosA key nuclear weapons treaty is ending. It’s a sign of Russia’s eroding superpower status  cnn.comTrump rejects call from Russia’s Putin to extend cap on nuclear deployments  Al JazeeraExperts debate whether U.S. should extend its nuclear arms treaty with Russia  PBSTrump says he won’t extend nuclear arms treaty with Russia  Politico",
    "published date": "Thu, 05 Feb 2026 13:42:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB5eUdzWFhsVTFZODh4RXpZMFJ6T0o1TEx1TU1kSWhNMjRwUWdVNHFldDI1T2c4UjUySzQzYjN4Tm4zYm9WNXUwMnBUcXItdGpDQlN2bk41R2p4amx2Vzl4dWhPNTdVeHJreTBKcl81bmJnZG5uczNpNFhBakw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "DHS’ problems go farther than Minneapolis. Republicans are noticing. - Politico",
    "description": "DHS’ problems go farther than Minneapolis. Republicans are noticing.  PoliticoHow bad was Alex Pretti’s killing for the Trump administration? New data tells us  cnn.comNew national poll shows most Americans want Kristi Noem out at DHS  MS NOWMost Americans support independent investigation into Alex Pretti shooting  AxiosUS House Democrats call for Kristi Noem’s firing in rally outside ICE headquarters  News From The States",
    "published date": "Thu, 05 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQYU9iMk5jSGk4aURQWmhzQWxQMlBxOTFTbW1yOHhZdjNJakdleVFGUUdaLWhDVWpRWS1Ndzc0VGdoU3NkZk9ZSWtxUlc2M3BMRjNHdmt0SklOZDZiMmIySmxtbm1ZQjNyaFJyMHZGakRMcXlRYkNtcHJjdHBjbmxlWG83SFNLQndLX3hxcEg1RXkxLUMxZjlWSTNCekhXU0pkYXZaZldjVU9LdDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Lawmakers Say They Will Not Cooperate With Inquiry Into Illegal Orders Video - The New York Times",
    "description": "Lawmakers Say They Will Not Cooperate With Inquiry Into Illegal Orders Video  The New York TimesSlotkin, Houlahan refuse to sit for DOJ interviews over ‘illegal orders’ video  cnn.comDemocrats involved in 'illegal orders' video say they won't cooperate with DOJ probe  NBC NewsSlotkin rejects Justice Department request for interview on Democrats' video about 'illegal orders'  AP NewsSlotkin declines DOJ interview request in ‘illegal orders’ video case  The Washington Post",
    "published date": "Fri, 06 Feb 2026 00:08:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQYVl5Qk1BajVCLW5iTGstRHUxMjlmS1l4MlVCdnk2WGY4ZkV5dmVIY09CQ2hUOG56VXBSeElYNlFWNllYNE5EZG1xRTA5ZVhNdDB0Q1lvQklsNEZHblZOLVRJQUNLWkFBbW91YUhDOW1YQXpMU3VPUkFKb3dwV2pZZWdZQ3d0ODRFellOX3ozR1JwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks - Politico",
    "description": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks  Politico\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosHomeland Security shutdown grows more likely as Republicans rebuff Democrats' ICE demands  AP NewsPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News NetworkGOP game-plans for a DHS shutdown, as skepticism grows over talks  The Hill",
    "published date": "Thu, 05 Feb 2026 20:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNQkpMTzk0SGJpRlYyMnVfWHRjODlLeXFqU0ZERWtVMElhRDdFNmhpNEdtT3hLYnNtM1pVYnNPVVg4eHdoei13S1ZlNXd4dUpDTUotUjQ2N2VwSFdHcEw4ZUlvNi1tYkZmTEtkenFKelNvWXF3VnU0VXg3WGVCZ004YUxFUm9jMGhWaS04clFtaXliczZ6U2Noc2lIUzltMjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - DW.com",
    "description": "Why Trump and his Republicans can't take over US elections  DW.comTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comTrump’s comments on nationalizing elections worry Colorado election officials  Colorado Public RadioTrump wants to ‘nationalize the voting,’ seeking to grab states’ power  The Washington PostLocal officials push back on Trump's threats to 'nationalize' elections in targeted cities  NBC News",
    "published date": "Thu, 05 Feb 2026 19:20:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games' - CNBC",
    "description": "Hillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'  CNBCClintons keep pushing for public hearings as Comer digs in his heels  PoliticoEpstein files: why is Trump defending the Clintons? – podcast  The GuardianAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsIn Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent  The New York Times",
    "published date": "Thu, 05 Feb 2026 20:00:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQeEM4MU9QR3V1X1Y2Z3dCRnBtY0d2djhRSmdsbExZbFhfWk1kcGRGcTRyblZraXkzLWRqN1JBU0VXVi0yS3hVeWx5eGlYRkJoeHU1T0ozUFQtTnVzZXI1M0pqZkNxZjNpc19ER3VqS0xSNTh2ZVQ1ZHAtNVdmX3d0cUdtZmJTYWZEU2M2U1MyeTNYb1RYTC1r0gGcAUFVX3lxTE53MTNpR3RiaUU1YnlhTjE2ZGxCUXhxRExoTkpMa1NEVHU1TW12OXl1MnJVbGdtNlB2T3g4cGx0M1o0aEw5M25ZUTNSRGUzT3FSaHZEN1RsbU5vSXNweWJhUDBYQ3pvUE1KZ2tZamVMSjFhUFBRTDZOU2J5TC1VRVhtWExpZjFGN0NSMFBPTFBwSS1XNTlPMFZ6UUF5QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield. - The 19th News",
    "description": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th NewsCompany lays off Haitian caregivers despite court order protecting work authorization  GBH‘This fight is far from over.’ Ohioans react to federal judge blocking TPS ending for Haitians  Ohio Capital JournalOhio’s GOP governor: Ending TPS for Haitians would be ‘blow to the economy’  The HillOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York Times",
    "published date": "Thu, 05 Feb 2026 20:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5GVDZFcTVPS3dZMGt2bkZTVHAwVkYyR1dkU0tvbXlpdTdXc2hUZkl0N0JndU1BNVBLMF90TnlEVlJsN2dERjFqaEtTM3pKUUVMUTUtWERmU2RNUmlZd1JITjg1UUhUbVZWeHptYW01SUtGdmYxcVV2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "Coldest air of the season, snow to hit parts of the Northeast - ABC News",
    "description": "Coldest air of the season, snow to hit parts of the Northeast  ABC NewsNew York City Forecast to See More Snow and then Bitter Cold  The New York Times'Coldest air of the whole winter' in forecast. Blame the polar vortex.  USA TodaySnow, below-zero wind chills expected for NYC area this weekend: See latest forecast  FOX 5 New YorkNew York is locked in a deep freeze. Here’s when it will warm up.  Times Union",
    "published date": "Thu, 05 Feb 2026 17:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOSFcyWm1pZTZKUTl6VFJFc3JzRlRRcFdZOXQ0clRpbGN6dmtELVpWRGRkNGVqMGhsTE1uUFo5WUR1M1gyelJ4WDhVcXA1WlFIejZrUldiSU9fSHRJQkFXN1BibTc3OXZSaDM3VUN3bnJ1UmVYXzJudnBHdm1WWnotVHd3MmlvdkJvbXhtbGZJaHFWUdIBlwFBVV95cUxNNF9EWVJKLUs3VzBfYzRqdEpkc0FmcTlHZ3ZCZFZ0Q0g1UXYtbUpPdldyckpvVEF0andsSHd5N1ExQ1A1VUoyOFQ5VlpDR2hWY0JzUk14UG1MWVktZ2ZOYlJLQmdEai1BMTRiT0NOWkZsXy1ZU3ZHc1ZLb1VFYUhCa3Ywa1FPN3kzb09DcWdueXU5SXVlVEZV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos - MPR News",
    "description": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos  MPR NewsFather says 5-year-old son has nightmares and wakes up crying since immigration detention  NBC NewsA judge stands up to Trump, delivers a win for the rule of law  The HillFive-year-old Liam Ramos and his father released from Texas detention center  The GuardianIn Under 500 Words, a Judge Weaponized Wit to Free the Child Detained by ICE  The New York Times",
    "published date": "Fri, 06 Feb 2026 02:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQSUM1S2QySXY1cjRFdFdxSUNfczdQbTRaUzdYZFp2NEFyc1pSU21RSHVTVmFTZWpkMGN4eUl1eXBydVplb0hyWHJGbnF4Y2FXN3cwSDBGTEh2cWlkN3JzVEJ3bkhkSlNQN3JnWUFzUkJFQTVsenhVOHlfakZWbUxWSWl2MExOYUtnTEFTaGJ1bVc2X0FxMUhJQmhTTEs3dlI4MEtWdzE5UGxKVWNsaFUyekNpVjVxYk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Chairman of major US law firm steps down after Epstein files release - BBC",
    "description": "Chairman of major US law firm steps down after Epstein files release  BBCBrad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout  The New York TimesTop lawyer, art world exec resign in more Epstein files fallout  MS NOWChairman of major law firm resigns after Epstein emails become public  cnn.comExclusive | A Revolt Inside Paul Weiss Over the Epstein Files Took Down Brad Karp  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "White House ‘can’t guarantee’ ICE won’t be at polls - Democracy Docket",
    "description": "White House ‘can’t guarantee’ ICE won’t be at polls  Democracy DocketSteve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoWhite House ‘can’t guarantee’ ICE won’t send agents to midterm voting sites  The IndependentSteve Bannon calls for immigration agents at polling sites during midterms  The GuardianTrump has no 'formal plans' to deploy ICE at polling sites, White House says  Reuters",
    "published date": "Thu, 05 Feb 2026 21:32:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQS0c0OUdLQ0dGVUNQYXdJcGVGN1JlUFBYbERYeUV1QnI4NnlaYjhaYjdLck1qdUFmbVh2N0hUZGlOYzJCdzVmNVRWUkZZMFljdFNHd1FoamxJSmVERC12US1qYmN2Wl9ONjVmb19yOGw0UGM4N0hLTTlVZFBQbnNRc0JyaFVVTE5tUUJBeXl5eER3YXJvenNZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba to introduce plan to address fuel shortage amid US blockade  Al JazeeraCuba ready for US talks ‘with no preconditions’ as energy squeeze bites  Financial TimesWhat a Deal Between Trump and Cuba Might Look Like  foreignpolicy.com",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US and Iran talks brought back from the brink after White House relents on move to Oman - The Guardian",
    "description": "US and Iran talks brought back from the brink after White House relents on move to Oman  The GuardianU.S. and Iran Gather for High Stakes Nuclear Talks  The Wall Street JournalUS-Iran talks live: Critical talks to begin in Oman in push to prevent war  Al JazeeraUS says Trump prefers diplomacy with Iran but warns he has military options  ReutersWitkoff and Kushner set to hold negotiations with Iranian FM in Oman today  The Times of Israel",
    "published date": "Wed, 04 Feb 2026 19:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbFdEdGc0cVJSNzBpeFdZSEpJQnVDU3Y5SlhfY0RzcFJIeVQ3dkQxOEU0X21KN0s4ek5ieHZieUpVdW81WHVKZ0JHY0FUUS1MLUdSYlBTb2pWRnltY3RFM3pCbHpPWjZzSDR6U0hpU3BaSTZ4TnZPREZOTFdtUmJLM043aTdlRFVKY0x5cklYaTRjWkVNUnpF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show - The New York Times",
    "description": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBCMy Life Among The 33 Pomeranians (And A Few Thousand Other Dogs)  DefectorPhotos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPRFort Wayne Yorkshire terrier wins Best of Breed at Westminster Dog Show  WANE 15",
    "published date": "Wed, 04 Feb 2026 17:37:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOdGdOV3EyZWtzVndlek84NmR1ajZPWHFhODlkVVpVaDRaNk15aGFKanAydEJwRTg0bE9rUkpqNDFBcmdjQXhoNjlfOUctRG9kR3RtT3JqYVdTN1NVSUJiNjJNZUJyajA4NTk3QXYwS2M2OXU5bmZMd3o4ZVRoaXMyVmxHSWlqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown - The Daily Beast",
    "description": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown  The Daily BeastOpinion | I Was Arrested for Doing My Job as a Reporter. Who’s Next?  The New York TimesFederal prosecutors in Minnesota are cracking down on dissent  The EconomistDon Lemon says he offered to turn himself in but federal agents were sent for him anyway  cbsnews.comDon Lemon arrested after covering protest at Minnesota church  NBC News",
    "published date": "Thu, 05 Feb 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNM1NZQVFTZnJkMlQ5ZW5nUEJ0eUJMWUYxT0VaYTZQbFFyRS1oYTRTM0Z3ZWxhT0JqME9CMm5oRDJNaS1ySFIxNnA1b1dNZWdsdGFaUnd0eDdyVktXTVdhZ0pMV2x1S0lxb1Exd0g3bi1GR00xWl81VUlUdmxLQnFvblZST0Z5cVAwcU02RTlXX04zcjFncjFoR2RpbkEtV0hwOTJ0SFhxeGJ6M0RhamJN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsUkraine-Russia Talks End With Little Progress and Hints of Impasse  The New York TimesUS and Russia agree to resume military dialogue after Abu Dhabi talks  Euronews.comUkraine war briefing: Kyiv and Moscow hold major prisoner exchange  The GuardianRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBC",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Vance announces price floor effort for minerals - The Hill",
    "description": "Vance announces price floor effort for minerals  The HillThe U.S. calls for trade bloc to counter China's leverage in critical minerals  CNBCU.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalMP Stock Is Tanking as Vance, Rubio Talk Critical Minerals  Barron'sTrump’s Hot New Critical Minerals Club  foreignpolicy.com",
    "published date": "Wed, 04 Feb 2026 22:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPOXJCZGFlOXliV3FZN0ltVmk0eTE0dWlYazB5eGJtYW5veU1ZNnRsVm05Mmp4eDU5WTJCQm5WVldudEIwNlB5MXcyQ1A1bFgwR2tLaGk0Nk5ieG01cHJyQV92a1Z6UXpuWjg2UGhmbUt4ZE54ZXRyVlN5cWg5ckhtWDJkajJEVWZpMXhkV0lzZEZQZ3lHUWZLWHJhS3NiRkR2ejd2WWVkWl9DRGvSAbABQVVfeXFMTzhVOFZneGxaQ3IyM1U0MTdDMEFRYW91alRVTk9pc0o3NGhPWndMQVgxV2U1V1NodDI0WlpFajFib0x2UG1rZm5WZ3pmRlVFRHJkZ3FRQlpycW05eFl6VTZVaXlDTWdWTUYtX1dJamFBd0pjZTZWUFhYR2k5R0hLVHllYzJnN1htdnEzeG14WDBHM05Ld3dScW5oX2VhY1ZSQ29EZnJjRXJnRmhoMkxMOWI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehill.com",
      "title": "The Hill"
    }
  },
  {
    "title": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms - San Francisco Chronicle",
    "description": "Supreme Court leaves California’s Prop 50 maps in place for 2026 midterms  San Francisco ChronicleSupreme Court Clears Way for California Voting Map  The New York TimesWhy a Republican Supreme Court just handed a victory to Democrats  vox.comSupreme Court clears way for California voting map that bolsters Democrats  The Washington PostThe Supreme Court lets California use its new, Democratic-friendly congressional map  NPR",
    "published date": "Wed, 04 Feb 2026 20:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPOG5mbjN5REhFbmN6bFFxcF81X1I4Q3pjYjBUOV9hN29YZ25odTdkZE43QjlOeG83cm44TjRRV1Z2MVlHVktkWWRGbGhsZVVOSWJtNEV4c3V4U0lGeWxKT2tQVzZsby1GWWJHajBkV2dfRHBjVHZ3M1I3b255OWI1VnR2X0kzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack - The Times of Israel",
    "description": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  cnn.comAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsTrump's objectives in Iran are unclear ahead of talks, sources say  NBC NewsU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street Journal",
    "published date": "Wed, 04 Feb 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOYUd2cnExc1BUZnplc1BuSE0tMENOaFBoQktsUVIzT2tjVF9Od0QyZ1RJMUFVRFNTLVBMX2ZCMDd2QXE2Qk5lWkItXzBkaU1MQ2FkeHZFWlBYenh6Q3k3VFJKVkpFUmlsRVBxSlVNS0Vld1VSZlNEVmxJS1FZOVBKN0F6QWl0RE5OZ28zeUJZMHduVWw1dXI2d3VsekVfZ041em1RLUdsNWdqekZlel84ONIBtgFBVV95cUxPaWpnQlpoZmItYl9TTS1yQVBleE1HMUctcFJPU0d5d3Z3TWpsOVpHZVMxcDdSa3FfMkZyeG1RNTdkaXBJSExwbS1Eczg4TVdoRFBXY1BKeGhVZnVxM2hFUDNSTVFFb0pfT3NzUUpFVXdFdjQzOXNualUzWmtVZnlXeHlCcHBqU25zdjhKSlVtMWMyYzc3amhMOEZ0c2VEc3hEblI2S1lhTlJqODExNUNrdzkzVG4xUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  latimes.comSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostCalifornia Dems lash out at ICE during gubernatorial debate  foxnews.comDem CA governor candidates seek daylight during first debate  Sacramento Bee",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico - Houston Public Media",
    "description": "Texas Democrats were united after upset victory in Tarrant County. Then Allred lambasted Talarico  Houston Public MediaTexas special election emboldens Democrats heading into federal midterms  The Washington PostWhat a Democratic upset that sent 'shockwaves' through the Texas GOP could mean for November  KUTTexas loss delivers stark warning to Republicans in critical election year  BBCWhy Democrats’ upset in a Texas state Senate race is a big deal  cnn.com",
    "published date": "Wed, 04 Feb 2026 21:35:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakNLdVNVRWRJdmhPSUppRTlrdmZqTFdPY21pMk1ZSXNWX0lIWXowaFgtSFVTYk9kVEd3cUh3NEdoNngxVjdMT0FPaUFHYWt3MTdMSXV6NjVTSzVORGRIWVdhcVZnMVlIa0lUYnZyLWxLbHNrcnVKOEpuamJiNW55Tk92MU1aWmJBbTZGR1pIUUEyUTZod0JMMXZkU0tkdFJDTTNzcGUxSlcxY0xVcWg4UHF1UUJIZ3dMVkFuSHExSFEyRUI1eWtNbk84UdIB0wFBVV95cUxPMVd1blgySThkZE8zU1hEVW9VdlZFck9Za3dYS1FrbnV6bWYyRmRYcWNjWXZPRnNJUHcwVDAxdENqUk5kT01UeXU3V3hLXzNvaDZrRk5Nd0I1bzI2dXp4dmRyWWxpOFE3SHl3OHprcVltVnFyZmFudGFkU3l5WGR0YV9kN0Z5cmVkZG1FNjRrTEhCV0taQmVCVkctUzVFNkM1Qy03ZkNsZzZORlRsMjFGclBFNmJhdFRzNllQYlp2blVPdWRMc3lEX19jMHR3N3dKcHlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.houstonpublicmedia.org",
      "title": "Houston Public Media"
    }
  },
  {
    "title": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches - AP News",
    "description": "On Capitol Hill, Treasury Secretary Bessent’s testimony descends into insults and shouting matches  AP News'Can you shut him up?' House Democrats clash with Bessent in fiery hearing  ABC NewsMaxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  cnn.comUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  ReutersTreasury Secy. Bessent Testifies Before Congress  C-SPAN",
    "published date": "Thu, 05 Feb 2026 01:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQX25WazBtYTNNSFFadkNYNXVmU1g1OVo2ZTVpMnJsZm92dmhQblN3YXdRaHVadzhCTjJjNTVRczY4OU9MdzVvbFpCbkt3UUs3MHM1WHFUNTF1RVJ5NjRTUHNkWlRZUGVjNWQ3Z0V6dnlYckpKU2Iwa2hLRzYtOEgwekI2Q290bG9Kdnhud0lON0NQc2lUQVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida - cbsnews.com",
    "description": "Ryan Routh sentenced to life in prison in Trump 2024 assassination attempt in Florida  cbsnews.comRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesAttempted Trump assassin Ryan Routh sentenced to life in prison  ABC NewsCongress faces tight deadline to fund DHS. And, Ryan Routh faces sentencing  NPRWould-be Trump assassin sentenced to life in prison in Florida  Politico",
    "published date": "Wed, 04 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUkR3RU1fOEs3eVVBRGMxZnRYckZmclB5aEN4MVowRDVZU0x4X2pock8tTFFaT01JVUZ1c1VMS29qcWhyMjRuZFMzRlliZUsxb0FjbmdjMzkwaVRuV21paUtxaE1FZ0hfVVI5MGdaNjE0MDlUUGd1dWdQU3l5VURHUE1UcjdYUlBFcFVQS0FKb9IBlAFBVV95cUxPMUhweVBsNFVDRjBXa0VaV0xHNFVnOVlabFA0UER1OVQ5RlJtYWtpU0g4TU5CRkJyT0hKRDExME5ZekFzWDZkWlJEbmhQdzctem05czdSenItVEpIUTJDVFBvSldIZlYzaFVjRXEtSWNGNndsU3p4WmNUREJQYUFsSWxDaTBVb0lXQ2xNU2dNZ29CVEFK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "House rejects D.C. tax changes, potentially costing the city $600M in revenue - The Washington Post",
    "description": "House rejects D.C. tax changes, potentially costing the city $600M in revenue  The Washington PostHouse passes measure to force DC’s hand on tax cuts  PoliticoU.S. House votes to overturn part of D.C. tax code  NBC4 WashingtonHouse approves bill to prevent DC from opting out of Trump tax cuts  WTOPRepublican bill targeting D.C. could create tax season chaos  The 51st",
    "published date": "Thu, 05 Feb 2026 07:19:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBXbHBBYmJFdTgyWDd0Y3pDWkpHSExpNW5hT0ljdHZzM3ZVVHNLZnhMM0tLRlo5Z1RuNS1WQjJGazlIeVhkM2V3YjdBWExrdzhYVUZWRGVjQjYyWGpwek1TME1vZlhWTl9yeDd3Zk80c1JwZEN1alptUFdGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "S.F. teachers on brink of a strike even as fact-finding report favors district - San Francisco Chronicle",
    "description": "S.F. teachers on brink of a strike even as fact-finding report favors district  San Francisco ChronicleSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoS.F. teachers call for strike Monday, city’s first educator walkout since ’79  Mission LocalCalifornia faces teacher strikes across state for better pay and work conditions  The GuardianWith strike looming, SF parents’ loyalties are with teachers — for now  The San Francisco Standard",
    "published date": "Thu, 05 Feb 2026 01:51:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTnRqVWctVGx4dkhuNUdjOG01U1lRRHdZU0dELWE5YktudTZqYlN0aVZ6ZWl6QUhSTG1temlhN0RBWVp0RmEwWUdsb3BqUEsydjJ0c2s4ZUVGNUtUUU1ITElpTk03WWRUVVdoRnNMcFpSQXhiWXhEQXlpWDdnSTROYS1JV05fbjA0dEozSWViQXRRX2tVT242UFpPUTN3U0hYLXpvRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Jersey City Faces ‘Staggering’ $250M Budget Deficit. Solomon Slams Fulop - Jersey City Times",
    "description": "Jersey City Faces ‘Staggering’ $250M Budget Deficit. Solomon Slams Fulop  Jersey City TimesJersey City Faces a Stunning Budget Deficit, Report Shows  The New York TimesBudget  jerseycitynj.govN.J. city says it has a massive $255M budget hole and its ex-mayor is to blame  NJ.comMayor Of NJs Second Biggest City To Take $1 Salary After Finding $250 Million Deficit  Patch",
    "published date": "Wed, 04 Feb 2026 19:39:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQeURhdTVGTkprYTVUX3lPMmZyeVVnMnhPR1ZjczVhVHI0M1RVczRhRWQ0QXNhdDNjWktZcndtYmlMeUpTTWkyM3Vkc3pielNrdHNBWjJoVHE3ejFUd2hudnBTWGlKZG1OaG1Hc3VtbUhOREhSTnN5Vk5aRmU1RlQ2S0dvcDE0Sk5EbzY3R0o2b241X0FwLVJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jcitytimes.com",
      "title": "Jersey City Times"
    }
  },
  {
    "title": "Woman killed, man wounded in shooting on South Side of Chicago near St. Sabina Church - cbsnews.com",
    "description": "Woman killed, man wounded in shooting on South Side of Chicago near St. Sabina Church  cbsnews.comChicago shooting: 2 shot, Gabryel Ayers killed, baby unharmed in vehicle on South May Street in Gresham, crash, CPD said  ABC7 ChicagoAuburn Gresham double shooting leaves woman dead, man injured  WGN-TV2 shot inside vehicle near Chicago's St. Sabina Parish, one fatally: police  FOX 32 ChicagoIllinois Quick Hits: Reward offered in Chicago shooting  Yahoo",
    "published date": "Thu, 05 Feb 2026 05:51:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOWmRyMFVTUmVMSnVwZHdxcmZyZ2Q5YThtUEdvUVBCMzB3bVFIQ2tiZ1prVUlCV2VaTnVrOFhXSjZIVUF2NWtUdGdOR3RwejFCcnZlOEtKSXpuRThESDR1YlFIX2NWOFdpNWtNXzJ6RmVXd3NNcGg3dDRFczZjLTl4RnBMbW9BMEhyZmR5WmFNOE1sYjhRby16dQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Parents of Evergreen High School shooter won't face charges, sheriff's office says - 9News",
    "description": "Parents of Evergreen High School shooter won't face charges, sheriff's office says  9NewsEvergreen High School Shooting Investigation Complete  Jefferson CountyEvergreen High School shooting investigation closes without charges or answers to major questions  9News‘I feel like we got a slap in the face’: Parents upset with Evergreen HS shooting investigation  kdvr.comEvergreen High School shooter used family heirloom gun; parents won’t be charged  The Denver Post",
    "published date": "Wed, 04 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxPM3pJSXhsVkdnNG1ySHdtV0l5ay1adlRhNUFnRElPVk5NVjI4TUJub0RBb1RLSHpWcDlWTnNaWXRvOEd1TzJfUnpFOEllTWpqMnIxeC1UQUI0M1N1OE5kazFsajQ0ZXdMWFFpTE90ZmItb2xIQjdBZ0lfT21iYTJNWndVQ1dnVGUtSkFpclVVSnZRajVseVIzbjk0ekNUYUhBQl9CZGFoYzBCelI5UHhFckZ0eXNTdjNSWWtfZG9aVGlqRTNqbkFjbU1BV25VdUstQ19aanU3ZUZoMjZFQWdCNHEzVmFFOXdMMm5xNUFrbGxnVzBMQjdxTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.9news.com",
      "title": "9News"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - AP News",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  AP NewsICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesFederal judge blocks immigration agents from making warrantless arrests in Oregon  Oregon Capital ChronicleCongress must hold the line: ICE cannot be allowed to break into our homes  The Hill",
    "published date": "Thu, 05 Feb 2026 03:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPQXRWY05fTzFjT2tqWEJ3eDJxNnBxZ0t3YkszR083UG1oc0tvT0R5WUIzRmo1SHBac2pTN09zelUwZWg2YU56M2JTQmFSOXRWYldnczJIRnMyUW1YQURZaW5ua3F1aC1QeUdxOTBtbFJUWFV4eWFZUlpwbVVJaDNVQ3NuUmJtNUo5WTZhenI5dWRUZ0Fnb1d6WlprX3JYTnV5X2sxOUlmRHM4eUtXX2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasSuspected biolab discovered in Las Vegas home sparks federal investigation  cnn.comMeet members of the expert team that responded to the suspected illegal biological lab found in Las Vegas  ktnv.comBio lab found in Las Vegas is similar to scene discovered in California, raising questions from officials  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal - ABC News",
    "description": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsOpinion | Calls to ‘defund ICE’ are horrifying  The Washington PostTrump’s deportation push is scrambling New York’s suburban politics  PoliticoPoll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement  NPRHow public opinion shifting against ICE may affect the DHS funding showdown in Congress  PBS",
    "published date": "Wed, 04 Feb 2026 22:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWlhVUnpBRVVkTE9pNTdMdlpxTlBob0puN2wxQ0RRcU42WWVobGt2M2drclB6OVJyR05QV3BKNXNrdUUyZjdEWi1mVE5rOWhkLUg3aTZ3T2pheGdNRFNDTEJMb3RZODBxcEtZUVBrYXZ0NEgyb2ZGeHl2bkZvNFNoU1ZfSzFEZ0ZMdVhib0tXbVpWT3VhVTJqVDJERjgzWllUYThR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university - The Independent",
    "description": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university  The IndependentTexas A&M professor files lawsuit after firing over gender identity lesson  ABC NewsTexas A&M Lecturer Who Was Fired Over Gender Lesson Sues University  The New York TimesAn Instructor Was Fired After a Viral Recording of a Gender Lesson. Now She’s Suing the University.  The Chronicle of Higher EducationTexas A&M Professor Fired Over Gender Identity Lesson Sues To Get Her Job Back  The New York Sun",
    "published date": "Wed, 04 Feb 2026 21:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMDM1bU1zSkNTTkdKc08ydzZsMWNZYU11emFFUGtoU3pXOVBkay1qalNpSzA5c3MweFFyNzM3alZHOEVoNzRzQnh5S3UybGZyRGtaRXgwZDdfN3ZUNFVOX3RwaU13NkZlbmJXNEpNdXhKU2xoZ1EtLXVVWlhZMEdVemFqSGhMeWM1NG1WMjlHQzFnbmN2YXV2TUE1cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.independent.co.uk",
      "title": "The Independent"
    }
  },
  {
    "title": "Spanberger orders state law enforcement to exit federal immigration agreements - VPM",
    "description": "Spanberger orders state law enforcement to exit federal immigration agreements  VPMVirginia governor orders end to state agency partnerships with ICE  The HillMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.orgSpanberger takes further steps to remove Virginia from ICE operations  The Washington Post",
    "published date": "Wed, 04 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOLTNVOWxjYXFzYkZUdFNtcHhJOXAxUkhPQ0tVb1JLS3pMSktqX3pTU1MxS1ZTck00ZzhtY1FlTGZhOU1CaFZEYWQ3MmhLYjROWkttY3BaejRnYVk4OWxiRW1KY0hsVWZsOGRuMFBzdnA3S3VaaHJhTEx5OWpoX0p6M3NGOG9LT1gzUVNPUmhqeU12V250UFRhOURRRDMycFFNMU8tbHFvTlpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Federal lawyer tells judge ‘job sucks’ amid overload of immigration cases, court violations - Star Tribune",
    "description": "Federal lawyer tells judge ‘job sucks’ amid overload of immigration cases, court violations  Star TribuneTop Minnesota prosecutor says ICE cases are sidelining ‘pressing priorities’  PoliticoTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  cnn.comSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York Times'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC News",
    "published date": "Wed, 04 Feb 2026 18:22:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQVkVZUk5XVVRjNFNzcVEtb3pMa0hLVWhXcC1wRG5VLXFCMVpBYlJfYm1jX1VydVdlT0d6dTcyTFR0eXkyNkoyUF9GS3BYemU4bDdsS3pWYmhINFVIOXNRSlFYRk5UbURqdUJxMzZKc1dDa0dOY1VSVGdpeWJTcmhXNDN4V0toUTFsTXpuU0NfbWVsU25yaHJTNkZpeTRtNkVoMHZCVWhIVlRjclFhYnNBam5KSGhXUlVxVXRtRVFVTEM2RXhQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers - HuffPost",
    "description": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers  HuffPostTrump shares his plan for the $10 billion he expects to receive from his IRS lawsuit  MS NOWTrump’s $10 billion lawsuit against the IRS raises conflict of interest concerns  AP NewsTrump sues IRS for $10B over leaked tax returns  PoliticoTax Filing Deadline May Be Pushed Back, Bessent Says. No Word From Trump’s Team on His $10B IRS Lawsuit.  Barron's",
    "published date": "Thu, 05 Feb 2026 05:21:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZXh3OFpsdm5GYXEtTUJaVVVQTW5rc2lCdDFpNWV4ZUpyZVpRdU1ZNGxpQTNhVUVCUWZnRFRZWi1hTFVDMmV6WFg2U0VueHdBQ2loY2pLcjZETjlNSjdSb0huNGpNekVyajFLaXBET0gxejdqbjhiNkNZM1VlaDA0S2pqeXpHZ9IBiwFBVV95cUxPRkJtUUFGODV2VkZDTkllSjB3MVItRkdpVWdwNm9RcndaRnBWQzJjUkJiRE1Cam5NcU9sTlVvSU54N1pXSU0xTmdsWkQ1OUVObE0wZGphQk1kcjhoR2Z1ZlE2MFd2YzVYa3JiM01ScDU1UFVaVm5adlBoMC1QVHV4UGxudlN1T2RGbG9Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed - Quinnipiac University Poll",
    "description": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed  Quinnipiac University PollView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 18:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBhWU1ibUFWZmkwZFozSlpXNUlCZE5QSEZka2JUVG92dGJENGVUMlNRRnppejB1d3h1QlFMbEU5NGRaR2pWR1lhTzljZ1BkTm10M0Q0UTVFaGJJcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  }
]