[
  {
    "title": "Trump Signs Funding Bill as Talks on Immigration Crackdown Loom - The New York Times",
    "description": "Trump Signs Funding Bill as Talks on Immigration Crackdown Loom  The New York TimesHouse Democrats help Mike Johnson end government shutdown, fund DHS and ICE  AxiosCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  PoliticoLive updates: Trump signs government funding bill and meets with Colombia’s Petro | CNN Politics  CNNPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News Network",
    "published date": "Wed, 04 Feb 2026 05:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTFB1NU1BT29YRXdxR1pkNGtnZEE1YXBaNXoteGhXTTFKQVVTS0hJS0QxanA2SDhOU2lsUVlPZ2xVU2M5SUZ3dm5pNHp0YkUxU1drcWJyTXNaVXJWTVZKOEFPX2tnWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Sheriff says ransom note being investigated in disappearance of Nancy Guthrie, Savannah Guthrie's mother - CBS News",
    "description": "Sheriff says ransom note being investigated in disappearance of Nancy Guthrie, Savannah Guthrie's mother  CBS NewsSavannah Guthrie was getting ready to cover the Olympics. Then came the ‘worst phone call of her life’  CNNSavannah Guthrie to Skip Olympics as Search for Mother Yields Few Clues  The New York TimesBlood Found at Savannah Guthrie’s Missing Mother’s Home as Search Continues: Source  People.comSavannah Guthrie’s Mother Remains Missing, Officials Investigating 'Tips and Leads'  TODAY.com",
    "published date": "Wed, 04 Feb 2026 01:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPMlAtUGZOTE9WdDNjYmxtQ3dwc25TOUpqVTFrVEJ0S1hwWFN6RUwzQkNSQ0RkY1UwNHlQYjk3Z3lGMFBXUHpnUG9CM0VrT1VoSkpKYm1GNGhTcVZnWW9wWDNvOEs3aEdSY20wMVJzR2Q0S2RDNDl3TTAxamlaOG51b01XTlRVd9IBiwFBVV95cUxObUdveVQ5TTVEYzBXNTUxNHliMXlZV3doSGhJMFFtakdNUHZycllqd0RPYi1pMS1qNGlPdWNoakNBbU1Yem00RTl5Ukp6SWd1MmxMR0NJOGVJWGl0WHhSWDdJekowZTNtWnVIUDFTel9LUFloOFNVR2VPWEU5WkZYTTB2VUM5SkpZV1dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "William Stevenson: Jill Biden’s ex-husband charged with murder in death of his current wife - CNN",
    "description": "William Stevenson: Jill Biden’s ex-husband charged with murder in death of his current wife  CNNWilliam Stevenson, Jill Biden’s Ex-Husband, Is Accused of Killing His Current Wife  The New York TimesJill Biden's ex-husband charged with murdering his wife  ABC NewsJill Biden's ex-husband arrested and charged with killing his current wife  NBC NewsBill Stevenson, former owner of Stone Balloon, charged with killing his wife  Newark Post",
    "published date": "Tue, 03 Feb 2026 19:37:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1BNl9qN1Q3bjVzTEVFaG1nejZKWlNpSHU1N3d4VnFRUXlKcThjbG9RODA2OHh0clltNFhuSTBwZGxYNG9QNDQ0SFFkTHZFZU5VUmZnT01wcjU0NFJhUVN1SnFfM1B2Q0VHVmFpZ2JMOGpuUVBpQWpzaDVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Judge limits federal officers’ use of crowd control munitions at Portland ICE building - Oregon Public Broadcasting - OPB",
    "description": "Judge limits federal officers’ use of crowd control munitions at Portland ICE building  Oregon Public Broadcasting - OPBJudge temporarily halts ICE from using teargas and projectiles on protesters in Portland  The Guardian‘Joyful’ bike ride turned terrible as Trump thugs tear-gassed innocent marchers  BikePortlandJudge limits feds’ use of weapons against anti-ICE protesters in Portland  PoliticoJudge orders temporary restraining order against federal agents using tear gas, chemical munitions at ICE facility in Portland  KOIN.com",
    "published date": "Wed, 04 Feb 2026 03:02:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQT1hxejNMUnpvOVBjNkxSUGs2ZHBtRUN2M1FFdUJrcDFUX1I3UGU1X05jcTdvcUZJX1F6MTZ3NUV2cVROZWtKUHRwV2RLc0Z2TklKRHZ2ZjZMeDJBb3AyNXBGejNhWnFobmZjRVRpNHVsUmlBNENxTTBUM05jVXNPR1l5OWRoMFBuOVNMY2czU1VfTHpyZ2duNE8wSEVxcnlIalYySVpKTXU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Trump doubles down on suggesting federal government 'get involved' in state elections - ABC News",
    "description": "Trump doubles down on suggesting federal government 'get involved' in state elections  ABC NewsTrump calls on Republicans to ‘nationalize’ future elections  CNNSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC NewsTrump’s New Threats to American Elections  The AtlanticTrump Repeats Call to ‘Nationalize’ Elections, as White House Walks It Back  The New York Times",
    "published date": "Tue, 03 Feb 2026 23:43:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQN29qOXd5SUU0RTFfQlBaeGY2WGlCUjdIc2pkVmtmM0lITmszT3BJS1dLd3A0akN4Rmp4a2FiWFFKWXR3MHNBSHFUVzRsRHcxemhXNmZUTk9HSThGdWZJSHluVG9JVDVjRHk0WDBwcU1TVzBmTWx0UnQzSGZIdE5qNnNFSndvWXRycGFhdE1kaFo4Zm40Wl9DUXBmWkdmNmJnUnFrNkk4UmhrMmRISnAtaHVJUkFlcGw4bzNF0gHAAUFVX3lxTE9ScHZkSkxkdERfM2t6Q1VLeUZGTU4zZUNPam94SkZZa2szZHJ6bE50ZGp0TmwxazFFOEVrbnNEcEZvS1ZVdWNUcFJ0NlhWbWdqdTFybnBQN2g0Ums5Y3FnOUF6RWd6dnZiT2w2WkdXZmlOUjBGaU90bzQ4QXFvMWlCaUY3S0lFUlhzWnNwb1dpSkw1SFBxSXBZTzRUUXFnNkREQmdUNU9xT0ZmUm9scTVBNUc3U0V2dkxISVU0WEtOMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Democrats just handed RFK Jr. billions more than he asked for. It was a big risk. - Politico",
    "description": "Democrats just handed RFK Jr. billions more than he asked for. It was a big risk.  Politico",
    "published date": "Wed, 04 Feb 2026 01:35:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQTU93NGxLTC1nOUgtRU5zNTlacmY1d3FvRlprYm80TEpoQ0pUb1NpZ3NIRTRQcV91WjhMUHJGWmw0aFhwcmJROUU2U1VDQVRCV1RDSGNMTmxSM1Z2Z1RHbjVIVTBseUp2VXVsTTNKZ3ViczRXOG5NQUk5SlI2bjU2NlRyeGhDOHBVZzJSUXFRRGpTM1ZoWk5vN3J2T05hQzgxajhnUGtLbW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump and Vance differ in their responses to latest Epstein files - Axios",
    "description": "Trump and Vance differ in their responses to latest Epstein files  AxiosNew files deepen a critical mystery about those who partied with Jeffrey Epstein  CNNThe Government Published Dozens of Nude Photos in the Epstein Files  The New York TimesPowerful people, random redactions: 4 things to know about the latest Epstein files  NPREpstein files reveal close ties to Trump's influential inner circle  PBS",
    "published date": "Wed, 04 Feb 2026 03:59:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1xTngzZ0FzWWRkaGZiRVREUk1BYjZRYXdqclh5U0MySUdCbVJHWlZhc3dRS2NDTy0yamxydmZqZFBHcTRUamQ1SUM5QkFPeVpHLUN1VHRvMGwyUEFYLTl5VTVYZlNXQWFUYWQydDc2dUllTVprVnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Tulsi Gabbard running solo 2020 election inquiry separate from FBI investigation - The Guardian",
    "description": "Tulsi Gabbard running solo 2020 election inquiry separate from FBI investigation  The GuardianGabbard Arranges Trump Call With FBI Agents After Georgia Election Center Search  The New York TimesGabbard says Trump asked her to attend FBI raid at Georgia elections hub  AxiosGeorgia Democrats call for inquiry into Gabbard’s presence at Fulton county search  The GuardianSen. Warner calls Gabbard to testify after Georgia election office raid, Trump FBI call  CNBC",
    "published date": "Tue, 03 Feb 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQQzFPM3V1cXJWSENNM1ZIdy01d2M5eG16c1A1ZWJMZDR5WWlDdHRDX0FZVU52Y0xYcGtnRWNFeU93WjQ3b2hOMnRrRUs0bFZGN2h0REV6cnpkOXBIUlNXZ1laVXplY1diaGFyVlphOTVwU0FVZTd5S3R5OWltUEFIQ3hOdHhaSDA3TDlWYmtPcV9GNjhLaXZr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US shoots down Iranian drone that 'aggressively' approached an aircraft carrier, military says - AP News",
    "description": "US shoots down Iranian drone that 'aggressively' approached an aircraft carrier, military says  AP NewsUS says it shot down Iranian drone flying towards aircraft carrier  BBCIran Update, February 3, 2026  Institute for the Study of WarUS carrier shoots down Iranian drone as tensions escalate and diplomatic talks hit a snag  CNNTrump considered walking away from Iran talks after naval confrontations — WSJ  The Times of Israel",
    "published date": "Tue, 03 Feb 2026 23:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNMVdNb2h0VkQtNThoM09KWDByVm1MVVd4SFFMeVpqOWZWaUk0MzBncks3Q3B2OFpEWUFfd2ktZmtzZWFkbE0xRlJIZWRGeFp3WmFzaGJWVGdzeHBHcE5uNFJiZ1FlSjVoMUNadVVWYWUwQmNmbU9vcmU4b19LY2t1ZUxlLVY3d0JaWXZjVHAwY25ocUV6MjJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Renée Good’s brothers, others describe assaults, shootings at hearing - The Washington Post",
    "description": "Renée Good’s brothers, others describe assaults, shootings at hearing  The Washington PostRenee Good’s Brothers Call on Congress to Rein In Immigration Crackdown  The New York TimesSeveral of these Americans experienced aggressive encounters with Trump’s DHS. Now, they’re telling their stories  CNNCongressional Democrats vow justice for US citizens harmed by immigration agents: ‘You deserve peace’  The Guardian'Deep distress': Renee Good's brothers testify on Capitol Hill after deadly Minneapolis shooting  ABC News",
    "published date": "Wed, 04 Feb 2026 03:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUHE3dHJUR1pNb0VBRDZDb3A1clJJQ2hIZHpycEhKUlROb1FXSV9KaGtQOUdIT19ROEgxaTAwRElkYXN3d2tydld0cmVwUXliVkpFeV96V2FFWmNUbS1xQ3c0cWhNc1ktYUhDdVZUbFpnNW1PSnVfWUVSVzdFSVZQUHVZSE1LcmVTbUJpZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Judge presses DOJ lawyers for a precedent for Pentagon to punish Sen. Mark Kelly over video - ABC News",
    "description": "Judge presses DOJ lawyers for a precedent for Pentagon to punish Sen. Mark Kelly over video  ABC NewsJudge Appears Likely to Curtail Hegseth’s Power to Penalize Kelly for Video  The New York TimesJudge seems skeptical of legal justification for Pentagon’s punishment of Sen. Mark Kelly  AP NewsDefense Dept. effort to punish Mark Kelly draws skepticism from judge  The Washington PostJudge appears likely to side with Mark Kelly in case challenging Pentagon’s efforts to punish him over ‘illegal orders’ video  CNN",
    "published date": "Wed, 04 Feb 2026 00:33:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOT21OVEg3a0JTcFJNcG85eXl0bkpfcnlUa3FreG1EUktFM290Yl9JTkRuNkhydlM2aHgtU2lvN2FtMnZLM25oN0ZMWVJqelc5dDhlbWludGYtd2JMX25PMDhhbFBhWGZFczFnbWUyNUgzSUlPQmxMMXJhdHlIbFFFSmNFczJ2clJMYnBjZlRscDEtZUVJb3IxaktxdEdiRl9DWWRTd0dCaW1vZ9IBrwFBVV95cUxORjZqQm5hdlZDZzlrRk1KRUdwcWd6bFc4V1R2cE9vWk5DMVpBRlJ3US03eHp1cUdfWnBsUUNCY2dNRUNBMDBaTTZxYXlWZ2FycmdzYTlZU2xiNVRTTTVMWkg4eklnRDVKQy1tOTkyZndpVmJkQi0yZE9oMkNDY0VHRGE5UGZiemctVmdiMW1yX1pCT1JhRXNlZEtlYjZmV29aNGhEQ3VDS19UQW1wWmVj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Walz demands DHS stop detaining Minnesota children - Star Tribune",
    "description": "Walz demands DHS stop detaining Minnesota children  Star TribuneAbsences and loss of innocence: ICE raids leave behind a heavy weight in Minnesota schools  CNNColumbia Heights superintendent: At one school, ICE has detained at least 23 parents  MPR NewsMinnesota officials speak out on ICE detaining children, targeting schools  5 EYEWITNESS NEWSWalz and Ellison echo concerns from educators over impact of ICE on kids  Bring Me The News",
    "published date": "Tue, 03 Feb 2026 22:47:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPaG80N3hDWFVOblA0Q3BTRENjYUhuOWFlbnJSTEVYb3pDX1hyZlNMaE84elFBWEFoMWowLUk4MGpDcU5rUnJOUnJHY3E4OWtDanlIV2FWeExxX240bzVuVXpMb3ZvTUtlVER5TlhFTF8zS0haODROdTAwUnlGSTctR18xdERiMnE0NFFneEdQREF6UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Ex-Senate Republican Leader Mitch McConnell hospitalized over \"flu-like symptoms\" - Axios",
    "description": "Ex-Senate Republican Leader Mitch McConnell hospitalized over \"flu-like symptoms\"  AxiosView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 01:29:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4wM3REZWpLU2NyUWdESnA5MmVMVk1tNy1UcnBhcEM3M185N3lrM0Z0OVpxeUx4cEJnbTB0WXNzUWFDbnZJRmJfelpKZ1dHeFJYWWphOWhsSFFHQ2NJbkFSS3NGRGZzZWo0ZC1sOGhrdGo5M3kyRGtmZlpGU08?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Republicans are freaking out about Hispanic voters after a Texas upset - Politico",
    "description": "Republicans are freaking out about Hispanic voters after a Texas upset  PoliticoA Democrat flipped a state Senate seat in Texas. Republicans say it’s a ‘wake-up call’ for the midterms  CNNTexas loss delivers stark warning to Republicans in critical election year  BBCStatewide Officeholders Find Themselves in Primary Peril This Year  Cook Political ReportTexas Democrat who flipped reliably red district says people are 'tired of campaigns of outrage'  ABC News",
    "published date": "Tue, 03 Feb 2026 23:56:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPM1QxSDFudnVzSVBZV1lvUmQzdlF6WHVWcHZ2dXZTX2I2NS10M0lmWkR6NmVyUHBrakFFNEJuOEpRQ2VHOTZTYUxpWHBhcVJjQkluRUlwSHZlVlJoZkQ1WE5MOWpaQW4zVVBrbjJ6VE1ITVhDdWQxNHl5akFuVUgxRkJmMkhkOFVqOFhIUGY3WkVWNkZHVUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Republicans Are All In on Boosting Fraud Allegations in California - WIRED",
    "description": "Republicans Are All In on Boosting Fraud Allegations in California  WIREDThe influencer who spurred the federal crackdown on Minneapolis  The Seattle TimesRight-wing influencers target Somali child care centers after viral Minneapolis video  CBS NewsNick Shirley, the Influencer Who Spurred the Federal Crackdown in Minneapolis  The New York TimesAs an influencer, Nick Shirley had struggled to expand his reach. But after a missionary trip pushed him to try a new approach, he caused a sensation with a video claiming to expose fraud at Somali-run day care centers in Minnesota. https://nyti.ms/4qW93lJ  facebook.com",
    "published date": "Tue, 03 Feb 2026 17:43:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNVUxkTGgwa1NzYzFHS3hWVHhDNGEzTTZ4aHh4Zm5mbDV0bTRreHU3RmJpclVDTnF4QThySDNkdk9qUTE3NEZQNFEwMWxZR0tzOExNTzRZVG5LSU16M3ZGMDUtbU5hNmFLWTg5eFNtMUJta0VPUDhVT0diMGExM3BLY2NtQUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Backed by Mamdani, D.S.A. Candidate Wins Election for Mayor’s Old Seat - The New York Times",
    "description": "Backed by Mamdani, D.S.A. Candidate Wins Election for Mayor’s Old Seat  The New York TimesMamdani’s endorsement fuels special election win for his successor in NY Assembly  GothamistQueens voters pick Mamdani's successor — plus two other New York special election results  Crain's New York BusinessQueens voters head to the polls for Assembly District 36 special election to fill Mamdani’s old seat  qns.comMeet Diana Moreno, Zohran Mamdani’s Successor in Queens  Jacobin",
    "published date": "Wed, 04 Feb 2026 02:13:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVU15dEw0TEFPVjdTRTBabzJfM3lBa05Udl9Ya29oTEdKRXVyRXB3Nm9aRDkyWks1cWVjLTB2cGhsVWtUN3VsVlQwY1M1ejF2QXliNE5MdEVBYjlGT0xTdnhfWC14RHZGdFpWSjZDNGNSZ1gtOTV6NFN5eHcwWTE1eEZrd0lWSlll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gateway sues Trump administration over freezing Hudson River tunnel funding - Gothamist",
    "description": "Gateway sues Trump administration over freezing Hudson River tunnel funding  GothamistTrump Administration Sued Over Cutting Off Funds for $16 Billion Tunnel  The New York TimesTrump admin sued by New York, New Jersey over Hudson River tunnel funding freeze: ‘See you in court’  Fox NewsGateway Development Commission Files Breach of Contract Claim Against Federal Government  Insider NJThe US Economy Needs the Hudson River Tunnel Project  Bloomberg.com",
    "published date": "Tue, 03 Feb 2026 12:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOQWdYdmUwRUhrX2VaNTdMMnRkUWE4NUk1Y2NGbkhQNTlONEFub3hudVRiVmctZUJUUk13Z01XZ2liYnJKbXJ1N3pqanNodGtCMG9qOWMyN3hzSHJXZk84ejNrOVlIaWJfS2ZwRVZXS0d3RGdpMy1YSngwYzN2MEUyNFRmc3YzVHh0VTJwZ0pOc1ZkVkRIQnRXX09QTnVxYW15clV5SA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "WA millionaire tax would bypass voters, but Ferguson won’t support it yet - MyNorthwest.com",
    "description": "WA millionaire tax would bypass voters, but Ferguson won’t support it yet  MyNorthwest.com'Millionaires Tax' officially proposed in Washington state  king5.comDemocrats unveil WA income tax on people earning over $1 million  The Seattle TimesWashington state voters have rejected income taxes 10 times. Is this year different?  KUOWOpinion | Washington state’s self-inflicted fiscal crisis is a warning  The Washington Post",
    "published date": "Tue, 03 Feb 2026 20:13:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE94V1YwNXFZVTMzTWlqRmxCenNuMVo2UVZQMHdya25xQlNMUXRHYkxsYUJvcnBjWUszSklYT1Ywekxfb2lQYVp0cU83bjJ1bDg0bE1KRkRzYkVJdV8tbUJReEtBWVc0ZlpDUEpGMmVEcVJnNFpad0VOLUIySkkxWWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mynorthwest.com",
      "title": "MyNorthwest.com"
    }
  },
  {
    "title": "A judge eviscerates Kristi Noem in blocking deportation of Haitians: Today in Ohio - Cleveland.com",
    "description": "A judge eviscerates Kristi Noem in blocking deportation of Haitians: Today in Ohio  Cleveland.comOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesJudge Blocks Trump Administration From Ending Legal Protections for Haitians  The Wall Street JournalFindlay prepares for potential immigration enforcement as Haitian community faces uncertainty  WTVGFederal judge postpones Trump administration's termination of TPS for Haitians  NBC News",
    "published date": "Tue, 03 Feb 2026 15:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNNFN6ellhc0psdDFpTkZGN193b0xRZjF5QW1oRU9uZFEtbTVVTWJPaWMxd3E0by02SDBGLWliWTl6WGI0QzU2T3pLWFptQ0VtYmhLQ2ZVWG80MFRGSk9JbEtQWm1BNDBXd1FyZDNQUVhhdnNGcFAxcmVfX01xcW01ekRsRGRlWUdJUzFoU3FObVp3Y1Y4b0Zadm9lOUhVa2c3Nkc4bzhCUE96ZkZXS0ZEZjIwTFBydmx3RXk0bFk1eXZMeUHSAdcBQVVfeXFMT1lxdjg3SVVZWkRXS1FySHVQUWgtN0liWi1CaWRqNXBwcHdrYnJLR2RuOVQxMjJBQi1JOWlxRUFEQkd2MDExSnBfcW1oeVlvTGxZMU1QUVlOLWtZaHdRdjRCdVJRTDBTX1ljcjVzV2V0YnpnRWhaUDRabmNfdlN4YV9qblBFeTd6aFNRcFk3NWNXWkhEdFpsNlVnYkpFeEx2RWtTWVQyelVMRm04MDR5LXJzVXBabWxSZkpWVVhsSDlkZUU4Z3hpUDZBQUY4STF6T1hUU2dYOUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "TEA Releases Guidance for School Systems Outlining Consequences Regarding Student Walkouts, Absences and Educator and District Responsibilities - Texas Education Agency (.gov)",
    "description": "TEA Releases Guidance for School Systems Outlining Consequences Regarding Student Walkouts, Absences and Educator and District Responsibilities  Texas Education Agency (.gov)Gov. Abbott cites youth alcohol arrests to criticize statewide public school ICE protests  KXAN AustinKyle police arrest 2 juveniles during school walkout, clarify charges unrelated to protest  KVUEKen Paxton demands information from Austin ISD after student walkout last week  KUTHundreds of Hays CISD students leave campus to protest: district  FOX 7 Austin",
    "published date": "Tue, 03 Feb 2026 23:05:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwJBVV95cUxOQTNVcGRKT3AwREJjTnI1MmR3dENBd3MzS08xM2JDanB2d0FWUDZNTjFROTllMTFlaW5uenBHcDNHb3pxTU5CMGxqaUlYVk1HSGJxWVRabmFEaHVDS1BkS3ZYTC1zWnUxQkRmS3FWSE1zSjUxVjBIcmd5aXNFaExJYjBFZHU3VWJSYzRTaTFiUUJfcEhQWmxRUDhkRWZ4UjRHU3c3WFRINzVtUVJBdmpqSUhRQW9UNGJxNnJnbWtBTldENTR5UzZTSDNHV2pRVFpxM3dtcHJ1Z0tsT202cENuRG5YdE5SQXo5UUdUNUhXQnlVZ0NNRXZTUUUwQldtbUFGYkE3aEJtY2N4Mm9paE9vMVBVWGI3LWgtSkpibG42Ql9WSVF0dXNKRXRmZElqc0pWY3JFWklVRG1DV0lNb0Fz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://tea.texas.gov",
      "title": "Texas Education Agency (.gov)"
    }
  },
  {
    "title": "U.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups - The Wall Street Journal",
    "description": "U.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street JournalIran risks Trump's ire with new diplomatic demands, provocations  AxiosIran’s president seeks ‘fair and equitable’ negotiations, while US shoots down drone  AP NewsIran conditionally agrees to nuclear talks with US, first since Trump’s military strikes last summer  CNNIran demands changes in venue and scope of talks with US, source says  Reuters",
    "published date": "Tue, 03 Feb 2026 23:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNWDhKbV91eWIxWGxyaXA1OGx0QlNhQzgyOUh2UzNQWnNaOERKNHJPQmgwdjI4LVIzMVcyZHF4ZC1VQVpLT1pGaVRCR0NjWVdiem9KNWtIXzg1RkphTVdQRnZ5REdkTTliV1hKODJ6N2MwamF0dUx6VDhEZm9MNXREbEgwcnZBNkpmR0xfMGZobEVEX2RCMXQ1RG5odEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "DOJ Lawyer Asks To Be Held In Contempt So She Can Sleep - Above the Law",
    "description": "DOJ Lawyer Asks To Be Held In Contempt So She Can Sleep  Above the LawAttorney for government tells judge in ICE case: 'This job sucks'  NBC NewsICE attorney to judge: ‘This job sucks’  MPR NewsICE Attorney: 'This job sucks'  FOX 9 Minneapolis-St. PaulIs ICE Leading Us Into a Constitutional Crisis?  The New Yorker",
    "published date": "Tue, 03 Feb 2026 22:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOYXQ3b216VFh4MHhzdDBWM1BSQ0RaV0hXdElOY0NoSVcxX3JTblN1bk1SR0Z1Vy1ZWHJGRWF0aTMzSXZENkNuem5XNUNEZmJoMFR0UDBPNjhxV2JUS1hCNWpyWWxqTGlWUkdYc2FnZnlqM2tLX0dlNUx3eEZnNmRncW4xYVk0UHRvV3hpQ0Jjc0JaQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abovethelaw.com",
      "title": "Above the Law"
    }
  },
  {
    "title": "Trump’s Greenland gambit could undermine critical minerals meeting - Politico",
    "description": "Trump’s Greenland gambit could undermine critical minerals meeting  PoliticoEU to Offer US Critical Minerals Partnership to Check China  Bloomberg.comTop US trade official spells out plan to break China’s grip on critical minerals  South China Morning PostSome 30 countries want to join critical minerals club, US Interior Secretary Burgum says  ReutersThe United States to Host Critical Minerals Ministerial  U.S. Department of State (.gov)",
    "published date": "Tue, 03 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPMmpoQTVjQ0lFNHgxeWJNalRUUTJkOV9ubWR0UWpRTVJfUUJTVEFJUUUyNDE0aWtBalJWX3ZWdmpxMjg4a0lueGZtbkZVbzB6emVxVUJ1djg0SEowenZodEM3RTdLeTB2NXBJbXZBSnhaNWN5eXZyOWRMNnB0SDY1YXlOQVRyY1cwQVVRRFNEcV9RdlNWU3diVmNaUXUwZC03dzl1ZW1zMWdwSmF5b0R2QUZnTk9DQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Satellite imagery shows where the U.S. military is positioned near Iran - The Washington Post",
    "description": "Satellite imagery shows where the U.S. military is positioned near Iran  The Washington PostOpinion | The Nuclear Threat After Tehran Falls  The Wall Street JournalIran's supreme leader warns any U.S. attack would spark 'regional war' in the Middle East  PBSExclusive: Iran fears US strike may reignite protests, imperil rule, sources say  ReutersTrump says if Iran doesn't agree to nuclear deal, 'we'll find out' whether U.S. attack would spark a regional war  NBC News",
    "published date": "Tue, 03 Feb 2026 18:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOZG02SWlvdlB3T09vTGJ3TUFZaXc0ZzU2T0dUTlVOU2t4RDJTTXlOMTVUcHlDSC1sQWpva1c1cXRBZjVyWjh6U0k0Q1RNTGFoRkVCWDE3QlBxUGplVVg2NGRrX0wtNVRzMWpoT3R2VG5kS3VvY0ZfeU8ycjR1MnhMaVc2cHZOa1BxeU1CaTFvNW1JZlA5WVZMMVg5N0llRFk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Russia launches massive strike on Ukraine day before US-brokered peace talks - Euronews.com",
    "description": "Russia launches massive strike on Ukraine day before US-brokered peace talks  Euronews.comRussian hits Ukraine energy sites in 'most powerful blow\" so far this year  BBCRussia hits Ukraine energy targets with hundreds of drones, missiles, ahead of talks  ABC NewsRussia-Ukraine war: List of key events, day 1,441  Al JazeeraRussia resumes night strikes on major Ukrainian cities, ending brief reprieve agreed between Putin and Trump  CNN",
    "published date": "Tue, 03 Feb 2026 09:54:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNSzlETlVUVVpTWXNOYWI4S2RSZkEzd2NKenpjT1cyYkc0Mlp4Uk5QUi1BSUM2ZUs1S1JQLWNQNHFWc1BUWEtia1pYamhfZllUcWtXV3BLaXJobXh5VHBJd2ozR3pxXzJxSVhfRFpCV0Rzbkd6dkZtU3d4MWZ0NlF0WS0xenpPTzhVYWw3V2ZUOE11MlZZZHRoSnhCZUctalBHbjJqUG5WNXJOakFlQjRpUUZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Annotating the Judge’s Decision in the Case of Liam Conejo Ramos, a 5-Year-Old Detained by ICE - The New York Times",
    "description": "Annotating the Judge’s Decision in the Case of Liam Conejo Ramos, a 5-Year-Old Detained by ICE  The New York Times5-year-old boy and his father return to Minnesota after being released from immigration custody  NBC NewsDeputy attorney general says administration will appeal order to release 5-year-old from ICE custody  MPR NewsFather of 5-year-old detained in Minnesota disputes government assertion he abandoned the boy  AP NewsVance, Democratic rep spar over legal status of 5-year-old Liam Conejo Ramos  The Hill",
    "published date": "Tue, 03 Feb 2026 13:48:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQQXJyUVpSYmVyQzFqSEgxTkUwOThmdnl5MmhnR2xPelBOWVhSeUZVMVJiREF3M20wS3ZhbWpIV19ubjhZRHhPTGFKc0FMRG9TdzRqdmNCemViLTh4c3VZRklDa2Nkd0JDV1hmd2dnNUNzcFBlQ1llcGNQRnBLSmlVMWVzQ2V6UU9tMnA5STVhemN6ZUhGR1l3OTk5WkpQUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Don Lemon says he offered to turn himself in but federal agents were sent for him anyway - CBS News",
    "description": "Don Lemon says he offered to turn himself in but federal agents were sent for him anyway  CBS NewsA Defiant Don Lemon Appears in New York Days After His Arrest  The New York TimesUS Attorney General Pam Bondi announces 2 more arrests in the St. Paul church protest  ABC NewsJournalist Don Lemon to appear on 'Jimmy Kimmel Live!' after arrest covering anti-ICE church protest  ABC7 Los AngelesDon Lemon defends his reporting of anti-ICE protest in Minnesota during interview with Jimmy Kimmel  CNN",
    "published date": "Tue, 03 Feb 2026 07:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOeTF4ekI3LVhUUmluOXQxeUs0MUxoVXRiM2ZwV3hNTXFQelM3cWJNZmJ5ZWJvTmF1MGRLWVp3OTFtUnU1Rk8xcnAtMU9IOUtvMVNRalhJemRpRC0tRTJPUS1Sdzh0VmFOYnRJQ2tTWDc1RUpSQ2xLd29uVFlib1NtaEZ3Mnl3a2hCX2RTYUh0UU9vRXhXaHVsUGhUc9IBoAFBVV95cUxOTTN2MXl0NmJrZC1JR3I1d2VRWmVJT0dtTWN6XzBXbVh2SzVxQ01fNEkxV1pqb0dpVlgzNEJNM1RWOU5mRkRkRmVqZ3FTSGJHQnAwQmNydnY0VktlVjVqZktIOTExcVpsWGNtUE9SS2ZhZGJZYTNhbWRfbUJLZnVTZDVpbTU2MTBpQkdaTnZzdnU4T2NJWjNFLTAyNE9jSXdT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Marimar Martinez, shot by Border Patrol in Chicago, speaks out after Good, Pretti deaths: ‘I am their voice’ - Chicago Sun-Times",
    "description": "Marimar Martinez, shot by Border Patrol in Chicago, speaks out after Good, Pretti deaths: ‘I am their voice’  Chicago Sun-TimesMarimar Martinez shooting: Chicago woman testifies about Border Patrol shooting in Brighton Park on Capitol Hill  ABC7 Chicago‘It seemed like time stopped’: Marimar Martinez recounts shooting by immigration agent at Washington forum  Chicago TribuneChicago woman recounts violent encounter with Border Patrol before Congress  WGN-TVWoman Shot by Border Patrol Says Agent Appeared to Take “Trophy Photo”  newrepublic.com",
    "published date": "Tue, 03 Feb 2026 11:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNSmpvNFI0bUVSbXFuRl94RU1kcFZPLWE4UXdGRGhHUkxGbXhPamNlWERRbWVqR1RzQlFRWnVrWFVsQUoyd2lkNThoaFZ1M21oYWJlSW1lN3YwVG5yT1ljcmRraS1sdG1PdDNjSFNzWEpLdDZSeE9DWkhteXJjaWN4ajRWbkktbEpPWjhyUnZlYzJxUVBvWkhpcC1oUFFqcEp6M2tjdlNsaUFZd21mcTBGdkUtZmNsS1IyZnNlVnpsOEh3SXpfMzlXd01Ud0g1YURHNVBTaFBScFBhMGp2Z2x2aHVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://chicago.suntimes.com",
      "title": "Chicago Sun-Times"
    }
  }
]