[
  {
    "title": "Jesse Jackson, civil rights leader who ran for president, dies at age 84 - CBS News",
    "description": "Jesse Jackson, civil rights leader who ran for president, dies at age 84  CBS NewsJesse Jackson, towering icon of civil rights, dies following lengthy illness  USA TodayJackson’s Rainbow PUSH Coalition Was a Powerful Advocate for His Politics  The New York Times5 things to know for Feb. 17: Jesse Jackson, Nuclear talks, Nancy Guthrie, Alien speculation, Hockey rink shooting  CNNAnalysis | I covered Jesse Jackson’s 1988 campaign. The racism he faced was undisguised.  The Washington Post",
    "published date": "Tue, 17 Feb 2026 12:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPbk9CSTkzUjZmNWljMllOU2ZjVmFlQ3ZaQTZUOElReWEwUldQRTFzNTR0bmdPRktZdmNTVUtpSDFTc2UwWXg2dFRMbnN2cXRuYTBPYmhJYmlKcG95amZLM3FNQV9FZWhGX1U0WjRIUFQzYUprN3RtbUd6TnphS3NhY9IBhgFBVV95cUxPYUZINVJzWlZDNTZfWlRsOVN0bXRHNXhycVBDUU1ESW9fRThUbzVURkY0a28tTUd2aVdtRWRpVXIwenNQZFZDNUVzOVMxdWdTQ3loWnU2WTRIN04zWG92ajVkZUtnMXNQOUVOc2hFdkk3bmwxcFh5aTB2TU81bkQwLWdSYVB4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Guthrie family not suspects in Arizona kidnapping, sheriff says - KSL.com",
    "description": "Guthrie family not suspects in Arizona kidnapping, sheriff says  KSL.comNancy Guthrie live updates: Police clear family as more tips roll in  NBC NewsSheriff rules out family members as suspects in Nancy Guthrie's disappearance  YahooNancy Guthrie disappearance: Savannah Guthrie says 'we still believe' as FBI investigates DNA  Fox NewsInvestigators Hope DNA Testing Can Provide Breakthrough in Guthrie Case  The New York Times",
    "published date": "Tue, 17 Feb 2026 05:32:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPa2o0ZHl2eUFCSGxIeWY2Q0JUTlNRZG5HMmZ3SmNnQTlkenFfVjUzRnpaQ1RwMFQ2NUVJZmJZODNjQjV0OVNKQWZZSWZqS1hlQjJ3RDFsRzF3RF9uOEhHT0s1by1qc2dsUUtKckhoNXkzaVhtY3E0SnM0bXMxMmhiUDNSTC1oLWdRT1Z3SS0wVmk1dEFPTURTNHo4Mm0waFVC?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ksl.com",
      "title": "KSL.com"
    }
  },
  {
    "title": "Noem's use of Coast Guard resources strains her relationship with the military branch, sources say - NBC News",
    "description": "Noem's use of Coast Guard resources strains her relationship with the military branch, sources say  NBC NewsCoast Guard sounds alarm on Kristi Noem and U.S. women hockey's road to gold: Morning Rundown  NBC NewsA Pilot Fired Over Kristi Noem’s Missing Blanket and the Constant Chaos Inside DHS  The Wall Street JournalCorey Lewandowski fired Coast Guard pilot for leaving Noem's blanket on plane: report  New York PostNoem adviser Lewandowski sought to carry a firearm at DHS, alarming officials  MS NOW",
    "published date": "Tue, 17 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcTN1eWNWVXcyMEZFWFBQS1l1LXl0TlN1VjlOcVd6VmxxY0lWUEJQaEI0SzBwMUxpczYycTM5al9xQ0Fvb1dUNDYydm01UE5tWGlXa0pSWUVwRmlYQ21odHBvdTgtMkd0MWw4Q3pyUzNTREs5QVJUamk2a01LUE95WTE2c043MWJoSUhOWHNxME5IRHdjaHhqT29KUjR3dG9pUFBILXFBUGhDcm8wVXcyNGpMbVBYUzhoNEMydi0ydl8yeEd5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Why Congress failed to reach an Obamacare deal - Politico",
    "description": "Why Congress failed to reach an Obamacare deal  PoliticoA single mom's ACA premium jumped from $3 to $164. Now she's skipping her medications.  Business InsiderThe Misleading Chart That Killed the ACA Subsidies  HEALTH CARE un-coveredNEW REPORT: As Open Enrollment Ends, GOP Price Hike Pain Begins for Working Families  Protect Our CareNY woman's health premiums spike $10K after Congress let ACA aid expire  Lohud",
    "published date": "Tue, 17 Feb 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQd0NucEYwQXRBN0hEM00tQWNydldiRU94cWJuSGszcDBCYWw4S0F1blVaY0h2Y25SVkRueGRZSTF2T2FTRG0yTldDb3F3Nm1nX2JwLWNVZ2QzbW1wX1M2NDlNZk1VbmNWa2diSWFiU1RkME5wZGRtZkhSM1ZpaUxPR3FoU2VfQmU3YlBoVU1kTEJNN3BDZmZScXdvZTc3eG9uUDliOGszMWY5V3ZjZmdUN1pqeUJJSVViQ1BxVzh5UFBudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hillary Clinton accuses Trump administration of Epstein files cover-up – US politics live - The Guardian",
    "description": "Hillary Clinton accuses Trump administration of Epstein files cover-up – US politics live  The GuardianHillary Clinton accuses Trump administration of a ‘cover-up’ over its handling of Epstein documents  CNNHillary Clinton accuses Trump admin of Epstein ‘cover-up’  The IndependentHillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview  BBCTrump hits back at Hillary Clinton over Epstein files 'cover-up' claim  Sky News",
    "published date": "Tue, 17 Feb 2026 14:15:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTnYwaHRHSDVpUTNhdXlIdXQ1MEl3Ym1ybW5VNU5aX09OQXlQNGRFQUFwTC1DSldnVE8xMVd6WEROM0dMR0NOdlZPUHFBeURSRVZKd3V5OFYtdk5maDJnOF9nQTlDcFVwdWh0V0pYcEdUYmVJVldiY3pWUUdMZnlRUmlnWWhOY0loMFMwTDg0VEFaa3ViZG5pZE1BT1o2cF9mNk13QldXWGVPVkdlbWpJeWNUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump administration ordered to restore George Washington slavery exhibit it removed in Philadelphia - AP News",
    "description": "Trump administration ordered to restore George Washington slavery exhibit it removed in Philadelphia  AP NewsTrump administration must restore slavery exhibit at Philly's President’s House, federal judge rules  WHYYCiting Orwell’s ‘1984,’ judge orders Trump administration to return slavery exhibits removed from Philadelphia museum  CNNUS judge orders Trump administration to restore Philadelphia slavery exhibit  The GuardianSlavery exhibits must be restored at President's House Site in Philadelphia, judge orders  CBS News",
    "published date": "Tue, 17 Feb 2026 02:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMU5lcnQxTWRVLWphanhxUnFiUlFhMDk0ZDNqazhnbFNHTHNmLXNudFFnQTdacENHV3lTc0REeWx2QVNoLUFHWEYzMGNmU2MzMmpkbWlzdGM5RkgtSFRJc3l0TURmYS15Y0l5NEFIemR3M3ZYaGtBc1NSR2R4S3JQNnJ2QkIxQ0VESkR4M0NmNDNZZDc3dXotWXhISmdwZGNNZVRYdDdHcVdQbjRG?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
    "description": "The Epstein files have brought a wave of resignations and investigations  The Washington PostEpstein files end business, political careers across globe  AxiosThe Expanding Fallout From the Epstein Files, and Jesse Jackson Dies at 84  The New York TimesEpstein files fallout: The high-profile people burned by past dealings with a predator  CNBCThe UK’s Epstein Crisis  The Nation",
    "published date": "Tue, 17 Feb 2026 14:31:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPOHBiNGo2LTZKbEw0eEdlLVdxYUhYWWJCNUFaSkZjdENjVlF5eHU1UG1jaEw4Q3NfZVhNQ0EyWVhxbVhja2VBMzZOOEc5djRBd01iVHhiOTlWS2R3c1BnUl9jbGQ2dWtTRlh3Rk5PMDhUbTJhZ1pydkxFejJPcmJLUlFicW1MVm5LaFZ6clZMMTd3cl9NS2tfQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump and Maryland Gov. Moore trade barbs over Potomac River sewage spill blame - Axios",
    "description": "Trump and Maryland Gov. Moore trade barbs over Potomac River sewage spill blame  AxiosTrump, Moore feud expands to Potomac River sewage spill  Baltimore SunTrump lashes out at Maryland governor's over Potomac River sewage spill response  PBS'Remnants of sewage' including toilet paper, left behind after wastewater pipe collapse  WJLATrump says FEMA will play ‘key role’ in coordinating response to Potomac sewage spill  Politico",
    "published date": "Tue, 17 Feb 2026 01:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPNldZVkRrM0M0THJvSjdrTVlDOGcxS1RFWHZJbzVsc3dkTFdVMXB0TEU5M1J0TVFZZHZzUTM0QW56M2ZieWVCeHo1OHY2bmdxbk40dWRpaDJZZzNQV2JSOURkcmlmZkVTc1VYcFpTWW1PNGRxakdqUFlwV1FUNloxMVB1T0tYbnJFb0I3UTZPYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "After First Big Overseas Trip, Ocasio-Cortez Expresses Frustrations - The New York Times",
    "description": "After First Big Overseas Trip, Ocasio-Cortez Expresses Frustrations  The New York TimesOpinion | Class warfare comes to Munich  The Washington PostIn Munich, AOC warns that democracies must deliver for the working class to stave off 'authoritarianism'  NBC NewsTrump news at a glance: Alexandria Ocasio-Cortez blasts president’s ‘age of authoritarianism’ at European conference  The GuardianAOC mocked for ‘absolute train wreck’ weekend on global stage: 'Made a fool out of herself'  Fox News",
    "published date": "Tue, 17 Feb 2026 01:33:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPakc1LWFXSFEydnE5RF8yTi1HWnczRHFrWndWUFl5cGdxczVOdmVkd0QzZGMwMVdOQ3F5aU9FVW9tTEJ6TkxkeFVhVWFrSkVpVWtMbm9SWDJ1c1pCYm43THIwUFVjdW4yRU9NQ21MbHBZdnd4RWlaSWZHb2E4SWRCaXctc3JHODJiZ3J3WlNsWEZuVE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks - AP News",
    "description": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks  AP NewsUS-Iran talks live: Tehran says understanding on main principles reached  Al JazeeraIran's foreign minister says understanding on 'guiding principles' reached with US after today's talks  The Times of IsraelTrump administration live updates: Jesse Jackson dies; Russia-Ukraine talks start in Geneva  NBC NewsSecond round of Iran-US nuclear talks in Geneva ends after just four hours  The Guardian",
    "published date": "Tue, 17 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdU9KcTluVUp5cU54V2FibWZEd0dBTkJpMVhhSXFUbnh2ZDlOLXUwTFlFZmx6T0JSeC1RN2Z1SVRwMlc3R3RCWXRDR2tUUmhndG9WX3RPcENwT2N2OUk0WWpoRmF2QmF4cGJGd1ctVFE0M3RjdGloZ0pGV0s2V1hmc002OVJNTVB5dWlXLXJOeGZSZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say - The New York Times",
    "description": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say  The New York TimesSavannah teacher killed in crash by man fleeing from ICE  WTOCGeorgia teacher killed in crash involving migrant chased by feds  The HillMan arrested after DHS/ICE pursuit leads to fatal crash on Whitefield Ave  WSAV-TVDeadly Evasion: Illegal Immigrant Flees ICE, Crashes Car, and Kills Innocent Driver  Homeland Security (.gov)",
    "published date": "Tue, 17 Feb 2026 00:41:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPb1BfdkZGbWVFenRvT2l6a3BaaDE3UHQxd080UERBU0pRQVZMWl9Hd21PS2dhdGUxTnFhSzZ2Z2RtOTg0bExUMGpBVEZjSjBwMkNYU2YycklnTU9PZ3QzRkcxMFV3bUk1bXA1Q2dkR2x6Y2RsYmw5dkNtTjRGMnM2Z3RpRExDQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump news at a glance: Ukraine must reach a deal with Russia ‘fast’, says president before trilateral talks - The Guardian",
    "description": "Trump news at a glance: Ukraine must reach a deal with Russia ‘fast’, says president before trilateral talks  The GuardianUkraine and Russia Hold New Round of Peace Talks, but Expectations Are Low  The New York TimesLand in focus at Geneva peace talks between Russia and Ukraine  ReutersRussian and Ukrainian officials meet in Geneva for US-brokered talks after almost 4 years of war  AP NewsThird round of Russia-Ukraine talks to take place as strikes continue  BBC",
    "published date": "Tue, 17 Feb 2026 02:19:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNU3VkRV9USS1qZlZhbDdGLWtwR3lyMmduU0QyOUNkVkJNaFc2VG90dXRzT0hwZmlJUjZMcGNNRHhnaUlFb3lobXVCSjVSMk5vQk0xcHNobkJMdHp5N0w1RXpMNXh3RERVbXhWRl9mTElXS3p0NDAyX0RnMGcyWkFlUElVaWZoRDMyOW9EV1BQWEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "New Mexico lawmakers launch sweeping investigation into Epstein ranch - Axios",
    "description": "New Mexico lawmakers launch sweeping investigation into Epstein ranch  AxiosNew Mexico approves comprehensive probe of Epstein’s Zorro Ranch  NBC NewsNew Mexico House unanimously enacts Epstein ‘truth commission’  Source New MexicoEpstein ranch in New Mexico bought by family of ‘Trump Republican’ candidate  The GuardianTexas GOP politician Don Huffines plans Christian retreat at Zorro Ranch  Santa Fe New Mexican",
    "published date": "Tue, 17 Feb 2026 03:44:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPZEM5ZFQ4bGpxVmZobldwZ2E1V0ZqdVRXMTFsZlVjS19yeXNaR0prT2p3YmNtNkZPbWEyYjg0NTg2S3JGcmUwUkphTHJoaHFHQzl0OFRLY3RxeHhWWWdLS0poZ1VvN2Y3d0YwLXVVUmtHaS1tTl9RcURJUFF6aUxWZnh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times - Los Angeles Times",
    "description": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times  Los Angeles TimesCalifornia walloped by winter storm with high winds and heavy rain and snow  YahooLive updates: Severe storms flood Los Angeles while blizzard brews for Upper Midwest  FOX WeatherLive weather updates: SoCal cleaning up toppled trees, flood damage with more rain the way  ABC7 Los AngelesLatest Southern California rainfall totals for Feb. 16  FOX 11 Los Angeles",
    "published date": "Mon, 16 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxObEtQN2JwRWRhbEFmcFFXWjV6VmFKU3FaMWZaWjJsaXQ4bkhQOVhyZDdmVFZvVTYyT0JDbWl1aVI5a1p0MXJxa1J2ZXJrLWZITVVMV2VkM0FVam9VV011YV9OYXhlWUxwWG5WRFdqRmYtZXdvOEZKQnBBdlYyNDVYdUFJbXJrNnZaODYwNG1BOWYxb0w0MVNJNzcyeFNLMks0YTdnNmNRRV9GMlkxQzFGSXZlWTdwUUpfVmd1VHItdHJ6ejlldnZ4NHVjTDNJNExKLUlmUE9CblZxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "California surfing legend Kurt Van Dyke found dead in Costa Rica - USA Today",
    "description": "California surfing legend Kurt Van Dyke found dead in Costa Rica  USA TodayAmerican surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica  CNN‘You left waves’: Shock over apparent slaying of ex-Santa Cruz surfing great in Costa Rica  San Francisco ChronicleCalifornia surf icon known as ‘King’ of Salsa Brava killed in Costa Rica  KTLAElon Musk's Social Media Site Tanks as X Goes Down for Thousands  The Daily Beast",
    "published date": "Tue, 17 Feb 2026 13:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQek5PZkNmVUpSemI0akZPU2szUS1NX0lBdFU1Ym1KeHlwSW5zdURpMTRzV3FZNEtYZFNINUprcTQyNnZhVm50WmduRkhLY2RIWkt1MWdEN0xaN0VDZ0pEQlFoTnJXUEhFTGxnZThmYV83QUtuQUdmTXMtX3hHdFRvMVRfN282WGljSktpd2tESjFIZGI0ZGt5X29lTGxUemFweGxXMEFvSHBBOTJWSlJjYVV1Mm5ZLTJmRHJfTVd3elR3VXZhU2JWVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "Yikes! Snow Expected Earlier, Falling Lower as Major Winter Storm Hits Interior Humboldt and Beyond Tonight - Redheaded Blackbelt",
    "description": "Yikes! Snow Expected Earlier, Falling Lower as Major Winter Storm Hits Interior Humboldt and Beyond Tonight  Redheaded BlackbeltWinter Storms Could Bring 8 Feet of Snow to Parts of California  The New York TimesWinter storms could bring 4-8 feet of snow to parts of West. Latest forecast.  USA TodayChain controls, whiteout conditions possible as storms hit Truckee-Tahoe  Sierra SunWinter weather advisory issued for portion of Bay Area as snow enters forecast  San Francisco Chronicle",
    "published date": "Mon, 16 Feb 2026 08:04:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPSEFlUzlRT1NleVdKNXUzVU1IUVhoUVFSQUxCaWdZdWF4RUs1Q0c0eEZjSklPV2NwaGwxRTlFQzVwWmN4QVVRODQ2REREYmpLZnZnX3Q5dkZkRFZCUGRXcV9hX0cycE00MGJjODlqNjFtcjVZUjFOOWJZcGpXWm14dzAzQ1RsS1IyX2hGVVllZzlnUXNvUUY2UklkT0JhQXFkR0VoS0FMb1FoQVVJMkhJb1BfemtRTW1QZy04X1BZczZjb2Z0c3kyc20tUmN5N2kta1JR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kymkemp.com",
      "title": "Redheaded Blackbelt"
    }
  },
  {
    "title": "Little-used ICE agreements with local police have exploded under Trump - NPR",
    "description": "Little-used ICE agreements with local police have exploded under Trump  NPREx-watchdogs warn rush to give power to local police in immigration crackdown risks ‘threat to civil rights’  The GuardianImmigration enforcement takes center stage at state level  USA TodayCooperation with ICE is the latest red vs. blue state divide  CNNAgreements that allow local police to work with ICE skyrocket  NBC News",
    "published date": "Tue, 17 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSUhJUGVfRndSMnloT2NSLUlzYXhHYlZ5ZHpKb1lscjA3RC1JeGFLY1RGLWZGTS1JLWZJbGpJNjF2MWo2UnNCRWRNd1YxTTM3b0RxczJDS2E5ZndNSWlnTGhYWEEzT1lhalJXYjZEWndTREFKSi0xTnRnMzB0UkVfTWEtSGprMUpOQ2oxa1FJdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics - NPR",
    "description": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics  NPRLive updates: Partial government shutdown over DHS oversight seems poised to drag on  AP NewsLive updates: Democrats make new offer in DHS fight; US takes part in talks with Iran  The HillImmigration officers seem to be trained to be 'nasty, mean and cruel,' Schumer says  PoliticoSenate Democrats send counteroffer to White House amid DHS shutdown  The Hill",
    "published date": "Mon, 16 Feb 2026 12:13:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNTVNGekdEdlBucXM1UF9NakV2M2dzXzZTNmFYa0xKQnkwcWtMS1c1UURJcGVUZlZ5T0J2ODlzNE9kYzZfT1U1WDVIWmtjMG1CcnZDVEVuQlo0MDlkeXFtWUxUek41RUswMXpkOXZwU2syV2xWUlFwTkZhQmNmVTF0WGhmeExMcTN2dGx3bnc0UFloZHo4cHNGbHBZZUQ1VS1uU3JBeEw3TTFicXBveXlvQ1Vpa19DSVV1a1RmVmh6YkxBTGJDUlBJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Iran fires missiles, Khamenei threatens to sink US warship as talks start - South China Morning Post",
    "description": "Iran fires missiles, Khamenei threatens to sink US warship as talks start  South China Morning PostView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 11:38:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNcmpVelhubjkwNDBmVWhEcndiQ21pQ1g3Z2lTNTNldHBiTUFBODlEZ0lRWVBlT0poeXN0eTVHMDBVWmtJY1lzWVo3S21nS25VSEd4ZWhoZWJ5SG9SeHdKQlRrTzNiblJsSXZIYVZEUko4azd5cngwMmxlc0haZEJGeGQ2UEhkQ1ItZjNzWmxJeGItVnBkTHhCNmMydHNhSEQzR0ZRdm5hVTRsYVREaThyc3RaVWpXU3NnN2Vqb0JWLVRCbk5ZLURsZWNyUWZxVGvSAc8BQVVfeXFMTlJCWElqaW1lU2VrbEttaGRULW5RdHR3Skk4WkFpS0l0ZWRTSVZjbWU2NFZWTzdrUGJLQjVKVmFTUW1aNmJkWXo2NHVlWnQyUTdCS1g4QkJZNlh6Z2JaVVRMVms0ZGFUMEJlZzNDdkhCQURKVFJkaVhFbkpYM3M3UVNCRk1rWTdsaEY4UjZaaWd2ekdKMGdyNFduRkkzOEtTdG11R0FVQ2FITHg4RFVKY3pKRnRRNXRSdmctd1B4bkFIVXhSRXA3UXhXcjNrQTBn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "Trump: Iran doesn't want consequences of not making nuclear deal with U.S. - Axios",
    "description": "Trump: Iran doesn't want consequences of not making nuclear deal with U.S.  AxiosThey were all but written off. Now Trump is reviving the aircraft carrier  The TelegraphUS increases military pressure on Iran ahead of high-stakes talks  CNNUSS Gerald Ford the second aircraft carrier sent to Middle East: Report  Military TimesTrump says he will be involved indirectly in Iran talks  Reuters",
    "published date": "Tue, 17 Feb 2026 04:21:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB3OVhBamN1UU93Sm50ZnJIR2I0R2c3cEMtNG9fR3NrZWR0THJBd200M21aZ1U1QUtiSzNmQnVEejFQVWlwRUJiNmllSEtoSS1ZRG92U2NocDhwaTU5dVdrWjFQS3NwLUNaZkhQMURlcFZiMmlTcmlVeE5yZ2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "\"Just making s**t up\" — David Roberts sounds off on the EPA - Public Notice | Aaron Rupar",
    "description": "\"Just making s**t up\" — David Roberts sounds off on the EPA  Public Notice | Aaron RuparWith Latest Rollback, the U.S. Essentially Has No Clean-Car Rules  The New York TimesTrump’s move ending power to control climate pollution could cost Wisconsin billions  WPROne of Big Oil’s Biggest Defenses Is Getting Blown Up  Bloomberg.comQ&A: What does Trump’s repeal of US ‘endangerment finding’ mean for climate action?  Carbon Brief",
    "published date": "Mon, 16 Feb 2026 11:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9WUU0zejRiNWE5ZlFxS2JWYnlEcUU0d2hrMDhtdWkyTlhFSmw2UjdySVEyZEh2QVVmMjN1QUd1b1NqRG96UWZVOVhURTJsc1JZc2p2cENSRHJvVC0wa3dCN044S3ZzeUEweGhEV1lDMUhSRjZGZWVmSnYwdjh5SGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.publicnotice.co",
      "title": "Public Notice | Aaron Rupar"
    }
  },
  {
    "title": "'Resign or be impeached': Watch AOC wreck Pam Bondi on the world stage - Daily Kos",
    "description": "'Resign or be impeached': Watch AOC wreck Pam Bondi on the world stage  Daily KosMassie says he’s lost confidence in Pam Bondi after congressional hearing  PoliticoPam Bondi’s Contempt for Congress  The New YorkerOpinion | Pam Bondi and the MAGA Brand of Insult Politics  The New York TimesDemocrats to Pam Bondi on Justice Department's Epstein files \"spying\": \"Stop now\"  Axios",
    "published date": "Mon, 16 Feb 2026 19:00:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxPSHl1enN5SVFqQnFmeldBZUV3S0Jhc3hER1dIY2JGUTByU2ZIQ1VNVy1WbHhHX29vTDhsbzZ6TlJlSVB2bVE4X3ltRWNqTnRGM1NsbVYxQWlMUEd0cGVsNmZ4UkxJM1hfWG9FLTZMa1RXQk5MZVk2aDYzT2g4Z3hRNjVlMnUzZXV2aEdXSXlmVjZWOERETlVHdHdMVnNmdnhjamFVNko3NUEwdzc2VkNHM0ZiUUp1OFVrRUtiVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailykos.com",
      "title": "Daily Kos"
    }
  },
  {
    "title": "FBI formally refuses to share evidence in Alex Pretti killing, Minnesota investigators say - CBS News",
    "description": "FBI formally refuses to share evidence in Alex Pretti killing, Minnesota investigators say  CBS NewsFBI won’t provide Minnesota investigators with evidence in Alex Pretti killing, state says  Minnesota ReformerFBI won't co-operate on Alex Pretti investigation, state officials say  BBCFBI won’t share Alex Pretti shooting evidence, Minnesota authorities say | Minnesota ICE shootings  The GuardianFBI will not provide the BCA access to evidence gathered from Pretti shooting, BCA says  MPR News",
    "published date": "Mon, 16 Feb 2026 16:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxObmc2dkNTcm42cXJmT09hRUpxVU1mYmhiUDBqVm1TUEVxZUNhcWdQRDNWX01YSjdxS0ROR3ktcjZMWTA5Ums1dnpvcXhad2VncWZuUzc3Q3poRmxoeTRrc3RfVmJxQzhidUo4b1A4dEZ5Ukd2Q2pKQldwN3JPdDV4by14UzN6TWN5YUVVeF9BZV9CaUNBeXM1S1JMUm1iV1YtTmdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "What's open and closed on Presidents Day 2026? Here's what to expect on the federal holiday. - CBS News",
    "description": "What's open and closed on Presidents Day 2026? Here's what to expect on the federal holiday.  CBS NewsIs mail delivered on Presidents Day? What's open on Monday, Feb. 16  USA TodayIs Costco open on Presidents Day? Holidays Costco closes, hours today  Asbury Park PressAre banks open on Presidents Day? Federal holiday means bank, mail closures  The TennesseanAre banks closed on Presidents Day? What's open and closed, from schools to the stock market  NBC 5 Chicago",
    "published date": "Mon, 16 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1YUXpYX0p0emxVQWNQMFhMS3ZDWnhMbldNbnpEYUN4aWlpdWx2NFZKYWlacGhZMThONDBOaGU0bjgyTU1OcTQwclpxa1poQ3B2MUNKY3ZHak15eERxMHJGajV1UUFtVU9xNVhPbFIzR0JRYTJXUFHSAXtBVV95cUxOaHFWaWhkWmxucFJTcGtUdkZ2RlhpUW5tQnU1QmxuTmNldDBsVXZiTTNSc0tXMndrVndLbUxZNUNETUpnSTQxbnFROVJoWlJqaHdnOW9CMEs2b01xc01wbXI3aXRJVHIzczZ1ZVIwYThQWV82TU4zbi1ick0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "The U.S. ready to make up, Europe ready to break up in Munich - NPR",
    "description": "The U.S. ready to make up, Europe ready to break up in Munich  NPRMarco Rubio’s Impressive Speech  The AtlanticThree American Speeches at Munich, and Plenty of Confusion  The New York TimesSecretary of State Marco Rubio at the Munich Security Conference  U.S. Department of State (.gov)CNBC Daily Open: Rubio reassures Europe while U.S. CPI calms investors  CNBC",
    "published date": "Mon, 16 Feb 2026 19:49:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5seVFLZE9pRjJNWGNEVldfOWhoVkt5Qnh6WjhLZXVIUExzZnBIM0JMXzQyUlU5MkdaVzBwcHZhX1pycnU4VHU5eWFuVVVHdmpFcXpGc0N3ZmJOZFNFcHdpNTFaQlZuNmdOZi1nUEl5RW42ZFo3SFc5LURaOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Winter strikes back: Blizzard warning North Shore; Twin Cities accumulating snow Friday? - MPR News",
    "description": "Winter strikes back: Blizzard warning North Shore; Twin Cities accumulating snow Friday?  MPR NewsOne more warm day before a winter storm moves across Minnesota  5 EYEWITNESS NEWSFirst of two winter storms moves in later Tuesday  MPR NewsMinnesota weather: Mild and breezy Tuesday before rain and snow move in  FOX 9 Minneapolis-St. PaulSprawling winter storm stretching 1,000+ miles to bring dangerous snow and ice across Northern Tier  FOX Weather",
    "published date": "Mon, 16 Feb 2026 22:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNNzA0WlIwUDNEdTFOWlo5QUFNRGV5aktlN3dWc1d3QmxwcTNIbjdaMkdBaHd2aXQtREl4OURWOU4zbTlPV3dWM3JkZVNKb2E0YTZXeEFxdUdURlhTNkg5Xzd3SjFtcmtCWUhFZDVidVhPbUI5QUJadGRjRzNQcWp1MW54eGR2WFZqd0tuSnBBTE5sMmxZaEpMa2FWYzQwOWd6clRQM29US2VZaU9TQmZJRURvTDMzU003Wld2c2JNRzJkTGNN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Obama on aliens: ‘The odds are good there’s life out there’ - politico.eu",
    "description": "Obama on aliens: ‘The odds are good there’s life out there’  politico.euObama clarifies alien comments after telling podcast ‘they’re real’  CNNObama clarifies views on aliens after saying 'they're real' on podcast  BBCObama says aliens are 'real.' Congress has heard about UFOs for years  USA TodayAliens are ‘real,’ Obama says, as Washington shrugs  The Washington Post",
    "published date": "Mon, 16 Feb 2026 10:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxORUl4QTJmbWQyZE9yV1c0aGlWcXJmV2stMVFTRXo3S1c3OUplQTJOb0pGMVBVWnQ1eTlEMFR4dzhPZzlEUEpXdnVSYnpKTXl0cU9LWU1qampwbkM1MDNjcFgyblVWLXQ4cFc1bTlFUG1ma2ZfM0NqOUV1WFh4Z2FPRzBDajFwNTYyU1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Hochul, Mamdani announce $1.5B for NYC budget ahead of preliminary plan - Gothamist",
    "description": "Hochul, Mamdani announce $1.5B for NYC budget ahead of preliminary plan  GothamistState giving $1.5 billion to NYC to help fix massive budget gap  CBS NewsMayor Mamdani and Governor Hochul Announce $1.5 Billion to Help Address City Fiscal Challenges  NYC.gov‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesNew York City’s Looming Deficit Threatens to Curb Mamdani’s Ambitions  The Wall Street Journal",
    "published date": "Mon, 16 Feb 2026 22:56:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQmVqRUplaFEtaHctUUVDbzV2WlFGWlo4YzlqWGpta0VyanQya1BYSjYzQ290WVhvRGI5REFYZzZlTFBvNDNUa2V6cWRuOFZyN2NibEI4LUh1TEdIMUFXT0tfRDZVQ2xQNFhwUkRzMG9KbFdFMHRiXzV2WUdaSDJrV2xmQzcxNTFGdjc3Zzk5a1NOYi15VVk5R2lUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "Attorney General Paxton launches investigations into three Texas school districts over students protesting ICE - The Texas Tribune",
    "description": "Attorney General Paxton launches investigations into three Texas school districts over students protesting ICE  The Texas TribuneTexas attorney general’s office to investigate more school districts after anti-ICE walkouts  KXAN AustinTexas Students Protest ICE Despite Gov. Greg Abbott’s Threats  The New York TimesDallas ISD, two other districts face AG’s investigation over student walkouts  Dallas NewsSan Antonio students from 50+ schools hold anti-ICE press conference  WOAI",
    "published date": "Mon, 16 Feb 2026 19:33:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOZVJ2dU5lUTJJc1N0MG5rUk9UUXdvNzZMSFRDNm9ZeG8xcUVSUnJ6djZXa2RZYWRFUTZiU08xRU05dm0wUjI3Z3hmeTd1Q21oMXpVcThHdGw2TXd3ZTVWRm1aSVVGcllGS1EtR0NKSjFxOFFIQmRZWWloZEVxOXNsMEd3R0hhU1lqOTVNM0VyLTRSUXMweVkyUVo4TllsdS1sOVJxWUpLSmZISm5w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Trump rages against Gateway tunnel project, threatening to withhold federal assistance - Politico",
    "description": "Trump rages against Gateway tunnel project, threatening to withhold federal assistance  PoliticoTrump Administration Tells Judge It Will Release Gateway Funding  The New York TimesTrump Says Government Won’t Pay for NJ-NY Tunnel ‘Cost Overruns’  Bloomberg.comGateway Hudson Tunnel funding resumes with $30M payment  GothamistTrump slams the Gateway tunnel, saying it will be billions of dollars over budget. Here’s how N.J.’s governor  NJ.com",
    "published date": "Mon, 16 Feb 2026 23:25:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPRXNfNmE2VV9Ob0pRVmN0TkN0bklTSTZaSXNhVmZCMTAzMjNabDhQbVp1MGliZ3VtQmhXSmozQ2xhRXo0RDVSSnFLcVJDYWVYRUlJRmZGWFRvMDFwWF95ODZCUllYSG9UY1AwN1dPU2NYcGQ5SWRyc0VTRDZwMzZJd0VvT2tJZ3BlVlo3NmgwZ3owcjVjQXZRSG9oWkdXbXl2OTFya2Q2YUZhbjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Warehouse owner won’t sell Dallas County property to ICE for migrant detention center - Dallas News",
    "description": "Warehouse owner won’t sell Dallas County property to ICE for migrant detention center  Dallas NewsOwner of North Texas warehouse says it won't sell or lease to feds for ICE facility. What comes next?  WFAAMassive Dallas-area warehouse will not be used as an ICE detention center, developer says  CBS NewsBREAKING: Company will not sell Hutchins warehouse to ICE.  D MagazineNIMBY Americans don't want human warehouses as neighbors. Weird! | Opinion  USA Today",
    "published date": "Mon, 16 Feb 2026 18:50:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQVm1rNlhkdVZ2VkFzc0V4NFB0TE5oZVVPVVl4dkt6SmlxcThZVFZteW5YbkxCQVoxNGRWdlNiUTdaNGtsaFdIS3M3eWdRZ0F1NTg0Q3d2QnVmOHFsMGw0aG1iRWNMdXB5Z05WVnhGNUlZNC14alVZVy04ZjRKdFhzYUd3STR4enFkYUpQVFNUT0xYWGdKdFp5cDJRb3VMblNacVV2R0RjNFZLNDlxbTR3VDFyQXJtV01Ed0lUcEpOXzkwWjNyc0tqUENYQUNubVpkLUZkZVZMVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dallasnews.com",
      "title": "Dallas News"
    }
  },
  {
    "title": "\"Unprecedented\": Trump administration losing credibility with judges and grand juries - Salon.com",
    "description": "\"Unprecedented\": Trump administration losing credibility with judges and grand juries  Salon.comTrump's revenge tour falls flat in the courts  AxiosMore and more ham sandwiches aren’t getting indicted nowadays  The Hill‘Stunning’: Jeanine Pirro’s Failure to Indict Democrats Is a Big Deal  PoliticoSen. Mark Kelly's lawyer urges DOJ officials not to seek indictment for a second time over video  NBC News",
    "published date": "Mon, 16 Feb 2026 11:00:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPLVB1VjZ5MWhLb2VfeXppb3J6OEhvQThkZDdZM1hzVTJObkZIeHh3bGN1YjRJb1V4X3QyMk5KbXFZdGI4V1JNYWxwazRqYzF3VmJNSENRNHVUZlVDSkxLUW9QeGdBRTctNi0xcVVoNS1lcFoxQWdOUE0yU1E5akx2czJqbnlpUFhpZzU1WXl5a0YybkFZQjlvWkZtR21BZmxiNDJFMXRVVzB2WFgtdmt1TjJSMmMyQXp5MjAwZHJuenZLUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.salon.com",
      "title": "Salon.com"
    }
  }
]