[
  {
    "title": "Scoop: FBI chief ready to head to Tucson as Trump pledges help to find Guthrie's mom - Axios",
    "description": "Scoop: FBI chief ready to head to Tucson as Trump pledges help to find Guthrie's mom  AxiosSavannah Guthrie posts video message asking her mother Nancy's kidnapper for proof she's alive  Yahoo‘We are ready to talk’: Savannah Guthrie makes plea to potential kidnappers - Latest  The IndependentSavannah Guthrie’s Missing Mother Has Nation Fixated on an Arizona Subdivision  The New York TimesSavannah Guthrie pleads for mom’s return in new video: ‘We need to know without a doubt that she’s alive’  CNN",
    "published date": "Thu, 05 Feb 2026 02:37:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9VZk5iTHJEQUxOejdjVEpZUnlNV3huOTlNUWdqZWlMRkJLMHF2OFhNX295UV9qb3ZZVUR1ek8xczhzM1lzak5OMDlmR1J3U2dTeDhDZHp1UmYwZzVHTG5HdU1OXzdhOFVYMmdkYTczOE5XNnhsZGxuYjRPSWJaUDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Would-be Trump assassin sentenced to life in prison in Florida - Politico",
    "description": "Would-be Trump assassin sentenced to life in prison in Florida  PoliticoRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesMan sentenced to life in prison for 2024 attempt on Trump's life  BBCRyan Routh sentenced to life in prison for Trump assassination attempt  AxiosTrump shooter faces sentencing today. Here's his request to the judge  The Palm Beach Post",
    "published date": "Wed, 04 Feb 2026 20:50:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOMk5paHNPeEcwbGxiRXc5alNLMnkwbXBoNkN3U09IcFhxOXdBUWs1UENVWDFSMEQ3QjlSSHd2aUFZUmgtd2hzcE5zSnJhYVprUFZFWk5yY2FHV19fUURLQzZXZGw4VXpGU20ybmhKRlVENUZkNkdNQU9vRTc2Rk5jUktxejZxYVNabVh5VUQycml1ZzhnU1JhTGRNZjBsQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "USC names Beong-Soo Kim as its ‘next generation’ president - Los Angeles Times",
    "description": "USC names Beong-Soo Kim as its ‘next generation’ president  Los Angeles TimesUSC appoints its top lawyer and interim leader, Beong-Soo Kim, as next president  LAistUniversity of Southern California Names a Lawyer, Beong-Soo Kim, as Its New President  The New York TimesUniversity of Southern California selects new president after nationwide search  KTLABeong-Soo Kim unanimously elected 13th president of USC  USC Today",
    "published date": "Wed, 04 Feb 2026 23:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOVDNNTG15T09LbWszZnQ5YUhMdGduMDl3UU05NGpJUnl6LVdQR254dTBIdzBVbzNrR3dFNGtIa3NDVWg2YkJjNk5iR2FLdnlDUHBZYzMtOF9aendtYUxlcDQ1MHFXSDg1ZUZoOE1KV1BENW0ta0N4TlJLdGZBanpfZldmeGtsZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - AP News",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  AP NewsOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesICE Isn’t Just Breaking the Law. It’s Trying to Rewrite It  Bloomberg.com‘Defies human decency’: Oregon judge says ICE can’t make warrantless arrests unless there’s a flight risk  KOIN.comICE can't make warrantless arrests in Oregon unless there's risk of escape, judge rules  NPR",
    "published date": "Thu, 05 Feb 2026 03:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPQXRWY05fTzFjT2tqWEJ3eDJxNnBxZ0t3YkszR083UG1oc0tvT0R5WUIzRmo1SHBac2pTN09zelUwZWg2YU56M2JTQmFSOXRWYldnczJIRnMyUW1YQURZaW5ua3F1aC1QeUdxOTBtbFJUWFV4eWFZUlpwbVVJaDNVQ3NuUmJtNUo5WTZhenI5dWRUZ0Fnb1d6WlprX3JYTnV5X2sxOUlmRHM4eUtXX2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Border czar: End of Operation Metro Surge depends on behavior of Minnesota’s activists - Star Tribune",
    "description": "Border czar: End of Operation Metro Surge depends on behavior of Minnesota’s activists  Star TribuneTrump touts 'softer touch' on immigration as federal force is reduced in Minnesota  BBC‘Nothing has really substantially changed’: Homan’s efforts leave Democrats unimpressed  PoliticoTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsSheriffs in two biggest metro counties mum on whether they’ll agree to ICE deal to end surge  Star Tribune",
    "published date": "Wed, 04 Feb 2026 23:25:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5zUkRKVjRDUlZKc2xULW5Fd1dwMUNUOHRzYnNBNGtXVzdCTmNDWUdhanQxazJqSUc2b21udlh2d0RtNTFXOHZvYXdvWnFUM1hXby1MVk0yNUNnZFZLS2I0QzhRVUp1VTZvX25TVGRVOGFDRWNJaVp2elZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Don’t mention ‘Article 5,’ Finland warns US on Ukraine - Politico",
    "description": "Don’t mention ‘Article 5,’ Finland warns US on Ukraine  Politico",
    "published date": "Wed, 04 Feb 2026 23:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxObTMzOFhLU0FRTmRRRFZEaVREMGxUYUliMndud195OUt2Y2prNWU5UzVPbktTS0M2Z2I3SEs1dTRxLTVIXzhXekc3N1N3UmNtT3VMRndodG9VbmhhVE1SMTJJNkIxV3FlOEhmdzZXZmlITDJsTktVMmoxNnJfR3pBdW1Ydmx1aFhfdVlzUVNxWTMyQVZsenRSRUpJdUtEb21jVWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders - ABC News",
    "description": "'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC NewsTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  CNNProsecutor Fired After Voicing Frustration With Immigration Caseload  The New York TimesICE attorney to judge: ‘This job sucks’  MPR NewsTrump’s occupation of Minneapolis has broken the Justice Department  vox.com",
    "published date": "Thu, 05 Feb 2026 00:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPOFh4Y1ZDMWZ5elpEWC1Jc2RINlJRZ0pJR3NlU185azJVYk5tQUluSUVhWm1yUTgzWGF1LTdaNGlEYlNRNXlXbWw5WVk5eVVNWDU2eEZfZndmbWYtWTN3Y25IbGU3Ul8xOGhVb21HR2daSXc5bEJfaXBlVUFzX2tYekhPRjVPUWV6UzlhQzl5U1FLeS00YjhfWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court lets California use new Democrat-friendly congressional map  CNNUS Supreme Court rejects challenge to California redistricting map  Al JazeeraGovernor Newsom on Republicans losing challenge to new Congressional maps at U.S. Supreme Court  California State Portal | CA.gov",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Scott Bessent’s ‘gotcha’ moment on Trump’s tariffs and inflation: He denies writing ‘tariffs are inflationary’ in letter to hedge fund investors - Fortune",
    "description": "Scott Bessent’s ‘gotcha’ moment on Trump’s tariffs and inflation: He denies writing ‘tariffs are inflationary’ in letter to hedge fund investors  Fortune'Can you shut him up?' House Democrats clash with Bessent in fiery hearing  ABC NewsTreasury Secy. Bessent Testifies on U.S. Economy  C-SPANMaxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  CNNUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  Reuters",
    "published date": "Wed, 04 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSnFaU0kxb0NBcFB0enR5cTR4UUx5ZF9TendoRjRjeDhpTmp3RUg5QkI4N0Z6aW9jZ05xVm5YcFJlZ2g4S0MtLTVrUmpwUmNGbnRRWDNVd21lSlN6RHhDN1hqTWFEMHNNOUhfNTdQSXNyRWc5MUgzUzhOYnA1VU56SDRiZU5LeUExX29vUDRVUlBtMTg3YVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPRTrump says America should move on from Epstein - it may not be that easy  BBCNew files deepen a critical mystery about those who partied with Jeffrey Epstein  CNNEpstein files rife with uncensored nudes and victims’ names, despite redaction efforts  AP NewsLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm - The New York Times",
    "description": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  CNNSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC NewsTrump doubles down on suggesting federal government 'get involved' in state elections  ABC NewsWhitmer on Trump election take over talk: ‘Won’t happen on my watch’  Bridge Michigan",
    "published date": "Wed, 04 Feb 2026 21:02:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOakM4RDB5eU1VUzc2NUpSQW9RMTJpaEx2R3BhWUtCTlhtd3NRVFZjVzFKdWJ1eGNLMXMybktzVFVYSlhHa2FUTkZ5M0xCb2dSelQwenl1dmJNdDB1elJPNkxtWlJSLURhdFV0Q2hySkpiM191aW1POEJ3YXJ1WFhLbjBjUDdicTJaT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Texas A&M professor files suit after firing over gender identity lesson - Politico",
    "description": "Texas A&M professor files suit after firing over gender identity lesson  PoliticoFired after gender identity lesson, professor sues Texas A&M, arguing her free speech rights were violated  Houston Public MediaTexas A&M professor files lawsuit after firing over gender identity lesson  ABC NewsTexas A&M Lecturer Who Was Fired Over Gender Lesson Sues University  The New York TimesProfessor fired after viral video sues Texas A&M System for wrongful termination  KBTX News 3",
    "published date": "Thu, 05 Feb 2026 02:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOODA3c0ZBSGc0a3dLQkpLTTJTZ3c5SUlockRxYW5EVXBvVXV3dEk1dWZtSzFTMlU1UDF2QUkwM3NzdmxiTERNWTNtMi1Hb3ZnZzdBWFNHblZWeXVMNUcxaVFJUEg1TlRRLXJyaFRySTZERGxRd09DRThJRkRkdHVXUW9HNmpROTJVM1A1X0ZpRF9UNUJiZGs3S0FTUXVZaUtGb1VFdU4xUVpQcHN4OUM0TnpLQ1gyRTZkTEVfRmd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasLas Vegas biolab: Answering some of the biggest questions still looming  KSNVSuspected biolab discovered in Las Vegas home sparks federal investigation  CNNWhat to know about suspected biolab in Las Vegas  The Hill",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Dems outline 10 demands in letter to GOP leaders in ICE funding fight - Axios",
    "description": "Dems outline 10 demands in letter to GOP leaders in ICE funding fight  AxiosDemocrats plan DHS funding offer as Thune floats long-term punt  PoliticoProspects for ICE deal sour on Capitol Hill as shutdown deadline nears for critical agency  CNNIn Spending Talks, Senators Clash Over Immigration Crackdown  The New York TimesTalks in Congress to overhaul ICE are already breaking down  MS NOW",
    "published date": "Thu, 05 Feb 2026 04:46:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOb182ZnVxQUkxdi16YWtRWFpXLS1OZmJSTEQzdE5haHc1X2JGbmNrbHM4NnNvS2kxbWsyWmVtclIzVTBiajFSVUVKdHNOenJ1YngyR3hlaW1YWlphNFg5V3hOVWhSQU5EOF9HTlVvYXpXY3NyamwtMk1CVnpCU3NITnBQanlPWkkyU3pYcFYya1RGa3Vt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "US and Iran talks brought back from the brink after White House relents on move to Oman - The Guardian",
    "description": "US and Iran talks brought back from the brink after White House relents on move to Oman  The GuardianU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosUS and Iran agree to Friday talks in Oman but still at odds over agenda  ReutersU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street JournalMediators propose framework for crucial Iran-US talks this week  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 19:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbFdEdGc0cVJSNzBpeFdZSEpJQnVDU3Y5SlhfY0RzcFJIeVQ3dkQxOEU0X21KN0s4ek5ieHZieUpVdW81WHVKZ0JHY0FUUS1MLUdSYlBTb2pWRnltY3RFM3pCbHpPWjZzSDR6U0hpU3BaSTZ4TnZPREZOTFdtUmJLM043aTdlRFVKY0x5cklYaTRjWkVNUnpF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "S.F. teachers on brink of a strike even as fact-finding report favors district - San Francisco Chronicle",
    "description": "S.F. teachers on brink of a strike even as fact-finding report favors district  San Francisco ChronicleState report moves S.F. teachers’ strike closer. Walkout could come in days.  Mission LocalSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoCalifornia faces teacher strikes across state for better pay and work conditions  The GuardianWhere will 50,000 kids go during teachers strike? SFUSD and union offer half-baked plans  The San Francisco Standard",
    "published date": "Thu, 05 Feb 2026 01:51:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTnRqVWctVGx4dkhuNUdjOG01U1lRRHdZU0dELWE5YktudTZqYlN0aVZ6ZWl6QUhSTG1temlhN0RBWVp0RmEwWUdsb3BqUEsydjJ0c2s4ZUVGNUtUUU1ITElpTk03WWRUVVdoRnNMcFpSQXhiWXhEQXlpWDdnSTROYS1JV05fbjA0dEozSWViQXRRX2tVT242UFpPUTN3U0hYLXpvRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "White House seeks critical minerals trade zone to curb China’s dominance - Financial Times",
    "description": "White House seeks critical minerals trade zone to curb China’s dominance  Financial TimesU.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalChina criticises US plan for critical minerals trade bloc  ReutersUS pitches plan to counter China's dominance of critical mineral supply  BBCSecretary of State Marco Rubio at a Press Availability  U.S. Department of State (.gov)",
    "published date": "Wed, 04 Feb 2026 19:53:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1IbXY3UTBreUNtZkpRMTJDcVhzdWRHdDRlNzQzclpXVXBVWkV2cElkeUswUUZVU1p0Y0hZSDBkZ2djazBNYWpBdXVBalMtN2dJX0YwQXFkSl83ZnVwQUpjSVg1MnNYVWhsLWxBSXpaY2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent - The New York Times",
    "description": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent  The New York TimesAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsClintons reach deal with House Republicans to testify, likely avoiding contempt charges  PoliticoClintons agree to testify on Epstein. Here's what the files say  AxiosWhy the Clintons reluctantly reversed course on contempt strategy  The Hill",
    "published date": "Wed, 04 Feb 2026 21:23:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU2h2dDUwNk9TbHNIblNvaU5lTDZkR28wQU85NTNNUXNfMHJzczZhX2RjeGEzdXNTLWFqZ2RjbklfMlhWalpRSDVZSlJWTEROdU00VGUzTzFWWFFudWwyTTQyNC1mSTZyYnVTQkJoR05FMnVZZXlMSjFXcHV6OEpCMldwNXhJVk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Fulton County asks court to return 2020 election documents seized by the FBI - PBS",
    "description": "Fulton County asks court to return 2020 election documents seized by the FBI  PBSWhat is happening in Fulton county is a warning to America | Jamil Smith  The GuardianFulton County in Georgia Challenges the F.B.I.’s Seizure of 2020 Ballots  The New York TimesThe Trump team can’t get its story straight on the president, Gabbard and Fulton County  CNNNews Wrap: Georgia election officials seek return of materials taken during FBI raid  PBS",
    "published date": "Wed, 04 Feb 2026 19:57:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQOXhhd3pzNnNoVnJLOC1HcERrbThYX0Npc1pCM252dUd3ZmNoVzRqdnhoT1Vfc0ZjdS13d0lYSWRpRjZHWE04VHh0VnZzWXVwemJ6MjBjeGFNcms1N1pJOEsyR0xEZmxDQVFkbUhHOElQTU5RTW0xNU0zY29wYmh6NEdUQ1JKeWF1TkdNOVFHQWhyRVVXNUFUUnd0SXdhYTF0VjA2YUhQSFY4Qlg4WDAyVzhQQU3SAboBQVVfeXFMTm5MMWFmODJjMUx0aW1YNmtIRlJRUW9nTkVjTW13WW5tV09Wck9kREdVQk1Ob2d5bnVWVWJ5ckVHdmNEQ1RSNjJicFlYeUl6RW9SazhGTWQyXzNNY2NWY3ZFUnlfWE9IRXdEM2VDQnQ4aHpYY3JEeDI0dWVIT3otdUpuZFpLMk5FdkNWaC1RRHNsUnRFdnRWSVhrc0syMVcyRXNQbDFGczdOTkJGaGtpaDJDNC1IOUNaSnFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoSteve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketSteve Bannon Proposes Using ICE in Elections  NewsweekBannon: ‘We‘re going to have ICE surround the polls’  The Hill",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  Los Angeles TimesSeven candidates faced off as KTVU Fox 2 aired California’s first statewide gubernatorial debate of the year  KTVUSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostThey want to be California’s next governor. At S.F. debate, it was hard to tell them apart.  Mission Local",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Trump’s ‘Prison Camp’ Threat Sparks Widespread MAGA Backlash - Yahoo",
    "description": "Trump’s ‘Prison Camp’ Threat Sparks Widespread MAGA Backlash  YahooICE buys warehouses for mass detention network, rattling locals  The Washington PostTrump’s New “Prison Camp” Threat Unleashes Fury Even in MAGA Country  The New RepublicDHS buys Schuylkill County warehouse for nearly $120 million  WNEPBlue Owl Fund Sells Warehouse to DHS for ICE ‘Mega’ Jail for Nearly $120 Million  Bloomberg.com",
    "published date": "Wed, 04 Feb 2026 20:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPMHVYbjBpQW5KSm95ejF5SW1vVWE1aW81WTkyZEE3cGFnYkRVOHltdWhMenAzZGg1YVJrY2oxMnp4bEI5Skp3NlJod2tBaV9UdXhPY2s2Rk1UX0xVY1dGVHdTWU05M3hvTldCYk9ZVjVJeUcwcWZ4cGJwS3Z0Y21LSVRBSmxTU1J5S1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "House passes measure to force DC’s hand on tax cuts - Politico",
    "description": "House passes measure to force DC’s hand on tax cuts  PoliticoHouse rejects D.C. tax changes, potentially costing the city $600M in revenue  The Washington PostHouse approves bill to prevent DC from opting out of Trump tax cuts  WTOPHouse GOP moves to block DC from stopping Trump tax cuts for tipped, overtime workers  Fox NewsRepublican bill targeting D.C. could create tax season chaos  The 51st",
    "published date": "Wed, 04 Feb 2026 18:47:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQTExlMnU3c0VOclFCeUd6TFhtRWV4ZmY5SlFld3hza2JxQThNQ0hrNkhzbGRHRlJxZElpSW5zQU52OEFYNHN3bmF1NlpxYlV5ZHNtb0daUEZxS1JWaGMwZWFsd04zNUhMY25ZQW9JV2xzZUhPb3RKOTh2Zk9CaFVLSjAxNGxEWnlUMUF2WVZPN1F1MjhRWGs2NUNkb0xNVlNjenRuLWUydk1nTDRORVA5Y250SzhfTVdka1JB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal - ABC News",
    "description": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsNew Marquette poll finds majority of Americans say Renee Good shooting was unjustified  WISNMarquette Law School poll: 40% approve of ICE performance, 60% disapprove nationwide  WLUKAmericans Continue To Sour On ICE  Navigator ResearchPoll: 62% say ICE went too far in Minnesota; 67% back local-federal cooperation  KSNV",
    "published date": "Wed, 04 Feb 2026 22:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWlhVUnpBRVVkTE9pNTdMdlpxTlBob0puN2wxQ0RRcU42WWVobGt2M2drclB6OVJyR05QV3BKNXNrdUUyZjdEWi1mVE5rOWhkLUg3aTZ3T2pheGdNRFNDTEJMb3RZODBxcEtZUVBrYXZ0NEgyb2ZGeHl2bkZvNFNoU1ZfSzFEZ0ZMdVhib0tXbVpWT3VhVTJqVDJERjgzWllUYThR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show - NPR",
    "description": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPRThe Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesDoberman pinscher named Penny wins best in show at Westminster  ESPNThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The GuardianWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBC",
    "published date": "Wed, 04 Feb 2026 13:36:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZGhHTHFvRHpyZ1VXMWgwV1FkdU9POHZUTzE4WGtNc3Q3aEc1alIzVktxb1hGRUlyQXk1VXZWcTBTNWtmRnktczdzdGh2aHlKTGNURVB1RjFmNmZDUlZsSXVBd1FNWjZDTEJKa3NDSlF2ZHNabHJpbkF3WGxkMzcxUXVCcDhOUjBQREtMaEN0VGJlbHpxRFRwSms5RHNmal84WVZXWjhhSEhqUEJHU0ZmbDJxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets - The White House (.gov)",
    "description": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets  The White House (.gov)SCOOP: Thousands of violent illegal immigrants arrested in Minnesota as admin vows ‘we will not back down’  Fox NewsICE arrests criminal illegal alien, sexual predator with final order of removal in New York  U.S. Immigration and Customs Enforcement (.gov)Questions raised after DHS releases new Operation Metro Surge arrest data  5 EYEWITNESS NEWSKTTC analyzes federal data pushed on Minnesota ICE arrests  KTTC | Rochester, MN",
    "published date": "Wed, 04 Feb 2026 21:19:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOb0RaQTY5QnR0QWpBXzdpY2VHSENIUUFLWm40MW5kRWtWblAtMFlleDFfdkpiV2JRaXVUaXY1a0RlUG9KTTVobTE1NjVXaGpBNjBZRUpFV2tqb20wMkxIa2FKODNEMWM5QUotZDRRUnVCU1Z3VjNPR3V6ZDhYR1htdk9JOHZiS05DbTNSNllFdlBsa29MMnpxMXk1aDFDaWRkRDVZSVhnT3ZKY01ZUXJvUENJaG5RUHZuZVRwS2IxWVRKZEFOV25KbDVLYzNUWnltOG1N?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Virginia Supreme Court will hear redistricting challenge - Politico",
    "description": "Virginia Supreme Court will hear redistricting challenge  PoliticoVirginia Supreme Court gets chance to revive Democrats’ redistricting plan  Democracy DocketWith General Assembly Democrats deadlocked on maps, Texas results pose a question: Does Virginia really need to redistrict?  Cardinal NewsLucas says proposed new congressional maps are expected this week  WVTFDem infighting muddies Virginia redistricting  Punchbowl News",
    "published date": "Wed, 04 Feb 2026 21:04:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPMGpDcS02QmJUTGZhcjdZR0dCWnRZbnBaZ3lYNHJaRlltNkJGbW52YzlVS1dZOWhzaXN3dG1iTnQxSUFIdHdhZ3AzalFXZndUZkRxX0RjWGVXcGxaalVWVVgyNTl0Wl9oWUEtYWJGcUdueGUteURKUWtwVzJCU0NJVXJTYl8yOFhXOGkxczBTQTNxS1E3Y3plRGZ1Mlk2OU95ZGZaYkk3aDJiQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Spanberger orders state law enforcement to exit federal immigration agreements - VPM",
    "description": "Spanberger orders state law enforcement to exit federal immigration agreements  VPMMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Virginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.orgGovernor Spanberger signs Executive Order and Directive, establishing principles for Virginia Law Enforcement  WSLSGov. Spanberger signs executive order to review law enforcement policies; GOP responds  WDBJ7",
    "published date": "Wed, 04 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOLTNVOWxjYXFzYkZUdFNtcHhJOXAxUkhPQ0tVb1JLS3pMSktqX3pTU1MxS1ZTck00ZzhtY1FlTGZhOU1CaFZEYWQ3MmhLYjROWkttY3BaejRnYVk4OWxiRW1KY0hsVWZsOGRuMFBzdnA3S3VaaHJhTEx5OWpoX0p6M3NGOG9LT1gzUVNPUmhqeU12V250UFRhOURRRDMycFFNMU8tbHFvTlpHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsRussia-Ukraine war live: Second day of US-led war talks start in UAE  Al JazeeraRussia and Ukraine Resume Talks After a Huge Attack by Moscow  The New York TimesU.S. joins new round of talks with Ukraine and Russia, but Ukrainians skeptical of any major breakthrough  CBS NewsUkraine, Russia wrap 'productive' first day of US-backed peace talks  Reuters",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed - Quinnipiac University Poll",
    "description": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed  Quinnipiac University PollHow bad was Alex Pretti’s killing for the Trump administration? New data tells us  CNNMajority of voters don’t trust Trump admin’s account of Alex Pretti killing, poll finds  PoliticoMost Americans support independent investigation into Alex Pretti shooting  AxiosSupport for immigration rises, Trump approval rebounds, Iran, the Super Bowl, and the Olympics: January 30 - February 2, 2026 Economist/YouGov Poll  YouGov",
    "published date": "Wed, 04 Feb 2026 18:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBhWU1ibUFWZmkwZFozSlpXNUlCZE5QSEZka2JUVG92dGJENGVUMlNRRnppejB1d3h1QlFMbEU5NGRaR2pWR1lhTzljZ1BkTm10M0Q0UTVFaGJJcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "Judge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’ - CNN",
    "description": "Judge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’  CNNTrump waited 'too long' to seek moving hush money conviction to federal court, judge says  ABC NewsTrump tries a third time to move hush-money case to federal court in bid to get conviction tossed  NBC NewsJudge appears skeptical of Trump’s latest bid to nix his hush money conviction  PoliticoTrump’s new ammo to toss hush money case conviction  The Hill",
    "published date": "Wed, 04 Feb 2026 21:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQMTZQVjNLUmFwQmhJR3pFYnJaaVZJd3pjOHBTNlEzbEMySmgyRUk5WjBqLUxUS3QzTVFIQS1raU5FbjVzOV83SVhCQ21vVS16aVhObV90ZURMTXZFLUM0Y0IyaUp4VHZuWjM2R0RyMkd1bTZUZHd4R1E3aWpWZEFqX1pJUFgtRTA4cDZuLWM2LUhKc1FQb3FDWWVWVHVvM2lIQXE0TnZ2VDM1NXl4NTcwcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Texas families can now apply for private school vouchers. Here’s what to know. - The Texas Tribune",
    "description": "Texas families can now apply for private school vouchers. Here’s what to know.  The Texas TribuneApplications open for Texas Education Freedom Accounts. Here’s what families need to know  Dallas NewsAfter years of debate, Texas' private school voucher application opens this week  ABC13 HoustonTexas voucher applications are open. These schools are still left out.  Houston ChronicleMAP: More than 500 Houston-area private schools approved for Texas voucher program  Click2Houston",
    "published date": "Wed, 04 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOWktSR2hCWGhiOUZoN0RSR0tRb0RwQmktWC1GNm1UQ3RVRFRMWVZuX2J5akRWN1NzaXpiWXpLbklHczJCSWNwN2o3NVB5eldXenFoS2hhYVBVbVNWWHk3dklCY1Aydl8xTDI1SW1HTnVEc0xLbngwTEQ0Sk0zLW5kbWd5R3dXTjcwd1paSjBZVm4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Hochul taps former NYC Council Speaker Adrienne Adams as her running mate - City & State New York",
    "description": "Hochul taps former NYC Council Speaker Adrienne Adams as her running mate  City & State New YorkBrooklyn Dems pull Hochul endorsement after LG pick  City & State New YorkNY Gov. Kathy Hochul picks Adrienne Adams as her running mate  GothamistHochul Chooses Adrienne Adams to Join Her Re-election Ticket  The New York TimesWhy Hochul chose Adrienne Adams as her lieutenant governor running mate  Times Union",
    "published date": "Wed, 04 Feb 2026 17:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPNms2NFJwUFB4N09RbEFCSkJVc3dya1U5Mm5TZ2ZLVWZnZWZ2SFNxLTRWTU51ZjMwS0VELWd4SjZtbDFZRnJhQkZmOXVudVBQYlJrV2t3VG10Q0NKazdjOEdSWlM1ZHViUGVNU2xET1FwSFd5dmlhMzZGWmM1Yi1TNmp2dmtLSTQzYl82bnBQbXhnb1NfbWpOSU05Y0xkRHJsMlRkVUptVk1PQlhNUTEzQ29qcEpvbzVK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cityandstateny.com",
      "title": "City & State New York"
    }
  },
  {
    "title": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win - Politico",
    "description": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win  PoliticoDiana Moreno’s Assembly win marks first electoral victory for Mamdani as mayor  City & State New YorkQueens voters pick Mamdani's successor — plus two other New York special election results  Crain's New York BusinessSpecial NYC elections 2026: Diana Moreno wins in Mamdani's Queens district  ny1.com‘Welcome to the People’s Republic of Astoria’: Diana Moreno cruises to victory in AD 36 special election to fill Mamdani’s old seat  qns.com",
    "published date": "Wed, 04 Feb 2026 15:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVWtTZm9HRGZ0Nzg2RjNsYTRHVFZEZk1ka3k1bTF2cjlycFk2LW4tYmluaFlaT2JWYXJuWFRoNHVXUEI2RkZZY0NwS2VhYzNETVQ3eDlfc2pIQ2x5RHFHckw2WVFPY2lRZ2ZnbWpGRVVrQzEycUxzMGNBS001czBxdzJSTWJpOElKeHZ0RmxrSkMtZW9KdDJEZkpfTTRTTE1DdE5qYzVhRjhIWmtlUzFiblpfYjU1YkxoaFQ3aFp4RURfMWUzenJPbQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "TikTok trend Needoh cube: Boy burned after social media trend; Loyola Medicine shares urgent warning - ABC7 Los Angeles",
    "description": "TikTok trend Needoh cube: Boy burned after social media trend; Loyola Medicine shares urgent warning  ABC7 Los AngelesMother warns of TikTok trend involving Needoh cubes that left her 9-year-old son with severe burns  CBS NewsMom shares warning after 9-year-old son suffers burns after microwaving toy  ABC News9-year-old Illinois boy severely burned after TikTok trend inspired him to microwave NeeDoh toy  NBC NewsLoyola Medicine warns of TikTok trend that left Plainfield boy, 9, hospitalized with burns  Chicago Sun-Times",
    "published date": "Wed, 04 Feb 2026 15:04:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNcFFwS0VzeFZPTm91Vl8zak1rcW1KRW10bWFjQU5wWFhWa0llZW1Dak5qbjl0VnNOSFBjU3pQYmNFbEtTd3JJSkVzWmJ2X0pBSWV0SkEzX3hKZ21xZ1c2OWtyVm05N2JaZTNWUk1rMWl3bjUzTWJCb2dCYUxMODZOblpQSFBnZ2hoTkwyOG9vUzJuS2kwUVZJQkxPc3N6cUxHYlFpTVJ4YVNlaExKcjlvd1R3R0c0bmZCdEHSAb8BQVVfeXFMUHJYRUFxLXFWcU1hQ0dEMkFyNjkwT2NmS0tRSGt4MWkxYWQwQnpuU3ZabkF3ejhGMzNCNjFTV1dpbm9pTlY0Ymp3YVByTDNXUnZSRGhNRnNsX1lhckVMVEdPSlFaS1JPaUgyTW9oYXk1VGg4WG1peVV5a1c5V0NLWTJhM3lzX1hjSDcxUFdGN2h1dzZCRmJiaHFxcmR6bjl4aF9rOGRXSkpobVljZXBLbF9hTXVlbjcwRkdaMGxXYUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  }
]