[
  {
    "title": "Todd Blanche says review of Jeffrey Epstein sex-trafficking case ‘is over’ - The Guardian",
    "description": "Todd Blanche says review of Jeffrey Epstein sex-trafficking case ‘is over’  The GuardianHow Trump Appears in the Epstein Files  The New York TimesBlanche says DOJ unable to investigate tips about Trump’s involvement with Epstein  The HillPhotos released in Epstein dump not enough evidence to prosecute, Blanche says  PoliticoThe Winter Olympics are already overshadowed by the Epstein files  The Washington Post",
    "published date": "Mon, 02 Feb 2026 00:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPUnZDa0FsdkdXTXIyRC13V29PYWpxd0dRaVJKcEhlRHhrMnlpMnRGUnJueS1zZDgteUxHMXFLTEpoOEptVVpvS2dJWTF2WXpJMmluMkJDYk9wRkE2X1ZPa0JRNkhJY1JMb0VRR19hWW5penJOb0htQ291TGZwV2JiWC1KME5WeUFGRUt0aQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "5-year-old Liam Conejo Ramos and father return to Minnesota from ICE facility in Texas - AP News",
    "description": "5-year-old Liam Conejo Ramos and father return to Minnesota from ICE facility in Texas  AP NewsBoy, 5, and father detained by ICE return to Minnesota after release  BBCAfter Liam Ramos' release, Democrats turn focus to the rest of the kids detained by ICE  AxiosJudge Orders Release of 5-Year-Old Detained by Immigration Agents in Minnesota  The New York TimesFive-year-old Liam Ramos and his father released from Texas detention center  The Guardian",
    "published date": "Sun, 01 Feb 2026 22:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPMnpId0tOeDQ0d1JlZUlYTTk1WDZaNGxQTTJQSTRLMFZrdzFVUldHbjlpWkFaZHJiQWUwdHZWb3JxWExuSDVQUHpDVnljNWcyUzlkcERFbmgzR2RDU0hhejh6Q0ZEb3RLRWMzanhRT09MWEdSSTFoUTlEOW4zdmxzNDNnNlItc3A1NU9JMzU2cmhFRlEtNEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "description": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina  The Washington PostHow much snow has fallen in North Carolina? Check live updating totals here  WXIIAt least 2 dead in North Carolina as storm brings heavy snow to South  USA TodayWhere does this weekend's snowstorm rank among Charlotte's biggest winter events in history?  WCNCSnow accumulation higher along coast and central NC than in Triangle - bitter cold coming Sunday night  WUNC News",
    "published date": "Mon, 02 Feb 2026 01:05:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxONzB4OGpTcmlyOElUZnh6MElLZ3ktckQ2N1pTck1mSmdRRWtoMEJLMU9aZVVydks0OTRyX3E5MmpLdk9mVk9ZUkpjaWZvLXZGb1VpSWRwOTVoTVdpeWVISzRUNEk2Zm9wX09MUVQxOWtwdWV1bTBfWmxuS1hRbmdiVzliYzRCc29nWXQxSHdPdDZXUGdnUElMTFQ4U0VmbUJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters - Politico",
    "description": "Mayor of Portland, Oregon, demands ICE leave the city after federal agents gas protesters  PoliticoUnion workers protest ICE at Portland facility; City leaders decry use of tear gas  KPTVFederal agents use tear gas on Portland ‘ICE Out’ protesters, including children  KOIN.comLawsuit expanded as Gray’s Landing accuses federal agents of reckless chemical munitions  KATUPortland Mayor Statement on Federal Use of Chemical Munitions at Peaceful Protest  City of Portland, Oregon (.gov)",
    "published date": "Sun, 01 Feb 2026 22:29:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaU1ISXJEUElQZXpNOWxJVTBSOFpiaVREZl9WajBTUXFGbzZtbjV4UnBjM01mc1pqdnJzRU9ZZEtEVS15N0dfTkRnUjRZRk9KMENsRlVUanY4aGw5WnRFb09MNDBCZmNXbDAwNzF0MXowU0tFS0dXQ28tdzV6ZkljRHI3cjNteWZ6aTU3YXZyTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties - The New York Times",
    "description": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties  The New York TimesLatest Epstein file photos appear to show former Prince Andrew on floor with female  CNN‘The Duke’ and ‘The Invisible Man’: key revelations of latest Epstein files release  The GuardianSecond Epstein victim claims she was sent to UK for sex with Andrew, lawyer says  BBCEpstein files lead to resignation in Slovakia and calls in Britain for former prince to cooperate  AP News",
    "published date": "Mon, 02 Feb 2026 00:01:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNSlA1TlpPTmdwWXJqLTRxRDFZbk9HVjlPWEx6WVliRTlVMEVIbTdRQy1oV0tzaHp3amk0SWFNNnljY2pOT0hsTU8yVnlRN2lWd1A2Q2F4WlFNMzVmVDJndWRjUDYxWmRrMnBmejlpMzNVMzJxTXBzVWpxRWFubEx0bFNaWS15cVFwNE1BZE43MlRSems3eWhteGVGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal Courts Undercut Trump’s Mass Deportation Campaign - The New York Times",
    "description": "Federal Courts Undercut Trump’s Mass Deportation Campaign  The New York TimesMinnesota AG Keith Ellison vows to continue legal battle after judge denies request to stop Operation Metro Surge  CBS NewsJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoMore anti-ICE protests underway nationwide after judge declines to immediately halt Operation Metro Surge in Minnesota  CNNJudge says she won't halt the immigration enforcement surge as a lawsuit proceeds  NPR",
    "published date": "Sun, 01 Feb 2026 18:11:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX1BHVTBjSkllOWppNTJlLW9BSHZ0ZE4wUFZSbEdvbjdXa1Z6X1ZTV1VlUGQwTElmb2d5clgzOVM1WmhRUXVfb1JpOVhQYVVfcVpBQVVhelBtR3VLWUcyZ3B3Rjg4MGdKMy1qbWJTVW5JdnFmTkRrX1JvclM1MjFYOU03RHRIR3dlLTR2WnI2Z0kxeURvbEo1dXdNZFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Democrats post early fundraising edge in marquee 2026 Senate races - Politico",
    "description": "Democrats post early fundraising edge in marquee 2026 Senate races  PoliticoDemocrats continue to outraise Republicans in key Senate races  Roll CallAJC: Ossoff opens 2026 with $25M war chest in high-stakes reelection bid  Ossoff for Senate",
    "published date": "Sun, 01 Feb 2026 17:57:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQcVZKbEh2alFLZVc5b3hoQ0xaTkF6ZF9oaGVOMmd0cTQ5c2JZRF9VSF92aTA1MTROSG54TmJjWmN5anU2ejNIYzhmekRva3JWT2RKdXkxMUh6RHZCaFlHdTVPdi1TdG1YZnZtcTU2cFlVQ0hUUm9GMGFfeVVCU05QQTBuTE00eHpVSXBfNVlyRWdxSGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "House’s Bid to End Partial Shutdown Gets Tougher - The Wall Street Journal",
    "description": "House’s Bid to End Partial Shutdown Gets Tougher  The Wall Street Journal\"Hell no\": House Democrats' divisions over DHS funding spill out in private call  AxiosJohnson says no quick House vote to end partial shutdown and blames Democrats for their ICE demands  AP NewsShutdown expected to last until at least Tuesday as Jeffries says Democrats won’t help pass funding bill  CNNThis week on The Hill: House races to end partial government shutdown  The Hill",
    "published date": "Sun, 01 Feb 2026 21:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPYVNTbnM5SnVCcEdvMVkxMi1wWGZxeXFNOXdsbFF2My04MEdiOHpaS09jRFI1MWFJZHZjNDd5cVluQmNHQVI0RmhJZXc2WXgzTmZTZzlPSV9Eem5jLXQ1UFRyS0k2WGR4WGlGdEdqQlEtVjJlYThzU29aY21ZcTNrLWN0NFNEa3RsU2JneXJPWklIb2dheFZZR3VpUTBZbjZ5TmFEZllR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Did it snow in Tampa Bay last night? Some flurries reported - Tampa Bay Times",
    "description": "Did it snow in Tampa Bay last night? Some flurries reported  Tampa Bay TimesBomb cyclone drops historic amounts of snow on Southeast as snowflakes fly in Florida freeze  CNNBomb cyclone brings freezing temperatures and snow to millions in US  The GuardianIguanas fall from trees in Florida as icy weather bites southern US  YahooBomb cyclone brings bitter cold and snow to the Southeast  NPR",
    "published date": "Sun, 01 Feb 2026 15:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQN3pHN1hSblM1VDFYYjZYVjBJaTRsNGV0NlVtZ0d0cHpYekJJd0lNQWMyZ1Z4LTBrUUgzRkxWQzN1ZV8tZkxqcXd4Z2JJRUZndUVjYW9jUDBzYklDaGo2ZFV6LXZCWF96QTNScXJ4X183SG5RdkxvREdUWkF6bDlTVFI1SFRpc2kwcm1TOTl1MjQzYXhCQlMxUzA0ZE9UOG9P?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tampabay.com",
      "title": "Tampa Bay Times"
    }
  },
  {
    "title": "Two federal agents reportedly identified in fatal shooting of Alex Pretti - The Guardian",
    "description": "Two federal agents reportedly identified in fatal shooting of Alex Pretti  The GuardianTwo CBP Agents Identified in Alex Pretti Shooting  ProPublicaSenate Democrats and Republicans call for investigation into killing of Alex Pretti  NPRAlex Pretti shooting: Federal officers who fired shots identified in records: report  FOX 9 Minneapolis-St. PaulHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing.  The Intercept",
    "published date": "Sun, 01 Feb 2026 23:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNjZsNW8wUHpCNjZpYlR4YTRwM1pubGtSYWtfN2xscl9DU0pxNDgzRU55cm5peGtHRExrUDFvMmtUenhBbUJsaS1yRTAyQzdHY3JrZUJ4XzBNOS1OME5rRVhpVm95LVA1NS0wQTNXM1lpT2N6OTkyODlNa1BreTB3ekdnTDhHVkgzWWlPcHAzYm9pU29TMkEybHgxaEMyenNoZ3AxY3NR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump says if Iran doesn't agree to nuclear deal, 'we'll find out' whether U.S. attack would spark a regional war - NBC News",
    "description": "Trump says if Iran doesn't agree to nuclear deal, 'we'll find out' whether U.S. attack would spark a regional war  NBC NewsOpinion | The Nuclear Threat After Tehran Falls  The Wall Street JournalUS, Iran ready to talk, with mediators organizing meeting in Ankara — report  The Times of IsraelIran's supreme leader warns any U.S. attack would spark 'regional war' in the Middle East  PBSU.S. tells Iran it is ready to meet and negotiate a deal  Axios",
    "published date": "Sun, 01 Feb 2026 20:45:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQR0J5T3IyaVZVQ3RMVlJ4SGx1dHZVb3ZYcFRqc0xVeTlNYzdRczc2eDFTdWdjWi1zMHBHRGJ2ZFdsbmtETVVNN21FbDJLUFZ0TlYxdVdaUG5yVHZma0ZMaE5IaXl2d3hUaXlHMFNKU1BHR1JNUHlCMVpaNlpqMlNjcnFmRlVueFVJWDJiODl5dGI5NWkyU0xMU3dTbV9vMlFTLVp1eFpmWmpLWDZVRFpleA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Why Democrats’ upset in a Texas state Senate race is a big deal - CNN",
    "description": "Why Democrats’ upset in a Texas state Senate race is a big deal  CNNDemocrat flips reliably red Texas district in victory that stuns Republican party  The GuardianDemocratic Upset in Deep Red Texas District Rattles Republicans  The New York TimesDemocrat Taylor Rehmet wins solidly red Texas Senate seat in stunning special election upset  The Texas TribuneTexas Democrat's win a 'wake-up call' for Republicans ahead of 2026 elections  Reuters",
    "published date": "Sun, 01 Feb 2026 19:08:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQNXJJSFI1VjlhdlFmYzBSSlNvMk8tcExIUmdLSi1LS3FVT0RrWkxrbl9jWS1JQzZRZUZvbm1EdmI1X3Z0TDQ4a1U5aUZXcXRlV2lxdzl0SkNiNDlCN2VuLVJHb3N4VUtlNUV4VVJnWnFpWkpkb2h4dGlQNEkwZVU0aGlIc1pTYVV1bE9ncw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says - Politico",
    "description": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says  PoliticoDon Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest  NPRDon Lemon quotes the Bible in response to arrest for Minnesota church storming  Fox NewsArrests of journalists fuel backlash as anti-ICE protests spread from Minneapolis  PBSDon Lemon skips Grammys coverage after arrest  USA Today",
    "published date": "Sun, 01 Feb 2026 19:08:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQZjlWY20yN1Z3TzRseXdlaUZXdEs3cE1WYmsxblhPRUxXWGs0NWtlVTQyZXhzQmdHdGtsODg0NElzLUxGR0dQMGpCZEtFV1lDRktvbmp1OFM2R1NjcFZjUmwySFNjNF9HZXR4VjAzajV1TmdWUV9EbU1scFgtWUt3akllcnRhVUs3bkNnbWNfNUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Can Tom Homan De-escalate ICE Tensions in Minnesota? - The New York Times",
    "description": "Can Tom Homan De-escalate ICE Tensions in Minnesota?  The New York TimesTrump signals retreat on immigration even as he doubles down  MS NOW‘Trust Has Been Breached’  The AtlanticAgents in Minneapolis could be pulled back if local officials co-operate, border tsar says  BBCWhite House banks on Homan to help avert shutdown  Politico",
    "published date": "Sun, 01 Feb 2026 19:11:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQZ0N2XzhVdGhwcXQyUmxGaGdzb2RJR2RTQm5vaTdIYlVFUkMzN2hmZjFhQW8ycHZYZXpwc1pMWlprdkViRGs1dlBOQ3RHdHc0a1VZU1hiUnhVWVhhYjZaU1kxako3eklUR2NLalRhc0lfNkxIYTRhQXNUTUhqS2FPeA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Nearly 60 vehicles collide on both sides of Calif. state highway - SFGATE",
    "description": "Nearly 60 vehicles collide on both sides of Calif. state highway  SFGATE59-vehicle pile up in foggy conditions closed major California highway for hours  CBS News10 Injured in 59-Vehicle Pileup on Fog-Shrouded California Highway, Police Say  The New York TimesDense fog causes pileup on California highway involving at least 50 cars  ABC NewsVideo captures chaos inside 59-vehicle pileup on Highway 99 in Tulare County  ABC30 Fresno",
    "published date": "Sun, 01 Feb 2026 16:37:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOR1c4RUdieVNqVnlMX1pCZ3B3M2x3ZDRGX1VrZjU1aFNmZC1LUjlud0g0VS1aS092eXF6S1I5MWpaUVlwa1dDWHFxSDJZN1JMbFdJbV9Wb0hXQ1diUEJwMXp2MTNuRm5lcDNuVGpTemZUWFRTVzJKcHZjR0dSSENCcUFxVDhoMkVLR09TdFdzQ015VmZKREpnNWhmXzItQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "“Meanwhile in U Street – Broken Water Main, cars are frozen in the water that is rapidly freezing.” Good Lord This is not Good - PoPville",
    "description": "“Meanwhile in U Street – Broken Water Main, cars are frozen in the water that is rapidly freezing.” Good Lord This is not Good  PoPvilleWater main break leaves Navy Yard residents without water  WJLACrews working to repair water main break in downtown DC  WUSA9“U Street Water Main Break Traps Cars in Rapidly Freezing Water”  FilmoGaz",
    "published date": "Sun, 01 Feb 2026 19:12:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5CbjZuOFZsOVNKd2hheTZNX3NuMy1ZUGlQdFV0UW8wQXY0TDQxbWlMbVJCQjJOLVd2V2tWbFViVTlLWTFyZXN0a25zS1ZMWnlUd19Hai1lN2lOeUFGcERiZzN6M3I1amN5dDhqbUxPcHdwMWMz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.popville.com",
      "title": "PoPville"
    }
  },
  {
    "title": "Charlotte-Mecklenburg Schools, area districts announce Monday plans after snow - Charlotte Observer",
    "description": "Charlotte-Mecklenburg Schools, area districts announce Monday plans after snow  Charlotte ObserverCMS, other Charlotte-area schools, closed Monday due to winter storm  WCNCCharlotte region school closings: Tracking closures for Feb. 2, 2026  WBTVSchools going remote for Monday; power outages improving across NC  WRALMixed reactions from parents after CMS, other districts cancel school Monday  WSOC TV",
    "published date": "Sun, 01 Feb 2026 17:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOMmE2VUxtR3JFTU1CaVhaOURWSGpMN1M4NVdkcDJXaHhLVFVkYy1CRTlYSms5TldYV2EzbERoQWllUDBHMm5SNlNyV3VHcXV6dmU5ZVNpX19NdVRlbXBhSzRnajhYbmZQNFl0X2lfR1QzZ1BsUGM0eE1Kb1dSMHBJdDZn0gGCAUFVX3lxTE5mRHA1U0puY2RjYUZQdTlLdkZXVmZ4SkhEUDB1T3I2UG1qSHVaVTdfYUNDVGt3Z3dsS3V1bXR3Sm1OOXJWZlQwcTduLUx3bWZIc05SSGptd1RoWmVaeUYzYU50ZDZJQXViMTYwMlVxS0I3REM2QXdtbU9EcFJPMVVBYUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.charlotteobserver.com",
      "title": "Charlotte Observer"
    }
  },
  {
    "title": "Rising crime, inequality and disenchantment: What’s at stake in Costa Rica’s elections - CNN",
    "description": "Rising crime, inequality and disenchantment: What’s at stake in Costa Rica’s elections  CNNCosta Rica heads to polls amid fears of authoritarian turn  The GuardianRight-Wing Populist Holds Commanding Lead Ahead of Costa Rica’s Election  The New York TimesCosta Ricans vote as right-wing populists aim to extend mandate  ReutersA vote for continuity? What to know for Costa Rica’s presidential election  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 17:01:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5fOFNRRC1JX1g0d1FzN3NaVFZZZ1lWQXpyclB6TUVGc2U1Y1VJQ01iaXIwajZPakpGZFZmeFJPNFZIcDdZeE9TbHJCZkVjOVNVXzBwX0F3VXBxT0RFT2hRY0p3R1JHMUZuYkVTaFNJRlpiSmJYYlpzYVdmZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "School Closure/Delay Prediction For Monday, Feb. 2nd - The MoCo Show -",
    "description": "School Closure/Delay Prediction For Monday, Feb. 2nd  The MoCo Show -CMCSS schools closed Monday, facing historic challenge of packed ‘lasagna’ ice  Clarksville NowD.C. area school closings and delays and other changes for Monday  The Washington PostMontgomery County Offices Close Due to Severe Winter Conditions, Online Services Remain Available  HoodlineNo School for MCPS on Monday  Montgomery Community Media",
    "published date": "Sun, 01 Feb 2026 17:15:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdnBHLXlCdXc4eTltZGdLbTNFMW9NMFhVMS0tR1Fpa1hpUjc2LS10bU1peXRuc1k1LTE3ZGVXQmFrWVdSdm9FdGdTX1VlZ283OWN1YUYySkJONGlFdTdvNEZSWTdNd2Z5MXc0VW9NLUFXOHkwTHdPNFhsTXFzTzRJVlN5c29ZX0VBRWZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mocoshow.com",
      "title": "The MoCo Show -"
    }
  },
  {
    "title": "Trump Lawsuit Against IRS Puts Him on Both Sides of the Same Case - The Wall Street Journal",
    "description": "Trump Lawsuit Against IRS Puts Him on Both Sides of the Same Case  The Wall Street JournalSenate Republican says his ‘preference’ is for IRS to investigate who leaked Trump’s tax returns instead of lawsuit  The HillTrump sues IRS and Treasury Department for $10 billion over leaked tax records  NBC NewsOpinion | Trump's absurd $10 billion suit against his own government  MS NOWTrump’s Lawsuit Against I.R.S. Creates ‘Enormous Conflict of Interest’  The New York Times",
    "published date": "Sun, 01 Feb 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQcnRYQlkzOVBlUm8ybC0tT0d4bmZ4X2wtN01renY5a2NQQTU3eHhLVDRKV3J5QzdCM3F5RHF1WGJySkJWdVNab2xtOEQyeUx2LS1WM0hzVThUTGhFUkV3SWxlcHZQZ3hGZEFaaGFVMVFreEJldjhsemZZa1QzMVpUU19oaE1JeG5oWWVsOUlOeUcwOXpIRUtEQmljbG9EbzZQaDM5d01XRi1hQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Trump endorses John E. Sununu in New Hampshire Senate race over Scott Brown - Politico",
    "description": "Trump endorses John E. Sununu in New Hampshire Senate race over Scott Brown  PoliticoTrump endorses John Sununu in New Hampshire senate race  NBC NewsPresident Trump endorses John E. Sununu for U.S. Senate  WMURTrump backs John Sununu in New Hampshire Senate race  The HillPresident Trump endorses John E. Sununu in closely watched N.H. race for US Senate  The Boston Globe",
    "published date": "Sun, 01 Feb 2026 21:18:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPVnJXX2NFUHliWGFLNUdDZUNKVkJBQlRyc3lobmN2MENYcHlSLTB6aDJVUWpCaXg4OEdEaHJ6OE5IeHdGT1JqbkJ0cVB5Qlh0VTZPeDN4RWJ3R1B1NnFjNnBqNXNVaXFfajAzU0VKN0RzYnpPR3ppZFZDT010REZEekZNOUJyd291UmFFU21JYkxwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The FBI’s seizure of 2020 ballots in Georgia is a signal of what’s to come | Austin Sarat - The Guardian",
    "description": "The FBI’s seizure of 2020 ballots in Georgia is a signal of what’s to come | Austin Sarat  The GuardianOpinion | I watched Georgia's 2020 recount. Here's what the FBI raid in Fulton County is really about.  MS NOWJustice Department defends Tulsi Gabbard’s presence at Atlanta election search  PoliticoDOJ’s legal machinery to subvert the 2026 election is already in place  Democracy Docket‘It’s a Five-Alarm Fire’  The Atlantic",
    "published date": "Sun, 01 Feb 2026 20:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPV2l4Y0p6eFZhWHNHTkxDU3AwUU1kZVFfVmlSY21qWWxpSTBzal9FY01PLW16SE53M3pFNWRCcElIUFEzMXVybVdaVkJlWFdUdERVSTRSdkdnS3RnN3VIOG1lNUFhWi1PdlZEU3JkMHRaMHVMQ210VHYxRWNkSmFZLUo0N1pnUVpBajlaUG9GaDI3SmhYTFFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Hazing Death in Arizona Leads to Charges for 3 Fraternity Leaders - The New York Times",
    "description": "Hazing Death in Arizona Leads to Charges for 3 Fraternity Leaders  The New York Times3 fraternity members arrested after student's alleged hazing death  NBC News3 frat members arrested following death, 2 teens face kidnapping charges | Nightly Roundup  FOX 10 PhoenixThree fraternity members in custody after NAU student dies Saturday morning  ABC15 Arizona3 Arizona fraternity leaders arrested on hazing charges following death of 18-year-old pledge  ABC News",
    "published date": "Sun, 01 Feb 2026 22:26:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNVzlSR1c3bDRDYWlic0VoSlNZbzdCVlBpN0pZVjRXOFE4VXBsb3ZhbkUwbzk5Ti1Ic1RydjEtR2hHektVbW5EUjZEaXlFYnFDeGdTSVJhTFZBb1gzZ0RuZGVhQnZMWUdEVzFESGY5Rm1qM0FEaHlQVWZoQTVYclhOTFRoU2NUZGpXNVRJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "New York Stands Still for Alex Pretti - Rolling Stone",
    "description": "New York Stands Still for Alex Pretti  Rolling StoneOpinion | Do We Want Live in Alex Pretti’s America or Gregory Bovino’s?  The New York TimesDetroit vigil honors Minneapolis nurse killed during immigration protest  The Detroit NewsPreble High School students honor alum Alex Pretti with memorial banner  WLUKProtest dedicated to Alex Pretti held in Watertown Saturday  WWNY",
    "published date": "Sun, 01 Feb 2026 14:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPWkFIUGc5c01NdTZGaXlCMWVqWU5wRjJtc1ptcV9rakQwNk13SUZyNFRkOEw3QzVuN2FicWM5Wi0xRHpPcTZUN3Y0MVpkb216QXQxQ0hQOUF5R0tRY0lfTVVuVlNVYXF3VEFrakJQenNRVlltSWI4TWRKQzdMUUVNOWhGeE1FejVyeDBrNzFsWUhtM1RY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Ukraine peace talks pushed back as Washington juggles Iran crisis - politico.eu",
    "description": "Ukraine peace talks pushed back as Washington juggles Iran crisis  politico.euUkraine Peace Talks Delayed After Russia and U.S. Meet  The New York TimesUkraine war briefing: Kyiv reschedules peace talks as battered power grid strains in -15C  The GuardianZelenskyy announces next round of talks with US, Russia as Ukraine seeks 'real and dignified end to the war'  Fox NewsNext round of US-Russia-Ukraine talks to begin Feb. 4, Zelenskyy says  ABC News",
    "published date": "Sun, 01 Feb 2026 10:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOQ2JHejNrM240c2VhZDVLZHJpa0hSNThtd0Q2RGJ2MnpjS3pUZkh6ZUhKVm41NEVBNWl2TV9jVFV0NUhmMzhlb0lmRXdUQW9XTXkzY3daYnNuRGdhWXJvZm1hTTdSZkdaU3RGMXBLUEF5R21zczBWbzB5UGFLbXFtRGVzcXJ0NTh2Vm9HZ0ZaTjNvdnU0bnVlRURaV1NVWFZBRXZVTVpfNDRtZzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners - CBS News",
    "description": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners  CBS NewsVenezuela rights activist Javier Tarazona freed amid prisoner release  Al JazeeraVenezuela’s Delcy Rodríguez announces amnesty for political prisoners  Financial TimesVenezuela plans amnesty law for political prisoners and closure of notorious prison  CNNVenezuela releases at least nine prisoners including activists  Reuters",
    "published date": "Sat, 31 Jan 2026 22:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQQTR4a2FTaTA5bXpabDJacGtLdUZmY3dVczFpZDB6VjRnT3hfQWNBTFNjTDlfY2U5VEtxbEluTGo4U2VOb2prQmhqQnVfd0gtUUhNYm1BNFl6cDBSSnNfa3MzN3JmbWYtWGhWME1zNzRrckluYXNCZ2N1aFdNcTdVMkIwTEFmdWlCdXFSYzZYS3dPdzTSAZgBQVVfeXFMTUNSNm5SOFYxUlJDV1Y0TWFBYzl2YzYzMGEzZWJ6d3JrWTBrLVc3cmd2OWthQjlCdXZubG1vOHdCQ3Q4THBBcmZwRzhvRFJqZ0FucDktdjlsTWU0Y0RMcGJYdm91enFjVEttb29ZZjg5ei1ERjVGVW5ab0NIUlB5SmdPcVBIVFQ3aDg4MG9GNlk5TzVqWnZ5c3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Mamdani Names Nonprofit Leader and Ex-Rikers Inmate to Run N.Y.C. Jails - The New York Times",
    "description": "Mamdani Names Nonprofit Leader and Ex-Rikers Inmate to Run N.Y.C. Jails  The New York TimesMamdani names new Department of Correction commissioner  Spectrum News NY1Mamdani names jails reformer Stanley Richards to steer chaotic Rikers complex  GothamistMayor Mamdani Announces New Appointments, Including Commissioners for Health and Correction  NYC.govFrom Detainee to Commissioner: Stanley Richards to Lead City Jails  THE CITY - NYC News",
    "published date": "Sat, 31 Jan 2026 23:39:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNWTJxaDFmUWV1RWNldGFxMkk4eWJSVWhiMk9jeTJHUnlzLTZLejN0N0E0WVM1dElkUk5xU0tKUEFJZ1RReER0OUVlRzN1M3F1LXZHakZTQjFhdzMxS1dhR3BFLVdLQ3pKZnhOZWlnQ2x4bjNwRnVYeUs2U2NYTGZTRXUwUlhQa2tSMm5rbXNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Major winter storm threatens East Coast including parts unaccustomed to heavy snow - PBS",
    "description": "Major winter storm threatens East Coast including parts unaccustomed to heavy snow  PBSWinter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow  The New York TimesBitter cold takes aim at Southeast as millions remain under winter weather alerts  NBC NewsHow bomb cyclones form and create hazardous conditions  PBSFIRST ALERT: Powerful nor'easter set to impact New England on Sunday  NBC Boston",
    "published date": "Sat, 31 Jan 2026 21:35:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPVHpaWm5yUEU4d1E1M1NBQlo4ZWtueXp2ZTN5amdJUzdZNFkzQjNRRW1ZR09zT0Z5WDZWeHFoU1htTTRVZnB5MWIwTURGWUJkV0ljQjhURm9tSHE0dzZDR3poZ2NVWDdvWmtyVXZhWDJpNGxYRzZqZXZWRS1wajNOc3hjQmJBamRoMk1MOEhwUlREQ1phZUdQYVpfd1Atd0RKOGMySDI3UWpKYjhsVWgxVkd1YWU4bU4yYlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so - NPR",
    "description": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so  NPRTrump says federal government won’t step into protests in Democratic-led cities ‘until they ask us for help’  CNNTrump news at a glance: president orders homeland security to avoid protests in Democratic-led cities  The GuardianTrump orders DHS to stay away from protests in Democratic-led cities unless federal help sought  ReutersTrump orders federal agents to stay away from protests in Democrat cities  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 07:04:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQNDBsWXNwWHJ5X3VDVEVtNzJGYTlVcUQ3eEhJV1RleFJrMGZPTmw2ZWZJOTJBVmkyV2FDS2hqNDF5MjZfNGNyc1R1ZnMtTU0ya1dtLW9IeXhScklSMVIzVkVNWFg3MDRjbWppaldyTmxWOExKaFpfM1E1S2ozS3ZaYXVhaXh5N19LRVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "In Texas, Democrats narrow GOP’s U.S. House majority, win upset in state Senate - The Washington Post",
    "description": "In Texas, Democrats narrow GOP’s U.S. House majority, win upset in state Senate  The Washington PostDemocrat Christian Menefee wins election for U.S. House, narrowing GOP's slim majority  CNBCChristian Menefee beats Amanda Edwards in 18th Congressional District runoff  Houston Public MediaMike Johnson's majority to erode as Democrat Menefee wins Texas special election  AxiosTexas House Special Election 2026 Live Results  NBC News",
    "published date": "Mon, 02 Feb 2026 01:37:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNLWd2b1Bhb19RNGNlR3U2WmktR2FEcUFyYjhUOVU3bHRHOV9VTE01aGtlMzhrYVF3b1FuMVRRa3BEcXBzc1VhVFNubHpiZG4xZ0ZlczBWcHFWaDU3MEVIWl9BTnFVMnNEX3hjWmRIbWZOajlIWVBCRVloUWVQMXpXTFFVNzg3dEZZOGsyT2hSb3U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  }
]