[
  {
    "title": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case - Austin American-Statesman",
    "description": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case  Austin American-StatesmanFBI releases description of suspect in Nancy Guthrie kidnapping  BBCRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOAThe Message of Hope Nancy Guthrie’s Neighbors Are Sending With Yellow Ribbons and Flowers  TODAY.comGoogle’s breakthrough in the Nancy Guthrie case is raising uncomfortable questions about how much it’s watching you  Yahoo",
    "published date": "Fri, 13 Feb 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcDNzRkR2NElGNjlyNVdNNTV1MFZhZk5mN0g5Q0x1SF93OUtVT2JvUjVOcUdobnF6X3Z3NUMxM0VnRE9kbHQ1Si1EZVZYaWJySTFWa3hvMmYwWlpJcG1zUFI0bGNKSlpvOU1RTVVUWFNCUy1WRWNiWkZfOVdXbE5VY0VDUmNQcm1fc2oydWEyZEFyRm9fczBuM1ZjSnVibjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statesman.com",
      "title": "Austin American-Statesman"
    }
  },
  {
    "title": "Fetterman lone Democrat to support Homeland Security funding bill, as DHS shutdown looms - 90.5 WESA",
    "description": "Fetterman lone Democrat to support Homeland Security funding bill, as DHS shutdown looms  90.5 WESAA partial government shutdown is about to hit the Department of Homeland Security. Here’s what that means  CNNUS homeland security department on track for shutdown after funding bill fails in Senate  The GuardianA bipartisan effort to save health subsidies failed. Will ICE reform be different?  NPRHomeland Security Department poised to shut down as Congress leaves with no deal  NBC News",
    "published date": "Fri, 13 Feb 2026 11:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNc3ViNVh1cm5qLVpNdXYyblRmaEl5bGhkOElwTzcyQkN5VUoyUXd6bWhGT2FibDhGWXJVSGpzVk42T2Fnd1ZEcnNIUS1lb2JkSDFLMms0eGk5Sm1nSFZ0b19Id0dfazdCSDRDY1dVS0VkZF9oSEhPSUZscWJoOGxYLTdtTXpkRWltZElaVXhLWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wesa.fm",
      "title": "90.5 WESA"
    }
  },
  {
    "title": "Trump sidelines climate contrarians in science rollback - Politico",
    "description": "Trump sidelines climate contrarians in science rollback  PoliticoTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesTrump calls climate change threat to public health \"a scam\" but scientific findings show otherwise  PBSDocuments offer new details about the origins of the EPA’s attempt to deregulate pollution  MS NOWTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNN",
    "published date": "Fri, 13 Feb 2026 12:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOVlpmOTFQa1V4VUpvWEt5ZjZTMXBVaW5TSkgtc1lBazBoWFJlVU9OU1pMN2tHc0FreDVxaFlnQTlFdGkyQ2VnUS1kY0tZLUtEbkR6N2l5cjJtSmZwM2NrNHBQbU0yOGVmZW5xTmRlYnNnYkpiVU1nVWQxY3J3RUpmNzVqSTg3QWVwOVVKcXZUc1NZb1ZaVnM5Q0s5eWFwX3lBdkVldQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Feb. 13, 2026: Raleigh mass shooter sentenced to life in prison without possibility of parole - WRAL",
    "description": "Feb. 13, 2026: Raleigh mass shooter sentenced to life in prison without possibility of parole  WRALJudge sets sentence for Austin Thompson in Hedingham mass shooting that killed 5  Raleigh News & ObserverNorth Carolina teen who killed brother and 4 neighbors in 2022 attack sentenced to life without parole  NBC NewsLive updates: Austin Thompson sentenced to life without possibility of parole for killing 5 people  ABC11 Raleigh-DurhamRaleigh mass shooter sentenced to life with no possibility for parole  WRAL",
    "published date": "Fri, 13 Feb 2026 12:43:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOMkJmUHJvVzYtMjJmS0NKNkMxek5rVnc5SWkyTVJsaDFFeGM5REprb0FweXZmZ3lYLVZ5ekFWRTd1bkFtRDNqR2QwN25iUVVaMTRVVUVhY0hLZDJ6NmN2aXoyQ25KelNCbXJ0aE8xWE0tSWdQd2VGaU50ZDdVcnVCV1ktck1NQW9wVlc2REpaWDQ5RlpUdHhPb2V2UVdVd3ZwR0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wral.com",
      "title": "WRAL"
    }
  },
  {
    "title": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "description": "S.F. teachers strike is over as school district and union reach tentative agreement  San Francisco ChronicleS.F. teachers strike: Union wins fully funded family healthcare, a top ask  Mission LocalHistoric San Francisco teacher strike ends after four days  SFGATEWhat SFUSD superintendent said about her pay amid teacher strike  KTVUSchool closures extend to full week of classes as labor talks stall  San Francisco Examiner",
    "published date": "Fri, 13 Feb 2026 18:11:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZTZ6MHI5U2dfRHpQdS0yWGRxRk9vbnlESVgyQ0RDQWlXUG9nend5QnhnaXNSR0N1V2JPRGN5NmNHdmdjc1NPcmplZXRSZ1RpVUU4WjFsd0wwZVc5anlmbGZjMk1vZzVDMG1rcERuN3pkZm93RWNzTEhhekVvNldPRjhtZE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "description": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress  PoliticoAfter letting Trump abuse it for a year, the legislative branch shows a little pride  CNNIllinois Republicans weigh fealty to Trump as president’s agenda faces backlash and shutdown threat  Chicago TribuneShifting Republican Support and Congressional Dynamics with Trump in 2026  БуквиDeep red Republican breaks with Trump as president's popularity plummets  Alternet",
    "published date": "Fri, 13 Feb 2026 16:44:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTVoxZjhUak52TTZtZFQ5c0s0b2tHRnRmYkpTdWVZZVRfcmNXY3c0czBSZG1sQjgtaTBtb1NiREFkX0VDYWxfTEdueUJZV01qUFlIUld4MXlwTUZLT2JHRi1wTGZOM2RWbGJ2V0UtaXFyMUNVV3BpYi1nOXZDdHZFWDI0UDZqZGVrXzctSmlhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Prosecutors move to dismiss charges against men accused of hitting ICE officer with broom and shovel - AP News",
    "description": "Prosecutors move to dismiss charges against men accused of hitting ICE officer with broom and shovel  AP NewsGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSProsecutors to dismiss charges against men accused of assaulting ICE officer in Minneapolis  PBSCharges Against Man Shot by ICE Are Dropped as Official Story Falls Apart  The New York TimesNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 13 Feb 2026 16:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNOEtWQVNnTGFYWVpnSlNraWZrZW15LVBEY1ZmWlpXV0Z4T0MtTXB2X1U3dHBoS2xHUm9hVTJXd2VQSlNRV3k0UW1BYjloSmM4My0tU01PQ1J5ZFZWTDZ6Vm5FT1NxTWhMbmhhc192U3JoRUV5SGh0WHdQaEtVXzFYYURKTmZTeXdLX1dmSDFvTzM1MEhobFEzV2MwUXJZS0JyQjFObVQ3NDFHdWJ5YTNXYkU2QTFTSXFsZXZKcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children - The New York Times",
    "description": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children  The New York Times'Even in Russia, they don't treat children like this': A family's nightmare in ICE detention  NBC News“I Have Been Here Too Long”: Read Letters from the Children Detained at ICE’s Dilley Facility  ProPublicaReporter details life for children and families detained in Texas migrant facility  PBSThe Kids Trump Sent to ICE’s Dilley Detention Center  ProPublica",
    "published date": "Fri, 13 Feb 2026 10:02:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4Z2hLbVhFMHlFUlQ2bjBjM3A4MVB3aHV2bTVjVDFqOGYwSWNvRW1Idmt3S2FUYURNU1ZTY0NIQXZUV21vZ3o1Uk12UlB1Y2tRNlI0X2RQV2h5SVBPZEJTZ0pqUTZkdDFzS2lHOTh5dTNwNk9Ia1RxWm5BajZodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Minnesota immigration crackdown will end, border czar says. And, DHS funding to expire - NPR",
    "description": "Minnesota immigration crackdown will end, border czar says. And, DHS funding to expire  NPRTrump Administration to End Surge of Immigration Agents in Minnesota  The New York TimesEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticWith federal surge end nearing, Somali community works to rebuild and regain trust  5 EYEWITNESS NEWS",
    "published date": "Fri, 13 Feb 2026 11:52:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNNkFWNzFEUUhXSUxJVU1MOXBoT004UXZqeHBUeTZGM2NwUDhjQVI3X0tWWXZRa3FpUk9ybHNhQlF5bFBxNjduQnpGTmYtam4wNUhLd2NQNm9oUXNZaXdKY0JjOHpScjBzb1VieTllajlQeFh5Mm5jYUxJUVJQaGRwNlZaRC1mUXBxMXltMUJwZ3Y2ZlRtZHJvYTlfWkZ4T0czLTFsMTRiMmgtSmRoejRPaWh0OURBRmt1aEd0SnJ0UlFCZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump sends second aircraft carrier to Gulf amid Iran threats - Axios",
    "description": "Trump sends second aircraft carrier to Gulf amid Iran threats  AxiosU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street JournalTrump sends second aircraft carrier to Middle East in effort to increase pressure on Iran  The GuardianPentagon to move carrier to Middle East from Caribbean, officials say  ReutersExclusive: Trump says he might send second carrier to strike Iran if talks fail  Axios",
    "published date": "Fri, 13 Feb 2026 12:53:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE4tWC1WNV9tSUhBVE1LSUFEbmMyeEVVTEw4Wkw4MVhiU0tmU0tEbnVLYm14WVctcXg0bm02b3dCeEtWM0h5QWRZem5INDk3Zk1SaE81Q1R3TnpQUEpOMDlYY1RUNEFPdXUxSGJMX0ZzSmdJY2NGUmNkdVRKd0pMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "In victory for Democrats, Virginia Supreme Court says redistricting vote can go forward - Democracy Docket",
    "description": "In victory for Democrats, Virginia Supreme Court says redistricting vote can go forward  Democracy DocketThis crucial state is the latest battleground in redistricting war between Trump and Democrats  Fox NewsVirginia Supreme Court allows high-stakes redistricting vote  AxiosVirginia Supreme Court allows redistricting special election to move forward  NBC NewsHow Virginia’s top court might decide Democrats’ gerrymandering fate  Politico",
    "published date": "Fri, 13 Feb 2026 15:24:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxON3c4QUpoZE1jNmtucHlpTGhjYmdHR2N5X0dKcllZVzdMVG1VbFJaVnQwOVNmZGFWb09lSk9rQVRSV0lzT2VOaTU1akdsTVdSWllsN2pod0ZhZzZ2cUdRNEJ1eTdNZnhtaUplNWpZak1mUEZwSXJFRnd3VUw2aGdmNjBnQUNueERqZkFhNnp3Nk9HdVc5RVlkVWd5N1Y4WHFkS1l3ckRSUWxKTTBwQU1adlQ0YjBkQ0xoUXFGc0taZUxWclR0dElHczJTTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’ - NJ.com",
    "description": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’  NJ.comDemocrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosJimmy Kimmel on Maga: ‘It’s such a delicate balance between stupid and evil’  The GuardianHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoThe Tea, Spilled by Morning Joe: ‘Yeah, they probably should be indicted’  MS NOW",
    "published date": "Thu, 12 Feb 2026 20:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOQ2tZc0FnN055YjFrWEZzNzFkN3h5TV9SdWZPMlR0UWp3b19XRDI1aGd2UjdqLTFyTm5CekExY2t5R1ltZ2dQWDBYTjRYenh3NGF2ai1TczZnS04tZ3Zsb3ZyRHp6Ny1oWEllMEFkTkdzMzh5NDZmWWtPUlNIaGRFUGwybjFUS2hsaTRkYXdYR3E3eTYxQUJ4VE1jZlVLYnEyMVZWaXpuYTRia3NLOVHSAcIBQVVfeXFMT1A1UEpyVmtTWkpSU2F1S2pLYWNTamtyTXZyRTIta0FfMHczaTkzb3JNS0xPakw1VERseGpxcjJwZGN4VzA0N1dISGxzLVRVM0lNN0N4TXdyU1dCZzBiYnMwRGNMTGJUWUdHd3JDdkxkb1lINGlsbDJUWEJmbWYtQVJfeWN5WHVCdHNPbmcyMmpWZXlWbmJqX2RPejF2T1ZidlQyOHhKLWRoWGpFT3ktOU1oVW4wVFl4NHR5TVgzSW9MMmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted - CNN",
    "description": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRRFK’s idea of making America healthy starts with making it politically sicker  The EconomistRFK Jr. promised to restore trust in US health agencies. A year later, it’s eroding  AP NewsWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Fri, 13 Feb 2026 12:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSVpFdFBhN2FxdTYtQ25adlIySnp4bkxOYUZxTmpIRmJKWjBZb1gwOUMtYk9jWkdsaGRSTkVXRlVfNXRCSjBIOXVpZ1FtNkdFUFZXNEZOOWhmb3l3X2diWG5qYzVnb3IxMjJJRGdOa0lQc1J6dFJWUkVnNWVzSTVRYjZQMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers - The Washington Post",
    "description": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York TimesSlotkin looks to make sure DOJ has ended investigation into military video  PoliticoEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC NewsTrump's revenge tour falls flat in the courts  Axios",
    "published date": "Fri, 13 Feb 2026 18:32:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPb3BTZWxnWlBiZTNHUTNWYzFGbTlzcnNDLS1MVVEzelVuN1Vhay1UMThnNXpGVFowUVptNXF5YjBSZ1V0UGg4NzN1NVp4SU0zYkg1bTFZNXBRMVNLSl9ReGpDdnR5MnhwMnh1ZHpzYTd0djUwVlhOWHRoQy14a3BxUU5kVURqRVJ1dUl5UE9lZXR6aVB4OTI1VjRUQnEtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump nominates a hospitality executive to lead the National Park Service - AP News",
    "description": "Trump nominates a hospitality executive to lead the National Park Service  AP NewsView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 00:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNREl6aVE4TzNoaHIyRmthRDFna203djB2TElLWDdQcHY5bjRoc2NqNXdvTFRucDdYRlY3al82MUMtMVF1eXMzVFNfLTM4UE5SOHhMZElFaDFlWWRUbHNxSTRKaHpSSWVQT3Y5M0tSNkxRbkFZVjU5YTFFSVVDTUR5OTVsS2hINlRkWkpWR2dmVTRUQWp2T2czZndsa1MzcnVCLURBaHNoYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesList of ICE raids, major updates in Minnesota on Friday, Feb. 13  Bring Me The NewsPressure mounts for U.S. Congress to block funding for Homeland Security  The Globe and MailActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateICE Leaving Minnesota Won’t Heal My Community’s Scars  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states - NPR",
    "description": "Judge blocks Trump admin from rescinding health grants to Democratic-led states  NPRA familiar move with a new twist: Trump tries to cut CDC funds he just signed into law  NPRJudge blocks planned Trump administration health cuts to Democratic states  The HillFederal judge stops Trump plans to cut public health funding to Colorado, other Democratic-led states  The Colorado SunMinnesota sues after CDC cuts millions of dollars in public health grants  MPR News",
    "published date": "Fri, 13 Feb 2026 07:31:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaFJlYUJ6QmQ2S1FhdDBkTlI0TEp2MlRmTkxmS1pldjBKUGpiNTFzXzFQcGVrVDNNN0tFYzNCNDd4Mm8yYmpEZlgyNkR6b2NLYmdEX1VJZlM1eFRlY3pZZFdBdm11cHhydGVHeUZQZ2d4QzZJRXZFUmZzanMzUm9DOE1KcEhNZ0NGZWdJOGFUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "February 12, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 12, 2026  Letters from an American | Heather Cox Richardson | SubstackTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York Times“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)Trump directs Pentagon to boost coal use as Energy Department announces $175M infusion for plants  The HillAnalysis: Trump has overseen more coal retirements than any other US president  Carbon Brief",
    "published date": "Fri, 13 Feb 2026 07:44:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5CbkZXVWM0ZlBodXJyR2ZVNlJaNlMzdjROYlNaaFBfTFYzVDVDRXpHbDQ3eXdKRkc5S1hTQUVSM3o1ODhkczdsMEZtdGlCbk1zelgySXNpWmYzb2xIX3o1QmtIX2l4bnJKNGhwMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California - Redheaded Blackbelt",
    "description": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California  Redheaded BlackbeltStrong storm set to pummel L.A. with heavy rains, flooding and beach hazards  Los Angeles TimesHow bad will SoCal storms be? Rain to ramp up Monday, but not over yet  USA TodayOnslaught of storms is headed to California — with chance of snow in Bay Area  San Francisco ChronicleSoCal rain creates hazardous road conditions, triggers water rescues  ABC7 Los Angeles",
    "published date": "Fri, 13 Feb 2026 08:01:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNLXQxMWR2ODhZTHNEQ1g3aE1leXRhdTdKWmFLdjJITUQ2UnY4NFZfQWxLVmQzX0xSWmcwdXVLS2FQNGY2dDg5Vy03ZVJ3aTdQdHg1eDRZTnRwMzRzRjhoRFgzbGozYnNpNklMek5fUzFuSUR2Y0szYmVDZnVpQk1WdVI2VV9DTFBlbDRndmtpeUpwQ1B0bEdweW5vMUdQVHhMMi1nWXN3bm01WkF0Qy1vOHR3bzhReExQamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kymkemp.com",
      "title": "Redheaded Blackbelt"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNLaser weapon that shut down El Paso's skies was LOCUST system  AxiosFBI: CBP shot laser at Valentine’s balloons it thought were drones  MS NOWClosing of El Paso Airspace Adds to Tension Between F.A.A. and Pentagon  The New York TimesCBP may have downed a balloon with a laser. Is a 'cartel drone' next?  USA Today",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It. - ProPublica",
    "description": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It.  ProPublica‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston GlobeReport: Michigan-Canada bridge delay could cost up to $7M per week  Bridge MichiganBridge Owner Lobbied Administration Before Trump Blasted Competing Span to Canada  The New York TimesTrump Has a Bridge He Wants to Sell You  The Atlantic",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPN2RBRm5yY3lIaHo5bFIyNFZITEVmYW43bDA4OWo4MGE0bXpRdVJqX3N4ZXNScVh1elJ6c3dtN1p6NmlROHA0YlJTYmdVS0pickxKLUJFc0JTOHdicXJ5aGRHR0Jqd1E5cEs1TzBFclJQaHhBM3g3NU9wai1fODJDWXNwRGE4Yk8yNVN5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections - PBS",
    "description": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBSHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsHouse passes GOP elections overhaul  PoliticoWhat is the SAVE America Act that mandates voter ID?  BBCFederal Power Grab On Voting Still Flunks Basic Civics Test  Cato Institute",
    "published date": "Thu, 12 Feb 2026 17:52:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOY0ZzZXFwWk9laXpFVWJsaVlYLVdiQTUxbFpuYTZROERXSzBpOVRHYlpsTFUxNUFkbHhqQlM0UUFRa19LTFR0LTIwbW5hVE5yNWRVbnBkTVY4dHA4U09FempMdHFsSFFnY1F5ckpqRF9vbXRVV2YyWUZfZ0pqZFpoX3JMdnRMbm9HNVFydDV1M0FiYUk3Z1Zzd3R3MUxxOWhEUTdnbEpFcWdxYTdURllVLWV2eWlleG11a3hvV0c0WC1MZUdyQjFiTk5DSFjSAdIBQVVfeXFMT0dkZWJnbmZPMXJReUEzNEdVZkJFLWdIOE11c2UxYzVjQzZPNWtxOHo2RU9qQlFTN0ZRVUpmMlh0U0ViV2FEd1hJcU9vRzhJZ3lUYi1vcVJ4T3pmZnRxQVMzLVRlSXk1dDVzT1hIaEZ3LTBOWk1JRTU3T3VaTFM4T0UtZWZLQzZjNl9QbnM2Wmt5ekwtYVBMVnVxOXd1eWRvcDQ0bUlQeHNfTGhrRElURTZJRTVpbGVBVC1YdnpxcXFJY2lreC00QmZPZjdkMGktTV9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge rules ICE likely violated Minnesota detainees’ constitutional rights  The HillJudge: Government flouted constitutional rights of Whipple detainees  Star TribuneJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York Times",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Pride flag reinstated at Stonewall after it was removed by Trump administration - The Guardian",
    "description": "Pride flag reinstated at Stonewall after it was removed by Trump administration  The GuardianNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkActivists re-install Rainbow flag at Stonewall National Monument, defying Trump admin  amNewYorkPride flag flies again at Stonewall Inn, challenging federal ban  The Washington Post",
    "published date": "Fri, 13 Feb 2026 02:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWHg1QnRGQ0Q3Zkk1ajBzeWtNZmExYkFzM1FYRjFLS3U3Yzk3Y1VvaTAyd1I5bGlMSmxybWxVMHlGSkhNOVhNZVpuZ1lLNllBc1poRjRpNVdPNEVLLWprUG5Fa1ZKVGt0YTRXcmJGOWJPWVhmblI4UDQxOF9USUtoOFlOQ2MxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump officials confronted with Pretti shooting video at Senate hearing - Axios",
    "description": "Trump officials confronted with Pretti shooting video at Senate hearing  AxiosSenators Press Immigration Officials on Minnesota Shootings  The New York TimesHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneTrump immigration officials shown video of Alex Pretti’s death in tense Senate hearing  AP NewsCongressional hearing examines ICE presence in Minnesota  MPR News",
    "published date": "Fri, 13 Feb 2026 12:26:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQSllTajVsMDRtOWtDcThRZlQ2UHRmdFlXVU5wUUUtMTMtRVlsVkttcEdMcDNtSWpWS05BY0tCRzIwcVQtOU5rR3daR1BmWlRKRnkyZGR4ZEFHMElLWW5PVDY4Q0JkUTF4VS1HeHJSRm4wTE9KN3AtaFN0RS1EUVNxMjR4UFJCY245S1REN3ViTGlxdmx3OVdMbHhTaGQ0anNQQmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRHouse Votes to Cancel Trump’s Canada Tariffs  The New York TimesDemocrats’ tariff gambit sparks new headaches for Mike Johnson  The HillTariff votes hand Republicans an unwanted referendum on affordability  PoliticoSix Republicans Break Ranks With Trump Over Canada Tariffs  Time Magazine",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New YorkMamdani Says Budget Gap Has Shrunk, Easing Pressure on Albany to Tax the Rich  THE CITY - NYC News\"Honeymoon is over\" Zohran Mamdani grilled by lawmakers as he proposes to \"tax the rich\"  WRGB",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsGovernors association says all members now invited to White House meeting as Trump defends exclusion of some Democrats  CNNConfusion reigns over Trump meeting with governors  The HillTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  Politico",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "ICE Director: DHS Has Worked with Governor on Merrimack Facility. Ayotte: That’s Not True - InDepthNH.org",
    "description": "ICE Director: DHS Has Worked with Governor on Merrimack Facility. Ayotte: That’s Not True  InDepthNH.orgActing ICE director says DHS shared report on Merrimack ICE proposal with Ayotte﻿  WMURACLU reveals shocking new timeline for Merrimack ICE facility  nashuatelegraph.comAyotte denies ICE director’s claim federal officials talked to her about Merrimack facility  New Hampshire Public RadioICE official contradicts Gov. Ayotte on immigration plans  Concord Monitor",
    "published date": "Thu, 12 Feb 2026 22:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxONktiZDkxVWdZZTNoS0RVc195eXhxT3RNbER1dFdXSnl2Q1ljRkhVZWdUV09JOEZxYkh0WU9yTjlla3RzRDhxMVdkR2syX1lOUmw1RFFFMktuYTUzYzhUaXFFYzdoQmlGWm5zUWctTXZMOXFIWmd4aE5Hd1RUTFl3RWY5aHBuWmd2NzU2ZnZSZC1SVUhGbDktT2lqYmhWaXJiS1oxNGNSd2I5NTFxaXhkQjZOS21PdTk5WHhuZ3A5OHhKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://indepthnh.org",
      "title": "InDepthNH.org"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video  CNNFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge says Pentagon 'trampled' on Sen. Mark Kelly's rights, blocks effort to demote him over 'illegal orders' video  NBC NewsJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNTrump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosNetanyahu meets with Trump as U.S. restarts talks on Iran’s nuclear program  PBSIran’s Missile Program Tops Israel’s Concerns as Netanyahu Meets Trump  The New York Times",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Top aides to RFK Jr. will leave posts - Politico",
    "description": "Top aides to RFK Jr. will leave posts  PoliticoTwo top aides to RFK Jr. leaving HHS as part of leadership shakeup  CNNSecretary Kennedy Enhances Management Team to Accelerate President Trump’s Priorities and MAHA Agenda  HHS.govRFK Jr. shakes up leadership team  PoliticoHHS shaking up top personnel to push Trump, MAHA priorities ahead of midterms  The Hill",
    "published date": "Fri, 13 Feb 2026 17:27:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUlg4VDR5Yk1OR1JwSk9GQldVMlNraGFlN09acmF0bTZYdlVJT3ozSU4xVWZSTXVHYzdLRVRqaWJxUS1GeHVLa3p5dUVLbnFGYUNKWmlpVG9XazAwRDEzUHUzYVo5T2pmczZiLUt3aVRYX19Yb29XMS0xLU1tN05oQ0hxdkppeWt2dkZoazZHQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary - AP News",
    "description": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary  AP NewsIn an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesNew Jersey House Primary Special Election 2026 Live Results  NBC NewsAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of IsraelWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al Jazeera",
    "published date": "Thu, 12 Feb 2026 22:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPYVlpeF8xa3g4SkNYazBsMGVzRUduZVVmalVfRDR1U0JHOE9yenl3VjdDcXpJTS1ZUHRIZ3lqTkhPZVhUdnVPc0Q1N1ZHMG9hanRQSXpCMjNPM19wTzJ1Slc5dlNfQUFLMnp5SFdIZkV5dDZNbzl1VV9IUHFPajlfUy1zM0lxb1lzZGpjRFB6Qi1lYTJ5a3AtSFpLc01rTDZT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Who Is Paying for the 2025 U.S. Tariffs? - Liberty Street Economics",
    "description": "Who Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsAmericans Are Paying the Bill for Tariffs, Despite Trump’s Claims  The New York TimesCosts from Trump's tariffs paid mainly by US firms and consumers, NY Fed says  BBCUS Firms Paid Nearly 90% of 2025 Tariff Costs, NY Fed Study Says  Bloomberg.comA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNN",
    "published date": "Thu, 12 Feb 2026 22:19:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOeFdvMVVjZC1HY3p3ZDNOVm5EZEFQNmNRUDU0OTVSVkVlNXlJN1VMY2xVRk5teHpST25CR1Z4bm9TaDlPaDdDYzE2a09FTVpyWjM1LUZJaG0yN0pHcGNhSnM3eTFqTTdWSC0zenVTekdHaEpZVGxqa2JkZ3l6WVRlR3JVOGNfeGdSR1huOWRMTGh4cXMyWklxdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://libertystreeteconomics.newyorkfed.org",
      "title": "Liberty Street Economics"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesInside Jeffrey Epstein’s network  The EconomistSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianThe Epstein files come for Hollywood royalty  CNNEpstein files: A list of people facing consequences over the DOJ's release  Business Insider",
    "published date": "Fri, 13 Feb 2026 00:39:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts - KCUR",
    "description": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts  KCURWoman tried to torch warehouse after ICE detention facility sale cancelled, police say  KCTVPlatform Ventures says it is not moving forward with sale of I-49 property rumored to be ICE detention site  KMBCKansas City police looking for suspect in attempted warehouse arson  FOX4KC.comPlatform Ventures won’t move forward on building sale process with U.S. Government  KSHB 41 Kansas City",
    "published date": "Thu, 12 Feb 2026 21:55:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPX3UtWDN0YkVfYVBZX3ZPYXRpNnh1WExxaFRqSmJSb09sRDk4eUc0LUJ1dmEwQ3ZwRzZCLV9UZTYxRzlXbUcxa3hBZHZON3hNSmlFTGVUMkZhQ3VKeEdWcnYwN3Qybm8xb1ROb1p2dWxCeHFza1haazVNUXhvX2czSmxiRTRVSjlQa1RaS1gzSWVkLWstdkxwMXFZXzQ5NklMSC1meFpHMEtISGk1N1pQY1dTa3NkWDgtLU9ValN2b09haDloNExuVDJZa0l2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kcur.org",
      "title": "KCUR"
    }
  },
  {
    "title": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence - KTAR News 92.3 FM",
    "description": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence  KTAR News 92.3 FMArizona sheriff denies withholding key evidence on Nancy Guthrie from FBI  The GuardianNanos pushes back on claims of withholding evidence in Guthrie case  KVOASheriff leading Guthrie investigation spotted at basketball game as family pleads again with alleged ransomers  Fox NewsNancy Guthrie abduction: Growing criticism of local police  NewsNation",
    "published date": "Fri, 13 Feb 2026 02:11:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB6eVRrWXBYMjdNc2YwdWFaMXpTNE1mcDZPa2ZkcF9zWU45UUFSYjdyQ1RHaHZ6WHBqT1J6cWJ5MHd0bUJlY01ycjBNS2JPY25IN0d2by1NXzl6VDRYUG5ZNDlTTWdvUWYtcmdUNDZjaFRGS2dSREVwZzVJZ2hOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ktar.com",
      "title": "KTAR News 92.3 FM"
    }
  },
  {
    "title": "Trump Offers Absurd New Excuse for Vile Obamas Video - The Daily Beast",
    "description": "Trump Offers Absurd New Excuse for Vile Obamas Video  The Daily BeastTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS NewsTrump's racist post about Obamas is deleted after backlash despite White House earlier defending it  PBS‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesThe lion speaks tonight – and what he says is despicable: Marvin A. McMickle  Cleveland.com",
    "published date": "Fri, 13 Feb 2026 07:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQVBfNWNPbndCaWNGc2k1d3ByV2VISnNoRVlEcjRZd0pIUDZ3UWVUZk9OZm5kX2Ftc3hFa0xhTGotVGdiMkZXOHNGMVFybk5sVGZjUF9UQmp5c2Zfck5qN3ZVLUd6YkJPWXZaaXF0bUdWTzduaE5HRG5SdmlZNzg2WHhHZFFGMk9qQ2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick - The Salt Lake Tribune",
    "description": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake TribuneUtah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post  PoliticoBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC NewsTrump’s pick for top diplomatic role faces scrutiny over ‘white supremacist’ views  The Guardian",
    "published date": "Thu, 12 Feb 2026 23:53:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVlplNU0tZDBIb2NoY09oc2VVQS1jd1ViUGpIVk1jdUFrbXZMTHhEb3hMRm9mbmgyWlMyTk9qQnZlOHZxcU9JQmVxdmY5aGE2S0lncUhQd3RHd0ozMVdzcXpqTExjZFRqeXo4R0ZCOU1iTEFfRnRBSllhb1hfLVpDRThQS3A2Rk9tV0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSImmigration authorities had surveilled Marimar Martinez, Chicago woman shot 5 times during 'Operation Midway Blitz': CBP Report  ABC7 ChicagoMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  YahooBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsDHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times  Chicago Sun-Times",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]