[
  {
    "title": "Senate Democrats block funding bill as DHS shutdown looms - KOMO",
    "description": "Senate Democrats block funding bill as DHS shutdown looms  KOMOCongress Jets Off as D.H.S. Shuts Down  The New York TimesPartial US government shutdown could mean airport delays, travel groups say  BBCSenate fails to advance DHS funding, teeing up partial shutdown as deal remains out of reach  CBS NewsHomeland Security Department poised to shut down as Congress leaves with no deal  NBC News",
    "published date": "Fri, 13 Feb 2026 17:56:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxQQmpybjNhd29pZEhnTGFTVHVBZDdfdWVnUWlPV0dKQWRkRU1feFJLcmtDOGJSYUh2czRoWEh3UWlOZlhIS2pZTDFRTk5PV1V2ZWNqSW1ZbmlteDZ3VmVWNnJ2QlRVQ1htTkpzX0tCcFpwenJadjF2X1VSdUxjUWNFR0tlNHU3UG1hM19PbEdhRl8wcWFhdHRqa0dHaWp6Ml9CNlBwbEhQQ3lDTEJ6aDlYaUtrTFZNd1hSWnJFQ29BVXhkX1dUclJzaXhhZi1UQTVCUXI3TXU4YWozdGxIdUZqRzNrQ1NtczVwNm1GSnRYSDJ5TmhFaXBUMFRiQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case - Austin American-Statesman",
    "description": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case  Austin American-StatesmanFBI releases description of suspect in Nancy Guthrie kidnapping  BBCRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOANancy Guthrie’s Friends Refuse to Give Up Hope She’s Alive  The New York TimesTrump on Nancy Guthrie investigation: ‘Progress has been made’  The Hill",
    "published date": "Fri, 13 Feb 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcDNzRkR2NElGNjlyNVdNNTV1MFZhZk5mN0g5Q0x1SF93OUtVT2JvUjVOcUdobnF6X3Z3NUMxM0VnRE9kbHQ1Si1EZVZYaWJySTFWa3hvMmYwWlpJcG1zUFI0bGNKSlpvOU1RTVVUWFNCUy1WRWNiWkZfOVdXbE5VY0VDUmNQcm1fc2oydWEyZEFyRm9fczBuM1ZjSnVibjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statesman.com",
      "title": "Austin American-Statesman"
    }
  },
  {
    "title": "ICE plans to spend $38.3 billion turning warehouses into detention centers - The Washington Post",
    "description": "ICE plans to spend $38.3 billion turning warehouses into detention centers  The Washington PostRepublicans Have Found the Real Victims of Trump’s Effort to Build Mass Immigrant Detention Centers  SlateICE reveals $38B plan for immigrant mega-jails  AxiosICE to spend $38bn turning warehouses into detention centers, documents show  The GuardianICE Plans $38 Billion Expansion of Immigration Detention Facilities  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 20:18:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUFdJa2JLQ2pCdHM2Rkw5WWpIZmFVOGx6NERrY25fcF9NWG5SdTRLT2Y1QUNEREhNN3RkekJZQm5LeENERlM0b1FXOE1WaU5JVTBBZ3hYS3VWaGZWd3p4U19lSWc5SUZ6d1VRWjlOSGhFTHdLRFNlTkZYbTdIcWRURERyWjZIem5GT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Justice Department Sues Harvard University for Withholding Race-Related Admissions Documents - Department of Justice (.gov)",
    "description": "Justice Department Sues Harvard University for Withholding Race-Related Admissions Documents  Department of Justice (.gov)Trump Administration Live Updates: DHS Shutdown, Harvard Lawsuit and More News  The New York TimesTrump administration sues Harvard for allegedly failing to comply with review of its admissions process  The Boston GlobeJustice Department Sues Harvard Over Admissions Records  The Harvard CrimsonTrump administration sues Harvard over race-based admissions probe  Politico",
    "published date": "Fri, 13 Feb 2026 14:52:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPclBhTHo2M2ZrZnhJYzVkZnk1YTFNcDA3Qkg2ZHFSRUJSVnlDRE9DRThmV2R4Vm5xVDlyWE9pVFFBUXJyS2lFbVpfZkduTDU4QmhTTTZMWFkxSko1Y0F5enJuZW1ObzV0UjdaN2hHUkpuTktCMGp6enhqczZiQndONDQxeW1QMjZta081ajVPakcyV0J5YkdGbVJUdnVTQ0tKWHpTNWVIM2VTUnpsZDU4eEdRNjQ1OGpFRW9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Au pair sentenced to 10 years for her role in double killing - The Washington Post",
    "description": "Au pair sentenced to 10 years for her role in double killing  The Washington PostAu pair who plotted elaborate double murder with Brendan Banfield sentenced to maximum 10 years in prison  CNNBrazilian au pair faces sentencing in scheme to kill lover’s wife and another man  AP NewsAu pair gets 10-year sentence for scheme to kill lover's wife and another man in Virginia  CBS NewsBrazilian au pair sentenced to 10 years in prison for role in Fairfax County double murder  WTOP",
    "published date": "Fri, 13 Feb 2026 19:18:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNWWxxVnVVekxJdkRfbE9qTHhvbDZPRjBtNnBuejRwUGNDbzJNRFgyMzNjWUdDTEZVVFU1endsSE91aWFVSmlaWldtN1lQSVVlUXJpcWxUUlFrOWhtbkktVXAyQ0p3TDlMRWpQdmRYR19SeERwc2E3NWlZczdFQlIxMHFWM1kyaFpYa2FYYWxHbmFzVTZz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "description": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress  PoliticoAfter letting Trump abuse it for a year, the legislative branch shows a little pride  CNNIllinois Republicans weigh fealty to Trump as president’s agenda faces backlash and shutdown threat  Chicago TribuneShifting Republican Support and Congressional Dynamics with Trump in 2026  БуквиDeep red Republican breaks with Trump as president's popularity plummets  Alternet",
    "published date": "Fri, 13 Feb 2026 16:44:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTVoxZjhUak52TTZtZFQ5c0s0b2tHRnRmYkpTdWVZZVRfcmNXY3c0czBSZG1sQjgtaTBtb1NiREFkX0VDYWxfTEdueUJZV01qUFlIUld4MXlwTUZLT2JHRi1wTGZOM2RWbGJ2V0UtaXFyMUNVV3BpYi1nOXZDdHZFWDI0UDZqZGVrXzctSmlhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Feds investigating whether 2 ICE officers lied about the shooting of a Venezuelan man in Minneapolis - AP News",
    "description": "Feds investigating whether 2 ICE officers lied about the shooting of a Venezuelan man in Minneapolis  AP NewsGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSICE officers on leave while feds investigate whether they lied about the shooting of a Venezuelan man in Minneapolis  CNNAgents Suspended After Their Story of Shooting an Immigrant Falls Apart  The New York TimesNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. Paul",
    "published date": "Fri, 13 Feb 2026 19:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNOEtWQVNnTGFYWVpnSlNraWZrZW15LVBEY1ZmWlpXV0Z4T0MtTXB2X1U3dHBoS2xHUm9hVTJXd2VQSlNRV3k0UW1BYjloSmM4My0tU01PQ1J5ZFZWTDZ6Vm5FT1NxTWhMbmhhc192U3JoRUV5SGh0WHdQaEtVXzFYYURKTmZTeXdLX1dmSDFvTzM1MEhobFEzV2MwUXJZS0JyQjFObVQ3NDFHdWJ5YTNXYkU2QTFTSXFsZXZKcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump administration moves to end \"universally hated\" start/stop feature for cars - CBS News",
    "description": "Trump administration moves to end \"universally hated\" start/stop feature for cars  CBS NewsTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesTrump EPA ends emissions limits for US automakers; state rules, lawsuits could follow  ReutersFriday briefing: Greenhouse gases; Mark Kelly; Tom Homan; Nancy Guthrie case; ChatGPT biases; and more  The Washington PostSix possible effects of Trump's climate policy change  BBC",
    "published date": "Thu, 12 Feb 2026 20:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5HUUFDQmcxUkhmREZwc0xlOW9lWjd4SWNNTW5aZTNuUEhUYkxtenEzbTJjMlY0THUtc1pEYk0wZEU3T05HdGNuR2NNUm5vQ3BtTGJGOUFQU3U0Qy0ydVZNUVREWWdQaFVrLUhuVU5yTDJkTTkxZHhFVjZ30gF_QVVfeXFMTUtMWDlkQnlyaTl6RlUtX0hab1BaTzhGM3ZrMVZtOVIzNEdobElMenBQckVSdWhvdjR0WmpQNzFCVjVaSXV4Q1lVQjRSUVhjR0hxbjZrRFdCQkRpWk5iYkY3ZjRJa3MtVFRpSzhlVjM2N3IyTzBlakRyNkpZSXdZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Minnesota immigration crackdown will end, border czar says. And, DHS funding to expire - NPR",
    "description": "Minnesota immigration crackdown will end, border czar says. And, DHS funding to expire  NPRTrump’s Minnesota Retreat Points to the Power of Public Anger  The New York TimesDHS has no immediate plans for sweeping city-specific immigration enforcement operations, officials say  NBC NewsEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The Atlantic",
    "published date": "Fri, 13 Feb 2026 11:52:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNNkFWNzFEUUhXSUxJVU1MOXBoT004UXZqeHBUeTZGM2NwUDhjQVI3X0tWWXZRa3FpUk9ybHNhQlF5bFBxNjduQnpGTmYtam4wNUhLd2NQNm9oUXNZaXdKY0JjOHpScjBzb1VieTllajlQeFh5Mm5jYUxJUVJQaGRwNlZaRC1mUXBxMXltMUJwZ3Y2ZlRtZHJvYTlfWkZ4T0czLTFsMTRiMmgtSmRoejRPaWh0OURBRmt1aEd0SnJ0UlFCZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Virginia Supreme Court allows redistricting special election to move forward - NBC News",
    "description": "Virginia Supreme Court allows redistricting special election to move forward  NBC NewsThis crucial state is the latest battleground in redistricting war between Trump and Democrats  Fox NewsVirginia’s Top Court Clears Path for Democratic Push to Redraw House Map  The New York TimesHow Virginia’s top court might decide Democrats’ gerrymandering fate  PoliticoHow Virginia’s top court might decide Democrats’ gerrymandering fate and more headlines  Virginia Mercury",
    "published date": "Fri, 13 Feb 2026 16:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQdEwxQ2ljWTlJZmZibUFXY3hGcXNJeTBRVURZbXkwY0pKZ21OZW9QTTU4UVpOY2xFVG8tSjdDZFdGZmg4eG1oZ09Kbml0dVJva1ZCa1ppVVEyNjFHc3B5ZmluNWx0R2dxUnVNS1QwSDBnUnZ3X1ROb3ZLVHVIaGtqV19oVGFlOHAxYW5Oc2QzY0NOdDFZWFdSU0RRbTRHS1czeU5fMFlrTm1KNFByekRsY1RnV2FUUDRuUmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "San Francisco teachers end 4-day strike with predawn deal - Mission Local",
    "description": "San Francisco teachers end 4-day strike with predawn deal  Mission LocalThe San Francisco Unified School District fumbled the teachers strike  Mission LocalWhat SFUSD superintendent said about her pay amid teacher strike  KTVUSchool closures extend to full week of classes as labor talks stall  San Francisco ExaminerSan Francisco teachers reach deal with district, ending 4-day strike  Politico",
    "published date": "Fri, 13 Feb 2026 13:54:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9RYlRhR2dCaWs3NVpFek5MS01pLW91c2xGaVI3NHVJaXNQZ2l1M01rUDNNMTJhOEVxeFNJbWptMFhiOW5lNTF1eG1RbjZaSWxrVDdCTEFTLThibUJLNHBpamZuZFhyLWVadXk1OGZpNFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://missionlocal.org",
      "title": "Mission Local"
    }
  },
  {
    "title": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law - NPR",
    "description": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law  NPRFederal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesTrump's CDC is canceling $600M in HIV and STD funds to four Democrat-led states  Scripps NewsFour states sue Trump administration over cuts to public health funding  ReutersMinnesota sues after CDC cuts millions of dollars in public health grants  MPR News",
    "published date": "Fri, 13 Feb 2026 18:18:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQazdJaTROOTRYMThGdnp4NjJjQmZHWFR6bWRqSWp1eWVQQmwtUG1qc2ZxTHZlV0hnNm5Nb3kxbXZKbnh0cTl3dHJaR1h3VWNjZldQeDludGpSZGRaZElMUWFlM1N6b3Bka1RMTkNlNTduMGdxeVpMSFAtb1ZOVWJERXZmRVA3SzlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump sends second aircraft carrier to Gulf amid Iran threats - Axios",
    "description": "Trump sends second aircraft carrier to Gulf amid Iran threats  AxiosU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street JournalTrump: Failed Iran talks would be a ‘bad day’ for Tehran  The HillUS sending second aircraft carrier group to Middle East, sources say  CNNTrump says he’s sending second aircraft carrier to the Mideast as he seeks Iran deal  AP News",
    "published date": "Fri, 13 Feb 2026 12:53:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE4tWC1WNV9tSUhBVE1LSUFEbmMyeEVVTEw4Wkw4MVhiU0tmU0tEbnVLYm14WVctcXg0bm02b3dCeEtWM0h5QWRZem5INDk3Zk1SaE81Q1R3TnpQUEpOMDlYY1RUNEFPdXUxSGJMX0ZzSmdJY2NGUmNkdVRKd0pMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Top aides to RFK Jr. will leave posts - Politico",
    "description": "Top aides to RFK Jr. will leave posts  PoliticoTwo top aides to RFK Jr. leaving HHS as part of leadership shakeup  CNNMajor shakeup underway at HHS as White House braces for midterms  statnews.comWhite House, RFK Jr. shake up health leadership after controversies  The Washington PostRFK Jr. shakes up top health department staff  Axios",
    "published date": "Fri, 13 Feb 2026 17:27:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUlg4VDR5Yk1OR1JwSk9GQldVMlNraGFlN09acmF0bTZYdlVJT3ozSU4xVWZSTXVHYzdLRVRqaWJxUS1GeHVLa3p5dUVLbnFGYUNKWmlpVG9XazAwRDEzUHUzYVo5T2pmczZiLUt3aVRYX19Yb29XMS0xLU1tN05oQ0hxdkppeWt2dkZoazZHQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Newsom to world leaders: 'Donald Trump is temporary' - Politico",
    "description": "Newsom to world leaders: 'Donald Trump is temporary'  PoliticoOcasio-Cortez takes progressive vision to Munich: ‘We are ready for the next chapter’  The HillMacron Attacks JD Vance's Portrait of Europe in Munich  Bloomberg.comAOC accuses Trump of trying to usher in ‘age of authoritarianism’ at Munich conference  The GuardianGavin Newsom Says Trump is ‘Code Red’ For Climate Leadership  Time Magazine",
    "published date": "Fri, 13 Feb 2026 16:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOMlRYSEF1dkFMYm1XZ3VlMEpyQWE3WFRLblhhMEZrbHZOLXU5RUNXLXZmR0IwRTNMZFBEUS1MNkFJUTdJQUFfcjZ2OXVubjdMWDNEa19pTzNyeS1OcldMMWl3ZUtWcU5oVzBncWxzT3AxMWgzLXMtdmxPTXAyS0tFcktSLTdQVzAzdlVDQ0l2azI1cjFLSi1ILWdKU3JLelVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesWhat will Epstein accountability look like?  CNNInside Jeffrey Epstein’s network  The EconomistSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianFancy parties and crude emails reveal the entertainment world's ties to Epstein  Australian Broadcasting Corporation",
    "published date": "Fri, 13 Feb 2026 14:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers - The Washington Post",
    "description": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York Times'The grand jury has spoken': Elissa Slotkin's lawyer tells DOJ to close social video probe  NBC NewsTrump's revenge tour falls flat in the courts  AxiosSlotkin looks to make sure DOJ has ended investigation into military video  Politico",
    "published date": "Fri, 13 Feb 2026 19:00:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPb3BTZWxnWlBiZTNHUTNWYzFGbTlzcnNDLS1MVVEzelVuN1Vhay1UMThnNXpGVFowUVptNXF5YjBSZ1V0UGg4NzN1NVp4SU0zYkg1bTFZNXBRMVNLSl9ReGpDdnR5MnhwMnh1ZHpzYTd0djUwVlhOWHRoQy14a3BxUU5kVURqRVJ1dUl5UE9lZXR6aVB4OTI1VjRUQnEtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children - The New York Times",
    "description": "‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children  The New York Times'Even in Russia, they don't treat children like this': A family's nightmare in ICE detention  NBC News“I Have Been Here Too Long”: Read Letters from the Children Detained at ICE’s Dilley Facility  ProPublicaReporter details life for children and families detained in Texas migrant facility  PBSThe Kids Trump Sent to ICE’s Dilley Detention Center  ProPublica",
    "published date": "Fri, 13 Feb 2026 10:02:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA4Z2hLbVhFMHlFUlQ2bjBjM3A4MVB3aHV2bTVjVDFqOGYwSWNvRW1Idmt3S2FUYURNU1ZTY0NIQXZUV21vZ3o1Uk12UlB1Y2tRNlI0X2RQV2h5SVBPZEJTZ0pqUTZkdDFzS2lHOTh5dTNwNk9Ia1RxWm5BajZodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesList of ICE raids, major updates in Minnesota on Friday, Feb. 13  Bring Me The NewsPressure mounts for U.S. Congress to block funding for Homeland Security  The Globe and MailActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateICE is pushing Minneapolis underground  The Verge",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Laser weapon that shut down El Paso's skies was LOCUST system - Axios",
    "description": "Laser weapon that shut down El Paso's skies was LOCUST system  AxiosClosing of El Paso Airspace Adds to Tension Between F.A.A. and Pentagon  The New York TimesCBP may have downed a balloon with a laser. Is a 'cartel drone' next?  USA TodayCommunications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNN‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  Politico",
    "published date": "Fri, 13 Feb 2026 17:02:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5PMUxLRkZORi0yZENrRnhfS0JJODg0Z0o2QUIzZ2tLUXZobjBQVHJ1bS15UE9pdnBTOXk2cVE4bHV0T2dNX2lya21hMDZrN1BjMTQ1aVdwYWV2SFBGMTctR05TR3JLR3hSVWdFRGthd2k5aWg0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’ - NJ.com",
    "description": "Conservative host blasts Pam Bondi: ‘Don’t know how her career survives’  NJ.comDemocrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosOpinion | Warning: Listening to Pam Bondi is harmful to your brain  The Washington PostHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoCommentary: The unintended hilarity of Pam Bondi's finger-wagging testimony  Los Angeles Times",
    "published date": "Thu, 12 Feb 2026 20:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOQ2tZc0FnN055YjFrWEZzNzFkN3h5TV9SdWZPMlR0UWp3b19XRDI1aGd2UjdqLTFyTm5CekExY2t5R1ltZ2dQWDBYTjRYenh3NGF2ai1TczZnS04tZ3Zsb3ZyRHp6Ny1oWEllMEFkTkdzMzh5NDZmWWtPUlNIaGRFUGwybjFUS2hsaTRkYXdYR3E3eTYxQUJ4VE1jZlVLYnEyMVZWaXpuYTRia3NLOVHSAcIBQVVfeXFMT1A1UEpyVmtTWkpSU2F1S2pLYWNTamtyTXZyRTIta0FfMHczaTkzb3JNS0xPakw1VERseGpxcjJwZGN4VzA0N1dISGxzLVRVM0lNN0N4TXdyU1dCZzBiYnMwRGNMTGJUWUdHd3JDdkxkb1lINGlsbDJUWEJmbWYtQVJfeWN5WHVCdHNPbmcyMmpWZXlWbmJqX2RPejF2T1ZidlQyOHhKLWRoWGpFT3ktOU1oVW4wVFl4NHR5TVgzSW9MMmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California - Redheaded Blackbelt",
    "description": "Brr! Storm System to Bring Heavy Rain and Lower Snow Levels Across Northwest California  Redheaded BlackbeltStrong storm set to pummel L.A. with heavy rains, flooding and beach hazards  Los Angeles TimesHow bad will SoCal storms be? Rain to ramp up Monday, but not over yet  USA TodayStorm to bring 1 to 3 inches of rain to Southern California. Here’s the timing  KTLAOnslaught of storms is headed to California — with chance of snow in Bay Area  San Francisco Chronicle",
    "published date": "Fri, 13 Feb 2026 08:01:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNLXQxMWR2ODhZTHNEQ1g3aE1leXRhdTdKWmFLdjJITUQ2UnY4NFZfQWxLVmQzX0xSWmcwdXVLS2FQNGY2dDg5Vy03ZVJ3aTdQdHg1eDRZTnRwMzRzRjhoRFgzbGozYnNpNklMek5fUzFuSUR2Y0szYmVDZnVpQk1WdVI2VV9DTFBlbDRndmtpeUpwQ1B0bEdweW5vMUdQVHhMMi1nWXN3bm01WkF0Qy1vOHR3bzhReExQamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kymkemp.com",
      "title": "Redheaded Blackbelt"
    }
  },
  {
    "title": "February 12, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 12, 2026  Letters from an American | Heather Cox Richardson | Substack“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)How Trump’s order to have the military buy coal would actually work  Fox NewsCoal industry latest to reward Trump with an unnecessary, made-up award  MS NOWTrump named ‘undisputed champion of beautiful clean coal’ by industry group  The Guardian",
    "published date": "Fri, 13 Feb 2026 07:44:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5CbkZXVWM0ZlBodXJyR2ZVNlJaNlMzdjROYlNaaFBfTFYzVDVDRXpHbDQ3eXdKRkc5S1hTQUVSM3o1ODhkczdsMEZtdGlCbk1zelgySXNpWmYzb2xIX3o1QmtIX2l4bnJKNGhwMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections - PBS",
    "description": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBSHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsHouse passes GOP elections overhaul  PoliticoHouse Passes “Worst Voter Suppression Bill Ever” in Latest Push to Help Trump Take Over Elections  Democracy Now!What is the SAVE America Act that mandates voter ID?  BBC",
    "published date": "Thu, 12 Feb 2026 17:52:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOY0ZzZXFwWk9laXpFVWJsaVlYLVdiQTUxbFpuYTZROERXSzBpOVRHYlpsTFUxNUFkbHhqQlM0UUFRa19LTFR0LTIwbW5hVE5yNWRVbnBkTVY4dHA4U09FempMdHFsSFFnY1F5ckpqRF9vbXRVV2YyWUZfZ0pqZFpoX3JMdnRMbm9HNVFydDV1M0FiYUk3Z1Zzd3R3MUxxOWhEUTdnbEpFcWdxYTdURllVLWV2eWlleG11a3hvV0c0WC1MZUdyQjFiTk5DSFjSAdIBQVVfeXFMT0dkZWJnbmZPMXJReUEzNEdVZkJFLWdIOE11c2UxYzVjQzZPNWtxOHo2RU9qQlFTN0ZRVUpmMlh0U0ViV2FEd1hJcU9vRzhJZ3lUYi1vcVJ4T3pmZnRxQVMzLVRlSXk1dDVzT1hIaEZ3LTBOWk1JRTU3T3VaTFM4T0UtZWZLQzZjNl9QbnM2Wmt5ekwtYVBMVnVxOXd1eWRvcDQ0bUlQeHNfTGhrRElURTZJRTVpbGVBVC1YdnpxcXFJY2lreC00QmZPZjdkMGktTV9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Trump officials confronted with Pretti shooting video at Senate hearing - Axios",
    "description": "Trump officials confronted with Pretti shooting video at Senate hearing  AxiosSenators Press Immigration Officials on Minnesota Shootings  The New York TimesICE director stands his ground after Swalwell blowup, says Democrats are ‘misleading their constituents’  Fox NewsHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneCongressional hearing examines ICE presence in Minnesota  MPR News",
    "published date": "Fri, 13 Feb 2026 16:13:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQSllTajVsMDRtOWtDcThRZlQ2UHRmdFlXVU5wUUUtMTMtRVlsVkttcEdMcDNtSWpWS05BY0tCRzIwcVQtOU5rR3daR1BmWlRKRnkyZGR4ZEFHMElLWW5PVDY4Q0JkUTF4VS1HeHJSRm4wTE9KN3AtaFN0RS1EUVNxMjR4UFJCY245S1REN3ViTGlxdmx3OVdMbHhTaGQ0anNQQmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It. - ProPublica",
    "description": "Trump Is Threatening to Block the Michigan-Canada Bridge. He Used to Cheer It.  ProPublica‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston GlobeReport: Michigan-Canada bridge delay could cost up to $7M per week  Bridge MichiganBridge Owner Lobbied Administration Before Trump Blasted Competing Span to Canada  The New York TimesTrump Has a Bridge He Wants to Sell You  The Atlantic",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPN2RBRm5yY3lIaHo5bFIyNFZITEVmYW43bDA4OWo4MGE0bXpRdVJqX3N4ZXNScVh1elJ6c3dtN1p6NmlROHA0YlJTYmdVS0pickxKLUJFc0JTOHdicXJ5aGRHR0Jqd1E5cEs1TzBFclJQaHhBM3g3NU9wai1fODJDWXNwRGE4Yk8yNVN5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Pride flag reinstated at Stonewall after it was removed by Trump administration - The Guardian",
    "description": "Pride flag reinstated at Stonewall after it was removed by Trump administration  The GuardianNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkTrump admin rips Mamdani, local Dems as activists override gov't move at NYC monument: 'Focused on theatrics'  Fox NewsActivists re-install Rainbow flag at Stonewall National Monument, defying Trump admin  amNewYork",
    "published date": "Fri, 13 Feb 2026 02:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWHg1QnRGQ0Q3Zkk1ajBzeWtNZmExYkFzM1FYRjFLS3U3Yzk3Y1VvaTAyd1I5bGlMSmxybWxVMHlGSkhNOVhNZVpuZ1lLNllBc1poRjRpNVdPNEVLLWprUG5Fa1ZKVGt0YTRXcmJGOWJPWVhmblI4UDQxOF9USUtoOFlOQ2MxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "SAVE tool keeps mistakenly flagging voters as noncitizens - The Texas Tribune",
    "description": "SAVE tool keeps mistakenly flagging voters as noncitizens  The Texas TribuneTrump’s push to audit voter rolls is already snaring US citizens  CNNDHS Unveils Tool to Check Voters’ Citizenship—and It’s a Disaster  The New RepublicTrump's multi prong attack on voting profiles a desperate man  Daily KosDOJ seeks to 'clean' Texas voter rolls using data provided by the state  Houston Chronicle",
    "published date": "Fri, 13 Feb 2026 10:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQNzU4SUNGemR0TWNVM3Ywd3Fxa21yTEtJYXlzckhPU1dCaTdBdTkxLW9fYkk5RThNRkZvbzdiSEVyYS1FZkxqS3NJNnY4Rm5ycVRGamcxUHZNRVBXOGI4MkJXVVlRSVFxNmFWOEZnOWZIRGczbFBXTVZpYS0xb05KT0lnQkpXb21SMXhWdXY2WW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge: Government flouted constitutional rights of Whipple detainees  Star TribuneJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York TimesJudge orders DHS to give Minnesota detainees swift access to lawyers before transfers  CBS News",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted - CNN",
    "description": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRRFK’s idea of making America healthy starts with making it politically sicker  The EconomistThe Senator Who Has Made It Her Mission to Stop RFK Jr.  Rolling StoneWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Fri, 13 Feb 2026 12:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSVpFdFBhN2FxdTYtQ25adlIySnp4bkxOYUZxTmpIRmJKWjBZb1gwOUMtYk9jWkdsaGRSTkVXRlVfNXRCSjBIOXVpZ1FtNkdFUFZXNEZOOWhmb3l3X2diWG5qYzVnb3IxMjJJRGdOa0lQc1J6dFJWUkVnNWVzSTVRYjZQMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New YorkMamdani Says Budget Gap Has Shrunk, Easing Pressure on Albany to Tax the Rich  THE CITY - NYC News\"Honeymoon is over\" Zohran Mamdani grilled by lawmakers as he proposes to \"tax the rich\"  WRGB",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge temporarily blocks Pentagon action against Mark Kelly over illegal orders video  NPRFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York TimesJudge rejects Hegseth bid to punish Sen. Kelly for video message to troops  The Washington Post",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsGovernors association says all members now invited to White House meeting as Trump defends exclusion of some Democrats  CNNConfusion reigns over Trump meeting with governors  The HillTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  Politico",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary - AP News",
    "description": "Analilia Mejia, progressive ally of Bernie Sanders, wins special New Jersey House primary  AP NewsIn an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesNew Jersey House Primary Special Election 2026 Live Results  NBC NewsAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of IsraelWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al Jazeera",
    "published date": "Thu, 12 Feb 2026 22:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPYVlpeF8xa3g4SkNYazBsMGVzRUduZVVmalVfRDR1U0JHOE9yenl3VjdDcXpJTS1ZUHRIZ3lqTkhPZVhUdnVPc0Q1N1ZHMG9hanRQSXpCMjNPM19wTzJ1Slc5dlNfQUFLMnp5SFdIZkV5dDZNbzl1VV9IUHFPajlfUy1zM0lxb1lzZGpjRFB6Qi1lYTJ5a3AtSFpLc01rTDZT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence - KTAR News 92.3 FM",
    "description": "Pima County Sheriff's Department reportedly blocks FBI from accessing Nancy Guthrie evidence  KTAR News 92.3 FMDay 13: Sheriff’s department working with FBI to test evidence found at Nancy Guthrie's home  WRALExclusive: Arizona sheriff blocks FBI access to evidence in Nancy Guthrie abduction, source says  ReutersArizona sheriff denies withholding key evidence on Nancy Guthrie from FBI  The GuardianGenealogy company exec slams Pima sheriff's 'devastating' move to ship Nancy Guthrie evidence to Florida lab  Fox News",
    "published date": "Fri, 13 Feb 2026 02:11:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB6eVRrWXBYMjdNc2YwdWFaMXpTNE1mcDZPa2ZkcF9zWU45UUFSYjdyQ1RHaHZ6WHBqT1J6cWJ5MHd0bUJlY01ycjBNS2JPY25IN0d2by1NXzl6VDRYUG5ZNDlTTWdvUWYtcmdUNDZjaFRGS2dSREVwZzVJZ2hOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ktar.com",
      "title": "KTAR News 92.3 FM"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSImmigration authorities had surveilled Marimar Martinez, Chicago woman shot 5 times during 'Operation Midway Blitz': CBP Report  ABC7 ChicagoOpinion | We Have to Face What ICE Has Done to Us  The New York TimesEvidence Shows Feds Lied To Justify Shooting Marimar Martinez, Lawyer Says  Block Club ChicagoAgent investigated in Chicago woman’s shooting, her lawyer says  MS NOW",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]