[
  {
    "title": "Authorities Investigate a New Message in Nancy Guthrie Kidnapping Case - The New York Times",
    "description": "Authorities Investigate a New Message in Nancy Guthrie Kidnapping Case  The New York TimesInvestigators remove car from Nancy Guthrie's Tucson home  KVOAThe Kidnappers Of Savannah Guthrie's Mom Want Bitcoin—But It’s Not As Anonymous As Many Think  ForbesTrump says answers in Nancy Guthrie case could be coming ‘fairly soon’  KOLDTrump teases possible ‘solution’ in search for Nancy Guthrie  Yahoo",
    "published date": "Sat, 07 Feb 2026 03:59:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPenpNbkltWlNwNTFjTWY5eEV4NDlkX3FSTUl3T2VwYU5vOEdoZW13UUVsQ0VQcV9lbzNIa2xxZmhQT3llY3gwWkRMeEhWVU1zRTcyZnh0eW44ZE93QTVXM2hvekZDZ1dZSDdUMktRTHJ1anRjMVBuVkV1VXJPdnNORXZjVVJ1V21t?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump removes video with racist clip depicting Obamas as apes - BBC",
    "description": "Trump removes video with racist clip depicting Obamas as apes  BBC‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesRacist video is merely the latest in a long line of Trump’s ugly social media posts  cnn.comRepublicans condemn racist Trump video post depicting Obamas as apes  Al JazeeraThe Obama Meme on Trump’s Truth Social Was Exactly What It Looked Like  The Atlantic",
    "published date": "Sat, 07 Feb 2026 01:36:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5odTFtdjBxck5hYUl6aHRfQXp0QjU2SFZTQjFXLW8zYkZiZk9QMVB4Mmg4dVVnNVhZcUhTUVBmY1lQVjc2UFJ1bmlFd2VzTWdVbFFJRTBwWnlDUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Appeals court greenlights Trump admin policy of detaining undocumented immigrants without opportunity to seek release - cnn.com",
    "description": "Appeals court greenlights Trump admin policy of detaining undocumented immigrants without opportunity to seek release  cnn.comAppeals court backs Trump’s mass detention policy  PoliticoAppeals court endorses Trump policy of holding many ICE detainees without bond hearings  cbsnews.comU.S. appeals court upholds Trump's immigration detention policy  NBC NewsFederal appeals court gives Trump a win on immigration detention policy  MS NOW",
    "published date": "Sat, 07 Feb 2026 03:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOZzZYSEgxckl4RTBkS3BCWWNYVUxzaGNqMWQ5Vzh0OGNNY1RVZWtJTU5PTkk0dnE4R1dsUFVGTnZUVkhxTjZXbEVzN2VETTdwRGdmYnBURkRUNFdCc0wxeElveVRKSS1CbWVvSzF2VWszNXR2Qzh4T0E3dmRVQzdXYTNiTmhJZ0tsTGhSTlkwVThVQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Members of Congress will have access to unredacted Epstein files - Axios",
    "description": "Members of Congress will have access to unredacted Epstein files  AxiosMissing records from Bondi and Patel draw scrutiny in Epstein release  AxiosLutnick and Epstein were in business together, Epstein files show  cbsnews.comHow Trump Appears in the Epstein Files  The New York TimesMembers of Congress will be able to view unredacted Epstein files next week  NBC News",
    "published date": "Sat, 07 Feb 2026 05:31:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNUM4TWxlc0ZGTFFGdkE4UmVLZU56QTc3OVE2bV9NT29HalE2OV9UM25IcVdlQVRuM1pxT1RncWo3QXpSQ3hoMGtpeE53VGVaZGVhb1QzWGV2SmtsTnlmdWg3M1I0dHE2NVJZWGhtVG9LdEU3dFJxWDJZNU91Q1pyQ0xBSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Judge orders Trump administration to restore funding for rail tunnel between New York and New Jersey - AP News",
    "description": "Judge orders Trump administration to restore funding for rail tunnel between New York and New Jersey  AP NewsOfficials Pressed Schumer to Help Name Penn Station and Dulles Airport for Trump  The New York TimesTrump says he’ll free infrastructure funds for New York if Penn Station is renamed after him  The GuardianJudge rules in favor of New York and New Jersey for now in $16B tunnel fight with Trump  NBC NewsJudge orders Trump administration to unfreeze more than $16 billion for NY tunnel project  cnn.com",
    "published date": "Sat, 07 Feb 2026 02:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOVkc5Z1kxelZJbGROb1drX0plYlpodEFoSGhPeEFuQjFOSDhpVGZpLUhnakJ1azdfd0dPWEp4LXMwTUpiamJUVGZQWF84aDFaeTN6bU9nZWxYM0tTRkFvZ3RjLTVNaVFLb1pTcFB0Y2o1SjVpUTdMR3JYeHl2VUVpekJkM3FBNmlWVTJkQ0d5ODZfemRFS1Azb3JnaEhwQTFvbUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump signs proclamation to increase US imports of beef from Argentina - The Guardian",
    "description": "Trump signs proclamation to increase US imports of beef from Argentina  The GuardianTrump signs executive order quadrupling beef imports from Argentina  cbsnews.comArgentina and U.S. Sign Sweeping Trade Deal as Alliance Deepens  The New York TimesArgentina and U.S. sign a major trade deal to slash tariffs, boost political alliance  NPRTrump Boosts Argentina Beef Imports in Affordability Push  bloomberg.com",
    "published date": "Fri, 06 Feb 2026 23:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQWGw3Rm5TLUZwcWNsUFBkSXFnWFhaTXBEUUk0dHpYWlFnLUFpZjU2VEFYcXJHMU1KdWIzSjRIek82ZUlaUlk5ZWxZazdKYkVRc2NXMVJiQ1BYeWZwQmVaaEZvQ2lkODVZZVkwVW50ZDl6Zk5aUWV3dGdwYkVkQmotbzJ5a3lVUkxzSUFmaVB1RFVoR2pNR2Nn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "In a Close Election, Voters Send a Sharp Anti-Trump Message - The New York Times",
    "description": "In a Close Election, Voters Send a Sharp Anti-Trump Message  The New York TimesThe left smells blood after shocking Democratic primary result  AxiosHow a pro-Israel super PAC made a losing bet to open Democratic primary season  NBC NewsNew Jersey Democratic primary contest for House seat on knife-edge as votes trickle in  The GuardianDemocrats Mejia, Malinowski locked in tight race in N.J. special primary  MS NOW",
    "published date": "Sat, 07 Feb 2026 01:38:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOSHB6UjVTY2x6RmF0T1JYUG9seFBQcTJaV2s3cXY0b2tyeXVVU3NaaV9PUGdaTmZIWnZVVEpYNG5fdGQ2RldLSllHbVA5NFRxc2dEOVpBZlBCUTFIQnZYenN5MVRVSmVYWkFCcEd2Z282bzh0SzM4M0hSSDVTMWFjUC0zLVpmd1BMMlpYVEsyQXd0VmVyUHNJUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "TrumpRx: See the 43 drugs available on the Trump administration's new discounted drug site - cbsnews.com",
    "description": "TrumpRx: See the 43 drugs available on the Trump administration's new discounted drug site  cbsnews.comWhite House Debuts Drug-Buying Site TrumpRx, With Roughly 40 Medications  The Wall Street JournalHow TrumpRx drug prices compare to generic alternatives  AxiosHow effective will TrumpRX be at lowering prescription drug prices for Americans?  PBSTrumpRx: What to Know About Insurance Benefits, Pricing and Savings  The New York Times",
    "published date": "Fri, 06 Feb 2026 22:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1BSHplQ0RlTklmcURLLW5qTnRIWkw1cDR2LXpsWm8wR19nWHRPTVNYMlhEbW4xNmpERU83ZzFmMjMxMjBJX0FOYTZCRTUxU1llcC13WHl4YTFFdUcwakxjZnVCbVB0al9Ec1l3cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "US moves to deport 5-year-old detained in Minnesota - Reuters",
    "description": "US moves to deport 5-year-old detained in Minnesota  ReutersU.S. Seeks to Expedite Deportation of 5-Year-Old Liam Conejo Ramos  The New York TimesAdministration seeking expedited removal of 5-year-old and family, Rep. Castro says  ABC NewsFather says 5-year-old son has nightmares and wakes up crying since immigration detention  NBC NewsFamily of Liam Conejo Ramos has more time to respond to DHS deportation proceedings  MPR News",
    "published date": "Fri, 06 Feb 2026 19:59:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTXpHWjZKSU9qMDNNTFd5QnZXZWR0X3lUWXNwNk05ZWtjUkRrdnlpSGI4T3VZZUpyUmUtYmFkbThhLVY4TkdJdjVfSGdJdGN2MURIN3J2Wnd3OUh3dklTNnNCOFRQNjNQNTFCcTVpOWVhTkFoWFZPU0QzZ2haWHA1VDBvQ2k1azJaLTMtX2tnRjkxNjZOYmYzeXBZNlVwa1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "UNITED STATES-INDIA JOINT STATEMENT - The White House (.gov)",
    "description": "UNITED STATES-INDIA JOINT STATEMENT  The White House (.gov)Ambassador Greer Issues Statement on Joint Statement for a Trade Deal with India  United States Trade Representative (.gov)How the U.S. and India Finally Reached a Deal  foreignpolicy.comTrump Removes India’s 25% Russia-Related Tariff After Deal  bloomberg.comWheat, rice, poultry, milk off the table: What’s in it for agriculture sector in the India-US trade deal  Times of India",
    "published date": "Fri, 06 Feb 2026 22:19:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQLWhWdF9KSXN6TklFdjdHQ0R1QzAzTUg2YlI4TjFja2liMnJGX1ZGYUVCdjkybWxlZktrRW1vazRfd3QxYzQ3UktFZmgwd1NsbEloQmwzX2U5TmhpWEFsRnpiX1dXcjNWY2RiR1dnamNmU1B1OHNCNzROVUh6Z1llU3BwdXEzWE1pNmxiTlZtVElnZHJQdkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "California Sues a Children’s Hospital to Maintain Transgender Health Care - The New York Times",
    "description": "California Sues a Children’s Hospital to Maintain Transgender Health Care  The New York TimesCalifornia's largest children's hospital system ends gender-affirming care as a state lawsuit looms  LAistThe state finally sued a California hospital over trans health care. Families are asking: Where are our civil rights?  CalMattersInside the Battle Over Trans Care at Rady Children’s Hospital  Voice of San DiegoSan Diego judge delays decision on Rady Children's ending gender-affirming care  cbs8.com",
    "published date": "Fri, 06 Feb 2026 17:17:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOZ0FKbkM5UmlobDlOSWtVUFBpdXdueGY5UmpZVUZNYnJydE5ISTFFR0RlS0RXVFIyV3JPSFoydWNWTDdKQXNtZ2oyeGttZnppandBajhMSkl6cC0xbUZNaXZrSjJ5TG5tUndWTkNtY1BvRUdLcjRRTXRUdWh6OXRWTk1pZkcxd0VXVkxVUHYxMzR5QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump envoys met directly with Iran foreign minister in Oman - Axios",
    "description": "Trump envoys met directly with Iran foreign minister in Oman  AxiosUS and Iran conclude high-stakes talks in Oman. Here’s what to know  cnn.comU.S. and Iran hold nuclear talks amid threats of regional war  The Washington PostIran, US hold talks in Oman as fears of war hang over region  Al JazeeraU.S. restarts nuclear diplomacy with Iran amid escalating threats. Here’s what to know  PBS",
    "published date": "Fri, 06 Feb 2026 22:31:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBXdXZVeDRrdlAyYmlWellPMGRQWWZaZUZoV1gxVjR6aGQ3TXVOOFE4clhBbnFlOW9fR1BXVzlpUUsxSjY2V2VQaUwwWlRlVjNhVFRnaWRGMTFYSGZpWWF2X0pKQURkUlR4SFkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Virginia Democrats unveil a redistricting map that would aim to give them 4 more US House seats - cnn.com",
    "description": "Virginia Democrats unveil a redistricting map that would aim to give them 4 more US House seats  cnn.comVirginia Democrats propose potential 10–1 congressional map for 2026 midterms  VPMRedistricting effort aimed at helping Republicans in midterms could cost them dearly in Virginia  cbsnews.comSpanberger signs bills to send constitutional amendments to voters this year  Virginia MercuryHow We Would Rate the Democrats’ Proposed Virginia Gerrymander  Center For Politics",
    "published date": "Fri, 06 Feb 2026 16:14:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTHVLWmVSRWtwTGhmUWcxQS1NYlBxdl9RUWpjRW1JUktsWkVVb3hJRDRVZnB6R0t0dlREY1pSYTJJZFMtOEZGdVdZYV9nRkRPbDFqNkJ4Q3ljMGFFcy02d3VnVG1HRlMxSzI0Z1J3XzFtcnpld3hYMWNsUWRPRlhYdjZCMjMxbnFyRWZJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "The Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die - Slate",
    "description": "The Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die  SlateOpinion | Trump’s Indecent Nuclear Proposal  The New York TimesFor the first time in decades, the U.S. and Russia have no limits on nuclear weapons  NPRAmerica risks a nuclear-arms race with China  The EconomistScoop: U.S. and Russia agree to observe New START nuclear pact after expiration  Axios",
    "published date": "Fri, 06 Feb 2026 20:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQV3RWbWg1QjI0N0lPeEtJWTU4YzQtUXRNdnA0cHZDNmt1MVpHdFlyV3hGYTNCZ3JlcUhKV0JnRGQ5Z2R1TUJfS0V3X2M2VXJVRGs3SmJNLTl5Y2RnSWMya1FHRTVsczAxZlFMU0pNaWVaUS1XNmRjaGxadHoycjQxNkxvWnBFY0lWUDdOSFNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "SANCTUARY CALAMITY: DHS and ICE Urgently Call on Gavin Newsom and Sanctuary California to Not Release 33,179 Criminal Illegal Aliens Including Murderers, Sex Offenders, and Drug Traffickers from Jails Back into California Communities - Homeland Security (.gov)",
    "description": "SANCTUARY CALAMITY: DHS and ICE Urgently Call on Gavin Newsom and Sanctuary California to Not Release 33,179 Criminal Illegal Aliens Including Murderers, Sex Offenders, and Drug Traffickers from Jails Back into California Communities  Homeland Security (.gov)Newsom debunks DHS claim about California releasing undocumented criminals from prison  The GuardianGovernor’s Office demands Kristi Noem learn to Google before sending stupid letters: California works with ICE to deport criminals  California State Portal | CA.govTrump admin urges Newsom to honor ICE detainers for more than 33K criminal illegal immigrants  Fox NewsWhite House press secretary Karoline Leavitt pounces on Gavin Newsom over release of jailed illegal immigrants  New York Post",
    "published date": "Fri, 06 Feb 2026 18:15:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQOFhyS1BWOWY0UGg3RW5ZZlY2ekZnSzNyYTYwYzAySFR6NEtOQlNSWDdQQ2RXZ2ZIZUFQR2NVYnV4TlcyOXdnV2FFLXBobEtpS3ZvVjJTVnNuU3VmTWFDSmk1OExwcUtndzgyTkdUckR3VDYtaEVQUnhBSnh3bUcwc1VNazhyMEF1SlEzR1pxMHdLaHZQLVRiaXd3SHYtZnEzZ21mYkUwVFhYVzZHVmtwd2JVQ3gyZ0dTc2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "100 million on alert for dangerous cold, as some see coldest winds of season - ABC News",
    "description": "100 million on alert for dangerous cold, as some see coldest winds of season  ABC NewsExtreme cold warning, snow this weekend | Live updates  ABC7 New YorkNortheast Cold Fatigue Lasts Through The Weekend With High Winds, Dangerous Wind Chills, Snow  The Weather Channel'Coldest air of the whole winter' in forecast. Blame the polar vortex.  USA TodayNew York City Forecast to See More Snow and then Bitter Cold  The New York Times",
    "published date": "Fri, 06 Feb 2026 16:41:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOaXpuTHNHay10LTZWNzZSWEVnU3daOEpaM21sQy01NThWMXpaNDBrYXdjbnBhMXE4NW1DdnVHdDNkeldpSTFSTGE3T21NbEVaMllRbWpVbHdtSF9ldjdkZUhBZi16TDd6TjFPV2xFWUNNY3paOU5sTVBIR3ZtUEhGbTRvbVp1QmhKTGhDdTZQekhnMG9pSzZ3ZkdwcUo3ZzDSAaQBQVVfeXFMT3lhOXRTVEV3TFNrQ0hfbkJyTHE2SFVzVG1lX0ZsU0Jzem5pdkxtV1ZCZWRFN0hYa1F0WF9yck5jc1NBUjA2S3ZGRUExYXRTX3ZETkp1bkU1NUVTSEhKa1BmSUJNYzltSHgyQ1pTYXRhUWxVMXNaLUwteUx5LWlULVRFVjROcmhiSUhKZ24yT2xxZEpGVjZESEZPWWRiYWk5VUNwWnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Colorado Funeral Home Director Is Sentenced to 40 Years in Corpse Abuse Case - The New York Times",
    "description": "Colorado Funeral Home Director Is Sentenced to 40 Years in Corpse Abuse Case  The New York TimesColorado funeral home director sentenced to 40 years for abusing corpses  BBCColorado funeral home owner sentenced to 40 years for abusing 189 bodies  The GuardianA man whose mother was found among 189 decaying bodies tells the story  AP NewsTakeaways from AP's report on a woman whose body was among 189 left to decay in a funeral home  Yahoo",
    "published date": "Sat, 07 Feb 2026 00:33:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdVF2QzJUX1pFZXl4NnhkRElPMXl4NkRXTjRNb3pzb25MMU52Uzd5azNIZ04yVjdUUkptTjdvQjBIWkpVc2d2X3ZzN253a3JXcU9uWGh2SmdkMzEyVWdROTZxX280dzJxNWdjMXhaTTJGQmtaNUxBQ2huSTlLcjRteHlrRl8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Border Patrol agent's texts after he shot a Chicago woman five times will be released, judge rules - NBC News",
    "description": "Border Patrol agent's texts after he shot a Chicago woman five times will be released, judge rules  NBC NewsJudge allows release of body camera footage in case of Chicago woman shot by CBP  ABC NewsJudge Allows Release of Evidence From Border Patrol Shooting  The New York TimesJudge allows release of bodycam footage, texts in Chicago shooting by Border Patrol agent  ReutersFederal judge will let Marimar Martinez release text messages sent by Border Patrol agent who shot her  Chicago Sun-Times",
    "published date": "Fri, 06 Feb 2026 18:51:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQUjFIeUk5czR0b0tkcC01U3IxOE9uRjRXQW1UQnN3Q2ctcFRNVkZONHZfTDIxempWVldaUnozelVXSTM0SGZsQWNIQTNvdF9ZTFdwM3lzLUl3UHBnZVVmY0trbVl4NUE4WV80ZTh0RFloN2dNS1U0dnFESzZwTTItdjhuNHZVMWUwanBOX0FpTHFxcWR2TUhYZUc0MEpsd1J5UmdjQ2Rxbm9oa2RmcjJHOU9PUlotLTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump admin captures, charges Libyan man with involvement in 2012 Benghazi attack - Politico",
    "description": "Trump admin captures, charges Libyan man with involvement in 2012 Benghazi attack  PoliticoBenghazi terror suspect extradited to face US charges  Fox NewsBondi announces the arrest of one of the alleged key participants in Benghazi attack  KOMOAlleged key participant in 2012 Benghazi attack brought to U.S. to face charges  The Washington PostAttorney General Pam Bondi & FBI Director Kash Patel Make Announcement  C-SPAN",
    "published date": "Fri, 06 Feb 2026 18:10:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPSGFuUl9LbUZidGNxV1BlUjZ4ekpWS2pjcThocjBNVllPbWZEZXI1RFM2a0NpMFJUb2pZM3ZSUGluRnRZRUlibWJEQ2lvckpubXM3VTAzVjd2Z2ZRbUl4SF9YNDRNZElpbGtBT080LVJOTURmVmk2RkM2N2Eya3U2YnZaQjJUVnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "N.Y.P.D. Sergeant Found Guilty in Death of Bronx Man He Threw Cooler At - The New York Times",
    "description": "N.Y.P.D. Sergeant Found Guilty in Death of Bronx Man He Threw Cooler At  The New York TimesNYPD cooler death: Sergeant Erik Duran found guilty of manslaughter, not guilty of criminally negligent homicide  ABC7 New YorkHow a Routine Drug Bust Turned Deadly  The New York TimesNew York officer who hit suspect with cooler found guilty of manslaughter  The GuardianNew York City police officer convicted of manslaughter in cooler throwing death  ABC News",
    "published date": "Fri, 06 Feb 2026 20:10:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQT0NaeTYxN1VPWUtPd3hxVS1vSmo3RVpkNy12LTBvem5yMnNzOXRyeDJ3M3prbmVicTZQWVBGU2NiTlFjMUpRVW9rbjJVOS1OVDd4NFFKY2J5VHhIUkpldmxxODZpSGU0eEZ2NkJiVm9kbk81eFZodVU3TEQzbUZYSEZwRTNjWTRON1U0dWpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What is the SAVE America Act? Here's what to know about the GOP elections bill - cbsnews.com",
    "description": "What is the SAVE America Act? Here's what to know about the GOP elections bill  cbsnews.comNew SAVE Act Bills Would Still Block Millions of Americans From Voting  Brennan Center for JusticeSAVE Act voter ID bill is on the minds of Trump and Congress: What to know  CNBCVOTE: Should you be required to show proof of citizenship before registering to vote?  thenationaldesk.comGOP fast tracks monster voter suppression bill that could disenfranchise millions by requiring proof of citizenship at polls  Democracy Docket",
    "published date": "Fri, 06 Feb 2026 11:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA0WjFvVWd1VmtoS1pjOF9YbUVIRjlBM1MzT2tzNHVidmUzNTh2N3JTWDc1NUZ0a2M5MmVPUlBYeTlTTkpYX0Rpam5YcnRWcDN6czBTLURoSE05SWNsb2hVNGlCZWpqYUp5czRnNldIWFVubEJfZnNQZFVQaznSAYIBQVVfeXFMUEI0ejl0cTYzMklPZnpmOTdnR1liYllYdWZ3UmZkdEhnN1NuOGc4X0lubndGdEZlNDNBSUoyb2dSVV9mRHZtMVctcExUaUwzX095aXkzTmhOYWJnTzliWHdqd3JTTGd0bFBlbkZJSWV1MnBlT00zY3BNaVFNSWdFWEFHQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  }
]