[
  {
    "title": "Savannah Guthrie’s Brother Renews Plea for Return of Their Missing Mother, Nancy - The New York Times",
    "description": "Savannah Guthrie’s Brother Renews Plea for Return of Their Missing Mother, Nancy  The New York TimesLive updates: The search for Savannah Guthrie’s missing mother Nancy  cnn.comOfficials believe Savannah Guthrie's mother, Nancy, is 'still out there' but have no suspects as abduction investigation enters 6th day  YahooHarvey Levin gives explosive update on purported Nancy Levin ransom note on ‘Hannity’  foxnews.comHow could Nancy Guthrie's kidnapper avoid surveillance cameras?  USA Today",
    "published date": "Fri, 06 Feb 2026 14:42:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPenpNbkltWlNwNTFjTWY5eEV4NDlkX3FSTUl3T2VwYU5vOEdoZW13UUVsQ0VQcV9lbzNIa2xxZmhQT3llY3gwWkRMeEhWVU1zRTcyZnh0eW44ZE93QTVXM2hvekZDZ1dZSDdUMktRTHJ1anRjMVBuVkV1VXJPdnNORXZjVVJ1V21t?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump shares racist video depicting Obamas as apes, sparking outrage - cnn.com",
    "description": "Trump shares racist video depicting Obamas as apes, sparking outrage  cnn.comRepublican Senator Tim Scott Lambastes Trump for ‘Racist’ Meme  bloomberg.comTrump shares a racist video that depicts the Obamas as primates  The Washington Post‘Most racist thing I’ve seen out of this White House’: Tim Scott slams Trump for post depicting Obamas as monkeys  PoliticoTrump shares racist video depicting Obamas as apes  Reuters",
    "published date": "Fri, 06 Feb 2026 14:02:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOV3QtSUx2OGJxZC01N0E3ZXl6ZzJxemVSNGFMRlVvWnRjVnBNX0FVZXBDNkx2bU52WnVCWlJwZ2J2Sml1X0VkblNjRi1XYVpoWTJ5VEI3dHBFeGJJRF9ZMk9MdHhLcW5oTGN3MWJ4NGhldGZUWVk4RWRIRDlZMktUTGFTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Border czar tells Minnesotans to stop impeding ICE. It’s not always clear what that means. - Star Tribune",
    "description": "Border czar tells Minnesotans to stop impeding ICE. It’s not always clear what that means.  Star TribuneTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsHundreds of Agents Left Minnesota, but Residents Are Seeing Little Change  The New York TimesBorder czar Homan orders 700 federal officers out of Minnesota, hails 'unprecedented cooperation'  5 EYEWITNESS NEWSTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The Guardian",
    "published date": "Fri, 06 Feb 2026 12:05:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOS2w3cG5SMmNXa19uN0tnMnJyNzJhYWt5R3VkaEVuU2p2SHJNa1RvaFg5SU1OU2UwOFZEakpiWE9CSWV3V2hLQlJGY1Z3b2pPQWRhQUc3bGE1ZWNWOV8zM3NwbGQ3cFBGYlJuaTJUeEpFRVFhMGZCZzdJUlc4MEdKSjRTTWt1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "As Minnesota Reels Amid Immigration Crackdown, a Sheriff Agonizes Over Her Role - The New York Times",
    "description": "As Minnesota Reels Amid Immigration Crackdown, a Sheriff Agonizes Over Her Role  The New York TimesCounty attorneys nix plan between Minnesota sheriffs and ICE  MinnPostHennepin County Sheriff Dawanna Witt says she feels \"scapegoated\" by feds but is open to some cooperation  cbsnews.comPotential ICE jail agreement’s legality in question  5 EYEWITNESS NEWSHennepin County sheriff says she’s had ‘healthy’ conversations with Homan on ICE drawdown  MPR News",
    "published date": "Fri, 06 Feb 2026 10:04:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBhT3MzQ0lTc1V4QlNYc0ZlS3lPYzJtTUlZTWpUUC1oYjRxbEdGdDM4bHpVYU1aNThFNWlRTGl0OWhXcHpIcHBDT1ZQN0ZzRFhBOEJvN0RTSE42TVVFQk5hM1ZVTEN0VTZrd3pyc1dVTk5XVGJDS3ByZHJkVWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump wants Penn Station, Dulles Airport named after him in funding deal with Schumer, sources say - ABC News",
    "description": "Trump wants Penn Station, Dulles Airport named after him in funding deal with Schumer, sources say  ABC NewsTrump wanted Dulles Airport and Penn Station named after him as condition of releasing rail tunnel funds  PoliticoTrump says he’ll free infrastructure funds for New York if Penn Station is renamed after him  The GuardianDemocrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station  Axios$16 Billion Hudson River Tunnel Project Begins to Wind Down  The New York Times",
    "published date": "Fri, 06 Feb 2026 13:07:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQS3lOdjRBSFctRlR3ZUxhTy1IenotbFlZcFEtSE1tWVozMXZva2JEYXNoNVduSS1IUU0zLVFQMnExT05mTWc3UmxhRUFsdkNKQldTM1pzOGZ2c0I1WHl6eTVNalVuQUV1T1RxYk5GVFZZT3B5NTF6bGI3ZllobzVGQjNIcUVtamp3WGo0NTBFZ3lKeERSSGJFSjBlR1BhZDTSAaQBQVVfeXFMUHBlcEk1Z2FYZDlpNTZabU5WcmFyNEdXSnBCX3dSSXlxeF95N2dmQW9yOVcyU2RvTnZmQmNfdDhPMkxQZ25YX0tUNGMxQXFKejYtS1lnM21rWFpJaU56aXYzOFZKWnVsYVp2MXZfVGdHS2YyT3JaUlZKQnMwRjhxYm9rb3NiZmpGbE8xa3dZZk9tRW9YaFkwU25QZVpIVFVaWm5tMEM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Steve Kornacki: Democratic primary season kicks off with an anti-establishment earthquake - NBC News",
    "description": "Steve Kornacki: Democratic primary season kicks off with an anti-establishment earthquake  NBC NewsNew Jersey 11th Congressional District Special Primary Election Results 2026  The New York TimesMejia in Dogfight with Malinowski for CD-11 Seat as Mejia Surges into First Place  Insider NJA dozen Democrats are vying for the nomination in N.J. special congressional primary  MS NOWNew Jersey's special Democratic primary too early to call  NPR",
    "published date": "Fri, 06 Feb 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQZWhCNkVjUElpM014dnVIbHNYc1F1U1NqLTRjc2dtaDVLaUhUa2lRTHJyTVNvdTBId2lDUGtjeTRPdG9LOVN2N3lsS0ZXVFhQdDFfWGpZekZjcWVLV0R3aXFEUmN4UzB3TGZtVWRhU0xJWko2elg5NmFvXzZRZDRNbk90WU1FWWdnNVduTkE4U3c4MzhNNUt4VXdValo3MHRpNUZabUVqMzJ0WFZ4QlJCYldiSjBxaEswUzI0Vk9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Iran and US set for talks in Oman over nuclear program after Tehran shaken by nationwide protests - NPR",
    "description": "Iran and US set for talks in Oman over nuclear program after Tehran shaken by nationwide protests  NPRU.S. and Iran plan to continue nuclear talks after first round in Oman  AxiosUS and Iran conclude high-stakes talks in Oman. Here’s what to know  cnn.comUS says Trump prefers diplomacy with Iran but warns he has military options  ReutersIran Refuses to End Nuclear Enrichment in Talks With U.S.  The Wall Street Journal",
    "published date": "Fri, 06 Feb 2026 07:52:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNWW82UEpUYUhfQTJqRlJOeWxtckhjenc5bmJxVGQybVhkeW5YWVV2c2ZpWVk3YVJxN0Zhb29fZG9DQ212ejBZVmFwXzRpS1dOQ3ZTSTdiRVpSSmN6Ty1uN1R2SVg2eGllOHAwdlVTUFBSdE1CeEZFZkQtaUtTMFJORnRnTndKMzhwZ0hOXzJPaVBSWTE4NkV6MFQ1cEx6Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Car crashes into LA grocery store; 3 dead, 2 critically injured: Officials - ABC News",
    "description": "Car crashes into LA grocery store; 3 dead, 2 critically injured: Officials  ABC NewsAt least 3 dead, 6 injured after car crashes into 99 Ranch Market in Westwood  ABC7 Los Angeles3 people dead, several others injured after car slams into Westwood grocery store  NBC4 Los AngelesDeadly crash in Westwood  LAist3 dead, 6 hurt after 92-year-old driver hits bicyclist and crashes into Los Angeles grocery store  AP News",
    "published date": "Fri, 06 Feb 2026 13:23:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQYnl3QkVhTVlTRGZpbGxmSTl4RDZDUnNFMHk3MFNoT1B2T0IyYWhvb2JuUmtRZ3VPanZTWnVWMS1GUktzZmQ2UXozdXExUzlvVDFRdUdaRXJGRW8tNTY3YmVrOGxxUFlSY2lveFpVMk1qWFRycGlEcDJNNXRYWlVnMVdWa0daanVxVjZnalVB0gGTAUFVX3lxTFAybHozbFRyMFFiS0VaNDJQd1JvVk4yTVRYU0I1SkcxRVBwb0xsOXJqWTNCSnFjeHRMZzFXZ2ZZd1IwY3JUbllOcm5wQXhOZGxHbjBDM1dGdm8tcGhoNngxS2tSMHJyN1NVSFI5enE3MG1uU01fSmFUSDd3eTkySTJzNE1rVDMyakY3TFRMOE1EV2NYcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "TrumpRx debuts with several dozen discounted drugs - Politico",
    "description": "TrumpRx debuts with several dozen discounted drugs  PoliticoWhite House launches direct-to-consumer drug site TrumpRx. Here's what to know  CNBCWhite House Debuts Drug-Buying Site TrumpRx, With Roughly 40 Medications  The Wall Street JournalPresident launches TrumpRx.gov website offering Americans discounted prescription drug prices: ‘Historic’  Fox BusinessWhite House unveils TrumpRx website for medication discounts  NPR",
    "published date": "Fri, 06 Feb 2026 01:30:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNkhYcjI2UWFxUi0xV3h6LWdYWjdnS1d3X2RyRUpkelpvZWVTS21QYzd4Q1JJcVRoWjVocGtTWVliZTFfUmwwMXRlUW5jd0NZdW9PbDFlY013Wjdmeks5QXJuNEN5dWM4Z05XNGpWZTdzRnI4RWZSNHh4QmQ0ZC1FZ0M5Rk5ITkVreHcwekZiZnFnV0dtZFVUQnlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Ronald Hicks to be installed as 11th archbishop of New York - NPR",
    "description": "Ronald Hicks to be installed as 11th archbishop of New York  NPRNew York’s Next Archbishop Introduces Himself to ‘the Parish of America’  The New York TimesEXCLUSIVE: Timothy Cardinal Dolan’s Exit Interview  The Free Press'Todos, todos, todos': NY's new archbishop signals church of bridges and dialogue  National Catholic ReporterCardinal Timothy Dolan, Cardinal James Gibbons and the Virtue of Courtesy  National Catholic Register",
    "published date": "Fri, 06 Feb 2026 08:00:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNcXdDNkdLeXlqSnhDS05vZXdxMWJIWlkyaVRxSkUwTk1xWkhmSWNDSWxaTVpJcmNuN3RkUkdNaVY1U2FxOVNJd2VDcC11Z2FwQ3k2a1g0UlB1Y3NKTEJneUpFUnpXRDctV1lrTUZFYVVCX2RJSVpSc1J1ZWpiVnRDWWhRUHJlcW8yVGh2VWE1OXozQmJUS2I3ZHNwUW1IeFVfcFpVMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Opinion | A federal judge schools chaotic Kristi Noem - The Washington Post",
    "description": "Opinion | A federal judge schools chaotic Kristi Noem  The Washington PostOhio senators, governor respond to calls from Brown to extend protections for Haitians  Ohio Capital JournalThe original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th NewsOhio’s GOP governor: Ending TPS for Haitians would be ‘blow to the economy’  The HillArchbishop Wenski makes case for ‘permanent’ solution for Haitian refugees in U.S.  EWTN News",
    "published date": "Fri, 06 Feb 2026 16:31:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZTFHZVd2WDJnSDJwSGxkTzVhdnZtcTZoWkswTGF0Zk1UZXU5QVR4bHJjaWJRY0tqUmZhSE9uX3BLM0xsWTZvRUxqMjFMdlUwQmtLZkNvREtvak8xSnJjWWltZzluVXpJSWtkSWdEcWpYZW1WM1hmNUhDMTNXblhZNWFuNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump says Bondi directed Gabbard to attend Georgia raid - Axios",
    "description": "Trump says Bondi directed Gabbard to attend Georgia raid  AxiosTulsi Gabbard went down to Georgia — and no one in the Trump administration wants to take credit  cnn.comWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – as it happened  The GuardianTrump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid  ABC NewsWhite House Offers Shifting Story on Gabbard’s Presence at Georgia Raid  The New York Times",
    "published date": "Fri, 06 Feb 2026 07:19:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNLWUxeG9xdzJYSkpFc1pwOGdPYVNSbGV3TTE0N3NLcjlScS16eHhISDJTSjhNTGJiazIyTy1fbDJ0UGhXd3hKNy10VURYdDVWOGcyRFlLSGtWdk15RUFTMGo4V085WEJXSktkTGVSUmpDNlJVUlRYNy1RUXVWendYdg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Virginia Democrats propose potential 10–1 congressional map for 2026 midterms - VPM",
    "description": "Virginia Democrats propose potential 10–1 congressional map for 2026 midterms  VPMVirginia Democrats release long-awaited 10–1 congressional map  Virginia MercuryAll but one Virginia House district could go blue in Democrats’ proposed map  The Washington PostVirginia Democrats Propose New Congressional Maps Ahead of Midterms  The New York TimesGeneral Assembly Democrats release redistricting map  Cardinal News",
    "published date": "Fri, 06 Feb 2026 00:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOWjBFeVFlQzVnemMyWl9HYlpvVlFTSDVtSU9OblJJU1lIZ1o2cVBPMUQ3SWFORjdSa3BjZVNaT01fQWdnemN6NVZYMlpHazQzNUVnYUNjaDY0eGhXZElWRmJyN2tnU3plaDNXdGZySzZOMFFnck1UaHlUSEw1b3pSWFZjT1BPQ001UVp4bko2XzA3d3M4WFVnMHNSclFqLXV3Rk9tX09XQnhrOHhqeHJEcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown - The New York Times",
    "description": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown  The New York TimesTop Democratic appropriator in House pitches funding TSA, FEMA as DHS shutdown looms  The HillDemocrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms  The Guardian'Ridiculous:' Republicans reject Dems' 10 demands for DHS reforms  KOMOFebruary 5, 2026 — Trump administration news, lawmakers divided over DHS funding  cnn.com",
    "published date": "Fri, 06 Feb 2026 00:21:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPd2NUeWZSdVlyenp3VW9LX0Jtank4OHBiN1pZWTV4emRHWlZIdE53OWM5Nmx6X3RMc094Z0lQUmRud2huQzJXZk4wbC04bHRIRDYtekZ2Qks2eEp4MjN0VUZJNF9KYm5Pd0FIanYyM1VGRy1iVHJVQjFsSmhLUmpFMHlaNDV3Zi1EUFgtWDhWS2EyQWI0SV9ITVhvTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Renowned Houston surgeon allegedly faked records to block patients' liver transplants - cbsnews.com",
    "description": "Renowned Houston surgeon allegedly faked records to block patients' liver transplants  cbsnews.comTexas Surgeon Faces Federal Charges That He Falsified Patient Records  The New York TimesHouston doctor indicted on charges he falsified records to block patients' liver transplants  ABC NewsMemorial Hermann physician charged with falsifying records, making transplant recipients ineligible for donations, DOJ says  ABC13 HoustonHouston doctor indicted for allegedly altering medical records, making patients ineligible for organ transplants  KHOU",
    "published date": "Fri, 06 Feb 2026 10:01:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxORXNkX0QzQTdnTjlmTGxRRXd5UG5NQTU0R1Z4eDBsTUxTUHF2bl9HdlZwVVlEb2k5b1FGT3g2YU1xUmhzOGFIcnB6b0lJVFRLZlVpVjJPODFQVDBtaHpqVmtXQzFFYXRKWlJtYnd4VS1MVjlUSG9NUlFQZ2FOd2RmWDJhMXhKaVN3cE0tb3V4UHBFSnRwemI4NU1nMU93VFFTNFIwdTZSWdIBrAFBVV95cUxNY3Ftc05CTk54R0ttaTdUaE9nbHNEMEp6ejJxVTczLWJqSFZ1cmZiNUlhSXIzMmRicGxCTEdKa0hzQXRUNEVyNTAwaF84aGQxR1Y4eUNpRzVtUXh0NmZVaEZ6cUhXUEpobTh1a3psNGRfUmVYcjh6T05MOHIyd3A0bk1tYk9mN1p4NFZxWVUyM0RhR1pnaHI4YW90MGI0bXRVc0c5Z2NVUE92V0lO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Democrats involved in 'illegal orders' video say they won't cooperate with DOJ probe - NBC News",
    "description": "Democrats involved in 'illegal orders' video say they won't cooperate with DOJ probe  NBC NewsLawmakers Say They Will Not Cooperate With Inquiry Into Illegal Orders Video  The New York TimesSlotkin declines DOJ interview request in ‘illegal orders’ video case  The Washington PostDemocrats refuse to sit for DOJ interviews over ‘illegal orders’ video  cnn.comSlotkin rejects Justice Department request for interview on Democrats' video about 'illegal orders'  AP News",
    "published date": "Fri, 06 Feb 2026 03:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPckYxUXlvVlJ2UDhFRWN4Vk1mVDdGelVhMHJkRVJoZ2VDcWx3Z1hiY0Y0QWtaVFZjdGZPS0I0Yjh3ejBvNVh0UDFrdGRiNFExR1luRzdMejh6bmVMNXozTjZNa0FjS1NXVXdtZ0FBT3BieVc1NXRMaXppWVFTU2F3S0lkOFBXMlUtcUZBMkdYTVNUd0lWRVFIbktSVmNKaXVkZDB1NldxR01TemJfRmNTR2FnZ2VfdDlFTnFka05R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Late Night Finds Trump Out of Place at Prayer Breakfast - The New York Times",
    "description": "Late Night Finds Trump Out of Place at Prayer Breakfast  The New York TimesWATCH: Trump says he will revoke church tax exempt status if leaders 'say something bad about' him  PBSTrump returns to National Prayer Breakfast as faith takes center stage in second term  foxnews.comTrump announces event to 'rededicate America as one nation under God'  USA TodayTrump Wonders if He's 'Pure in Heart' at Prayer Breakfast, Says He Doesn't 'Qualify' for Heaven  People.com",
    "published date": "Fri, 06 Feb 2026 07:09:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRGpDbGhzTE9yQ0h4c2oxUERoRklCVk8wQUY5d1F4UFZ1UnFDQllUZnhHNjYySHROdXB1VTVZbW5kYThYcnVXM0Z6dlFrTUpkd25CUkpOYlZha1drYzU3MnlZcUlFaWxma1hXY2ZPbnJnYWlzTmdkUDJtb0FkaTdsOWNnNWRFOGlCeHhCUVdSeGZMMlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files - BBC",
    "description": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files  BBCLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC NewsJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comJeffrey Epstein’s Money Mingled With Silicon Valley Start-Ups  The New York TimesTrump says America should move on from Epstein - it may not be that easy  BBC",
    "published date": "Wed, 04 Feb 2026 19:57:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE00OXVqYjJYVU5FdVk5dmVkTmxBM2RjREthcWJxWkZnRllqLWRwRUctRFVfZGlZUDB3M01SQm9BOE91bkRhc1lIMEp1SmJOdWJMdUtOZm9UR1FIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Coldest air of the season, snow to hit parts of the Northeast - ABC News",
    "description": "Coldest air of the season, snow to hit parts of the Northeast  ABC News'Coldest air of the whole winter' in forecast. Blame the polar vortex.  USA TodayNYC’s weekend temps will dip to dangerous lows: ‘Going to be in trouble’  New York PostNortheast Cold Fatigue Lasts Through The Weekend With High Winds, Dangerous Wind Chills, Snow  The Weather ChannelExtreme Cold Warning with potential for snow in New York, New Jersey area  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 17:42:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOSFcyWm1pZTZKUTl6VFJFc3JzRlRRcFdZOXQ0clRpbGN6dmtELVpWRGRkNGVqMGhsTE1uUFo5WUR1M1gyelJ4WDhVcXA1WlFIejZrUldiSU9fSHRJQkFXN1BibTc3OXZSaDM3VUN3bnJ1UmVYXzJudnBHdm1WWnotVHd3MmlvdkJvbXhtbGZJaHFWUdIBlwFBVV95cUxNNF9EWVJKLUs3VzBfYzRqdEpkc0FmcTlHZ3ZCZFZ0Q0g1UXYtbUpPdldyckpvVEF0andsSHd5N1ExQ1A1VUoyOFQ5VlpDR2hWY0JzUk14UG1MWVktZ2ZOYlJLQmdEai1BMTRiT0NOWkZsXy1ZU3ZHc1ZLb1VFYUhCa3Ywa1FPN3kzb09DcWdueXU5SXVlVEZV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks - Politico",
    "description": "DHS negotiations have yet to get underway , Thune says, as shutdown clock ticks  Politico\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosGOP game-plans for a DHS shutdown, as skepticism grows over talks  The HillPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News NetworkTrump signs bill ending government shutdown, starting clock on ICE talks  cnn.com",
    "published date": "Thu, 05 Feb 2026 20:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNQkpMTzk0SGJpRlYyMnVfWHRjODlLeXFqU0ZERWtVMElhRDdFNmhpNEdtT3hLYnNtM1pVYnNPVVg4eHdoei13S1ZlNXd4dUpDTUotUjQ2N2VwSFdHcEw4ZUlvNi1tYkZmTEtkenFKelNvWXF3VnU0VXg3WGVCZ004YUxFUm9jMGhWaS04clFtaXliczZ6U2Noc2lIUzltMjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "U.S. and Russia agree to resume high-level military-to-military communication - cbsnews.com",
    "description": "U.S. and Russia agree to resume high-level military-to-military communication  cbsnews.comU.S., Russia to resume high-level military talks  The Washington PostUkraine war briefing: Kyiv and Moscow hold major prisoner exchange  The GuardianRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBCRussia's Dmitriev says progress made on Ukraine peace deal  Reuters",
    "published date": "Thu, 05 Feb 2026 17:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE02MTRaM1dVVUMzTTR4MTg3SEFJcGlxd0FYVjBtcVYxNnZSdzAtR2RnNjdGS2JmOWpjN2tFOUdQZUw0YkFOd2pXS0NEb1BQbjkwVG5UUU1LYmFCWkJ2dGRSUTk5X05PbzJiNThZS1pmUdIBdEFVX3lxTFA0UUd5aUxtcWdOMEZIMDBNd3NCVW5yejRFVmtVN3lrNjlmdERwa1RUVy1pNFZtNnpaNjFaQjIyVldLdHpoeVBpNi10Yl9ETjZyc212Vl9WS2dUR3piaUFwSWlQd1FpbGp3dFZPamtWRmxSeXNh?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Trump officials push citizenship question in test survey for 2030 census - Axios",
    "description": "Trump officials push citizenship question in test survey for 2030 census  AxiosA major census test faces cutbacks — with postal workers tapped to help count  NPRColorado Springs dropped from list of U.S. Census test sites  Colorado Public RadioTrump officials propose testing a citizenship question amid a push to alter the census  NPRTrump administration cuts number of sites for testing the 2030 census, focusing on the South  AP News",
    "published date": "Fri, 06 Feb 2026 05:45:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPczUyZnBET2VJZlhIWElkNWkwdnZtaXFnMm5jQjlGa1UzZXVrOWo0MHdscmtiNE1sallGRFJtZ1lXSHZZRUpfMG1RZ2RVOGNOdjdncXNqREM1YTdoTmk3b25XS3VGOExnamtKZ3ZFVXEtZ0VuSlFXVmtabUo4OU5zZ2NxZk8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - DW.com",
    "description": "Why Trump and his Republicans can't take over US elections  DW.comTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comWarner warns of ‘coordinated effort’ to interfere in midterm elections  The HillIt’s already too late to change the voting rules for November  MS NOWLocal officials push back on Trump's threats to 'nationalize' elections in targeted cities  NBC News",
    "published date": "Thu, 05 Feb 2026 15:54:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "DED, Pillen no-bid contract fight with auditor heads to State Patrol, AG - Nebraska Examiner",
    "description": "DED, Pillen no-bid contract fight with auditor heads to State Patrol, AG  Nebraska ExaminerNebraska State Auditor testifies on bill that makes new requirements for emergency contracts  ketv.comFormer state senator McKeon calls for investigation of no-bid contract awarded to Pillen associate  Central Nebraska TodayAmid fight with Pillen, State auditor pushes bill to require notification of emergency no-bid contracts  WOWTState auditor turns over records on suspicious no-bid contract to attorney general, state patrol  Nebraska Public Media",
    "published date": "Fri, 06 Feb 2026 03:10:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQN2FKeDNNQzFTWUVLbVlkYWxsZ0VTSmE0WGRKWThSU0pySjZVWG1QbGpxWC1WdG93NkhCQTNTVTlRU3V1QXJZbFFOVWFPVDdlUEZTakpzQ1d6bG5Dc1VmZ0FEdy1Ma1lvOTQ2em1menlRblpZRV9ZZTJqMXpiSzZGZEowUzI1UTdMdjlkRGItRnN3eUkxMW9Damtxazk3ZFlsOC12MjdreS1FWnZWNzkyOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nebraskaexaminer.com",
      "title": "Nebraska Examiner"
    }
  },
  {
    "title": "Strike date set: SFUSD teachers to walk off jobs Monday - The San Francisco Standard",
    "description": "Strike date set: SFUSD teachers to walk off jobs Monday  The San Francisco StandardState report moves S.F. teachers’ strike closer. Walkout could come in days.  Mission LocalSan Francisco Unified School District facing dire fiscal situation amid looming teachers' strike  ABC7 San FranciscoParents anxious but supportive as SFUSD strike looms: ‘Even one day could affect their learning’  San Francisco ChronicleCalifornia faces teacher strikes across state for better pay and work conditions  The Guardian",
    "published date": "Thu, 05 Feb 2026 15:51:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBDbHBkQXkyREZCMF9qYW1CNXBfMEtEeUhYbFM3eDI5VFR3N3Buek8xSUZHdVVmdXNVV09XVWJHMDJkVk42MC04UnFPbHQwNUpjQWxDRUUzamlrZDVlRk04Mko2MlIxOHpFVk9wemNpY2FmTW5zamhwbVFmNDFLMU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Trump says he won’t extend nuclear arms treaty with Russia - Politico",
    "description": "Trump says he won’t extend nuclear arms treaty with Russia  PoliticoAmerica risks a nuclear-arms race with China  The EconomistTrump rejects call from Russia’s Putin to extend cap on nuclear deployments  Al JazeeraScoop: U.S. and Russia agree to observe New START nuclear pact after expiration  AxiosWatch: The US and Russia's nuclear treaty is dead. What comes next?  BBC",
    "published date": "Thu, 05 Feb 2026 20:14:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOZWRWUHVHTm02N3B0MDBCSlNZOHViNVFwVFBsTm5PdGdzbWVjaVgycURZd183QnVPdzM3VndoMnBUMEZ1SEdyVlJGdnhWTUo0WVhIY2k4STRTUVNMR1pNbFhLbWtGNWJSVHhZMGEwYVRIejlMejFDa3ZuUnlUTTdQb1o2RWNjN1Z3dHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hillary Clinton calls for public hearing in House Epstein investigation - PBS",
    "description": "Hillary Clinton calls for public hearing in House Epstein investigation  PBSClintons keep pushing for public hearings as Comer digs in his heels  PoliticoHillary Clinton presses Comer for public hearing instead of Epstein investigation deposition  The HillAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsHillary Clinton wants testimony on Jeffrey Epstein in public: 'Let's stop the games'  CNBC",
    "published date": "Thu, 05 Feb 2026 19:55:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOS0IzMkdNTGczSFAxbUV4bXc0ZkhYZDZJYmtNcUVWZmhLWVlndmVZZXFlMFUzMXpUQmFGWnU3ZHdSSElPSlV6aDlNdGVHRXlWeUZrUXNlZG92R3F5UFJrMXR0YVFpcXk1OElyaG13LXl3T0lMemw1SUdxOXRBS3NzWl9TLUZoakJXNDBfVzNPelo2LXlPWkFBU1dPTzhzN2RTNVR6d1RvSjUySGVhWnfSAbMBQVVfeXFMTmZLcDlVaG9hdllCVmRLaXdLTnFhNnh6aDFzVS1pZzBUYXdJSmlyNkdvVEp2WUlUSHYxbUpqZ2ttVXdORTZXajVyX1lDQktnN2dFUEJRZmpGVDBxcmlnUnZkSE5HaE5nMVpjUHJfNl9sQTY1MXF4REFnYVRKZ250UE5BdGFzdmFUMWxLbjBsOExnU2E3bGI3ck5SM2tTMFhJdDc1a2dEQ2dXVER3ODFFeGN2U2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuba to introduce plan to address fuel shortage amid US blockade  Al JazeeraCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba to roll out rationing plan as US moves to block fuel supply  ReutersWhat a Deal Between Trump and Cuba Might Look Like  foreignpolicy.com",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown - The Daily Beast",
    "description": "Condescending Vance Tells Kaitlan Collins to ‘Have Some Fun’ After Trump Meltdown  The Daily BeastOpinion | I Was Arrested for Doing My Job as a Reporter. Who’s Next?  The New York TimesFederal prosecutors in Minnesota are cracking down on dissent  The EconomistDon Lemon says he offered to turn himself in but federal agents were sent for him anyway  cbsnews.comOpinion | Don Lemon and the First Amendment  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNM1NZQVFTZnJkMlQ5ZW5nUEJ0eUJMWUYxT0VaYTZQbFFyRS1oYTRTM0Z3ZWxhT0JqME9CMm5oRDJNaS1ySFIxNnA1b1dNZWdsdGFaUnd0eDdyVktXTVdhZ0pMV2x1S0lxb1Exd0g3bi1GR00xWl81VUlUdmxLQnFvblZST0Z5cVAwcU02RTlXX04zcjFncjFoR2RpbkEtV0hwOTJ0SFhxeGJ6M0RhamJN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "A Top Lawyer’s Fall Shows Growing Fallout From Epstein Files - The New York Times",
    "description": "A Top Lawyer’s Fall Shows Growing Fallout From Epstein Files  The New York TimesChairman of major US law firm steps down after Epstein files release  BBCChairman of major law firm resigns after Epstein emails become public  cnn.comTop lawyer, art world exec resign in more Epstein files fallout  MS NOWExclusive | A Revolt Inside Paul Weiss Over the Epstein Files Took Down Brad Karp  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 16:38:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQOW9lQ2JrU0pYckJKZ1lXNmh2Q0pGOE9zYWk5alNFLW9RT1R5QWtSZm04OE5QemVGMTBmdEx3a2xMcTA3Y2hWNFdjVkIwUEc5aWtaQklJRXpyQ1VHelZwd3dvVFEwdVNDcFZRNXZHYjI2dUlmbnpSYklxRkNBU0MyaUYwT2kwWndu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "L.A. mayor’s race is in major flux, days before deadline - latimes.com",
    "description": "L.A. mayor’s race is in major flux, days before deadline  latimes.comAustin Beutner drops out of L.A. mayor’s race, citing daughter’s death  latimes.comAustin Beutner drops out of Los Angeles mayor race  ABC7 Los AngelesL.A. mayoral candidate Austin Beutner exits race after daughter’s death  KTLATop Challenger In LA Mayors Race Drops Out After Daughters Mysterious Death  Patch",
    "published date": "Fri, 06 Feb 2026 00:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQeVJzOEstbFlEUzItbUpocUM4S2NYOFZYU2dGZ3BzMEVLRElWTUJxSTJQNHBHZEptSFByaFVKOG5DcEwyLTlScEFzT1ltN1NVazNzN3pfRldHVl9XSjB1U2M3SGxoa1Z5dmxHSGY2dFFaalhDaHJEeS15VWdrNGRUVkNab3Yyenp4QmF4eEZwNVJjTmZlZWZMSlh4b0hCUXdkc1FDeGFQaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show - The New York Times",
    "description": "The Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesHistoric win for Doberman Penny, handler Andy Linton at Westminster Dog Show  Scripps NewsSee adorable photos of dogs from 2026 Westminster Kennel Club Dog Show  USA TodayDoberman pinscher led by Clark County dog handler takes best in show at Westminster Dog Show  Oregon Public Broadcasting - OPBFort Wayne Yorkshire terrier wins Best of Breed at Westminster Dog Show  WANE 15",
    "published date": "Wed, 04 Feb 2026 17:37:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOdGdOV3EyZWtzVndlek84NmR1ajZPWHFhODlkVVpVaDRaNk15aGFKanAydEJwRTg0bE9rUkpqNDFBcmdjQXhoNjlfOUctRG9kR3RtT3JqYVdTN1NVSUJiNjJNZUJyajA4NTk3QXYwS2M2OXU5bmZMd3o4ZVRoaXMyVmxHSWlqZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "2026 Critical Minerals Ministerial - U.S. Department of State (.gov)",
    "description": "2026 Critical Minerals Ministerial  U.S. Department of State (.gov)What is the US critical minerals stockpile?  Al JazeeraSecretary of State Marco Rubio at a Press Availability  U.S. Department of State (.gov)U.S. Enlists Mexico, EU and Japan in Its Minerals Race With China  The Wall Street JournalThe U.S. calls for trade bloc to counter China's leverage in critical minerals  CNBC",
    "published date": "Thu, 05 Feb 2026 01:57:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOQ1JXcHNUZHpPQUh3YkNLanJtNVROWHoxV0NPXzcxN19oVUJpLVFNOWRDa3dwNG1rZ2dZMVZxVnk3Q0lqQ3pXYnVfMGo4X1lfSjRISFdVN3FLZVBKLWFYY3JNZmVwZUxFVDR5WEpVRk0yVzYzemh3SkZ3Ml9MMU9UQ2N5OTZpQURlWFVJVEZaaWVzcjh6TlJyRDFaMF8wb2M5bWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.state.gov",
      "title": "U.S. Department of State (.gov)"
    }
  },
  {
    "title": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s - OregonLive.com",
    "description": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s  OregonLive.comWanted suspect shot, killed by police during warrant search at Pearl District apartments  KATUPortland police shoot and kill suspect during standoff at Pearl District apartment  KGW‘I was freaking out’: Neighbors react to ‘utter chaos’ of officer-involved shooting at Portland apartment  KOIN.comPortland police say man killed by officers wrote threats against Trump on bullets  KPTV",
    "published date": "Thu, 05 Feb 2026 22:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPdzlFSG4wLWduWE0xNzBVdjZkdXZmS2RSb2VydXA1RE1Uczh0dmhzTnFoVXBZRzU4MzJxelJsQ2ZCUndUQ21pb1hTdTVvR2RHNkdYcVl2RzlQMEdOWnNTY25zdm1vcmptc01mX1hDbXk0b05lQ2NLMjhrNGFsemstSUdBTnl3aHpvSDk1V2JIYlkzMmp5MHRCZi1uaVB2N0xaWW9LLU5KNzcweW1BVFdVQ0prU2pJbTh0SFo0X1FoXzE0UmRtRHp1cDhqUjVMOWItRzNSRnVFc3FZalNwOFRoRGRWM1JFckpOVERiTdIBgAJBVV95cUxQb0VBbWVHVGUzUHV6alF5eXhRbDRITG03c1VDMVhtbksyRzhYak8tLWFUUXM5Z1NoZ3hoU3lvczhodEY1ZWUwOENYYzJxaWpNRi1lOHd2al9va0tTTl9zOWxpdUpxWkhxU0RIdENXaFlReVNmV21hMnlCSXRzLU9qOG1PcVZwM3JpX3phNHE0bWtwNVh0eTRBS0FWa0ItM2ZxQnNuZ1pfMWhhUFM4LXlkdFJjSFNDS3BIeGZyN1BjTmQtaFNBTFNEMDdtN0ZmU016QjdfLTJBT2Q0akplNTFMQ1BkZmZnZVpoeHU3Z295TFM3Rlo0VV9oQ1pjUGVuSFV6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "DHS’ problems go farther than Minneapolis. Republicans are noticing. - Politico",
    "description": "DHS’ problems go farther than Minneapolis. Republicans are noticing.  PoliticoNew national poll shows most Americans want Kristi Noem out at DHS  MS NOW6 in 10 say Trump administration hasn’t given honest account of Pretti shooting: Survey  The HillPoll reveals eroding trust in immigration enforcement in Minnesota  NewsNationUS House Democrats call for Kristi Noem’s firing in rally outside ICE headquarters  News From The States",
    "published date": "Thu, 05 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQYU9iMk5jSGk4aURQWmhzQWxQMlBxOTFTbW1yOHhZdjNJakdleVFGUUdaLWhDVWpRWS1Ndzc0VGdoU3NkZk9ZSWtxUlc2M3BMRjNHdmt0SklOZDZiMmIySmxtbm1ZQjNyaFJyMHZGakRMcXlRYkNtcHJjdHBjbmxlWG83SFNLQndLX3hxcEg1RXkxLUMxZjlWSTNCekhXU0pkYXZaZldjVU9LdDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal - ABC News",
    "description": "ICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsOpinion | Calls to ‘defund ICE’ are horrifying  The Washington PostTrump’s deportation push is scrambling New York’s suburban politics  PoliticoPoll: Nearly two-thirds of Americans say ICE has gone too far in immigration crackdown  PBSSupport for immigration rises, Trump approval rebounds, Iran, the Super Bowl, and the Olympics: January 30 - February 2, 2026 Economist/YouGov Poll  YouGov",
    "published date": "Wed, 04 Feb 2026 22:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWlhVUnpBRVVkTE9pNTdMdlpxTlBob0puN2wxQ0RRcU42WWVobGt2M2drclB6OVJyR05QV3BKNXNrdUUyZjdEWi1mVE5rOWhkLUg3aTZ3T2pheGdNRFNDTEJMb3RZODBxcEtZUVBrYXZ0NEgyb2ZGeHl2bkZvNFNoU1ZfSzFEZ0ZMdVhib0tXbVpWT3VhVTJqVDJERjgzWllUYThR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Attorney General Ken Paxton Sues the Muslim Brotherhood and CAIR to Stop the Terrorist Groups from Operating in Texas - Office of the Attorney General (.gov)",
    "description": "Attorney General Ken Paxton Sues the Muslim Brotherhood and CAIR to Stop the Terrorist Groups from Operating in Texas  Office of the Attorney General (.gov)Attorney General Ken Paxton asks judge to shut down Muslim advocacy group CAIR  The Texas TribuneAG Ken Paxton files lawsuit to stop CAIR from operating in Texas; CAIR calls it an \"anti-Muslim publicity stunt\"  cbsnews.comAG Paxton sues Council on American-Islamic Relations chapters, seeks ban in Texas  KVUECiting 'radical Islamic terrorists,' Ken Paxton sues to shut down CAIR-Texas  Houston Chronicle",
    "published date": "Thu, 05 Feb 2026 15:47:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxPUHJxN2FxYnhsb3VGb3AyVnctS3phY2Jzd3hzTnZva2I2UDRZZW15TXhCaUFxMFBxZDlpMWZUcXZuNzdCX1Y0bXhoYlFwSk95c1JLTlRfRmJKdjU5MlhfcDlWVUJJWW5zTE5hZjdKd0paRTZlQ1p5S3VtTXZnRGp5bnQxSUo4d2F3Y1lTYmNpT0xSbFRrNTBiaTRLUHE1Vnc5bmJLemVVYk83N0tKbEVpcUlNWHQ4dHg0OXBXT0xfTThPR1BUbDJyOUVfeTRDNGR2QTJVSmZYdmJVa0tTWHAyNVA4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texasattorneygeneral.gov",
      "title": "Office of the Attorney General (.gov)"
    }
  },
  {
    "title": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos - MPR News",
    "description": "DHS has requested expedited deportation proceedings against family of Liam Conejo Ramos  MPR NewsU.S. Seeks to Expedite Deportation of 5-Year-Old Liam Conejo Ramos  The New York TimesA judge stands up to Trump, delivers a win for the rule of law  The HillFather says 5-year-old son has nightmares and wakes up crying since immigration detention  NBC News'Going home': Liam Conejo Ramos, 5, and father arrive in Minneapolis after release from detention center  ABC News",
    "published date": "Fri, 06 Feb 2026 02:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQSUM1S2QySXY1cjRFdFdxSUNfczdQbTRaUzdYZFp2NEFyc1pSU21RSHVTVmFTZWpkMGN4eUl1eXBydVplb0hyWHJGbnF4Y2FXN3cwSDBGTEh2cWlkN3JzVEJ3bkhkSlNQN3JnWUFzUkJFQTVsenhVOHlfakZWbUxWSWl2MExOYUtnTEFTaGJ1bVc2X0FxMUhJQmhTTEs3dlI4MEtWdzE5UGxKVWNsaFUyekNpVjVxYk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says - The Chronicle of Higher Education",
    "description": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says  The Chronicle of Higher EducationTenure Eliminated at Oklahoma Colleges  Inside Higher EdOklahoma governor launches accelerated degree study to boost jobs, cut costs  News 9Oklahoma Gov. Kevin Stitt unveils plans for faster degrees and university oversight  KOCOStitt orders higher ed to create plan to tie funding to performance  The Oklahoman",
    "published date": "Fri, 06 Feb 2026 01:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQb0dZRFdMWHNRZGE2ZTE3VTFxdy14azBSQTBfWlhITWUyQXR6YXZKVkRCNDJGSm5HTkprTDJBQXlkazUwbnJIZVEwa3hZVnFILUNfcTdPRHlERnJKZDlCclpmVHZxak1Ia2ZEVkFMQVlNem5XakViR0dESUpLNUFaZloySmFvZWNSQlhvbXdteXg4ZmMwcWNISTZFN0dTb29tSmRYZWJ2S2VSRzhYTHg0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chronicle.com",
      "title": "The Chronicle of Higher Education"
    }
  },
  {
    "title": "Can Dems finally win statewide in Texas? - The Argument | Jerusalem Demsas",
    "description": "Can Dems finally win statewide in Texas?  The Argument | Jerusalem DemsasTexas special election emboldens Democrats heading into federal midterms  The Washington PostTexas Democrat who flipped reliably red district says people are 'tired of campaigns of outrage'  ABC NewsRepublicans are freaking out about Hispanic voters after a Texas upset  PoliticoHow Democrats flipped a ruby red Senate seat in North Texas  The Texas Tribune",
    "published date": "Thu, 05 Feb 2026 20:23:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1KOW1lYW5PUUNfN1FhZFd2cWcweHBkYXZ3UU1uaFZGYjAtb28weUVTazU2cm0zaDVqYmpZd3l5WElvTU5MQkNkZ3ZJNEo3alpRZkxYZTJDXzR0ZHlremZndXBoNmFLZFBoNnNLbmthZFdCN2Nl?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theargumentmag.com",
      "title": "The Argument | Jerusalem Demsas"
    }
  },
  {
    "title": "Governor Newsom on Republicans losing challenge to new Congressional maps at U.S. Supreme Court - California State Portal | CA.gov",
    "description": "Governor Newsom on Republicans losing challenge to new Congressional maps at U.S. Supreme Court  California State Portal | CA.govSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court lets California use new Democrat-friendly congressional map  cnn.comSupreme Court declines to block California's new mid-decade congressional map  ABC NewsSupreme Court allows new California congressional districts that favor Democrats  AP News",
    "published date": "Wed, 04 Feb 2026 19:50:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPaUV1WUlzVldBX292YmpRU2YzOFBJNHF6aDJUVUJyWktFTWdPQVJlRlFhSU1HNjRzakMzeFRDLTB6WnkyaHJWcVF4N1BrczAtX0k3WmpPMTZwRml4LWVKMmFkWEg0X240bHpiZmFuZW1LRUh2bERtNXlhclBta1BSLU1FbGhGRXRtejVta245T01xRFNKeFJQb08zcHpHa1hlcGxGV05mYng4bmxNckV4ZEpCckFBcmV5azltWkdHTEN6dXQ1TlVEWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gov.ca.gov",
      "title": "California State Portal | CA.gov"
    }
  },
  {
    "title": "House Democrats pass sweeping gun control package over GOP objections - Virginia Mercury",
    "description": "House Democrats pass sweeping gun control package over GOP objections  Virginia MercuryVirginia gun bills move forward amid sharp debate  WSETVirginia House Democrats pass new gun laws, but not all Democrats voted for them  WVTFSenate panel approves 11% tax on manufacturers of firearms, ammunitions  Richmond Times-DispatchHouse of Delegates passes gun-reform laws  CBS 19 News",
    "published date": "Thu, 05 Feb 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQRHJ1RDZsVGRSeXZuV2c5NXBHb3BDRTFrN2kxMWkwSjJiY2tGdEJtTGVPeXNfeDdqRkdGTkxnU180YUVYUERacWJLY2tVNkpWT0xSYlNNdGR0UVQ5bmdUQjhrMEZlN09IeGNzUkdrazRtVkJsdEVfeXpYWmhQcmNFWWxZajFub0ljUWFJM1dNOUxfdWJFVG9LZFg0UkdiZ1hJMEdDd3RQcDlXYjR4ZVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://virginiamercury.com",
      "title": "Virginia Mercury"
    }
  },
  {
    "title": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways - KQED",
    "description": "California Governor Candidates Held Their First Televised Debate. Here Are Our Takeaways  KQEDTax billionaires, cut rents and other takeaways from California’s first gubernatorial debate  latimes.comSteve Hilton blasts GOP rival Bianco for taking a knee during BLM riots at CA gov debate  New York PostCalifornia Dems lash out at ICE during gubernatorial debate  foxnews.comDem CA governor candidates seek daylight during first debate  Sacramento Bee",
    "published date": "Wed, 04 Feb 2026 20:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS1pHemlEX3NOaVc3RkNHbzNNTjh2UlByd3Q5N2lxQ0lMZVdJQ2ZVQ1FYLVVhTk54Q0pFU2lzd1A2cXJkaUZwS05QRzl5N2wyQ3o2SVBVaXVaSE9QMERmMHYtV1VYU1JENVJWNDduV1ZVajhqM0p2RzRiWEF4dFczaVNMcGFDYjhfSG5MbGdQTEprWFJQajBwVGFXM25pN1c3VnVfWmU0NDFobkItUmt0N1J6eFUyZlJoY0dN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Top Trump Goon Hearing Descends Into Wild Shouting Match - The Daily Beast",
    "description": "Top Trump Goon Hearing Descends Into Wild Shouting Match  The Daily BeastUS Treasury's Bessent says he was wrong when he said tariffs could be inflationary  ReutersTop fiery moments as Democrats clash with Treasury Secretary Bessent in chaotic Hill hearings  foxnews.com'Can you shut him up?\" - Democrat and treasury secretary clash over Trump's agenda  BBC'Can you shut him up?' House Democrats clash with Bessent in fiery hearing  ABC News",
    "published date": "Thu, 05 Feb 2026 07:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQcEtXM0tQRUJpM3otR0NIR09aMnVYaFBHNXE0ajdXZE1lTl9tMzNITjBHeDlMY0I4WDZwZDFSWW1zS2sydVJsR25FX0JNQmlEb1R3d1BlRnBJdWJmMU1lLW1ZMHpTenZEZDNwQkhRdGptSTVaSlBfd1BxSXFvYmhtbmZMYXo1aUtwSWE3TUtDYlY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Study ties particle pollution from wildfire smoke to 24,100 US deaths per year - AP News",
    "description": "Study ties particle pollution from wildfire smoke to 24,100 US deaths per year  AP NewsWildfire smoke kills more than 24,000 Americans a year: study  Space DailyE&E News: Wildfire air pollution linked to more than 24,000 annual deaths  POLITICO ProWildfire smoke raises air quality and health concerns across Northeast Florida  Action News JaxOur Smokey Summers Are Harming Us More Than Previously Thought  Duluth Country Radio",
    "published date": "Wed, 04 Feb 2026 20:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPQXFZSEE4MHhaRDJwS0FoQzV0MXNYdnRZMUdkVHIwTGg0UTFqMG53ZVg3M0hmWnZQa3c0WERGSUN4blRQTVQ2c2dYSWdhUzJnQ2IyNEZiMFU2b2xyWThiOG95VmQ5QjBMTDJ3MFBUV1NQbW9HTmU1SXUwOWhiekNIVDRaVlJmQ1MtQ1JwVDNxazRlZThGeWMzMzk3Q1ZCQkpJUWcyRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "House rejects D.C. tax changes, potentially costing the city $600M in revenue - The Washington Post",
    "description": "House rejects D.C. tax changes, potentially costing the city $600M in revenue  The Washington PostHouse passes measure to force DC’s hand on tax cuts  PoliticoHouse approves bill to prevent DC from opting out of Trump tax cuts  WTOPU.S. House votes to overturn part of D.C. tax code  NBC4 WashingtonRepublican bill targeting D.C. could create tax season chaos  The 51st",
    "published date": "Thu, 05 Feb 2026 07:19:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBXbHBBYmJFdTgyWDd0Y3pDWkpHSExpNW5hT0ljdHZzM3ZVVHNLZnhMM0tLRlo5Z1RuNS1WQjJGazlIeVhkM2V3YjdBWExrdzhYVUZWRGVjQjYyWGpwek1TME1vZlhWTl9yeDd3Zk80c1JwZEN1alptUFdGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Federal judge blocks immigration agents from making warrantless arrests in Oregon - Oregon Capital Chronicle",
    "description": "Federal judge blocks immigration agents from making warrantless arrests in Oregon  Oregon Capital ChronicleOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianCongress must hold the line: ICE cannot be allowed to break into our homes  The HillLawsuit challenges ICE ability to enter homes without warrants from US judges  Reuters",
    "published date": "Thu, 05 Feb 2026 17:00:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPX1d2SXVFSXdxb2lkMnprU0VuajFxRGNnMUM4Tl9uRzRiQW1tYmo2Q010Nmkycmk5Wlo4TkVEQ1BfdE8zTV9tUkZoMnZOMEF6c2NndUdUMFZTQjVuM0d4RkhxbGJ3aXc2UXVoYTBSQkhxTHl5bHRTQTFQNGh2ajc1TnBnanBGQ2p3R3FMd2RBT01NSzRId3djY1VYbG16UWdwcG84VTQtSWV2MXRmZUxfcTl4aVFsWjE4bkFnd3BCREVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oregoncapitalchronicle.com",
      "title": "Oregon Capital Chronicle"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasSuspected biolab discovered in Las Vegas home sparks federal investigation  cnn.comFBI, Metro Police find more than 1,000 samples at alleged illegal bio lab. Here's what we know so far  ktnv.comBio lab found in Las Vegas is similar to scene discovered in California, raising questions from officials  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "2nd teen identified in Rainier Beach double homicide; $5K reward offered for leads - KOMO",
    "description": "2nd teen identified in Rainier Beach double homicide; $5K reward offered for leads  KOMO'Mourn today, act tomorrow.' New Seattle Schools superintendent emphasizes safety following fatal shooting near South Shore  KUOWTeens identified in Rainier Beach shooting as SPD extends police presence in neighborhood  KOMOVictims of Seattle shooting near Rainier Beach HS identified  FOX 13 SeattleSecond student killed in Rainier Valley shooting identified  The Seattle Times",
    "published date": "Thu, 05 Feb 2026 00:38:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxOUXh3WjY5eFM3YnlNSTFrTF9UT0hSZkF0S2h6Tm02cWtOaHpaRFIyWjF3c3REeVYwUFJBekFSRGl2TWNac0hZblRpcDN5VXRiNDdvOVVxcS1pM3cwVW9WY2t3MldXY2ZMMkg5N3UyMnhWaGJnV0JQSU5DaU9neWZHQVFOazF6MFV0aHlkbERXeGhpbG5JMGkyZGhFdFg2VXRESEFGdHRZNkxUZ2JSQW44VU5KdGhBMVFYZW45TFVkMEJROE82NVJ3aDI3RHFmLUdLYUVYYWU1QWxvcFVkY1BacTFNWFZzYW1wb2JDTWFXdUFHQTgzM3V1Qi13NlhsTzVuZHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’ - The Times of Israel",
    "description": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  cnn.comAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsDonald Trump wants to end America’s half-century conflict with Iran  The EconomistU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street Journal",
    "published date": "Wed, 04 Feb 2026 23:21:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQUG5BTGhYMGZlT0tmV0h6TDYwTV9sTmRncmhPNnQ2dnRjSHR4djZoVkh2YVFkRy1kaWNZYUhzb09HcUZwNWIwMVIzc0lZTVdHOFdBaVBQakxOLWRPemp3LXp3SHVyN1RuZnl0ZVFDNEY1ajAwZ3JaOU91UGpWUDdTTl9wX0p2R1NwWldoX3FZZjdXZ1kwYWlNa04zWldxTTVMODRuTGdfQzBhRU5w0gGyAUFVX3lxTFBESjFieHBPN1NQbDktUm1GdDBXNE9zSW5Ua0dNSlNLbDAzNTNLZXpXNG9ubzRUQ3R4cVF5ODhNSE9CZHZiZzZkeXFFNGdlWWpLR3pCME1XcHZvNk0xZzRhMWIxTzdoRnpvWWg5RFFmMkRvWjY2SktLbHhtdGx3MFIzZ3RkYW9FaHBXR1hRRkhqNnc5SEs1bngtX21VWXU4VUhNYUdUOE9pcjFjZ2ozZkxBd2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers - HuffPost",
    "description": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers  HuffPostHow Trump's $10 billion suit against his own government could go sideways  NBC NewsTrump’s $10 billion lawsuit against the IRS raises conflict of interest concerns  AP NewsTrump shares his plan for the $10 billion he expects to receive from his IRS lawsuit  MS NOWTax Deadline May Be Pushed Back, Bessent Says. No Word From Trump’s Team on His $10B IRS Lawsuit.  Barron's",
    "published date": "Thu, 05 Feb 2026 05:21:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZXh3OFpsdm5GYXEtTUJaVVVQTW5rc2lCdDFpNWV4ZUpyZVpRdU1ZNGxpQTNhVUVCUWZnRFRZWi1hTFVDMmV6WFg2U0VueHdBQ2loY2pLcjZETjlNSjdSb0huNGpNekVyajFLaXBET0gxejdqbjhiNkNZM1VlaDA0S2pqeXpHZ9IBiwFBVV95cUxPRkJtUUFGODV2VkZDTkllSjB3MVItRkdpVWdwNm9RcndaRnBWQzJjUkJiRE1Cam5NcU9sTlVvSU54N1pXSU0xTmdsWkQ1OUVObE0wZGphQk1kcjhoR2Z1ZlE2MFd2YzVYa3JiM01ScDU1UFVaVm5adlBoMC1QVHV4UGxudlN1T2RGbG9Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Property rumored for ICE facility in Social Circle moving forward, has potential opening date - 11Alive.com",
    "description": "Property rumored for ICE facility in Social Circle moving forward, has potential opening date  11Alive.comSocial Circle ICE detention center could be operational by April, despite city leaders' opposition  cbsnews.comWarehouse in process of being sold to DHS, Collins tells Social Circle  The Covington NewsRep. Collins issues statement regarding proposed ICE detention site in Social Circle  AccessWDUNPlanned ICE facility near Atlanta closer to becoming reality; could open by spring  FOX 5 Atlanta",
    "published date": "Thu, 05 Feb 2026 00:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxOcTVmOWFIYzFJNjl4VFFzdVpjeUJTVEpnVngtTGpfd3dERl9lYlBtb3dZQWw5V21mQ3NVUUlUQmJrRjhkaDVBYTkyQVc2QTVzbEVGOUQwM0NEZHZFcTJhSkhjSDYtNDBkVGw4d00xUEoyazhQRWRtbnNGeml5NExKY0UyVjBsampRamFiX1J3eVVpUFJUOGx0T3NYUDNMUXFhaC1Ga3FBelNNamdhcXRVc1ZtTTVtMzd4M29IaF9sQVNRdVhOY3EtNHR2MjBzREtUemZvb1VLMFkxVzdvRVk3MEJwbUFxRW9JOTU5WFB4dHJoblZITHAzNF9DaTZhbUZBQ0ktai14Q1FmYWhGaFBkeWNDblZ5QXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.11alive.com",
      "title": "11Alive.com"
    }
  },
  {
    "title": "Parents of Evergreen High School shooter won't face charges, sheriff's office says - 9News",
    "description": "Parents of Evergreen High School shooter won't face charges, sheriff's office says  9NewsEvergreen High School Shooting Investigation Complete  Jefferson County‘I feel like we got a slap in the face’: Parents upset with Evergreen HS shooting investigation  kdvr.comParents of Evergreen High School shooter will not be charged  Colorado Public RadioParents of Colorado school shooter won't face gun charges, sheriff's office says  ABC News",
    "published date": "Wed, 04 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxPM3pJSXhsVkdnNG1ySHdtV0l5ay1adlRhNUFnRElPVk5NVjI4TUJub0RBb1RLSHpWcDlWTnNaWXRvOEd1TzJfUnpFOEllTWpqMnIxeC1UQUI0M1N1OE5kazFsajQ0ZXdMWFFpTE90ZmItb2xIQjdBZ0lfT21iYTJNWndVQ1dnVGUtSkFpclVVSnZRajVseVIzbjk0ekNUYUhBQl9CZGFoYzBCelI5UHhFckZ0eXNTdjNSWWtfZG9aVGlqRTNqbkFjbU1BV25VdUstQ19aanU3ZUZoMjZFQWdCNHEzVmFFOXdMMm5xNUFrbGxnVzBMQjdxTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.9news.com",
      "title": "9News"
    }
  },
  {
    "title": "Arrest made in ‘horrific’ execution-style murder during bar robbery - The Independent",
    "description": "Arrest made in ‘horrific’ execution-style murder during bar robbery  The IndependentSuspect in Momence murder has criminal history spanning decades, court records show  WGN-TVCourtney M. Drysdale Obituary - Visitation & Funeral Information  jensenmemorialchapel.comMan Accused of Killing Ill. Mom 'Execution-Style' After Allegedly Demanding Cash From Her Bar  People.comMan arrested in fatal shooting of Illinois bar owner  ABC News",
    "published date": "Wed, 04 Feb 2026 18:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOVWg1MTlHdVZpRmZvejkzRFVjNnc0cHVscGpXcXJ2TXdYTzRkSVVxZGo5RkVacWxkbTMxeGlsNllrbzlXVEVIYjVtRU4wRDVNbjRoRGNVZDZoUXoxUjUwOFJBaG56WlU4ZkdYdE92dnFJbmZ6ZW5lZXlTdzVGUGpZRXZBUTRDek9RX0VDNWZ4bjktbjkwdUhtUHNhejk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.independent.co.uk",
      "title": "The Independent"
    }
  },
  {
    "title": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university - The Independent",
    "description": "Texas A&M educator fired after secret recording of her gender lesson leaked sues university  The IndependentFired professor says Texas A&M ‘ran roughshod’ over her rights in new lawsuit  KXAN AustinTexas A&M professor files suit after firing over gender identity lesson  PoliticoTexas A&M Lecturer Who Was Fired Over Gender Lesson Sues University  The New York TimesAn Instructor Was Fired After a Viral Recording of a Gender Lesson. Now She’s Suing the University.  The Chronicle of Higher Education",
    "published date": "Wed, 04 Feb 2026 21:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMDM1bU1zSkNTTkdKc08ydzZsMWNZYU11emFFUGtoU3pXOVBkay1qalNpSzA5c3MweFFyNzM3alZHOEVoNzRzQnh5S3UybGZyRGtaRXgwZDdfN3ZUNFVOX3RwaU13NkZlbmJXNEpNdXhKU2xoZ1EtLXVVWlhZMEdVemFqSGhMeWM1NG1WMjlHQzFnbmN2YXV2TUE1cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.independent.co.uk",
      "title": "The Independent"
    }
  },
  {
    "title": "Federal lawyer tells judge ‘job sucks’ amid overload of immigration cases, court violations - Star Tribune",
    "description": "Federal lawyer tells judge ‘job sucks’ amid overload of immigration cases, court violations  Star TribuneTop Minnesota prosecutor says ICE cases are sidelining ‘pressing priorities’  PoliticoSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York Times'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC NewsFrustrations from judge, prosecutor in Minnesota boil over amid Trump's ICE surge: \"Not above the law\"  cbsnews.com",
    "published date": "Wed, 04 Feb 2026 18:22:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQVkVZUk5XVVRjNFNzcVEtb3pMa0hLVWhXcC1wRG5VLXFCMVpBYlJfYm1jX1VydVdlT0d6dTcyTFR0eXkyNkoyUF9GS3BYemU4bDdsS3pWYmhINFVIOXNRSlFYRk5UbURqdUJxMzZKc1dDa0dOY1VSVGdpeWJTcmhXNDN4V0toUTFsTXpuU0NfbWVsU25yaHJTNkZpeTRtNkVoMHZCVWhIVlRjclFhYnNBam5KSGhXUlVxVXRtRVFVTEM2RXhQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments - The Kyiv Independent",
    "description": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments  The Kyiv IndependentUS, Ukraine disagree on whether Russia following ceasefire  The HillZelenskiy: Ukraine awaits U.S. reaction to overnight Russian attacks  ReutersTrump: Putin kept his word on pausing bombing Ukraine  politico.euThe Failed Energy Truce Shows Why a Quick Peace in Ukraine Would Not Last  The Moscow Times",
    "published date": "Wed, 04 Feb 2026 19:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaEd3RG9JSzV6YTZTcXUtM19WTjJqTkxuNVBLdXVqT290UG9CTXVsdDBCMmx0WTl6cFFkd25wWFBwRmZlQ0RMOWRIeUxsc0l6Yy1XU1ZVOWRiZTluTUNsYUJXZUt5aExLdk5CVHQ4ZF9jQVZncC1fNXo1NE1PcUVrRDBKZjFRZ0hmR1NHQWVRV24tb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Mom shares warning after 9-year-old son suffers burns after microwaving toy - ABC News",
    "description": "Mom shares warning after 9-year-old son suffers burns after microwaving toy  ABC NewsTikTok trend leaves 9-year-old boy with severe burns from microwaved ‘NeeDoh’ toy  WGN-TVMother warns of TikTok trend involving Needoh cubes that left her 9-year-old son with severe burns  cbsnews.comTikTok trend Needoh cube: Plainfield boy, Caleb Grubb, burned after social media trend; Loyola Medicine shares urgent warning  ABC7 ChicagoBurn clinic warns about dangerous TikTok trend leaving kids with severe burns  WHIO TV",
    "published date": "Wed, 04 Feb 2026 23:26:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPR3p3ME00Wk1hcEMydkNrSVdUWG9TTXh3SlNmWlQ2QnJibDBQQlp4QmIybDhSVGtIZXl1UEFGeVdrbnE3cG82RWFKemtjNl9fcFFUaFlfamZfcGxqMDRWSUJpbW9XV3ZENlJUWFNWMnNMV2tmaHBPd3ZQMmRxSmV5VkliRlRCZEgyTUp2cy10X0dVdkxZLWZkbkJGWm7SAaIBQVVfeXFMTU9CZ1c5bXNUbF83dGpGaXNNVER2SXBMUnpNYzhXOUc1NHBUbFVHYTNyaThOaTliS0QxMDladEhIZ3pmZFBIWWVVUlg1eWpmVFBqbExfOUpsTDhybWxWTklnSGtLQUV5RDM5SGZ1UHd6MV9sQUt6aklRRURTLWRrS0FjVDNITjUxZjBVUmJTWGlEdklUMUQ1RzBqMGJMR0Z2blFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets - The White House (.gov)",
    "description": "New Milestone in Operation Metro Surge: 4,000+ Criminal Illegals Removed from Minnesota Streets  The White House (.gov)Minnesota Democrats Protected This Violent Illegal Alien. The Trump Administration Is Deporting Him.  The White House (.gov)Chief public defender outraged by immigration detainments inside Hennepin County courthouse  Star TribuneHennepin County Attorney says ICE detained 2 people at government center  kare11.comWhite House cheers 4,000 arrests in Minnesota Operation Metro Surge as deportations loom  KOMO",
    "published date": "Wed, 04 Feb 2026 21:19:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOb0RaQTY5QnR0QWpBXzdpY2VHSENIUUFLWm40MW5kRWtWblAtMFlleDFfdkpiV2JRaXVUaXY1a0RlUG9KTTVobTE1NjVXaGpBNjBZRUpFV2tqb20wMkxIa2FKODNEMWM5QUotZDRRUnVCU1Z3VjNPR3V6ZDhYR1htdk9JOHZiS05DbTNSNllFdlBsa29MMnpxMXk1aDFDaWRkRDVZSVhnT3ZKY01ZUXJvUENJaG5RUHZuZVRwS2IxWVRKZEFOV25KbDVLYzNUWnltOG1N?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Zohran Mamdani names NY Jewish Agenda leader as antisemitism czar - The Jerusalem Post",
    "description": "Zohran Mamdani names NY Jewish Agenda leader as antisemitism czar  The Jerusalem PostMamdani Chooses a Liberal Jewish Leader to Run Antisemitism Office  The New York TimesNYC Mayor Mamdani picks Phylisa Wisdom to lead Office to Combat Antisemitism  cbsnews.comEXCLUSIVE: Moshe Davis on His Ouster by Mamdani  The Free PressMamdani names new antisemitism czar — and she's already facing ire of Orthodox Jewish community  New York Post",
    "published date": "Thu, 05 Feb 2026 01:04:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE0ybWtUZWcwbk1PbTZMTU0tVG5nR2dYbEhBRDhMOUwxWElSTmFTUF9keE5sUHE4c1g2R0pHVVhVcmYxMlRmUGUwVTZRYXJ4ZU80Rm9QczA1Z1JEUDhBSnlGQk51dUxwN0NIcXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Lee Hamilton, foreign policy leader in Congress, dies at 94 - The Washington Post",
    "description": "Lee Hamilton, foreign policy leader in Congress, dies at 94  The Washington PostWhy are flags at half-staff today? Indiana Gov. orders them lowered  IndyStarLee H. Hamilton, Congressman Who Helped Lead a 9/11 Inquiry, Dies at 94  The New York TimesFormer Rep. Lee Hamilton of Indiana, congressional overseer of U.S. foreign affairs, has died  NBC NewsSouthern Indiana leaders remember Congressman Lee Hamilton  wlky.com",
    "published date": "Thu, 05 Feb 2026 04:11:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNcjZna0c0Q3dvLWhPSnd2ekVYRVJvZC1RWUg1ajh1NUtvcHJiV0toNmYzWE56bFB4YngwdG8xeVd5VmxxMU1YczhsVmdRNWpwRjlvVE9SZERJN2xuY25jQjVWazJiUmtrT3FUZGtVZ0czV0xGQ1hiZDVGc2QyUW83QkJBS2NIbmtjQ29aVEI0YWJRWVFoQ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Catalina's Mule Deer Aren't Long for This World - Newser",
    "description": "Catalina's Mule Deer Aren't Long for This World  NewserThousands of mule deer will be killed on Catalina Island as part of restoration plan  LAistAll of Catalina’s deer will be killed to restore the island’s ecosystem  latimes.comCalifornia officials move forward with plans to exterminate mule deer from island  The GuardianCatalina Island's private landowner moves forward on killing all its deer  SFGATE",
    "published date": "Thu, 05 Feb 2026 00:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPeW1JTjZuUGhCYllyWmdVYkRZU2owRnJyX0lDRmMxQ3hWZ2gybjV2enlNbEtmc1Q0SmxmZm1aRElZbFZINWYtMURZZlJGa0tCNU1HbG5KZy1vWEhZeTctZ1FaWUM0UnBFem40b0tLSFlwdWFoT3JPanJSTUdDY1hSejQtd1JEMzN5VjJ6NERaYUZXX3NNa0x3R2lYYUhXUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Asked If He'll Apologize to Alex Pretti's Family, JD Vance Scoffs 'For What?' - Common Dreams",
    "description": "Asked If He'll Apologize to Alex Pretti's Family, JD Vance Scoffs 'For What?'  Common Dreams'For what?' Vance refuses to apologize for Alex Pretti claims  USA Today“For what?”: JD Vance stumped on why Alex Pretti’s family might deserve an apology  MS NOWThe Recap: ‘Border czar’ says ICE is doing A-OK, and JD Vance ups the ugliness  Daily Kos'A vile human being': Don Lemon calls out JD Vance, says he's foregone his humanity for Trump  We Got This Covered",
    "published date": "Wed, 04 Feb 2026 21:33:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1lSk5yZzJ0bFc3VFdSSHpwMlpkcVRSQV9Zd3loUUZoTzUzWjBZSjlUS2Y5dmVNcTFjMnpaTDhibWN4RDVseWpvX2lBWHNrY0NyRzMzcTVHM0FsY3VHVXZVc2hIbnl5NFJYaUw0Nkpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.commondreams.org",
      "title": "Common Dreams"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoWhite House ‘can’t guarantee’ ICE won’t send agents to midterm voting sites  The IndependentSteve Bannon calls for immigration agents at polling sites during midterms  The GuardianBannon Calls for ICE to Engage in Voter Intimidation During the Midterms  TruthoutWhite House ‘can’t guarantee’ ICE won’t be at polls  Democracy Docket",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Republican Barry Loudermilk won’t seek reelection - Politico",
    "description": "Republican Barry Loudermilk won’t seek reelection  PoliticoGeorgia Republican Barry Loudermilk won’t seek reelection to US House  WABEU.S. Congressman Loudermilk will not seek re-election  AccessWDUNThursday’s Campaign Round-Up, 2.5.26: Loudermilk joins Congress’ retirement parade  MS NOWGOP Rep. Barry Loudermilk becomes 29th House Republican to not seek reelection  The Hill",
    "published date": "Wed, 04 Feb 2026 22:51:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQOHNtdnpQV2FJbzNTZ3hiMmhKS0RaaEdQWWxXVUtwZGpyLXVMZUZmdjBvNExac244X2lYMDBoakV3NW9sTExxSjBLN2ZrLWhIbUQ5YV9yWDluVGZiSDR3UWtMclI3dmtlcmlJUTB0aVFkeGJUMmo1d2traFJoTjI4TEdGMFNwWTFMQ2ZhVW9qWkdiVjNPckxtbDBCWlNxdEdQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Judge orders Musk to sit for deposition over DOGE, USAID shutdown - Axios",
    "description": "Judge orders Musk to sit for deposition over DOGE, USAID shutdown  AxiosElon Musk will have to sit for a deposition over what he did at DOGE, judge rules  Business InsiderElon Musk Can Be Questioned Under Oath in DOGE Case, Judge Rules  bloomberg.comElon Musk will be deposed along with DOGE staffers over USAID dismantling  The IndependentSam Altman's 'Elon Musk dream' may be coming true, here's how  The Times of India",
    "published date": "Thu, 05 Feb 2026 00:17:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFB3RkVyTkdJYU96XzA2R0xMWS1MYVZzSmlwY2tiWXVFT3RrYkQ0VV9ISUc4djc1MkZwS21xLV9SUUNpZW85QVQtaDJMZW52M1ZTZEM1eTVZY05fTWp1RkNzWlAxV0ZvS2pDMjFuS184TnA5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Great-granddaughter of Piedmont’s first Black residents, who were forced out by a ‘terror campaign,’ sues city - The Oaklandside",
    "description": "Great-granddaughter of Piedmont’s first Black residents, who were forced out by a ‘terror campaign,’ sues city  The OaklandsideBlack family sues over 1924 seizure of Piedmont home  KTVUDescendants of Piedmont’s first Black family sue city over racially motivated land seizure  Local News MattersFamily claims Bay Area city defrauded first Black homeowner  Courthouse NewsDescendants of Black Family Who Were Run Out of Piedmont in the 1920s Sue the City For Reparations  SFist",
    "published date": "Wed, 04 Feb 2026 17:57:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNZWlscm1POUJLZG5nMXhWSzFUbHlwMVBGTnp4RjNWTXcyWC1iMjRMRExHRklPZmNZMVIxcm1ucEstd3JIU283SlFNY2tQbEllTEtZZmxZUnRtT0hielNmakdreE5Ca3N3Rm1CUmdxeU9vUWcxZGdYajdFcFQ5NWE2a01VdXltTzZBMEh4UzNhZ0x5cTk0VHBEMnlUcFJ5Z1NsRW5TQzJTWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oaklandside.org",
      "title": "The Oaklandside"
    }
  },
  {
    "title": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost. - The New York Times",
    "description": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost.  The New York TimesTrump-style unpredictability isn’t just political theatre – it’s a regulatory problem for your brain  The ConversationTrump’s brain is 'deteriorating disproportionately' — and it’s getting worse: psychiatrist  AlterNetHow to cover Donald Trump’s failing mental health  LGBTQ NationTrumps Brain Sparks Debate Over Cognitive Aging and Health Information Marketing  accessnewswire.com",
    "published date": "Wed, 04 Feb 2026 23:36:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPYUxYZlgyc1h4cWM0SlZZTzhJcXJxSXQ2RTZwdTRYcHNobjlyOHZwa3pEVjh0STlwbzFvUGcwYl84RHNaWkFCNmM5RHpkWmZRSkgweE9LY3FsTXZGSmVVb2t4TUxtWVYyNWR3aEVDYmVVMWtSWXdsaGZqRlNKbUp3WTRablhHZVJfamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Hawaiʻi Sen. Michelle Kidani Says She’s Capable Of Handling Her Job - Honolulu Civil Beat",
    "description": "Hawaiʻi Sen. Michelle Kidani Says She’s Capable Of Handling Her Job  Honolulu Civil BeatState senators defend colleague after article questions her health  Hawaii News NowState Sen. Kidani issues statement following inquiry into her ability to serve  Maui Now‘I remain capable’: Sen. Michelle Kidani asserts her ability to serve amid health rumors  KHON2Legislator rebuffs report on health and retirement  Spectrum News",
    "published date": "Wed, 04 Feb 2026 22:19:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZ1BwV1JSV2hpQ3I0YlZUYkNzOHlRa1F0VkVEZ1g2Q0tEYzhEMWJRa1o4WGxUei10bGlITF9XU0VIS3VxS2tlejZRcnI0THJZRmRieW10d0lHZVhoeDZQT1JFQW13VWhOQmg3V25RN1owQmJKZ0EtWEJtLW5zT1NxOUx4aW9nTVFlSURzYVUwcGYwaEktRmM0aXln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.civilbeat.org",
      "title": "Honolulu Civil Beat"
    }
  },
  {
    "title": "Minnesota girl, 10, released from ICE custody after a month in detention - The Guardian",
    "description": "Minnesota girl, 10, released from ICE custody after a month in detention  The GuardianShe thought ICE agents were taking her to school. The 10-year-old ended up 1,200 miles away at a detention facility  cnn.comSchool officials say missing Minneapolis girl seen in ICE detention in Texas  The Washington PostHeadlines for February 05, 2026  Democracy Now!Feds releasing Elizabeth Zuna, 4th-grader who's from same school district as Liam Ramos, officials say  cbsnews.com",
    "published date": "Wed, 04 Feb 2026 21:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOZ2lBT0p1aHppSW5kSkZ2STBjOFBPYlU2cWlOTXloNWZnR0RUNW1zMnFOZE5uRnFWWW1ndjRmc3p2OWdhM0NFLWZOZHlJRjI5d2RjRUpMcl80aWNvYUFLQ09mWWdKbzRObnlNX3hFMlBrYVdtZXNibWlEczh3eERVbFlrWU1mMEMwcUJLcmdPblhiN2w5Qk9GU01R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  }
]