[
  {
    "title": "Powell says he has been threatened with criminal indictment over testimony - Honolulu Star-Advertiser",
    "description": "Powell says he has been threatened with criminal indictment over testimony  Honolulu Star-AdvertiserStatement from Federal Reserve Chair Jerome H. Powell  Federal Reserve Board (.gov)Pirro on Powell probe: ‘None of this would have happened if they had just responded to our outreach’  The HillRepublican Sen. Thom Tillis vows to block Trump's Fed nominees following Powell probe  CNBCTrump denies involvement in DOJ's Fed subpoenas: 'I don't know anything about it'  NBC News",
    "published date": "Mon, 12 Jan 2026 02:33:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOOUpsRF8xN3AyeEVxbWZHMVRjVTlSWUh6UHdmTUs2WnZxVi00QlQtMlpWd3pRRzlSY3dua2NXZ1hTQzk3NDJDRnVwNWEzQnVuTWY5dlJXLVltVTBxZldKZnZJUFhEb1llTVhrc3RfbGhRVVQyWUFjNENOdTh3YzZ5amJpLXBNTjRBTGhHQXJ5RFZvd19JbWhXVV9LczR1RFdMLTUyQmtXQ3JXVENGb19fMUYyNGdpVVZJVXBmdW5DYS1USEVyLU5JSC1YMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.staradvertiser.com",
      "title": "Honolulu Star-Advertiser"
    }
  },
  {
    "title": "Supreme Court to Consider West Virginia’s Trans Athlete Law. It Applies to One Girl. - The New York Times",
    "description": "Supreme Court to Consider West Virginia’s Trans Athlete Law. It Applies to One Girl.  The New York TimesSupreme Court to hear arguments in blockbuster cases challenging transgender sports bans  CNNSupreme Court’s Ruling on Trans Athletes Could Apply to 2 or Many  The New York TimesLive updates: Supreme Court to consider transgender athlete bans, Trump to speak on the economy  NBC NewsThe athletes, coaches, lawmakers and officials who have picked a side in the SCOTUS women's sports battle  Fox News",
    "published date": "Mon, 12 Jan 2026 14:59:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPREhadUo5R3ZKMXRDeGFkV2xuSU1MekVqN1RNRTdJNDJsMVZUek8zUmtLdjQ3TkFWMFl5R1llUTBZS1Rhek1TY1d4VGE4ZnByc242T2ZTZ05RZHg4a0NEaWI1X0ZuQkNVQjlaNTBvZVZweHQ3aDJFc0tabURrU2pWTzhSRWRLMXRoTlhOTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good - 5 EYEWITNESS NEWS",
    "description": "Video captures Minneapolis immigration arrest in a city on edge after shooting of Renee Good  5 EYEWITNESS NEWSMore federal agents to be sent to Minnesota, Trump administration says  BBCMinnesota sues over Trump's ICE enforcement. And, SCOTUS hears trans athlete cases  NPRICE Minneapolis shooting: Noem to deploy hundreds more federal agents to city  CNBCMinnesota and Illinois sue Trump administration over immigration crackdown – as it happened  The Guardian",
    "published date": "Sun, 11 Jan 2026 22:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNU3lSMW9Oa1RaWWxlTEtWMnY0SWRhMW5vQlphU2FkWGZaTXh4Ym94Y1hKZEVNRC1CdmdkcWp1RDFlUGR1QVVDQ1RnQ0RydURyWklZMkxYQjZtYVJrdEFpSkR1OHM2LWhjZTE1U3pCaHlLTlc2QW1lS19BUUhwS2tfQzREdk52ZGtrMXVsT1g1cFZyUWZWVW5WQnhPbnVBdV9TZjJEdFA0MHVISXpFaG8xTk9ydlhFOGxOR0p1WURsOWxya0lRTjhGd1lIZVk1TGVfV0xtcExvQ0dnT1lpcGlTMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kstp.com",
      "title": "5 EYEWITNESS NEWS"
    }
  },
  {
    "title": "Several monkeys loose in St. Louis and authorities have no clue how they got there - Dexerto",
    "description": "Several monkeys loose in St. Louis and authorities have no clue how they got there  DexertoMonkeys Are on the Loose in St. Louis, City Officials Say  The New York TimesMonkeys on the loose in St Louis after four-day search  BBCGoat on the run in St. Louis; multiple monkeys still as well  FOX 2Monkeys are roaming the streets of St. Louis and fake images are complicating efforts to find them  CBS News",
    "published date": "Sun, 11 Jan 2026 23:45:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOeTgtNERIVFdYRXh3QVdsNVN6MjhNdzNtQWg1MUsxR3ZFS054bmtWc1d4SVBSVjFNNXJhekM0MXhEV213M251bVZLUDIySzQ0OVl0bGtUbzcxd1dWMDlUeE9PVWx4VjhYOEd1SmNrTmFaS1IwZEFqQy1FODdwZ0FpTndMR1hJMVJNMmJMWjFGX3lSQVp4bmlRZ2gxRnByVTFtZmhpSk4xNHlPQVdPWk5yNWN2N2tpWl9RNU5DclBIV2dGTXhuejI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dexerto.com",
      "title": "Dexerto"
    }
  },
  {
    "title": "FBI: Mississippi arson suspect confessed to torching synagogue and targeting Jews - NPR",
    "description": "FBI: Mississippi arson suspect confessed to torching synagogue and targeting Jews  NPRFBI: Arson suspect admitted to starting fire at Mississippi’s largest synagogue ‘due to building’s Jewish ties’  CNNMississippi synagogue arson suspect's dad turns him in after laughing confession, FBI says  Fox NewsArson Investigation At Beth Israel Congregation In Jackson, Mississippi  Office of Governor Tate Reeves (.gov)Once Again, Oldest Mississippi Synagogue Is Attacked With Fire  The New York Times",
    "published date": "Mon, 12 Jan 2026 02:43:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPLVA0dnM1SVFtQzBhcVhRMWtyeGpJWnhqRXdZUnR1U3hsd25ZUVdjMXZnbTdtMi1jcEhCckVYYkw5aFIyaG13elNqeFJNOFRhVFI1cW9INTNfME5ueGtNdGo5N0p2QlRScEMzbTNWTUppbFRualV4UkhubW9oN0V6M0x3TnBjNkYtc1FHMmtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Spencer and Monique Tepe: What we know about the Ohio dentist and his wife found dead in their home - CNN",
    "description": "Spencer and Monique Tepe: What we know about the Ohio dentist and his wife found dead in their home  CNNWho is Michael McKee, ex-husband of Monique Tepe charged in her death?  The Columbus DispatchNeighbor of Ex-Husband Charged With Double Murder Says He Didn’t ‘Seem Like Somebody Who Would Do’ This  YahooOhio dentist killed: Chicago man Michael David McKee, charged in murders of Monique, Spencer Tepe, waives extradition to OH  ABC7 ChicagoTepe murder case: Michael McKee waives right to extradition  NBC4 WCMH-TV",
    "published date": "Mon, 12 Jan 2026 08:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFBZX2Ria0pEOERHZzloLXdhajQ3SUd4V3lHT2czcm0tTUJfYkJPWmYxSmVtdlQwLTJoS1duVXBsUy1qOVlzOVdwQV9XTl9xWDVHNTVsOWpTamtQYzEzWnBMOUIxM1NoZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Iran Claims It’s Quelled Protests Even as Unrest Continues - Bloomberg.com",
    "description": "Iran Claims It’s Quelled Protests Even as Unrest Continues  Bloomberg.comLive updates: Iran ‘prepared’ for war but open to US talks as more than 500 reported killed in protests  CNNIran warns it will retaliate if US attacks, as hundreds killed in protests  BBCIran acknowledges mass protest deaths, but claims situation under control as Trump mulls response  CBS NewsAs Death Toll Surges in Iran, Leaders Take Tough Line Against Protesters  The New York Times",
    "published date": "Mon, 12 Jan 2026 18:42:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNSkZIMk82cmp4bTJuYXdsV1FKZ2lheTNWWWlyaVA0elU0bmR2aVIxME5jUF94VVVNSzFmbThFRzA1U3ZXVTV0d2ZsVDJ1TXIwd3AtR0NSS2pfWEVCUldDX1dSU1NyYWNQYUhsQm9ndVBWRXlheEQwQmh5Z0NyR0VtdDFEcWxKVzFrNHM2WXc1UzJ4a0d4TTdQQWZDLU5zaDQ3ZGNFRkp6ekMtYmc4N0RWTUFwcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Portland putting ‘sand in the gears’ of local ICE operations after high-profile shootings - The Globe and Mail",
    "description": "Portland putting ‘sand in the gears’ of local ICE operations after high-profile shootings  The Globe and MailTwo shot by border agent in Portland have Tren de Aragua ties, DHS and police say  KATUFBI says it has found no video of Border Patrol agent shooting 2 people in Oregon  KCCIHundreds protest in Portland after back-to-back shootings by federal agents: 'Every day, there is something new that is so heavy'  KGWOregon GOP leaders urge respect for law enforcement ‘at every level’ after Portland shooting involving federal agents  KOIN.com",
    "published date": "Mon, 12 Jan 2026 03:22:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPeVFhSEJZNTNxbVAwT3lXUEhEZmNmTk1qRWx3ZTNDTmNLelJNb0o3Z1ZvbUFFWVNLWXRIREdRS19HVW5BSGJ6N2dWc2lCTDRmWnJ2anZUbFVldFhtNTUxb2Z6S2RUeHVOb21HN3RRTktUeHJqckdveGhkVXBManpfMWFpMVlNUnBweFZjSXhmel9LaFl5a3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "After Maduro's ouster, Trump warns Cuba to 'make a deal' before it's too late - PBS",
    "description": "After Maduro's ouster, Trump warns Cuba to 'make a deal' before it's too late  PBSTrump ultimatum to Cuba: 'Make a deal, before it is too late' or face consequences  Fox NewsCuban president says US has 'no moral authority'  ABC NewsTrump Says Cuba Will No Longer Get ‘Oil or Money’ From Venezuela  The New York TimesCuba defiant after Trump says island to receive no more Venezuelan oil or money  Reuters",
    "published date": "Sun, 11 Jan 2026 22:56:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNTXNDY05wTm8zeUw3a3ZXUnlGekFOUkI1RkJuQ0U5aFpaUDdyZDBnWW1sQUVBWmZOTFFKcTlRNTNCN3QwYnVrRGtKdGFUR2RIdUg5dU44VEpsblV1LWNvX2o0QUxYaE5ZbXRHX3k0NG1abWFuREdfMHQyZkNldnhsSGs2WFpLTGMxMkNPVkpwZHAtTEtkVmFjeS1qc0lGTXJXbThyZmZMbzIxTTTSAbABQVVfeXFMTWhwQkRrVkdxOVFjdGx2TFE3TU82RzFpd2hhMWx0a29xNkNielVJMTAxUmNHVFFuenRCRU9yR2Jnb1NUbjhRMjFBZm56RzZTVnhidTV2TkZIYUxzV0lIUE1Sbmt3VkVxenBaLWZJdXdiNEhUeDBqSmY2NUdwNHpKMENBUG00em8xMW1uLWg5Mk80VkdDdkVseXl0Z0oweEt3M1RCay1PdW16VUVfcVlSemY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Largest nursing strike in New York City history begins amid stalled contract negotiations - ABC News",
    "description": "Largest nursing strike in New York City history begins amid stalled contract negotiations  ABC NewsNearly 15,000 Nurses Go on Strike at Major New York City Hospitals  The New York TimesNYC nurse strike: thousands of union hospital workers hit the picket line in New York City  ABC7 New YorkNYC nurses' union, citing faltering contract talks, announce Monday strike  GothamistNew York City expects biggest nurses strike as nearly 15,000 set to walk off job  The Guardian",
    "published date": "Mon, 12 Jan 2026 17:03:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNdDBsZjFHRmVxYUJHemlLcVY2bEhUWlJKVEtuQnhLNV81aFk4bnZreWM2RU45UnBPSDZTVWFMeFIzM2U3MW4yZldOMTdLM21nUkZRNkF1YnBPbTJhZmVmUXJLUjd3VzhyZXNVektCWEFHV1A2MWJZQVU1NklDOFAzN3EyVlRCTGRSVEV4dkFHSTJ3SVl2dDEzdGpCRmpRQdIBowFBVV95cUxQOXJkZ05WSnJSaV9ISDczdTAtQjdsVHMwZUNLWEd6T3lmYjZQbXd0U2lUWGhmMV9rZWNDS0UzcXF1NWR5TWRWZDJRUEdyMjVQMlZVMWNob1dOQ28xMjFNWU84NmxtOHdMWEhBTTRZenJPMktQY3BwdDA2SndZMlN0dTF6Tlp6VXRTeGlRTWFnb1FYRDg1UVI1ZDRrTDZXWlJjUVI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Former Rep. Mary Peltola jumps into Alaska Senate race - Politico",
    "description": "Former Rep. Mary Peltola jumps into Alaska Senate race  PoliticoMary Peltola Runs for Senate in Alaska, Lifting Democrats’ Hopes  The New York TimesDemocratic former Rep. Mary Peltola launches Alaska Senate run  NBC NewsFormer Democratic Rep. Mary Peltola announces Senate run in Alaska  CNNMary Peltola, barrier-breaking ex-Alaska congresswoman, is challenging Dan Sullivan in Senate race  AP News",
    "published date": "Mon, 12 Jan 2026 15:43:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNN2JaZjRTLWU4WGxob01wRjV1cm5wZkNsY1diZVN0aGtPNGwtaXJqaVNHUFpWaGlUM0t3S3lLaVhNMk52d1RQVDNCbG1lSUEtRU14VENJVlF6OVcxQlRrQXloRkZsQk5ueDhCRXVxVFpacFVoUC15ZjVIS01OYTRlMzlvWG1SaVNiWU5hMlh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Secretary of War Pete Hegseth to Travel to Brownsville and Fort Worth, Texas - U.S. Department of War (.gov)",
    "description": "Secretary of War Pete Hegseth to Travel to Brownsville and Fort Worth, Texas  U.S. Department of War (.gov)U.S. Secretary of Defense to visit Starbase  ValleyCentral.comPentagon chief takes ‘Arsenal of Freedom’ tour to Rocket Lab  SpaceNewsDefense Secretary Pete Hegseth to visit Elon Musk's Starbase on Monday  San Antonio Express-NewsHegseth praises Fort Worth’s F-35 assembly workers in renewing military might  KERA News",
    "published date": "Sun, 11 Jan 2026 17:23:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNR01ZWl9zdWxGSG9vZTR5SGswX0s2ZmstaFlDRTd5em9MbW5FZEFIRk5UbEJtNUgtei1ELW9ITHJiZzFVamg3cmlFVGtDTFJZRUlXZ1JwSmwySy1SVUhEc3g3dXhINHg2SEs4anNNbUwxbDZTLURpYVVrTnVsZ2RYZFY5Y3RxeXZHSkc5SUJ2Mkl6bDVkTDBkOHptMmtRVGpKdmcwZ0szSmtTN1BGNG1WOXZzb0x5aHZUTW44Z1lobGJabWJzOTd3TV8yQWVoQzhMTmRV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.war.gov",
      "title": "U.S. Department of War (.gov)"
    }
  },
  {
    "title": "Legal analyst breaks down questions surrounding ICE killing of Renee Good in Minneapolis - CBS News",
    "description": "Legal analyst breaks down questions surrounding ICE killing of Renee Good in Minneapolis  CBS NewsThe ICE officer who killed a Minnesota woman is a war veteran who spent over a decade working for DHS  NBC NewsFirst Thing: Family of Renee Good urges ‘empathy’ in call for justice  The GuardianTwo congressmen watched an ICE shooting video. Only one is sure of what he saw.  The Washington PostNew video shows minutes leading up to deadly Minneapolis ICE shooting  Fox News",
    "published date": "Mon, 12 Jan 2026 00:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPSG00eDRSRVdiejR2MnhrNmRXaHpkRDZyam4zUkR0ODcwdWcxUHFsb045NFk2SXRvcXRRUGd4WEhkRzdlV0ZmU05yR001QmtXQzZfNDJkZVRjVkUzTHo4SFpROXl1Umt6Y0FUZ0hZbmlfRFdBdGowN2NYWFpWMTFQN0hUQlVHNHIzeURDMHcwRmtQSlZtdVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Several of Kennedy’s dietary advisers have ties to meat and dairy interests - The Seattle Times",
    "description": "Several of Kennedy’s dietary advisers have ties to meat and dairy interests  The Seattle TimesBeef Tallow, Long a Health Pariah, Rises to the Top of the Food Pyramid  The New York TimesHealthiest red meats to eat — and how a cardiologist says to prepare them  Fox NewsParents on RFK Jr.’s advice on sweets: ‘Completely unrealistic’  PoliticoDo RFK junior’s new dietary guidelines make sense?  The Economist",
    "published date": "Sun, 11 Jan 2026 21:50:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQUGU3bDFjekVOSWFHQWN1WnVjMEZNQzkxNlFEOGFjWEFwR3VNblBXcS1rdW1fNG9HbWJVSTR6RFhGMnNLT2VBMVRRd21aLW1sanBBM1VGZUduQzA3TkJneGdGd1pOVkZ1TGhXQXBJNjBHTHNVWFVlTUd0X2xQc0JBZEZ1ajA1b3lsSnp4OTVyUXlFLVFTTnRsUF82SGlLTmRmdFFyandwRlVsck03c0xVME1nMG44Qlhoc0dKUEJJcXYzaFlpMlE5Qk5nRTA2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Trump says he may veto extension of Obamacare subsidies - Reuters",
    "description": "Trump says he may veto extension of Obamacare subsidies  ReutersThis GOP senator says reviving Obamacare subsidies would be ‘putting America first’  PoliticoTrump Says He May Veto Extension of Health Care Subsidies  Bloomberg.com17 House Republicans vote with Democrats to extend Obamacare subsidies for 3 years  ABC NewsHouse passes 3-year extension of ObamaCare subsidies  The Hill",
    "published date": "Mon, 12 Jan 2026 15:55:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNWXZKSDJsQ0JDTncycWwtdl9XaEVXX1h3d3UzRmJxbjh3bXo2eVNIamJSZWdKc1pYbC1fVU1lNVI1S1FBVldTQXFET0NFcVFxbW5vcjFHSXI4T0NPZzJDU0l5MXFIV2tnZUxUci1vV19rcTJ5c3FJLWZpd3hEWmlNVmpBanRiejdLZ0NidlJHN3lxalEwanlxV1dCYjY2YUYtZFc2VGcyRjFwWi1Cd1BROXlYMFBJT3U2OElkTng4THZCQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Missing Oklahoma boy found safe after mom, stepfather arrested on suspicion of child abuse - ABC News",
    "description": "Missing Oklahoma boy found safe after mom, stepfather arrested on suspicion of child abuse  ABC NewsWhat we know: Parents face numerous charges after missing Oklahoma boy found  KOCOMother and stepfather arrested for alleged child abuse amid search for missing Oklahoma boy  ABC NewsMissing Chickasha boy found safe, OSBI says  KSWO 7NewsMissing Oklahoma Boy RJ Davis found safe: The latest from the team that found him  News 9",
    "published date": "Mon, 12 Jan 2026 16:00:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQRUdRcFRIRUZ2MmN5ZHhEMV9xWWxabVlHaVhYeTM0UFAtSm5RRzFyaU9uWHZ0SGlsYUFXd25CRkszZHFMT01vQnNCT2ZlNWJmNFlPQzlQeHFpMWlYNXVDREU0UFBFcmtvdnVQOFhtVmlkTEhQblk4c0xScVppbUZrM2NzMjFIcHNOYV9URWZuZG11X3dOaUNjSlV4Q2dGQdIBowFBVV95cUxNWU1iVS0yYTBuTWNTbWtGRlk3bC1LZENyMXc3NXkzQlpuLXpZbVFGaVBBNnNmTnpMdy13NmF0aXpEZTVSbno4YTBVekQ3WlZ0cFVjYlNMc3c3LWFDYmdoOXVpQU1BbU50NXBiUG5uQlhBQWdYRTV4dmNyLTNWX0Y1YmZDeml5dXdHQzVIMkNHU1R4VlNiaW5jZ3NBWnpsWTlJc0pF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "First responders enter devastated Aleppo neighborhood after days of deadly fighting - AP News",
    "description": "First responders enter devastated Aleppo neighborhood after days of deadly fighting  AP NewsLast Kurdish forces leave Aleppo after ceasefire deal reached  BBCSyrian forces expel Kurdish fighters as US strikes Islamic State targets  The GuardianSyrian Military Takes Aleppo Neighborhoods After Clashes With Kurds  The New York TimesSyria updates: SDF fighters pull out of Aleppo after deadly battles  Al Jazeera",
    "published date": "Sun, 11 Jan 2026 20:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPdDdmcVd3SFRjQlBzV1h5SDJ3c0dhaXVvM0EtaGZEQVlYU0xyYmdnbnBKRjVEWHRjWDhYSXlYVHlKOWhwckJrXzNlMDhjUm9XZnp3NjNMZzI4WVVqR1ZPVkRQd3pYMjdEbTNjY2s3TGV2V2wtTlpwVWVfSUhpYklwOXgtdGtoamdDc2RWekhMQkp5WV9UYVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Warren seeks to put her progressive stamp on Dems' 2028 makeover - Axios",
    "description": "Warren seeks to put her progressive stamp on Dems' 2028 makeover  AxiosElizabeth Warren’s Comic-Book Economics  The Wall Street JournalEditorial: Warren’s ‘bold’ new plan for Dems — let’s listen to voters  Boston HeraldExclusive / Progressive Democrats urge party to go populist in midterms  SemaforWith Democrats at a Crossroads, Elizabeth Warren Urges a Left Turn  The New York Times",
    "published date": "Mon, 12 Jan 2026 13:28:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1UM1NzT0FmM0FjUUJvZmZnNEE0WGprRjJ5VncwZUVEbElpYW52Vnl4ZGlfSWltdW9BYk1LQi1qSWtham1FbkVzcXhqbG5aejRFQXhiSUxkTi1xWElZU0NZZzBJdnFUUVNyYmtnMEZONGk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Florida’s Legislature gets ready for more GOP sniping, tough choices and DeSantis’ swansong - Politico",
    "description": "Florida’s Legislature gets ready for more GOP sniping, tough choices and DeSantis’ swansong  PoliticoWhat's at stake for Miami this legislative session  AxiosFlorida’s legislative session kicks off Tuesday with property taxes topping the agenda  News4JAXSchools of Hope, Charlie Kirk top Florida lawmakers’ 2026 session agenda  Tampa Bay TimesLegislative Session preview: Jim Boyd expects steady 2026 Legislative Session, with property taxes looming large  Florida Politics",
    "published date": "Sun, 11 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTjl1ZTdTVnJqNUZzT1NQMXJJM3B5Um5BX1RNYWFya21YZHRhd2U3eG1HdHRRTllFZnR6NFJDRWhDRmFmNkh0MGJzeWNfdVlxVlJ6eElDcTU1MlVYZDBxZXktNnU4RnA2NU5BY0gzd0dlTlQtUFZDZlVraEJoSFRycUZLeFM1Z2hrT0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "SU Chancellor Kent Syverud to take top job at University of Michigan (report) - Syracuse.com",
    "description": "SU Chancellor Kent Syverud to take top job at University of Michigan (report)  Syracuse.comFormer University of Michigan law dean selected as next president, to replace Grasso  MLive.comSyracuse University leader to be tapped as next UM president  The Detroit NewsU-M president candidate criticized for hate crime response at Syracuse  Detroit Free PressWho is Michigan president Kent Syverud? A ‘Super League’ backer who will decide AD’s fate  The New York Times",
    "published date": "Sun, 11 Jan 2026 18:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPaHZ2QzdfTFBGOHM2NmE2akYxSHdsUVlLNnBsZzFOeU1BRmowXzBEV0xVeVNmVXhabDJWcmthRUNqdzk2VWFVMDk0MTZRZy13em15VWttNDVyNUtwVkotcUU0ZHZ5U0ZrSGlLNG9DWFpuZm1FYmRiSGRLYXcxVWVMd3ZqV3p3X3lEdDFxc3F5Qi0teU5tbC1KaTRyaENaRjlnMXo4MkR6NUEwSENUdWIwcFhUWmwwaG_SAcsBQVVfeXFMTm1kUVdfODBXNUVHQ042UnhDcEdPaWctMG1OcXdMQnpGMURmeFhYeHF5QU1qbFptd19vQ2JCQXV4a0lVczVfOTBJeDc5bHZydWVFazRQTWJhMWZfd0xtanYyM21sMmhKcUJ5VHRRTDREYjlISnQ1NTNhWkpIUDVhenNJRXlRRjFITk1HNERWOURQd2xOb2MyM3doZ3hHbGlwUFJFc1diRVFaN29RdEduSl90ZnMyN2xzdUZQWDJ1WEI5UVdaYnJZZ2hnLUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "In Venezuela, Dissent Is as Hard as Ever - The Free Press",
    "description": "In Venezuela, Dissent Is as Hard as Ever  The Free PressWhat I Saw in Venezuela After Trump Seized Maduro  PoliticoOpinion | A Good Riddance, but a Disquieting One  The Wall Street JournalGrowing questions about Venezuela’s future in wake of Maduro’s capture  NBC NewsWhile celebrating Maduro’s capture, Venezuelan immigrants worry about deportation  Los Angeles Times",
    "published date": "Sun, 11 Jan 2026 22:08:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1abmdCZURrNjd0OGdxN2c4X0lwZUdta21MaS02VWVuMTB1Y1hjcFU5NHV4SlVfSG5vUmZKVnJkaFczOEZhbmpTX0c3Rm5WangweV9GSnVoRjNxRU40NmNyZzFSanNsejJ0TUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thefp.com",
      "title": "The Free Press"
    }
  },
  {
    "title": "Rep. Ilhan Omar says it is \"not acceptable\" for Trump, others to make early judgments on Minneapolis ICE shooting - CBS News",
    "description": "Rep. Ilhan Omar says it is \"not acceptable\" for Trump, others to make early judgments on Minneapolis ICE shooting  CBS NewsAfter Minnesota Shooting, ICE Again Limits Congressional Visits  The New York TimesDay after Minneapolis shooting, Noem ordered new restriction on congressional oversight  PoliticoNew legal questions after Homeland Security changes policy for congressmember visits  5 EYEWITNESS NEWSIlhan Omar kicked out of ICE facility after DHS requires week's advance notice  Fox News",
    "published date": "Sun, 11 Jan 2026 21:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPczBaNF9zQl80WmtZWV9MdkFQVjl6RWhWeU90UFlZM3A4bEtvNFY1RllFRFk2NVdKOEpEUFNSZW9QcERFcHgtTXJWbFBELWlGczZvN01COVREcnpQTTZzcVA2S19MYnR2a2k0SmtfaUNoeDFMeVZkWGk0aEg1ZVR3SmFWczMwZ3FWVV95UUF0ZndFSkc2VVFCcGVBa9IBoAFBVV95cUxNYVBYX3BMcVVXellFMEZBZTNVcjEwWi1mbWxKVDhyQlY2UGhsTjl6YUN0SkxLOXM4MVlORjFEaVVmUmU4dFUtbDZvUTNhdGNtaTNQNHQ1NjM4ckJMLWZQY0VlLUZvV1J0UE9xTnA4UDNsVFRHQ0hnbGNqTkJhZEFlWXBMMFlpQ2Nad2tmMVpUWFRoYUtLdFR2UHhReXF4WDVD?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Immigration agents flee Somali market in St. Cloud after encounter with large group - Bring Me The News",
    "description": "Immigration agents flee Somali market in St. Cloud after encounter with large group  Bring Me The NewsView Full Coverage on Google News",
    "published date": "Mon, 12 Jan 2026 02:21:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQY2hzSlFWYVV5WGhpV1lzaHdLNXA0TXJLTFdzUnFNNEc2NmlMZS04TkJlYjBoZ3Zhd1l6SXdRTnpKb1ItckJqeGlUWmpLczJCc1BWX1p4VVFaelY3eVctWHZaTmo0UHQ0NWFQTXNlZG5JWlBGS2NueVcwNm5ILUtjOTNYNlhjNzRlYl9QRjFrVWQ0YVVLRmc0aENRaHFSOG9Ya2FKT1FtdmVmaUdkMUZ1MXBZd0NPMVNLZzlPc3Yxc3RZdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bringmethenews.com",
      "title": "Bring Me The News"
    }
  },
  {
    "title": "Air Force Moves Special-Operations Forces Toward North Atlantic in Move Against Russia - 19FortyFive",
    "description": "Air Force Moves Special-Operations Forces Toward North Atlantic in Move Against Russia  19FortyFiveA painted flag, a Russian bluff and an 18-day chase across the Atlantic  CNNRussian Flags Proliferate Over Shadow Fleet of Oil Tankers  The Wall Street JournalUS seizes fifth oil tanker as Venezuela pressure campaign continues  Al JazeeraReflagged by Russia, spied on by UK, seized by US: why so much interest in a rusty tanker in the Atlantic?  The Guardian",
    "published date": "Sun, 11 Jan 2026 23:55:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOXzJEa19ZQU00cjZFbnVCRmN3akdLak91NTFHNDNDQkl2d2wyMEVkc2J6OUF5djFXOXRScDdLR1l1UkVTam5RX1lhWHZ1RThVbkMtOGhqOVJuc1hzbmw3SDk0ZFFuVDh3MjVrdEgtTlpaVDR1d0E2YU55TTFJNkl3MVpXWkNZZlBLV21zbi1sNy1ETDhPaXdXVlBndmlHb3pRZmdyeVBXeGl2Qi1fUHRkb3QteGEzS0hFTnBKSThkUlc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.19fortyfive.com",
      "title": "19FortyFive"
    }
  },
  {
    "title": "Trump threatened GOP senators who voted for war powers resolution in 'angry' calls - Yahoo",
    "description": "Trump threatened GOP senators who voted for war powers resolution in 'angry' calls  YahooView Full Coverage on Google News",
    "published date": "Sun, 11 Jan 2026 21:57:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNWG14Y21mNFBNcVZxQXhMNFJHQjRqZkc4eGpfenhhZVNzbXJIRF9fZGpjVldMcHBNZmVzVzZGSzlxbGprc28zQjU0LThWSTk5WTVveTA3VmhOLWozeTdkdHRGa1J3WE1zQUhjbkRtNlJ4M1o3NUhpbkpqMWVuak12X2lrY2hRS3JvcGdwVW5Qdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Trump Says He’s Inclined to Exclude Exxon From Venezuela - Bloomberg.com",
    "description": "Trump Says He’s Inclined to Exclude Exxon From Venezuela  Bloomberg.comTrump threatens to sideline Exxon from Venezuela's oil: 'They're playing too cute’  CNBCTrump may keep ExxonMobil out of Venezuela after CEO comments: 'I didn't like their response'  Fox BusinessTrump threatens to block ExxonMobil from Venezuela after CEO calls country ‘uninvestable’  The GuardianTrump says he'd be \"inclined to keep Exxon out\" of Venezuela oil push after CEO's remarks  Axios",
    "published date": "Mon, 12 Jan 2026 16:24:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPbEpiSWZDX0pzeXg2czNWcXJkLUFUNnRWeV9DNlJGenVxcGJQWnh5THNXZU1kN2lqMmtBaGtqNUNuN3podG1vNEd6LW9xcDFERGQ1eXNKQnlUdUdweVUwWElqQkhodjJmdjNFcGZ5WktpMFZiWUhhU0c0X0t0eHhUQjk0bHZ2MTVaS0xNRDhURmhYa1lNQ0huOEFCV0ZSQ191bzhqdDExWmhBejNfRnF6QmJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Russian Missiles Failed in Venezuela During U.S. Attack - The New York Times",
    "description": "Russian Missiles Failed in Venezuela During U.S. Attack  The New York TimesHow US gave Iran, China, Russia reality check in Venezuela  The Jerusalem PostWhat the Chinese learned from America’s raid on Venezuela  Washington TimesNot treason, survival: The reason behind Caracas inertia as Delta Force moved in  The AustralianTwo More Russian Buk-M2E Missile Systems Found Wrecked in Venezuela Weeks After US Strike  UNITED24 Media",
    "published date": "Mon, 12 Jan 2026 14:45:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNUHZFQjREZXF2VWN2TUJVYXlHQklCX0lhS2xLSThYdGNDRnpkalhfWHc4Vk5KM2l0NGVqS1poRjI0WVJVSDhUc0VLOXFKazdYeWFoWGNFN2ZndkxRT21CZVY1VmhwcDdaSDJQWXVIYkpjZnFoWXRhaExJaGozN2MzYzRZVnZVRDhpUXdiNDBB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Machado's Nobel Peace Prize offer to Trump rejected by award organizers - Axios",
    "description": "Machado's Nobel Peace Prize offer to Trump rejected by award organizers  AxiosNobel Institute rejects María Corina Machado’s offer to share peace prize with Trump  The GuardianNobel Institute indicates Peace Prize cannot be transferred after María Corina Machado suggestion  NBC NewsMachado Offered Trump Her Nobel, but Prize Institute Says It’s Not Allowed  The New York TimesRep. Salazar touts Venezuela's Machado before her visit  Politico",
    "published date": "Sun, 11 Jan 2026 22:47:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPMzhOYk5EVG0xN0Q0Q21ldXZEUlJtNzdYNlpFclhXd2NMSEdvejRYaHVhWGpJTlRYb19OLTAtM3V1XzJaX0wyS3MxTDVEaFdtdndiNzBNTVh3R0dMQ09rQkkxaHlhcEpNa1R3VmpJd2dickRhWVZqY20xcVpYV0ZZQXp3ODVfcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "CNN’s Jake Tapper Destroys DHS Secretary Spin With January 6 Footage vs ICE - Daily Kos",
    "description": "CNN’s Jake Tapper Destroys DHS Secretary Spin With January 6 Footage vs ICE  Daily KosKristi Noem tells Walz and Frey to ‘grow up’  Politico'Absolutely' what happened: Kristi Noem pressed on ICE shooting comments  USA TodayWATCH: Kristi Noem Sputters After Tapper Rolls J6 Tape and Confronts Her On Whether Capitol Police Had Cause to Shoot  YahooICE Barbie Blindsided on TV With Clip of MAGA’s ‘Double Standard’  The Daily Beast",
    "published date": "Sun, 11 Jan 2026 16:52:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQakN3QlFFakVxSzdWMW5kTnhWaG90ckxodWlva3pUQ1hZajhuQ05PYXJtUmFydlNkMFFkd1p1WnFyMW5BQkZyZkRjXzFsU0ZFVEZVZVBzWWhyMFNvclNXTU1ZckRuQ0tzYlNDMi1CRTZaUl9LNUtGNXBsRGMwbnBwdjFDX2Vkd0ViZXJSSTIydGVsNUxHQkRTOVJZdDFYd3JiYmFmby1lR2NqS0ZJak94UmF5VGJQN2llRjFka09kSXkxa0FLdFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailykos.com",
      "title": "Daily Kos"
    }
  },
  {
    "title": "Rising This Week: A Congressional fight brews about ICE - All Rise News | Substack",
    "description": "Rising This Week: A Congressional fight brews about ICE  All Rise News | SubstackCongress is debating the possible consequences for ICE and even Noem after Renee Good's killing  AP NewsLate Night Is Distracted by Kristi Noem’s Oversized Cowboy Hat  The New York TimesJohnson ‘concerned’ ICE shooting will hamper funding negotiations as shutdown looms - Live Updates  PoliticoDemocrats warm to impeaching Kristi Noem after Minneapolis, Portland shootings  Axios",
    "published date": "Mon, 12 Jan 2026 02:22:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE9qOWNzc1dkXzRaNlNsMkVDUlJiT2U3SkU3N0FoSl9mWFlvRkVMSWFBRXdCS2dCRWlEUldfTlpIR1l5dkNuOUhBWGVCalpMMWZqT1FYZ0xMdmE1Z0w3ZU8wN00teG9BM2hjTUhGeQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.allrisenews.com",
      "title": "All Rise News | Substack"
    }
  },
  {
    "title": "Mayor Mamdani Moves On Up to Gracie Mansion - The New York Times",
    "description": "Mayor Mamdani Moves On Up to Gracie Mansion  The New York TimesZohran Mamdani and his wife move into NYC mayoral mansion, leaving behind 1-bedroom apartment  ABC NewsBidets, ghost and a hidden note from Eric Adams; Mayor Mamdani officially moves into Gracie Mansion  News12 | BrooklynEarly Addition: In Mamdani's new house, there are many rooms  GothamistMayor Mamdani moves into Gracie Mansion, promising public access — along with bidets and a cat  amNewYork",
    "published date": "Mon, 12 Jan 2026 22:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQM3N2bjJWVjBmX2JkU3VxblA1czkzaFZ1N3dWdWhhYlpWc1k5LW1BMjNmM0pKQXpvWEotS2ozcDFkRmlVaFVvZzVMdkdFb2JMUHJnVFFVNks0RldSZ2tmcGFJSmZGYWctaWlCblJsWnlURkNKWDd0TzJnVG5rZ1NQdQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "3 inmates dead, 12 hurt after \"major fights\" at Georgia prison, authorities say - CBS News",
    "description": "3 inmates dead, 12 hurt after \"major fights\" at Georgia prison, authorities say  CBS NewsThree dead, 12 injured after 'possible riot' at Washington State Prison, sheriff's office says  13WMAZNew details: How 3 inmates were killed at Washington State Prison  WRDWDeadly riot erupts at Washington County State Prison in Georgia  WJBFUPDATE: Two inmates dead following \"possible riot\" at Washington State Prison  WGXA",
    "published date": "Mon, 12 Jan 2026 07:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNVnJ2elQ4RWtZb3RuMDFER2pIUEFldU9qUHVTd1lkMk9ZTWVLTERRcFJjNk1nOU1aNlltbjVxamtKem9xWDE4eS1JazZzdmVqeDdzZE05TGVNZHFBU0xNRjlLWENvTWpxRVFob2hXa1I0cTBsWVM3NFgwVlBmanQ0bFRmT05Hdk1KcmVKc2cwbmJjMW5wWWZr0gGcAUFVX3lxTFA3UzJXYmdXN1E0ejRkNHd0YURDZU5YOEM1WHROT0hiMXdTTWlCZzU5ZlZkM29Dd3I0a3NwT09Pd2R5a3I4cFNXNVg2bUttemhFM0hIR3o3VVhXZ2VZOTNzNG90d1FtUHI5RnpjR3hiM3Vxdm5vOXIxN0luVWc3bk5tWWVJblEteEZNVzFFdWdnM2o1N2xuTUhtMzB1Vw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Macy’s Valley Fair shoppers thwart Rolex watch thieves during strong-arm robbery - The Mercury News",
    "description": "Macy’s Valley Fair shoppers thwart Rolex watch thieves during strong-arm robbery  The Mercury NewsView Full Coverage on Google News",
    "published date": "Sun, 11 Jan 2026 23:21:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZEJNYjhCbXN1OXk0NVRHbmtobmh6VnRfYlM3dHdoS1hjdkRzNm1CN2ptbkJqMUlSTUhHcmo0NDg2Sk5jbUhma2Z1VDBHWUxfTTBQM19ic2RGdlNsbnNKUm5xZ3JISEdXbkU5TVVNVVlnSElfYmczclFSNkw5eE1DR3p1OFNQTG45NmJfemFUUkxhLXBxOHhSNdIBngFBVV95cUxQcjFJdkxLSkFlVDdlbXEzMTE1a0JfQlB6VjBfRDlUN0tMeG8tMG95Wk1YOHlMT0JTV2pMc1BROE04N1Z4d2hQR09qVlE1UnhFTVNYUm9ldi1qaDV4a0dveW9ReGJ2SGVTQ0VHcWJwcF9zZWRyWlQtb1Y3aFdOSmVYNUxuWVlHSVBtaWZlRDhiVGc2TUdzQWJlZFdBWUxjQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mercurynews.com",
      "title": "The Mercury News"
    }
  },
  {
    "title": "Hilcorp chairman: We’re going to Venezuela - Anchorage Daily News",
    "description": "Hilcorp chairman: We’re going to Venezuela  Anchorage Daily NewsWhat the Big Oil executives told Trump about investing in Venezuela  CNBCColombian president says Venezuela \"will implode\" if U.S. runs country for years, as Trump suggested  CBS NewsExtracting oil or implementing democracy: How the White House is managing what's next in Venezuela  NBC NewsBig Oil offers reality check to Trump’s Venezuela dream  Reuters",
    "published date": "Sun, 11 Jan 2026 20:30:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdVByLTRUWFltSlBfWENHVlNhLW1RdU5pMTByTDZRMGZ5T3dxbjBzcWJpMTdhNzFJWkdoeVZTSDVUTGcyVUdLcjRsQjR6ZUlZLUJULW92ZEl5d1FNeE1tXzFXNlgtYTk5M2RFVUI5Vy1CNTJzMHE3aVhWdFhQUDhNLWU2R09jZ1JETDlyVXVCTlV4MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.adn.com",
      "title": "Anchorage Daily News"
    }
  },
  {
    "title": "‘It could be any of us’: Hundreds join anti-ICE protest in Mountain View - Mountain View Voice",
    "description": "‘It could be any of us’: Hundreds join anti-ICE protest in Mountain View  Mountain View Voice'I had enough': Hundreds protest ICE in Coachella Valley on Sunday  The Desert SunHundreds rally in Placerville against ICE, Venezuela actions  ABC10'ICE Out for Good' protest in tiny Tijeras draws hundreds  KOATProtesters in Salisbury call for justice, accountability  The Lakeville Journal",
    "published date": "Sun, 11 Jan 2026 18:15:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdTJTY0QycnpjZ2tOUW9QRWp2cWdmM3pFRmgzUGlfbkdEd2htRlVta19qV0VsclQ3bGtwN2dqSmZHMGV3YUxmZWV6bUhEUkpJTjRfOWNMM0Z5Vml0a0ZNYzI3aGh3Smo3X0R5UHVqSmVwcjBVY2Q4eFJuN1RMY24tZ2R3MVpBdFViRXFnaW1DcjhvM1lwTHNMd05yaTlmTHBOSU1zbEczeGp4bE5Gd0x0aQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mv-voice.com",
      "title": "Mountain View Voice"
    }
  },
  {
    "title": "Protesters try to attack driver after truck speeds through Iran demonstration in Los Angeles - AP News",
    "description": "Protesters try to attack driver after truck speeds through Iran demonstration in Los Angeles  AP NewsChaos erupts as U-Haul drives into crowd during anti-Iranian regime rally in Westwood  ABC7 Los AngelesU-Haul drives through protest against Iran government in Westwood  NBC Los AngelesU-Haul truck drives through Iran protest crowd in Los Angeles, one person struck and driver detained  Fox NewsU-Haul truck driver in custody after steering into Westwood protest against Iran government, police say  Los Angeles Times",
    "published date": "Mon, 12 Jan 2026 11:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPOWZaT3NYbndlay1uQTNLTjdOSWZOYmo2UTVhcUppX2VCdWR2d2JDYjN2d2RIc29WSEl1Wm80bWttWl9ldnlhRDh1UlI3MGtuSkJpeVlCOWRaZm5mMUkyN1BKN19TMzgyQ2NQdEtDMS1QV3c3bHJ0WDZkQWo0eFBMRU5ueThjbno4UzBZVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "What's happening in St. Paul? ICE agents raid door-to-door, Greg Bovino spotted at Target; videos | Hindustan Times - Hindustan Times",
    "description": "What's happening in St. Paul? ICE agents raid door-to-door, Greg Bovino spotted at Target; videos | Hindustan Times  Hindustan TimesVideo shows federal agents making detainment at St. Paul gas station  FOX 9 Minneapolis-St. PaulList of major ICE raids in Minnesota on Tuesday, Jan. 13  Bring Me The NewsWild video shows federal agents detaining 2 men at Minnesota gas station as agitators gather  Fox NewsICE agents smash car window, detain man in Minnesota  Newsweek",
    "published date": "Sun, 11 Jan 2026 23:49:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxOcm5XQ1NoR3M4R0lmTmVqVDVSMzlzNjdRbDBUTXdIdnROX0M1LXN5YjRKdERMWXpXNGJxdXlfdEZrTEFjQlhsMkVyYjQwdW1VYzFfbU85NDdMNWwxN05PRFVmeW4tVW9oRU50N3N1bzJUaEhTcFc4ZjhkQi1ObkdyNEQwLUh4a2NTT2FJakRLeWRGUjRORUZRbE41YVd3ZXBXeWMzdmVlVTRQUHN4OThTa2hHNl81MEpSdU1pQmpJWFZRR3VReVp6aDk0U1BEdTFDUmszeEJiWF84R3hRZm5nUWlhc280aFlOY1Y4ZGFlMk5UNHBXVTZtWS1YMllSOHNIRV930gGIAkFVX3lxTE5fbFYyTkhGaFMxeXA3N3lyQ1E5UkhLT0k5X2JtSmdfNUJUUldudXJjNmVrM3lzckJ0ekk3bnI1bVptaVRqODdRMHBNVi1KNVI0SDZLdm1iZjJUMVhVYUJYRWtzQnBGTXFwOHVtTWJwS1hnOGZPSjFWejJLLVJhNmU5WmpscUtTeEJkMlpsZ0g4eUUtZ3E5Vk5DZWxqWTR5UFpRYXRieVlZTU5MRHlrQ0NTbl9haGRucWQybF9WeGVnOHZnS0pRckVId2MyTkU3VndDTVlxVk1uWUxwa01aeEVjeVBTdnc3bVVoU01VUDZsX3hwaW5SVXJlcnFWR1dlVUtHNmp5aWFWMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hindustantimes.com",
      "title": "Hindustan Times"
    }
  },
  {
    "title": "How Minnesota Became the Center of Everything - The Free Press",
    "description": "How Minnesota Became the Center of Everything  The Free PressOlson: Walz and other leaders just showed us who they are  Star TribuneMinnesota finds itself in an unwelcome, divisive political spotlight  The HillShaken and reeling from another traumatic week, Minnesotans search for healing and hope  MPR NewsA love letter to Minneapolis  WBUR",
    "published date": "Mon, 12 Jan 2026 01:59:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9JVWtuRkZYVFZfVi1zaEJVTDJ4OUtSaXZPVzFEYzdOazlyNzVhSUFidVUzenk3RUZBWDZZZC1HdElTc0M5SEt5ZC1rVjRTdjlPLThSQk1RSC0yVzBkbHAwejc5RUZXRS1heEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thefp.com",
      "title": "The Free Press"
    }
  },
  {
    "title": "Buddhist monks are walking barefoot from Texas to D.C. with their dog, drawing big crowds across the South - Fortune",
    "description": "Buddhist monks are walking barefoot from Texas to D.C. with their dog, drawing big crowds across the South  FortuneBuddhist monks' Walk for Peace draws thousands to Columbia, spreading unity and compassion  WLTXBuddhist monks continue peace walk through Blythewood  WIS News 10Columbia mayor to honor Buddhist monks with proclamation during 'Walk for Peace'  WACHBuddhist monks get closer to North Carolina. Here's where they will be  Gaston Gazette",
    "published date": "Sun, 11 Jan 2026 22:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQWDluOTYxVTV2Q1ZjdlIzQjVRUGRCSWE4T3dwYzQ2TXV1SEJsU2QyMldUN2Z3eVFpdU9aQnhRVnhvMkdUNTJnUzVDc2pOWnVLclExbEQ0S2N5MGRvak5kS0JWTjdQcnl2X1hTOUJnMmZnUkZPYXlXR243Nk5MVDFJTlc0djdFZ0dHOWZtZzdLOThSb3FwQTJRSkxFRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Republicans in Congress show signs of life - Public Notice | Aaron Rupar",
    "description": "Republicans in Congress show signs of life  Public Notice | Aaron RuparHouse falls short of overriding 2 Trump vetoes of bipartisan bills, including Colorado water project  ABC NewsTrump’s iron grip on congressional Republicans is weakening  CNNTrump’s Rage Explodes at GOPers as Their Defiance of Him Visibly Grows  The New RepublicFractures are starting to show in Trump’s GOP at the start of this election year  AP News",
    "published date": "Mon, 12 Jan 2026 11:17:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE95Z3dYLTB1RjU0bE5KVWVURE9vZ3FBMXRuT2p6V2VvVnhSMThYOHJ1bXF0dDdLM2ptV1BXZEJCdHItcmhYRHhTZ012SjZUWFRoUHIyMWdnMDh1ckJzUnR1Z05XZlYyUERRMWMyNFlXSzd6MHNKdmxIZHh3TjVudjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.publicnotice.co",
      "title": "Public Notice | Aaron Rupar"
    }
  },
  {
    "title": "‘A Breaking Point’: The Minneapolis Police Chief on ICE - The New York Times",
    "description": "‘A Breaking Point’: The Minneapolis Police Chief on ICE  The New York TimesICE Goons Blasted for Letting Car Roll Away During Arrest  YahooMinneapolis mayor, police chief concerned ICE crackdown could lead to further violence  CBS NewsPolice chief predicted 'somebody could get killed' in unearthed footage before ICE shooting  Daily StarIn New York Times interview, Minneapolis Police Chief Brian O’Hara rails against ICE tactics  Star Tribune",
    "published date": "Mon, 12 Jan 2026 23:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQMHE4Z3VyR2NwQmJkdUE4cE4zclVEd3U1OTFXeGo5cVp3UHZMNU1uUWNzODFnZ2F5b0lKUWYtTlc1bk01RV8zOXg2WTlxbE5vYVNuU3d5NEZDclVpNXAzNHJraDlQN1JwSWdjdHU4NzFLRFhFMG93dE44YkJnS0Nia0I1T3l4UHlERjB4YkpyUEx0bFA1RmVTSFUzZ0s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Philosophers speak out against Texas A&M 'academic censorship' - Chron",
    "description": "Philosophers speak out against Texas A&M 'academic censorship'  ChronTexas A&M, Under New Curriculum Limits, Warns Professor Not to Teach Plato  The New York TimesOpinion | Plato falls victim to campus culture wars  The Washington PostOpinion | Texas A&M told me not to teach these Plato excerpts. Here's what he wrote.  MS NOWNo Plato: Texas university pulls readings on gender ideology in philosophy class  Houston Chronicle",
    "published date": "Sun, 11 Jan 2026 19:41:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOcHVZQmwyLVRSM0ZMWUZobGRyQV9rQ2dlRGlPTkE4aEJoWmpfRGx0OXlqdkYxc3lfNnFFaW9KZmRPNzIxLWJjbTdxWUJyLWdsVnlrb2R2cVFnYThkcVR3REF0MFdZZURuQ2NoUDc2bDdNc01xal9udk9yMDBEVWxJMkQ5SXhnbl9IdXphOHFVWlRKU3JaamdDUU0zelVKV09NcVI5akt6MDdxcWtrSVBFMzc4ZUt2SWFjQU1kWFNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chron.com",
      "title": "Chron"
    }
  },
  {
    "title": "As Minneapolis ICE shooting draws national attention, local and federal leaders dig in their heels - Politico",
    "description": "As Minneapolis ICE shooting draws national attention, local and federal leaders dig in their heels  PoliticoAfter ICE shooting, Minneapolis mayor emerges with blunt rebuke of Trump  The Washington PostDHS to send more ICE officers to Minnesota as local lawmakers question legitimacy of FBI probe  MPR NewsMinneapolis mayor urges FBI to include state officials in Renee Good inquiry  The GuardianMayor Jacob Frey, Border Czar Tom Homan discuss investigation into Renee Good's death on NBC's Meet the Press  kare11.com",
    "published date": "Sun, 11 Jan 2026 19:42:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQRUFJN09JVWdRdExuRG0xZzdkWDJzcE01OEpWdVFNbklOdzZMWW8xM3ZYMmlkbFF5cjA4dlBYSUpjMVJYUWx1Nk9zSUhZeU9OR2w1ZE9LTi1naWhnTTZ6Y3ZuclRsNF9MaGJvaGx0emoxdnFSaUlUQzJOeTN2ek5yaG9lSWc0UjBjTjR2b2szYTU1RWhWUjVUVWdjZ2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Portland police reassign officer after video surfaces of comments on Minneapolis shooting - OregonLive.com",
    "description": "Portland police reassign officer after video surfaces of comments on Minneapolis shooting  OregonLive.comPortland officer reassigned after comments about Minneapolis ICE shooting  KATUPortland police officer reassigned after comments on Minneapolis shooting, chief says  Oregon Public Broadcasting - OPBPortland police officer reassigned after comments on Minnesota shooting  KOIN.comPortland Police Bureau reviewing complaint after officer's comments about Minneapolis ICE shooting, chief says  KGW",
    "published date": "Mon, 12 Jan 2026 00:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNOTlPLUEwVWw1YWF6a0tEZVZPZ1c4MXYzQ3h5X1l0NUhrYUdVSEZvQ2ZSQlJCQm81ZmJTazU3eHl5N21PR0thNl90RjN0NC1LQ2VIdndpcXpCd2RHOVktV1MxSkprVXVsLUZpRDVVY0p0RUplRkpBRzJHRS1uMEJVMjNhOXlFNnNqQ0oxWVg0b1dZOVR5VEZUNXBXejVsWVh2dVNCOHowWVZpNm54cjlHWDlpa1VNNUJ2ZXhKTXc4dFJTRjdGUk5oTDUxRXRTeF9x0gHkAUFVX3lxTFBiTU04Y2VTSWNndmRQLW10V1VXWXdLdXRVUnlsT3hmUGVzOFFLQ3N5OVVxQXY3NmItX0FZUTlnX1JPRTdjT3FUeHJaZGt4bTF6c0xTYVU2OG5zdzRSMnE1SUNMUFQ4T0lRUmUwcmpIRDM1UjlnM09kZEl4RHZPMGU3dF9mQ1RpREd6WEhUVnlZMmxkMkFMeWtNYTA3bW0tWjg0RWlYWndUNzNWUkdNVk13djJkd1RtOUNuU3lhWVpOemRrbDNpRXJzUV9DQ2JTenlpc29YanVPUEE5VGJlNWZtU0k0dg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "National Portrait Gallery changes Trump portrait, removes text about Jan. 6 - MS NOW",
    "description": "National Portrait Gallery changes Trump portrait, removes text about Jan. 6  MS NOWSmithsonian swaps Trump portrait and removes mention of impeachments  The GuardianSmithsonian removes Trump impeachment text as it swaps his portrait  The Washington PostSmithsonian replaces Trump portrait display, strips Jan 6 and impeachment references from accompanying text  Fox NewsSmithsonian takes down details about Trump’s impeachments from presidential portrait exhibition  CNN",
    "published date": "Sun, 11 Jan 2026 21:45:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNZFFBcnUwM0pDU19lX3JnOHQ3NEt5YjdGTjNLUXU3cTlLcFAwM0RoY1ZWUG9UNWx4b1g0QU1EUjVjWlFvTkhpc2ZVYUhHUXRkZm41cXhVN3JYcnljc25ybTNHV0R2alpPR1VjOVN1dEpjUG5QdGduMXVkNGlRTHpzaGpWSEZ6SnlIWW55Ni0yRmVXYTFhUVRZNng2SUNaUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ms.now",
      "title": "MS NOW"
    }
  },
  {
    "title": "Anti-ICE protestors demonstrate on pedestrian bridge above U.S. 75 - WFAA",
    "description": "Anti-ICE protestors demonstrate on pedestrian bridge above U.S. 75  WFAARecap: Austin protest disperses after possible tear gas deployed  Austin American-StatesmanProtesters gather in Downtown Austin for demonstrations against ICE  KVUEICE Out For Good protests come to Lufkin  The Lufkin Daily NewsSherman protesters join national ‘ICE Out for Good’ movement  KXII",
    "published date": "Sun, 11 Jan 2026 19:33:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQc25ScjVrS09fTUcxUWl4M1VGM2VzUlQxQTE5OTY5TzhQNXdmMUNFamJ5QWJIeWgtYnFaSHZBTnUyTkVkcHRIaEhoQ2ltQXRDdmx6VHdZU1h2c0hOQUpSZnZfOWtwekhrSEZaTHUzZHVCbm5CcWZRaUNQdUdiajJNcDVfTG9TVFJ5d3NGYkJ3c3dHbEx1SlVMQmMyeUdJOVQxelY5c0hUUmpvdG1YWks2T0dudnJUZGl0MHdOanNTVXdfUEdzdDNSQ3FvNElQTjluZklj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wfaa.com",
      "title": "WFAA"
    }
  },
  {
    "title": "Pennsylvania progressives squeeze Shapiro as he eyes 2028 - Axios",
    "description": "Pennsylvania progressives squeeze Shapiro as he eyes 2028  AxiosPennsylvania Gov. Josh Shapiro launches his reelection bid with bigger plans in mind  CNNShapiro Is Running in 2026. What About 2028?  The DispatchHow much will Shapiro’s potential White House hopes factor in governor’s race?  Pittsburgh Post-GazetteLETTER: Josh Shapiro, a profile in blind political ambition  pottsmerc.com",
    "published date": "Sun, 11 Jan 2026 23:29:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxObldWTmdZeGJhSHh2Yk5odzhMXzVtVHVYM0RHM2VXaWU1eEdZdVZqQXRGMXptb0hFaEQtd1RUcks0ZDAyRjk3dVdETjYtcnNFVFNJZTBIQkJ3VjB6OXlkVEgzZjQwSkFvTjZiaFgwcTBsdmpXYXVocldzeFZTTW1YQzdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "How IVF has led to a record number of single moms in their 40s - NPR",
    "description": "How IVF has led to a record number of single moms in their 40s  NPR",
    "published date": "Mon, 12 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPZzN1VXFQU19ubXU0cFRFSjg5Nm9hS3liUDdnT21MT08yWjFrYm03cUZVZURwSHBILVpCZ1QxOTdyQnc0Rnkta1p2LXNocmtfRzNENlZMb1VxeHY1SEhuYU9GT0VXX1JoUi1ScmJPYzZ1cjVDMTVHWXo0ODRWUGF1VVhPcnFyczZESUptSk5kNzdMcVpqX0xzVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "January 11, 2026 - Letters from an American | Heather Cox Richardson",
    "description": "January 11, 2026  Letters from an American | Heather Cox RichardsonEpstein files: Reps ask judge to appoint monitor to ensure all documents released  CNBCMassie, Khanna ask judge for special master on Epstein files release  The HillLawmakers request court-appointed official to oversee the Epstein files release  PoliticoMost Lawyers in the Manhattan U.S. Attorney’s Office Are on Epstein Duty  The New York Times",
    "published date": "Mon, 12 Jan 2026 06:52:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1SSVQ2VWlhcTE1WHR6Q2h0ZmpfTktUZkFKTzRNbFltdDllQ0EyM1ZBQmxZaklCTG4yV0hMcWoxa0VZaE1Gb0lzM1FEYjRkc3VhSVhBd194dVEzaEJPVWJTQnJKeUFVc1djaGZV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson"
    }
  },
  {
    "title": "U.S. Citizens Are Joining the Military to Protect Undocumented Parents - The New York Times",
    "description": "U.S. Citizens Are Joining the Military to Protect Undocumented Parents  The New York TimesSome migrants are volunteering for military service to save parents from deportation  The IndependentSome migrants are turning to military service to keep their undocumented parents from being deported  AOL.com",
    "published date": "Mon, 12 Jan 2026 11:19:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPby1EZ1h1LUhhVFUyblhPb2czS1JzNjBSd2lnX3daWVEwcHpkbjB0eXo2NHFtZEs3Y1lIVTZPVjN2NnZIalp3UXJZdEtLOEVqYnpyd2N2UUFXN1dkc3BjemM4anB3SGxoRFVSUG1fVm4xd2VuVzdjOHQyTkh5YXFQMU9sWDdhQ3hhNHA0TE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump Labor Department's Chilling Slogan Draws Damning Comparisons - HuffPost",
    "description": "Trump Labor Department's Chilling Slogan Draws Damning Comparisons  HuffPostRock music legend accuses Trump administration of using ‘Nazi mass murder slogan’  PennLive.comKristi Noem ‘One Of Ours, All Of Yours’ Controversy Explained: Podium Photo With Nazi Quote Goes Viral  Times NowTom Morello Shares Administration Quoting Nazis  Alternative NationWhy Is the Department of Labor Posting White Nationalist Propaganda?  Truthout",
    "published date": "Mon, 12 Jan 2026 07:28:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxORWdrd0lXVHVzQlFVN2JLb0lldGwtbEJET1VFVzhueC1YZGxuNTRKNzZnVFYtTVBncVJ3VERzRFc0U0YwNjhGeEVGc0pYMVRxVHZjanZTQnBlaFZDYTN2QlF2T1JubzZEZWtqNXp0VE51dGJGYXlreU1NTFg2bU9Gbl9nZTFGMUdYNHdxZnJBR2TSAZYBQVVfeXFMTXNUVnBRLXNiMGIyNkw1Vi1PQTRpa2p1TXlGbUt4cGZfLXlOUFRCckV0Z1ZLLTlIeHRFd2dieUFJYXIxSVNWeWUtV2NlUGZyei1tSkp6dTVMaGdNWF9xNXNUSWM2U21jTmhQclltT05iNE5uWTNIQV9nTkF6XzZlamJ5QllwbTY3bmJjbUR1d2FqNUVNMWl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "CNBC Daily Open: Iran has more avenues of retaliating against the U.S. — including oil supply - CNBC",
    "description": "CNBC Daily Open: Iran has more avenues of retaliating against the U.S. — including oil supply  CNBCTrump threatens 'strong' military action as Iran protest deaths rise  NPRHow US sanctions crippled lives of Iranians Trump says he wants to ‘help’  Al JazeeraIran Says It Is Prepared for War but Ready to Negotiate After Trump’s Warnings  The New York TimesTrump weighs response to Iran crackdown, Tehran says communication open with US  Reuters",
    "published date": "Mon, 12 Jan 2026 07:34:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPSmY3UVQ3OTVwYlRQNGhCc3Z0MlJtdm81MEFtTy1oQ1duLWhHWXB3Q2dBekxvRlVJUjlUdTJOOEk4a0FuNmdzMDYyemVDLXZORExlWTJIRlY2WGlDaTVOTGV1UW5kU0tnNkVZenZBRV9saWpiVmlIcVJhS3hyWW1qRDlRcEs0VTVTTjllRklnWURnTlY4Z3pGZHR3YllfZUt2aFFLd0wtUjYwNGhfOGJrS3g2NzVJRDBVTHg3c2ZfQjd5YVHSAcgBQVVfeXFMTWNsUUZEd0p0YWFYMnBaVWhrVHo4QVFoS2dHRVBReWNBbWlWcFhhbTBkaTdPbzRiWExhWlF0TGtxS3dHMVdYRG92TjFSY1B5enA3aHdON0p4RGhidzBtZkdLX0dVX3FfZmRoNVB6aTRPdXZsUzEtdzBjSWkxY0FTc2hDTkZEZDRFUU55anlqajJtRTlCUl9CT2hvLWN5aF9XSWREeDF4NmUtc29ZMTNiWUFTaFhQVG1ud2ExdWZFSUR3Vk9jdm9SRDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump’s motorcade in Florida rerouted due to ‘suspicious object’ - AP News",
    "description": "Trump’s motorcade in Florida rerouted due to ‘suspicious object’  AP NewsSecret Service finds suspicious object at Palm Beach airport before Air Force One departure; expect delays  WPTVTrump's motorcade route adjusted after Secret Service finds 'suspicious object' at Palm Beach airport  Fox NewsSuspicious object found near PBIA before Trump's departure  WPBFSecret Service found a 'suspicious object' ahead of Trump's motorcade in Palm Beach  ABC News",
    "published date": "Mon, 12 Jan 2026 02:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPenVzTjhTZTd0SUZnaXdGc1phOGRTeGgxZGc5eHl6TVh0X1hJYnF6WWFVcHVfYlNUdU1wUEhtbnd2ZEYyalZsajF2djNaR2ZBZjBOQjdxbll6M1E0WWpSR1F0UUg0NlBPX2I5Uk13ODZITnM1LVVqT3BXbWRzaW5aS0tpRF9GR3RYa25JLTRKWlJGM3dI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "MAGA Senator Shockingly Advises Trump to ‘Kill’ World Leader - The Daily Beast",
    "description": "MAGA Senator Shockingly Advises Trump to ‘Kill’ World Leader  The Daily BeastTrump poses with ‘Make Iran Great Again’ hat after Maduro abduction  Al JazeeraGraham to Iranian leader: ‘Trump is gonna kill you’  The HillLindsey Graham suggests Trump administration kill Iranian leadership  National News DeskLindsey Graham praises anti-Iranian regime statements  The Jerusalem Post",
    "published date": "Mon, 12 Jan 2026 03:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQR3VRbkVWbDJHRmJqeXRaM1ZhaHM2c2x2YTBCbXRXcUFVQi05cS13b0N4LWVFNzFxSm1CX2F2bEkybmRxMjB3UXJjcGlGZGN1R0VXQU0zMlJPS2hmcy1lVzBRcjVpaVlyZUdSbV9jRGcxMTJhd1NNajlKc2V3Qm9oZTJnRzdMbVBFVTNZSWZ1Z3VUR1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "'WTF': Trump Mocked After Posting 'Completely Insane' New Pic Of Himself - HuffPost",
    "description": "'WTF': Trump Mocked After Posting 'Completely Insane' New Pic Of Himself  HuffPostTrump Refers to Himself as Venezuela’s ‘Acting President’  Time MagazineDonald Trump Declares Himself \"Acting President Of Venezuela\" In Viral Post  NDTVTrump shares fake Wikipedia page calling himself ‘Acting President’ of Venezuela  The IndependentEgomaniac Trump, 79, Gives Himself a Deranged New Job Title  The Daily Beast",
    "published date": "Mon, 12 Jan 2026 06:14:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdm44VjZTZW93aU9MU0VmaTc3U2lEbTNMd3VSTkpUTGZQLXJiNnh5TEQydzFMbjBTeUtOd1JiRFF4OFFhWUZRd2h3V2VYTEp1Nk1yOHlQUWxOYU5KdExudVhjS1pHVHQyWS02YVlCZ2FIU24wdnUxcTMwR1FidXpBLVZLNzJVTVkyS1V1MmdsdXLSAZYBQVVfeXFMTm1pTDFtU2JkLXB5d1lqcXZDOXVSSnhfMzFBaDNOUHFOc1RzV1hxQjVEdEI0VjdIVnVJd3ZpaVZFWDRudy1wdlJndmFrVkwyTUdaSnl1d05SaVVzOE02VVBNV0lkaHo1MFN4V09acnM4aW5uNVoxdFBWbi0xa3gzRGhxZDlEeVktRFFVOFRDR1RuWVBDNmh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "‘What a Stupid Question’: Trump Snaps at Reporter Who Asked If He Thinks Iran Is Taking His Threats Seriously - Currently.com",
    "description": "‘What a Stupid Question’: Trump Snaps at Reporter Who Asked If He Thinks Iran Is Taking His Threats Seriously  Currently.comWhat a stupid question: Trump snaps back at reporter over Iran threat query  India TodayKaroline Leavitt's surprising response as Trump goes after yet another female reporter  Irish StarTrump MOCKS CNN reporter: 'What a STUPID question'  Fox NewsUS President Donald Trump has hilariously shut down a CNN reporter while taking questions on Air Force One.  facebook.com",
    "published date": "Mon, 12 Jan 2026 12:19:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQOTdXcGw4MXY0dndHbE1tNUllQjdKTXZiZEdrSzhhYkN5V2taNVNoS29xV29aVzBRN3F0aGdabkxfWVY1b3RXR2pJNzU1c0sxOTBrQzU1bkl4MDlCZWx0VE1nMEhPWU9ndm1aXzZJalVCSGhxTklqVXpCQkVobzRMbWhWQXpBbXowbVM3TThWeElMUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://currently.att.yahoo.com",
      "title": "Currently.com"
    }
  },
  {
    "title": "‘Brace for impact’: Trump turns fraud into new weapon against blue states - Politico",
    "description": "‘Brace for impact’: Trump turns fraud into new weapon against blue states  PoliticoUS Department of Justice and Dr. Oz targeting California over alleged medical fraud  ABC7 Los AngelesDr. Oz touts federal crackdown on healthcare fraud by ‘foreign influences’ in L.A.  Los Angeles TimesOpinion | Critics draw iffy link between Gavin Newsom's record and Minnesota's food fraud scandal  CalMattersCMS, DOJ ‘Aggressively’ Cracking Down on Hospice Fraud  Hospice News",
    "published date": "Mon, 12 Jan 2026 10:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQRG12NE1sbE53aXBKTmk3RUwxU01HZzhiSEdUTzd2clVKS2tMTGszWnBza2ZyR1RlbktTZktiTGdKbzZqRzdUZWVUeGVIR1FyRnNieDRWc2JQY2ROUG9DRFdKTnpWTGZkb25MaTZTOUZ3ckxabEJFdng0T21sRjJNVkxBd3JucnoxeDh4WlBTUzBIVng1MHViWFVNbjdTWHp0T1Q4NE9seXdjZ2FmYkJZWkxyRzVrSzgtWFoxOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]