[
  {
    "title": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota - The New York Times",
    "description": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota  The New York TimesFederal judge denies request to block ICE surge in Minnesota  BBCJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoJudge denies Minnesota’s request to end ICE surge in Minneapolis  The GuardianFederal judge denies Minnesota's request to temporarily halt Operation Metro Surge  CBS News",
    "published date": "Sat, 31 Jan 2026 20:44:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1JejBjakZheDBSaUJTbm1yRE9MSWZWMV91U21qTHBlWV9IZm9Hem1BelpMVVZnSUxSYVZuVU9renhEZENkaU1JdTEtcTBBN3R4LU1yN2dsNlFGaE1HZk9pWk9abWFfQUpsNHpXZ1A2WGNmMmRudU1CWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge orders release of 5-year-old boy detained by immigration authorities in Minnesota - NBC News",
    "description": "Judge orders release of 5-year-old boy detained by immigration authorities in Minnesota  NBC NewsJudge orders 5-year-old Liam Ramos and his father be released from immigration detention  CNNJudge orders release of 5-year-old Liam Ramos, father from detention in Texas  FOX 9 Minneapolis-St. PaulJudge orders release of 5-year-old detained by ICE in Minneapolis  The Washington PostJudge issues temporary order barring removal of boy, 5, and father who were detained in Minnesota  AP News",
    "published date": "Sat, 31 Jan 2026 20:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVjFvZ0F2eEEzR2phS1NqYWVvcElHRTlPVEFXN0Y3a19xWHgyMHdvUFZtVjJtOWQ5VDdwakZLUVhuVGl5WDNkNmU3RE9KMEZVbTByRk1WTk03UkU1SmtkOXM1UWFlUHMwejUydkxJU1hhc24wdmhjNzk2SzJwN3JKZmlrZzJhWEtBX2hCN2gtNk5VYllBSm93bTdYQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "What have we learned from the newly released Epstein files? - The Guardian",
    "description": "What have we learned from the newly released Epstein files?  The GuardianNew documents reveal the breadth of Jeffrey Epstein’s orbit  PoliticoEpstein files reveal ex-NASCAR driver Brian Vickers' lewd email to sex offender  USA TodayEpstein files: Trump, Howard Lutnick, Steve Tisch among prominent names that appear in latest Justice Department release  CNBCPowerful Men Who Turn Up in the New Batch of Epstein Files  The New York Times",
    "published date": "Sat, 31 Jan 2026 19:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPX3ZTSlVxZWxkMVhMY0JyT3BlN080cTZOY0ZKdGlDdHR6RUlvY0lWcEhGaHQ1aU9BWkFiTnhBWGxWUjNVcWlETVhLSTlIek9OdnQ2TmRWeGVlVUkyRmFTMHRKUU1VQzNaWG13ODVvQjRrUGZnTFR5UGcyblBZZWRQNDBFOUNTejE2aGt3TXNwUHhoc0RyN1JLMUQta1VET0hUaTVxRThEWmRwV3doX0w4cklVd0xST2k0NkFYc2RnT01ERHUtRGtod3JmcjNlQUps?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure - Politico",
    "description": "‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure  Politico‘A hurricane is coming’: Havana prepares people for war as US shuts off Cuba’s oil valve  CNNPresident Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy  Al JazeeraAnger and anguish spread across Cuba as it learns of Trump's tariff threat on those who provide oil  AP NewsTrump Moves to Cut All Oil to Cuba as U.S. Targets Its Government  The New York Times",
    "published date": "Sat, 31 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOMUk1UEtVNnNNMnQxVW1BZFFMaGpmdlZja1N2QWVUVllqcnZOZDBBN2tBS2VFcnRsTm1NS0JSU3E3VlpOUk1fbUg4N2F6REJFRFp6WHNpMWtScUtSci1aa3NaQ29SMkYzTjdnUGFiRWdWbzRUcThldXl2Tnc5LVhocWVmamFZc1Y5SUJQa1c2VzFPaDlkQXBuUkxJdUdQNW1DQTV3TlprVG1Yak53N1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Gregory Bovino reportedly mocked US Minnesota attorney’s Jewish faith - The Guardian",
    "description": "Gregory Bovino reportedly mocked US Minnesota attorney’s Jewish faith  The GuardianBovino Is Said to Have Mocked Prosecutor’s Jewish Faith on Call With Lawyers  The New York TimesUS Border Patrol leader made quip about 'chosen people' after Jewish official wouldn't meet on Shabbat - NYT  The Times of IsraelBreaking News: The Border Patrol leader Greg Bovino mocked the Jewish faith of the U.S. attorney in Minnesota during a call with lawyers, according to several people with knowledge of the conversation.  facebook.comGregory Bovino made disparaging remarks about prosecutor’s Jewish faith, report says  The Independent",
    "published date": "Sat, 31 Jan 2026 18:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPdHBfREdRaGduWGh6TkNKSDZxR3BhaXV0NFl4UlptcUxETkYyR3hnUmFsTERHNmZWNmRsOXFMcDlXTm50Q0pqN0sxMjFZZG93MDRTRGllcVN4N0RIVElacGNZQnIyM2NzbXk1cDhnSVlaWkJjOHA4aGw3Sm9yeER0Z0ZTYWZ4aTlHUnVUVm5STVJQeHh2Z2g1OTNLTllBc1c2Nzlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story. - CBS News",
    "description": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story.  CBS NewsHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNNHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing  The InterceptFormer officials say DHS tactics undermine public trust after series of contradictory statements  ABC NewsTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC News",
    "published date": "Sat, 31 Jan 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSFVTeEJSdkNuemttNTNOSGlISVFDU1RVSWs5S0hBX0Z6ZmdwUU9faVRNNEdJUG95WUVXYnpFMUVxVHVidHBRYmY0bk5uenp1cHpVVVFVaEdHSTl2NGhYWU1EeXR3X09NRnFzQjhHUEJDQVdXdTBvVWIyUUpPUHEtZzdoaEF3MFHSAYwBQVVfeXFMT3ZzbmRkbkpuT0pLVzEwS2hpanhnUFhyaVNXczlERXpjYi16anBMR0ZEelgwRWQxaDhpUF93VndRT1VKUFhWNW5GNHVZSUVydDhsZjNuV3gtNkF4bVhSb0R0ZGRRTzN3S0lMWndjdVRTQ09GSnNWNWxQMkVrd0E1OEhFTVR1dmxmVTE0T0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "US Senate passes Trump-backed government funding deal to avert partial shutdown - Euronews.com",
    "description": "US Senate passes Trump-backed government funding deal to avert partial shutdown  Euronews.comSenate passes $1.2T government funding deal — but a brief shutdown is certain  PoliticoHouse minority leader says Republicans can’t rely on Democrats to pass funding bill, raising fears of longer shutdown  CNNFacing Immigration Backlash, Trump Called Schumer to Cut a Deal  The New York TimesUS government partly shuts down over homeland security funding  The Guardian",
    "published date": "Sat, 31 Jan 2026 13:06:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOaTVwYWtCbEN2c0loamh4MUJhM1NEeUhhUlBZcHpDUEtoRnRscXp2Tk1QSDJaNVRLSE1ZUjBKdnJZWlpSYU1CYkllU09CWXhCY004bTF6YU9PQVJpakdrV2N2OVVsVDdDX0xPSG9UMXlac0NKMW1hTWVCTXY5U21LRVhqRmE2aHZNY2t5OUdZX0RmNFRDeXg5RWJyYlpObUZOSDdZZEV1elZKUGhrcFNLTVZ6N2JOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement - WCVB",
    "description": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement  WCVBWhat to Know About Anti-ICE Protests This Weekend  The New York TimesAustin businesses lock doors, shoppers swear off big box stores, in national ICE protest  KXAN AustinThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The GuardianUS protesters hold nationwide strike against Trump’s immigration policies  Al Jazeera",
    "published date": "Sat, 31 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5EYWtjMy1aMERJNmdVN0NyaXpLVEdibF9IR0x1ZTFVVW5lU0Nya0JId2IxOHdaTFF1dzNyYzlhbmFzcDBKQjhJTVREVjZyZlgtTEEwT2pGd1lEN2NpNXExV245ZFRDQ3JPX3hkelptZ2Jmd0phdUI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcvb.com",
      "title": "WCVB"
    }
  },
  {
    "title": "‘Backing down isn’t an option’: Minnesota ICE shootings mobilize Americans to join ICE observer groups - The Guardian",
    "description": "‘Backing down isn’t an option’: Minnesota ICE shootings mobilize Americans to join ICE observer groups  The GuardianThousands of new ICE watchers hit the streets after two killings  The Washington PostAttorneys urge people to know their rights amid reports of abuses by federal agents  5 EYEWITNESS NEWSHundreds gather for constitutional observer training in Moorhead  InForumKnow your rights  The Austin Bulldog",
    "published date": "Sat, 31 Jan 2026 17:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPd1FkTGJiS3lhSEFIV3JVdmdjOFB1ekhtQ0REZEc1eTBYaVhPVTYxdjZ1MFlpcU8tM3N3S1Z0QWJDYnBQbzRyV25pQzRLTlZnMklVdTQ0WVNfeFZvYXh3eTJ5emZ0ekIxamZOUnhJNk5sbVFwUURTRk5OeWd2RVlYUV9oWUhTcDVvM2ZjMjJsa05odG8wMnlLaUM0ZnBzZnhCaFN4eUNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Updated snow totals for southeastern Virginia: Forecast down - The Virginian-Pilot",
    "description": "Updated snow totals for southeastern Virginia: Forecast down  The Virginian-PilotLive updates: Nor’easter ‘bomb cyclone’ hammers Carolinas with record snow, intense winds  FOX WeatherWinter Storm Hits the Carolinas  The New York TimesSnowfall continues with blistering cold  WJHLHow much snow has fallen so far in North Carolina? Check live updating totals here  WXII",
    "published date": "Sat, 31 Jan 2026 18:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE94SjRwYWRJYlJoTUpOVEFIQ2t5UDRZVDhsV2JNRHdrMFJMOTFNd2NJcU54clJqeUxwblU5VkdGWkJ3eWJBemtSNVc3TE5mSzFaNUhqanU0MG15bGlCSDhiTllmNTIwUlMzd3pfcHFQdFZaVFZPUkEzZWNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pilotonline.com",
      "title": "The Virginian-Pilot"
    }
  },
  {
    "title": "Basic Services in Minneapolis Are Straining Under ICE Presence and Protests - The Wall Street Journal",
    "description": "Basic Services in Minneapolis Are Straining Under ICE Presence and Protests  The Wall Street JournalI'm a business owner in Minneapolis working 16-hour shifts so my staff can stay home to avoid ICE  Business InsiderMinnesota Businesses Resisted ICE, and Now Face DHS Audits  Bloomberg.comThe ICE surge has disrupted business. Minnesota’s top economic official is ‘very concerned.’  Star TribuneList of Twin Cities businesses holding fundraisers amid ICE surge  Bring Me The News",
    "published date": "Sat, 31 Jan 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPcHdpeTlUZDdSZ2Y5ZzkxWF9tQjVLeHl5U2prRFk3Z1doamw5b3VYVG0xbjJZcTQzVEZMU1JuZi1iRENmYkxwLTNZbE9YaUo0QUJYcFN4d2FJTmtBOGU2bGIzUDhmUXFvMFVTM0c4UUFHTnRScERTLXYxRnU3OERqZXk3cEk4TWlBUGVvWER4MGhlY0g2REVuU25RSUZlMDhNbllwdFBXWWlYS1FWWDZhVTJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism” - Deadline",
    "description": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism”  DeadlineDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesLemon blasts corporate media that ‘bend the knee’ to Trump after arrest  The HillFormer CNN anchor Don Lemon appears in court after being arrested over protest at Minnesota church service  CBS NewsDon Lemon vows to fight charges in First Amendment showdown with Trump  Politico",
    "published date": "Sat, 31 Jan 2026 03:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNZ3cxNS1HejliRHNzWXY2Mk9xb0F3ZWpJM1RacEJvaDVOeE1oaVFWLXZYSGZJVDlYSm1qUlNWeUFPdTlPNXlfOG1SdmN1RWNzSUhYYVAzWk4xc1FWbHVnOXBLUXlpcWJ0T3lCaGt5aFNvd2hocGJJdk03WUlhbTVxdVlNaW9UNWJ3bVhjaWlpLUNDUFViMGNLY3NVWFVGMW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Search for survivors halted after Massachusetts fishing boat lost at sea - The Guardian",
    "description": "Search for survivors halted after Massachusetts fishing boat lost at sea  The GuardianCoast Guard suspends search for missing crew after boat sinks off Massachusetts  BBCUS Coast Guard calls off search for Gloucester fishing vessel with 7 aboard  The Boston GlobeTV star fisherman, crew missing off Massachusetts coast after boat sinks in dangerous winter — leaving 1 dead  New York PostSearch Suspended for 6 Missing in Boat Off the Coast of Massachusetts  The New York Times",
    "published date": "Sat, 31 Jan 2026 15:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeU5uSXZoUkxVdmRuRzFqdzdCcmdTXzVPQWVTbU14SFpkSE12RkozU0J3WElXU0pyYlNJSkJ2ODRFY1F4dHpqOWhKTk1QMWJxR3k5dmdaVjJUUENyeDNfUDY1dnFfcndULWlTTWNMQjRHMGh6U21ncWRpTVRFRldzaU0taVgxMTByOTdUX2hNZ2RTd0ZXX05ERHFjNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "ICE halted its surge in Maine. The state might not be quick to forget. - Politico",
    "description": "ICE halted its surge in Maine. The state might not be quick to forget.  PoliticoICE ceases enhanced operations in Maine after Collins presses Noem  The HillHundreds of students walk out of Maine classrooms to protest ICE  WGMEICE arrests more than 200 illegal aliens during 1 week of Maine operation  ICE | U.S. Immigration and Customs Enforcement (.gov)Collins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York Times",
    "published date": "Sat, 31 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPd0hWaV8wTWJKX3lhUzV6d1ROck1aQm0td3pwTmExbFVwQ0hRUGtkbURqSTZnZjdtM3V0NFUwbThSU2R2cnpPbnQtTHNlT2drZTZqcll2THhLakY0N2k5TXM1SjV5Y3lURUZXcVhsV2kzYzE2aXhtTjhZZ1p4UFdFSA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Top Iranian official says progress made towards launching negotiations with the U.S. - Axios",
    "description": "Top Iranian official says progress made towards launching negotiations with the U.S.  AxiosIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNNTrump says Iran is ‘talking to us’ amid regional de-escalation efforts  France 24Iran seeks to avert US military action with talks in Ankara  The GuardianIran says ready for ‘fair’ talks with US but not ‘under shadow of threats’  Al Jazeera",
    "published date": "Sat, 31 Jan 2026 19:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE8wSUVsVEZyQ1B1MGRBRGdRX1l6SWxmNE5sUHFKTkpkajRvck4wUXNGQzdWWWw0VDhEVW1fQU1Vb2FKX2lyMDE1VnhlYWxSSFdaTWpYN2F5MmZ4TElrOEw4dnRCeU5CY0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump continues to defend Homan, Noem amid immigration enforcement backlash - ABC News",
    "description": "Trump continues to defend Homan, Noem amid immigration enforcement backlash  ABC NewsNoem says her response to Pretti shooting may have been wrong  PoliticoTrump’s New Method of Humiliation  The AtlanticWhy Democrats won't rush to force Noem impeachment vote  AxiosTrump backs Noem amid criticism, resignation calls  The Hill",
    "published date": "Sat, 31 Jan 2026 18:23:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUms1OUN0U3NGaUMxb3FIdExlTHZUS194WFdpbndLT3pTYTZCVERhVHFZMHJSVTdUVGhFcW0tN0N5TXVuUHlQNnFMOElXenpGRWpmZ3o0SHBzWFJobnp1eVJVR0VabmljdnJmQ1E2RFdPMXFmRFFTMjBteG1DeGdwbjB3dTVVX184dldjdno1VG00VENkemh1SEt1dm1YVmNRZDhjdkxaY1dyVi0zaW9uOUE5Z9IBuAFBVV95cUxQem5fMnE1cFdnaG5xOEVIeER6T2ZRSC02VVJtTUZpX0JjT3JWMUdfWE5FN0lja1NiTEM1R0c2V0FnbTk2cS1kOGJBZkl5Snd1XzYzQjdSbUdrRnc1WnNNc2RlcERTdTM1RVhXMGhla1Z4cHZ2RVZGbGh1QVNxaFZDbnN6bGNaeDJ0U3h6ck53bl9qZTNZTW1FY1poTWd3eG1ORUxzZnM0VWhzZFp3QVJaaXBaSTM0a2NK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Chicago snow today: More lake-effect snow hits area, impacting road conditions; over 100 flights canceled at O'Hare Airport - ABC7 Chicago",
    "description": "Chicago snow today: More lake-effect snow hits area, impacting road conditions; over 100 flights canceled at O'Hare Airport  ABC7 ChicagoBurst of potentially heavy lake effect snow to continue wobbling along Illinois/Indiana shoreline through Saturday morning  WGN-TVGround stop at O'Hare, delays at both airports as lake-effect snow brings several inches to Chicago area  Chicago Sun-TimesSnow totals soar in northwest Indiana after powerful lake-effect burst  NBC 5 ChicagoChicago weather: More lake effect snow for parts of the area  FOX 32 Chicago",
    "published date": "Sat, 31 Jan 2026 14:58:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQdkR3LXh0bDJUdzh1WUlfOWNOY3pCdGtyekVkeTlRby1FN0tnZVVLcHlRRVlIUzJlaEZXcDNhNGF1NW5scHIwVTZaeGFSaXBrRUg3VDE0azFBa1BHTTNMdXdIQjlwbmI5NmR0dTR1MXBLY0lTQnFvZVA5QUJmcWtBWVAtX3luWFQwOE5ablpCSXZ1d2dIWm5RT2Z3MXN0bnJiZnVMRFJudVFHQlF2czJV0gG0AUFVX3lxTFBTc2thZmhwQ0xZU2J4d1hCS2kyczBfQzNCbHM1LXVGd0Yyemt4UUJFdEVqZ09wUnN2VlpGUWFxS05MLV9HdmN2TjJMc3FrT0IzZU5EdTY2Q1p0YTRLb3hweEt5WnR4bTI2MHdxZWFwLWRfUFBzV1NhQThPb1oyVVIwazRndVByUkdOZkx0MkY1YUdRYkJnYkNvQzF5QktCeWljYmpxWmJfczhKcjBIWXdmNENEMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "Denmark: Thousands take part in veteran anti-Trump protest - dw.com",
    "description": "Denmark: Thousands take part in veteran anti-Trump protest  dw.com‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments  The New York TimesUS Embassy in Copenhagen removes flags honoring fallen Danish soldiers, angering veterans  CNNDanish veterans protest outside U.S. Embassy over Greenland, combat contributions  CBS NewsDanish veterans protest outside US Embassy over Trump administration's Greenland plans  ABC News",
    "published date": "Sat, 31 Jan 2026 15:51:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZkJLdXNJemJFLVpWZ0R1eWtWUUJ0TzF1SVI1c2prZE8xUV9wUHpkR1h1U1hEUU5lcGZwaEs1b0g0ZDI0QlJvMzA3T1U2U3pVRDRyM0ZpTWY5VGpwU3c4YlNUb0l2QzBqallPVm5YSENxT2dPSFAxZXdoVGhoc3MxYXlibDQzYUtuSHdfRGx4ZmQteXNt0gGUAUFVX3lxTE5HS3htWVVZbDFFdVo3VTg0ZG9YSGw0V2F1cy1PVmJURnBNMXNmTW1GakNJXzFmWFhXOGxvSGgtMXVNaEh2LVVicExXVWJVMUt3OWQxcFhuUS1UbFlVaGFuMS1BLTJGTXB3UXk2ekpuRFd5X0ZEMTdVcF94X1ZQaUtfNEhOYWVsRVRPY2JraGwwalhsV1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Chicago Orders Police to Document Potentially Illegal Federal Immigration Tactics - The New York Times",
    "description": "Chicago Orders Police to Document Potentially Illegal Federal Immigration Tactics  The New York TimesChicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct  CNNMayor Johnson signs executive order directing CPD to document and investigate misconduct by federal agents  WGN-TVChicago mayor tells police to probe allegations of illegal activity by immigration agents  ReutersMayor Brandon Johnson tells DC crowd he will ‘set up a pathway’ to prosecute Border Patrol Cmdr. Gregory Bovino  Chicago Tribune",
    "published date": "Sat, 31 Jan 2026 18:03:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOckppckVTelAwT3pNVkdFYmRlMHg2blk0dldET0RxSDhLR2NBaTE2S1o4bDI0TGd0QkhqWWV1ZjJjQzF3UEppWmlDYndwLVRHTllxY2dBVlplZ0FKdFI0bHRLbFZWSUMxY1BNc3lhSldrM3ZLclBqazctTFBXMFhVeXJIaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms - CNN",
    "description": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNTulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington Post‘It’s a Five-Alarm Fire’  The AtlanticTulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub  NBC NewsJustice Department defends Tulsi Gabbard’s presence at Atlanta election search  Politico",
    "published date": "Sat, 31 Jan 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeFhfU0xOTFg5Q0thZWhCWDFzNm5qZzc1YzNSSkxVVl9OMFhKY3YyeFhabnI3UFJSZGVfbW5zcWg5dWtFYVNucVdUc3dJVG51aWFMM3VPOENSejZGYkk5WEw1czVFVU5idS10S1lUeWJ1amhlbEx2TDlyWnR0NGhsTWhiaVNIbDFHUVBvR1BhVktMUTMwU0xBZWdwNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Houston runoff sets up next Democratic generational fight - Politico",
    "description": "Houston runoff sets up next Democratic generational fight  PoliticoA US House special election in Texas is set to narrow the GOP majority even further  CNNHouse GOP majority on the brink as all-Democrat Texas special congressional election underway  Fox NewsWhat to expect in Texas' 18th Congressional District special runoff election  PBSDistrict 18 voters head to the polls in pivotal runoff election to fill seat left vacant after Sylvester Turner's death  ABC13 Houston",
    "published date": "Sat, 31 Jan 2026 12:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5kLW1pbzgzSC1WSERoRUZka1IyRTN4V2VLRXN6U3N1andUUmJkMDBWdGlUZGUwSXhtalV2Ul92djR2ckE5NTl4SGJfYnMwMjJfT2lWUU10bUxpMXhwbnJKOG9qODlOTmN4cHExYThYVWIwSk41REpObUVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The West’s water war arrives in Washington - Politico",
    "description": "The West’s water war arrives in Washington  PoliticoGovernors Dive Into an Impasse Over Colorado River Water Use  The New York TimesWhat happened at the governors summit on the Colorado River? Here's what California said  CalMattersFate of Colorado River hangs in balance as political battle brews  The Washington PostWhat's at stake as Utah, 6 other states seek new Colorado River deal  KSL.com",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdW1TMnJxNDQyTmZNVVFxd2dxek5GTDhXNzNPakhCWVhvVFdCaFJRT0p2eld4TXhlNFZKMmE2Vm9BWEFDUFEwNkNBTFFkVjExRzlkYkR0aGU1YlJKU0xuZkt0ZE16cEdsVngzOTZNUzluNVhqdHdvUERUd1Y1eTVZOTN3cmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "LIVE UPDATES: Snow falls across north Georgia, temperatures dropping tonight - WSB-TV",
    "description": "LIVE UPDATES: Snow falls across north Georgia, temperatures dropping tonight  WSB-TVSnow falling in North Georgia, parts of metro Atlanta  AJC.comLIVE UPDATES: Traffic conditions worsen east of Atlanta  FOX 5 AtlantaWeather Impact Alert | Snow arrives overnight as metro Atlanta drops below freezing for 60+ hours this weekend  11Alive.comGeorgia under state of emergency as winter storm nears metro Atlanta  WABE",
    "published date": "Sat, 31 Jan 2026 16:28:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxORlZfdXVGT1ZBRTZJRmdvRWM1MnBlTDZlQlBaUUdkWGtPel9zeW0xaklDOFpVZEQ5QWxYNFIzNmpUdGR0YmJFb2p3TVdyYVM0TTlWdmxCdHdUQ1lHb29ZLVF3QnBrNjNQU1E2NHVGalE3S3BHdXJsQWVQa0d4cVByZEN0cU12Z2hySDhrNENOONIBowFBVV95cUxOZ3NiRlpmVnotTkNmYWNJeTlmRksxUW90Wk1GbUNKYmRwV2U2RV9LZkw1UXZaYU9mRGJoenZMek5vSktiRmQyRmhTeFY3d05EWTBlZHBaYkJFVWtaUUUxdFBwUnhjcHZTQUJ6UExJUlRMSkpIWlRrVTZtcEJFRFZ3eG16YWRQOHBJampOVF85bmRGbEl1ZUdxTjRMSllxN0hPTjVF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsbtv.com",
      "title": "WSB-TV"
    }
  },
  {
    "title": "Explosions reported in Iran, Israel denies involvement - Euronews.com",
    "description": "Explosions reported in Iran, Israel denies involvement  Euronews.comBlast rips through building in Iranian port city of Bandar Abbas, state media says  CNNGas leak caused blast in Iran's Bandar Abbas, Iranian media say  ReutersExplosions in Iran Spread Jitters and Rumors Amid Anticipation of Attacks  The New York TimesFive killed in gas explosions in Iran, officials say  BBC",
    "published date": "Sat, 31 Jan 2026 13:29:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE42T1RydXdDa2FPZWNjdHRjZVNyVG56LUlyMG96TXEzT2hybFowOERaTWo4bmpNeVVJenJHODJsNHpfXzMtd1N2TFlNWnUtOHJMemtuci1MXzZhYkhrakw4a2dHeGtnSGp5bm5tVFJrRDI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "What We Saw in Minneapolis - ProPublica",
    "description": "What We Saw in Minneapolis  ProPublicaPhotos: Thousands once again protest ICE in Minneapolis and across the U.S. : The Picture Show  NPRJanuary 30, 2026 - Minnesota immigration and nationwide protest updates  CNNLIVE UPDATES | ICE in MN: Alex Pretti memorial ride in Mpls, Operation Metro Surge allowed to continue  FOX 9 Minneapolis-St. PaulAnti-ICE protests take place nationwide following fatal shootings in Minneapolis  ABC News",
    "published date": "Sat, 31 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1xMXd4dTE5aVIyaFp0dC1vV2t0cmswdmV1cl9xSEJDN01LRVpfMWVsUE9oU2paUmg2OG1HMkhwbEVleDktTGtySDMyV1RoaHM1X1A2dWxiU0Z5ZFQwZUpqNXlSS1FNdjZhaDBiQWlMU2MtLURxWG40RTdPeUlJanc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Venezuela announces amnesty bill that could lead to release of political prisoners - NPR",
    "description": "Venezuela announces amnesty bill that could lead to release of political prisoners  NPRVenezuela's acting president announces amnesty bill that could lead to mass release of political prisoners  NBC NewsVenezuela plans amnesty law for political prisoners and closure of notorious prison  CNNVenezuela releases all known American detainees after Maduro's capture and government takeover  Fox NewsVenezuelan regime to close dreaded Helicoide prison, announces amnesty bill  Miami Herald",
    "published date": "Sat, 31 Jan 2026 06:55:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5TMVVhelh2Z1FjenFERjZtRXU1djdLOHlfb2dSNWtOdmZuLXdaOHJyR1dlb2JRTzhqaS1DeHlOcWszVW13bUgxMW5HQkgtUHFTVFlSTTFaVURxOTNjZG53cmlwLXpCcFEydnVLOXVhZE5ZOG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Hundreds of Texas public school students walk out to protest ICE killings - The Texas Tribune",
    "description": "Hundreds of Texas public school students walk out to protest ICE killings  The Texas Tribune'This isn't America anymore': Thousands rally against ICE in SF's Dolores Park  SFGATEBusinesses close, students walk out as SF joins national ICE protest and strike  The San Francisco StandardStudents Walk Out Across Orange County Protesting ICE Raids  Voice of OC'We're speaking up:' Over 100 Penn HS students walk out to protest ICE  South Bend Tribune",
    "published date": "Sat, 31 Jan 2026 03:24:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQkR4Sk4yWDBvYV9SaDJKRGVwM0JEQ3hJR1l2TTBJV2d1RFFqUDR4bkNHVGVpSG5wdjZNaV9BalNUT1pRRUJwWF9uY1o3dURSVlFCMEcwUDJ3bk91T05WSV80ZWU4RmV0dzlza2pmYnNnRU5nM1JCbEVIUG1xdlJrMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Intense nor'easter takes aim at the Carolinas as Northeast dodges major storm - FOX Weather",
    "description": "Intense nor'easter takes aim at the Carolinas as Northeast dodges major storm  FOX WeatherThe biggest snow in years is falling in the Southeast, triggering hundreds of accidents on slick roads  CNNWinter Storm Blanketing Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelA bomb cyclone is forecast to hit the Southeast this weekend, with snow, wind and flooding. Here are the possible impacts and timing.  YahooAnother winter storm threatens to drop more snow as dangerous cold lingers  ABC News",
    "published date": "Sat, 31 Jan 2026 01:35:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1Xdk1BbUtMX1htYXcxU0dOQnFjV2dMd3RrYlZyVFgyMjBjRHNYaXlFc3pwb3lXMm5fekZWUWlIN3pvQmF5SHpWTTQwYzVjcjdJZU40SGJuX2VUVGZaU01vTGE0VQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxweather.com",
      "title": "FOX Weather"
    }
  },
  {
    "title": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "description": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest  ABC7 Los AngelesPhotos: Anti-ICE protests gets heated on ‘National Shutdown’ day  Los Angeles TimesCitywide tactical alert issues after anti-ICE protesters clash with federal officers in downtown LA  NBC Los AngelesLAPD arrests violent agitators after protests erupt outside federal detention center in Los Angeles  Fox NewsProtesters clash with federal agents in downtown Los Angeles  CBS News",
    "published date": "Sat, 31 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown - The New York Times",
    "description": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown  The New York Times‘Trust Has Been Breached’  The AtlanticTrump signals retreat on immigration even as he doubles down  MS NOWWhat’s next for the federal government, immigration enforcement and Minnesota?  KTTC | Rochester, MNBorder Czar Tom Homan says shift in strategy will lead to a drawdown of fed agents in Minneapolis  ABC News",
    "published date": "Sat, 31 Jan 2026 01:07:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMWY0ODZtbkZtak5yZVNxVy1DQkcxX2NyMDVXRE1FVGNpN3AwMG90UU9Ob1BVQ0VUVXI5M2luLW1PNXduTVhVNHE4R0MxVzZiaE1oaXRlRHlocnpicGFXQlRVZjRjTUQ0OFRJRGRYSzNOOFJFcE5Xa2RzbzdpYWpDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "How Fear of ICE Upended Life in One Minnesota School District - The New York Times",
    "description": "How Fear of ICE Upended Life in One Minnesota School District  The New York TimesHow federal immigration activity is affecting Minnesota schools  MPR NewsICE’s Assault on a Minnesota School District  The New YorkerFormer Manitobans living in Minnesota wracked with fear, disgust as turmoil continues to unfold  Winnipeg Free PressICE Is Circling Minnesota Schools, Looking For Children to Take  HuffPost",
    "published date": "Sat, 31 Jan 2026 10:02:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOanFFZ09TejNKbVpjM3BJNm5JTmVWM2g4YXNaRkZRZS1ibEJaWlBBbFU2MUlNOEJIelZBQTY3LVR0ZU5Hczh2a1NMNEwwNGJ1eTRvM1NCN2QxNXhONzJMdWY0Zk5vR1Ixb0FUQlpHUkNMRldDS2VsWTJUZTBEQkZ0R01ZWEpETV9S?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C. - The Washington Post",
    "description": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C.  The Washington PostWEATHER ALERT CONTINUES: Dangerously Cold With Wind Chills Below Zero  WBFFBitter cold grips DC region this weekend but a freeze reprieve is coming  WTOPDC region dodges another round of snow, but bitter cold and wind chill remain this weekend  FOX 5 DCDC Forecast | Frigid temperatures last through Monday morning with wicked wind chills on the way  WUSA9",
    "published date": "Sat, 31 Jan 2026 05:25:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVndZMUd4WC1sQkFiZDhYSUJaY3JyOTU4WjA4alB6azJudTYxdlcxazFmbmw4UGYtajl0Z0RwdVdsRWt1NWw1WHl6QVVDZDU2UFVqMzlKYVRMTF9UeUt4a2VGRE10b19TT19YMWQzT0dERTVNU1VSWm5TZ0FHeUIxV1NkQ1Jrc3RPdXZJLWJTcVB1MTEwOE5QcDlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Jewish seniors offer to hide carers as 350,000 Haitians face deportation from US - The Times of Israel",
    "description": "Jewish seniors offer to hide carers as 350,000 Haitians face deportation from US  The Times of IsraelICE eyeing Ohio next, where it is expected to target Haitian immigrants  MS NOWMiami’s Haitian Community Braces for Deportations  The New YorkerSpringfield braces for 30-day targeted ICE surge after Haitian TPS ends  Springfield News-SunSen. Moreno says Haitians in Ohio should have self-deported already  The Statehouse News Bureau",
    "published date": "Sat, 31 Jan 2026 06:56:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPc0dWcVczV292RkgwWVpsRS1WZjg4bHprQW5LWVc5Q2JvSVNLNVkxLUg2N29LMy1YM0k5N005cDBINGgyNkxBdmh5R0wyeHkxMDZNRFZWZlZ5VkdxNDVCNS1Pb01VSmFDV0U2VnlFaW1faTNzTk9MMG1NRl9zbnp0RW9FeTRsNlVscXRIYmVQY2NzN1ZDTmV1Znh6Y3FXVy1XMGFaVnNnN3NHNHY4bXo40gG0AUFVX3lxTE5haW9xcUxmd29aZVBET19rS196NkNrTWlIYjhWRHRBbkx3NEZCTi1Lc0hXRi1yaTZETE5BRFNnS2FRM25COEhTTEV3UENWR3ZTYkljTk5XYUdQaUc2OFhTeDFscjdrTmZNYmhKRUJsUzNYblV6a1hOaUpMUmctVU1kOV9OcnlGZmhETW84MlRpWXh3UmYzN284aDNhVG1weW5YeUxCVVJKOHhzOVhIa2FfNEFQVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response - Politico",
    "description": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response  PoliticoGun Activists Bridle at Suggestion That Pistol Justified Killing  The New York TimesThe Second Amendment Was Never Meant for Everyone  The InterceptWhy the Minneapolis killings have driven a wedge between Trump and pro-gun groups  The GuardianA Breakdown of the American Idea  The Atlantic",
    "published date": "Sat, 31 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPbTExR1hNVXdpV1g5OTZvQ291Z2h2WjRpRkN5a3d2cVp1c3lIcmM0bWR3VWtFaG1wUW4zYU03VXUtYUZHUUQwbG9qbUtfNzhuVGNBQjBSSEpsTzFFc2RGSGlNbnV2UVEwNDlWU1VVcVc2UnBpM05OaEd2X0FfSmVIZFcyTkNsVEtLY0UwcTdNWHV3dXlaLWFtMWFnVkJiQUJTZi1RNXB1aTB5VEQtazZfU1NDRWw5dHFqcElmcEpiMUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach - NPR",
    "description": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach  NPRDemonstrators in Milan protest ICE unit at Winter Olympics  ESPNAnti-ICE protests erupt in Milan ahead of Winter Olympics over planned agent deployment  Fox NewsWhy is ICE at 2026 Winter Olympics? Explaining the agency’s dual functions  The New York TimesICE at Olympics angers Milan mayor, who says agency’s image is ‘terrible’  The Washington Post",
    "published date": "Sat, 31 Jan 2026 20:04:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNa2N2TVBSQzZnTDB5SDRjLUZmd0t3OUQ3NHgycEtadGVQdDFFdlVaZE5TZXFsNHlJeGZZM2E4dVhWMVRuZmRaRS1yY1F5aDdMc1NHbWh5UTUxaEtzcElPeXRxQXRoMHZpa2dleG5lRmcxaTdmbDVfMHZ6UW1FQWJCZnVZLXJxMkswd0xocm1laTJQeHNzVFU4TXljRDFSYlNuS1JHVDJEcnh2dVJQa3BDWmV2UkdwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls - Politico",
    "description": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls  PoliticoOpinion | What Pam Bondi's demand for Minnesota's voter rolls is really about  MS NOWRead Bondi’s Letter to Minnesota’s Governor  The New York TimesBondi Links Minneapolis Violence to Voter Data  Brennan Center for JusticeGOP Opens Up Its Midterm Elections Playbook in Minnesota  The American Prospect",
    "published date": "Sat, 31 Jan 2026 19:36:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMG9kWm9STGxkdEo4WVlZcGpfZUVxOVlLd1I2WUMxM3VKLXlZcVdZOHQ4S1dTT29Ma0ZuenFiNXBLVHJ0XzVEZFJIWjhhOVl3dVRTT1BvN2JEU216SGpvVEhlc3p4WDIwT2owSG03S0J3S0QtUndnbXppTm1Hc2V1WFp3ZGtYSzByQlBQZjRQaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The Justice Department has opened a federal civil rights probe into the killing of Alex Pretti - AP News",
    "description": "The Justice Department has opened a federal civil rights probe into the killing of Alex Pretti  AP NewsView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 18:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQc1NiRkRvYk13TG1FTzRrZnRmNWppUmZUNEFWSWhadVA4cE12ckRxdU9jTXRCN1l0T0szaGJZcmxsR21KVm1iRXVNNFNVUUl2dGl5cDFIdVRZTEZqemNyR3JIVEVvWXE1VmZTVG9rVDR6Vkxna1lzanQ1SXpMUllJVkFYMk1heENzVjd3V3k0bGlUdEM5SThKM0hfdVREb09yenlYSXl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Federal judge drops murder rap in UnitedHealthcare CEO case - dw.com",
    "description": "Federal judge drops murder rap in UnitedHealthcare CEO case  dw.comLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersLuigi Mangione unexpectedly summoned to court next week  ABC7 ChicagoLuigi Mangione will not face the death penalty, federal judge rules  CNNFederal Judge Drops Death Penalty Charge Against Luigi Mangione  The New York Times",
    "published date": "Sat, 31 Jan 2026 12:17:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQUnNuS3JKV3lTSUk3Q1NGdm5tZVVmUS1pZUxpVUw3bGlzbVZtVUZVcm9jdE40bzBiMDRyNFpqSkkwX2tlVjdzVE9SMkVfdjRNZ0VobmlVY2JvRjFBY3d1UHJ5b29tM3A2TkhmdV9GaGZwTWxKQk1udXlTY2FVOXF2NExRdWpGVldpN0lyQmFEbnhyLVdOOGpR0gGXAUFVX3lxTFAwQkpQVTVNYkRINnNhcXhzb1NMT3BEM2kzNjRDdmdkeDgzZ1k5TGtoZGNwdGNaams2aVdFel91b3F0eXBVYk13ZkhVY1lRclN0Rl9Ba2hUREVZMFV3VHBKY2xfRFRQR0g4OVdqdmhpZTdHdno4Y1VHbUNNWWhjLTMxaFF5czdndUdBbFdrYlgxZF9qekJZTTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Trump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran. - The Wall Street Journal",
    "description": "Trump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran.  The Wall Street JournalHere’s what military equipment the US has positioned in the Middle East as Trump considers an Iran strike  CNNTrump says Gulf allies kept in dark as US negotiates with Iran: 'Cant' tell them the plan'  Fox NewsIran Renews Threat to Strike Israel as US Attack Fears Grow  Bloomberg.comWar Threats and Ambiguous Evidence: Trump Again Confronts Iran  The New York Times",
    "published date": "Sat, 31 Jan 2026 01:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQSDQyYWZzbWwtYW1JbUhUdlZyQWRtU2NGdTAwb2ZydzR3QUFNaS1zdE1XdkJVWC03a2pQOVRQTmljcFhiTHpqOC1udy1ncC01akg4Nkd3NllteUFGQm9qNGpUckdOS3BPUWhnZTQ3Wm1kRFpqYVNDV0hNenJHeklLd2syLTdvTnZXVkRmbnhLamd0SGYxR2o1VDFpREhxcFNYMkFEald5SHpSMU0zNzIyQ2tURV85WjVJZTZrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues - The New York Times",
    "description": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues  The New York TimesDemocratic governors scramble to build a legal wall against Trump’s deportation agenda  PoliticoHochul campaign quickly weaponizes immigrant announcement against Blakeman  City & State New YorkNew York governor proposes bill to ban local law enforcement from being deputized by ICE  ReutersAlbany Police Chief Brendan Cox Full Comments in New York City  WRGB",
    "published date": "Fri, 30 Jan 2026 22:52:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9HVW9OVEhpSTZ1RElEZzBRb1ZfUWNXWldMaTBpQUNPakNkRFlYZEJnWVlSVGRqamRsd2xLNnlmY0hFN002MkZDa3l5TjFlUExmcGdkUVJTd2lnc1JTa0N1eEtJOVVrNFY2NG1ZRzk5TTk0dE1CVW1Nd2pVT2tQMUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump’s immigration agenda is colliding with a midterms reality - Politico",
    "description": "Trump’s immigration agenda is colliding with a midterms reality  PoliticoTrump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.  The New York TimesTrump is scared of the politics of ICE. And it’s showing.  CNNThe government’s winter of discontent  Federal News NetworkSenate Republicans try to regain footing on immigration after Minneapolis blowback  The Hill",
    "published date": "Sat, 31 Jan 2026 00:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOaXVZcVdOTVJKaEtzR29IUldvQ3dpdU0tbktIUDVNSUhyZzRSeWJzUTRyNHdsSGl4VGtMSUx3dTN5NE9hanZrY21MMGIwbVRXVzg0LUFBWlRXcDZEZzI3V2lEMm11T1pPLXJIbHp1XzNRRDdPV2hleWhnVjhWZURDb2c0ak01VE85cWlJazIycFZHNTBPVmtDQjlQbWk0a3VDSTFQWVZucHlubXllRlVWZWlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say - Business Insider",
    "description": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say  Business InsiderTrump says he’s decertifying Canada-made aircraft and threatens 50% tariffs  CNNTrump’s threats to Canadian jets raise questions about a key customer: The Pentagon  Breaking DefenseCanada says jet dispute can be resolved after Bombardier shares fall on Trump threat  ReutersTrump Threatens Canadian-Built Aircraft with 50% Tariffs and Decertification  The New York Times",
    "published date": "Fri, 30 Jan 2026 20:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNZlRjOTltUDUxMzY2SHhGRGVYZERlWk5JSndCR1g0Wm1DeUNLWmF2aDB3WGdPZTVpakhMQ2p2S1NhNDRrWkN1RkNWa0NBZWpDdlpKOHFhWms5OVR0eUo3eFBlSzIyXzFuekZ6anpWYlA1UWJUSGpYX0UzZ3U3ZFRXV00yQkgxVXZPdWx3SmVUcE9kbWtQa1A0UFdVWmpUX2dRMnlmZ2NWSDdTWWJiMWRr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "CBP employee in Minnesota charged after reportedly being found ‘covered in vomit’ in car - The Guardian",
    "description": "CBP employee in Minnesota charged after reportedly being found ‘covered in vomit’ in car  The GuardianBorder Patrol Employee Arrested in Minnesota After Being Found Passed Out in Car and ‘Covered in Vomit’  YahooBorder Patrol employee found ‘covered in vomit’ in St. Paul, charged with drunk driving  Sahan JournalBorder Patrol agent arrested for DWI in St. Paul  kare11.comBorder Patrol agent is arrested, accused of drunken driving in Twin Cities  Star Tribune",
    "published date": "Sat, 31 Jan 2026 00:07:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPSzg3NnlKaDJNY3d3V3hzd0hWem41LVNyUmZ3d1lCWWQ2VTVzV0IzdmxFZEVfc2R6NlJyU3ZHZnV6TGgwalpZWmdXU0FiXzU0d3VMMlc0ZUJDMXIzUlBtNUFpdlJ5MlR1VkRnTml0by1YZm1sTUI5bzMtWVF1bmJGRGJRWE1tZmp4cTgxLU10SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "This Minneapolis family has been in hiding for weeks, fearful of being deported - NBC News",
    "description": "This Minneapolis family has been in hiding for weeks, fearful of being deported  NBC NewsMothers of massive resistance: PTA members organize Minneapolis relief efforts  MinnPostNonprofit puts together care kits for Minnesota families facing uncertainty  CBS News'It's terrifying': Dominicans in Minneapolis on the front lines of ICE surge  Global Sisters ReportAmid ICE Raids, MN Immigrant Parents Plan for Children’s Care  The Imprint",
    "published date": "Sat, 31 Jan 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQLWh0Nlc0UTFjcElpbjJudDd1YzVyWDFUUTk1dWVvWTE5QU5LcGpHMXVmQmdhalpmSFIzemRUd01mY3JqQWQ2ZWh5RmRpRkw5V3B1SmwwZk01T25JZ2pidEU5ZzV6UnpIYWNCMHdvSFFfQ3p0czhYSXJNRGo0NGJKNGNUalFUbGplUm5BUHlqaS1CQUoxSUxhMkpVeC1tdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  }
]