[
  {
    "title": "Nancy Guthrie live updates as person of interest is released, home searched in Rio Rico, Arizona - CBS News",
    "description": "Nancy Guthrie live updates as person of interest is released, home searched in Rio Rico, Arizona  CBS NewsLive updates: Person released after questioning as search for Nancy Guthrie continues  CNNMan Who Was Detained in Nancy Guthrie’s Disappearance Is Released  The New York TimesNew activity in crypto wallet tied to Nancy Guthrie ransom note  AZ FamilyNancy Guthrie live updates: Person detained for questioning in her disappearance, police say  Yahoo",
    "published date": "Wed, 11 Feb 2026 10:11:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQY2l0VlpvdktqYVd4UE1TYzJZOFBwMnFCZ0ljT2hNdEtLX1ZOS3ZIWGxTeHVkdklNMmpqdzhnQW5WM2lJYURNVUV1bzBzTGo0VDJTOERYQ2dqVXRvaUkwa0xIelk0cHlXYmlTNkNpN29zM0x0MEtEalNPam1QZ0lqQmNFekgza0F4VnfSAY8BQVVfeXFMTTM0TnhqRV9wU3p1WGtSaC1JTTE2NXQ1Y1JBM2xNNjU5cE85UzR5UVB3M1oyUEZNTjB3TERpVTI1bVNnSU4zUnBqUlZoTTFVSXVEMGRzaTE3TWlzTU1wZk03eUtHRm11dVJobXl6UG4xVm51YldzcjlsdW5PUVhtaF9yYVVXZVdXbWFqNHkwMWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "F.A.A. Halts All Flights at El Paso Airport for 10 Days - The New York Times",
    "description": "F.A.A. Halts All Flights at El Paso Airport for 10 Days  The New York TimesFAA grounds all flights to and from El Paso until Feb. 20  KFOXFAA Halts Operation At El Paso Airport For 10 Days—Cites ‘Security Reasons’  ForbesWithout explanation, FAA closes El Paso and New Mexico airspace for 10 days, cites national defense  El Paso MattersAll flights at El Paso airport in Texas halted for 10 days for 'security reasons,' FAA says  NBC News",
    "published date": "Wed, 11 Feb 2026 08:49:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9rQUV3cVlmZ1BTdFN4UVRPb3p0TWJnS3BRXzJJeVVRODgxNUlJNVVBRC1sYWhCd1JlVUdUbEhlTDY0NkF3Ulo1RHM2WE1uWDRydnc0dlNrSUVjWHR3WjM2M0ZHRUFHdFE5WVV2OGJFV0g3NmItcEg1VWFDaTM0bXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Border Patrol agents say 'time to get aggressive' in footage that contradicts claims against Marimar Martinez - Chicago Sun-Times",
    "description": "Border Patrol agents say 'time to get aggressive' in footage that contradicts claims against Marimar Martinez  Chicago Sun-TimesOpinion | We Have to Face What ICE Has Done to Us  The New York TimesMarimar Martinez shooting: Video released of Border Patrol shooting in Chicago  ABC7 ChicagoChicago Woman Shot 5 Times By Border Patrol Plans To Sue Feds, Release Previously Sealed Evidence  Block Club ChicagoBodycam video shows scene of Border Patrol agent's shooting of Chicago woman Marimar Martinez  CBS News",
    "published date": "Wed, 11 Feb 2026 02:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPaDdzM0R0YjRuMHA5VWdmMzlPZVY5X0VZS2VjTmZkaE0xLVBvdzN3Ykh4Z0xIN1FaOW9HendmNFlTRlhEQmVkSjJMaEZqZjdaTGtCakpOZFhXY0lvTzNnZEpqYWdOSHR5NW1zMFRuZzRxT1J1NGhWaFpxczNIQjFzLU4yS3pYaUhtWnhGSEZnTFR6UzNEdG9tUDdCY0hQZ2lmNHhkcklxQjd5YUlPbE8xSGV3TC1zT2hXdnMzS1h0bjdjamVoMmpycUkwdlFzYjI0d2c1M29XenJlT3Z5UzRXOVQwRW9rUExWbGFIbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://chicago.suntimes.com",
      "title": "Chicago Sun-Times"
    }
  },
  {
    "title": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up - The New York Times",
    "description": "‘No Reason He Should Have Died’: Alex Pretti’s Parents Open Up  The New York TimesA Minnesotan nurse saved my refugee family’s life. Four decades on, we watched the news together in horror  The GuardianPHOTOS: Anti-ICE Demonstration in Downtown Athens  The Red & BlackAlex Pretti was trying to help. I can't move on from that. | Opinion  USA TodayAlex Pretti's parents remember son in New York Times interview  Yahoo",
    "published date": "Wed, 11 Feb 2026 01:08:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ZSGRhTjdtMGVYamwyaDJhTkZNMlkxU20wYV9ydmJrZHNmY1Q0MHFMOV9zMXFUUTZWM0ZycDU4UnAxb2dLdUVmYmpXc05tUkx6TFFJeVllR19FWUlTMl9oQ3ZBWExlSHFYRjRaWFN1NnN4YmtMY1d5VEtpZ3U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "D.C. grand jury declines to indict six Democratic lawmakers - The Washington Post",
    "description": "D.C. grand jury declines to indict six Democratic lawmakers  The Washington PostGrand Jury Rebuffs Justice Dept. Attempt to Indict 6 Democrats in Congress  The New York TimesLawmakers React After Trump Administration Fails to Indict Democrats Over ‘Illegal Orders’ Video  Time MagazineDC grand jury declines to indict Sens. Kelly, Slotkin for seditious conspiracy: MS Now  CNBCFederal prosecutors reportedly failed to secure indictments against six Democratic lawmakers over US military video – as it happened  The Guardian",
    "published date": "Wed, 11 Feb 2026 05:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPYlNfYTNoWUstdmd2Sk9oelp3Zkg4SWl6R2l0cVo0c2M3aXVlLTUyNHh0NGw3emZqSWZTSHVMNE9lcW1HdGVibC1uNGp3dlRhT2R1OWxkNE5ydm5ZQ002Zm1kZ2hkVmoyUlJEeFU2ZlZSLVNFUHJjeV9tMGRfOV8tQmc4OHpwSnNDZHV5eVo1X25jdC12a2EtNGxR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Late Night Mines Trump’s Million Mentions in the Epstein Files - The New York Times",
    "description": "Late Night Mines Trump’s Million Mentions in the Epstein Files  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldWhat the Trump team claimed vs. what the Epstein files show  CNNEx-police chief said Trump told him in 2006 'everyone' knew of Epstein's behaviour  BBCHalf of Americans think Donald Trump was involved in Jeffrey Epstein's alleged crimes  YouGov",
    "published date": "Wed, 11 Feb 2026 06:31:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPeFlLRUM0VkpyczlmMS0yZGdqa0VDMFdVMVpaMkJHYmtSbzF4LWtZYzdlRV9RLXVZZ2lLSU5Da2NGWnZNNFVkaDl4eU4xSFdocV84cXdGOXVUMF9Zd1hTZlJaNUtpdGlJSFpOOTd1M0puWi10UXF3a3N0d3JaajNNSzdSNmVNcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims - NPR",
    "description": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims  NPRGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesBreaking down the evidence DOJ used to justify searching a Fulton County elections office  CNNFormer Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit  CNBCFBI documents show what led to raid of Georgia elections office  PBS",
    "published date": "Wed, 11 Feb 2026 00:37:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOempoOWp2elFncUJyS1VfWG9NTEV1aVFvN1pvV09jc1I5c3VQZ2lwV3I2bXBPY3RfVXpMTFlSTWtDelRsVjYyRzBibFhZSWtJNHFNV1hBQmF4NHpIQTVQdTRvdlhMSnRpejBZMTlwYkhsODZLSVRFOEdHazBDN3Q4Um1aRTF5b2UwSHo2bzAtTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs - CNN",
    "description": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs  CNNHouse set to rebuke Trump’s tariffs  PoliticoHouse Defeats Republican Bid to Block Votes on Trump’s Tariffs  The New York TimesHouse Republicans revolt over GOP’s attempt to hand Trump Congress’ tariff authority  MS NOWGOP rebels rebuke Trump tariffs, blocking ban on snap repeal votes  The Hill",
    "published date": "Wed, 11 Feb 2026 04:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOMklDZ2gtRkYxS252dkhFVG56Q3dDdV9FYUY3ZVZOVi1iczNJRWJLWURJV2lONlZCRENic3J4ODhlcmNQNzIzLWI4QXlaUUhxNmJlU3FYV3VSNFNMbTZnWS1CYU1yV0FHcVVPUVcwaDA5VlBTSXpJTmpBbUxIeThoY3VB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed - NBC News",
    "description": "Minnesota gubernatorial candidate suspends his campaign after his daughter is found fatally stabbed  NBC NewsHusband charged with murder of St. Cloud politician's daughter  St. Cloud TimesDaughter of Former St. Cloud Council Member Jeff Johnson Killed in Stabbing  KNSIMinnesota GOP governor candidate’s daughter killed in St. Cloud stabbing  Fox NewsCharges filed against suspect in fatal stabbing of daughter of Minnesota governor candidate  MPR News",
    "published date": "Tue, 10 Feb 2026 20:45:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNV0ZfRFhCMjlEUkNWbS0yRVZSSXZlQ1FlOG04TXFWTVI3czdxRTkxbHZLc1VDQ3FLZ1N4cWFTU2RvZjRsZlQ2dlAtVFl1Ny1ac1JfVmFKY1VlVVg3MFhUeXppc1BKZUxQZDQtZUk3LWJac3hwNFN5Z1hiTGZaeUI1bkJrMk1XMXltbjI0ZzR4SGhHc2hJbUdYUFN2UDFKNjBqd0s4UW9wYjBmMUJTUmVJdERvdEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Democratic governors pledge to boycott White House events after a Trump snub - Politico",
    "description": "Democratic governors pledge to boycott White House events after a Trump snub  PoliticoAnnual governors' gathering with White House unraveling after Trump excludes Democrats  NPRGovernors to skip Trump meeting after White House invited only Republicans, source says  ReutersGov. Moore calls NGA dinner snub 'disrespectful'; Rep. Harris pushes back  WBFFGovernors won’t hold Trump meeting after only Republicans invited  The Hill",
    "published date": "Tue, 10 Feb 2026 21:53:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOV3dZSmZ4Qk4wM3M5NXFzT1dyZmY5cUQ2M2plMTl0cVlNeGwtU1dCUE5CckdDS0ljM29iUmxnX2NXd3pkbzBhY0JUZmdRbV90bU9NbmpVVzJ4b2J4dFNFaFQ5ZjYzVy1LZDdYVEttcDhZWWhYRENIMEhhRXhBTW0tVTFlelhmRkFlVzNYSw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Who are the six men named in the unredacted Epstein files? - The Guardian",
    "description": "Who are the six men named in the unredacted Epstein files?  The GuardianTrump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC NewsHouse Dem identifies ‘wealthy, powerful men’ DOJ redacted in Epstein files  PoliticoJustice Department un-redacts more names in Epstein files after pressure from lawmakers  CNN",
    "published date": "Tue, 10 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcXZzUG8tUUdadGx5MU90ZWx2emRnRHpMLXkzcWdfQm1BNUlsUS01NHZ6VEt0SzI2LXNaZ0MwMm92d0RvWGtLYnZ0R1JSejhCYXdwckJMbm1MbUIyb0JwbjFvR19hb1FIRHBpb0wtVmlPamkwVE9RSW8tbzZXZDExU1A2eFdScWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump lights a fresh fuse with Canada over new bridge - Axios",
    "description": "Trump lights a fresh fuse with Canada over new bridge  AxiosBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressReport: Ambassador Bridge owner met with White House before Trump’s threat to block new bridge  ClickOnDetroit | WDIV Local 4",
    "published date": "Tue, 10 Feb 2026 23:24:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNUWZMNHFnWF9vQ0ZtUDRIXzFhTG1zS2FPV1BnMGs2V2dDOUwyNmpRT2ZFM0pfVkpZY2l2RWViVDA3d2QtOVppazZnUGtSQUowZzV5c1V2Ym9NTHU0c1JXZW9VcXpvRjE2Q0FmOGh5SlhCemRmVldPVVVhVlFzYkM3SHJvRHQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Don Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case - The New York Times",
    "description": "Don Lemon Hires Federal Prosecutor Joseph H. Thompson in Minneapolis Church Protest Case  The New York TimesFormer Minnesota federal prosecutors launch private defense firm  MPR NewsDon Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe  CNNFormer federal prosecutor Joe Thompson joins Don Lemon’s defense team in church protest case  Star TribuneDon Lemon hires ex-U.S. prosecutor who quit amid concerns over investigation into Renee Good's killing  NBC News",
    "published date": "Tue, 10 Feb 2026 22:09:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPbzN3amVoM1dCYUFoOFJYZ3JoNklpWVI1ekJPU0lQQ2pDT1pyMDRHeTlvTGJGdjYxcll5c2luTlJfNzd6WFhxdHVFVXpkNTFKWFBwcE5HdFNxeEVrVU9zcElBOEZKcWlwRndfbnl4aHFHLVVKa1IzcnlmYUZESXdGUEhWbUs5RE1CYk5hZWZlMDM4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Lutnick confirms an island lunch with Epstein while insisting they ‘did not have any relationship’ - CNN",
    "description": "Lutnick confirms an island lunch with Epstein while insisting they ‘did not have any relationship’  CNNLutnick’s grilling shows Trump a glimpse of a grim possible future  CNNLutnick Acknowledges Traveling to Epstein’s Island  The New York TimesTrump Commerce Sec. Lutnick admits visiting Epstein island during family vacation  CNBCLutnick and Epstein were in business together, Epstein files show  CBS News",
    "published date": "Tue, 10 Feb 2026 18:06:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZmQyMHpudWJwNEpZTWJjc3NZcEdPaDBteUxiaXlJbmlaMU5fR3M5cTEtY1FLZDBsaXNJWFZZNEFMYnU4ak0taEo3d1c3V2xrb3d2VXhqUzJaOUhqdUxTMUUySHFBOGV3aWxMalMySURwQUlJTGdqM3dYaWRyU0tRbHBzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Top 5 takeaways from the House immigration oversight hearing - NPR",
    "description": "Top 5 takeaways from the House immigration oversight hearing  NPRICE and Homeland Security officials testify before Congress  BBCTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoICE chief forcefully defends deportation campaign as scrutiny mounts  The Washington Post",
    "published date": "Tue, 10 Feb 2026 21:37:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNeHZZdFRjTkVXNUhGNVgyVzB6aUpKZTdRejRqcUp1RktMVmRBSThuU1puSmduMjlrUjJDMU5jNF9aS2x2N3UzRXlHdmFnOWUyNHJ5S041ZmExNlFKSTVpdlNzV1BQTWI0VlRTd3ZTUExZa3F0OHpFSWc5dGVZZElxV01WOUJ3LUlQTElRMlpubFFNcFNtdkptNjVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Sherrill endorses Mejia in special election for her old House seat - New Jersey Globe",
    "description": "Sherrill endorses Mejia in special election for her old House seat  New Jersey GlobeAnalilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage  CNNWhat's next in New Jersey's special election: From the Politics Desk  NBC NewsAIPAC Strategy Backfires as Progressive Underdog Wins Key House Race in New Jersey  The InterceptProgressive backed by Sanders, AOC pulls off upset ballot box shocker in Democratic congressional primary  Fox News",
    "published date": "Tue, 10 Feb 2026 17:43:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQWHdYZEgxYmdTaXVDcTF6akoteExrWjhmYTBlYXl3WVhSa0xadkNWQXg2UHpSbDJGR3A0UURoMXVHTkhGRmsxdFJzbVdNWEpDelQwWV9VTmM2VElENkRJanphTzFLRmxTek52ekZFTXhGRjktS2QwMm1VU05CU1NLUmZQeTl3OHF3QWsySUN2SldFUTFWQkc1N1V5R2x6Zy1yd1dRcmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "New Jersey Globe"
    }
  },
  {
    "title": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it - Politico",
    "description": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it  PoliticoPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesNew York Officials to Re-Raise Pride Flag Removed From LGBT Monument  Time MagazineTrump administration removes LGBTQ+ Pride flag from Stonewall national monument  The GuardianTrump admin removes Pride flag from Stonewall National Monument  CNN",
    "published date": "Tue, 10 Feb 2026 18:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOHJGakFVUFN1TzFTS2VYT2JoUGRxTy1YcVpKZkZLMmt0ZWNrUEx0bWh4aDBZNHpyRGxJNGJvN3ViX3FxMk9hSml3MDNCa0FBbzN2blBNVGFyYmM0bkxJSjhxa0VieHpielpONEFvV0hiT0NhQWVXRVZUdFNaWlItUDVzcU1EZkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]