[
  {
    "title": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting - The New York Times",
    "description": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York TimesWhy this legal expert says the Minnesota and Illinois immigration lawsuits ‘are close to completely meritless’  CNNGov. Tim Walz to address ongoing ICE presence in Minnesota  kare11.com‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time MagazineMinnesota ICE lawsuit: Judge allows ICE to continue operation amid legal arguments  FOX 9 Minneapolis-St. Paul",
    "published date": "Thu, 15 Jan 2026 00:13:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBMRWVnc0NHM2tQRjNldXZtUmxzQVkxakh0VFRNZEJXY1JTM0NiUUg2MExJeVVWUGVYUTlVZHJXODE4aVUzcnZ2U0J0Wmo4WkRITERQSFJUZl9GUnRjMDUtS2dwOE0tSEFBMTI4Z2ZWWmhGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Vance casts tiebreaking vote to kill Venezuela war powers resolution - ABC News",
    "description": "Vance casts tiebreaking vote to kill Venezuela war powers resolution  ABC NewsRepublicans Block Effort to Check Trump’s Power in Venezuela  The New York TimesSenate blocks Venezuela war powers bill after Vance breaks deadlock  The Washington PostSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNNGOP scrambles to kill Venezuela war powers resolution  Politico",
    "published date": "Thu, 15 Jan 2026 00:10:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPMzVnaWF0SEEtREdKalpNTEZpemZNX0FGQU5Tck1ZemhHWVZZaU95T3BfUEgxazUwRHk1TGtWc1Y4TEd2aFl2enEtbWI5QnVneWVaQ0tGWWZvSl9tRVBrd2JXMWctNmZsZVNWYngtdnNXUm5jckE0U0VZdjhzUHI0Uy1kWk9qOV9JQUFmYjYzcGNLZjVEU2lvRXc0dXZ5d0ppd2FjYnBCTkfSAa4BQVVfeXFMT1U1QnVZOFJDbG9IMWV1eU5VS2dYSlRVT2FKc3g5STMzTENCSjNKZ3ZYNEhUQ0NXdUZwTW03dXIxXzAyZmxXSTJrbklpcUFZVXBBbng5dVhTUHEybFQta2xadUpKSXdFbHZ5V2VxeHRNTnkxd21DOUF4WkVOX2ExVHpZZUM5OXI0OUtMZE5xb05lTkhvRDlmNFFyNzN5TGE4OHZMRnBpQkhPTmp4VWRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "5 takeaways from new polls of the Minneapolis ICE shooting - CNN",
    "description": "5 takeaways from new polls of the Minneapolis ICE shooting  CNNSenate backs Donald Trump in Venezuela resolution as Vance casts tie-breaking vote – live  The GuardianMajority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University PollMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGov46 percent in new poll support abolishing ICE, 43 percent oppose  The Hill",
    "published date": "Wed, 14 Jan 2026 21:27:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcWZnLWEzRDBOeFVGMXIxNmZ4MHVCZ1ZER2Y2bDBzZDNjN2loUVhQX1FOS1FidVE2WXgtRkhPcE10NzdPdUllTVFuaEkwM1FoaEZhSzB6aFRVMzJlOEpZOFk2Y1dVQ0ZNU2M2UmxPV0Fsam1CbEItZUhZRlV1aXdvTVh2Z012U2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "‘She’s a terrific person’: Trump praises Maduro loyalist leading Venezuela - Politico",
    "description": "‘She’s a terrific person’: Trump praises Maduro loyalist leading Venezuela  PoliticoVenezuela’s acting president touts ‘new political moment,’ hints at further release of political prisoners  Fox NewsThe Two Faces of Venezuela’s Regime Smile at the U.S. and Glower at Home  The Wall Street JournalVenezuela’s acting president vows to continue releasing prisoners detained under Maduro  AP NewsTrump calls Venezuela’s interim president 'a terrific person' after phone call  France 24",
    "published date": "Wed, 14 Jan 2026 23:59:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNSnhvLTFBV2NoVDBENEE0TXBnaENheXVhbmNKQzMzUnVUdXh6RFFjWHJQcXRNcG1UZ09OSFptV0pHcU56QTZHMU9McjM5Ul90Sjl0U2tSUWxweG9rSm1qdS1fX05MakVRYi1DWHp5amtycWI0azBXOTQzV1RBV1RsZFhzZUp5aDBK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump says he has been told killing of protesters in Iran ‘has stopped’ - Al Jazeera",
    "description": "Trump says he has been told killing of protesters in Iran ‘has stopped’  Al JazeeraLive updates: More than 2,400 protesters killed in Iran as Trump warns against executions  CNNTrump would want military action in Iran to be swift and decisive, sources say  NBC NewsAnalysis: Trump Supports Protesters in Iran, but Not in Minneapolis  The New York TimesIran protests: Trump says he's been told the 'killing' has stopped, executions won't occur  ABC News",
    "published date": "Wed, 14 Jan 2026 23:28:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPYUtGVDI5YVBZZzc3aTFrY1YxSFdtUGs2MU40TFIwTWtUMTNyT3U3QWYxZUZxZVJ5SVhlNEdwXzF5NlpoUEpKYkZCaXRYeGR3QVR3UjA0V05hOXg5ZDl0cnh4Yy1fUHBuSm9RNzdWOHVncGh6ZkRqa0xHQXB1RFVWVUlWdWJOLXQ2N0VVUlZHTDFsQlRGS3kwV0xnbDJmV2EyYUZnajZMekZBbDhscHpV0gG0AUFVX3lxTFBKN3RybmxMQURVLXZrakU4OWFuUmluWGl0TEVnZWFNUTBGbE9oV3NJLVFseEpRR1dNMnhJTDhnSXhyM2RUZmVVc1VrR1hWbnFHZnI4bV85SHBZWWhHZXZVb1JnY3NtTHZ0R1EyUGJLeWQtNDNiRnJFMnZaMjZBQ3I4SkxGWUlUR2s2S1FSaEVlaXVsWmlmbFNNMnlWdTdZblpac3VYWFBMYTluT0h2Z1NNeUlVSw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Donations pour in for suspended Ford worker who heckled Trump - The Detroit News",
    "description": "Donations pour in for suspended Ford worker who heckled Trump  The Detroit NewsTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNUAW member speaks out after being suspended for interaction with President Trump  CBS NewsSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The GuardianTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington Post",
    "published date": "Wed, 14 Jan 2026 20:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQLUpGU1BhaHNmbTNTQk5EMkxzNURVcktJVTdYSnBlZmRZTFMwOUd0VERUbHlhYlNoN19jVmxydlNPZ3VUZ3RiaTNzQUYtbDFucTFTZEhVQW4wOWNUcGJxbGV1MHRUT3BRUUdfLUs0Q1lLT3pHaVJrX0VkdGNYUVZIZGtoXzR4LVNLN3ZNeXNVQ0FDckh1bEMwOU1fc3hueWdoMmJGR2xON1dFLW9WQk9UX3p5OVZaR19HV2ZQdnlOX3JWakt5dUIzS0ZKNkhmU2hrNFVfb1FB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.detroitnews.com",
      "title": "The Detroit News"
    }
  },
  {
    "title": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights - Slate",
    "description": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights  SlateInside the SCOTUS hearing bound to be a turning point in the culture war over trans athletes in women's sports  Fox NewsSupreme Court appears likely to uphold transgender athlete bans  SCOTUSblogKetanji Brown Jackson Was One of the Few Justices to Recognize the Trans Sports Cases Are About Real People  Slate5 takeaways from the Supreme Court’s showdown over transgender athletes  Politico",
    "published date": "Wed, 14 Jan 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOUljOGY0b25hbjB0eU9KcXZva0VYR08xbkp2U0NrdC1LOGhPanhCemg1dTdYbllVUTh5eUEtVkZYaUZZQ2M2a1RVVWFfbGJvbDdwSkNmSEkzeEJoa0pXa2NLSnMtN19WbWZRcFRTUmFJYnlyOWVFZEJSM0xQVV9OY2hCNU9YeGVfdEVvR2pzNU5FSUhyTXdqV25FYXJWZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Iran signals plans for fast trials and executions while promising retaliation against US, Israel - AP News",
    "description": "Iran signals plans for fast trials and executions while promising retaliation against US, Israel  AP NewsOpinion | The People of Iran Deserve the World’s Support  The New York TimesIranians abroad wait for news from loved ones amid communications blackout  The Washington PostIran signals it will hold fast trials and executions for protesters  PBSOver 12,000 feared dead after Iran protests, as video shows bodies lined up at morgue  CBS News",
    "published date": "Wed, 14 Jan 2026 23:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQX2FtTXRTRTg5ZFJ1SGc5cmo0UnR1azJoajVrUUticTJXSV9MYzQzbUJsdnVMTTloZWEwSU51R2RFOTZwN1VleUViUjNTdzYxcF80enE0bWFIc0dKN05wWVlCd1RTSXlzejAyVXd1WUNDekcyaFR5MUFSNVRGbGl6U3MtT0hxNFZRSGViUVBWbXBJcDRqS1JoMjlQeUxZX1c4ZEFaWHdPOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump Cuts $2 Billion in Federal Funding for Mental Health and Substance Abuse Services - The New York Times",
    "description": "Trump Cuts $2 Billion in Federal Funding for Mental Health and Substance Abuse Services  The New York TimesTrump administration sends letter wiping out addiction, mental health grants  NPR‘Callous and cruel:’ Mass. agencies reeling from $1.9 billion Trump cuts to addiction, mental health grants  The Boston GlobeNational Council Statement on Cuts by the Substance Abuse and Mental Health Services Administration  National Council for Mental Wellbeing‘People will die’: Trump administration cancels up to $1.9bn for substance use and mental health  The Guardian",
    "published date": "Wed, 14 Jan 2026 22:44:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5VTXR6M0k4NDUzOFRWYjRmdUNoclpsVjJMWG9fbVpUS3pCWEg1NklBdnQ1amFpTWE1TUJnV1lfaW5pNTNMUERaNU9WNWYyRGJtUE1EVGpUdjZITDQxZlFTTDVaa04xVVpvZDF1QnhjLWhBWnll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam - Axios",
    "description": "\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosDemocratic lawmakers file articles of impeachment against Kristi Noem  The GuardianRep. Pingree signs on to articles of impeachment against DHS Secretary Kristi Noem  WGMEIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT Mirror",
    "published date": "Wed, 14 Jan 2026 23:13:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUVMxLWIzMFh1S2hoYkVHa0tQYmQybDh3MHlDTVd4Y3JFNTV5bTVEc2xFb2FUemo1QmNYMmtEcHlfSnc3Q2xDUXFoM1NYaHVQQ1RnNTdLSFUzR1NpWS0tbFF4SEVmQ0xCOFZ4ME90aFBhWHJfMm9wSjZ4SlhuUlV5TE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Candidates have legal standing to challenge election laws, the Supreme Court rules - NPR",
    "description": "Candidates have legal standing to challenge election laws, the Supreme Court rules  NPRSupreme Court Sides With Conservative Congressman in Illinois Election Rules Challenge  The New York TimesSupreme Court revives GOP congressman’s absentee ballot suit that could spur more election litigation  CNNSupreme Court says candidates can challenge vote counting rules  PoliticoJackson says colleagues gave democracy short shrift in election-related ruling  MS NOW",
    "published date": "Wed, 14 Jan 2026 19:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNcC1kbTRPdERxbnVsV3IyQ2cwUkNmbGpOVWRWR1F0S3l5XzdzeC1INHI5ekNBclFWMEJkNlJEQkV1SDNjc3pnZjBOV05SSEhSWlBrc3duMFlEWEg5X2VqcUxKWDN0VlVLeHVuRHhFYkdGQUVieVFrYVVGczRxYnV4RTAyWElIQjVmRUNEeGJZVlB2TXlpd3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Federal court upholds California’s new congressional districts in a victory for Democrats - Los Angeles Times",
    "description": "Federal court upholds California’s new congressional districts in a victory for Democrats  Los Angeles TimesFederal Judges Uphold California’s New Congressional Maps  The New York TimesProp 50: appeals court rejects Republican bid to block California maps  The GuardianIn a win for Democrats, court allows California's redistricting plan to proceed  NPRFederal judges allow California congressional map to stand  Politico",
    "published date": "Thu, 15 Jan 2026 00:37:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPSS1KSC13eUtrQ1RZaUEzQUE5WXdwWnpSYklXUkl2TExtY19iM0xtb0JRdEhFTHBJYkpnek1PZWo3bU1KZF9WdTlrLVBQUlZmMGp2US1NcUUzTGQtWFdvWlRqN1FhTXNjdWRZVkNUTTlJV1NPalFRMUdHd3dBOC10NTdSWjBTYUliUkUwSUJYb2ZvYTlnbDROcmYwTmdiX2FpUG1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Democratic Rep. Jason Crow contacted by Justice Department after video to troops - CBS News",
    "description": "Democratic Rep. Jason Crow contacted by Justice Department after video to troops  CBS NewsSenator Says Prosecutors Are Investigating Her After Video About Illegal Orders  The New York TimesJason Crow says prosecutors contacted him over military video on refusing illegal orders  NBC NewsDemocrat Elissa Slotkin says she is under investigation for video on illegal orders  NPRMichigan senator says she is being investigated for imploring US troops to refuse illegal orders  The Guardian",
    "published date": "Wed, 14 Jan 2026 20:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNTEVfRWtPSUNLbGpDMEpMVDlBT0FDblFNMlV3dTRBNTBQakUwRldDcHBDVDk3SFB1OFAwRVYtbF9TS2hkUlVTYkZyVkpWWFJEb2czVk9IYTRKQWNlUkZ5MVNRUy1BbC1McVVvalVOWi0yUUdDN3czQzZ2ZTdWODFELUZpSnVqdjgtbWo0ajdkY1BFRmZ1WHk1Y0hyeUFIXzE1ekg3RGtB0gGrAUFVX3lxTE45Sk8wTHBUNTB1dmtrblpaYXotX2RubEpWeXh3M2hxYmVFMWFtQ01Ibm9DWlo3WTZ2eExnd2ZXcjV2eXRqMGkwMzlEV3BWN01kcG1IeTAzdW9xbW1UTXcxcDdEUE1ISW1rQnljVkJ6cHVKbVplRzBCSUxyVmUyMjRta2ZNdWVxRUlQVEZoSDZrS01RbnlKM2g3a3I3VTNQMVBTUUNVcFZRZmM2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Hillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry - Politico",
    "description": "Hillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry  PoliticoBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesRep. Robin Kelly on Articles of Impeachment Against Secy. Noem  C-SPANRepublicans vow to hold Bill Clinton in contempt as he skips Epstein testimony  BBCHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The Guardian",
    "published date": "Wed, 14 Jan 2026 16:20:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPZ0FBTVVEUVgyT2VtMlZkVnRBZWxVZERoWG1tVGtGbzZIN2wzNFpCY1NlRzJNUGRzWThmYmEyMFBQbGd2VWlOMTZsVVNSQ3puUHhMSTRnbjdCTVRNQlhTTlZiLVhtNFE5WXVpRW5tdWtxYW4xY1BtdnFuMkJfZlREY2Y5cjRIRWNuUkpKTHpwZVZhZ0VZZ1hkZy1ST05MWWR4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Scientists call another near-record hot year a 'warning shot' from a shifting climate - NPR",
    "description": "Scientists call another near-record hot year a 'warning shot' from a shifting climate  NPR2025 was the third-hottest year ever recorded on Earth, data shows  NBC NewsHow Hot Was Your Town Last Year? Look Up Where You Live.  The New York Times2025 was Earth's 3rd-warmest year as climate impacts intensify  ABC News2025 is fourth warmest on record in US, third hottest globally  USA Today",
    "published date": "Wed, 14 Jan 2026 18:38:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPS3hFZi1QdE1JUGwtMWtnUEF1RFpNY19mWjRfa1NQQ0x2cHQwNHVFdnVlRnh2ZnlJU0JXZ2UzM3p2blZOQzV6ZDZLMUF0R1loMExSYWlNbkZ6VGNJSGJyYnZyX0ZObUZEckVhd29DbHo5Q1dTYndFV1NVZkRRRjFUbXV3LXFoVmNlS0ZhOXNGVjVZT2EyYThrbWJ2SnYtOEt3YnlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted? - The New York Times",
    "description": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted?  The New York TimesNew documents shed light on Renee Good’s ties to ICE monitoring efforts in Minneapolis  CNN'Retraumatized' after George Floyd, activists march for Renee Good  USA TodayTrump: Renee Good’s actions before fatal shooting ‘were pretty tough’  Yahoo'Beautiful light of our family': Renee Good’s family reveals new details about morning she was killed by ICE  USA Today",
    "published date": "Wed, 14 Jan 2026 21:30:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOR0VEVE9mRHpWaFdCcEFnQWtfcjZkU19Xck91eTRXU25VakpFRXNoMElDdGhtRFFZOTA5SkkwV3RLZG1jZW5rZ0NBaGZ0VnpyUGJPSDVFWGNkV2JadlFYNlExQkxLRTFuNGlzNU9IcVh6WWlOVVhhNVdMbkZLRXlsaVNBM0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Newsom Says California Will Not Extradite Abortion Provider to Louisiana - The New York Times",
    "description": "Newsom Says California Will Not Extradite Abortion Provider to Louisiana  The New York TimesLouisiana wants a California doctor extradited to face abortion charges. Newsom isn't having it.  PoliticoNewsom rejecting Louisiana call to extradite California doctor over abortion pills  The HillGov. Gavin Newsom refuses to extradite California doctor to Louisiana for abortion pill case  NOLA.comLouisiana Indicts Another Out-of-State Doctor Over Abortion Pills  The New York Times",
    "published date": "Wed, 14 Jan 2026 22:13:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOanFVLU5ZLUQzeWY3bHNPalZkTlo3dkNwZVJ1dGVlYkdMcGwxVldzN0ZaaG05Z2M1REZQYkpJaHRqOU02cXFpaW12ekxULUVyZzJOZkx4cGUwYmlfTHktS1NvbWVrR1k4OG1SRlVCeTBtSTdLeEVNUUVibElxN0dvRHFFZlpuUkZ0ckdJNEJPOU5maEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "House GOP gives Brendan Carr a free pass on Jimmy Kimmel - Politico",
    "description": "House GOP gives Brendan Carr a free pass on Jimmy Kimmel  PoliticoFCC Chair Testifies on Commission Oversight  C-SPANC&T Subcommittee Holds Hearing on Oversight of the Federal Communications Commission  House Committee on Energy and Commerce (.gov)Watch live: Carr, FCC officials testify before House on oversight of agency  The HillAt House Hearing, FCC Chairman Continues To Defend Authority To Enforce “Public Interest Standard” — Whatever That Is (Analysis)  Deadline",
    "published date": "Wed, 14 Jan 2026 19:19:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPSjJrNDNmdTFjX05vb3VmcWdaQ0FhZzFNVklsSWphampZclA3SThTeGQyVHhZNHBqLTBVM0JIVjhQWVZOYzdxYVNUenE0UG1nVVRCc1ZuNWZTV2UyNmtTYnpzQVB2WnBFLWdGUy1Sd2ZJa0pORkU5SVRyelNvRk95MWNzRi1lWE9lRWRDZWJySnlORDlJRmZjUWx0U3JPWkhXQWhyV1NKLXNuQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Democrats see a path to win the Senate. It’s narrow and has little room for error - AP News",
    "description": "Democrats see a path to win the Senate. It’s narrow and has little room for error  AP NewsOpinion | Mary Peltola Puts Alaska in Play for Democrats  The New York TimesInside Schumer's plot to retake the Senate  AxiosOpinion | Chuck Schumer just showed why he’s a better leader than his Democratic base thinks  MS NOWSchumer Sees Opening for Senate Takeover After Rough Year  The Wall Street Journal",
    "published date": "Wed, 14 Jan 2026 12:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQeERJX3htWXlxOWNMYXFvRUJOd0ttQ1pURGVFTi1jRHVYSmFLWndQTG5YSThrSlFZM1VSSjA3Ylp1QklFVkdIRHBKTVFWRk5jR3BzdWtOTVhUMEFZY0xNaXJqeVp4TVRDTEh4RUdIOEdjeUJTY0pXbDJRODBRdC15eGdCNzBlTmx0bFo0Q29wVGN1WHdSUFd3anBOVk9uWXRFbUhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "US Supreme Court does not issue ruling on Trump's tariffs - Reuters",
    "description": "US Supreme Court does not issue ruling on Trump's tariffs  ReutersSupreme Court tariff ruling: It's not just about refunds. Volume of U.S. freight trade could hinge on decision  CNBCTrump tariffs live updates: Trump says 'we're screwed' if Supreme Court rules against his tariffs  Yahoo Finance'WE'RE SCREWED': Trump warns of crisis if SCOTUS rules against tariffs  USA TodayKeep Calm If Trump Loses Tariff Case, Trade Expert Urges Nations  Bloomberg.com",
    "published date": "Wed, 14 Jan 2026 15:33:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNX2p3czVGbVBUcVIwek1aeFY0T2wySlZfYzU2MnFCNDhtZnlhWGdSMWJSY25GLTJjaHk3QmVsSFhmR29EOVpYbmpDcl95OFM0ejZwWFBwM3BYVUdja1VEc21aX2hIX3lRMUFkMkM1Z0FWbHc3VmlTLU1zMmFEQVFJeGt4dTM5WlA5b0gyS1hBZzUzWDZpRkhXTHZSanVBZ2I0RDdhNlVYYVVQbFlnOERIX3FHSmdWQ0cxVVdwMHhTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump threatens to cut off funds to sanctuary cities and their states starting next month - NBC News",
    "description": "Trump threatens to cut off funds to sanctuary cities and their states starting next month  NBC NewsWhite House to end funding to sanctuary cities and states on Feb. 1  PoliticoLaw expert says Trump's latest threat to pull funding for sanctuary cities might stick  CBS NewsTrump vows to cut federal funds to sanctuary cities, Seattle braces for impacts  KOMOMamdani, Hochul push back on Trump's threat to cut federal funding to sanctuary cities like NYC  ABC7 New York",
    "published date": "Wed, 14 Jan 2026 12:54:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOaTVBZWIxTExTVEF1YzVfRnJCM0txb0dfMVhUTFVfcFkwU0JpLTlYZUNjMWJ1U0JkdzRyaGwxaWR2VnM5LWNzLThyTVZTd1Nnd1ZjX1NiSlF4QmZEVHo4THlob1F5N0MtSXlGQUZ0ejRfQzlnUVhITTRuYU9iNzZ1dnRwVlg4VldZeFRiRmw1Sk9fZGlld2wzeEZMb01hRnM0MGxaSC1tLUpDT1ZDOXRPZmtJMWdhY3RpLXd0YW530gFWQVVfeXFMTXNTZVZDQ0dWRUhtSjVhdVpaQ1ZCS0U1LWtRNjhFRFMtZEkyWXFaWExBTVBnYnM3cFgyWE9mQ1QyY1dZRmZyZlR6bHlCQkk1bzJkLURoYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Federal investigation targets Champlain Valley School District over transgender athlete policy  WCAXTrump administration opens 18 new probes over trans athletes  The Washington PostUNR among schools under investigation for alleged Title IX violation  KOLO | 8 News NowTrump administration to investigate two Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday Telegram",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "House takes step toward averting Jan. 30 government shutdown - Axios",
    "description": "House takes step toward averting Jan. 30 government shutdown  AxiosHouse passes 2 more funding bills — with 4 more to go  PoliticoDHS at center of progressive revolt as House advances $80B spending package  Fox NewsHouse passes 2-bill funding package ahead of shutdown deadline  CBS NewsU.S. House of Representatives  C-SPAN",
    "published date": "Wed, 14 Jan 2026 22:35:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lMGsyY0tTYmFkWEg0RFVxMGlNZGtzU09QdzdnSEdFaHBXcWdpSXVUZ3B3MUV3a1JvSXBXNWZ0bjhZaVlBSFZ1VExWUzF0S2JGbWY4eGUyd0ZPdEt5S2JKaGluVHhDR0wtTjY3MG5MWmt6aTll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "New analysis on U.S. economy. And, MN prosecutors quit over DOJ probe into Good widow - NPR",
    "description": "New analysis on U.S. economy. And, MN prosecutors quit over DOJ probe into Good widow  NPR3 Prosecutors Quit After Push to Investigate ICE Shooting Victim’s Widow  The New York Times33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star TribuneJustice Department sees ‘no basis’ for criminal investigation into ICE officer who shot and killed Renee Good, official says  WEAUJoe Thompson, Minnesota's top federal fraud prosecutor, quits over ICE shooting probe  MPR News",
    "published date": "Wed, 14 Jan 2026 12:24:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQTldDbG1RZDVaaWJHQWE0cm5qNGVta1Bpd1BfWHRNdGVlRzBmS3lnZVNQUXZKelpUWDV4WWxmcTdzQkIybmZxbnZQWkp0c1ZaRWQ1VWFvazdzMXUwMFFxY010Mm54RWhoVTJsaUZXT2d0a2dLY1Rkem9zV2N4a0lvUGFwMEM0UW9wd1BNbmdOOUZyeFhiQzlRYUh1cm1RZjJpNjNacnZ2QjJNdE41aHJaWkxfY3VUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Administration reinstates hundreds of health and safety officials who were laid off - ABC News",
    "description": "Administration reinstates hundreds of health and safety officials who were laid off  ABC NewsC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York TimesUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.comHundreds of laid-off researchers at US workplace safety center are being reinstated  AP NewsUS HHS reverses job cuts at safety research agency  Reuters",
    "published date": "Thu, 15 Jan 2026 00:55:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdHdEUDZVM3RyajVVZ1JDa0dva0VVQXM3akdiYkRtdTRreWJsT2JUTk5yOVBGbTI4bmwtTTJvcHlxWXpRaVRQNFg0eEl4QktUa0wwdENBTVNZc3ZVTF93enJPaGxmejdCYW11Y3BpVXhnZVprdnlWd2lZcS1sbzF2blo4QkM5WmxXSFNwV0lnQlJNVDNMQ0I5S0hNM0tSMmNWdHNVUjhMNXFfQWlqTm9UVnhR0gG3AUFVX3lxTE1ZZ3VqQlRBVU1vS3BBSllrNnNibFdPSm1leWc3ZmZnZnZvai1oWnpzdFQ0Uk9yeXNzbmloT3p5d2N5N2lGWDZPRUlmXzZGd1ZvdFAxOWRrcU1OdW54WnN0WXZERzFGc09aY1d5QkdJY3pyYldrOXJuY0NhdEFuY0xIZVR3QXRBMnkzcDNHQ0YzWFNjQ3pFbFg0Smp3QS1fRVZpOXozRkNQclJHejBXelk4Rkl5MzFqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Republicans Advance Stock-Trading Bill With Limited Restrictions - The New York Times",
    "description": "Republicans Advance Stock-Trading Bill With Limited Restrictions  The New York TimesHouse GOP's stock trading ban bill clears key hurdle despite Dems' objections  CNBCUS House Republicans advance bill to curtail lawmaker stock trades as Democrats seek tougher controls  ReutersMember stock-trading is the latest target for a Democratic discharge petition  PoliticoHouse panel advances GOP-backed stock trading bill  The Hill",
    "published date": "Wed, 14 Jan 2026 19:19:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPUG9RN2tUWk9xbk01S00xNUFUOUdBZ2RfNDh6RWZEcndDSkl4TXp1ZWMxQnRxT3Q4VC1NNDZtMWJYNzA5MDdQRFNYbXU2b1p0VzBhZDRZNGxCRi1vRkd3SWVOUmFQajM5a1VlYjRiSEp0VjB2MGpPYTVBd3Z0ZXN0YWM1VWJ2Z2FhUVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "'Here we go!': Motorists speed through Highway 1 in Big Sur for the first time in 3 years - SFGATE",
    "description": "'Here we go!': Motorists speed through Highway 1 in Big Sur for the first time in 3 years  SFGATEHighway 1 fully reopens through Big Sur after three-year closure  KSBWCalifornia’s Highway 1 reopens after years-long closure due to landslides  The GuardianGovernor Newsom announces early reopening of Highway 1 through Big Sur  California State Portal | CA.govAfter 3 years of repairs, Highway 1 through Big Sur fully reopens  Los Angeles Times",
    "published date": "Wed, 14 Jan 2026 20:47:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdDQ5SjJzeHpuanhRdkdPOUFDLW0zY19Dd1ctdnFNcm16aVlQUXYyM1JKQjBXVy15NTA4X3pqMEQ2ZlVHamVGVFlKRWFOU3Uxcmd4T0dQdWJhS2NnRDRIcndwUFFLZDNLTjgzUWtqRlJxV2ZMcE1QeEpjYl9PX3hINGZlcUNjWmUxM2hBYnZDZGo2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies - CBS News",
    "description": "Husband plotted double murder to \"get rid of\" his wife after affair, au pair testifies  CBS NewsAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNRomantic letters from au pair to boss revealed in double-murder trial  The Washington PostBrazilian au pair testifies against former employer and lover in double homicide case  ABC NewsWATCH LIVE: Former au pair cross examined, pressed for details in Fairfax Co. double murder trial  WTOP",
    "published date": "Wed, 14 Jan 2026 11:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNQVlsRVZqWlgxMUtnd2VPVjZXNWJ0NWs1ZEE1QlN6N2ZPVzBNR1JwaXg5THNQRk5aVlVPV29oTGVMeHd5SmFQdGY1OWh0bTEyVmlicV9nRW9JQTlIdjR4OEtEWDR6Vm1yZ0QwWFRhSDNlZWhUZUJOR2dYMVRHcUc0SWswb3dKaVVfN05XZ3NqM3pIS3hKeFRn0gGcAUFVX3lxTE0xS2tod0E5S05kN1FHeUFDMUNuZEt0MU5zalE4cXFPaEhYSUMzZnJTZmV1QlFhdDMyVG9KWmhOakEyWTdUaVQtbjhqdGFBSV9NVXB2SlY5UlRTNnBVX0lRc1B2WWlKaUhSN3M2bmNlaDZiZS0zeHRDTlN4UWhqcElHRllUamFuVjlqYms2bndVZk51MHB6RzQ3dzc5Mg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States - The White House (.gov)",
    "description": "Adjusting Imports of Processed Critical Minerals and Their Derivative Products into the United States  The White House (.gov)Trump sets 180-day deadline to counter China’s control of critical minerals  South China Morning PostTrump says no critical minerals tariffs for now, will seek overseas supplies  ReutersLithium Has Become a National Security Priority for the United States  Crude Oil Prices Today | OilPrice.comThe $587B Strategic Surge: Why China's Export Ban is Scaling a North American Metal Boom  Morningstar",
    "published date": "Wed, 14 Jan 2026 21:13:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxNWnpjbVU2RlFNMDFpNk5mRnhMUE5NSTlmbEpwLWUzSTY3UHdMYV9tZ3lLWVF2SzV0RHZWOEgtNXFkRkx4OEZrZ1NGTG5OejVTU29NSG82ZklaMXltaEJyZXI1eVliT3d3Uk5sVTV1WkVyeUJKN044Z3lGenlvMmVSZnBuc2tvM2tZbXZ1elNRVGU5dWlQQ2M3LWlYQ2ZhYkgwYUtleFlGaUxpR0FVM3BuRGVaWUVnUUJ5Tnl0V3NlejNNR0J1TURMcnJZdVFnQ0M1emx4MXRPVmh0aHBxQldoRndqY0VzemY5eU81Z25Mbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Dems Are Begging Their Own to Drop ‘Abolish ICE’ - The Bulwark",
    "description": "Dems Are Begging Their Own to Drop ‘Abolish ICE’  The BulwarkDemocratic infighting ignites over surge of anti-ICE anger  Axios‘Abolish ICE’? Many Democrats are ready to fund it — with conditions  PoliticoMinnesota ICE shooting raises chances for partial government shutdown  The HillTrump Is Making ‘Abolish ICE’ a Mainstream Position  New York Magazine",
    "published date": "Wed, 14 Jan 2026 16:01:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5jWG45UEtyR3FKY2dSbl9Gb0pENk5VRkdZUEpKZ3lLQkMydW1qUnM2a0tuSVBlczN4SElwV2FOMDMxOXh3enZkZUozdTFUenE4WEFvU1VGSW5Td3RFdkZOTlRXUW5qMGVjb056WVJYZjhSVzhkTUZfRWNKRENiTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Trump’s EPA is setting the value of human health to $0 - vox.com",
    "description": "Trump’s EPA is setting the value of human health to $0  vox.comE.P.A. to Stop Considering Lives Saved When Setting Rules on Air Pollution  The New York TimesThe EPA is changing how it considers the costs and benefits of air pollution rules  NPREPA says it will no longer consider health costs in pollution regulations  The Washington PostEPA to stop calculating deaths avoided and health care savings from air pollution rules  NBC News",
    "published date": "Wed, 14 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPOW9QVTROQmZGbjRnVV9mQTB4NGpIdU1qbUVUdFd2eThCR0F4M1VvOWExZUduWDRKb2FtSGpiMUpaT3g0ekpXR3BxT3RrU1lONFQwYWp6bHhfMXl2ejNfSnJjLU1JQWgzcERhc3dkYWRzNmtqb2hRUlU2WjlhNnhPOWlEMjNBcHFNSUw3bFZRWlk0YXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe - The New York Times",
    "description": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTrump 'inclined' to keep ExxonMobil out of Venezuela after CEO response at White House meeting  AP NewsTrump threatens to sideline Exxon from Venezuela's oil: 'They're playing too cute’  CNBCTop Atlanta CEO: U.S. action in Venezuela ‘massive pivot’ in energy  AJC.comExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Wed, 14 Jan 2026 22:02:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOSFJTZnZNWXdONjc5azcyaWRfZVdlTDhVMlNFQ3E5dzA0czhOb2FMVkxjWHBwN25ZeXF6ZTZvUGN3MVEzZERnX05Sa3dYRFpzUVEybUdjbzlIMjFxLWxhRmEycU1VamVHYnhwSGMyeEsyWk96bzdTaDBrUjcyeldtUXp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial - Texas Public Radio | TPR",
    "description": "'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial  Texas Public Radio | TPRTestimonies continues in former Uvalde school officer, school shooting trial  NBC 5 Dallas-Fort WorthUvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there'  ABC NewsTeacher relives the day all his students were killed in Uvalde massacre for officer’s trial  CNNLIVE BLOG: Day 8 of Uvalde trial  KXAN Austin",
    "published date": "Wed, 14 Jan 2026 12:33:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPSWxOM1FwVzkzVVhBVVYzeHhOckdEZ2ZtSDVWYWhCNTUzWGNUeXdDb0lCeDc3UHEzb0R5Z0Y2ZXpQS3RlZU5Zdl9yOEIxVnpqV3ZOVE85Zk1pWXpqbkFMdTU5bkE2TUlEWGh5bmVFVE1CSzVXa3RpbTN3b0Z6aWMyRTZyUk1PX3dZT0hIUWptdUdqMk80SkpEcGtPa25SNjl5bzdhX1JoMkRVN2xfRmpZYWo4d3ZTR21YdHhoaUJLeTgwUmNZY3pVaUhTMHhJWEN3UVlhLVZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tpr.org",
      "title": "Texas Public Radio | TPR"
    }
  },
  {
    "title": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota - CBS News",
    "description": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota  CBS NewsUS citizens in Minnesota share their stories of ICE detainments, intimidation  CBS News‘I was flooded with fear’: Minnesotans describe their encounters with ICE, being detained  MPR News‘I heard screaming, I heard crying:’ Inside ICE detainment at the Whipple Building  Sahan JournalICE protester detained in Fort Snelling shares detention experience  5 EYEWITNESS NEWS",
    "published date": "Wed, 14 Jan 2026 17:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPT2tES2FpNWFwT0hNdDJGZzZEVG42TE5Xb1ByaGFoZ2oyYVlidzFfdjRTWWtKSmVuZjQyS3JtZ3RybmtKSGpzZ3VScTJXeGVpMjJmcHFRV2hGMXZmQlNiWUNXQkFJYk5uMVVsUW5WemdkMmNvWHotbDZqWklJcjlYREpRLTVnY1h50gGOAUFVX3lxTE5jNG5SdmNFaGNfenZsZGJGaFpYNkNobkpXaGdqNldsdlM4R2VCQ3FCZ21jMUVUVjVqazZDYTA0NFBGVDJ2OHVtMVlhS25vajdFVk1TaXo2NGl1NlNBY1pPdDdsendGMVU3YTlEMlFvZXNRWmxFQ29EVE1ITzNvTWotNENCR0pzRFhQX3pQZEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Fractious Portland City Council finally breaks impasse, elects ‘reluctant hero’ as new president - OregonLive.com",
    "description": "Fractious Portland City Council finally breaks impasse, elects ‘reluctant hero’ as new president  OregonLive.comRecent Events Could Shift the Debate Over Who Should Run City Council  Willamette WeekDeadlock broken as Jamie Dunphy elected Portland city council president after tie vote  KATUCouncilor Jamie Dunphy chosen as Portland City Council president  KOIN.comPortland City Council ends standoff, elects Dunphy president  Axios",
    "published date": "Wed, 14 Jan 2026 21:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNd0gwb3ZSTk43djJDeXV6RmhId3ZDZVdVQ1F6Tjg2MjNvaXdvVmxnWVdVbm9PWC14ZlFseWh4MEtLXzhBTHdBMnVPWW9QTVBNbjEyUU04cXRmUXNrcGFCN2phZl8yM3gtQ21sMnRXblVLemZMcFNxRlktU1liN0NEZlNQaFh2QXQ4dGJFWW1qQmZVbDA4TUNjOHExeklWb2pDVGl3RHNjTVhKOXE2UTNhNDdTVGk0ZHhPbGl0T192V0F1V2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "I Joined Ice Watch - The Free Press",
    "description": "I Joined Ice Watch  The Free PressHow ICE Crackdowns Set Off a Resistance in American Cities  The New York Times‘Constitutional Observer’ training comes to Duluth  WDIO.comLegal observers in Minneapolis follow federal agents, document ICE activity  CBS NewsImmigration attorney leads constitutional observer training in Minneapolis  5 EYEWITNESS NEWS",
    "published date": "Wed, 14 Jan 2026 01:46:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTFA5Q0FLbjY5MkpaQ2FIZDE5WFRBWjFqajByekJ6TUc1eUgxeXp2MmN5QXNXUzFUSER3VnYza2JsenZ3QWpEZGozekp2cU5ESzBiYjdIYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thefp.com",
      "title": "The Free Press"
    }
  },
  {
    "title": "US judge blocks Trump administration from cutting Minnesota's food stamp funding - Yahoo",
    "description": "US judge blocks Trump administration from cutting Minnesota's food stamp funding  YahooTrump plans to illegally stop over $2 billion in Medicaid payments, state says, in latest twist to fraud saga  MinnPostEllison says he’ll sue Trump administration over Minnesota-specific SNAP cut  Minnesota ReformerWhat to know about the threats on federal funds flowing to Minnesota  ABC NewsMinnesota appealing feds’ move to withhold $2B in Medicaid funds  MPR News",
    "published date": "Wed, 14 Jan 2026 23:23:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNd09IbWt6WV9wMjc1WTBENkg3YzdjMVkydFFranJrMmZIMUFTcElqZzlvXzhOTkFnY0x5eEp2VU1qQjV0OEZTOGdFX090TE41M2p2LUNiZmdrVlNJLVhEQnVLdksxTHZpVHRPWDZvbDVmR19rVXpGUzctWUIxVUhGQVFFM1phUlY5RkJOdTV4cWE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Minnesota’s corporate silence on ICE surge - MPR News",
    "description": "Minnesota’s corporate silence on ICE surge  MPR NewsFederal agents chased off from Minneapolis restaurant helping people impacted by increased ICE presence  CBS NewsMinnesota’s biggest companies starting to feel heat from ICE surge  Star TribuneWays to Support Minnesota’s Immigrant Communities as ICE Activity Escalates  Mpls.St.Paul MagazineICE presence impacting businesses in St. Paul’s west side  5 EYEWITNESS NEWS",
    "published date": "Wed, 14 Jan 2026 16:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZGFwUXRHXzFYbkZaWWtPdEhIZGZhbHliU1N0LVF3VUNnWXFUOWhIOGhVN2NFTFR1aFI3eHlWY0g0eVFqRVoybVk3ZVYycmE0QXNGaThnaWZzcDhSdXRST3VkZU5FMlVwUVl3ZTJVZm01ZmQ4VkFydWluVjZSWEdWRExPYnFCc01m?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Lower Bills and ‘Go Bills’: 8 Takeaways From Hochul’s State of the State - The New York Times",
    "description": "Lower Bills and ‘Go Bills’: 8 Takeaways From Hochul’s State of the State  The New York TimesStatement From CUNY Chancellor Félix V. Matos Rodríguez on Governor Hochul’s 2026 State of the State  The City University of New YorkWhat’s in the 2026 State of the State?  City & State New YorkNYers can get free college tuition for in-demand fields  PIX11Gov. Hochul's State of the State; Iran \"Prepared\" for War; Supreme Court Hears Arguments on Trans Student Athletes; The 'People's Republic' of Astoria | The Brian Lehrer Show  WNYC",
    "published date": "Tue, 13 Jan 2026 22:11:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBDOTdyeFVVcTV6bG5UUmZZbzdXd1JRbE9nZnNLQU04VVVkYUxjcDFyTmN0WjRZMnIwUWJycFJhM21vMkhCc24ybnVwd1pvSDBPZ3Q0YldIQUlEZ2ZxWV9NSTNUTXQ2eVgzN2tzSHhKX3djMWpoSFRBaUtGUDM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base - BBC",
    "description": "US and UK pulling some personnel from Qatar military base  BBCIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersTrump warns Iran against protest executions as death toll jumps past 2,500, activists say  NBC NewsSome US personnel urged to leave largest Middle East base as fears of war spread among Iran’s neighbors  CNNU.S. reduces some personnel at airbase in Qatar amid U.S. threats to target Iran  CBS News",
    "published date": "Wed, 14 Jan 2026 21:45:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1ieTJ3bzRDQmhjeV9OaXpOSXZqeWFBbWNrQTZaeDNnQmVfVjZtM0JRMVRYbjFkVlp2RjFrbjNDMjEzdEFRRXc0YmlIV3NtR2RaQXlZWFJIV2Yzd9IBX0FVX3lxTE5hT0otNjJWZmVzbV84SGtwWjlpUHNOUlh2dHJhZ2FyelU3eGktVXFMLXlVT2liTGZpV3g5cnhFMFZHdDIzS0dTYzhjSFpoXzd5c096RzNvVW9YckQzOGtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Election denier Tina Peters goes back to court after a boost from Colorado’s Democratic governor | CNN Politics - CNN",
    "description": "Election denier Tina Peters goes back to court after a boost from Colorado’s Democratic governor | CNN Politics  CNNHere’s what might come up at Tina Peters’ appeal hearing Wednesday  Colorado Public RadioTina Peters' lawyers try to convince Colorado court to overturn conviction for voting system breach  ABC NewsGov. Jared Polis considers clemency for Tina Peters as he begins final year in office in Colorado  CBS NewsColorado secretary of state urges governor not to pardon Tina Peters  Democracy Docket",
    "published date": "Wed, 14 Jan 2026 10:00:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1hLWROWG9GQW9ibnhFQ01IczF6UHBOeVZsUkdPQmNXNmR6Um9iMmtvTWFveUlVdVhDVUM3b0RhY09jeFE3RjZicDAtaGJ4MDBWM3o4OTZmUGtDUF9zOEVkajN3ZFFPWUxER1NXeE9TdUVtczgycHhYbnd0eWI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Bipartisan health package still in play despite Obamacare rancor - Axios",
    "description": "Bipartisan health package still in play despite Obamacare rancor  AxiosOhio Democratic U.S. reps joined by three Ohio Republicans to restore Affordable Care Act subsidies  Ohio Capital JournalHouse passes bill to extend health care subsidies in defiance of GOP leaders  AP NewsTimeline slipping for potential Senate ObamaCare subsidy compromise  The HillThis GOP senator says reviving Obamacare subsidies would be ‘putting America first’  Politico",
    "published date": "Wed, 14 Jan 2026 10:30:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOay0wZlFGdnBtWEc0X1Mtby05UWU5aWNTRXo3U3NCeUxONXpycGc0RkNES0RfNzZZWE92aWZtWi1BY1BuaGRNcWRvRGtYSDRlUExaQ0RvMl9DVDZEZmlfSkJNQ0d6U2pWS0wtNGtna3RfY2Z3S3FRc3VzQ1d4WWNONA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Lindsey Halligan argues she should still be U.S. attorney, accuses judge of abuse of power - CBS News",
    "description": "Lindsey Halligan argues she should still be U.S. attorney, accuses judge of abuse of power  CBS NewsTrump Loyalist Asserts She Can Keep U.S. Attorney Title  The New York TimesJustice Department accuses judge of abusing power in questioning prosecutor's authority  ABC NewsHalligan defends her use of U.S. attorney title in combative court filing  The Washington PostJudge's questioning of Lindsey Halligan's role draws DOJ rebuke  NBC News",
    "published date": "Wed, 14 Jan 2026 03:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNTjl5VVREclJQMVk1ak1RYllQdEpRMWpMZGtzbHN3M05RSS00RUgxSWE1RTl4WnEyc3FBOFYwMTk2M0s2YTlCYW9YcWlFTktrM01XNGs1VGlxMmRIakQ1OUZWT19DcllsdGJWV1ZCN2JjbzNaa0x0eGJiMjcyd0xPM1Jtc0NfSGdDMXlEYlN2TDdndzVMZGfSAZsBQVVfeXFMTU5nbXZZc3pIRmE1Z3IyUWRZd0EteTVXaWFHc3hEUnBpS2EtS0dBSl9TSU01NFJOYUpTNklWeDYyQkVzWDJZRlRuV2NMZElEaExtVXFITGpjT1BsczZibUd4ZHJINmZ1QUJQNDdkYlR3Ty1mMFlCZWFmMXZXNEtNYzNvYTh5Zk56OXRzR1JXM28tNDg2MS1KQUt2MTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Fact check: Trump litters Detroit economic speech with numerous false claims about economy - CNN",
    "description": "Fact check: Trump litters Detroit economic speech with numerous false claims about economy  CNNHere’s how Michigan voters feel about Trump’s handling of the economy, according to poll  ClickOnDetroit | WDIV Local 4Trump in Michigan for speech to Detroit Economic Club: Watch replay  Detroit Free PressBack in Michigan, President Trump Celebrates Auto Industry, Economic Revival  The White House (.gov)‘It’s literally terrifying’: Hundreds protest in Detroit amidst clash with police, Trump supporters  MLive.com",
    "published date": "Tue, 13 Jan 2026 22:57:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0xVzhHZDRLYUlTOTEzanJFZEM5cm95MjlXV0k4cjNVTEFuWXh4eUlpbklYb3NDLTdHYUZnS3JRR1k1aUlXNUpaTDlTMW55TFpfeUJvdGR0VFJNc013ZGpmNU9aU1ZyWTlHT3FuQzJvX2VLY01fWHUwRFNRenlfZjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Before and After the Trigger Press that Killed Renee Good - Lawfare",
    "description": "Before and After the Trigger Press that Killed Renee Good  LawfareKey questions for FBI investigators to unpick in Minneapolis shooting  BBCChecks and Balance newsletter: A chilling week in Minnesota  The EconomistVideo of Minneapolis shooting convinced these Trump voters it was justifiable  YahooCities and states must hold ICE accountable for violence. The feds won’t | Kristy Parker and Samantha Trepel  The Guardian",
    "published date": "Wed, 14 Jan 2026 17:54:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdkVTTnc5dmpPYjdwRDlqOXd6bk80c2trakNMamFNRHh2NkM3cDMzUjNBd0FWZlF0YkdMNU1kY3BnVExKLU1kZjdDdGRpMFkyNWtNQ0xiRVVJX1lYT1B6dDNvWVpkdGJhUHUwVWdHcmtJNXFDZG9mZFZoSGZVOHlMemZaUFZFTXZyMGkwQ2pFeHNna2VGcVZyRGJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.lawfaremedia.org",
      "title": "Lawfare"
    }
  },
  {
    "title": "Linda Brown, Chicago teacher found dead in Lake Michigan at 31st Street Harbor, died by suicide, drowning: medical examiner - ABC7 Chicago",
    "description": "Linda Brown, Chicago teacher found dead in Lake Michigan at 31st Street Harbor, died by suicide, drowning: medical examiner  ABC7 ChicagoLinda Brown: Chicago teacher's cause of death revealed  FOX 32 ChicagoBody found in Lake Michigan is missing Chicago teacher, family says  NBC 5 ChicagoMissing Bronzeville Teacher Died By Suicide, Officials Confirm  Block Club ChicagoRelatives remember missing CPS teacher found in Lake Michigan as 'an incredible, amazing human'  Chicago Sun-Times",
    "published date": "Tue, 13 Jan 2026 21:49:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQR1RHc2VTRWRVejZpeEF6WVFzdTJGd2M0Y2V2dHBhb3VnUVJfU2l2dnFLMlJBaDVpb2NnU3lZQTh0djB6dVZHWEtGTFNldWRzMjlkMHlFN2tOZTR2MExoTFYyRkRyNFhWNVhfZXhKVXJLZFFvTWtOTGViNkxLT2VUd3lzS1BnM0lfZkpJd0dVTkw3MjlhZGd4UVJKM0VmVnRPVnkxenhQTHRDX1czdkl5azREckFvR3ZPNXI5SW1tMEdZdUVSZzd2eUxscDE3VW1XZTQ0aDRFeUhYU2w1QTlXZzVoQdIB6AFBVV95cUxNem9STWQ3SHFMNnFXcGlUUlIzSFdDeExLMkRFTm1qVUhrOThvcHZqZ1ZoRzdlS0xKY2lIVkZwemh2Q043ZEthcHdMRll4ckFjOVdSc3I5VlNUTTktcXBGbmZjT0tLNS1VVVp0Z1puNE1PeTVjeUdTcmh5Tm4wdjdKTlpZSnlmZVhKc09YUVhLU1kzckZOaXpPQjgxY2ZYUnJPelpSX3VGY290dWJRYVhZbDlWQVAteTRmbkQ4OWw2OVVhOVhrVWw0UnY4NnlyanFFanl1ZFdXNXRXUjhCMUpFbEVZMFdvNWph?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "'Daily Show' Makes An Embarrassing Example Out Of RFK Jr.'s New Topsy-Turvy Food Pyramid - HuffPost",
    "description": "'Daily Show' Makes An Embarrassing Example Out Of RFK Jr.'s New Topsy-Turvy Food Pyramid  HuffPostDo You Have Questions About the New Dietary Guidelines?  The New York TimesHow much red meat should you eat? We asked 3 top nutrition experts.  The Washington PostI’m a designer. The new food pyramid is outdated and confusing  statnews.comSchool Nutrition Standards face changes after new DGA  FoodService Director",
    "published date": "Wed, 14 Jan 2026 04:56:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPcTNtaUFjaDRxN0RYcTJMVXYzMVA5aFNpU1czdzF4cWtHWVRvYnpDazJFR3JwOHJFbjg2c2JsRWZPc0NrSnhvWk9iMGNYRHB1Y1JJQ2pLV0FDaGZkSnZIQUJwTHZfczI1RGVVNHhzb3NIbk84R1MwQTVMOFFWb2VzcG8zdG0zTHNHdlhkOWE4RVVqcldtb1FYQ0k0dHdYRVlQZ0YzdlJR0gGrAUFVX3lxTE01U3lmYU9pVTI5VTFxaFVLUUljaVJLZkUzTzBHT3JtclBIZWVaVnlRdkxUMk5sdjBXeHptNHRpZ2lYdjZndjlsVG1aUk9DMFhuU25YczAzNlo1YkN0T3V0Y0IyOElZb2lfQUN4aTNpZEJjU25sTTEtblRSVzdhRldCdUIxaW5tZWZQLXN2LWZXbDAzM2FsVGFyeU9mVlcwS1BhdzJuaGpUeFdJQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Virginia Democrats look to decimate GOP seats in redistricting effort - Politico",
    "description": "Virginia Democrats look to decimate GOP seats in redistricting effort  PoliticoVirginia House passes amendment allowing redistricting to counter GOP gerrymanders  Democracy DocketVirginia House committee advances 4 proposed constitutional amendments  VPMVa. Democrats flex power on redistricting as General Assembly session begins  The Washington PostVirginia Democrats advance redistricting effort  The Hill",
    "published date": "Wed, 14 Jan 2026 16:23:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPWlczSTFTSk5OZUxJbVZGZVJLMWU0ZjRDX2FVREUtbEdzOG84bjhTb2t3MmdaaTlTM2ZJdWYyVFBURFdkMklZREQxckNZUDF6U0xLUTFmOTdHSVJWaU12NFExel9fLXBOOUZyQ0dOeVEtZEFreU93elRGaXFpZC10MlZ0dFJ0THphdVdQU1czVWdiM19ycTFRT0VLenBJdVV2M2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention - ABC News",
    "description": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention  ABC NewsFour Oglala detainees located, three still in ICE custody  ictnews.orgOglala Sioux Tribe says 3 members arrested in Minneapolis remain in ICE custody  FOX 9 Minneapolis-St. PaulNative Americans detained in Trump's Minnesota ICE raids  USA TodayOglala Sioux Tribe says ICE illegally holding tribal members from Minneapolis raids  Axios",
    "published date": "Wed, 14 Jan 2026 07:14:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQTUxMLVI3eVZRVS0zWlhhcU1HYXc1V0htZXNKa0E4VGw0blM4RG1qVE9tZFNuVGt0T2kyRnViVk1ibkVDTG5TNGdyUFNtVl9vTUUxSFJzdzU2Ynh0QnZJeU91akE2OVRoT2ttQ18wcTBCM24wZzZFZ3dLdnh0bnZkRkFQZzJMUjNhcENUS0pQZVk5MnJ5Ny10UXNuUTVjajRvWXZndUpVTdIBrAFBVV95cUxNUEFBbEJBd090c1Y0LVdnd0dHSkhseUlwOTRPZk9CdlM5dS1JRk9ON1ZiakY2RVd4UUQyM0FQNzZZVHlzY0psc2ZDeUExNHJPcXlNcV9neVRJVE9NWnVUelRtNE1sOTRDeDJTZWlkNFBOWWduc3hLbDZSd2R3d01IZXBveHZlOWV4UmxRV0ttc3JWOTFfSmJSQnJyZTJZS1hpcU00eFRFNXZOWWlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Protester blind in left eye after federal agent fired projectile during Santa Ana protest, family says - ABC7 Los Angeles",
    "description": "Protester blind in left eye after federal agent fired projectile during Santa Ana protest, family says  ABC7 Los AngelesProtester injured after a clash with a federal agent in Santa Ana  NBC Los AngelesAnti-ICE protester claims he's blind one eye after federal officer shot him with nonlethal weapon in Santa Ana  FOX 11 Los AngelesAnti-ICE protester blinded by federal agent during demonstration in Santa Ana, family says  Los Angeles TimesAnti-ICE agitators burn American flag outside California federal building  Fox News",
    "published date": "Wed, 14 Jan 2026 06:33:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQTFNxb0MwdlE4Q0I3b21qVHN3cFZNT3ZIZTZiTUgwWW5SY1pfY19xTVowWHRPazEtUDNKbUNEbkJmcjVmcGcwMmxmV0RVdG1tQlVEcklZQWFGb3lrcHR5ZkxxeDlMRjJ2VWxDMk4yRDIwSnpSaS1wUnp3QW03OVU3OWVnRng3RUJ0UzhGdHZHZW5LaDNDRGFmN3BRWmU2dm1UZy1IWm5jUE8zVFVYajA5elBCd0V6NVhqT283anZLNXZaQdIBxwFBVV95cUxPOU5JSVEwSnNSX24tR3A3OTN5aVVtUmkwand3TGpBUjMwdUtlMGJnaUdsN3F5YnVLV3lLOURILUI5U3A1anV3N0RqcXNzdVNLZ1NCdXJyRVAxUUh0TWFhZlhmcld1ZWk0LVJvNVhWcC13RTd1SXM0MUU1RlhwV21zczQzYThVT2ZsWTJadmdBZXZWUHZqdHI2Z2o5MG1RLVNjVER6UVZfUWlXekthNzdDbTk3YUdaWU83TEFSRnp4X3BNNjJ5bDVV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "The online world of the man accused of burning Mississippi’s largest synagogue - Mississippi Today",
    "description": "The online world of the man accused of burning Mississippi’s largest synagogue  Mississippi TodayStephen Spencer Pittman: What we know about Mississippi synagogue fire suspect  CNNBurned books, children’s questions: The aftermath of an attack on Mississippi’s largest synagogue  NBC NewsDeborah Lipstadt has second thoughts about tying Jackson synagogue arsonist to ‘Globalize the Intifada’  Jewish Telegraphic AgencyWatch: Surveillance footage shows arson suspect in Mississippi synagogue fire  BBC",
    "published date": "Wed, 14 Jan 2026 01:19:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOT1gzLWFaWjhqUU84Q2FIV3hEbGlkM0I5MjdBNThyWktSZjBnbmVKUWhobzA0RGNwbUNNdnJhUWhZS3pCOS1KWXJ6UFh2X1BGMmpaT2JiWHByMktVekNXa1lyMWJVWXpyV2g4RVhPWnZFQVl6LWRoMnktbTZuejZ4ZkdNa1dySEQwZFRuRGFLdXNYNVo4OV9jTnk0REZZRTU2em5Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mississippitoday.org",
      "title": "Mississippi Today"
    }
  },
  {
    "title": "Johnson pledges to push ahead on another party-line megabill - Politico",
    "description": "Johnson pledges to push ahead on another party-line megabill  PoliticoHouse conservatives pitch framework for second big GOP-only bill on affordability  The HillE&E News: Permitting, NEPA, Venezuelan oil: Republicans’ reconciliation plan  POLITICO ProGOP May Squeeze in Second Big Beautiful Bill Before Midterms  New York MagazineGOP budget aims to address affordability, punish sanctuary states  NewsNation",
    "published date": "Wed, 14 Jan 2026 20:32:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNN3B3Z1lfUkJWbFVkS0RQR2hHOWNZR0VPRUxmdGd1eXdua1JMRHJ5OFFFcXRibmtyeU1RQU9xT1RMc0VCNTc0blU4Qy1WOVVubVlQRjNZdFJPMzhBbENzeFFFRzBnektmTnN0T1V1Z1J4U1ZIWUViZ1owQUlXMHhNclNSZWdmT0lmOV91ekVUVFlGVnpTWlNjRmdoOWRjOWJ3eWluQ0JXNlItejJMRWZUeXFLLWhscnlCQ25hY1g5WVM2X0tyS3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]