[
  {
    "title": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted? - The New York Times",
    "description": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted?  The New York TimesMinneapolis ICE shooting: Federal law enforcement involved in north Minneapolis incident, city says  FOX 9 Minneapolis-St. PaulNew documents shed light on Renee Good’s ties to ICE monitoring efforts in Minneapolis  CNNWoman Killed by ICE Agent Seemed at Fault, N.Y. Republican Says  The New York TimesMinneapolis ICE shooting live updates: Protesters face tear gas as Trump admin promises tough response  NBC News",
    "published date": "Wed, 14 Jan 2026 21:30:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOR0VEVE9mRHpWaFdCcEFnQWtfcjZkU19Xck91eTRXU25VakpFRXNoMElDdGhtRFFZOTA5SkkwV3RLZG1jZW5rZ0NBaGZ0VnpyUGJPSDVFWGNkV2JadlFYNlExQkxLRTFuNGlzNU9IcVh6WWlOVVhhNVdMbkZLRXlsaVNBM0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "No decision on request to stop immigration sweeps in Minnesota. Military lawyers may join the effort - AP News",
    "description": "No decision on request to stop immigration sweeps in Minnesota. Military lawyers may join the effort  AP NewsMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNNGov. Walz to speak about federal law enforcement presence in the state  5 EYEWITNESS NEWSWalz calls on Minnesotans to record ICE, protest peacefully  MPR NewsGovernor Walz addresses Minnesota amid ICE crackdown  FOX 9 Minneapolis-St. Paul",
    "published date": "Wed, 14 Jan 2026 22:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNNGVGY0ZSN1paXzVrcTFHMFdTenJ0OUhlaFpjRU9pUDVpOXpGNkNZaDBEMWRKeDRYWUNtd0hka0dwQm9IT19Jc0UxX2R4cW1TWklYV0NOTkJFRDgyUEpOS1ZoNGNCR1NXZEd4S2xxMjZYX3c2NTM2MkVQQ2ZyalQtTXNMM3NDLTN0V2lfNFE5MXBuLUNvVWx3Z3QwdWtpVGY1WG5VNw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Brazilian au pair testifies against former employer and lover in double homicide case - ABC News",
    "description": "Brazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNAu pair testifies, says Virginia man stabbed wife, framed stranger  The Washington PostAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC NewsVirginia nanny testifies affair, alibi plan ended in bloodshed after love triangle tore apart affluent family  Fox News",
    "published date": "Wed, 14 Jan 2026 18:16:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxORWU5ODdpdTZSZGtHZVlUVGJFMlFId1RhOVh6OGU5TkdybVZMRFRlSTlVNEY2RTBBNmdyRXN2RE5jZWlkaUdUYzI4SVVHQzhTZlNGOXhucmNBMTFWVkw4NDI5dFBlSTFUQmRMNDdPYm4wT0hsdlBUYXRYZG1YSHJUb21qaGpUWlZzMDJhbHE5UkdvLTFGaGtZc1daVTVpQVZWM0oxatIBqgFBVV95cUxOZjJ5ZW1ObTFESW96c09iREVHVW9rYV95RHBseG1SZWxaM0hfak1ZYUhRelFVR3NaMFFILVFQcmJlWjZtbk8xbGxCSzFRX3BZaDVyRE5qZmk5Sms1T2cxNTFLUS1DTVJKb3VhZUc1OXdyU0Y1WVpZUmJvb25RRzFHVmdIemZpSWpEWWdlMFJUdHZLa3VwVTZwOXNHVUhKaVU2TlFlaEx0YWdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Federal judges allow California congressional map to stand - Politico",
    "description": "Federal judges allow California congressional map to stand  PoliticoFederal Judges Uphold California’s New Congressional Maps  The New York TimesIn a win for Democrats, court allows California's redistricting plan to proceed  NPRDivided panel cites Supreme Court backing of Texas’ map to uphold California’s  MS NOWProp 50: appeals court rejects Republican bid to block California maps  The Guardian",
    "published date": "Wed, 14 Jan 2026 21:32:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNN0w1QUV6bzg5cE9Kc0VFM2lqUlQzdUVvenlDdnctU2YybTdzRmhCOGJ5MF84X0c3eGNKRURqS2dDRXY5cFo2Y05JSUxKNGFVTlVtdjNBbFVCT3lkcWN1TjFqVHJ0eFZrTHVjYnNsQkxMZmU0Qi1JQnF2cEpOeWxPNjdDaktkNzRhcjhya2dSb3E2ZUlTTVd6TA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump says \"killing in Iran is stopping,\" with \"no plan for executions\" - CBS News",
    "description": "Trump says \"killing in Iran is stopping,\" with \"no plan for executions\"  CBS NewsTrump says Iran has called off execution of protesters amid fears for the fate of Erfan Soltani  CNNTrump said to want an attack on Iran ‘to be definitive’ and not trigger sustained war  The Times of IsraelIran protests: Trump says he's been told the 'killing' has stopped, executions won't occur  ABC NewsTrump would want military action in Iran to be swift and decisive, sources say  NBC News",
    "published date": "Wed, 14 Jan 2026 20:35:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQNkU3YmxfS2FxZnRqMEg0bGNKbmViVGpkMHdMZXc4dTJyaVExc3p4UDR0MU0ycWdGT0doRTVvaDd1OGJSbDFSV29Tb2hPX0dlSkdnc0lkS3hFWFJrc05tT3gySFhzZ0o5eUJXX2JQeUFOempTSkRDVUduY0I1NjlqcHhfLXNOR3o5U3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump administration rolls back $2 billion mental health, addiction grant cuts - NPR",
    "description": "Trump administration rolls back $2 billion mental health, addiction grant cuts  NPRDeLauro Statement on HHS Reinstating Billions in Addiction and Mental Health Grants After Abrupt Cancellation  House.govTrump Cuts $2 Billion in Federal Funding for Mental Health and Substance Abuse Services  The New York TimesTrump administration slashes grants for mental health, addiction  The Washington Post‘People will die’: Trump administration cancels up to $1.9bn for substance use and mental health  The Guardian",
    "published date": "Thu, 15 Jan 2026 02:10:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYXphRGdydnVyTnhGNWZiamVZdGN0Z3QzZHRadEJLT095elBDS2ZvMjQxUHljZk5aZjhtZG5JTzI4aTVTV3FXVFE3NXlNTXJrOG1yOXRna0pIaElPMzJDLVE5bmRXLWE2emNTODk4dTB2bEJsMkc3SlVCX1pJUWhhZDJZZ21uaWhoVmh3WWJrbHBlWVJzd285Q2dGYlVDUFFhREczNnRVMXpUWG1LNnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "White House defends Trump over middle-finger gesture at heckler - BBC",
    "description": "White House defends Trump over middle-finger gesture at heckler  BBCTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNSuspended Michigan autoworker who heckled Trump gets outpouring of donations  The GuardianA Ford worker called out Trump. The president flipped him off. Now, he’s been suspended.  Michigan Advance",
    "published date": "Wed, 14 Jan 2026 20:14:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE53Tjg4TUdsOFJLUmVSVUZtSkFuTi1YdkFXZ1FLa1dNY2ExTHFFYlR3ZVk2Sk9pWERtTDJ1S2o5UTFYb1cxOHBCdDJVYnpkRzFnalBRa00tdXdSUdIBX0FVX3lxTE9pX1oyWkFwVUNqLVo5NXJVYjNMWDUzMnQxMUVUMV9nb01EQm5DSEtLN2JYbVpfZUxMTWRvRWViakh2TEFfY2ZCWUdDTHpaMF9MTlhKRkRvUjQybFBVdTZv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights - Slate",
    "description": "The Real Reason the Supreme Court Reversed Its Position on Trans Rights  SlateInside the SCOTUS hearing bound to be a turning point in the culture war over trans athletes in women's sports  Fox News5 takeaways from the Supreme Court’s showdown over transgender athletes  PoliticoKavanaugh and Roberts are already looking ahead to the next major transgender controversy  CNNKetanji Brown Jackson Was One of the Few Justices to Recognize the Trans Sports Cases Are About Real People  Slate",
    "published date": "Wed, 14 Jan 2026 19:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOUljOGY0b25hbjB0eU9KcXZva0VYR08xbkp2U0NrdC1LOGhPanhCemg1dTdYbllVUTh5eUEtVkZYaUZZQ2M2a1RVVWFfbGJvbDdwSkNmSEkzeEJoa0pXa2NLSnMtN19WbWZRcFRTUmFJYnlyOWVFZEJSM0xQVV9OY2hCNU9YeGVfdEVvR2pzNU5FSUhyTXdqV25FYXJWZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Some personnel at key US base in Qatar advised to evacuate as Iran official brings up earlier attack - ABC News",
    "description": "Some personnel at key US base in Qatar advised to evacuate as Iran official brings up earlier attack  ABC NewsIran warns of retaliation if Trump strikes, US withdraws some personnel from bases  ReutersUS Embassy in Kuwait orders ‘temporary halt’ on visits to military bases  The Times of IsraelUS and UK pulling some personnel from Qatar military base  BBCTrump warns Iran against protest executions as death toll jumps past 2,500, activists say  NBC News",
    "published date": "Wed, 14 Jan 2026 14:25:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQOHFQemZBYkNhMUR0QVMwZ2Q1M1Q5X2t4WWUzMDNtNmgtakJFcjdwVWtMT015VC1pSUU4Tm1TWVBTNGFmTE55VU1fbV95UHY0WVJDaTRQY3VmaXd4MFhxbUdrYlZ1MjhnMkZuTGxieURIZ2JaTndDYXp1d2RJRHRrbm0zblMxVzF4Tno0WmVCMHM3d3NXWWZONTZoTdIBoAFBVV95cUxQaGJzTXQ1UVdJNndING1fcDlFZV9SM0g4bUthMGVod1BBWURacDl5VjNXRWpDMG5tdkRwTm9VTWNraXpaZmcwVEdGN0sydThVcTVHYnh4d0dDRGNQQkZzTkFLV2RfX2VQdEdtOEZYX0Rpc1V6OHdtNVp2SUJVU0ZaM1pxcGozaDFFX2lKRXVNWmx5bUJ3R2RCYzVCblBiejVh?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Candidates have legal standing to challenge election laws, the Supreme Court rules - NPR",
    "description": "Candidates have legal standing to challenge election laws, the Supreme Court rules  NPRSupreme Court Sides With Conservative Congressman in Illinois Election Rules Challenge  The New York TimesSupreme Court revives GOP congressman’s absentee ballot suit that could spur more election litigation  CNNSupreme Court says candidates can challenge vote counting rules  PoliticoJackson says colleagues gave democracy short shrift in election-related ruling  MS NOW",
    "published date": "Wed, 14 Jan 2026 19:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNcC1kbTRPdERxbnVsV3IyQ2cwUkNmbGpOVWRWR1F0S3l5XzdzeC1INHI5ekNBclFWMEJkNlJEQkV1SDNjc3pnZjBOV05SSEhSWlBrc3duMFlEWEg5X2VqcUxKWDN0VlVLeHVuRHhFYkdGQUVieVFrYVVGczRxYnV4RTAyWElIQjVmRUNEeGJZVlB2TXlpd3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Virginia House committee advances 4 proposed constitutional amendments - VPM",
    "description": "Virginia House committee advances 4 proposed constitutional amendments  VPMVa. Democrats flex power on redistricting as General Assembly session begins  The Washington PostVirginia Senate Democrats pledge action on affordability as 2026 session begins  Virginia MercuryVirginia House passes amendment allowing redistricting to counter GOP gerrymanders  Democracy DocketVirginia Democrats look to decimate GOP seats in redistricting effort  Politico",
    "published date": "Wed, 14 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdmxqMVNicEc4dFczNjcwSHZWV3BLb1dDdFhlVGJNbXNMcDZwbnZoVHVKaWdYamQwM0lwVTkyZGVuRWtadFJabnFOOXV5QUFfUHd4QzZZUGZ5RWZVZmxONm8wM0hDd1Q2RWRiOGYzbjN6d0loVlZLRzV4aWZkcU4zcjE5d0Fybkl5dmxJWkZoTjFRVi0zN3JabXFuejI5QnNkVGlidEtJdTZBMmV3dU4xRDd4VW9tRTB3dHpEWEp4dWJKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vpm.org",
      "title": "VPM"
    }
  },
  {
    "title": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney - ABC News",
    "description": "DOJ officials slam judge for questioning Lindsey Halligan's status as US attorney  ABC NewsTrump Loyalist Asserts She Can Keep U.S. Attorney Title  The New York TimesJustice Department accuses judge of abusing power in questioning prosecutor's authority  ABC NewsHalligan defends her use of U.S. attorney title in combative court filing  The Washington PostJudge's questioning of Lindsey Halligan's role draws DOJ rebuke  NBC News",
    "published date": "Wed, 14 Jan 2026 19:46:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPWXpwVUo2Vl9UNHhjNnVBeTcwMnV4ZW1ZRW1OYUNCZjVCdEt1N3BiUDNrRmpKamxSRU1VNGRIeUlhUjVfUUJCV1VkU2F2S2xVVHg1eGFXR2NXVUlwWWVzUzZrVHdjcUZDbFVVQ2dsSnJ6OXdDQ0xlb2pXSmdxbXVyZHc2dkF6RmJoSVZ0andqWEhkZURMbk5hbE12MEZaMExuZlp2QWI4N0Iwd9IBrwFBVV95cUxOaVlDMktCWWhiaXVQUDlqazU0MHdWVkJpOFBEOGNVaTgzeGw5WjBBeHI0ckV6ZUVUSTRMX1ZNa0gtWHpJaXZYTWRfby1mV3hzdXJZMDkxcGhQQ3NMbTh2R2ZHTDNCT0gxeTZLWDRBSWNncWRCcUJLRXgwSm9jUDhfcm9SdkYzcFJmVjAzSmpOcEVIWVM3anBDUmpwX1pTX1QyME9wMktDOVpYZTB6ZVZN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says - The New York Times",
    "description": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesNTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNBoeing knew of defect tied to fatal UPS plane crash in Louisville, NTSB finds  WDRBIn UPS crash, NTSB probing MD-11 engine mount issue first identified by Boeing in 2011  The Air CurrentBoeing 2011 Warning May Offer Clues Into 2025 UPS Jet Crash  Bloomberg.com",
    "published date": "Thu, 15 Jan 2026 01:51:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9LOFNxc2QyLTMtbkZjMVpremhnYTFmSnNLeUZpbTlGdW5Wa2drZkhjRnY1Z0p2YzlMTExYeUtzUEx6d2dvVHRIVnVrUW9IUU83MWctMlpqWDc1QkJzTjlsaHNmcXgtSU8tci1URFczNTJpUzdS?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "War powers resolution fails in Senate as 2 Republicans bow to Trump pressure - AP News",
    "description": "War powers resolution fails in Senate as 2 Republicans bow to Trump pressure  AP NewsTrump Administration Live Updates: Republicans in Senate Block Effort to Check Trump’s Power in Venezuela  The New York TimesSenate GOP shields Trump from limits to his war powers in Venezuela after Vance breaks tie  CNNVance casts tiebreaking vote to kill Venezuela war powers resolution  ABC News2-bill spending package 1 step closer to House passage  Politico",
    "published date": "Thu, 15 Jan 2026 00:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQMjM4aFdXTHhKU0ZmWTBDeFlGSHBBUXhKV0E5V2kwMGhPUnlxVWpNYkJRYVhvLWxnQWFfSFRjaExnbE8xX2xFY0tHdUpJakVMcTZZZmEyYzlhQXN1QXMxQ3BGM3pEYlFxa0o5WkRLQkRQZDRGd2ZRbjlXTEdrTlptUHFHZ3VFaWhPRDM2emRMZHdqcm80YS1NWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there' - ABC News",
    "description": "Uvalde teaching aide says she begged officer Gonzales to intervene: 'He just stayed there'  ABC News'They failed her': Sister of slain Uvalde teacher explains why she spoke out in Gonzales trial  Texas Public Radio | TPRTeacher relives the day all his students were killed in Uvalde massacre for officer’s trial  CNNWhat to know about the Uvalde school shooting trial as it heads into its second week  YahooLIVE BLOG: Day 8 of Uvalde trial  KXAN Austin",
    "published date": "Wed, 14 Jan 2026 17:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPZ0hodnhPc2hoWkhQN3Z3QVJTTHJSMUlUVXlrd3lKNHdfblNVeURCQ1JGWGZRMW5MaXlzSi1CUlBLemJlMFY1WmdOSnczYlNxWFhxYjhUaFNzRVJtOVpVVS1OU0Ewa0pwTjJqT0ZCdUZ3REkxMGRUYjhWU0NNVDlRaFk2UENRYWxaX2lzZ3BxZXVZc1VVN2JrYmVIWE5lZEZOSXV5OWU0SFE1MWpOWkhZ0gG0AUFVX3lxTE5ERVAtX0J3QzViMHpRUjg1UU9YcG9USHJxWWtRR1FqRV8wX2Mxd1dQVkFxem4xQ3lCSktObmNLVlU4TV9DT2dYVFBlcVVMalNVWmNzVi0zRWpBbFVZVm5wVHgwVDRQR1ZoRGFVaXNjMXpzaEZuR3lqdjlKTjY5dEcyaGdTWEc3bUlrcnVYbGhOTFRuMVd1UVFBaTVabzN1Zk1BYjlhZEJDVnlFWEtYbWh1ZEs4Xw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "House takes step toward averting Jan. 30 government shutdown - Axios",
    "description": "House takes step toward averting Jan. 30 government shutdown  AxiosHouse passes 2 more funding bills — with 4 more to go  PoliticoHouse passes 2-bill funding package ahead of shutdown deadline  CBS NewsDHS at center of progressive revolt as House advances $80B spending package  Fox NewsA federal workforce census, targeted cuts and more key takeaways from the latest FY26 spending package  Government Executive",
    "published date": "Wed, 14 Jan 2026 23:06:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lMGsyY0tTYmFkWEg0RFVxMGlNZGtzU09QdzdnSEdFaHBXcWdpSXVUZ3B3MUV3a1JvSXBXNWZ0bjhZaVlBSFZ1VExWUzF0S2JGbWY4eGUyd0ZPdEt5S2JKaGluVHhDR0wtTjY3MG5MWmt6aTll?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Joe Thompson, Minnesota's top federal fraud prosecutor, quits over ICE shooting probe - MPR News",
    "description": "Joe Thompson, Minnesota's top federal fraud prosecutor, quits over ICE shooting probe  MPR News3 Prosecutors Quit After Push to Investigate ICE Shooting Victim’s Widow  The New York Times33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star TribuneJustice Department sees ‘no basis’ for criminal investigation into ICE officer who shot and killed Renee Good, official says  WEAUFederal prosecutors resign over concerns about probe into Minneapolis ICE shooting, source says  NBC News",
    "published date": "Tue, 13 Jan 2026 17:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPdXlvdnA2WGVrTC03VnJtS1VRRVpPcGc5YlNYbmRBWktzOWR4b3I4eFo4SkVpUG1EbkZlWHlVWWNLMS1CT0RGZ0w3VjRTcDdVbWNjalEyUVhZeHVHYlFZU2NlLW1OUUdZM2VmUE50c000dDZsTWdaQ2ZlLXhBSmVfMllZR29zM3hrYUhqaThOYklnR3h4ejRESU05b1RaaWpHQ00tc1ZMSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Trump threatens to halt federal money next month not only to sanctuary cities but also their states - ABC7 Los Angeles",
    "description": "Trump threatens to halt federal money next month not only to sanctuary cities but also their states  ABC7 Los AngelesWhite House to end funding to sanctuary cities and states on Feb. 1  PoliticoCalifornia, L.A. brace for Trump’s new threats to cut funds over immigration stance  Los Angeles TimesTrump vows to cut federal funds to sanctuary cities, Seattle braces for impacts  KOMOPresident Trump says federal government will no longer fund sanctuary cities beginning Feb. 1; Mamdani vows to defend New York  ABC7 New York",
    "published date": "Wed, 14 Jan 2026 01:44:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOVGhObTdETENNV0psa0J1eFBNM2Nxcmd6akJVU1FFQkZRYjZ0ZG5UcTdmd285Z0R4VTNkUzRrMXJCc3Q3cFFUY0ZGRE5FWkNILVpGWVpwdk82dXR4d1I1UTUwaV9wNnNUejhIc2NZelBZa3ZSWlpLNU5wT3l6eGR4dkgxMGFxMVZNTUlydV9RTXFUUDFYbW1vdll3NEJDekRVOE5N0gGoAUFVX3lxTE9JN0RKT3pnNTRSZFpvZWhFZGE1TjhTbHFUV3l2OW5IUUxwYTFrdjVZRHRKSXZGVk9ZdUdGVjdzN0R2T2VWaHlheVpGdDJFMWVwbmhTeDE0NG5yd1hRWDRUTjY2OFNFeUh0M2xfZDVyQzdQMnhUU2FMRzVJM3VIMmE5Y2pfbC1seVVxdjJXYUJ0WjRDZ3hqWVB3dTlVallXQUxGR01SWTJVNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Administration reinstates hundreds of health and safety officials who were laid off - ABC News",
    "description": "Administration reinstates hundreds of health and safety officials who were laid off  ABC NewsC.D.C. Brings Back Hundreds of Suspended Workplace Safety Employees  The New York TimesUS Reverses Deep Cuts to Safety Agency Niosh, Reinstating Hundreds  Bloomberg.comReversal brings back 900 federal workers at the National Institute for Occupational Safety and Health  TribLIVE.comMajor Union Victory–NIOSH Employees Win Full Reinstatement After Nine-Month Fight  AFGE",
    "published date": "Thu, 15 Jan 2026 00:55:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdHdEUDZVM3RyajVVZ1JDa0dva0VVQXM3akdiYkRtdTRreWJsT2JUTk5yOVBGbTI4bmwtTTJvcHlxWXpRaVRQNFg0eEl4QktUa0wwdENBTVNZc3ZVTF93enJPaGxmejdCYW11Y3BpVXhnZVprdnlWd2lZcS1sbzF2blo4QkM5WmxXSFNwV0lnQlJNVDNMQ0I5S0hNM0tSMmNWdHNVUjhMNXFfQWlqTm9UVnhR0gG3AUFVX3lxTE1ZZ3VqQlRBVU1vS3BBSllrNnNibFdPSm1leWc3ZmZnZnZvai1oWnpzdFQ0Uk9yeXNzbmloT3p5d2N5N2lGWDZPRUlmXzZGd1ZvdFAxOWRrcU1OdW54WnN0WXZERzFGc09aY1d5QkdJY3pyYldrOXJuY0NhdEFuY0xIZVR3QXRBMnkzcDNHQ0YzWFNjQ3pFbFg0Smp3QS1fRVZpOXozRkNQclJHejBXelk4Rkl5MzFqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Human activity helped make 2025 third-hottest year on record, experts say - The Guardian",
    "description": "Human activity helped make 2025 third-hottest year on record, experts say  The Guardian2025 was the third-hottest year ever recorded on Earth, data shows  NBC NewsScientists call another near-record hot year a 'warning shot' from a shifting climate  NPRHow Hot Was Your Town Last Year? Look Up Where You Live.  The New York Times2025 was Earth's 3rd-warmest year as climate impacts intensify  ABC News",
    "published date": "Wed, 14 Jan 2026 15:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPNGFJUnFFV053bUh2QjA3bHpEVE8yU2c1Q1dIa19xd1VzTWtBdEJOMDNkUlVvbXRDQm1VbDFUVk9KMTU5RWVpNXllM0RPaHdnNFN2UGhwWGtZdzZ6MXo0VGx4RlIxOTJBSHRtdzZMUExPR0N4dmNjbUFGaUI3bERnLTMyZ25SV3pxUzVCcnlna0JaaFN3OFpHUzJoNENXdmJ6YUxHcVpXdFZDZE5Ra1dXOGdKbkhhaEJreWp5RzQ1ODhTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Federal investigation targets Champlain Valley School District over transgender athlete policy  WCAXMass. school district accused of Title IX violation by DOJ  WCVBTrump administration opens 18 new probes over trans athletes  The Washington PostTrump administration to investigate 2 Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday Telegram",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "Scoop: Over 50 House Democrats sign onto Kristi Noem articles of impeachment - Axios",
    "description": "Scoop: Over 50 House Democrats sign onto Kristi Noem articles of impeachment  Axios\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosDemocratic lawmakers file articles of impeachment against Kristi Noem  The GuardianIllinois Congresswoman Robin Kelly files articles of impeachment for Homeland Security Secretary Kristi Noem  CBS NewsRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT Mirror",
    "published date": "Tue, 13 Jan 2026 20:43:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxONEk5bkNlZUxheTd3eWI2WmxpOS11bUNPdjhvMHdoVWRUQ2dlQmJEX0JVUVNSR3lKVGhkME5qVE1LdDhXOHRGdlVMbXhHczNBUVl4RXltT1JReWgybWF5cklVTUVzdkNOYkQzVWtnbFpRVTNsYUVPckowRXBfVjJLV1dNc0FOdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Directs Negotiations to Adjust Imports of Processed Critical Minerals and Their Derivative Products into the United States  The White House (.gov)Trump says no critical minerals tariffs for now, will seek overseas supplies  ReutersGold and Silver in Modest Retreat After Surging to Record Highs  Bloomberg.comMinerals at War: Strategic Resources and the Foundations of the U.S. Defense Industrial Base  CSIS | Center for Strategic and International StudiesTrump sets 180-day deadline to counter China’s control of critical minerals  South China Morning Post",
    "published date": "Wed, 14 Jan 2026 21:23:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxOblowNFl2Ri13UWdOQk1oNk1DNWY2czY5VU9pb1BvTWkyN1VBbnpFd1lMWWRaNC1EbTFhSThhWWsxdlR1NnJZYXEzemNFeWcxblBQakRYRUsxbW5MOHF6bFA1bzc5WXptaFZTRVVSMWFvU202bmkzemNMX3I3N3lfM3k1RDNmZEYzYmh1U0xjXzVHaElBM0JxM2JzUjh0TFJXOGR5MG5xR2Jzazh5X2E3T3dDOWhoQzhUSGo5U0I0NS1BaVlJbXZBZVMtaVFYT2NjYWtfZE5PLVlBSjJuTWdCZjU5c3pkWVdyeGc1Qkw2Ynpwc09mc003S0ZVazVPemlodFJIUHl3NkJ0MDFHV0dicjc1UzAyTjl4azUyWjk1bW1aTXFXeFdnX2pUWWk3S1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Chuck Schumer Calls His Shot - The New York Times",
    "description": "Chuck Schumer Calls His Shot  The New York TimesOpinion | Mary Peltola Puts Alaska in Play for Democrats  The New York TimesInside Schumer's plot to retake the Senate  AxiosOpinion | Chuck Schumer just showed why he’s a better leader than his Democratic base thinks  MS NOWSenate Democrats Carve Out Path to Senate Majority in 2026  dscc.org",
    "published date": "Wed, 14 Jan 2026 12:31:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQU0ZvNEdta2RzU3owQm16VHgtZjJRWVZZcmktMk5NS3NPUURMMXRlcjhUSllGcjQzMDZFd3hrTC13NUlxR21iakFPZWlxdVhzY3JVTEdGakNaTXFydzNNWjRVM2kxamJQSUEyZmt5bkZFbXZzTGY1ZXd2dXc3dE5RMWNPVV9PbmxZRnIxaDlfTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Iran signals it will hold fast trials and executions for protesters - PBS",
    "description": "Iran signals it will hold fast trials and executions for protesters  PBSIran signals plans for fast trials and executions while promising retaliation against US, Israel  AP NewsOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesVideos show security forces firing into crowds in at least six cities across Iran  The Washington PostLive updates: Iran warns it’s ‘prepared’ for war as protests continue  CNN",
    "published date": "Wed, 14 Jan 2026 18:24:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQcjZyNXRxTEVlbDV0UTZJdy1JSm5ocXU0LVl5ZjZTQzM4UVZVVWNFNW96ajdxeHBSakpaRWVnMTlfNDB0RUdidl9wY2xDdjJjZDVDM0VOaldhMS04Q0hUeGFqNHE0dkg2SEw5THB1Sm1KN1cwYVB4SGE4X09qWFZTd2ZDQXZtc2lzMU1nVnMwRXFyTnFxSmRFdjF0eWpWWmZiQVFIS9IBqgFBVV95cUxQSlRzN2lDenpveHQ5bzRyeDJTSGVpS0J5eVVIWnFLeXJtMlI4dXBCbWlTdHM1MzJVQ1d2eVZwa2lNX2pSQUZsd2Y3clNhVm5tQkdDTXFrZGpFQmNaRk54Yjc2dVREQ1MtbU01YUw4TU10cTc3UXFnYWp2dTROeGxEX2dSc243YVFvbktsNTJhdzR1TnRLdTN0NXdXaXo2NXJjeTM4X2pkOXJlZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Senate backs Donald Trump in Venezuela resolution as Vance casts tie-breaking vote – live - The Guardian",
    "description": "Senate backs Donald Trump in Venezuela resolution as Vance casts tie-breaking vote – live  The GuardianMajority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University Poll5 takeaways from new polls of the Minneapolis ICE shooting  CNNNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  Yahoo46 percent in new poll support abolishing ICE, 43 percent oppose  The Hill",
    "published date": "Wed, 14 Jan 2026 11:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOcDVjZEFhQXRnSHpLcmZjRUVaSXp0V2xLaFU2WU9UamNoMmZMdVhjOGVPV19YcEl6YjVqeHRDS0lBYTdLaHlvRVRwV21UMlZCdkJORlVscXgxbUo0bUlaRS04N2diWlI3WEVmWk84ZmZjdXVUaFZXbmw5RWtDQm9MLWp2TkxhQnRlRkhtNE5tMHBVVDJJbU9mXzFDQlQ3aWVSZlQyTjBtOHVfX1FUdU5nNDE0QUVkU0hhcGN4MHRsa3pBSENuakJjQ1lUYS00R0RaS0JBQXRRWlIxelE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Clintons refuse to testify in House Epstein investigation - PBS",
    "description": "Clintons refuse to testify in House Epstein investigation  PBSBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesWitnesses Testify on the Use of Chemical Abortion Drugs  C-SPANClintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsRepublicans say Clintons risk contempt of Congress for not testifying on Epstein  NPR",
    "published date": "Tue, 13 Jan 2026 16:50:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQNWhua1NnMWpKUlpiYnkzMW5jSE5heUE4RkN6cE5UT1lPRDQ4SDZ1cDN2Tl82QUwyMmFuZ0xUTGh0clVIM3FsX04wUG5Yc01GSmVEdkp3dUhZTmItS2N0b2I4MTNYXzNwRHhrb2FoeXQ1cXh5WUNoZ1dkV2pDLXJOMzJaRG91RDBPMUFJbnFNb1VGSnNTbzRNRkJXb9IBoAFBVV95cUxQSXFKX3VPU1J2VkxONWVudHdia0hMb2VoLVZycTFKeVhlVHdkQUVXRGFuUm1zZFlsaEtDZ2owTlFQQzIyYjhuei02ZVgycHZlLWREYTJEQmh3LWtYZ09DYWNDSkRxWjNFdEdpeTFQM1J6TWlHdG53MENyX1ZyZWpmMHFCUVAwYV9ES3BIVTBxR0V3WjBYV3VmT2s5YTI3Uk1W?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Man caught on camera saving 2 toddlers on Florida highway - ABC News",
    "description": "Man caught on camera saving 2 toddlers on Florida highway  ABC NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 23:29:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPbkxDc2JnRFdfa0tFZGszejdWajdXQXhmR0diWlVoQ0FKTGd5YkFyQ0Z5WWpJYVZkMV9SdnBlcnlPTEpnT28tOWhuWHlLY1hhOFYzOTY1bWZ2M2pkRl9PRmhWamRXNmVBelE4ZXVXNGsyd1B0dEpJbGdJQk8ydzktaC1VTGxiTEdSXzhLMmxfczNQSkJaVDdkOEFZMlZ6ckgxdHFwTGs0c9IBrAFBVV95cUxOMk9IeExYRlNJeVVsYnpWQWdRV255RTFLYWJBZnZhMVRqaHlrcVdGS2lTWERJaGhOZDJWdkxOWWpVbDM5SnRlV1NwTW1xRU5sdjZPc3VuQXNsbVhBVENtenpVcGk0eFBXTGdDeTYxY2lxT2ttNElEUGFnM05LQ29aRFdlTlZjdDNmYTRIdzBGN1BFRGUwbGJiUUg3X2lmWk1CMmw3Z2o2eFpoTUpj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Governor Kathy Hochul’s 2026 State of the State: Your Family. Your Future. My Fight. - Governor Kathy Hochul (.gov)",
    "description": "Governor Kathy Hochul’s 2026 State of the State: Your Family. Your Future. My Fight.  Governor Kathy Hochul (.gov)Statement From CUNY Chancellor Félix V. Matos Rodríguez on Governor Hochul’s 2026 State of the State  The City University of New YorkWhat’s in the 2026 State of the State?  City & State New YorkLower Bills and ‘Go Bills’: 8 Takeaways From Hochul’s State of the State  The New York TimesGov. Hochul's State of the State; Iran \"Prepared\" for War; Supreme Court Hears Arguments on Trans Student Athletes; The 'People's Republic' of Astoria | The Brian Lehrer Show  WNYC",
    "published date": "Tue, 13 Jan 2026 20:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNU2FEWnJUNnRkVzBUbWZjaXhseURFUjBPWkJ2R1Z6eGJhcVFVemNSZ21uMGk0N0dBVEt5MnZLd0pNQkg5ZWEweFZRazg3VGs3UjJLbzlQMzZQcVVTdzNXaEVubVVaNTlhc1V6MnUzNVpxMTRrS1dZNk5VNlBvX2d1OWo0aEVYYlNDeHU3SE5yaDduS1IxeXBVTmwwSlo2c2Q4cDhNZTFZelM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.governor.ny.gov",
      "title": "Governor Kathy Hochul (.gov)"
    }
  },
  {
    "title": "The big bills to watch as Colorado’s 2026 legislative session begins - The Colorado Sun",
    "description": "The big bills to watch as Colorado’s 2026 legislative session begins  The Colorado SunColorado begins another legislative session with more desires than money to spend  Colorado Public RadioTrump factor, budget cuts and Gov. Polis’ final year: Here’s what to expect in the Colorado legislature’s 2026 session  The Denver PostThe bills already in the works ahead of new state legislative session Wednesday  Denver7Senate bipartisan friendship, shared grief set tone for opening day of Colorado’s 2026 session  Colorado Politics",
    "published date": "Wed, 14 Jan 2026 11:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5oYkh2VUV5dlBDQVZDZVVCM2NNWXVLdUdKYVZSNzh5TmxrN2ZiODhXVEJmZHZ3RE4tUG1mVUpnRy12MUFkcmlLOVBGRk9pdjRRLVo1UjJKcFIzX1JKb3p0M3JIWjN5OWFUYWZhVUtzNzZ2MlpjNDktMDIzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://coloradosun.com",
      "title": "The Colorado Sun"
    }
  },
  {
    "title": "Texas breaks ACA health insurance open enrollment record - The Texas Tribune",
    "description": "Texas breaks ACA health insurance open enrollment record  The Texas Tribune1.4 million fewer people enrolled in ACA plans as premiums spike, tax credits expire  ABC NewsInitial Obamacare Enrollment Drops by 1.4 Million as Expiring ACA Subsidies Drive Up Premiums  The New York TimesACA enrollment sinks sharply as coverage costs soar in 2026  CBS NewsAs enhanced ACA subsidies lapse, millions poised to drop health insurance  CNBC",
    "published date": "Tue, 13 Jan 2026 21:58:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPazhYQUxxcTByclpKaG5fMTNscGdhdlRlWTA4aGIwbUx0dXRDNzZ5U3R1RHI1OXlTeU50M29fUVVsVTM1UUxSQ1ZFSXhhSjFZTFY0b21uUklvRE54dXFRbjZVSDBHSjNJdjRaTWNDLV8tTjcwQ2ctc0ZDTl9qRFIxdTktZXhsbU5yTjFMV1BOT0p2WGNCRVBTS0NEZTNjNUhRN1dr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Immigration Detention Expansion in Trump’s Second Term - American Immigration Council",
    "description": "Immigration Detention Expansion in Trump’s Second Term  American Immigration CouncilFour migrants die in US immigration custody over first 10 days of 2026  ReutersICE Detention Expands Dramatically; 70,000 Immigrants Now Jailed, Deaths Increase  Democracy Now!Five key ways ICE detention centers are booming under Trump  USA Today4 migrants die in US custody over first 10 days of year  The Hill",
    "published date": "Wed, 14 Jan 2026 15:03:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5DdGwyR2ZLVE5jT2tZMWtkRXpER2E2ZUlnSFp4WS1JdUdVUVhhNldoZzd3bW1RdElfQzY2bXdFWFVieVFfQWI5VGd2dXY0TUVoWHBMcHJGczNseTlkdE9NYXJDTzI5eEFySXFZTDJIckdWREMteEZ6MkllTkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.americanimmigrationcouncil.org",
      "title": "American Immigration Council"
    }
  },
  {
    "title": "Nationwide Tax Competition Heats Up as Missouri Governor Calls for Zero Income Tax - Americans for Tax Reform",
    "description": "Nationwide Tax Competition Heats Up as Missouri Governor Calls for Zero Income Tax  Americans for Tax ReformMissouri revenue surplus nearly gone as Gov. Mike Kehoe unveils his budget plan  Missouri IndependentGov. Kehoe asking legislature to have Missourians vote on phasing out income tax  Spectrum NewsGovernor's budget calls for major cuts to spending as revenues wane  Columbia MissourianKehoe details repeal of income tax, Democrats mock ‘Tax Hike Mike’  FOX 2",
    "published date": "Tue, 13 Jan 2026 21:19:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOaXM4S3Fwck5PLTdYS1NxN1U0amNqSHdrMFRybk1abDMzU1R2V1hyaXpOVEhPb3lzZlkyaHZ4NUhyQXlvX2IxVWdDLUxXUmgxcG9PMjlkLTM3cXhzNXFHQno3MlFOX0Z3UmFFZ2o2bF9nQzg2cjRfYkNCY090T1NwZ1VKcndXRkxmV3VGeXdYbzMxQTI0M0JsV1pzai1VZWR2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://atr.org",
      "title": "Americans for Tax Reform"
    }
  },
  {
    "title": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention - ABC News",
    "description": "Oglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention  ABC NewsFour Oglala detainees located, three still in ICE custody  ictnews.org'A deep irony': Native American legal expert weighs in on racial profiling  MPR NewsOglala Sioux Tribe says ICE illegally holding tribal members from Minneapolis raids  AxiosHomeland Security responds to Oglala Sioux Tribe  KELOLAND.com",
    "published date": "Wed, 14 Jan 2026 07:14:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQTUxMLVI3eVZRVS0zWlhhcU1HYXc1V0htZXNKa0E4VGw0blM4RG1qVE9tZFNuVGt0T2kyRnViVk1ibkVDTG5TNGdyUFNtVl9vTUUxSFJzdzU2Ynh0QnZJeU91akE2OVRoT2ttQ18wcTBCM24wZzZFZ3dLdnh0bnZkRkFQZzJMUjNhcENUS0pQZVk5MnJ5Ny10UXNuUTVjajRvWXZndUpVTdIBrAFBVV95cUxNUEFBbEJBd090c1Y0LVdnd0dHSkhseUlwOTRPZk9CdlM5dS1JRk9ON1ZiakY2RVd4UUQyM0FQNzZZVHlzY0psc2ZDeUExNHJPcXlNcV9neVRJVE9NWnVUelRtNE1sOTRDeDJTZWlkNFBOWWduc3hLbDZSd2R3d01IZXBveHZlOWV4UmxRV0ttc3JWOTFfSmJSQnJyZTJZS1hpcU00eFRFNXZOWWlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Kitchen countertop workers are dying. Some lawmakers want to ban their lawsuits - NPR",
    "description": "Kitchen countertop workers are dying. Some lawmakers want to ban their lawsuits  NPRView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 19:29:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNSEY3aW8tTEdtSlAxQ3RJVVNnNUduTThqZ1VkbFJ3eE94TTdrRVM3VFlocTVBM3htZ1RUQ0xrb0JGak5rM1kyZFRyRWtaTzhzN0NxLUNmYkRMc3BoYzhINWlLdFprSG1ra1pnU2d5dVhRSUhhZG5nWnBzcnN3cFlTTm04eUJjMFV3bFl6S2hfcDdfWHU5RnA5SHVhcEUzTExsMjJOaC1YTG04TzZ5NTlla3pyUXFKNFMycjI4MWY0UTU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "E.P.A. Moves to Limit States’ Ability to Block Pipelines - The New York Times",
    "description": "E.P.A. Moves to Limit States’ Ability to Block Pipelines  The New York TimesNew EPA Proposal Would Strip States’ and Tribes’ Authority to Block Oil and Gas Pipelines, Other Infrastructure Projects  Inside Climate NewsTrump set to limit states' ability to block energy projects in water rule  ReutersEPA proposes limiting power of states and tribes to block major projects over water concerns  AP NewsProposed WOTUS rule could ease federal regulatory burdens, but questions remain for states  Brownfield Ag News",
    "published date": "Tue, 13 Jan 2026 17:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNU2NHRnRPQW9iZDBCdVREbUVkaWZRSTBRdHlaNHJGdmt4VURacWU3SFNCNklWVTdhc2VnSHZKbDNxbEZ5LVlKblZfTVVZdDJRRzZHc2d0ckg4Y181Y1BZQ0hTaHhxc0d1UlFzWE5yRjdBaDRQMkF2eWRXUFp6bW9vUTln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Best friends die in Florida after sand hole traps them underground: Sheriff - ABC News",
    "description": "Best friends die in Florida after sand hole traps them underground: Sheriff  ABC News‘God’s got him’: Honor walk held at Gainesville hospital for teen killed in sandpit collapse  WCJBCitrus County community grieving after 2 teens die in tunnel collapse: ‘They were just kids’  FOX 13 Tampa BayTwo teens dead after hand-dug tunnel with 'sugar sand' collapses in Florida  FOX WeatherSecond 14-year-old dies after falling into Citrus County sand hole  wtsp.com",
    "published date": "Wed, 14 Jan 2026 16:53:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdGlKYnA5Z1Q1U20zUDJRMW1qNDc5Q3Vka0xFaTJFbG9MTjA3aG5xX1VZZWFHT0s2cUZ1WXdIWG5YVWlNSnluMnVOQmtUMzFTWmhVT3ZIMmtIQWcwRjdvcjM4MEdrRE1lUk5nMS1nRHRpR05JRG1tTWMyNm1ydV9lYmJ5Q1NSeTBycV9ELUxWQms5MWhvdUHSAZsBQVVfeXFMTTI4YXZtNVViMTBoSmVWX1B1SmQ2SWkwYVUtSUx1Y0JRRlZrWkJqT1JpUDJGYzBfN0JtN0RXdkdRYnZOMWNXSVpCUE1zMm11aVYyaVVPSml0eDBCeGJOSnlhcEJyclZ3T3ZXZjZNRGk3Qm9DVlFCTE9UY2ZDRnhnUVpSNmZOcVJ4cTRPbmc5bUQwZHVkN1l4aFp0bGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State - Iowa Capital Dispatch",
    "description": "Gov. Kim Reynolds unveils property tax proposal at 2026 Condition of the State  Iowa Capital DispatchRob Sand: ‘I would like to see the math on it’  KTIVRob Sand 'concerned about what we didn't hear' in Reynolds' address  The Des Moines RegisterGovernor Reynolds addresses Iowa cancer rates in Condition of the State  WHO13.comWhat the governor’s property tax plan could mean for city and county services in Iowa  KCCI",
    "published date": "Wed, 14 Jan 2026 02:37:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQWC1mYmdQRUgtTW9mSExxTnpLczU3bDZmSUhELWpXRFVrV1pYSGRpSkJ3bmY5aFo3QXNYVW80cmgtdUQ4RDF1QTNldGJmaDVDLVVoZ2t0N09iWGQ4UGxLUVF6clIwSFlyX3lnbkVNRWZVYk9iaDRGWUxhLTVLQjdLczNFTGRqU2dycUV3VTVKU2tuVzFLckEtNC1WNVRpR2puNHR4c3ZsU0dQRFJIYmYzNlNsRkl4TEhVNk1IbEpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://iowacapitaldispatch.com",
      "title": "Iowa Capital Dispatch"
    }
  },
  {
    "title": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders - WPR",
    "description": "Wisconsin Assembly advances constitutional amendments on DEI, public health orders  WPRWisconsin Assembly passes bill to criminalize grooming  Channel 3000What to know about child grooming, E-Verify and other passed bills  Milwaukee Journal SentinelAssembly approves constitutional amendments on discrimination, closing places of worship during emergencies  WisPoliticsState Assembly returns for first floor session of 2026  Spectrum News 1",
    "published date": "Wed, 14 Jan 2026 15:39:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS1hYZFdWLWJiR2p0dnZzT242REtlRDVCWTRUeWhVTWFUMFM3OTQxSUVKNXlaRERLMmtxVGlFdEVQcnJMbjJrZkJuSkw4UFFrNFRLTDVZYzRHS2t1aEpmak1xRlZtMVhDR2dNWDg3OTFQUFFleDFXSGw3V2lnS09SclpWSWZPS1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wpr.org",
      "title": "WPR"
    }
  },
  {
    "title": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad - PBS",
    "description": "New poll shows most Americans think Trump has 'gone too far' with military actions abroad  PBSNew poll reveals majority of voters oppose US strike on Iran, say Trump has gone too far abroad  PoliticoWhat Americans think about Trump's military intervention abroad, according to a new AP-NORC poll  AP News56 percent say Trump has ‘gone too far’ with military intervention abroad: Poll  The HillAmericans not on board with Trump's military interventions, polls say  USA Today",
    "published date": "Wed, 14 Jan 2026 18:26:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNaWNFR2hpYkk1RVdfU0syYl9uZXJkc2FXeVBwOVJzR0xZeDU4cG5FUXd0Q0JpUDdzVjNmTjVpWDNkWTVkYXFjNzc5ZWRESFBJWEJvb2lBTlVEbjR6OFg3YnJYbVdVOXZaZE1yVnhHeXI5VUVkaFlPTzJrOFpnSG12UjNRb2laRzZ5SFNiNWxleDNiZzhmS3NDQ2F6dWZuU0lQZ3Y2VmtSZktTallXN194SGhDUnVyblZJU0pBckVfMHpkZVXSAcgBQVVfeXFMT3k0VjRzcDc0a1g1RUdkOWdlcUxKYlhoY2xJX1Npa2pYbGNSdi1TOHhscjl3TzBFUjg5UWZ6ZC1sNEpEUlBaYXp1M21pUl9fejhoMmV2WU9ydGpsMFNZdi1RbHpVY3BHNnBNRTRMT2otbHl5akFJcXpVeHlNUGJ6Q0VNLVVLQ1VHV3VBZ1dJanRJaVhWVjVUazU3SU9nSFlibGlWNFhrTml5aUpQekFsU25teHhWZVk1ZVREUS1yNktpVEJTUW1Jcng?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Crowd of 100 confronts immigration agents door-knocking in south Minneapolis - Sahan Journal",
    "description": "Crowd of 100 confronts immigration agents door-knocking in south Minneapolis  Sahan JournalICE officers pull woman from car in Minneapolis as operation continues  BBCVideo shows woman dragged from car by ICE agents in Minneapolis as she tells them she's autistic  CBCWoman seen on video allegedly blocking Minnesota ICE operation with car as agitators surround agents  Fox NewsWoman dragged from car by ICE agents yells ‘I’m disabled’ in chaotic scene in Minneapolis  The Independent",
    "published date": "Tue, 13 Jan 2026 20:01:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNUFMyaXRvRE5yZ2dUNnZBaHd3ZEtHS1I1em9oVlVnb0FKbXFTeUZudEtaQnc1anhTZFhMY2Q1ZjNHQlNMV1lXVnJUUkRSRkVTN2xPNnRsWkdpd3pPUXdEZXROaXhCaDRJOVNDLVU2cjhBdjN3Q3YySnlGUVhHSWhpa2djcXpoYnlhakY1aGh1bzVsYk05NU10UU5GdzFuNS1P?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sahanjournal.com",
      "title": "Sahan Journal"
    }
  },
  {
    "title": "Office of Public Affairs | Kaiser Permanente Affiliates Pay $556M to Resolve False Claims Act Allegations - Department of Justice (.gov)",
    "description": "Office of Public Affairs | Kaiser Permanente Affiliates Pay $556M to Resolve False Claims Act Allegations  Department of Justice (.gov)Kaiser Permanente Settles Medicare Fraud Claims for $556 Million  The New York TimesKaiser affiliates to pay $556 million in Medicare fraud scheme  San Francisco ChronicleKaiser Settles Medicare Fraud Allegations for $556 Million  Bloomberg.comKaiser Permanente Affiliates Agree to Pay $556 Million to Resolve False Claims Act Allegations  The Wall Street Journal",
    "published date": "Wed, 14 Jan 2026 20:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQcHdJb2laY3NsVVRtQ1Z1dmJVWHlYYnI0bXJ3ak1MS0MxNVBKU0tGWG9wMzJzZTJLRU5kSnc4MDlNZzU3YVVTTmhTbmNqRERYcG9QdlVWb0VIRThnbjJKNXB1b3lrUGQ5TmZyRGFjT29Xd2hLaTNxZEY0NlJ0MnJVQnpjVm5yb2ppTVM5cnJZLXJjOUZuUEJlbU9WZ2NFZm5VTk1qdUE2VEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "19-year-old suspect in Mississippi synagogue fire indicted on state hate crime charges - ABC News",
    "description": "19-year-old suspect in Mississippi synagogue fire indicted on state hate crime charges  ABC NewsStephen Spencer Pittman: What we know about Mississippi synagogue fire suspect  CNNBurned books, children’s questions: The aftermath of an attack on Mississippi’s largest synagogue  NBC NewsDeborah Lipstadt has second thoughts about tying Jackson synagogue arsonist to ‘Globalize the Intifada’  Jewish Telegraphic AgencyFather pleaded with son to come home prior to starting synagogue fire, court docs show  WLBT",
    "published date": "Tue, 13 Jan 2026 13:31:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPM2RRNW9nUXZHYVYtTXB5YVhUMFdsM2J6XzZNU1k5YTRJNm9ITC1Ra1lORmxad0k5aTNaM3NrV2gzQUg2QlN0dzdVRTZzQjR6OWpHQlZ4dmQwYTEwbnhqeml5MmVvYWpmUUVldkNaSzVpVVpjTk9uZS1XQ2tab2N5NlpSVjVybk1sUk4zMzR3UmFtVEREb1dMMmFZU0swNXRlbHVyeUlRSXZfbVZH0gGyAUFVX3lxTE5hRWF4eTVzeFBpVEZqZm13cm1yQy1lcDlVY1I4TkRoc292OEc5ZWE2N3c1T2pyOEt1eUlOU2NEbnNPam1CWnBsdXV0X1FYQXdXREhwZWI3bE1BbkUzdFB1YnQxZ0FTSXgxblIxUENuUnVuY05jNVBwTnFHV1JrMTZIa2RXU1JpWVItek5XV2pzRHgzSWl3YlYzek80SFZSNHBmd2RjSDM2QWJrZGRpS200ZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump administration says Venezuela has released jailed US citizens - BBC",
    "description": "Trump administration says Venezuela has released jailed US citizens  BBCInterim Venezuelan government frees at least 4 Americans  CNNMultiple Americans detained in Venezuela have been released, State Department says  NBC NewsWhat Will Become of Venezuela’s Political Prisoners?  The New YorkerVenezuela Frees US Citizen Amid Gradual Prisoner Releases  Bloomberg.com",
    "published date": "Wed, 14 Jan 2026 11:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5odGtyOFNNajRyRGxaYzkwcUxvalhPdnZWUXd5c3FYeFlwWEs2UTVaZ3o5aEJoQ2FSNkhVR09HTHRxR3Yyd3NsZ2gwa292bEJPSEY5Q005ekNBQdIBX0FVX3lxTFB5LVJ4c2RqVGhjVXhjYVA0cGNIS0ttQXhYakhEa3J4Y1FRWF9QQUUwakFfaGExYnZBd3QwejVrR0JsaXpUS2xMYU1jdlE4MW1EM3pfaU5iQTM3TVNhZmRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Claudette Colvin, who helped spark civil rights movement by refusing to move bus seats, dies at 86 - PBS",
    "description": "Claudette Colvin, who helped spark civil rights movement by refusing to move bus seats, dies at 86  PBSClaudette Colvin, US civil rights pioneer arrested for not giving up bus seat, dies aged 86  The GuardianClaudette Colvin, US civil rights pioneer, dies at 86  BBCClaudette Colvin, who refused to move seats on a bus at start of civil rights movement, dies  NPRClaudette Colvin, Who Refused to Give Her Bus Seat to a White Woman, Dies at 86  The New York Times",
    "published date": "Tue, 13 Jan 2026 23:00:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOVlc5TkptaXZwb3NPN3MtNnJzRmtoQmRlNTdPVVVMQmRKbHI0MUowTGRQUWo0amU2ZXVUR0s3UTNNVmY2WUgyZFAwUVhsalRlWEtrN3liaTAtU3N2MjVMT20tS1VzeFc5T3J5dlpZTTNqSWR0V01IcmxSZ25KRXYtWFRDamMwSTJOTDBTMmVsejkzRlJEUC1md1VLUkVZSDRxZlVmZjlobUN5TFJYS0xNMkhJSUZuamhBRkJSeWtUaWxYcWhqblpkYUlTTDNzRlnSAdQBQVVfeXFMT0JDZllldm5kZEcyeG1Wam5aMU1zXzBGTXBXLUpKRmNjeVRYTTV6bG9QeWN6R0sxSWE0a1ZCUTZoTFR6N1lqYnhMaVIxNm14SXRGVU1pclJPNFliRndPQllqc256TjBMckw4TUxKME0yRjliVlhpUFgtampjd1YybFEtdXBUVnFaQmw2WlJFN1ZsT0FlaTliaXo0RGlYdkUzQnVaZXpzbVRIMkxjQVN4T0dRRWhzN1ZjbjVqOVIta2hLNWpCeUYtcE1ja3FmUjlOUEtPdEY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday During Operation Metro Surge Including Rapists, Armed Robbers, and Drug Traffickers - Homeland Security (.gov)",
    "description": "DHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested Yesterday During Operation Metro Surge Including Rapists, Armed Robbers, and Drug Traffickers  Homeland Security (.gov)Who are the ‘Worst of the Worst’ being arrested by ICE in Minnesota?  FOX 9 Minneapolis-St. PaulICE arrests convicted sexual predator who was allowed to roam free in Minneapolis because of Governor Tim Walz and Mayor Jacob Frey’s sanctuary policies  ICE | U.S. Immigration and Customs Enforcement (.gov)ICE arrests in Minnesota surge include numerous convicted child rapists, killers  Fox NewsICE: 13 gang members illegally in US arrested in Minneapolis  NewsNation",
    "published date": "Tue, 13 Jan 2026 18:27:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPeEVzVWYyQ3FHcVREbUFQZWpONjA5dUY0TkJhTnF2S2UySlpHd2pWbl9TRXJqS3Bvd0EwemxZTWFwNTIzYWdHcFFLZnlZQmR2T05OUm4tbDlVck9xVXFoUHVuclR0bWRzRnVOb28wVHhfb1BJS05USzUwR3R2cGFJa2NVYzlCbDd0Nl9XcnBEUl9aS2IzaE9aX3ZNeUc0eXFHckQtT2QtZkZSYWpmenp4Q3ZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Trump administration drops fight to tie transportation funding to immigration - Politico",
    "description": "Trump administration drops fight to tie transportation funding to immigration  PoliticoDOT ‘Accepted Defeat’ in Fight to Tie Funds to Immigration: California AG  NOTUS — News of the United StatesUSDOT drops case after court’s decision to block it from withholding funds over immigration enforcement  CDLLifeUS drops appeal of order blocking Trump plan to tie state transportation funds to immigration enforcement  ReutersTrump Administration Waves White Flag on Transportation Funding Immigration Fight, But the War is Far From Over  FreightWaves",
    "published date": "Tue, 13 Jan 2026 19:48:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOdTE5TzhKSTF2MUZYZE1jby1Zb0lnSko1NFR3bFVTTjFsM1VQWENKVjhrTkJOQ2NLU1lsd3hHeVRPbFhDS21DTWVSR3VfWUI3UjZ6eFlpUzN5SG56STNWc1paLUVha05DLWJnZU10azlsNTFEZ2VoQTNRVnZfbVJpbGxZZGJDQkh5eU1Dc0lkYTJrRVpE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families - SF.gov",
    "description": "Mayor Lurie Launches Family Opportunity Agenda to Make San Francisco More Affordable for Families  SF.govSan Francisco to Offer Free Child Care for Families Earning Up to $230,000  Bloomberg.comMayor Lurie rolls out new affordability push. Here’s his first move  San Francisco ChronicleSan Francisco mayor unveils plans to make the city more family-friendly  KTVUSan Francisco Expands Child Care Subsidies to Tackle Affordability Issues  KQED",
    "published date": "Wed, 14 Jan 2026 17:08:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNSlNxT0lHOTA5N3lkdVJldW5oNGVUZFJqWVV1MVlnUHpZVWRkb0hhVWZzd1R6X21pejBRYi1JWnpTZjN5ZEx6OWFVbzV0a2JaMkdmU00wbzM2MlFoV0pOYTFxN3VJdFExdmRNcTk0T1NZUkJ4bjNfczBXRS00V3hTdVZFNTFaVnIwT0owdTZ3TWNYeUhGV1NjTUFTZXd3Umtmc090NjQ5Zlgwc1hSSGZYeG5BRllyMXFOVVdNWFpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sf.gov",
      "title": "SF.gov"
    }
  },
  {
    "title": "Everything you need to know about Montana’s rural health windfall - Montana Free Press",
    "description": "Everything you need to know about Montana’s rural health windfall  Montana Free PressStates Race To Launch Rural Health Transformation Plans  KFF Health NewsRural health program will send $181 million to Washington state  Gig Harbor NowRHT funds to help local hospitals  Magee Courier-Simpson County NewsState outlines plan for $213M rural health award as lawmakers weigh SNAP waivers  Carolina Journal",
    "published date": "Tue, 13 Jan 2026 18:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNOWFVb0RFOEJtc2k1V1I3R3VXZnBLcUlRUXJ6UnctTkFPN2diZDdhT0FYU2l1ckwwQzhFZzlWMTRfZW92WF9kaWZ5VURjWlk4RjVONkx4LUVJUURnaXI4eDc5ZFk4S1kyRnVhcnpld2VMQk5UakZ1dC1FYVN1eTk2eFU0b0NGaGEzLWxQLUVhUkZPNGRQaUktWnVCM1pBaDZwVWZRcEZjN3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montanafreepress.org",
      "title": "Montana Free Press"
    }
  },
  {
    "title": "Vanderbilt University to establish full-time academic campus in San Francisco - Vanderbilt University",
    "description": "Vanderbilt University to establish full-time academic campus in San Francisco  Vanderbilt UniversityExclusive: Vanderbilt deal includes second property — an upscale East Bay site slated for housing  San Francisco ChroniclePrestigious university to open new campus in San Francisco  SFGATEThe California College of the Arts will close in 2027  The Art NewspaperWhy a 150-year-old Nashville university is opening an SF campus  San Francisco Examiner",
    "published date": "Tue, 13 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNeVpVd1F3aWJ6M2VYYlpKMENZQTdmemVIMnJUZDcxZW5HZ19zam1hU2h5OGJEX2Ywc0prME9qcm00MU9UZFpVNWFQM0ozSHp6R3dTVmNGQ1NFUU1hTWZ2NE45VEU5NFpoYXpvUVpUN3p3VzFobDBQQ1liX2d6UW1CRkhXWXAwNEhmb3dYY2VaS2dOQ05zMU1LRElLWVdJeVdCSFlTSmhQX29obThJMFlMS1ZEZHcyUFZu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.vanderbilt.edu",
      "title": "Vanderbilt University"
    }
  },
  {
    "title": "ICE agent who shot Renee Good suffered internal bleeding, officials say - ABC7 Los Angeles",
    "description": "ICE agent who shot Renee Good suffered internal bleeding, officials say  ABC7 Los AngelesView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 17:33:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTUk0Yjl0eWNKWkFXZ2Q2VU9VQUNYVGRGOXM2VjJ4d18wZURneHlCVnRXcTlORFBHUzBFOVFXWENfeGVGU282UldraUVVbHh1TGlscEt5T0NBOExtLWFZTEpDeU43VlJqcFJMLXlidUpFWmdRaFVmdUNSczhWNFNteW9oRm9Ga0RrYjN3TDctUXhtazN1bGY3ZzVPSEJrSEHSAaQBQVVfeXFMTzRpME83bEF2U0hEdXh2SzAwTUtIWngtdm5jRWJWbDQxbDQ1SW5PNFdRMW1yaFlaV3BYWGEwa1N4dmMtU0xBRUd2S3pMUWg0ZGZzVm9pUFV2YmJWZWR6aGpPM2hDRnhZX2pKQnlBX0o3ZDl1dHNITnZsUExhdWdDX2lpQmltY3VkN2dVc0g5cXoxdzJoUEQ5U0xJUFJUZlA3djdQS2k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "ICE Arrests Criminal Illegal Alien Employed by New York City Council - Homeland Security (.gov)",
    "description": "ICE Arrests Criminal Illegal Alien Employed by New York City Council  Homeland Security (.gov)DHS exposes background of NYC city council employee after Mamdani fumed over arrest  Fox NewsNYC Council employee detained by ICE, Speaker Menin reports  FOX 5 New YorkAnger Builds Over Arrest of Venezuelan Council Staffer As New Details Emerge  THE CITY - NYC NewsICE Arrests N.Y.C. City Council Employee at Routine Appointment  The New York Times",
    "published date": "Tue, 13 Jan 2026 23:33:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWDBwSGcyMGNCWkZvUklodGhza0Nqc1RPaHBvQTlKRUV0M2IyNXpfQUtNMmNKN3pLN1RRT3RmMkpIaFNTaVcwVU5JZkdFYU9sU1NYd1NRYzF5ZG5lWTJNQWo3MmQyMmdEb2JGUlNwbDl4LThwdnhydVJnUEdfdEVucUtaRkNVTjQ4dVFPMHo0TjZ3cEwyZVcwQ1RiZTNLZ0pfZzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Proposed ban on police face coverings gains momentum in WA Legislature - Washington State Standard",
    "description": "Proposed ban on police face coverings gains momentum in WA Legislature  Washington State StandardOregon, Washington consider bans on law enforcement masks to conceal identities  KATUOklahoma bill seeks to ban masks for local law enforcement in immigration operations  KOCOWA lawmakers move to ban law enforcement from covering their faces  The Seattle TimesWashington Senate debates bill to ban law enforcement from wearing face-concealing masks  KOMO",
    "published date": "Tue, 13 Jan 2026 23:59:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQSTl5bjFJVUE0cExobjY4eFZ5U09WSWRjQ3JGSEgtQzBERHJib3phQTdzS3FqTVdEaXVraG1HWXJONm1ybWJZYzR2dGlPV3ZTZk1hQ09TdzJzV3VMaFJwRExzNTA4S0dTbkVhVVhvc1Zrd1F4NV9pd1IxZmg3NnNhcWVQYWFXTEV4eHdoVnBjWXdZZmtoSzUycTZya0d6ZjdEOXc1WFhXVkRPNEJBR082eURrSklmNWY5Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://washingtonstatestandard.com",
      "title": "Washington State Standard"
    }
  },
  {
    "title": "Why unlocking Venezuelan oil won’t mean much for US energy prices - The Conversation",
    "description": "Why unlocking Venezuelan oil won’t mean much for US energy prices  The ConversationU.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTrump moves to block courts from seizing Venezuelan oil revenue in US accounts  ReutersWhat US oil CEOs know about Venezuela that Trump doesn’t  The HillThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  Fortune",
    "published date": "Tue, 13 Jan 2026 18:39:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNQlZwbklfZW84Z1VyYzJLLTc1S3gtcUNWSC1ETjE4NlUwdXZDQ0VPREVvLWlXVk9CZFJHTkVZMDNPazZvVlRIWlBKcjNmRWVrS0VNODdITjhWWFRrR0ZOOEdObWY2UFM2cXFuX2E1S2l6SkZ3Z1lDNHZqMWYzdDUwSU5OZ3k1LVhSWi04Qm9BUzA5UkdRVWN0R3VrQTJhMVRi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival - The White House (.gov)",
    "description": "Back in Michigan, President Trump Celebrates Auto Industry, Economic Revival  The White House (.gov)Trump in Michigan for speech to Detroit Economic Club: Watch replay  Detroit Free PressHere’s how Michigan voters feel about Trump’s handling of the economy, according to poll  ClickOnDetroit | WDIV Local 4Fact check: Trump litters Detroit economic speech with numerous false claims about economy  CNN‘It’s literally terrifying’: Hundreds protest in Detroit amidst clash with police, Trump supporters  MLive.com",
    "published date": "Tue, 13 Jan 2026 22:23:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQcUNTVDhuamswRjdtUEJka0Z2b3JzVmo2Z3RqWXRqem5DdXYzanBVX0VTWWdlNksyZTZpNUJMZVNuazA0U3NuZUFMYkVNelhHNlZTZzk3OWV5dHZlOXZuRUdBZzMxT3dRT1NIblg5NU4xSHZGWURXa1Y5SnVVLXR3VFlnNk5vb3VVY0ZfVU5vem4zQTdEX2lQMmhNdEJvdXRMdVJqZmo4ck10UUUzMDB2Zk5hYTMwdmtxR1gw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "CONGRESSMAN PAT RYAN LAUNCHES HUDSON VALLEY WIDE PETITION TO STOP PROPOSED ICE FACILITY IN CHESTER - House.gov",
    "description": "CONGRESSMAN PAT RYAN LAUNCHES HUDSON VALLEY WIDE PETITION TO STOP PROPOSED ICE FACILITY IN CHESTER  House.govICE Opening Huge Lockup 50 Miles North of New York City  THE CITY - NYC NewsConcerns raised about potential plan to turn vacant Woodbury warehouse into ICE detention facility  kare11.comPossible ICE detention center in Orange County, N.Y., has residents concerned. Here's what we know.  CBS NewsTrump preparing to warehouse immigrants like cargo  Baptist News Global",
    "published date": "Tue, 13 Jan 2026 17:09:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNa2UxbGxrME92dHA0eEFDRmlqN25YQ2dzVEwtVjh0Z3hYWEZmMTJScWxVLXlXMnh5RXZ0NXNOYXBxS3lYdTA3anZibEJISVVlSXpfWUpCSDUtR3pCRUNQamhQd2FHME5zT2Vob0NOUGd2aWNlYWFfa3BCOGhETFc5aGJ6QktUdXRjdEdzSm5RM3VFaFZHa2ZRVm9zWS1SYVIxV21rZlQzUXA3LWtiMlZxR01qMDByNmhWR2RXbVJTNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://patryan.house.gov",
      "title": "House.gov"
    }
  },
  {
    "title": "Ferguson delivers optimistic WA State of the State, urges action on key issues - KOMO",
    "description": "Ferguson delivers optimistic WA State of the State, urges action on key issues  KOMOState of WA: Ferguson drops maverick tone, backs income tax on the wealthy  The Seattle TimesGov. Ferguson says his budget proposal is 'laser focused' on improvements  KING5.comWA Gov. Ferguson calls for millionaires’ tax in State of the State address  FOX 13 SeattleWhat WA Gov. Bob Ferguson said, and left unsaid, in his State of the State address  Washington State Standard",
    "published date": "Wed, 14 Jan 2026 00:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugJBVV95cUxNT2pWdHpIZjhxb215MnpuanJtMUFVektwUUZmeTAxRUdmU3FZalVHcTgycWJ2eFFscXItUUJWZlBIcHFHbnNSZVN0azVwNjI2Z3NLRTlyUG16QTJfNFc2YnpzZkJ0cTNkdTNPbGZBY2lDa0ZENFdaMGsyNHQzb0s2bzh3NDI4QlNOOXlXVUpZWjNoNzRTVFVmZFEwSktkU2NGYURBUmxVQnoxOUpiZkMySzJ6YlpybnhlLXJNQ0dRYlRQWmc4MXpadTJuZmNvSmxmSXMxaVBURkt2R1dvRnMyaTJ6cFRPSE9FZkNhVWgwaXJMZDdsTGJmZ1pnY3NzanB5Zy1yaWgySUI5QlRjSE4zMUx3NW1TcWRpUHFXX0VqU3AwWHJxTVVOenZKNU5uRHRaSFdGb1BTS2lMQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://komonews.com",
      "title": "KOMO"
    }
  },
  {
    "title": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation - USCIS (.gov)",
    "description": "Homeland Security Terminates Somalia’s Temporary Protected Status Designation  USCIS (.gov)DHS announces termination of protected status for Somalis after group targeted by Trump  ABC NewsData reveals estimated Somali immigrant population in Ohio as White House ends TPS  WLWTTrump administration ends temporary protected status for thousands of Somalis in US  Fox NewsPhotojournalist's notebook: Watching a woman dragged away pleading, 'I'm just trying to get to the doctor'  MPR News",
    "published date": "Tue, 13 Jan 2026 17:48:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPcWdVSmYxUUx0U3pNamF4WkdDMlZjTWVpcE94cUdSSTVNeTAzYlpSMEpMal96LXJtanRybVJFVFRiSXVFV0tnQ3JXQ1NaLW1XTjJBMVB0RGlEaHpMUlVyQmU0MnJQbkpJZlVaUHlqWG5BSl9EZC14LWVJdlp0bVRienVGREtDZmtWa0cyTW83M3ZzOTYtbHU2U3V2cU5MaEpzTlFza1dyR1ZQRmp2bmhEVld4SnNWZXpXS0V3X2hB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.uscis.gov",
      "title": "USCIS (.gov)"
    }
  },
  {
    "title": "Trump Says He Will Impose Tariffs on Iran’s Trading Partners: What to Know - The New York Times",
    "description": "Trump Says He Will Impose Tariffs on Iran’s Trading Partners: What to Know  The New York TimesTrump ‘immediately’ imposes 25% tariffs on countries that do business with Iran. That could include China  CNNTrump’s tariff gambit over Iran risks derailing U.S.–China trade deal  CNBCIndia's rice exports to top buyer Iran stall on protests, tariff worries  ReutersTrump Could Hurt China, India, Even US Consumers to Get to Iran  Bloomberg.com",
    "published date": "Tue, 13 Jan 2026 14:35:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPenJNWHBaMFdqaXA4SElfd2ZUUVJqY1Z5cWhKT1BBUlB6MzBZeFJRcF96ay02Y0ZLTTFOdFEyU2JsTGhYTVJGMmZGLXAwR0NjaDFRWHozUmxuUkdoS0E4eTRWRTVwLXhzeUxEUldQMl9ZS2R1bG5taV9mTERrdmNGRGZ2cDRVWVla?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Scoop: Trump's envoy secretly met Iran's exiled crown prince - Axios",
    "description": "Scoop: Trump's envoy secretly met Iran's exiled crown prince  AxiosExclusive: Trump questions Reza Pahlavi's ability to garner support in Iran  ReutersTrump says Reza Pahlavi ‘seems very nice’ but questions if he can garner support in Iran  The Times of IsraelWho is Reza Pahlavi? The exiled ‘prince’ urging Iranians to ‘seize cities’  Al JazeeraReza Pahlavi, Son of Deposed Shah of Iran, Seeks Center Stage Amid Protests  The New York Times",
    "published date": "Tue, 13 Jan 2026 20:37:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOW5xN1ZSa0tLcy1INlFYV0U2M2VDVE40NTFPV2RGZ1c4TTh2VFp3NkwtZUtjUmFNd184OXhnZ3hfZjBSaWRIT1ltNXFOUGxUYjJ6ZzJibkdhUVMwWUIxRENxSnA1d1RYcEJfdmxXXzRmRWVVc2NQazhYNl8tc0ZxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad - Homeland Security (.gov)",
    "description": "DHS Reduces Wait Times for Thousands of Religious Workers Abroad  Homeland Security (.gov)Trump admin drops one-year religious visa wait period  The PillarUPDATE: Homeland Security Department says rule will address religious worker visa backlog  Catholic News AgencyUS bishops praise DHS policy change on wait times for religious worker visas  TheCatholicSpirit.comTrump DHS Rule Eases Disruptions for Foreign Religious Workers  Bloomberg Law News",
    "published date": "Wed, 14 Jan 2026 16:58:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOZEVpTTFkOHJHZHF6OHpybDNKaXN6SmJ0WGttQ1NiWHF5Q1NGMjBIdWJSMzYzQmxjYWQzRjlPVnJsS2JRNjcwNm1PT2ZzaWhvSXdHMEhqUDNaV3JVUmJJckNMUkVjUUFQV1MyRkZseHFuSkZyRV90WkpaMnNWbzNEMUh2bDVxUm1YSUt3cFlCbHo0ODgzaEczYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dhs.gov",
      "title": "Homeland Security (.gov)"
    }
  },
  {
    "title": "Adam Beckerink, Chicago attorney charged with murdering wife Caitlin Tracey in South Loop high-rise, is threat to community: pros. - ABC7 Chicago",
    "description": "Adam Beckerink, Chicago attorney charged with murdering wife Caitlin Tracey in South Loop high-rise, is threat to community: pros.  ABC7 ChicagoMan accused of throwing wife down 20 flights of stairs in condo stairwell to appear in court  NBC 5 ChicagoChicago man charged with throwing estranged wife Caitlin Tracey down Loop high-rise makes first appearance  Chicago TribuneCaitlin Tracey’s husband, charged with first-degree murder, makes first court appearance  Chicago Sun-TimesEx-Duane Morris partner charged with murdering wife  ABA Journal",
    "published date": "Tue, 13 Jan 2026 14:23:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxQdDZhSERWZ1BCWE5YNS1lSXdjVmh1UFIwcGEyX2M2N2RrZUt1X19fNkQ5UWNZTzJrS29tQWZjNHVBYmpIZW5XQzJBY0JNODFsR0g5bk5Mak5GRjBrZG10dFo5c2h1NHBVRGliN0tERGw5dkZCZWN1SkFYYXlNeEtTeW44aTgtbzFpa2lxODFtVk9jX3lsN1p5eGl2S3k0cFRnMFA3WVpETy1xVzQ5dFAzQTFza3NPaFNJZmtSSVk0M19EM1dhM2t2MjRKTkNtR0lMRmNUc0trdkhJclNiUkhSd3d5YkNfd3duMEZjN1BR0gHzAUFVX3lxTE43VWk1bTROQ1E0Z3hWTFRLRVhEZWtGYlZReWw5bzVVdnZNSVg0ajBVOWJrblplVzJlUzZDVmhmLTZiUHRuaEZXOWNjbUlxOElpS2djWW85TUNROXdWT1VpY0JpN0trVll0QmtfTFZQYTJKUWhDNVR1bWF2bWd1Si1jTjg2UnhHa2I0MHNUemZwbEV1MW1YWU5Zd3JoWFd2OUhwVUljTjZFa1ZYMWwwTXdtTVZSTjRLWUFaMjB1a3JGTmtya2N5SWJBUl9faVBBa281T0gwQXZtclFlMmlfbW4xMzk2U0VVRmFNcXFmRXBEd1pnZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity - The Columbian",
    "description": "‘We don’t want the fear’: Clark County students walk out of class to protest ICE activity  The ColumbianMadison students walk out to protest ICE enforcement  Channel 3000Spokane high school students walk out to protest deadly Minneapolis ICE shooting  KREMMadison students walk out to protest woman killed by ICE agent  WMTV 15 NEWSSpokane high school students walk out to protest ICE killing in Minnesota  KXLY.com",
    "published date": "Wed, 14 Jan 2026 02:32:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQNmlMbkVnLTJKalNOME9YR2VQTENlSXozN2piOGlfMlBCRHlmb2dKcHVVbEVjQXJ3OWllVnAyb29PZjZ3UXZ2cXl4SUl5d0xkZWREaERkYng1UWszc3lweE1RYnRTWjJJaGJjTUwxLXhoSjRaN1FIeGljYkx2MlZ4UGRSbjQ2dlJ6RGg1V0x6ZHZIVUtuczhVS0pqWVdWSU5jWHRuM0N1bWRsY2FRemVXOGxaa3dvSmRfdndKUEp2SmJVbWJGN0FYdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.columbian.com",
      "title": "The Columbian"
    }
  },
  {
    "title": "Coldest air of the season so far expected Friday morning - Bay News 9",
    "description": "Coldest air of the season so far expected Friday morning  Bay News 9Florida cold front: county-by-county forecast, timeline, how cold it could get  FOX 35 OrlandoTemperatures plummet tomorrow, showers during your Thursday commute  Gulf Coast News and WeatherColdest air of the season arrives Friday as Freeze Watches issued in Southwest Florida  WINK NewsCold front to slap Florida. See which cities will see freezing temps  Daytona Beach News-Journal",
    "published date": "Tue, 13 Jan 2026 15:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9oclFDdjhjdzVYWUtkZTZDZWNxZ2ZYNklMNDhVem1HeTJIdTJzQzJnQXJpTThkYzB6Z1RLaWxQUmQ4cjkxcTQzeEFQaUNzM0N2QkN0WWh4bmVqNFR1dnZpSEw0bzZNQUlkNlhzN29sZHBYV1BsVFVr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://baynews9.com",
      "title": "Bay News 9"
    }
  },
  {
    "title": "Mass Deportations Are Improving Americans’ Quality of Life - The White House (.gov)",
    "description": "Mass Deportations Are Improving Americans’ Quality of Life  The White House (.gov)White House links falling home prices to mass deportations, experts disagree  KEYEIt’s not just illegal immigration driving the housing crisis; it’s all immigration  The HillDeportation cuts rents but not in Sanctuary States  FM News 101 KXLThe comfortable lie about the housing affordability crisis  Washington Times",
    "published date": "Wed, 14 Jan 2026 21:10:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNQjJZN1J5ZHV3dGh2QTV2SkZuTjZBeFBIMFI0d3VJRk8tSWx5N3VHWTl4Y1phS010MkJiRnphcWJZNHctbVhMWXBFNU5xNENoLV93T0IwQmtsS1FKZlgwazVhX1Eya1NoSF9NVXZQQU5qYmdHZGpaMHNrV0cyZE5fMkVtZmMwZm03Ml9zZ1J5Slh3bmtsME9DR21sWDdiQWJKVFh1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds - Department of Justice (.gov)",
    "description": "Founder of Casa Ruby Sentenced to 33 Months, Ordered to Repay $956,215 to SBA for Diversion of Covid-Relief Funds  Department of Justice (.gov)Once-revered trans activist Ruby Corado gets prison time in fraud case  The Washington PostCasa Ruby founder sentenced to 33 months, told to pay nearly $1M for ‘diversion of COVID-relief funds’  WTOP'You betrayed this country' | LGBTQ activist Ruby Corado sentenced to 33 months in federal prison  WUSA9Casa Ruby founder ordered to pay $956k restitution for stealing from LGBT nonprofit  WJLA",
    "published date": "Tue, 13 Jan 2026 21:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQMmIxOWFLSWtrMWplZl9NRW1EYkQ2UUI3czBqbFNZNGFlSGFNRTcyLTVuczFvVGVsYkpVbnNwLUdRc3d1U2ZOSm04NVA0aXF4X3Y0b1FMNEl4ZzJ6blR2cl9oMnoteGxCOUNETGZQV0FLaUt5cWV4QmxMcHNlUGI5aUltU3k2YndlNmZtWlVCeVFOQ0RtakNlRFFJbEdrSWY4RFB4d3VacmlFc2ZueVJheThiTUdIaWl1MVBoYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "BBC asks court to dismiss Trump's $10B lawsuit over Jan. 6 speech - PBS",
    "description": "BBC asks court to dismiss Trump's $10B lawsuit over Jan. 6 speech  PBSBBC to seek dismissal of Trump's $10 billion defamation lawsuit in Florida court  CBS NewsTrump may have to disclose details about assets as part of BBC lawsuit  The GuardianBBC seeks to have Trump's $10 billion lawsuit dismissed  NBC NewsBBC to ask for Trump lawsuit to be dismissed: Documents  The Hill",
    "published date": "Tue, 13 Jan 2026 20:02:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNOG93SUZMUUZ1RU5DYWhHdnBoQ2FLVEh1NGt2WmVTV2ZJY1ZNU0xVVlppS0RPT1VGVjNkLXhmMEJxd21ZTUQ4eEx6NDhwVmpJMjZ4RjFCT2RjWDJRTnROcjlrclRQUUxxLWhpVUNzRk5tMmJuUFBlanYzS3hnOGtLbS1aUkVMclM3OWI2Vi04Z0pOR1RlTkNwVjJVTEVfWnBYRGfSAacBQVVfeXFMUE1pTFpTdmtkbU5mbmdiYjlFeFlyUGozX2o4N3JFTUZJbUFNZE9iXzBJRG5LUkNPQ29qRk5KZ01DQlpoZlBCbnVKUEpfb3J1NVpxLTFmaGI3bjFDS3JzcW1td0xfU2hKNHI2Rjc1TnIxbU93ZEFUdFpzZ21TYW5SRXp6MnVkTXltWThuV2pHYUVvbVZQMnZ6OUxXSUZZV1MxQkFWRjlNVEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants - The Conversation",
    "description": "There’s an intensifying kind of threat to academic freedom – watchful students serving as informants  The ConversationOpinion | This Is No Way to Run a University  The New York TimesA Texas A&M professor pushed back in a course review. His class was cancelled.  Houston ChronicleTexas Sends Plato Back to His Cave  The AtlanticNational education group condemns Texas A&M course material changes  KBTX News 3",
    "published date": "Wed, 14 Jan 2026 13:30:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNWGNBMmIybFR4RGVGQ1VMSVNXamJTTDY0U0lKT2xvMmcxZmxOZ2pqLUFEUWwwdnVXdzVaeGNsbmw5T1JYT2VYYUZkU2x1R3VvUDVDejRmVmlNRkNCaTYzblNqdVRuZUp2TXJVLVlVLWc5TUhwUjREalk0YllVRGtqRU03RklUcVhfUnJRZmk0c3V0V2RZblJQaVlYc1FERmtWT3M0NHJGYm9XVVM1UUltQ0YyRFRJSTZ2M0ZBUmlnWmo3TWZ2NmVJbmRPY0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  }
]