[
  {
    "title": "What the Supreme Court throwing out Trump’s tariffs means for you - The Washington Post",
    "description": "What the Supreme Court throwing out Trump’s tariffs means for you  The Washington PostKavanaugh rips Supreme Court majority's ‘illogical’ line on tariffs  Fox NewsTrump lashes out at Supreme Court justices over tariffs ruling  BBCThe Supreme Court Got It Right on IEEPA—But Don’t Pop the Champagne Yet  Cato InstituteSupreme Court Tariff Ruling: IEEPA Revenue and Potential Refunds  Penn Wharton Budget Model",
    "published date": "Sat, 21 Feb 2026 01:18:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPcTY2VU1oRWhLbzh0TkxGRHRwX1hNMm5aZlVQUjZCcXk5N29PTGZOOXc0RWRlMGY4WjJqVkYxb1VDazN6R3JsTGNmd0tGTHlOZm5wUmtTcGp4MU1ha2RjVHNmeHhvNHpWbnp6Yld0dTR5V1J2bzBUOFNBYldpWWR2QzBuVEgxS2V0Vi1oRzFhcUhyWGFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Was Anyone at Fault in Sierra Nevada Avalanche Deaths? - The New York Times",
    "description": "Was Anyone at Fault in Sierra Nevada Avalanche Deaths?  The New York TimesTwo Sisters Died in Tahoe Area Avalanche During Trek With Friends  The New York TimesOfficials investigate deadly California avalanche for possible criminal negligence  The GuardianMothers, adventurers: 6 victims of Tahoe avalanche are ID'd by families 'devastated beyond words'  YahooSkiers in deadly Tahoe avalanche appear to have taken route rated most dangerous option  San Francisco Chronicle",
    "published date": "Fri, 20 Feb 2026 22:40:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQZ2I3eTUwMk1qYVQ5cld5c0FGWTJjVzh1NlNOdTZyeHRXLUkxUE5vN2pqNk50SlNQOFdCd2JNak1aS21qMVFsdXhKbFFRTGlpN3pGX2ZBWjRlTXRkUmlFbmF4bzE1dndmenFqMDM4WENTcV9HN2wtekpNUlB5WUJueUdvdkpNaHRUYmt2bQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]