[
  {
    "title": "Nancy Guthrie live updates as person of interest is released, home searched in Rio Rico, Arizona - CBS News",
    "description": "Nancy Guthrie live updates as person of interest is released, home searched in Rio Rico, Arizona  CBS NewsNancy Guthrie Live Updates: Man Detained for Questioning Is Released  The New York TimesPerson detained in Nancy Guthrie case is released. And, Bondi testifies before House  NPRNancy Guthrie live updates: Person detained for questioning in her disappearance, police say  YahooFBI releases surveillance photos of masked person near Nancy Guthrie's house  WESH",
    "published date": "Wed, 11 Feb 2026 12:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQY2l0VlpvdktqYVd4UE1TYzJZOFBwMnFCZ0ljT2hNdEtLX1ZOS3ZIWGxTeHVkdklNMmpqdzhnQW5WM2lJYURNVUV1bzBzTGo0VDJTOERYQ2dqVXRvaUkwa0xIelk0cHlXYmlTNkNpN29zM0x0MEtEalNPam1QZ0lqQmNFekgza0F4VnfSAY8BQVVfeXFMTTM0TnhqRV9wU3p1WGtSaC1JTTE2NXQ1Y1JBM2xNNjU5cE85UzR5UVB3M1oyUEZNTjB3TERpVTI1bVNnSU4zUnBqUlZoTTFVSXVEMGRzaTE3TWlzTU1wZk03eUtHRm11dVJobXl6UG4xVm51YldzcjlsdW5PUVhtaF9yYVVXZVdXbWFqNHkwMWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "All flights at El Paso airport in Texas halted for 10 days for 'security reasons,' FAA says - NBC News",
    "description": "All flights at El Paso airport in Texas halted for 10 days for 'security reasons,' FAA says  NBC NewsFAA grounds all flights to and from El Paso until Feb. 20  KFOXFAA shuts down El Paso airspace  The HillFAA abruptly closes El Paso airspace for 10 days over unspecified security concerns  CNNFAA halts all flights to and from El Paso through Feb. 20 citing security reasons  WOAI",
    "published date": "Wed, 11 Feb 2026 11:50:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNRzhqejFrUzVDeTNYdXRiaGJZbGxjMU15OFlsVHA0R3ZCd09fcWNEQkpWX0pPQnp3eFNxY2haZ2NaWjJLR19ialpxbzNWcHB3QUc0Z0VxSHZIZl9Ta1hCNVhYZnc5b2E0cEg0UUwzQi15aXhQWEhGNkpfMndlSmNpTnFrNndNYkFlaDFVeEU2cmI0ZVNOcnRnQlF1THUyZElGN29WUXlmZFB3ZWJsd0F6aGJINA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Slotkin slams Trump admin after grand jury refuses to indict Democrats over military video - Axios",
    "description": "Slotkin slams Trump admin after grand jury refuses to indict Democrats over military video  AxiosGrand Jury Rebuffs Justice Dept. Attempt to Indict 6 Democrats in Congress  The New York TimesD.C. grand jury declines to indict six Democratic lawmakers  The Washington PostProsecutors fail to secure indictment against 6 Dem lawmakers  PoliticoTrump administration fails to indict Democrats involved in 'illegal orders' video  NBC News",
    "published date": "Wed, 11 Feb 2026 05:42:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOQlR1d1gzUTlnU2tKNDhPNzkxdzllQnI1dUxvaDV6bWoyNjd1M3ZPQjN6bFc2YTdOdHdjMkMzUjBPT0RYWmYwd05SanNqRVk4Zi1HOW1DZEFiZzVjYTZMclpUSlJHR0F6b1U3ek9ySGd4OHVtVG9ucFhNWUMzTVNLMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Late Night Mines Trump’s Million Mentions in the Epstein Files - The New York Times",
    "description": "Late Night Mines Trump’s Million Mentions in the Epstein Files  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldTrump told police chief 'everyone' knew about Epstein, FBI document says  ReutersHalf of Americans think Donald Trump was involved in Jeffrey Epstein's alleged crimes  YouGovWhat the Trump team claimed vs. what the Epstein files show  CNN",
    "published date": "Wed, 11 Feb 2026 06:31:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPeFlLRUM0VkpyczlmMS0yZGdqa0VDMFdVMVpaMkJHYmtSbzF4LWtZYzdlRV9RLXVZZ2lLSU5Da2NGWnZNNFVkaDl4eU4xSFdocV84cXdGOXVUMF9Zd1hTZlJaNUtpdGlJSFpOOTd1M0puWi10UXF3a3N0d3JaajNNSzdSNmVNcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too. - Politico",
    "description": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too.  PoliticoLutnick’s grilling shows Trump a glimpse of a grim possible future  CNNLutnick under fire after latest batch of Epstein revelations  The HillTrump Commerce Sec. Lutnick admits visiting Epstein island during family vacation  CNBCLutnick and Epstein were in business together, Epstein files show  CBS News",
    "published date": "Tue, 10 Feb 2026 23:14:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBaenVnUWNUWE5oNFVqZWw0MVJZXy1pRHg2aWxFMFZNOTZDMUlMN0FmMGs5ZlRMeUROa0dvckNSZmF2Y3paZGpnQmxicVN1US1DQXNKRy02eFRBcjg4azhySWl3YmtYUURoUlVadGtvaFM3Q2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Fact check: What Trump got wrong and left out while threatening to block the new US-Canada bridge - CNN",
    "description": "Fact check: What Trump got wrong and left out while threatening to block the new US-Canada bridge  CNNBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesAmbassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge  CBS NewsRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsMichigan leaders clash along party lines after Trump’s threat to block Gordie Howe bridge  MLive.com",
    "published date": "Tue, 10 Feb 2026 23:35:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBRNmdUM2VHQ2RSY3k5VTJGSFRMNzZVUE5hcTVvUThYMkJHc3owdGtSZlgtWnNnM2JmOXRGUWNCZi1IM3c2YmNpRzlDbDc2emlSb3ZCSVM1bmpweFZtV2R1eGFvRUxocDFFaHpBakNsRjZsUXJoU0taNkVUNV9pQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Annual governors' gathering with White House unraveling after Trump excludes Democrats - NPR",
    "description": "Annual governors' gathering with White House unraveling after Trump excludes Democrats  NPRPritzker joins chorus of Dem governors boycotting White House dinner after snub ignites 'chaos'  Fox NewsDemocratic governors pledge to boycott White House events after a Trump snub  PoliticoGovernors won’t hold Trump meeting after only Republicans invited  The HillDemocratic governors threaten to boycott Trump dinner over exclusions  The Washington Post",
    "published date": "Wed, 11 Feb 2026 07:18:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5yZWJZZUlFRkRLVjNvZW5KZl8ySUJGc0RSVU1jYkNZU3NwVUlwdHVYS3dBZ1d5SXZWSVZUbDNXVHl1aE0xWG4yQmVZaXBKeFVqcnVrREdxbXhtLUs0dVRGY0hUQUdoN0NMSUF4dDBrSHNPTXBkUDZUVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "House Republicans break with Trump, blocking a bid to protect his tariff authority - CBS News",
    "description": "House Republicans break with Trump, blocking a bid to protect his tariff authority  CBS NewsTrump Tariffs Set for Test in Congress as Cost-of-Living Woes Spread  Bloomberg.comGOP defectors help spike House measure to block tariff disapproval votes  CNBCHouse Defeats Republican Bid to Block Votes on Trump’s Tariffs  The New York TimesThe US in brief: Republicans rebel over tariffs  The Economist",
    "published date": "Wed, 11 Feb 2026 03:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBETVQ2TVVDaWRuWU81RmNzQnh3UTdCWU1jS3FEOC1jVzJBUDJRend0UVM5dUx5LXo5WTFfanFYZ3Fqc2w0eWRXOWxzZ2tGTkJMS3IwcklKdVppeF9NNFVybDdEZXp6UkFmZWfSAW9BVV95cUxNNTdKcXR4alhqOHFSUnY3ZkNuenFGZGRPS1ZSMVRLNENHdVk5ZDlWNTdYa1loYWVxQWFpYVBUb2xfUWR6eHV5Tk9Ba2I4ZzZUNEsyeXV4bTNCNHRSa0V0Zm1aX1EyYmlUaXRMUVdKVUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump administration removes Pride flag from Stonewall gay rights monument - The Washington Post",
    "description": "Trump administration removes Pride flag from Stonewall gay rights monument  The Washington PostPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesTrump administration removes LGBTQ+ Pride flag from Stonewall national monument  The GuardianTrump admin removes Pride flag from Stonewall National Monument  CNNTrump administration takes down rainbow flag at Stonewall National Monument  Syracuse.com",
    "published date": "Wed, 11 Feb 2026 04:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOQm0yX3VhTTNpOTVjRU53VnY1VzhKQWh1RVRJYXpORi1xdXgyV2xxN2ZCVlNRZWNKT1c2dWMyNWQ4MmJsUGE4YUtYMUFXNHFEcE1MUVpqMU1yZE9BNl9hYmptR0g4ekRIN2NFRDdRV3I2VkViMjRnVHFXXzRMSDFxOVNyQWFoVHFsWmpqaENranM2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Former Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit - CNBC",
    "description": "Former Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit  CNBCGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesFBI documents show what led to raid of Georgia elections office  PBSJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  PoliticoJudge expresses frustration with FBI seizure of Fulton County ballots  AJC.com",
    "published date": "Tue, 10 Feb 2026 19:56:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1vYzRJc3A4TUFPa1BndWh0N1hVSGhPbm13VDh4M0lJcWlKYk1VbFhLc0xicms0eE41T2ZJc2RfeElOZ0hGcTk1Y1lZU211eU9USFlmY054b0l4TUNYbmlWR2Q2azRBb3l2eXY0YkJjNVRvOUpadTFmWWhCXzVlV2_SAYQBQVVfeXFMUEhkUjh3eWhVSFlYbDNlV1pNVFJhWms0LUxTTlFqb29xU19PU0Q2cWpYWHRQb2R1OXFHVzVLRm41QWVNdy01Z2FFbjQxQVM1d3hWN2xMYTZYeDhTZG01NTRHbnZnclJ5M3dyWXZsakdjcFJhUHdTRFVIZW02amdzSzlabDVr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "How the SAVE America Act could make major changes to voting - PBS",
    "description": "How the SAVE America Act could make major changes to voting  PBSGOP Sen. Lisa Murkowski comes out against Trump's election bill, with a warning to her party  NBC NewsRepublicans are pushing to drastically change the way you cast ballots  The Washington PostKey House committee advances nationwide voter ID bill, setting up 2026 election fight  Fox NewsTrump touts bill that could make voting harder for married women  USA Today",
    "published date": "Wed, 11 Feb 2026 03:09:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQYUFFSnYyV2VmRjlRZThIR0FZYUxBSjJzb3lZaVZCeElQbDFjdFlydG5mS0QzWEtBMGo5SFE1SmJHWmdpUHlYRm5FQXFJbG15ekdnYXNXdW1BM0xnUUpDM3ZGR3RlaWVWdDhxMjdjclQ4ZXR1ZmV6LTJsOXN2S21mcllITzc4X2l3R3RTVXgzVVA2N1ZRZXQ3MUQ1bi1YZ9IBowFBVV95cUxNWUtFek9MeFlCX3ZWaGh1clRKT0NPaldaQlpfcHpNQ25oemVXMkV4QUpLRXh4dE5lYnBJRUUzZ25LLXhKUEZtU2NSTDZFQlFXZVJYVTBEOURCazMxN0Rhb2RRSzZrYXVHYWNPdHNDMXAxT2tROFZwdldvS0FNRFJWa2liMDJ2dmQ2dVF4bHpPckdwbHJjcnNDYU9YWDFqdFZDOV9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "EPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health - NBC News",
    "description": "EPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health  NBC NewsTrump set to gut U.S. climate change policy and environmental regulations, White House official says  PBSOpinion | EPA is right to reverse Obama overreach  The Washington PostBehind the E.P.A.’s Rush to Repeal the Endangerment Finding  The New York TimesTrump's EPA plans to end a key climate pollution regulation  NPR",
    "published date": "Tue, 10 Feb 2026 22:50:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQOXFkSFV2akM0aUEwUFg3c2d2anFDR1hwWDVsUWJTcFlsQU9oYjNyNEJReDMyWk0tcXZ4Rnk1bDZiM3VkeHZkX2kzLUd4d2ZGSlpZNnE1S3RSVkVoRFBqRmtvZHd5YnBHNnM5S2E4LXl2SWNLcFVLakxJVmI3aFdRR1pucUlzd01BSjRjMHRtbmxYZmd5N3lhdnJsOFpUMTJiMF9LSFdqMFlDNzJEWWJvX19nR3ZkUXk2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "ICE chief defends his officers to Congress as lawmakers mull DHS funding - Politico",
    "description": "ICE chief defends his officers to Congress as lawmakers mull DHS funding  PoliticoICE and Homeland Security officials testify before Congress  BBCTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoICE chief forcefully defends deportation campaign as scrutiny mounts  The Washington Post",
    "published date": "Tue, 10 Feb 2026 20:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObWdHVGJmcjFEMGVCWnQ3NkRULW5WbnlhbHBTbFBsWGcwSE5kZmx4QnRFd2NGX2lEcXFNZTRmTzBmVjRRaWRqc043RHl1NjQybnpITUI5Tm5uVWhueXNQMzlfTWI2Y25OUnJ6WnYzQTBOdnBzSjF4Vm5yYUNRSXo0UndOcjVsNlo1VFlqcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond - Axios",
    "description": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosEpstein Revelations Stir Chaos From Scandinavia to South Asia  The New York TimesJeffrey Epstein’s Bonfire of the Élites  The New YorkerSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianThe Epstein files might bring down a government. Just not the US government.  vox.com",
    "published date": "Wed, 11 Feb 2026 01:28:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPRHZ4Q3hqTjFQbDhUZ244a2dFaHJOWUJrSEo1TExQdEp1dDBhckxhZWVfQ1pySU9PTmZCRFE2UlJhNktpUDBFRjlNM1B0SXdiZ0hjLXlzYWNNc1hFTlZsZ282dzhKcm9xa0VxbGxZcDIwejQtdXc4cEk4dWVoNlJtVFFWVkRiUDJQMnBkM21kVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Sherrill endorses Mejia in special election for her old House seat - New Jersey Globe",
    "description": "Sherrill endorses Mejia in special election for her old House seat  New Jersey GlobeAnalilia Mejia Declares Victory in NJ Race After Her Main Rival Concedes  The New York TimesAnalilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage  CNNWhat's next in New Jersey's special election: From the Politics Desk  NBC NewsWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al Jazeera",
    "published date": "Tue, 10 Feb 2026 17:43:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQWHdYZEgxYmdTaXVDcTF6akoteExrWjhmYTBlYXl3WVhSa0xadkNWQXg2UHpSbDJGR3A0UURoMXVHTkhGRmsxdFJzbVdNWEpDelQwWV9VTmM2VElENkRJanphTzFLRmxTek52ekZFTXhGRjktS2QwMm1VU05CU1NLUmZQeTl3OHF3QWsySUN2SldFUTFWQkc1N1V5R2x6Zy1yd1dRcmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "New Jersey Globe"
    }
  },
  {
    "title": "S.F. teachers strike: No school Wednesday as union mulls latest offer from the district - San Francisco Chronicle",
    "description": "S.F. teachers strike: No school Wednesday as union mulls latest offer from the district  San Francisco ChronicleS.F. teachers strike: Schools to stay closed Wednesday, sides far apart  Mission LocalSFUSD schools remain closed Tuesday as teachers' strike enters day two  NBC Bay AreaSan Francisco Teachers Begin Strike, Closing School for 50,000 Students  The New York TimesSan Francisco teachers strike: Schools will be closed Wednesday as negotiations continue  KTVU",
    "published date": "Wed, 11 Feb 2026 01:33:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE56eEZ6VVF3WTJseDBPekFsTFAyUEJ5b1luZ3NvRGZPOU9ZMjlKaHpGeHc4ODJhZEZmSGU4dVlsZ04tWDV6Yy1LUVNjd2dmejA4Yjh1UlNSakVneWVCSEFQamN5TGN2d0MwQ1ozU0dvQUZqWTcySDlxZXRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Capitol agenda: Democrats demand more from GOP on DHS - Politico",
    "description": "Capitol agenda: Democrats demand more from GOP on DHS  Politico‘Complete nonstarter’: Administration allies say judicial warrants a red line for White House in DHS funding talks as shutdown looms  PoliticoDHS faces weekend shutdown with ICE talks inching forward  The Hill\"Absolutely pathetic\": The left rages at Dems on ICE  AxiosSome Advocates say Democratic Plan to Rein in ICE has No Teeth  The New York Times",
    "published date": "Tue, 10 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPTk85b1NpajFrLXY3SjlHMU8tejZUNE40azh4R3FGN0llN3FZSXFGYUgxbXFsLVNFRTlvd0lmTWxXQjdEYWF3aldBcTEzbE16enh2TC1oc1hTRE1hM0c2SGM1UUw2WU5WT2ZqUi13Z0poMDdlOXZ1bFE0T09qZnMydVlaMHR3WkFvUkZLOTZKbldCa1E0QVZtS2ZqSHoybkJrUFFxQW9Sc01LcjNPTlBz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Top Border Official Praised Agent Who Shot Chicago Woman, Evidence Shows - The New York Times",
    "description": "Top Border Official Praised Agent Who Shot Chicago Woman, Evidence Shows  The New York Times'It's time to get aggressive', Border Patrol agent says in Chicago shooting video  The Detroit NewsBorder Patrol agents say 'time to get aggressive' in footage that contradicts claims against Marimar Martinez  Chicago Sun-TimesMarimar Martinez shooting: Video released of Border Patrol shooting in Chicago  ABC7 ChicagoChicago Woman Shot 5 Times By Border Patrol Plans To Sue Feds, Release Previously Sealed Evidence  Block Club Chicago",
    "published date": "Wed, 11 Feb 2026 05:30:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE15azR5cHFrNk1hZkMyMGV6OS1NN0RxR0d4eWU2elZyRUE4VDJKZl9uVW0yYmZIZ2lFZjhaZkdSWnhaQnFuYnFXTjZhaTd2Si15eXdKZG1xWVZqNFl2YTBSdzE2ekxwQnBXOTl1VmU5c1dtM3ZseVQwSkV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Sylvia Luke Quietly Took Thousands From This Lobbyist Linked To Cullen - Honolulu Civil Beat",
    "description": "Sylvia Luke Quietly Took Thousands From This Lobbyist Linked To Cullen  Honolulu Civil Beat$35K Case: New Development Sparks Calls For Independent Probe  Honolulu Civil BeatUnreported donations complicate lieutenant governor’s credibility challenge  Hawaii News NowLt. Gov denies taking cash as bribery investigation continues  KHON2Sylvia Luke says she didn’t take $35k but may be lawmaker behind months-long mystery  Honolulu Star-Advertiser",
    "published date": "Tue, 10 Feb 2026 19:08:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNUXc2OFBZOG9FTEx1b2wzd18tNmM1LXNDbWxsb1UtUklObzZMekh5dGRqbnpLcDdramtOWlllOFVVMEhkbUVBcGRnd2JwVy14MHNYLXlmUWc5YWVDSzczUnlpWTV4SjkzYUp4a3Z4WWx4eFAwaG93WmNtN09waEVJVGN0eEZNWlpwZWpUWUxWeUJGbDBFcGR2aWY4MGdTX1FKeUhqSEp5d2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.civilbeat.org",
      "title": "Honolulu Civil Beat"
    }
  },
  {
    "title": "Ohio GOP leader says no to Trump election plan - Ohio Capital Journal",
    "description": "Ohio GOP leader says no to Trump election plan  Ohio Capital JournalAbbott breaks with Trump over president’s call to nationalize elections  Houston Public MediaThe Art of the Steal  vox.comWhy Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears  The New York TimesSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC News",
    "published date": "Tue, 10 Feb 2026 10:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdkdob2VRTzFIU3V1U3pFUHl1V0JQRTF2ck44ZW5qRHpZRDNsU3hLNGV5RlRvZm41SklTTTVoaWZoQk8zQTdNclZmZm9VMlNPalBxZXRXbjFnYnVVQTd1OUw2ME4tcmc1V3BqcHA2NTB2Z05rWVljOWZNLXRTc1FycDlPaEZqWU1IM2ZsSFp0Vkk5MFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ohiocapitaljournal.com",
      "title": "Ohio Capital Journal"
    }
  }
]