[
  {
    "title": "'Very strong' clues in Nancy Guthrie abduction, Trump says, as authorities race against time to find her - latimes.com",
    "description": "'Very strong' clues in Nancy Guthrie abduction, Trump says, as authorities race against time to find her  latimes.comLive updates: Guthrie search enters 7th day as FBI probes new message and authorities tow away car  cnn.comOne week since Nancy Guthrie was last seen, here's what we know  NPR'I don't want to imagine what happened' - Shock and disbelief in area Nancy Guthrie went missing  BBCBlood droplets, a white van, a ransom note: where is Savannah Guthrie’s mother?  The Guardian",
    "published date": "Sat, 07 Feb 2026 17:25:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxPa2VFMDRzZm0zTUxnWXBPZ1JlS3ZZTVZGMHkzNFpnN1JwRHR1VkZqZ3F2VXNZRXhNSlhGam0waXdUUWV3Y1draWhZQ1hoeEhwY0t4NDRSQjMyTWZOOEJuTWVqcGNJMUpyVWxjTXpRMlUyanFXdjJZNVpJRThUaFYyOFA0cEhiNXVGMjZRdUVaSDBfeG43Z2xIOXZIckVXUTRSQVBlY3BqMGJfX05NVGpkVkY5VHNDOG5pemdfVklwTnhXMzZycENTOWljNGFYT3Z5M19xY25ZWmo1SEVsUUxrWXJKQlZ1RkhjSUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Trump shifts blame to aide as he refuses to apologize for racist video of Obamas - The Guardian",
    "description": "Trump shifts blame to aide as he refuses to apologize for racist video of Obamas  The Guardian‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesRepublicans rarely criticize Trump in his second term. A racist post briefly changed that  AP NewsGOP breaks with Trump White House on Obama post as Tim Scott opens the floodgates  The Hill'Indefensible': Black Trump allies grapple with fallout from racist video of Obamas  ABC News",
    "published date": "Sat, 07 Feb 2026 14:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObDk2akxFaUFJX0kxN0ZEdWxqWHZ6LXg1Q1FlQnhvU2wtemlHaG04SVJvcUVSdXdycFI2dlNDQUlXUk95VDJjLWxFOUJVS0NWbGxuc25RUEUxOFZoNnpSUGRFa2RhYk5iWHpFVGVMM0FaM2IxS1VuX000X2xzTGloX1dXNG1DU1NCVzF0LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Rising Progressive Star Shakes Up Race for Los Angeles Mayor - The New York Times",
    "description": "Rising Progressive Star Shakes Up Race for Los Angeles Mayor  The New York TimesL.A. County Supervisor Lindsey Horvath won't run for L.A. mayor, ending weeks of speculation  latimes.comProgressive candidate launches last-minute challenge to Karen Bass for LA mayor  The HillCouncilmember Nithya Raman enters L.A. mayor race on deadline day  KTLAKaren Bass draws last-minute challenge from progressive ally in LA  Politico",
    "published date": "Sat, 07 Feb 2026 20:47:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE50SUxRMXFsSWc0dWFnUVlWNDVhZ2Y4bU9Eb28weFgySS0zc21yRnI1UXVnOGNBTzlrS2xLcGlrVFZKaXF5cXBzMk1jYWZTb3U3UmR3OWdjQUtXS0F1YzFFS2hQQXN6MzFGUFpxMFByWjFkanJCZXZnTWtFeG1yUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge grants continuance in the asylum case of Liam Conejo Ramos and his family - cnn.com",
    "description": "Judge grants continuance in the asylum case of Liam Conejo Ramos and his family  cnn.comU.S. Seeks to Expedite Deportation of 5-Year-Old Liam Conejo Ramos  The New York TimesTrump lawyers aim to deport five-year-old boy after judge ordered his release  The GuardianAdministration seeking expedited removal of 5-year-old and family, Rep. Castro says  ABC NewsUS moves to deport 5-year-old detained in Minnesota  Reuters",
    "published date": "Sat, 07 Feb 2026 14:30:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOd3MtTlEwcUVJWlpaMjNybzZKS2NiNjdrNDhHQnpIQnY1NFNOYlBwRlhoVm5sZmRHOUFfWjRpSjhxX0R2emVtdlhUaTZjTlZndEVPTXgyQjhYb0plOVM0RUJGN1o5VG5VbVJQenNiN01HR0pDOHltZUJETUs5ZVRQVFZIYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Members of Congress will have access to unredacted Epstein files - Axios",
    "description": "Members of Congress will have access to unredacted Epstein files  AxiosOpinion | Now We Know What All Those People Got From Epstein  The New York TimesMissing records from Bondi and Patel draw scrutiny in Epstein release  AxiosLutnick and Epstein were in business together, Epstein files show  cbsnews.comExplore who’s listed in the latest Epstein files release: See texts, emails and more | CNN Politics  cnn.com",
    "published date": "Sat, 07 Feb 2026 18:18:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNUM4TWxlc0ZGTFFGdkE4UmVLZU56QTc3OVE2bV9NT29HalE2OV9UM25IcVdlQVRuM1pxT1RncWo3QXpSQ3hoMGtpeE53VGVaZGVhb1QzWGV2SmtsTnlmdWg3M1I0dHE2NVJZWGhtVG9LdEU3dFJxWDJZNU91Q1pyQ0xBSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump and Mamdani find unlikely common ground on New York City zoning - Politico",
    "description": "Trump and Mamdani find unlikely common ground on New York City zoning  PoliticoTrump, Mamdani appear to align on zoning reform  breakingthenews.netMamdani sends defiant message to Trump on Fox News: \"He may be watching\"  tag24.comThe On-Brand Comment Donald Trump Made When He First Met Zohran Mamdani  thelist.comTrump and Mamdani's secret texting revealed  knewz.com",
    "published date": "Sat, 07 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOcXI5bnZjcW1US0gtSGVQRmlQRUhDUjVqQzFBcU9jRmRUQ2FPM3I2MksxVUZMY0o2WlhubllnWFhKYUllUGlQZkc5VGpUVkpNN3VpdThOMVJ1ZmhTTXVmdXM4RmNfRGw5N0hXS0gxbTVUUUhlV0JfUW5WeG4wMHZlbmp5RmNaYXdCY00zVWVKcl8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Four dead and three receive liver transplants after eating death cap mushrooms in California - PBS",
    "description": "Four dead and three receive liver transplants after eating death cap mushrooms in California  PBS‘No one warned us’: Toxic mushroom superbloom fuels California’s largest poisoning outbreak  San Francisco ChronicleFour die and three others need liver transplants after eating Death Cap mushrooms in California  Sky News‘Death cap’ mushrooms kill 4 in California as toxic fungi thrive in freak weather  New York Post4 people have died from eating death cap mushrooms as they spread in California after rains  The Independent",
    "published date": "Sat, 07 Feb 2026 17:16:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOa2V0T3pJS3hSMTBEU19SUGtJT3ZxUVdSeHlzUmlLQjFtXzJXWVlMeElsaHMwUlFIeGdRUHJXczhTYWhLNURPckl3SnNfLWlCUHFScVhqUlYzX1ZmMUd3Sy16RjFPZGplTjFDclRzX3gzWko2V29hTy1yNTVZRW9WMThKT190U2dXbFlyX0F2WTlLQ2MydnpfcTRxLWJDLUJTcW1rN0YyM1JvYzZIZnJ6aUd5UWlvbkpuM3NzZTNtOWNjdkR2NVpr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "What to Know About the Cold Snap in NYC This Weekend - The New York Times",
    "description": "What to Know About the Cold Snap in NYC This Weekend  The New York TimesFrostbite in minutes? It's a real risk from polar vortex cold.  USA TodayFirst Alert Weather: Red Alert for bitter air, coldest south; lake snow north  WHEC.comWind chills below zero all day  WGAL100 million on alert for dangerous cold, as some see coldest winds of season  ABC News",
    "published date": "Sat, 07 Feb 2026 18:22:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTXFxMHFYc084UHpmczdPUDV3ckZTWlRsaWh5TlJ3S2xpZElnbmhiMjRodEVmM0ZaYlZDWEZKRUxEY09UMU1mTkpMQzhvLXIxcjFIUy1DOHl1TjlPQkttX2x6aTV3Yks4cUtoU2dOVXp4NDZBOUFmY28yakdRVVNaRTBBdWVtLVNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US gave Ukraine and Russia a June deadline to reach agreement to end war, Zelenskyy says - AP News",
    "description": "US gave Ukraine and Russia a June deadline to reach agreement to end war, Zelenskyy says  AP NewsUS wants Russia and Ukraine to end war by June, says Zelensky  BBCZelensky says Trump wants Russia-Ukraine peace deal by June, before midterms focus  AxiosExclusive: US aims for March peace deal in Ukraine, quick elections, sources say  ReutersPressure for Ukraine-Russia deal mounts ahead of fall elections in US  politico.eu",
    "published date": "Sat, 07 Feb 2026 20:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNSjh2S19NUE9hRVN6LVFVQkUxVjNJeEx6Rk5wUzExUmNWS05kRUZKQmwySFpGUmVkTjQyNFhGbWpKT1ZWTXZERWFlaWkxWTJrOUxMckJMNDJ3LWRJdVNIbk9WbzRVMnkzS2dIV0ROQW5sdVFVWTF5TWtwUEpXLVhIS3lLVjdvWERMVENDd2xqRElZRVFTOEY0eTNNZndBSEhkQ0hRVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Judge orders Trump administration to unlock Gateway funding - Gothamist",
    "description": "Judge orders Trump administration to unlock Gateway funding  GothamistOfficials Pressed Schumer to Help Name Penn Station and Dulles Airport for Trump  The New York TimesFederal judge reverses Trump’s freeze on $16bn for NY-NJ tunnel project  The GuardianSchumer calls Trump claim that Dem leader suggested renaming Penn Station after him an ‘absolute lie’  The HillJudge orders Trump administration to unfreeze more than $16 billion for NY tunnel project  cnn.com",
    "published date": "Sat, 07 Feb 2026 16:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOU2hLNHVqa0swdUlYUVNZMTA1SVNHTkdxX1JETDI5Vm80XzhaVlZ0N1ktc1dwTm96V3lTaFd5ZzVad3k2NHdXS2U3b3EtMmlKVHBBUXZOZExkcWllbDkxZ0htc0lmdU51NHZpTWNmYk5JQkNIRkRRTEVrNkRUU3pWLUZYMGZqcnRrS1pSdXpTNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "Ohio Man Charged for Threatening to Kill the Vice President of the United States - Department of Justice (.gov)",
    "description": "Ohio Man Charged for Threatening to Kill the Vice President of the United States  Department of Justice (.gov)Ohio man charged with threatening to kill Vice President JD Vance and possessing child abuse files  ABC NewsOhio man charged with threatening to kill Vice President JD Vance  NBC NewsToledo man arrested for allegedly threatening to kill JD Vance  WTVGOhio man charged over threat to kill JD Vance, US Justice Department says  Yahoo",
    "published date": "Sat, 07 Feb 2026 00:37:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQQlVDakxTRUlHZkZucThOVnFudXBuQkR2UjYtNjdjbkdKN2k5d0h5MFBZUUYyeDVXQV82VUs3dWlpVFVOZWlJME93Vlh6V0FjRGg4SGgweTQ1QzRUNnV4bXJZWk91QXE4VUpnQVhQM3plUGJ3b05QZVA1Q0psV3FBVEw1V0VEZzdxZGVEdkNWZkVfS1c5SFhIVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "TrumpRx is launched: How it works and what Democrats say about it - latimes.com",
    "description": "TrumpRx is launched: How it works and what Democrats say about it  latimes.comWhite House Debuts Drug-Buying Site TrumpRx, With Roughly 40 Medications  The Wall Street JournalTrumpRx: See the 43 drugs available on the Trump administration's new discounted drug site  cbsnews.comTrumpRx: What to Know About Insurance Benefits, Pricing and Savings  The New York TimesSenate Democrat knocks TrumpRx: ‘Glorified coupon book’  The Hill",
    "published date": "Sat, 07 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPVUxkWWo5Q21jWXQ4ekItc0xBb1NQdDh0Rk14X19scEJlOGxHN2N4ZEpKcFQ1MjZFeTVDcWdIVTdOcWM0WXpmUDlpSHVoZkw5MkZRbllJbXJsMElBa1JMdmNZNi1PNTdoMGZ5R0d1a3B6YjVqLUxVaU5uTjVUb09GTGp6bGUwMGRMRDhiMWRaX0VDWndLdWotUUJvRVp2SERwdkVCYWxfaEZwczFVYVYyX1NFNko?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Why Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears - The New York Times",
    "description": "Why Trump’s Calls to ‘Nationalize’ Voting Have Raised Midterm Fears  The New York TimesAtkins Stohr and Parker on political fallout from Trump’s call to ‘nationalize’ elections  PBSTrump’s Election Fixation  The AtlanticTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comWarner warns of ‘coordinated effort’ to interfere in midterm elections  The Hill",
    "published date": "Sat, 07 Feb 2026 10:02:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQODd3cHpZb3BiLW0ybk5WaDU2UmlyTHVXaTY1dW9QRzQxTklKa0hCMVpZbXFVYmdTc3A3bFNvbzJYMDBFaklvUm1CRVVLTlNNREN0TkR1b3ZfQ3ExWHFreTE2eHY4cktPdjM5bmhqaXZ0VkhHWlllYThCdHVJTzVnM0YyLTl2Zk55Y1gwTWlnXzRLR0NhOXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Fifth Circuit upholds Trump administration's mandatory detention policy - Courthouse News",
    "description": "Fifth Circuit upholds Trump administration's mandatory detention policy  Courthouse NewsAppeals court backs Trump’s mass detention policy  PoliticoAppeals court endorses Trump policy of holding many ICE detainees without bond hearings  cbsnews.comAppeals court greenlights Trump admin policy of detaining undocumented immigrants without opportunity to seek release  cnn.comU.S. appeals court upholds Trump's immigration detention policy  NBC News",
    "published date": "Sat, 07 Feb 2026 07:26:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOS2t5TmJaVmZKa19teHpIMUlhOGN5SUwyNm1hYnBJeVd0SUlNM1RkdXhiMjlHYVRPRnpsTmxsM2x4ekp6R1E5dEdrem15cFQ2cExQLUpjNC00amZIUDZianZETEpRZjk3OHVnOFBpVWNwRk01V0MzNk5uWFg2dUFaaEdKXzh0RWFzSGRXcU50aHctYmpKcGN1aFZwQmhIR2VMM25SUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.courthousenews.com",
      "title": "Courthouse News"
    }
  },
  {
    "title": "Redistricting effort aimed at helping Republicans in midterms could cost them dearly in Virginia - cbsnews.com",
    "description": "Redistricting effort aimed at helping Republicans in midterms could cost them dearly in Virginia  cbsnews.comAll but one Virginia House district could go blue in Democrats’ proposed map  The Washington PostSpanberger signs bills to send constitutional amendments to voters this year  Virginia MercuryNew Virginia map uses Richmond to weaken GOP districts  AxiosVirginia Democrats propose potential 10–1 congressional map for 2026 midterms  VPM",
    "published date": "Fri, 06 Feb 2026 19:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOWpTYnIzMmtZcVp0alJZWENVcEljTHBMcGFwbUg4NnJnb2FyaUd6ekRTRDhqa3d1TURNbHczanRCSHkzN0FHWS12anFieWlWVzh5SEs1QlNJclB5Vjh4a0tQNGJwWE1URHA4cVlFYlhGUGsxdE0tSmN3R2FYaEZCdEhoTUZrbzJ20gGOAUFVX3lxTE9wakVYelE2UTc5ZzltQk5DbVVScGdRVXNBenhKZTJFZDJJRnRPczZ5X0dGcHEtOGJ6VjNYcDZJSm5Ga1Zjb1htWnN1OUticllKbUxBRVJOTkYyelJzYThKbkNYYUFRRklNVmJENDZqQXJKSENXLUoyRDdXZmZIYlhlN3kzQWd1SXctMlpQOFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Emails reveal more details of Epstein's celeb dinner for Andrew - BBC",
    "description": "Emails reveal more details of Epstein's celeb dinner for Andrew  BBCEpstein revelations have toppled top figures in Europe while US fallout is more muted  AP NewsWho were the other men in the Epstein files? This is the FBI’s own list  Miami HeraldA Second Accuser Alleges a “Sexual Encounter” With Andrew Mountbatten-Windsor at Jeffrey Epstein’s Request  Vanity FairFallout from Epstein files release reaches highest levels of UK society  ABC News",
    "published date": "Sat, 07 Feb 2026 12:31:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBicVBua21CWnFQb3NLZkt5VmRGMVZfaWdUTGYyZHFTX0lNRjNVX1FadzVDYURMa2Y3NHJoUzR0M0Npb1RHZ1pkcTBpMjZTSnE3eWZSVEJfRXVsdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "The Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die - Slate",
    "description": "The Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die  SlateOpinion | Trump’s Indecent Nuclear Proposal  The New York TimesFor the first time in decades, the U.S. and Russia have no limits on nuclear weapons  NPREurope Faces Uncertainty as New START Ends  Council on Foreign RelationsWatch: The US and Russia's nuclear treaty is dead. What comes next?  BBC",
    "published date": "Fri, 06 Feb 2026 20:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQV3RWbWg1QjI0N0lPeEtJWTU4YzQtUXRNdnA0cHZDNmt1MVpHdFlyV3hGYTNCZ3JlcUhKV0JnRGQ5Z2R1TUJfS0V3X2M2VXJVRGs3SmJNLTl5Y2RnSWMya1FHRTVsczAxZlFMU0pNaWVaUS1XNmRjaGxadHoycjQxNkxvWnBFY0lWUDdOSFNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "The left smells blood after shocking Democratic primary result - Axios",
    "description": "The left smells blood after shocking Democratic primary result  AxiosIn a Close Election, Voters Send a Sharp Anti-Trump Message  The New York TimesHow a pro-Israel super PAC made a losing bet to open Democratic primary season  NBC NewsNew Jersey Democratic primary contest for House seat on knife-edge as votes trickle in  The GuardianAIPAC allies picked a candidate to target in New Jersey. They may have boosted a stronger critic of Israel  cnn.com",
    "published date": "Fri, 06 Feb 2026 23:56:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOTnFWdnFSYTFWSzVBQjVnVS10ZFdVTmtkT0FUQThOY3dJTzVtUUVtdVVRb0FoYXRfZV9Gc0k3bFNvOGNWTTcyandaOTdxU1VTcjV0aXFCYXJTRnhKRkNCdzAyMzROZFBsbmRLMzVqcUNZLWdFN21BZW4td3V1cUYxSU5ybEltR0xX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Russia launches more than 440 drones, missiles at Ukraine overnight, Zelenskyy says - ABC News",
    "description": "Russia launches more than 440 drones, missiles at Ukraine overnight, Zelenskyy says  ABC NewsRussian Offensive Campaign Assessment, February 3, 2026  Institute for the Study of WarRussia-Ukraine war: List of key events, day 1,444  Al JazeeraUkraine’s coldest winter: Russia’s energy strikes collide with waning supplies  The HillRussia launches massive attack on Ukraine's energy system, Zelenskiy says  Reuters",
    "published date": "Sat, 07 Feb 2026 12:22:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNYmhENkVOX0pFOW5ONGdXY0xMblU3eEg3NlY1RUdKVnNMdzhrV2VLMzY5VUdLRHBWeUlBX0NPRC1MRF9ubFVfTjVEZzNFNWxYMnNsa2kzZDNzSjFpMGVJUXp1ZEhYcUNLOWRFdnh4UU9nLXltQ1poM0RvVTdYYXJvdW4zV0Z1ZzdJWXdJazBHUXhKVEZfenBvUGMxTnNPTWpobm9UUjJKOFlDQjBvQ1BNQlJtVzNZYVBIellZ0gHAAUFVX3lxTFBQbFdwOHdRTHlLazVGWmwwNmRqbFdpem5FdjVUTldhZVB1Vl9CVHdzdm9jNU15VWNhTW1hOWYxMWF0QVFrTHJRRjhNdjU1MVRwN3lJd2ZZZU5Mb284eHNyMmh0V0RiTENWM2EzV0tWa0llTEhTRHNDazhHUW9tQXFkRm56c3l0UUVhWWlyYUhrSjNGcUQxdlByRVJnQmF2NnVIYlNfUUx1ZzJtWnR2QTkwd3BKbzdTaWtNWlo0eTNWTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Scoop: White House plans Board of Peace meeting in D.C. on Gaza reconstruction - Axios",
    "description": "Scoop: White House plans Board of Peace meeting in D.C. on Gaza reconstruction  AxiosTrump’s Board of Peace To Hold Its First Meeting. Here’s What We Know  Time MagazineTrump administration planning ‘Board of Peace’ meeting in DC on February 19  cnn.comHungary's Viktor Orbán set to attend inaugural meeting of Trump's \"Board of Peace\"  cbsnews.comUS-led Board of Peace to hold first meeting of leaders February 19  Reuters",
    "published date": "Sat, 07 Feb 2026 03:15:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBxRmhSYnh1dUVjUW9YTWNoZjBJNGR1b2d6clczX3dWcGdOMDlWWUt5dVZiVDlCbjRDbk5YemwyNjFNd1ZNbnEtLUxVVV96andFcWliQy1jODJOemZvdVUyTDdoQndRdHRoVUNZdUFjNlU5YUFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Renee Good's partner addresses Minneapolis immigration crackdown one month after killing - NBC News",
    "description": "Renee Good's partner addresses Minneapolis immigration crackdown one month after killing  NBC NewsSeveral of these Americans experienced aggressive encounters with Trump’s DHS. Now, they’re telling their stories  cnn.comBecca Good, partner of Renee Good, releases new statement  cbsnews.comShot, Harassed & Threatened: U.S. Citizens Describe Surviving Violent Attacks by Immigration Agents  Democracy Now!One month after Renee Good’s death, wife thanks Minneapolis for ‘incredible community’  Star Tribune",
    "published date": "Sat, 07 Feb 2026 20:14:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNU1Nkb3h4VWcwdmRHQzY2Y2pvdWdrUHdPMWNmb3d1RlQ2QzFCZ01pLTZTQU1jZ0NmMGpfWnNTcW8tY2tIZGRibTNoelZjLTBGZFdtczBVZDFEdDJqVmwzRW9aTG5ub094UVpEVFdGSzE2MjRReUgwQVdCMkdRQWw3NWo2ZTlHT1N1b3p3WjJwVjMtT2ZkWFBWSUVoMmlaLVN4N1c1WWx0ZTZGN0dMSHN2Nw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump says U.S. and Iran had \"very good talks\" - Axios",
    "description": "Trump says U.S. and Iran had \"very good talks\"  AxiosIf US attacks, Iran says it will strike US bases in the region  ReutersAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street JournalTrump calls U.S. and Iran talks in Oman 'very good' and says there will be another meeting  NBC News",
    "published date": "Sat, 07 Feb 2026 01:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBYWEl6TUNkNVJVcjNSTk5ka1ZNNjlNVkJEVDdJa1ZuVVNBcVRQOFpqS3QtcFREVHFlc3UzWU51ek8ybXBiaHBuUzNpZC02b0doUEREcVg1V1VhcG9oSzFGZC1lSnU3VWxJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  }
]