[
  {
    "title": "Nancy Guthrie disappearance: FBI reveals description of suspect and backpack he was wearing - Fox News",
    "description": "Nancy Guthrie disappearance: FBI reveals description of suspect and backpack he was wearing  Fox NewsFBI offers identifying details about man seen on Nancy Guthrie's porch  NBC NewsExclusive | Investigators find black glove during hunt for Nancy Guthrie’s kidnappers — and The Post was there  New York PostRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOAGoogle’s breakthrough in the Nancy Guthrie case is raising uncomfortable questions about how much it’s watching you  Yahoo",
    "published date": "Fri, 13 Feb 2026 04:56:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQTkZxV1ZyUEY2a2FwRjRPem9HNnE5WVFqTlF4ajgxSkxsczhaRUZMa29FanR0WjB0WV9wZGlsdVdmR3FHN19oQ1lWSHpDWEtudW9mc3N1bG9mNmhZdkhnSzI4NTdoMTVLY1ctRVFWZC1tajRiVjBRV3FjS3ZUaXZMR1dJLTN1SnFCamQxUjFRUlN6MXRzSER2WXJhY01ieFhvZzk5TGVXN3h0ejRLdVZielQtdVowamN1M0ZhaTlZOThlYWg5MG1wWEdUTk8zZ9IB0wFBVV95cUxOSWEyM2lkcG5xNGpyM2d1Q0thOHhBY2hhb01lWThmamdiTnY4WG44RmpXVjhGbENUZ2dlTENuZlV5Y1g2REt3RmhjeXB5YmJ6QUZDNldUSmhDUFh0b2NLdWprR1N4Y0w3RUVJWWRra0NyQWFCOV9Pc19qdlZHdzkwM0pCY0IzVFpBaks2UHZjS3d5ZGpqRmVsRGY1dmdDMlNiRE4yNWxwWlF6cDRJVmZpbFdNelhpdE5KeENfU3JYSWlvbFI3WjFIenQ1N3FmanNpRXpz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  },
  {
    "title": "Trump repeals U.S. government’s power to regulate climate - The Washington Post",
    "description": "Trump repeals U.S. government’s power to regulate climate  The Washington PostTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesTrump's revokes scientific finding that underpinned US climate change  Euronews.comTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNNEPA reverses long-standing climate change finding, stripping its own ability to regulate emissions  NBC News",
    "published date": "Fri, 13 Feb 2026 03:43:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPT0tIWHEyTHpLclhSbjJwLXNzWE5Ydlg4Z0tmNEhKSElRcmJ5bnE1VjVtWEdNSktvNFhJZGZXbnhuZmxmcjQyaGlUcWVQVGRVQmd2X1JsM2RVOTNmc0JFX19DUXNrSXdZRHZwaDNpOE8teW5PTlVJSnVQSVZmMGFkZURvTGpDQjBuVTFYWnRIMVBhTGhI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece - CBS News",
    "description": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece  CBS NewsUS federal immigration officer charged with harboring undocumented person  The GuardianCPB supervisor accused of harboring undocumented migrant girlfriend who authorities say is also his niece  YahooBorder agent charged with hiding person in country illegally  KRIS 6 NewsCBP Supervisor Arrested in Laredo on Harboring Charge  Hoodline",
    "published date": "Fri, 13 Feb 2026 02:22:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNYVBkZVptOWFLSjJ5R19mdG9HZEQ3MkF1eEpNY04xbEpkQlEtS0VZXzVFSTZyblJBQlNfdko2V1BLYk51NW1EOFVNZW5mdk1UYlNpVmlPUFcxSEJVbHpzM29wVHVfajNfRTZtc1dpb0xqckloTnJraUlETDNuNUdXMXNzOFBSVXE2S3VGbV9ST2EybnJ2V0Vzd1U0LUdWQzlaUWhHYUJlamlFdEx6NEpiU2lseEowc3h1T2fSAb8BQVVfeXFMTXZYN0cwdjZ1QVFlTGt0MHAxdkZ0enRXdGVUNjJ0dTNkcjRnTDBvMWFjbGM0LVJvUXhzSDd1Nl90cjJTTFhfRGNaejlGRWtrZHVUSWxwUEFFNWJCQWJqSHdBOXE0cnBORzRYcGNFWjJJd2lYTVgxRXFaeGlRcjAzN2l0OVY5ZjlMMGtsZUFvVGNhbTJkRU1SeXFVTWRnRHFUR25YR3JQdU93Zk5iczlzWmVxRWNjS21TZU5lbWREM2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings - AP News",
    "description": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings  AP NewsEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticMinneapolis Immigration Crackdown to End, Says Trump Administration  Time MagazineTakeaways: Enforcement surge ending in Minneapolis as state and DHS officials face tough questions in Senate  CNN",
    "published date": "Fri, 13 Feb 2026 00:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPOXdoam1OQUZhZ251b0NLM3F3TXRhamhrTHI2eUo5UmZNYktmSFhQb2pTamI1VG9NU1lXRkZrZUNnd0tIckVVamZRM3NVOVpJNVVlTTZNSU5CQ1A0MndrLXRXdDVoS2RRYS1oeUdleGszS3dkX1NuY3FiYTBFQVhxR3NnVjRDalFmQXVEVkVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Lawmakers resign themselves to lengthy DHS shutdown - Politico",
    "description": "Lawmakers resign themselves to lengthy DHS shutdown  PoliticoDepartment of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight  CNNDHS expected to shut down as immigration talks falter  NPRDHS shutdown imminent after Senate Democrats block Homeland Security bill  The HillDHS shutdown deadline looms. What it could mean for your flight.  USA Today",
    "published date": "Fri, 13 Feb 2026 01:46:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNWjJ0TUp6TmFLRjBCTmkzRjNmSHNkdVRWUFcyRDNjRnRlWHM2Y0dGUElydzRTVHRhdjY0Q1dpWnh5RUh2bGljRTZ2ZW9YYlRZTWs4Qi1VXzA5Y2g5ZUVkejBPT3pZQ2tQU0dwOEpiX0pDb3RDOFpiRXB1N1k2SWdBRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York TimesFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge says Pentagon 'trampled' on Sen. Mark Kelly's rights, blocks effort to demote him over 'illegal orders' video  NBC NewsJudge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video  CNN",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "description": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosOpinion | Pam Bondi’s Performance Before Congress  The New York Times‘Pretty rich’: Republicans claim Democrats are the hypocrites in new DOJ ‘spying’ scandal  MS NOWHouse speaker condemns Trump Justice Department monitoring of lawmakers’ Epstein document review  CNNPam Bondi’s Contempt for Congress  The New Yorker",
    "published date": "Thu, 12 Feb 2026 20:44:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNdG5Bbnhmb0VxdEpLU0FVcFQ3WUZTbmJ1WU5WeTBJblZyVnpfZFdtZkhXMEdsei1WZk4yQ2QtNEZGcGwtRGxfandyMUJfN0drUVRtbEhyZWMwMkk0WEtpX1p1ZEZYNzdGQVNjdDFOaUFKOWNfQlYwNGFwNXdjaDd5czZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles - The New York Times",
    "description": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles  The New York TimesNational Guard troops were quietly withdrawn from some U.S. cities  The Washington PostTrump administration withdraws National Guard from Chicago, L.A., Portland  MS NOWTrump Secretly Yanks National Guard Out of Three Blue Cities  The New RepublicTrump makes good on troop pullout promise, vows return if Democrat city crime worsens  Fox News",
    "published date": "Thu, 12 Feb 2026 21:00:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNkd1OV9VUGFlTWZEMzEtTjcwaFh3cG9QYkJuVHZiWGkxM3Z5cXczd2dHMmI5Qy1EWkJLUkxvWVdtRnhCUnRJMjFKVlRKbVBkSzRoVFFSTDdxb0UzTFpKbFhGa0VlVWVjLVFMTW4tN09LOFJ3NlZXZ3ZxT0FlVmV2NHRMbHA2LThvZ3lsd25YQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNLaser weapon that shut down El Paso's skies was LOCUST system  AxiosDo Drug Cartels Actually Use Drones at the Border?  The New York TimesCBP shot down party balloons with anti-drone tech before FAA closed El Paso airspace, sources say  NBC News‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  Politico",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds - The New York Times",
    "description": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesMinnesota sues after CDC cuts millions of dollars in public health grants  MPR NewsTrump administration withholding public health funding for Illinois and other Democratic-led states  CBS NewsIllinois sues feds over $600M in cuts to HIV, lead poisoning prevention grants  Chicago Sun-TimesDemocratic-led states sue to stop Trump from withholding $600M in health grants  AP News",
    "published date": "Fri, 13 Feb 2026 01:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ1RtbW1BUUtqUGdIYzVMM1RGcVc2U254c2tNaF82aEFwN20zMWZmcjFFeXkxSUtlLUhKelhpSWVuMkU0YnlHVzlqeVcyMWhKODFhZUxsemhHaE4xNDFYbGpUdHI1T1JNSTJfWVIxcGkyYm9aM3doazVySndxNjhnNVQ3WjFySkFVZ0RaZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "description": "Pride flag flies again at Stonewall Inn, challenging federal ban  The Washington PostN.Y.C. Officials Reinstate Pride Flag at Stonewall After Federal Removal  The New York TimesStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkTrump administration yanks the pride flag, but Stonewall’s value remains  Arkansas TimesNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  Gothamist",
    "published date": "Fri, 13 Feb 2026 06:20:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTlZKcnY4SHdjSnFPWHhnQjVjcmdBMm5lR3pYeEFLck1XYVR0b25hWVhTczJONlRQSExha1ZMMUhfZ3c5Qk1qbDI2VTlCUUZ1VU0zYW5YemlSVmtLTnI5WnR6RnV4ZXNjbGhNcEwzMGhJbWRoNkp6VUNHb2FyTzRsNWlKZmI1NE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "A New Frontier in Timidity for Congressional Republicans - The Bulwark",
    "description": "A New Frontier in Timidity for Congressional Republicans  The BulwarkRepublicans chastise Trump administration for failed indictment of Democrats  SemaforTrump's revenge tour falls flat in the courts  AxiosOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington PostEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC News",
    "published date": "Thu, 12 Feb 2026 20:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNNEpNNHFOM2hxRU4xUFJVMk02OVdkSkdtaFo0SlhoMllKYzFPN1RkSElLbGFSaXZlMmN5ZmpMSk9LTkRBTWZoSVQ2TEUyLXo2VERoQ2NUaDYxVU9ZeEhGR2Z0NTlFdkN5Z0xrN3lKN0o2Z2NYZ2s2ZjVQTC1UYUgwdXRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says - AP News",
    "description": "Second US aircraft carrier is being sent to the Middle East, AP source says  AP NewsU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York Times2nd US aircraft carrier being sent to Middle East, AP source says, as Iran tensions high  KATUUS readying another aircraft carrier for deployment amid Iran tensions  Al JazeeraExclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 04:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNVWpDTl82THV5ZTVTMTNhbXpxc0RZSkE1dV9FM3hmV3lyUHhDeTQwS19EREljVEd1OGdhZlhnQjRITmlDS3lwbVFnbG1qQWFYeHZZdk9mdmpUWkVzclJIZTdLM3BlaGFNWFJ6Q005OUpCMTByTFZ1OEI2Nk9IcURadzlEa25ZbHZQOVZ3a2VVN0UybmthdjRhWlNwODc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump nominates hospitality executive to lead National Park Service - The Guardian",
    "description": "Trump nominates hospitality executive to lead National Park Service  The GuardianView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 02:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOV240VGhiN2tFU0NrN0JtTXFZVFItMTRXYWRJMFM5VHpQeGcyWlUxSnZqU1JHREd3dTQtQm93NGZwaVp1bFVlOTVsdVM4T1dqMUxXMWE5TGNyWkRxLUF2T2tSV3VBRWdZcU85MUhkMEhIeGNkT0RlVFJ5Nl84dHdYNWc1aFpiQUhyUDNHcjBxZlJFTFlmWG5PdGM3Mng0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "The 10 Funniest Reactions To Donald Trump's Latest Participation Trophy - BuzzFeed",
    "description": "The 10 Funniest Reactions To Donald Trump's Latest Participation Trophy  BuzzFeedTrump named ‘undisputed champion of beautiful clean coal’ by industry group  The GuardianTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York TimesTrump orders Pentagon to buy power from coal plants  CNBC“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)",
    "published date": "Thu, 12 Feb 2026 17:30:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1yOTRTcDNuMDZ6SmpfRWQ5SFJ5OFZ1bkVPMi1rOFQ3X1c1RnhrRlpULTc1RVZiZlV1YWJFV3h0cVBhTllTVWhKTE5BVmhZenZHdEQwTGZPSlJ0OEZsNUFBTWZNZWowR2N1aXlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump attacked this GOP governor while claiming Democrats were always included in annual meeting  PBSTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  PoliticoConfusion reigns over Trump meeting with governors  The Hill",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSCriminal investigation ongoing into Border Patrol agent who shot Chicago woman Marimar Martinez 5 times during 'Midway Blitz'  ABC7 ChicagoBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsEvidence Shows Feds Lied To Justify Shooting Marimar Martinez, Lawyer Says  Block Club ChicagoOpinion | We Have to Face What ICE Has Done to Us  The New York Times",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Prosecutor Seeks Dismissal of Charges Against Man Shot by ICE - The New York Times",
    "description": "Prosecutor Seeks Dismissal of Charges Against Man Shot by ICE  The New York TimesGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSDOJ drops charges against men accused of assaulting ICE officers in Minneapolis, citing \"inconsistent\" evidence  CBS NewsNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. PaulCharges against man shot and injured by federal agent to be dismissed  kare11.com",
    "published date": "Fri, 13 Feb 2026 02:12:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUDN5MUdVVDJfRW5FVVN2RXlFNnJJcnVKOTMtTV96RWNwNlVZZlp2ZEhjTFF4SVIwdm1tXzM4RU5KMWNETnZwT1RBb3JuWnppSDlOREN5QXVoX3RCWnN5QVUxVmpSdW1XLWd5RThacE5Yb3JtSXZLaDhrMGdWRWgyTzF5bGJrMjEwNmFRMmtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race - The New York Times",
    "description": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesAnalilia Mejia wins N.J. Democratic nomination for U.S. House seat  MS NOWNew Jersey House Primary Special Election 2026 Live Results  NBC NewsAIPAC defends spending $2.3m to thwart ‘pro-Israel’ NJ congressional candidate  The Times of IsraelAlmost every N.J. congressional Democrat has endorsed Mejia in both April special, June primary  New Jersey Globe",
    "published date": "Thu, 12 Feb 2026 22:41:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQRTJMWjJRVXZDR0lSV2hDbEJqalF0R2VMYmhPVGpzT2lPbUpnYXotM0VENDZtMmk3U0JDaFYyUWVTZmFDMXVnZzNrYUEtb1hnMHFRRHhLMlFUMVQzVUFkWTE3VjM1SGU5Um1qNGRoUXNlSnJJd3NNY0Z0TEJyM1hSSThQMFJRbVpWbVVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoICE blocked detainee lawyer access in Minnesota, judge  RTE.ieTrump judge slams DHS for blocking detainees' access to lawyers  AxiosA judge orders DHS to give Minnesota detainees swift access to lawyers before transfers  AP NewsJudge rules Whipple detainees must have access to attorneys, private calls  Star Tribune",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing - AP News",
    "description": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing  AP NewsWATCH: Minnesota officials, federal immigration leaders testify before Senate Homeland panel  PBSHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneTop immigration officials are questioned about enforcement as a shutdown at DHS looms  NPRMinnesota & Immigration Enforcement Officials Testify Before Senate Committee  C-SPAN",
    "published date": "Thu, 12 Feb 2026 22:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaDB0WGFKUFRXOWxJSzFoRlF3YzJKVjVoeUxpZ0FlVGhQbjdGcUlvV3BXQlliX0ZnOENFb0VtNU1iRk5kMTY4cVVFWnpFRmJLZlhYNzJacFBqc05nTWxHbHc4N2p5MlZZNG5UT0wtbWlWUnA3c3JTc3NjNGJVRTJwVURZbXhwUEV6ajJWcjcwZXlnQU5FczBxbUdMMGkxa3kyendMQzM0bGhjdzg0dzc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act - NPR",
    "description": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act  NPRAmericans could pay to bring back alleged members of 'foreign terrorist cartel' to US  Fox NewsJudge says U.S. must allow deported Venezuelans to return for hearings  The Washington PostJudge orders Trump administration to help dozens of deportees return to the US  PoliticoJudge orders return of Venezuelans formerly detained in El Salvador if they choose to come back  NBC News",
    "published date": "Thu, 12 Feb 2026 19:05:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNZEdPVEZXd2xISUJOTHc1SW5tVkhGdmZnRDBSZmVHMTc0NE9KcHRhRFV5UmZSeGdHTS0wYkN4bzlsSUhOVVU4UWxtb3VySERJLUZWT0E2QlVsZGVjdEgzSnpSTm8yT1N1RXlBVTZMdTZTWEtaT1l0WF9IckczS0U0ZF9rcVhTZExSVEY5Uml5a2xCSmRqa0xRQkRtX0JfaGc5QUQzd1lCTzNyWmtrUEdVUmlXYnIzNk1RYmdpY2J4SzZtY2hBbmF3UkpnWWVJck9hdUt3aWxoNWRrTkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump Offers Absurd New Excuse for Vile Obamas Video - The Daily Beast",
    "description": "Trump Offers Absurd New Excuse for Vile Obamas Video  The Daily BeastTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS NewsVance breaks silence on Trump’s racist video of the Obamas: ‘It’s not a real controversy’  MassLive.comNewsom Says Everyone ‘Should Be Disgusted’ Over Trump’s ‘Racist Trope’ Social Media Post  Time Magazine‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQVBfNWNPbndCaWNGc2k1d3ByV2VISnNoRVlEcjRZd0pIUDZ3UWVUZk9OZm5kX2Ftc3hFa0xhTGotVGdiMkZXOHNGMVFybk5sVGZjUF9UQmp5c2Zfck5qN3ZVLUd6YkJPWXZaaXF0bUdWTzduaE5HRG5SdmlZNzg2WHhHZFFGMk9qQ2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesThe Epstein files come for Hollywood royalty  CNNInside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosThe Working Class Can’t Be Bought Off Quite So Easily  JacobinOpinion | The Real Epstein ‘Ring’  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 00:36:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Costs from Trump's tariffs paid almost entirely by US consumers, NY Fed says - BBC",
    "description": "Costs from Trump's tariffs paid almost entirely by US consumers, NY Fed says  BBCWho Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNNAmericans Are Paying the Bill for Tariffs, Despite Trump’s Claims  The New York TimesOpinion | How a supplier of nuts and bolts could curb Trump’s tariff overreach  The Washington Post",
    "published date": "Fri, 13 Feb 2026 01:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFB6WnR1Mi1xLWo1Qy0wa3kyX0JZejk0TnFybjR3bWVfbXpSNzZnNnZZbTRiT3Jwc3BGblVWaFUtOXQ2cGpaT1NjRlJhRGQ3ZE1XS1hkWXdpcUk3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Utah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post - Politico",
    "description": "Utah Sen. John Curtis is sinking Jeremy Carl's nomination for a State Department post  PoliticoBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC NewsTrump’s pick for top diplomatic role faces scrutiny over ‘white supremacist’ views  The GuardianBreaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake Tribune",
    "published date": "Thu, 12 Feb 2026 18:31:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOSEJCM0xvN0UxeDN3T1VMdGE0ZlkxYkJYaGVoVWo5STFkWm9DR2pqaTdhM3o5czZzejNfTFRZWVRWOFZBajRMOThEOC15dEdDWWhQMHJkU19iSHlPMzZubWZFOVE4WUdzcjZEcllJZFJ0Z2p1aUpVTFVVTUp0c3h3dTRmZm9oUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Citizenship voting requirement in SAVE America Act has no basis in the Constitution – and ignores precedent that only states decide who gets to vote - The Conversation",
    "description": "Citizenship voting requirement in SAVE America Act has no basis in the Constitution – and ignores precedent that only states decide who gets to vote  The ConversationHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsRep. Crow Holds Press Conf. Following Failed DOJ Indictment  C-SPANWhat is the SAVE America Act that mandates voter ID?  BBCHouse passes GOP elections overhaul  Politico",
    "published date": "Thu, 12 Feb 2026 13:22:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxOLVhXd3BYWFFPaUlCSS1QZW5Uc21KZGR6eFppaDRiS3dWTDF6dmdEOWJNV2V6TkZ6VEpWbFl6bXFobGJqTllMWldPcmozMEZYa01MTXY4eGVPX0RoVzRNT25sQWNsajFNeGJjZzJmbW9KOUV0TmNrQ1Q1dURjNWlVMG5RREJoZGctb2ZNZXJYZEp1TDJxUV9xcUJFNVRxYm51TkIzVnN1VmNFNWJBcjdlTE12LURGSE9yLTlPcVQzbHNuRWxrWGlvbGRwdjVsc3Zidlo5UGhmQnh1UllyWlRUTW5iMmRvVko1amxrNGVqRlRWeWZLWjRpQmZCTWI1MjY5VHI5aU01bnQ0Ti1aVXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRSix House Republicans defy Trump to block his Canada tariffs  CNN‘It will always be at the expense of our neighbors’: House votes to rescind Canada tariffs as Trump warns of consequences  WKRN News 2White House expects ‘substantial’ GOP defections on Canada tariff vote in House  PoliticoColumn | A little Republican rebellion against Trump only goes so far  The Washington Post",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNNetanyahu meets with Trump as U.S. restarts talks on Iran’s nuclear program  PBSTrump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosIsrael's Netanyahu says Trump may be creating conditions for Iran deal  Reuters",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  }
]