[
  {
    "title": "Justice Department is releasing millions of pages of documents in Epstein investigation - CNN",
    "description": "Justice Department is releasing millions of pages of documents in Epstein investigation  CNNAttorney general says justice department ‘did not protect’ Trump when reviewing Epstein files – as it happened  The GuardianDOJ releasing 3 million pages of Epstein files, 'didn't protect' Trump, deputy AG says  ABC NewsEpstein files live updates: Trump DOJ releases millions more pages of records  NBC NewsEpstein files latest: US justice department releasing more than three million pages  BBC",
    "published date": "Fri, 30 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5DSEtzNE9oZVJZZElUMV9KT2hLYkdDTlFyMnA5S19hYTdBSXItQ09fY0FPbWxlSlBFbHcxaVF2MDdZMXdkY000aWlBR3A4X1Rla1dudlc0X3E0dERaSno0aUJIVU5YQ3pyOG1YTGdCMmxjTlU1X0JqVHBMczFrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Former CNN anchor Don Lemon arrested. Feds call him an ‘online agitator.’ - Los Angeles Times",
    "description": "Former CNN anchor Don Lemon arrested. Feds call him an ‘online agitator.’  Los Angeles TimesFederal Agents Arrest Don Lemon Over Minnesota Church Protest  The New York TimesJournalists Don Lemon and Georgia Fort taken into custody after Minnesota church protest  CNNFormer CNN anchor Don Lemon taken into custody after protest at Minnesota church service  CBS NewsJournalist Don Lemon arrested over Minneapolis church protest  Financial Times",
    "published date": "Fri, 30 Jan 2026 17:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOGpkemF4cjh1amYzcVctZXk1OFJRVVhsVmthQ1hQQkdlUDdmVWd1N3hrQTQ0TlFGMXVaME1jOWxfQlpSV0UwVW1hUmxpVFZnVEIwN09SbFhqSUMweVFSYXJvU0FQXzNtTDQ4WmN0bUFoazNoQVVsZUlHdU1kYWJNRFIwT0hwcUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty if convicted, judge rules - BBC",
    "description": "Luigi Mangione will not face death penalty if convicted, judge rules  BBCU.S. Judge in Mangione Case Drops Charge Carrying Death Penalty  The New York TimesLuigi Mangione won't face death penalty in CEO murder case, federal judge rules  CNBCJury selection for Luigi Mangione's federal trial to begin in September  ABC NewsFederal judge drops murder rap in UnitedHealthcare CEO case  dw.com",
    "published date": "Fri, 30 Jan 2026 17:02:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9NQ0dtUW5iUjN1b2EyNU14Tzc1VklHWUkzTlpKdkFwMzJIZGhWVkpjQWkzTndBZFlxUi1hWldzMDJ4NWZmUWpydmVRX3NaRERlZjByMS1ZVlVyUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Anti-ICE protests to be held across US as organizers urge national strike - The Guardian",
    "description": "Anti-ICE protests to be held across US as organizers urge national strike  The GuardianNo work, no school, no shopping: Jan. 30 nationwide general strike to protest ICE gains celebrity endorsements  Business InsiderDetroit area businesses, schools join general strike against ICE  Detroit Free Press‘ICE Out’ strike and protests: what to know about demonstrations across the US  The GuardianProtesters call for nationwide strike against Trump’s immigration policies  AP News",
    "published date": "Fri, 30 Jan 2026 11:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9mVGZTRG1JRmtyRXkwckk0NTl4SXZGTGFnWnN2dmk3WFFzUWREUjFLSzI2RDItSUZaX04tdl9naDJLelNvbkF2elIxemtOdDl0SWRpcVI4ekJvOGFiTUxuUjN0N1cyaFpUQy1obHptUjY0al82NmRwWWY2NEdQOW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "FBI now leading investigation into fatal shooting of Alex Pretti - CBS News",
    "description": "FBI now leading investigation into fatal shooting of Alex Pretti  CBS NewsJustice Dept. Opens Civil Rights Investigation Into ICE Killing of Alex Pretti: Minnesota Live Updates  The New York TimesJustice Department says it opened civil rights investigation into Pretti’s shooting  The Washington PostDOJ opens civil rights investigation into Pretti shooting, Blanche says  PoliticoDOJ has opened a federal civil rights probe into the death of Alex Pretti, deputy AG says  PBS",
    "published date": "Fri, 30 Jan 2026 16:06:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5hUlhFM1hYeW5OcDJkRVpNWUdFNldXV2Q5SVVXZEJnZFdHRkhROFFCNzdtZmMzTGx4b1RBUWV2aEtscUZjWFpMUzFveWMxZVNRTXp2anhWR0hianVpdDVVTUdFZGJha1Y5ZTY3RUdzLXVSYXlhRU9R0gF8QVVfeXFMTTcwNEUzT3EtR1FFVE5PZHpIR00zSDREel9wLW5mZmVYWnBPX0ZJNUM5WjhmWDkxSGZCQ2V5eTR6ci1BWmMzVC1hNE5NQlFxbl9fY3c0VVRpRXJsbXBXVEE0SlUxaVhLSGNNWlQ1aDVtcndqclp1MEE4N0FJNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Senate leaders scramble to save bipartisan deal and avoid a partial shutdown - AP News",
    "description": "Senate leaders scramble to save bipartisan deal and avoid a partial shutdown  AP NewsDemocrats reach shutdown agreement with Trump and Tulsi Gabbard emerges from the sidelines: Morning Rundown  NBC NewsSenators look to resolve government funding holdup ahead of midnight deadline  CNNCapitol agenda: Senate shutdown deal hits a Lindsey Graham snag  PoliticoTrump says deal reached on stopgap spending bill for DHS, but weekend shutdown still possible  Federal News Network",
    "published date": "Fri, 30 Jan 2026 14:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxORHl0dDM3XzBoWHhLVjVtdEJBVUR5d2J2M0Ntc0NVb25jSE1GZllsZUJzTHBkZDVGY29vNnVfSDVRWlRQWGxaaGlWOUxHZE9EdDdxeUFac2lsclYwSW9UX3dRcHZzT2pjUERQaXR4RzVQanRPTGw5NjQwbGpMTFVLdEVKYnBybHQ0WEdoSFhvQVNfZnR0OE1tX0E0UUlvQ1RKT0QwbF9MNkNnbnBhNGxTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video - The New York Times",
    "description": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video  The New York TimesCalifornia Gov. Newsom files civil rights complaint against Dr. Oz  USA TodayNewsom fights back after Dr Oz accuses LA’s Armenians of healthcare fraud  The GuardianDr. Oz video alleging fraud in Van Nuys prompts response from Armenian community  NBC Los AngelesGov. Newsom reviewing Dr. Oz video that appears to target Van Nuys bakery; owner reports business drop  ABC7 Los Angeles",
    "published date": "Fri, 30 Jan 2026 02:12:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE00VHJ4NGNHeVZ2Ukd1YlpsaGdEM2pfY2dZZ2FCVllmSGljMWRLYllDcS1LOFVrZEh6NTVRSlRHWHpwUmJaMWc0WjVJTGRvZTNDeFVDM3lEZElhZEN2YW5LSUpIUzBEdVFSQmoxNmRjMW1tN1lKOWJB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\" - CBS News",
    "description": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\"  CBS NewsHusband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York TimesClosing arguments Friday in Brendan Banfield trial after he testifies he saw his wife stabbed before shooting attacker  CNNClosing arguments, jury deliberations set to begin in Virginia au pair murder trial  WJLALive updates: Jury in deliberation after closing arguments in Banfield trial  NBC4 Washington",
    "published date": "Fri, 30 Jan 2026 11:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxObUNKaXZycWkzLWhrVTV2RklOanI1bEhrVmdLZFlyOUkteG1BelRQLUpsb2NCR0hhWkJNSzd6YnlwbjJ2cV9wRkJGQ3h4cDZGMUNYckJUeGFKcGlJalRlWlR6Q3RlUlRQSHdENUxqVUg3QUx3VWN5U3BHWXZlWkVXZ195QVZueWc4VWxUeFpKNE9xSzZHOExUUjZkcm1OQy1tRFhkWV9B0gGrAUFVX3lxTE1pY0R3WHpVcnJGMWxTblRPR00wSjB6QTlvV0VZeVJwbUw4VkxtOFdxZG9hY2NVblFfNEJCVUxxaWhEdjNQa1RjSWtCd1NBVkU0QlBMNWlWQ01DWThTc0ZuRnZEU0RmX2ZpUFVjQ2xESWxtNDd2a0pCdjFRVUFBM1dROFl6c0dBTkhjX0NsTHlza3QwT0NnZXFCdWFBRVFwYThzaHVOaDViWFU0SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "These 12 cities will be hit hard by a bomb cyclone this weekend - The Washington Post",
    "description": "These 12 cities will be hit hard by a bomb cyclone this weekend  The Washington PostMost snow in years, blizzard conditions possible in parts of Southeast from powerful bomb cyclone  CNNA bomb cyclone is forecast to hit the Southeast this weekend, with snow, wind and flooding. Here are the possible impacts and timing.  YahooWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelAnother major winter storm, with possible blizzard conditions, forecast for Southeast  NBC News",
    "published date": "Fri, 30 Jan 2026 18:08:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRjlZWGdBQXVDbVE2OWtoaGFHck9FR1B1Wi1MREdhV0c2OUVwVkJpVjNnOFJ2OGRJQWxwdDRwWFNpMW1XSTVKdHpsUGcxZUIteFRCVEY1eVhtbU1HWC1LR0JEczFyMVBxVGpmcjlpU0tZQ2JabVBBR19DOGxZcVJkaTJSWmp5Y2pWSEZhZVpxNzBkRWp4VDRJSlBndmk0REQzcXVubVlKNkdPVGdydDRz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Tulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub - NBC News",
    "description": "Tulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub  NBC NewsWhy is Tulsi Gabbard involved in seizing 2020 ballots? How election conspiracies could affect the midterms  CNNF.B.I. Search in Georgia Shows Trump’s Willingness to Pursue 2020 Grievances  The New York TimesTulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington PostTrump posts discredited conspiracy theories following seizure of 2020 ballots in Georgia  ABC News",
    "published date": "Fri, 30 Jan 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNeS1NV3FEajJ4LTZLQ3RHM25QYjBXX2NZVXZSRnZuR0RDNkVLSGRVWGdSQ0lITnQ3RGJFTGxnaEkweS1OT1R1SHVVazVCVDdZNHRWNkdhVS1aeFUxZTFwbHIySTYwTmtTM2pEejBCbFg5d2d3b0F5UXd2RFFNQnB6MmFmY1ZpZnZ1UTVRQlBHckxWblQ3cjhhTzdDdDFXSkVtdHV2MTJBZFNjb0lFSmxHdE5yRW9wZGxPdVZfRTdTSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump Immediately Blows Up His Border Czar’s Bid to Calm ICE Backlash - The Daily Beast",
    "description": "Trump Immediately Blows Up His Border Czar’s Bid to Calm ICE Backlash  The Daily BeastAgents in Minneapolis could be pulled back if local officials co-operate, border tsar says  BBCGreen Bay officials prepare for possibility of ICE activity following Alex Pretti’s death  WBAYBorder czar says he plans to \"draw down\" ICE and CBP operations in Minnesota  NPRGreg Bovino Loses His Job  The Atlantic",
    "published date": "Fri, 30 Jan 2026 11:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPNWpYZUhUOUlTaFlOeFZZbjhYZm5sVGtzdERjSlc0MGVGMURMdWlTVVJDOWpmeVNIZkFaTGJFaml4Zk5IcEZFQ09oTVZLQ0NFaEhDakVKdTJwSXh5b29NNWJQWVFFRl9wbzRnbmdVaEtraEhyYlM5Y0lCWEdReHRSWlc5RTVWUnFCa0RVN0drLTJNamhfUTdHREhEU3RYN05LNnBwbzAzeDRQX0F1aUFzdHdnMS1VdTN0NU1hYkVGVGtTamM3dzBNYmk1eURST01KYm1V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Trump confirms talks with Tehran, is reportedly mulling raids by troops on Iranian facilities - The Times of Israel",
    "description": "Trump confirms talks with Tehran, is reportedly mulling raids by troops on Iranian facilities  The Times of IsraelMaps: Where the U.S. Is Building Up Military Force Near Iran  The New York TimesTrump says Iran wants deal, US 'armada' larger than in Venezuela raid  France 24LIVE: Iran warns retaliation to US attack will not be limited  Al JazeeraTrump weighs imminent Iran strikes, but what’s the mission?  The Washington Post",
    "published date": "Fri, 30 Jan 2026 11:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNa1c4aEhGTUZpZjI0NjljeXVPZ1hNS3pSMjdrSU1aV3NsbV84QVgwSHU5R3pCX0cyNldiQkZXQ0lCV2tibzI2Ym9SNlVLYnd2cEtHZFRKN3BnVGVid19ZNkRYeUlMblRUUWpwcUQwS0l5allWSXc5SzBTamw3MDBtSDRZaS1nVFZHanp2ZTdjMEdIY2ZEdHFRZFVuYU5KQUY1THRzSmg4QnlRTlRkN2tCNWhVQlM3cDB6WWY2LWt6aWzSAcYBQVVfeXFMTVBoa1pZNGlqblhib2d1THpXOFpvWnh4dmM5QUJNRTZLRGdTRmpDLVQzSEotbVhGTTZGbTlON2tQbVp4eDBhaXd1bEFKd1puSGg3WHRvT3Q3Y1BGUkZqQU9ZYjlQcEx5cnBjZks2SXNEbXRrSGZSTTRReTBlUWZPRHdONUtXV0RBY0NGaXk0TEFRc0FSVVNsVGpRTWJkNVpCVHVpTUROSmpZM25QN2NhOHV1T1p1cWw1clFXeXFzVXZzTm9UU3BR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Trump brands Minneapolis shooting victim 'agitator and perhaps insurrectionist' - France 24",
    "description": "Trump brands Minneapolis shooting victim 'agitator and perhaps insurrectionist'  France 24Shooting Aftermath Leaves Homeland Security Department in Turmoil  The New York TimesTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC NewsBattles Are Raging Inside the Department of Homeland Security  The AtlanticTrump: Pretti ‘stock has gone way down’ after new video  The Hill",
    "published date": "Fri, 30 Jan 2026 08:04:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQa3FMNTZ2QXhRM3otRnFnNnktcUZSanZNcU0zUTAxYURLekV5MzBtQkNnU20wWm5RSDhsNXpSZkl6YXdhdEZCbk1pbHlLQzR1eDlzNkJfSzd3MUs5VHQ3cjdNX3NJSWdQSFkzRjgtTzRpVTJQMk9fU21oMFRMUHk5bmFrS2ZBaVlHV3BxQUM3TDBzMjhGYW9XTVBETHVtb1hUbVhQdnF6b2NLTnVneEhMQ1k2dUtqUzZWdURGQWJORm0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.france24.com",
      "title": "France 24"
    }
  },
  {
    "title": "At least 85 deaths reported as bitter cold grips South in wake of winter storm - ABC News",
    "description": "At least 85 deaths reported as bitter cold grips South in wake of winter storm  ABC NewsWinter Storm Warning issued for multiple WNC counties starting Friday afternoon  WLOSMore than 70 dead amid massive winter storm as freezing temperatures remain  NBC NewsNew snow totals are in. See how much fell across New York  Democrat and ChronicleDamaged homes and snowy roadways as winter storm hits US  BBC",
    "published date": "Fri, 30 Jan 2026 13:59:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdzVpVjIxcFZfMHYyLVBlemYxR3RMaFJST2tfQzM4bHdNc01QSVJDaHdMamhQYmp4dFZ1a0FQd2dvZUdka1FzUUZubEdacTlXX3hhYy1TMy13RmpCRFBZc3A4UTNLTGhNNnVwWjExbFI5OE91NmIxekhPaldrbzdScXU2dFNKSzZhRURWSW1WSjExV25xUXk00gGcAUFVX3lxTE9xX3NWV0g4VmNOVVlVSnByYXNSbDJlZXFVNE1FMXN6S2ZDX0NRV2FOUG5sNXpybl90QnRsVl9Jdnc0UE42TEZ4T3lQQ1JGcWVHUUdaWUJGZUNKb1JFVm53ZXpra2pFZGpZRmFhRGRHTnBTa0RuLUpsaEtvTm8td0ZKQVE5NTBRSlRreDRHNnRVVUhlQVlkaTFOT210LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Panama Canal ports will keep operating after court finds concession unconstitutional, president says - AP News",
    "description": "Panama Canal ports will keep operating after court finds concession unconstitutional, president says  AP NewsPanama High Court Gives Trump a Win Over Canal by Ousting Hong Kong Port Operator  The Wall Street JournalPanama’s Decision on Canal Raises Questions About China’s Holdings in Latin America  Barron'sPanama voids Hong Kong-based firm's canal port contracts  BBCScoop: Trump expecting favorable Panama Canal ruling to further \"Donroe Doctrine\"  Axios",
    "published date": "Fri, 30 Jan 2026 12:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNLUxlVTRMRUd6UFQ3MHZNRVVaVGRtTmFOcFRlbTlzWE1USmthVjBHOG9SeEhDbDRsNHNCQi1lVk9nNHBkRjlZYWtwMGtJa1NCdXJQMmZYU2hLN0tCb0k0elNqV1E1MHhxZ2ZMRlhZU0pnM0ZkM3FYc0hhLW1CQWV3aExHVVE1UFU1b0RmSnhiMVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump says U.S. will decertify Canadian-made planes, threatens 50% tariff - The Washington Post",
    "description": "Trump says U.S. will decertify Canadian-made planes, threatens 50% tariff  The Washington PostTrump Threatens Canada Over Business Jet Dispute  The New York TimesBombardier stock dives on Trump threats of 50% tariff on Canadian planes  Al JazeeraTrump says he’s decertifying Canada-made aircraft and threatens 50% tariffs  CNNCanada Says Jet Certification Trump Complained About ‘Underway’  Bloomberg",
    "published date": "Fri, 30 Jan 2026 18:12:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOLTJ5OG02WXBjSm9fVHBacE1mZ2NJZ080UkNiUFhEYWV5R19IRTVEQWJjbkpTZnYyWTFSVlRJOFpXQU5ZZHhJcHRYaE84c2hIMEhkN0RfZkNuZ0xyN0NkTFNHbmlQY3hhT2RJa2dMSkUzSlV5aUFhcjkxXzRhMVlOMkx3X2R5cGdlZjV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Minneapolis’ Hotel Workers Are on Edge - NOTUS — News of the United States",
    "description": "Minneapolis’ Hotel Workers Are on Edge  NOTUS — News of the United StatesMinnesota Proved MAGA Wrong  The AtlanticMinneapolis citizens on protecting their neighbours from ICE – podcast  The GuardianLive updates: DOJ opens civil rights investigation into Pretti’s shooting death and anti-ICE protests spread nationwide  CNNList of ICE raids, major updates in Minnesota on Friday, Jan. 30  Bring Me The News",
    "published date": "Fri, 30 Jan 2026 10:51:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYTJMRTZqeXNuZnBVaEp5amRhbVVuRlBCT0JNb0VUWFhoa0dzWmo3VzktSFpQYzZMYU03Q2hsN29VTENPRzRydjFxZjdyUmo5YVQ3cGJGb3lLMEx4dnpEMTNsTHVTdG1ya1R6MVNxSzU4ZmdnWXJUV19fS1VWOGRSbkh6WVJ6YW9i?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.notus.org",
      "title": "NOTUS — News of the United States"
    }
  },
  {
    "title": "Syrian government reaches deal with Kurdish forces - BBC",
    "description": "Syrian government reaches deal with Kurdish forces  BBCSyrian Government and Kurdish-Led Militia Seal a Deal to Merge Forces  The New York TimesSyrian government and Kurdish forces reach deal on permanent truce  The GuardianSyrian government, Kurds agree integration deal, US hails 'historic milestone'  ReutersKurdish-led SDF agrees integration with Syrian government forces  Al Jazeera",
    "published date": "Fri, 30 Jan 2026 12:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFAwWW1WcVg3Skp1aUJ6OU43VFlMSVBNQzY3M003alRVNlU1OGlzYVFaQjhpZURIUm5EaHZzR2pHbWVuTENKWE5QSnY3Q3JPSVB2LTlQOWdDc1dndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump sues IRS and Treasury for $10 billion over leaked tax information - NPR",
    "description": "Trump sues IRS and Treasury for $10 billion over leaked tax information  NPRTrump, two sons, Trump Org sue IRS, Treasury for $10 billion over tax records leak  CNBCTrump files $10B lawsuit against IRS over alleged tax return leaks to major news outlets  Fox NewsTrump sues IRS and Treasury Department for $10 billion over tax return leak  CNNTrump sues IRS and US treasury for $10bn over leak of tax returns | Donald Trump  The Guardian",
    "published date": "Fri, 30 Jan 2026 06:42:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNT1k4OFFaTWtTcTM1N2k1akJlbUEtazFkaUNUN0lTTTdpZjJVTzRfbV8zOFJIWTB1d2ltdkcySEhjaUdlY1NQZmU5REVxbEJWVGF2cURCT0NBTzVBSkpjTjhfYWpDOHJuRlpDN2hkZl9iWHpzNDF4MDJ2ZHVXeFJhcEg4LVdmU0tXQjMwREF0ZnV4QWJYSkpWOGh0RFZSbWFTd1A4dEQ2Z0IwR0gyZHZ5VjFROU1sQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S. - Axios",
    "description": "Iran's foreign minister says Tehran ready to resume nuclear talks with U.S.  AxiosIran says it is ready to talk with US amid diplomatic scramble to head off conflict  The GuardianIran prepares for war as US military ‘armada’ approaches  Al JazeeraIran Says It’s Ready for Talks If Trump Stands Down Threats  BloombergIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNN",
    "published date": "Fri, 30 Jan 2026 13:11:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbGJJSUlaNm5BV1VOMmVYTHVNa3V3Y2ZnV1VyMXRkeFFNV01JSmNYTFJvMmxMRGJ0LVdHRTNSdHVwOGpVS3RaRC1UcDJSTnBkRS16b2ozUFNPdEVIdEdLX1N6OTJWSTgzcFhIdGxYQnk3YndwY3NaWGhzb2FqLVhfeHFYOXdhcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "DHS ramps up surveillance in immigration raids, sweeping in citizens - AP News",
    "description": "DHS ramps up surveillance in immigration raids, sweeping in citizens  AP NewsThe Tech Arsenal That ICE Has Deployed in Minneapolis  The New York TimesICE’s surveillance app is a techno-authoritarian nightmare | Moustafa Bayoumi  The GuardianThe powerful tools in ICE’s arsenal to track suspects — and protesters  The Washington PostICE has expanded its mass surveillance efforts. Online activists are fighting back.  Politico",
    "published date": "Fri, 30 Jan 2026 12:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNaGlrOHlPUGV3Qk02U0g2a2VCTUpGbWhobDJaMmdsdkN4OHRNMFJlc1F2Z19PMVZUTGlTQjE0bWRhNGs4YjB6cHlTUndSZWV0Q1FvR1dxbkt0bkpERWU3LU5ya0ZQdHlHbEx4empodGNIdzhMcDZLS3c4QzkwUi02SlFhQ3cyYTd1RFFublFwUFJNZkxUODVKa2FtT1FlUW5aTlR1bDBIT2Q1a0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Sen. Susan Collins announces end to ICE large-scale operations in Maine after talks with Noem - AP News",
    "description": "Sen. Susan Collins announces end to ICE large-scale operations in Maine after talks with Noem  AP NewsCollins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesICE surge ends in Maine, but Somali immigrants are still reeling in Lewiston  WBURSen. Collins says Homeland Security ended enhanced ICE operation in Maine  Maine Morning StarICE arrests more than 200 illegal aliens during 1 week of Maine operation  ICE | U.S. Immigration and Customs Enforcement (.gov)",
    "published date": "Thu, 29 Jan 2026 23:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQZnZ3VGRIR3NuVGFvVVRDVUVmYzBjc1REaWpwNFBWUy1UYnZneDRaNDBfYkJUV1NUT1F5OFZrOUJnWi16MTI0cHdOcldXWjFzdkNoOWFqdE9Rd1hlcFJta3RZUUV5bkhkVThlYkhPN19keHVtQnR6ZDlSblpVZWJSQnd3ZHY4Y3R5VGY0VElMTEhZQ3R2YWtNc3RsVVdsZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Minnesota Dems are trying to walk a tightrope with Trump - Politico",
    "description": "Minnesota Dems are trying to walk a tightrope with Trump  PoliticoMinneapolis Mayor Urges Other Cities to Stand Firm Against Immigration Crackdown  The New York TimesTrump reportedly sues US Treasury and IRS for $10bn; US Senate reaches deal to avert partial government shutdown – as it happened  The GuardianFrey calls Operation Metro Surge 'an invasion of our democracy'  kare11.comMinneapolis tensions deepen again as Trump accuses mayor of 'playing with fire'  Reuters",
    "published date": "Fri, 30 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNN3o1LWZIb2lCYTRFM3AzcWt2eGM1bVZZNXM3eFZ2dks1dDk0dHBzRFhobWVueUtDVDNmcmZYUFZzZFJaM1dyT1ZSQkJLc3Rsb0U5UW5GMXBaVFVfNzFQVmFleUZpVzJyVFY0ZnVFWTBaUmdnTU1kWDYwbkh0RWEtNi1veWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart) - Syracuse.com",
    "description": "Upstate NY’s winter blast: One village has seen 13 feet of snow. One city got 45 inches this week (chart)  Syracuse.comWeather forecast: Snow just keeps coming through the weekend  RochesterFirstOswego diner braves snowstorm to serve community hot meals  WSYRHeavy lake effect snow this afternoon  WWNYAutumn's Forecast: Deep freeze settles across WNY with below zero temps  WKBW",
    "published date": "Fri, 30 Jan 2026 16:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQenZTWUZFS25jUDd6VXphNjRvYnczWl9aN3o1WEZBR2ZmRXNTNmZRR282blpCQUJHX2hLMFVCNzE5NXZVQmZ4X2tFMzB5UGN4c29ESTFETWFCdVVVVC16UTlWdkpBd05fZXlwN1J1Q0ZMdHVFYXM4UzUtQ1hqYUNyZE1xNWdIZF9ybFl5M200NTBFZHJGRUpYMzZsUGZHUVRVaWl4X3JKS1hyX19PWFAtaEZzZG1sbXh6WVVKTFU5NWhFWDlkdkpxR3NaUHB1RHJhc3ZyZWNaRVdlLXRuRms0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "Homan plans to pull agents from Minnesota. And, Senate strikes short-term funding deal - NPR",
    "description": "Homan plans to pull agents from Minnesota. And, Senate strikes short-term funding deal  NPRView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 12:49:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQQ3oyc1UxalVSbUxmc3dYWU9ROFlBdlJObVh3THR6YXlLY3NLZ0hzUjMybVJlZTJhUUdQOFkwZzBHVGNhYXhZblBkZVNfRFdYd3Y2dUlFZkNMVzl1VXNINXNwejVsRlRCNXc1bU1LdDF4SkVpWXJCQ0dENE9LZndEZ21sUjZIZ1RWNlNoLURiMV9UTFNzZElGd3VaTW04dElUUzVCTHZMUWoyUFZmOWNGaUJKTTN2SjZ1eFo1QkdqY255eWtLNlVta1QwRFJoOE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "I'm a business owner in Minneapolis working 16-hour shifts so my staff can stay home to avoid ICE - Business Insider",
    "description": "I'm a business owner in Minneapolis working 16-hour shifts so my staff can stay home to avoid ICE  Business InsiderView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 10:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOSkFjemVHQ2dRZ1RkbzZ5U09uM21EbG00RXpkLXgtdHV3Z21keGpLZTRpNHlUUE5oRkJnQVk1V2xocTFDbkR0TEtKQlMyMVBsblFfcXYybGJuRU5fdGNQZlljdEtVb29kc3lETGxaaVlqT3VfWFFvVDBYUlRPb1V1cUl5d3VXZFBrSUFtWFhHTE5USGx1c3hGdDNhdFJ2UUR6dmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Pizza Cutter and a Fork: A Bizarre Bid to Break Mangione Out of Jail - The New York Times",
    "description": "Pizza Cutter and a Fork: A Bizarre Bid to Break Mangione Out of Jail  The New York TimesMan allegedly tried to break Luigi Mangione out of jail by impersonating FBI agent: Sources  ABC NewsMan poses as FBI agent to try to free Luigi Mangione from jail, source says  CNBCMan impersonating an FBI agent tried to free Luigi Mangione from jail, authorities say  NBC New YorkFBI imposter tries to break Luigi Mangione out of jail: Authorities  NewsNation",
    "published date": "Fri, 30 Jan 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQ21aYUpRN2EwbnRjaFZMNmtiSnliZ3hHVUtkcU01b255djB6MWVndHZoanpJY3dodXFhQnRLV2ZqdTRUMUMzV2pVaXIzSjNMaGtXcGlGcUJRVkNQQTN6VGNIUmZneEZzZU1MWXFzMFNJMV9pLXNsU3ptWU90ZDF5SDVReVR6dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump threatens tariffs on countries selling oil to Cuba, declaring national emergency - ABC News",
    "description": "Trump threatens tariffs on countries selling oil to Cuba, declaring national emergency  ABC NewsMexico’s president says Trump’s tariffs on Cuba’s oil suppliers could trigger humanitarian crisis  The Guardian‘A hurricane is coming’: Havana prepares people for war as US shuts off Cuba’s oil valve  CNNAnger and Anguish Spread Across Cuba as It Learns of Trump's Tariff Threat on Those Who Provide Oil  U.S. News & World ReportIf Cuba falls, the Global South is to blame, too  Al Jazeera",
    "published date": "Fri, 30 Jan 2026 04:27:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNVTBsMHlpQUdmeDFfREhWbFFDZm5lb1c0NGpMdXIxdEpDUVY3bTl4bWw1QlplQ0VuVXBLYWo1MkFCRGhLSmFGY1pwRnJlMU56V1dBQkVMRFhMbE53UjFHdTNyQmc0S2l4dmxEalNqSUdkaVBjdnBXQzY0X3RkS1hMYkk2R0Q1anBSSXk1WUlWOXVRQVE4ZnJUNzFkUXdkaTBQN05zNzczRGJWX2VteVdhRlIzejIwNVnSAbwBQVVfeXFMTnoySmtyVGV5eEk5dEh5a0xyUVplZFlLcDJsY25KUnE0a2dlSVNKd2hRSDdBT2RKLWdQZzVyWE9qSEhKZWgwRXl1dWFmQjlDd2NZTnI1bkdKRDN3dHdJcFR0X0lWZERJVnZQa0tBQmlHNThLMkZhbG1LblRmbXhreHRWR2oyOTJ0VUdEOWJuZDlfN0NzMXZkanFYUGNFTkJBTThVbURvRVJuS0dnSzA2dm9GNVVxeTNIZnBfTnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Lawyers want to send Trump a message in New Jersey: Free accused criminals - Politico",
    "description": "Lawyers want to send Trump a message in New Jersey: Free accused criminals  PoliticoAppeals court won’t reconsider Habba disqualification, paving way to Supreme Court  The HillCourt Affirms Ruling That Alina Habba Served Unlawfully as U.S. Attorney  The New York TimesTrump’s trio of successors to Habba challenged in N.J. court  The Boston GlobeDOJ faces challenge to tripartite leadership structure at U.S. Attorney’s Office  New Jersey Globe",
    "published date": "Fri, 30 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQM2QtTHVPUnlUWXZpMDRIZF9nNldaanphWlI3YTZzOEUtYjdES1A3OVFPckg2cHY1TUJrdExjQ2tzNi1zaGxlOGtsXzRyVjRObENMd2EzTlNCQVlOUlJubnl0cDk3eENCZmpPcm1adnpnc1ZfRkZSWnlpVTlhSktTZlNXNUwzX3kwT3FDMVNMR3pBWnZXS2lLcDVHZHN1RFlPRUZNLXBJTTJreDl3RDl3eEFfdk5aZzV0Q3dpdWZZQXk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Noem says her response to Pretti shooting may have been wrong - Politico",
    "description": "Noem says her response to Pretti shooting may have been wrong  PoliticoSen. Jacky Rosen: It's time for my colleagues in the House to impeach Kristi Noem  MS NOWWNY Congressman Tim Kennedy calls for withdrawal of ICE, resignation of Kristi Noem  wivb.comWhy Democrats won't rush to force Noem impeachment vote  AxiosJeffries threatens quick Noem impeachment push, says Stephen Miller also ‘needs to go’  The Hill",
    "published date": "Fri, 30 Jan 2026 03:59:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5iUlcyQnl2SW02MkZKN3Z1clhOSGFGQkdydlgwNjc0QkFFM2ZJVFlJVmhwb1lQRWtRa2x3OWtWMjhnT0JaLV9ZazZrYmlOVUgxNkJkYTVMZ2NweTZyQTMzYTJnRTJxaW9uY3I1YVJOc2o0dU5OZERtSU5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Venezuelan Lawmakers Approve Sweeping Overhaul of Oil Sector - The New York Times",
    "description": "Venezuelan Lawmakers Approve Sweeping Overhaul of Oil Sector  The New York TimesLake Maracaibo: The oil region at heart of Trump plan to 'Make Venezuela Great Again'  BBCVenezuela’s acting president signs oil industry overhaul, easing state control to lure investors  NBC NewsUS lifts some Venezuela sanctions to ease oil sales  ReutersTreasury opens Venezuelan crude oil trading up to more companies  Politico",
    "published date": "Fri, 30 Jan 2026 00:25:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVFF1UEZHN2VXbzlMak84T0N2aUtqSDRxd1ozMkxDM1I4VGlRaWpQV2d3VjhyekpjM1NFVTctN01MU2NSYUNmQkVnUDFvSmo2ZnRESlZwNlhLMFZ5MXJrem5mbDB5bEQ2OS04QnFNU2R0LXhsZHJqSERZeWh3cndiQ0ZTREstWFg0N3VlMlB5Q2Z6V1N5bXRJOHVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody - MPR News",
    "description": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody  MPR NewsPreschooler and three other students detained by ICE, school district leader says  Star TribuneProtesters gather outside Texas facility where detained child Liam Ramos is held  BBC“Let Us Out”: ICE Detention of Children Sparks Protests at Immigration Jail in Dilley, TX  Democracy Now!Detained 5-year-old immigrant is depressed and lethargic, Texas congressman says in demanding boy’s release  CNN",
    "published date": "Fri, 30 Jan 2026 02:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOdWNaVnpXdVBxTnZybWZvNUg1aEZpV1NqX2hfY2pJVXVQZUZyQVpPaEo1YjM4N1JDOFlqWmNRNmFLa1IxOUNvWmdWOW42b2hhNHlaOVZ4SlZKVnc2cTlLdUxScXNtU0ptWF9BbnR1NXpTdXE5Ni1UalZKUVRHU3JuOV9jd3d3VS1hY0hQbFNKN2RpSWFXOWdlaHhqUHAwS1RTa2k1V2RXcFdybTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Trump claims Putin promised to stop bombing Ukraine's cities due to extreme cold - Axios",
    "description": "Trump claims Putin promised to stop bombing Ukraine's cities due to extreme cold  AxiosTrump Says Putin Agreed to a Weeklong Pause in Attacks Amid Extreme Cold  The New York TimesConfusion in Kyiv and Moscow after Trump says Putin agreed to pause attacks for a week  NBC NewsZelenskyy cautious on Russian bombing pause during extreme cold weather  The GuardianRussia halts strikes on Kyiv until Sunday at Trump's request amid bitter cold  Reuters",
    "published date": "Thu, 29 Jan 2026 18:16:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNZmVScGZkdWdQcjIyM0wwR2N1VjJ4MXlQU2pQcERLNEZPSDVxaWZOWHNpaXVVLVFkMGdyT1o3eUtqWTNpUUlFZXlCU010NGZJQnlOQ2pWdHQycnFSSl9FSW05a1dVcnBZVjJhcG02dWQ0cXpBZ1BuejNURWhnVmgzWVhlZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Carney urges US not to meddle in Alberta independence movement - Politico",
    "description": "Carney urges US not to meddle in Alberta independence movement  PoliticoA separatist group is asking for Trump’s help to split from Canada. Here’s what we know  CNNAre Trump officials driving Alberta’s separatist movement in Canada?  Al Jazeera'Respect Canadian sovereignty', Carney tells US officials after they meet Alberta separatists  BBCCanada separatists accused of ‘treason’ after secret talks with US state department  The Guardian",
    "published date": "Thu, 29 Jan 2026 21:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOUTBSbmYwNVZZRjVGTktzbFgyRkNpX2EwbnVoR0dfTXJrM3BWa0ZYNlN3TWNHZGZWa3pDZWNOeGJLMDhDSXp0OUZUeUh3YXQ4SmQzRzJoaVVDVHNwR0dlVGlPUVFZTmF6UENHRnNmNDB3NU1WcTM0WTIxNXBhVWdHSkRrZUpSTXpWZGZLc0dQUi1wSklYaTQtbVdXNkZJdDktUEc1aDQzeERaTjJSbG1ZU3pDOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "One year later: Families remember victims, urge safety changes after DC midair collision - WBAL-TV",
    "description": "One year later: Families remember victims, urge safety changes after DC midair collision  WBAL-TVDC divers describe moments after DCA crash and finding victims' possessions for months  NBC4 WashingtonInside the Cockpit of the Helicopter That Caused the Potomac Air Disaster  New York MagazineA year after the tragic DC midair collision, first responders and others are remembered by victims’ families as heroes  CNNOne year later: Here are the victims of the Washington, DC, plane crash  WYFF News 4",
    "published date": "Thu, 29 Jan 2026 23:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1OTG5iS1pfR0FqMDZnNGlYeEU4NW56MWNnTmt2enhZYjFCRHJKM3FSdDBwdnFpdGJULXpQcE81bG1rYmJQTlNtU3hIVGVGWm4tTVR0Y2FmZ3R1NG4ta2l6UkFWdWx5cTBic2Raei01RmFfOVJMWmVWamM4ZWEtRDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wbaltv.com",
      "title": "WBAL-TV"
    }
  },
  {
    "title": "Nebraska officials respond after Fremont student struck by vehicle displaying Trump flag - Nebraska Examiner",
    "description": "Nebraska officials respond after Fremont student struck by vehicle displaying Trump flag  Nebraska ExaminerCar Hits High School Student in Nebraska During an Anti-ICE Protest  The New York TimesFremont student hit in apparent hit-and-run during student-led ICE demonstration  Nebraska Public MediaPolice say they’ve identified the juvenile driver involved in Fremont student protest pedestrian crash  WOWTBystanders describe moment girl was hit by car as driver's sister says he didn't mean any harm  KETV",
    "published date": "Fri, 30 Jan 2026 00:20:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNdm1tUkdWcHRZMGZpLVhXb19NZDVXdmU1aVVNbHRiNEl6dFpHdWk5MDlROWVkWnNTR19ydDgtb2F1RUxIWDc1MDlDd2IwUG5VbUhVYmdhZldKbEtCUENRVnZsZlFDR19LY2QycDAtbk9JN1FSUURZVXB0dWN2eTJnZVRnNk9oeDh2YXBmNUlwLWZ5S0h3SVpvbHBUV3R4cXJtQV9MV1E2S0lNUkNYTERBOVBZaGp0d1NGNXVuRktaMUlDV0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nebraskaexaminer.com",
      "title": "Nebraska Examiner"
    }
  }
]