[
  {
    "title": "Border Patrol Commander Greg Bovino returning to position in El Centro: Sources - ABC News",
    "description": "Border Patrol Commander Greg Bovino returning to position in El Centro: Sources  ABC NewsGreg Bovino Loses His Job  The AtlanticGOP Questions ICE Tactics - CNN This Morning with Audie Cornish - Podcast on CNN Podcasts  CNNMinneapolis Live Updates: Trump Pulls Bovino From ICE Operations in Minnesota  The New York TimesBorder patrol commander to leave Minneapolis after shooting of Alex Pretti  The Guardian",
    "published date": "Tue, 27 Jan 2026 15:18:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPQjdFeHNoTEVvblRRby04MTVWY09RbmtCSjUtWHdBSy1WX2VDM21lOGtVNVRyS3BqX2tCejFPazdpTzFtdDF5S3VzbFhPWXRfcDJOQ1pGbl8yM1JRd2VIcTU0QXBwMmVnWHBzaDAwZ2pJSm9raDlVY19GRURvNFMzUTJ0eHZXbFBmS185R042MkdvM3lxbFpUaGRuRVEzeTNzZ2Z6X2VXb0t3elpt0gGyAUFVX3lxTE8xN1lNVEUybGtYcmFIQkJKNzZfMXdzY1J5T2FjUWZVemJxY29CZWNLYTlEd21XaTJLdU5CRGxPTkk1YnVQczR3QU9MLS1hNVU4YmxwbzdycmtwRmZWV0NMOWVLRzVLZS1EWF9QdFJmMjNLREVaLUdWWU5pU0ZpTkRRWUx1LVg1dGhNWThHT2hfa3QzQjZSNldYWHhfaW8xZi1nWTRZQlZPZTQyQWR2T0V5MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Gun rights groups blast Trump over Minnesota response - Politico",
    "description": "Gun rights groups blast Trump over Minnesota response  PoliticoBody Cam Video Related to the Shooting of Alex Pretti in Minneapolis Is Being Reviewed  The New York TimesICE Shootings Are Freaking Out the GOP. They’re Afraid to Tell Trump.  Politico'We're all terrified', Minnesotan tells the BBC in tears  BBCThese Republicans Are Breaking With Trump Over Pretti Shooting  Forbes",
    "published date": "Tue, 27 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOOHcxWFlici1KNTFlNGV3d1FFNzZibEtNWjhkbEJHR2VoRzczVjkxcjgyTVAwd3BGNjgzbEYyUGtNWlhxWGZDU3paTWw2Qmc5UzBfOWg0OURndjJScVY0Z3NqMHBYSUs2Sm9FbjdTWFFMY01BTUlOcHl3b1kwRVNVXzR4QzF6NExzTWVEV2pYQlBDMW5aS0ktM3hWSy1uUi1iaVMtQWt3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Judge Orders ICE Chief to Appear in Court Over Potential Contempt - The New York Times",
    "description": "Judge Orders ICE Chief to Appear in Court Over Potential Contempt  The New York TimesMinnesota judge orders acting ICE director to appear in court  CNNTrump admin wins court victory freeing ICE agents from Minnesota protest restrictions  Fox NewsTrump, Bondi statements fuel legal case against Minnesota surge  PoliticoFederal judge hears Minnesota's arguments for ending ICE surge  PBS",
    "published date": "Tue, 27 Jan 2026 15:10:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOMm1TeVY1NlVMdXFZejNXQ0V3dlFDQzdnRnhScnZwWmJ2ZEtybGpkQ0FxSXo5MUJHc0lwbWF6ZjhXNE9Bb0kxdy1Hdlgxd1BYajZ5TGt5OE9ubmFNdGhkeFpNakFIM1N6LTRITmtZRDVjcGQ2dDJ5cS00WlIwZlhXOFNERDFaUHgyMFFz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Minneapolis shooting: The Trump administration is admitting it lied about Alex Pretti - vox.com",
    "description": "Minneapolis shooting: The Trump administration is admitting it lied about Alex Pretti  vox.comPretti shooting puts Noem, Bovino and others in hot water  AxiosWhat the Administration Is Signaling to Federal Agents After Minnesota  The AtlanticICE and America’s flailing autocrat  Financial TimesTrump shifts course after Minneapolis killing  The Hill",
    "published date": "Tue, 27 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUGpFUV9MRTE1ZE1fZVdrT1JMLURtSUowUVIzUmhwRU5YcWwtWTIwNU5UQXM1T21Td0FET0lnN0Mwb21rQm44TzA4ZkFCRTB3c0NZX1pROGp4bmpwM1pGbm14bDVPWHdaMndLQjJkMHBhWEV2TmlSbElRXzVDeVRwNzhkSlI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "Could another storm hit the East Coast this weekend? See the scenarios. - The Washington Post",
    "description": "Could another storm hit the East Coast this weekend? See the scenarios.  The Washington PostAnother potential weekend snowstorm looms for NY, NJ: Early thoughts, forecast  fox5ny.comAnother potential winter storm prompts more Weather Warn Days  wlos.comPossible East Coast Bomb Cyclone Could Bring More Snow, Wind To Some Areas Hit By Last Weekend's Winter Storm  weather.comCould Massachusetts get hit with more snow in blizzard this weekend? Here's what the weather forecast says.  CBS News",
    "published date": "Tue, 27 Jan 2026 16:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZkpsQUs4UjBQbFZNYm9iUzZ1d1lZSnMyQWtZUEVnYTU5clloLUJuRlZ6QXQ0bFZiOWZFM0ZYRGs5aFlRMWt1aVUtcG5QNExURF8wUk1DbkIyNmFkek9Pd01TOUdtbkM2YThCOUJvMm9IVXJiVXRvTlFJTnU1b2E0VUU0WG55T0pWZkQ3cFVCWHlXcXkzYkJBZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "First wrongful death lawsuit filed against Trump administration over drug boat strikes - NBC News",
    "description": "First wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of two men believed to have been killed in military strike on boat sue US government over ‘unlawful’ attacks  CNNTrump admin sued over 2 deaths in boat strike off Venezuelan coast  USA TodayTrinidadian Families File Wrongful Death Lawsuit Over Boat Strike by U.S. Military  The New York TimesFamilies of killed men file first U.S. federal lawsuit over drug boat strikes  NPR",
    "published date": "Tue, 27 Jan 2026 15:28:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNQ1hELWhUMTltWS1ueE1QUXNaM0R1TFpMcEtPQ0ozLWZRSTU0dXNpVGh1emt4MGJWT3kxZjM1UndLV0xpUnMtazdNd3JoZWVmN281LXZKdmJyZkJHNFpPZHAwNmdzdDRHNTdONjVIMXFmVTNwZU9XdF9JbXNlVHFxSjdmelMwOVZsWUpJNXlxQ2RmbUUzNE5wY1JkZFBNTUVxSDF4QmdKQjFHQTFZQkNpWEFSQUlpSHJiTnhNemFMeDctQk1y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Senators seek pause on DHS spending bill, following fatal shooting of VA nurse by Border Patrol - Federal News Network",
    "description": "Senators seek pause on DHS spending bill, following fatal shooting of VA nurse by Border Patrol  Federal News NetworkDemocrats Embrace a Shutdown Fight They Wanted to Avoid  The New York TimesLive updates: Minneapolis shooting snarls Senate's DHS funding plan; Trump goes to Iowa  The HillMost of the government could shut down this weekend. ICE operations would carry on.  NBC NewsSenate Democrats urged to demand ‘real reforms’ over ICE funding bill  The Guardian",
    "published date": "Mon, 26 Jan 2026 23:19:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOZkhKMlJpUlE2aXE0aGU1VUNEeld6ZDlTZnNvaUZQTjZZdEdkeXJUNFRWVllGcUJiTkotTTdVYjBCa1ZZOElfTEJwOXBmVHVLVURWRWQyUlR6RVp5Qnd4WTg4OWh1TWVvU1ZOVXBJSmUwR18tT3ZLakZjeFJEbVF4NXBlbWRrSG5vRjFrQmpLdDMyTTdkUC1LbXRYd2RIR3V4SWZXMTdNdGJIaVQ5S0dIbVM2MnBLTEJJRy1rUTctdU1HbDFxSGRFeE1OOGtMeS13UEtuTDFIbUFndlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://federalnewsnetwork.com",
      "title": "Federal News Network"
    }
  },
  {
    "title": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers - The New York Times",
    "description": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesAlexander bros: Another NY jury will soon weigh the fate of men accused of using their celebrity and money to assault women  CNNWealthy Florida brothers face trial over alleged decades of sexual abuse  The GuardianFederal sex trafficking trial begins for luxury real estate brokers and their brother  NBC NewsAlexander Brothers Go on Trial for Alleged Sex Trafficking, Abuse  U.S. News & World Report",
    "published date": "Tue, 27 Jan 2026 08:00:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNnVzRjZCR0xCNmtRb3pBd2VZNjZLeG1wWllXRHBYdFBEak5EODZTTEpwdEJ1SDF5ajZ6ZnkyLXhHYlc5aFMyaTRsa01yQkh5aXVJRklnTThXT3ptYlV4WW15VlpSQjRGUUxmY2ZnZVVPQjRpTi0wXzV3aElndWJOblpDa09JSGdnYkZVNFprek03dTBINndvNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge throws out Trump push for Oregon voter private data, citing Bondi letter - oregonlive.com",
    "description": "Judge throws out Trump push for Oregon voter private data, citing Bondi letter  oregonlive.comFederal judge dismisses Justice Department lawsuit seeking Oregon's voter rolls  ABC NewsJudge tosses Justice Department lawsuit seeking Oregon voter rolls  CBS NewsThe Trump Administration wants your confidential voter data. What’s behind their battle with CA and other states?  laist.comJudge tosses DOJ petition for Oregon voter data  The Week",
    "published date": "Tue, 27 Jan 2026 01:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPeEw2MU82ejB6QzlTLVh3VnBfd1JweVNnWVJkQ3NJWEU4U2NJWDRfdnQyeWtfT3FkMkt3d3gzQ2JuTlZGeUJGY0ZoUF9GanBIZ2Q0a0d2NGlkR01YcV95MWlnYmVBUUxBVXpydnllOWJNSkdIZU9KaTRRMEE5QXhNWjZTVlFiQzB5VU52a2R2eDdaR3JxQldlRFVNdGROUWR0V3I1eUFreTNkenNIM2NSMVBHeWp4LUk5dTlGX3ZIMmpSYzVj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "oregonlive.com"
    }
  },
  {
    "title": "White House distances Trump from provocative claims by Noem, others on Pretti shooting - ABC News",
    "description": "White House distances Trump from provocative claims by Noem, others on Pretti shooting  ABC NewsTrump abandons attack mode as Minneapolis shooting backlash grows  BBCBovino’s future in doubt as White House walks back initial claims about Alex Pretti – US politics live  The GuardianWhite House Distances Trump From Initial Response to Minnesota Killing  The New York TimesLeavitt distances Trump from Noem, Miller rhetoric on Pretti killing  The Hill",
    "published date": "Tue, 27 Jan 2026 12:34:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbkQ4cWpoNk5mdllFclU5aVFCLW1JWGppdS12RFBuTm1KdkdnTDdMTWxZeUZHNnF3Tk1XckRrcm1Mc3dLUWt1enFwaWFyaGoxOE9pSVo0QlZHcFItLXhleE9QUmszYUZxWFlid1BnaEw3ZTFnTWhwbVVxbmlqUkJscmdEXzl4RFNTcDNQc05tckhtRm91WjFyaElQdUFTUXNXU1gw0gGoAUFVX3lxTE80bzBiX0l3ZnBHdENuak8tRzVxenlxdExnVkdUb1NhUWg1bkZ5YkUxeUxieU9rMHRaNGR2VGVWRVFfV1FCOU10Z01xQ2dyMTBiOFBLSk4wc3M0UW1xRXI1UEE2WEZLX3dCZmRVQTMtMW95SGExZDNCdjdKbWdUQjdxZldxRGF4Y3hwYVBFTDhRM2s2R3lEYlhocC16Mk0tYkppYVZyMU1kbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Who is US border chief Gregory Bovino, the ‘little Napoleon’ with a viral coat? - The Times",
    "description": "Who is US border chief Gregory Bovino, the ‘little Napoleon’ with a viral coat?  The TimesThe rise and fall of Gregory Bovino, US border patrol’s menacing provoker-in-chief  The GuardianWhen a Coat Becomes a Symbol of Conflict  The New York TimesWhat to know about Gregory Bovino, the commander of Trump’s immigration crackdown  AP NewsWho is Greg Bovino, the face of Trump’s Minneapolis crackdown?  Al Jazeera",
    "published date": "Tue, 27 Jan 2026 09:44:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPaFJLMUQ3YndrTmNfOVZCSloyUkFTb0pacGEta0NEZ3dadkZfUGZnVE1xTy1TS3hndFhRemFzS1NrdnRSdElHV1ZTRGc3UzVlaXFVcFVvVVc5VnliREtPdzczdTMwSnNycmdwM0VhM3habDlFUlJzUkZmLVlURkdra09MbGhMaTgyNko4MHNwdU9ZVWk4aGdkWkdDTWhGZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thetimes.com",
      "title": "The Times"
    }
  },
  {
    "title": "Trump raises US tariffs on South Korea imports to 25% - BBC",
    "description": "Trump raises US tariffs on South Korea imports to 25%  BBCTrump says he’s raising tariffs on South Korea because it’s ‘not living up’ to trade agreement  CNNTrump Threat on South Korea Jolts Trade Partners Who Thought They Had Deals  The Wall Street JournalSouth Korea scrambles to pass U.S. investment bill after Trump threatens higher tariffs  CNBCKorean Stocks Charge Ahead as Trump Tariff Threat Fuels Dip Buys  Bloomberg",
    "published date": "Tue, 27 Jan 2026 09:56:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE81UXpNM1dyWDFMc202dHlFcHp3NFRkb1JBRHNiSWwwaTdtRUhSS012aHZKbWF1SDg3UTdXUnpDRVhsNEJZVTVXU2ltQWRTMnZGT0c0MEFvSEs2Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next - The New York Times",
    "description": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York TimesAmerica has reached a tipping point on fascism – and on opposition to it | Robert Reich  The GuardianMonday briefing: Minneapolis shooting victim; winter storm; Super Bowl LX; bottled water vs. tap; and more  The Washington PostNear site of Alex Pretti’s killing, a Whittier church opens its doors  mprnews.orgTrump’s enforcers have unleashed a fascist fairytale on America  The Independent",
    "published date": "Tue, 27 Jan 2026 10:04:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQeGgzbUxpbzk4NElBX2FCVWhTaFV6ZkFYVV93cGRZU2ZCTmNiOEZ4aFU4alZ2bVRkaklKU0xFOU50OWJ1RVFnb2tPcDNHV1R0Z2gyM1pqS2lESWNqVE1nTDZRVnZHOWx0QXdvNHB4TmVDX2lPYzRuNVBEN2d3QlMxdVVLR0dGaktYZXBpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics - The Guardian",
    "description": "‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics  The GuardianItalians furious over deployment of ICE agents to bolster US security at Winter Olympics  CNNICE Agents Will Join Olympics Delegation in Italy. Many Italians are Angry.  The New York TimesUS to send ICE agents to Winter Olympics, prompting Italian anger  BBCReports: ICE agents to have security role at Milan Olympics  ESPN",
    "published date": "Tue, 27 Jan 2026 14:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNYUZ2V1dlaXNIX0RMMjg1RWdUbHg2TEpwcTczQ0FWSGk3Zmxzc2pxQldHQWtGcUhXMXUwVHY1NzdJTWFQeU5Na2FOMEpmaUNVVF9wb1pxLU1IQjlZRnpadlRuNThGZFViYWlMbkRackRBOURneHdCVEluc1F0X3VveXFVZlF1U1JWTk1ia3dVSDE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Live updates: More than 200 in Maine arrested by ICE so far, DHS says - pressherald.com",
    "description": "Live updates: More than 200 in Maine arrested by ICE so far, DHS says  pressherald.comMaine’s Immigrant Students Stay Home as ICE Operation Ramps Up  The New York Times‘A dragnet approach,’ lawful residents detained in initial days of ICE operation in Maine  mainemorningstar.com‘I want my mom’: Kindergartener left without her mother as ICE detains parents in Maine  The Boston GlobeAnti-ICE law set to take effect in Maine as governor faces increased criticism for allowing it amid Senate run  Fox News",
    "published date": "Mon, 26 Jan 2026 15:08:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNeEZOenY1RC01cVBSWlUxSV85VDRncmdfcl8tUXcwUkZBcWNYU2xwOTdjNGlxZXpXRXhUaEpfWU41d2QtaW1IOE1BcldIU0pqemY4dEg3YVZTa0lRQkRzckQ4eDlOSmYxbkxENkpuVzMzSnF3VWQxV0p5bG11b0hIZTdGUEJkNjluNmU1ZlUyUlZpWFZ3dVFIVWhwUFpoSzlhVG9fYkdxak9NVVVwMlE1WExWWUNrbm1tc0U5TTNZX3Q0VVo4N1pVci1nMTdHclU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pressherald.com",
      "title": "pressherald.com"
    }
  },
  {
    "title": "Iranians detail 'bloodbath' crackdown said to have killed 5,700 protesters, as internet blockade eases - ABC News",
    "description": "Iranians detail 'bloodbath' crackdown said to have killed 5,700 protesters, as internet blockade eases  ABC NewsNew Iran videos show bodies piled in hospital and snipers on roofs  BBCDisappeared bodies, mass burials and ‘30,000 dead’: what is the truth of Iran’s death toll?  The GuardianAt least 6,126 people killed in Iran's crackdown on nationwide protests, activists say  NPRHow Iran Crushed a Citizen Uprising With Lethal Force  The New York Times",
    "published date": "Tue, 27 Jan 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPS1NfaVNfMmVJZVBwODVWSFNPWGlLdmt0ZWg4QXJIYTJ6THQ4VlIxbEFsbnVmd3lLbm1sVl9NVXpEZ1dBMDRwZEoxc0tXTmsweEV0UDJDMFVPZHZjckVjdjBOQmNRUkFEcVlaVjVQUnFUcmR5eGpQSHlqV0RaaUNORkNaeVhpOUMxVTlWRUJzdVdzdWx0dWJtMHJtNi1MYms0clhuN0FadUd1SmJNenhiS1Vn0gG3AUFVX3lxTE1wc0szM2RhVEgwYjl3a1lJbU5ldk5aMTFmNlZfdnFkaER4ejJfMWJVUVlmMXZiTkVkWTcxZThZYUl5em83aG1XWkNMS3hkYm1uUDZqTzdCUXYyVTF2Z1dIcXNnTXZocnJqMG4xbTVIQjVuZjh4XzBQZzNXbzIzWUhHTFRXSEZDcjJSZE1iLXU2WG1OQmlza0NpQkRnRjlBMXZMdkNZcXhrVk9ydGRuYjhxT2h2WXNMbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump Administration Social Media Posts Echo White Supremacist Messaging - The New York Times",
    "description": "Trump Administration Social Media Posts Echo White Supremacist Messaging  The New York TimesThe Trump Administration Is Publishing a Stream of Nazi Propaganda  The AtlanticA Piece of Work  The BafflerFact Check: \"One Of Ours All Of Yours\" Is NOT A Phrase From Nazi Germany -- However It Was Really Displayed On A Lectern At A DHS Press Conference In New York City  YahooThe Trump administration has a Nazi problem | Mehdi Hasan  The Guardian",
    "published date": "Tue, 27 Jan 2026 10:02:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT2FiZ011XzFOT0dBUEFncXZWNDZwX0pJbEdRdkxaWnNMV3dCTkFMUnRHTjdHelk5TmVsOEs1MklkZ3JlTmhCb252U09McmcyNzJFTS14SG9xbS0zaHN1QjFCekxBX1ZfYUthelNOUGRkc3JybElEQ0NfbFZ5a3I0M3l6T3pjOExGTWpWeHZlZ3JHSkJUSWlSNmVsSktKeHA1TTd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Winter storm snarls US travel, forces mass flight cancellations - Reuters",
    "description": "Winter storm snarls US travel, forces mass flight cancellations  ReutersWinter storm full coverage: Northeast blanketed in heavy snow while ice accumulation leaves 600,000 in the South without power  YahooDeep cold could last days, worsening storm’s impacts: ‘I’m just really, really tired’  The Washington PostDeath Toll Rises as Cities Face Frigid Cold and Power Outages After Snowstorm: Live Updates  The New York TimesAt least 34 dead as winter storm brings ice, snow, extreme cold  USA Today",
    "published date": "Mon, 26 Jan 2026 23:41:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPbi15UkxIZlJYMTNtNUtyaUhNZ2tYMlRtS2NmUVdwUFQxQ3hSdkplemVoMkdDLXAzRGdndXNyYjRhVWZRdE9lZ2dRd2x0MnN3U2dJa3N0VkdhR1ROQ2VNTXhIT0FTWHZ5S2o2Q0xkTEdfYm9iNzMzb1dpMTkzc0RteTE0cWVFVlBXTFJEX0I1LV9YNm9TM1hHa2VaaVNZdnluSkdHdmhIQkRBZDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump impeachment whistleblower Alexander Vindman launches Democratic Senate campaign in Florida - Politico",
    "description": "Trump impeachment whistleblower Alexander Vindman launches Democratic Senate campaign in Florida  PoliticoAlexander Vindman, of Trump Impeachment Fame, Runs for Senate in Florida  The New York TimesAlex Vindman, Trump impeachment witness, to run as Democrat for Senate  The GuardianImpeachment witness Alex Vindman runs for U.S. Senate in Florida  The Washington PostTrump whistleblower Vindman challenging Moody for Florida Senate seat  The Hill",
    "published date": "Tue, 27 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNR1lkSTgyemRqcTFEOUdtU2k5UHhFTjdzbWFycUNfaE16RExldlYyYVgwVTRQRVpLNkFXZDIzYi0yX21vd05IMjB0bkg4YTZ2VmdwR19IcHUycDF0ZVRvd3IzQ0FUUXRMVWtydW9rbUtLd28xak1ldEpmLTZxM3hHWE9zZGUxT2c2WFBwMU8tNElGSGFwUmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "6 people on private plane tied to Houston law firm presumed dead after crash in Maine, officials say - abc13.com",
    "description": "6 people on private plane tied to Houston law firm presumed dead after crash in Maine, officials say  abc13.comFamily and friends identify 3 victims in deadly Bangor plane crash  wgme.comBusiness jet crashes at Maine airport leaving all passengers presumed dead as winter storm pummels US  Fox NewsPrivate jet crashes at Bangor, Maine, airport; all 6 on board presumed dead, police say  CBS NewsTexas county official remembers victim of Bangor plane crash  wabi.tv",
    "published date": "Tue, 27 Jan 2026 01:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPakxpWTZuMnM2eHpFY1ZXOW1yNXVYREt0YkVVSmU2Sms1SDV2b2pyS3VqaFd2RTNOSkI2ZHRRM0JqWVFCM2dySV9veVhuRTZMOXhXNkQ3aEVZbWNLYzcxWDAzMUZzMGFySkZSVnJBMU5YVmpfRU9WR05xTVhxQXVPWWRkQ3Y1RDJvX1FVZzJ2YmcySjZDVURpX2dIUkxDNWZuRE5mbXZQWXZvNUFzZjhqbjVpeHkxWlo40gG-AUFVX3lxTE5iZ1hKcXRCN0MxSW5XN2FOQmh1QnNUY3FRNU9ITzNWZUxQeHd4bE9jbXBpUVZ6VmJGR05hS214UGlrSXRpX1JWejVDMjRULVpQdkhkejU4OXNkWWNXbGJDSE1hR3RCRVdFTkM1Mjd3LWhibTFFbmlia0dSZW9oLTEwTW0wWk9PMC1zSVMwN3JYMGVRbDQxZXkyMjI5cHU3NFZVM0hxcGlJMTlZTHVpTXFZX19JblJON3hwbE5Gb0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc13.com",
      "title": "abc13.com"
    }
  },
  {
    "title": "N.J. weather: Snow chances increase for this weekend. Forecasters tracking coastal storm potential. - nj.com",
    "description": "N.J. weather: Snow chances increase for this weekend. Forecasters tracking coastal storm potential.  nj.comAre NJ Transit trains running today? Limited service returns after snowstorm  CBS NewsWeather blog: NJ Transit rail service resumes, NYC deaths under investigation  nbcnewyork.comTravel restrictions on New Jersey highways, including AC Expressway, Garden State Parkway and NJ Turnpike  6abc.comWinter storm brings heavy snow, treacherous travel to NJ  abc7ny.com",
    "published date": "Tue, 27 Jan 2026 12:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQRXp1Y1BnSE5QQVhKX0hMZ3Nvc1o5Qmk4cE85eUY2U2NVdXFrVWdTVUxLNDgxV1FRQjJLc3RrSG9IVTVwTTJuQWxJNDJfcV9xa0xoV0dHZF8wTGV1VFFmWnBGZF80QTNxN3dfRjhlQXVYNzFGZkEzTEZ0cURjZDRZaURXejZaU1B0VlV1X1hia3E1Y0tfNlQyaWdEd2Z0UklkdTFuR0pOcElGUXo2R05DS21ielV1VjlnR0N0MnZheGZHWHh4R0hpdHZaQVd1a0XSAeMBQVVfeXFMTkhLbG9WMzNpb0lsUk9BRnFjLWx6WkJGUDc3X3NycmJ0ODJJT1BROVBQY2VndjZwbVBxZ3NXWElZN0xKYm94YTloN2tEcnl2WlZvZElWdkpxa1pwRUhyc3Z1dXd1dTg3OFdTQjRRZE03ZGsyRHh0NUlqSWdKTlZpWWEyLWRiWTJvZ0R0eS1mQVkzQ1N5UkRRLUdJTVZTOUxjZ0dxWFF1SW1LN1JELUd2ZFE3OENPcHdpeXNNVldTT2l0NGZuX24zOFNCaU4zZzhMRVE0WG5XQk9YdWVNdmtOcWdOZk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "nj.com"
    }
  },
  {
    "title": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices - NPR",
    "description": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices  NPRAs Trump Heads to Iowa to Trumpet Economy, Many Residents Feel Pain  The New York TimesClive police stress safety, respect ahead of Trump visit and planned protests  kcci.comPresident Trump’s return to Iowa  ktiv.comTrump heads to Iowa as farm stress and biofuel delays test support  Reuters",
    "published date": "Tue, 27 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPU1BsREwwMEpiSlVCWDJ2ZWxnb2VYRDZpbEdPUTJacnQyWWYweUVpd09XNWVVOVlrRVBkZUNuQ0dkMl9CNjBLOXhkNXVZaUpNR3RUbk5XVHdqZmZkV1ZlZEJXejRneG1DUWwxekZhcHJwd3Rya3BqNzZVVHBBRHJQNVphSkM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "TikTok users say they can’t upload anti-ICE videos. The company blames tech issues - CNN",
    "description": "TikTok users say they can’t upload anti-ICE videos. The company blames tech issues  CNNCalifornia governor Gavin Newsom accuses TikTok of suppressing content critical of Trump  The GuardianNewsom to probe claims of Trump-critical censorship at TikTok  PoliticoCalifornia probes US TikTok over claims it censors anti-Trump content  BBCUsers say TikTok stifled posts about Minneapolis shooting as platform faltered  The Washington Post",
    "published date": "Tue, 27 Jan 2026 02:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE92eXdvLUZnVTBoT2VwNmVpZ1poWlVQYnFEZnNrU2FremNJbFVCaENaaWJDZld4UHJxU1pKMnFtbGotdXpDMndURzJ6TnJWQ0ZvNmRjcWljX2tZUnNJTEgzSEEzR1NsZTlxZTlOdzFyN1N5RDdBMFFJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Aircraft carrier reaches Middle East, bolstering Iran options for Trump - The Washington Post",
    "description": "Aircraft carrier reaches Middle East, bolstering Iran options for Trump  The Washington PostUS carrier strike group is now in the Middle East region, sources say  CNNLIVE: US, Iran ratchet up rhetoric as carrier Lincoln forms in Middle East  Al JazeeraTrump Briefed on Intelligence Saying Iran’s Government Is Weaker  The New York TimesU.S. aircraft carrier arrives as Iran's currency plunges to new low and protest death toll passes 6,000, activists say  NBC News",
    "published date": "Tue, 27 Jan 2026 06:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNMnVBdFBZbkU5VkRSeW1XME5TbmNVMjBPaGFPay1MQnlKdHBYTExFeXpnMTFVVU9OMEZsLXYyVUJvS0ZSSllKai1CdWh6QURmVUVBdi1yYk9uV3JDMDJ5ZTF0Z1l2WDBvQm9VQm9GT2tLd1JaTF82SFV5MHI5QUZ3OERBNFR3R0h5THozdGZ3MGNVeDlDdzdEVw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "House Democrats' support for impeaching Kristi Noem surges after Minnesota shooting - Axios",
    "description": "House Democrats' support for impeaching Kristi Noem surges after Minnesota shooting  AxiosHouse Democrats to investigate Kristi Noem with eye on impeachment push  The Washington PostFetterman calls on Trump to fire Noem: ‘Americans have died’  The HillMore Hill Democrats want Kristi Noem out as DHS secretary  PoliticoSen. John Fetterman asks Trump to fire DHS chief Kristi Noem  USA Today",
    "published date": "Mon, 26 Jan 2026 19:00:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQa2FoOVVZV2ZCcnpEZTEyVFJNWlRYLVpwa2JFb0lMT2F0YTNBYjJLOTZicTNMUU1PZ3k1VXFjTXZ1NGdiakRtZlNyczVGUGJSNENXZU1ZblFXcGhJLVBJbWp5Q1JGZDBiTHN4UThTZmM0OGVxYWh2bTlkczYwYkY2LXNLODI5WlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "More history exhibits pulled from national parks, including Grand Canyon - The Washington Post",
    "description": "More history exhibits pulled from national parks, including Grand Canyon  The Washington PostOpinion | In Philadelphia, Trump takes a crowbar to American history  MS NOWPhiladelphia sues Trump administration over removal of long-standing slavery exhibit from historic park  CNNUS National Parks Told to Remove Signs on Mistreatment of Native Americans, Climate, Wash Post Reports  U.S. News & World ReportHow the National Park Service Is Deleting American History  The New York Times",
    "published date": "Tue, 27 Jan 2026 16:01:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPNzVlaEhUd1JJWDZ3ZnM5R1FmcUlwVHJXUmpqNmc0VzlSZEF6UURmV3BsUXA3Y3lRT2tyT2tLS0pnbjFhNmY1X3FmS2pwdXhyYnNpU1pNSHNHazZWRnB3d3hHbjM4Y00zb3E3dnRwZVI0bElFR1hSYUVrUlZNY1N1dG5yek0xRkRwZWJnYll5Z01FMUkxRDlqYjln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Pummeled by over a foot of snow, Mass. residents brace for more - wbur.org",
    "description": "Pummeled by over a foot of snow, Mass. residents brace for more  wbur.orgRegion digs out from biggest snowstorm in years; some communities slammed with nearly two feet of snow  The Boston GlobeSnow Emergency and Parking Ban to End, January 26, at 8 p.m.; Schools Closed Tomorrow, January 27  boston.govPower outages reported in Massachusetts as snowy conditions linger  nbcboston.comFrigid start, watching weekend pattern  whdh.com",
    "published date": "Mon, 26 Jan 2026 16:21:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPZ2MzLU00ME8tczVzZXZPRjJJUWZ2cU1xWlFRdHJkNmtiU3NBTGVsZWcwc1pBOGVTX0t1QVNNTkpHS3QyZkNLeEdTV2VZbzRORXNtV3d2X3NnMHJDX0hRdjkxM3NzbGhfOVRtN0dsY010YmdmMDNQUTFRUHNHU0Z6REVrZl9wX2l1djA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wbur.org",
      "title": "wbur.org"
    }
  },
  {
    "title": "Kaiser Strike Sees Thousands Walk Out in California, This Time With No End in Sight - KQED",
    "description": "Kaiser Strike Sees Thousands Walk Out in California, This Time With No End in Sight  KQEDOur Statement on the UNAC/UHCP Strike  Kaiser PermanenteMore than 31,000 nurses, health care workers strike at Kaiser Permanente, arguing for safe staffing levels, fair wages  ABC NewsTens of thousands of Kaiser Permanente healthcare workers launch open-ended strike  latimes.comBay Area Kaiser health care workers to join over 31,000 going on strike in California and Hawaii Monday  abc7news.com",
    "published date": "Mon, 26 Jan 2026 19:59:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPVFNjUnI5Rk5oRFVqLTBEckt4UHFIX1I0VE0zVXM4Tm1kd2NOeGRZLWZWeUpJYlQxckU1amxpRE9aR0R2WGhCSnh6UnJIUDVid0xZT0dGQ1FaQzhmWXNGcnhlTXJ0NklnV0ZvQTJTYnhHTElFdVE5NXRCSHlZOGxsYXFUSWlqTDhWNDRKVzRGNGdoNzk3RWlfeTJJZE5Wd3dXMXM2UFlUTUNXSHB0M3hOVFZqdzBud0ZX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kqed.org",
      "title": "KQED"
    }
  },
  {
    "title": "Americans largely at odds with Trump administration on immigration, ICE tactics: Polls - ABC News",
    "description": "Americans largely at odds with Trump administration on immigration, ICE tactics: Polls  ABC NewsRepublicans are worried about Trump’s deportation campaign, and our new poll shows why  PoliticoTrump approval on immigration at record low: Survey  The HillToday more Americans support than oppose abolishing ICE  YouGovVoters Are Split on Deportations but Disapprove of ICE, Poll Finds  The New York Times",
    "published date": "Mon, 26 Jan 2026 19:11:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNdUhFVHRFRld1dnNqVS1ZbV9FRV91VFBKUWxaUVJ1SWIwYm0xYVZQckZWMExRYnVJcGhPdDFNWUJyZUJHaVVqSlBuTnR0dVd4MXpfd2c4YmNWTzlfNGxGWnNhS0RQaFVhdmV1enlJODVqYVVEVC1GZGVnM0VjTVB6TlFRVHE3blRDb3VkVlpsYlNFcVNDYkxWanMyV3BVbEJGcXk3TkctVVpXTnktWmtFU2E1cDNvcHNoZHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "SCHOOL CLOSINGS: List of Georgia districts canceling or going virtual Tuesday - wsbtv.com",
    "description": "SCHOOL CLOSINGS: List of Georgia districts canceling or going virtual Tuesday  wsbtv.comFrigid cold grips metro Atlanta after ice storm  wabe.orgGeorgia ice storm: Road conditions, warnings and closures live updates  ajc.comImportant Weather Update: Schools Closed Monday  cobbk12.orgNorth Georgia school closings, adjustments for Tuesday, Jan. 27, 2026  11alive.com",
    "published date": "Mon, 26 Jan 2026 22:12:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNSTZ1aG51MGt1RUFkU3BxakFQQ1ZfN2o1VkRnNDFyNDlHcDlOaGloeDVDOTB5VTFKcnJXOUFRaHpyQkI0YlZRX0pRNGV6WHNZWUNVZUNrU3Z1REtZX01iamxwX2R5T3J4VkVackhndnI1ZXBtXzdMdnF5R0pOMURGVHdvbmFaTDJ3ZjhDT3NLLV9XTHQxV2hGRzRlbWRFLWFDNktWUExJS0tUV1dOUXZRSl9PX0oySzl5WnZZbTNESjdXTlJNemJ1TFoxMGpQaXPSAeMBQVVfeXFMT25VU0tUbFFqRFk2d2lPYm40WUMzSVFWSlExRGd5RXN2UjFuX3gwRkFDMHZSLVVRQkNjcVA5a1BLYkJCWERYb01NdTA5VFM0cWZGclVRTXZtX2p5bFNEeXlyT1FKRzBhOGhsRWNRY1NWUmJZcGpaOV9QR2JqQTh5SklRdUFUOVlhTGJvc3ZhWUdJYkpyVEx4aFdpaG1EdnRidTR2cHZNc3ZpVWRBc3dEMTc5a3R5YVJ2c29iby1KSmxNS2I1WHhaZ0FQX3h5bG03SWRTQ19WWWdvU3lYVjZXUFd3SVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsbtv.com",
      "title": "wsbtv.com"
    }
  },
  {
    "title": "Chris Madel Ends Run for Minnesota Governor, Citing Immigration Crackdown - The New York Times",
    "description": "Chris Madel Ends Run for Minnesota Governor, Citing Immigration Crackdown  The New York TimesThe Lawyer for the Agent Who Shot Renee Good Thinks ICE Has Gone Too Far  The Wall Street JournalChris Madel: ‘This is not the United States … that we want to be’  The HillRepublican ends bid for Minnesota governor, citing ‘unconstitutional’ ICE surge  The GuardianMonday’s Campaign Round-Up, 1.26.26: Pretti shooting jolts Minnesota’s gubernatorial race  MS NOW",
    "published date": "Tue, 27 Jan 2026 02:28:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPQnFCbkQ0eEc1MmxpeXdfUFgzbUFIOVBLR1Z3eHVBejVoRE1DYVRhZWpCLUR3Q1ptWi1ZYzczcEhwMVhfalVWRDVzWGV3LVNvQnBOeUZ1dVphN3hfR2FCOUx6ZzlsQmE1S2g0YUpkN3o4aDZoVU8ybmxmOEpTc1Z1Y2FoRjNaTWRyZ2dDb2pyS0dvb0dPa3Z1NnBB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "How once-exiled filmmaker Brett Ratner staged a Hollywood comeback with ‘Melania’ - latimes.com",
    "description": "How once-exiled filmmaker Brett Ratner staged a Hollywood comeback with ‘Melania’  latimes.comCEOs attended a private screening of ‘Melania’ on the day ICE killed Alex Pretti  CNNMelania documentary struggles in UK cinemas as Vue admits sales are ‘soft’  The Guardian‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling StoneMelania Trump hosts star-studded White House screening ahead of her film's release  Fox News",
    "published date": "Mon, 26 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxOcjhoVFFhcDVwSlcxaHNiM2VvNVJtVC1KeWVhTnNsSUxwWnQySW1jeV9NTGt6VEw0X0RSaUJXVHFpLVhfMUJQbmFsMGk4XzNLbFRITldIUEVUTGY3UlZIeWVscURkZWpMVi1jYnRsOTczS3dNNlR2SkZycDJ3SG5fbjI5RWxGSXNFT2VjcG5CSTE5OWRtNmhXRHBvd082SHNOZlFFZy1PNUZxempRU1hFa1hhbS1ORENvZzlLRWtOWnVvdFlmRWFwclpJd1VGMFVpd0cwb0ZjU081VEhXTVNSQUFweHBhbkluVm5lR3I5VGF2M2k3cU1lZUN5cEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Carney downplays Trump’s threats while ruling out China trade deal - Politico",
    "description": "Carney downplays Trump’s threats while ruling out China trade deal  PoliticoCarney calls Trump's tariff threats bluster ahead of US-Canada free trade talks  ABC NewsChina says Canada deal does not target the US after Trump tariff threat  BBCTrump’s Tariff Threats Designed to Influence Pending USMCA Talks, Canada PM Carney Says  The Wall Street JournalBessent Sees Canada’s Carney Making ‘About-Face’ on China Trade  Bloomberg",
    "published date": "Mon, 26 Jan 2026 20:28:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQY1RDLUZWZkdyNENuNWZZWjhnWDdiRnRvYzZzNW1WRFh5Q3NVWENONHRSTWRfYkZxcmdPSlZxMFRQSTR4UmpXa1lrR0NFNWhScGRnY1dXYXQxM1dGem5BWTdzVTJaWjZsdTlHeFRhM0RLNWZfcGszdE4xZzcweHo2WS1EX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "ICE in Minneapolis: Trump’s plan to extort Minnesota, briefly explained - vox.com",
    "description": "ICE in Minneapolis: Trump’s plan to extort Minnesota, briefly explained  vox.comWhy Is the Trump Administration Demanding Minnesota’s Voter Rolls?  The New York TimesBondi's 'ransom note' to Minnesota shows Trump's real game there | Opinion  USA TodayBondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’  CNNTrump administration uses ICE to pressure blue states  The Washington Post",
    "published date": "Mon, 26 Jan 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOZmxaRDU3RGxNeWJiWXY0WVJwdWJqT2xGOFlCRmFvdkF6UjhWYVA2bXdRbWhXbVdfcDA4aTJtVG94aFRRc095SkMyOGdfeW9nLUc4alVveEpVaTMtRURKd2lYeThacDQ2TlFJQ0dVOHFITVpWZ1lPSXp1QWp1MTU4aUlrbEhmVE9ZZzR3SGtmVzlnd3g2enN1ektTeF9rLVFTbWNlLWZJWW4zWXkwbzdF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "Ex-Olympic snowboarder pleads not guilty to running a drug smuggling ring - ABC News",
    "description": "Ex-Olympic snowboarder pleads not guilty to running a drug smuggling ring  ABC NewsEx-Olympian Ryan Wedding pleads not guilty to running drug ring  ESPNFormer Olympic snowboarder on FBI's most-wanted list is arrested in Mexico, faces drug charges  AP NewsMexican president shares AI-generated image of Ryan Wedding  CBCFBI fugitive Ryan Wedding, ex-Olympic snowboarder turned alleged drug kingpin, pleads not guilty in federal court in Santa Ana  abc7.com",
    "published date": "Mon, 26 Jan 2026 22:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPUHQxYXdpYl9CRkxxODA5SkdRVWxheFMyUDM2Y0YxcElwSDNVREtfQTZRdklKNElOY05EOEpUeDRZQ2hYNkxjeTJZbkhsa01yVmMyVW5ibUFMd0FEVTE4NGY4TzQ2b0JtdF9DV2JrbDBUUHBZbDRLSmM5OGlCRlp0RlQ5cXFjcjd2OXBycks3ZHpWazE3QlUyYkI0bGFVLTJaSF8tTXI1TjDSAa4BQVVfeXFMT3BGVjhSN3JIQTR4NC1oN1p5RFVJalMwc2pVYVFxZmlJUDFjcFh3d2JqX0ZpekJreVJMSEhjWTVHdUZMb1BZclE3RkhfaUlWbFY3T0dDTHc5NVRQVWlCVDZhaVJlV2hxM3JsNWxTV1NTb2pOQXhqVnNqRnBnVUM3ZVFYdzlqX2RSVVpaN0s4TFNBaDVBZTBuRGtIY2RaWE1NRnBHTFV5dVFlWVVra3B3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Kristi Noem facing scrutiny from White House in wake of Minneapolis shooting but isn't likely to be fired, sources say - CBS News",
    "description": "Kristi Noem facing scrutiny from White House in wake of Minneapolis shooting but isn't likely to be fired, sources say  CBS NewsTrump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting  The New York TimesMinnesota ICE latest: Border Patrol chief Bovino sent home over Alex Pretti shooting  The IndependentNoem in the hot seat after Minneapolis shooting  PoliticoTrump held 2-hour meeting with Noem as his administration grapples with Minneapolis strategy  CNN",
    "published date": "Tue, 27 Jan 2026 11:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQQXpVYU8ySGg0QWFWYUJpRDMwUXFfbnNVYW9Pc3lwYUxHMmpFNkttekZPNkQ5Vzl0QXBqMUhFSXhHN3ZfNks1X0o1N0pwekRkd0xiTUs1Yk93SEFfZnRzNGZWMHo1N1NDcV9ZNHlVNHNfUm9mbHNldHhlZWc1YnZ0alJZOEQ1ZWxXX2plTEFFeXNZRGvSAZgBQVVfeXFMTUd1bXotT2Uwa1hSeW04bGsxQzJxMXBDZFdYeFZGS0YzWWNHajV0NUhlZWVuNkcwemplVURzR1FZb0kzT2NVY1hoSF9uT2hQNmotQnd5TV9xb2R5aXhlTDVXM29wc1dDdlp1YVNVWHRkdHNHOTRlRHFaOWxvbmNsZGxDR1JZRllYbWF3Q19Zal9Fai1WekpLU3E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  }
]