[
  {
    "title": "Trump's border tsar to speak in Minneapolis as he takes over city's immigration crackdown - BBC",
    "description": "Trump's border tsar to speak in Minneapolis as he takes over city's immigration crackdown  BBCLive Updates: Trump’s Border Chief Says He Is in Minnesota to ‘Regain Law and Order’  The New York TimesLive updates: Border czar to speak in Minnesota as report indicates ICE agents are under new orders to ease tactics  CNNTrump border czar says staying in Minnesota ‘until problem’s gone’  Al JazeeraUS working on plan to ‘draw down’ number of ICE agents in Minneapolis, border tsar says  Financial Times",
    "published date": "Thu, 29 Jan 2026 12:30:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTFBIV0ZkdTlUVlotUHd0UjVOMXhDZDQzMkk4TkRTSWFDX1YtSjNBTTY2c2MwaXl1eHdJajdrc0NOWW1lN2hKWlRYbUdQZ3lxQ21IbXVJTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "New video appears to show Alex Pretti clashing with agents 11 days before fatal shooting - ABC News",
    "description": "New video appears to show Alex Pretti clashing with agents 11 days before fatal shooting  ABC NewsVideos show altercation between Alex Pretti and federal officers 11 days before he was killed  The GuardianVideo appears to show altercation between Alex Pretti and federal agents days before his death  The HillShooting Aftermath Leaves Homeland Security Department in Turmoil  The New York TimesAgents involved in shooting of Minnesota man Alex Pretti put on leave  BBC",
    "published date": "Thu, 29 Jan 2026 12:08:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQVVBlSmphaWdNN0hyMktxMUVUalpJb1dMN2dGN3MwRTdhVnVFZVdSVWRPS1VHX2pweWRqLXVXN3JucHp5ZHZ0ZEVEbnUzR3dKZ3NJbWVVVk5MVC1IdVRVaGpmUHJ5b2E3eDcxeHNCdUhvcG5rZXNIQWtNRWlCT09qVjNmQnBva3lhLXRERXVkTHQySjRrM2pYZFpEWdIBoAFBVV95cUxObGtZV2dEUkxLTWl4T0V2eWFTY1lWZkRzd2F5MFJxeDFJS0FVZEFnMWo0SGJmM3oyVkNHV29Qc0pESVQ5TV9yNEZTM0pnWmR4Z3dEQUVuY3cwajd1SmJKSTh0UktYanY1T1VPblNIY29BTzRMb283TTdEVXFfanRjcFIzc1J5VFZtS1ZlbUFEb2M5R01rSEhCY1ZvOFBzZVBz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump, Schumer seek deal to avert US government shutdown, NYT reports - Reuters",
    "description": "Trump, Schumer seek deal to avert US government shutdown, NYT reports  ReutersTrump and Schumer Move Toward Possible Deal to Avert a Shutdown  The New York TimesCapitol agenda: Democrats and White House in last-ditch talks to avert extended shutdown  PoliticoHere’s what could be affected if the government shuts down again  CNNGovernment shutdown: Republicans consider escape hatch as Congress careens toward deadline  CNBC",
    "published date": "Thu, 29 Jan 2026 13:14:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNOWp5WXMwQlMweDJMZEIxUTM0STJzaHozRF9fVkhiNmJwTFFEXzhQc0V4VkFUNDZQek5RSjloSjBJX0ZLbEpyLXR2M1NNSGw0cXY4TFpKWTRBRTN0MklRaHR5THNTM3hmT1FNUHFwNkpwMDQwb1diOHI4STJTRW5obU9yNWxNSG9QeXNsbzZXSk9kVVVfaU1KUnpyUnRDa2gwemVTSzNTdF9jdnZnS1JpVXB6aHE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "ICE ends Maine surge, Sen. Collins says - Axios",
    "description": "ICE ends Maine surge, Sen. Collins says  AxiosThe DHS crisis is squeezing Susan Collins  PoliticoICE ends enhanced immigration operations in Maine, Collins says  CBS NewsFamilies in Maine scramble to halt ICE’s transfer of detainees out of state  The Guardian‘We’re not safe right now’: Woman’s dramatic ICE arrest ignites fear in Maine’s immigrant communities  The Boston Globe",
    "published date": "Thu, 29 Jan 2026 11:57:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA0andYYjFaLUJoX1dPMDRkaTF5ZEZ0X1RBY1NaNlJPS054dlFWNjk2U3B3TWo5dzcxN2Z5Y0xDc0E2X1NLU2pTX2RZZzZIUk1IdTQ4c1JHcU9xMTZTVlBPSWpENTcxVVdMRE95Z1lZVTBSN0hOT3BRbEd2cnFveXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "‘Who can you kill?’: Minnesota crisis collides with Rand Paul’s ideological crusade - Politico",
    "description": "‘Who can you kill?’: Minnesota crisis collides with Rand Paul’s ideological crusade  PoliticoJosh Hawley calls for investigation of ‘troubling’ Minneapolis shooting  missouriindependent.comLawmakers ask why the agent who shot and killed Alex Pretti is still on the job  MS NOWAlex Pretti killing by federal agents should be investigated, two Utah Republicans in Congress say  sltrib.comSen. Rand Paul calls for ‘independent investigation,’ testimony regarding death of ICU nurse shot by border patrol agent  wkyt.com",
    "published date": "Thu, 29 Jan 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZVhJdWZndkdwTHZ6cVhKM3o3ek5EVS1rNmlQWXR5dFdCdnZQcEFYT05tbGxfc2dRWWtrQ21NX05JaDM5N01kdURpMEprNm81UzdXbUNrbW9XdGlIR3ppdW5RY0dleVIyRkZDQUdwY2pHRlE0NjRXMTlpTDZ3TDZXWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump weighs major new strike on Iran as nuclear discussions show no progress - CNN",
    "description": "Trump weighs major new strike on Iran as nuclear discussions show no progress  CNNTrump weighs new strike on Iran as government shutdown deadline looms  CNNTrump Warns Iran With Military Muscle, but Risks a Regional War  The New York TimesTrump weighs Iran strikes to inspire renewed protests, sources say  ReutersVOTE: Do you think President Trump should use military force in Iran?  fox11online.com",
    "published date": "Wed, 28 Jan 2026 23:19:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOME9ieEoxTVJ5cGVlbmppbHdzMUY4VnNfRng2OF9qMUVzR1czYnkzc1VOUFpwTmpDYmN4S09Db1RjRHNxVGlfeGVnNzBLbWNwZVNSMGNFbW5WODVkVFdPdVQ4dnhqQkFGRlAzbG41WHE1RG80UmtCVUVXZU5WZ1lXcDlUaWg5eGJaUXNrdUJ6c0xHSjhp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Big budget Melania Trump documentary premieres with splashy rollout - NPR",
    "description": "Big budget Melania Trump documentary premieres with splashy rollout  NPRThe Canceled Hollywood Director Spinning the Melania Movie Into His Comeback  The Wall Street JournalWhat to know about the Melania Trump documentary  CNN‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling Stone‘Melania,’ the First Lady’s New Documentary, Abruptly Pulled From Release in South Africa  hollywoodreporter.com",
    "published date": "Thu, 29 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPRTB4QWJ0SjlxUi01ZGpWU2VUWDRreFp3ZjBldmJuWlJVcWZCVENKVmhaMW5rcS1fMUtjSTAzLVdnWmlKajVabzV5U3ozbU4yMTJybmZHeTNvcFRsdEdpX3ZpR3dhS3RRX3VUWjF1TlZPMkE3ck1ZLXNFVkZsbXl3b2RSVmROTnNDdGRXZFM1XzFfSnRnUW40VmRiTXFNRzZmNVBUT1pIWktWWWVCVWNUUHZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "FBI’s Search of Georgia Election Center Is “Dangerous,” Experts Warn - ProPublica",
    "description": "FBI’s Search of Georgia Election Center Is “Dangerous,” Experts Warn  ProPublicaFBI searches Fulton County elections office as it investigates alleged voter fraud  CNNFBI searches Atlanta election office, chasing Trump 2020 vote fraud claims  ReutersF.B.I. Agents Search Georgia Election Center  The New York TimesFBI raids Fulton County election office seeking ballots from Trump’s 2020 loss  ajc.com",
    "published date": "Thu, 29 Jan 2026 10:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNYmhTNlp5a0NGbi1DaF9WVXJ0ZlhjVnl0d1lmNExuaW1sRW01SFVZcEpTS2Z6bHd0cGFYWW1lckFRSzA0M1MzNDJyUDNUQ18wZ25vVG1LT1djWUJuRnhxLXdtamlRSHdUSGJxelpldjVXWHdDVjVsMW9kMXI3YzFxWEFORDdhNml5Snc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "U.S. Sen. Amy Klobuchar jumps into Minnesota governor’s race - Star Tribune",
    "description": "U.S. Sen. Amy Klobuchar jumps into Minnesota governor’s race  Star TribuneSen. Amy Klobuchar launches her bid for Minnesota governor  CNNKlobuchar joins race to succeed Tim Walz in Minnesota  AxiosSen. Amy Klobuchar announces run for Minnesota governor amid immigration turmoil  ABC NewsSen. Amy Klobuchar launches campaign for Minnesota governor amid federal immigration crackdown putting state in spotlight  CBS News",
    "published date": "Thu, 29 Jan 2026 12:03:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPZmY4OVZCaWpkV2ZiYnZvUWNhLVZuNUtfc0hkRU12UVJrVzRaUDNLcDlwS25ISzR0UTE1UDV3QW1vQVcyY0R5Nkx4dmMzWk1fcTA5UGdHdS0wYThXUlFiLXN0MGlKNnZ6TG8zdGE4MlNjMUtaYXlIR0VEb0hJOTFSbFVzX3Z2RThTVGNQa1JEckVfTVZXcHFlc1F3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Attack on Ilhan Omar Follows Years of Trump’s Targeting Her - The New York Times",
    "description": "Attack on Ilhan Omar Follows Years of Trump’s Targeting Her  The New York TimesOmar says Trump's 'hateful rhetoric' causes threats against her to 'skyrocket'  ABC NewsAfter assault on Ilhan Omar, Trump responds with another blame-the-victim conspiracy theory  CNNFBI leading investigation after Rep. Ilhan Omar sprayed with substance at Minneapolis town hall  kstp.comWhat we're learning about the man arrested in the attack on Rep. Ilhan Omar  PBS",
    "published date": "Thu, 29 Jan 2026 00:58:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTnhLTjBvRHR0RU9BS21KRURzSkFobFppT3ZGNUtRcnBpa3ZMWGtlRUhKeXNMd2JvQ1Z5bW0xdVd6MTBjcVNHZmkwYnRCT2N0ajR5OFV1RVBhWlpjM240MFdOVk5VdjU4ZE1BeVlhSWc5aWpjNHZDbGFpUUc0VlZteQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Car slams into Chabad World Headquarters in Crown Heights, Brooklyn; police investigating - abc7ny.com",
    "description": "Car slams into Chabad World Headquarters in Crown Heights, Brooklyn; police investigating  abc7ny.comDriver Rams Car Into Headquarters of Chabad Hasidic Movement  The New York TimesCar rams into Chabad headquarters in New York City  The HillDriver rams vehicle into Brooklyn’s Chabad Lubavitch headquarters; motive under investigation – amNewYork  amny.comNYPD probes crash into Chabad Lubavitch synagogue as hate crime  BBC",
    "published date": "Thu, 29 Jan 2026 05:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOaGFDaTdwUnJlc0JxQi16bXBpb0Y4MzdVUDAwUlFrczY4VDNvbU1FUkZPcmxFQWt6R01QbDE3M2R3MHBIeEJvRXZGYXUzMmZJazZUUmhYSUVTdFRuM1R5aWU0S1ZJYm5pVTdpMkJ2d1piMEMzODFJRHJKVGpBaWg0LTBEMnRzallZV1pyeXF2LWh1Zmd3dmlLNXZwQkpfTFhMeDBIWGJzaklfOVdsNGtTN2VINNIBuAFBVV95cUxQa1lVVnNMaW1Rd1g0RFhnQW9xT19LRlFzQVYxc0xZdFZuZXRsTFNZbkJ0VzdEYjRiM0puZll5UkVTazBVMDhkWVJZYlJmVEo3S3JsTmRFdWZEZk1LZF9GckJJMnl1Q0FIdEdLcE1UNHJhbGdfME5GWGoyZFFiZ0w4NTkybVV6OHZQd0VpcDE4Y3V0djRJaWFvMTNHZmxxZ1NrS25OdlBTT0l5SXZZNWZNai1PTkE0ZERR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7ny.com",
      "title": "abc7ny.com"
    }
  },
  {
    "title": "U.S. life expectancy hits a new high as deaths from overdoses and COVID fall - NPR",
    "description": "U.S. life expectancy hits a new high as deaths from overdoses and COVID fall  NPRView Full Coverage on Google News",
    "published date": "Thu, 29 Jan 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1zYXp2LXpZQ0l5OEhyZjRDU3E4cDVYLXJGNndoRmw2RzhwV1I3VlpEbUFtMGp0cEZ2cW9JdUprYTdrMWRvWkNUMUpsZ29aV0hBMDVFMlhwVGo1OVlwcXZpNEYzc3hDRGV5Xy1BSEp5YUltUFZES3ZkVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "A shadow network in Minneapolis defies ICE and protects immigrants - AP News",
    "description": "A shadow network in Minneapolis defies ICE and protects immigrants  AP NewsInside the movement challenging—and disrupting—ICE  The EconomistRoper: Why Minnesota became the epicenter of a national immigration crisis  Star TribuneSome small businesses in the metro will stay open despite 2nd anti-ICE protest, economic blackout planned for Friday  kstp.comMinnesota Proved MAGA Wrong  The Atlantic",
    "published date": "Thu, 29 Jan 2026 05:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPS3F1WGpuS1pJVFJ6Q20zU1VWeWpKZnNyWXVPT3lVdm5ZTGFxRm40RWJFOWV6MHFPbU1WNXFtbmljUEIwaVNkME5oc1hRUUhYNTJsV2Rha3hoNTNPVlFJanlTaVdFUkhnRDJzRktmTGNzWGI0NWxYbzlWRWE3U3F3SVRpaGVIb3VIcmg5OHZmbDFrT0o0aUV3X1JyQS1jWGtNV005Zzlvck1PYVJab09jMURCdEFlUXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "The GOP is losing one of its best issues - Politico",
    "description": "The GOP is losing one of its best issues  PoliticoTrump's Minnesota de-escalation lasts less than 48 hours  AxiosIn a battle over how to carry out Trump's immigration agenda, one faction has triumphed — for now  NBC NewsA Crisis for President Trump  The New York TimesImmigration agents have become Donald Trump’s personal posse  The Economist",
    "published date": "Thu, 29 Jan 2026 10:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPcnZBWlFTRC1BaGhvR0h6R0NPYVF6TDFGTjZqMWZrQkhrcXlFM19YVm1GMjVXeXFjVVZ2ck9LX1lCc1RVZjNVMElLLVZ2YzRaYk12SEs4NXdveUdHRWx0MzJBTDVnQkRMU0FMS0M2U1lqUzRnTU5kVk9nSUhFOWFIMjZRY3ptSGJhbU5IYW5nZEdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "House Republicans fume at Kristi Noem as impeachment push looms - Axios",
    "description": "House Republicans fume at Kristi Noem as impeachment push looms  AxiosHow much trouble is Kristi Noem in?  vox.comNoem’s Handling of Shooting Put Her in Trump’s Penalty Box, but Just Briefly  The New York TimesTrump dings Murkowski, Tillis after their Noem criticism, calls them ‘losers’  PoliticoGOP on defense over Noem’s future as Congress nears shutdown deadline  The Hill",
    "published date": "Thu, 29 Jan 2026 00:46:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBydzFIWWdMTUlIM1EtLTJUTGZSVDZFZGxFdzJOMFVtcEd6cWFXXzl2Y3l0Znk3VW9GeXlSX0FEbHNwWmhyRDhKLUc5TjNWbGNDVHlQT1BTb0diX01sWkRaQ0VaNmNwckVZbkNvT1lEb3NyU3ppbWphdnRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "A Texas man detained by ICE was his disabled son’s sole caregiver. His son will be laid to rest without him - CNN",
    "description": "A Texas man detained by ICE was his disabled son’s sole caregiver. His son will be laid to rest without him  CNN‘Wael’s last wish’: Man detained by ICE denied release for son’s funeral  Al JazeeraNorth Texas family after son’s death: ICE ‘killed him when they took his father’  star-telegram.comICE Arrested Father Who Cared for His Ill Son — Then Denied His Request to Attend Son’s Funeral  The InterceptFamily of Arlington man detained by ICE calls for release to attend son's funeral  keranews.org",
    "published date": "Thu, 29 Jan 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9FTjVQT3gtc2ZqemN1aVRTLXQ5cDBXWmFvV3o5RDJaNUVpT1ZBUURxYmlNVWtyc0lxc1dXZl9sbFZzUFlBQmx1YzN5cVh6X3pqNTBqSW11dlFoTUtzaFdnMkN2Q1NYd0Jrem9aMGx6UjdaTV9ZZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "DPS troopers clash with protesters outside Dilley ICE detention facility - tpr.org",
    "description": "DPS troopers clash with protesters outside Dilley ICE detention facility  tpr.orgUS congressman meets five-year-old Liam Ramos and his father at ICE detention center – as it happened  The GuardianDemocrats Call for Release of 5-Year-Old Detained by ICE  The New York Times‘ICE conveyor belt’ illegally detaining, moving Minnesota children to Texas faster than courts can respond  mprnews.orgDemocrats visit 5-year-old who was detained in Minneapolis, in a case that stirred anger over ICE  kstp.com",
    "published date": "Thu, 29 Jan 2026 03:50:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQNnQ0Szc5QmJtTTJlRXBsbnVub1huRm12MExkRWlmdTdoM1V5Q21waG1ZYlFIaTFNYjdIUHlXem5VNVBTU1hGXzBydXJsZmU5NzV0dThZTkhfNFR5c3N1cWpUQ2k0UHdxa0dRZV9kVUZ6dFQ4V091ZWQxYUFMV2VOM3BlV1FmMUhLalJZVVp4cDV1QThleDZXcmk1U1VTU0oxM3lTRzlGakxJeU9pTEtPc0dTYXpCWUEybmgxcVloMzVka0JhakR4bDJoR3RKVzZFNW1fR3A2djZhWHk5NFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tpr.org",
      "title": "tpr.org"
    }
  },
  {
    "title": "Nicki Minaj Bravely Vows to Protect World’s Biggest Bully - Rolling Stone",
    "description": "Nicki Minaj Bravely Vows to Protect World’s Biggest Bully  Rolling StoneNicki Minaj says she’s probably Trump’s ‘No. 1 fan’  The HillRap artist Nicki Minaj pledges support for Trump accounts  CNBCNicki Minaj calls herself Trump's 'No. 1 fan' as hand-holding moment goes viral at Treasury event  Fox NewsWATCH: Nicki Minaj says she's Trump's No. 1 fan, won't let him be bullied  PBS",
    "published date": "Thu, 29 Jan 2026 00:15:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPY3cxWUpCV0dCdkVYM3hDUXgwY0JiSVliN3U3V3V4elZYSkVTOU9IVGl6bmUwZGYtN05Rb2RIbjNuNlprTF9mX2piOS0yaS1zbVR3VjRpQmFRMnd5cnFRb3hrNm5jUlV4a2Y0MThveC1SUDFDVFlSVkFiVGp0TzBEQzBCSE80RE53dXNKdm1iNWlJMXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Judge Temporarily Bars Trump Administration From Detaining Minnesota Refugees - The Wall Street Journal",
    "description": "Judge Temporarily Bars Trump Administration From Detaining Minnesota Refugees  The Wall Street JournalJudge Orders Release of Minnesota Refugees Targeted in ICE Crackdown  The New York TimesJudge blocks Trump officials from detaining refugees in Minnesota  The GuardianFederal judge bars Trump administration from detaining lawful refugees in Minnesota  CBS NewsICE is ‘hunting down’ Minnesota refugees with legal status: lawsuit  The Independent",
    "published date": "Thu, 29 Jan 2026 02:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPeEpyOTh5eW4xZzctdDNnTkM3MldkQXo0M1hyTUJTZUVQU2dsdV9QLVZSNkRfRmZYTWNVRExrQXZ4Z2hoaXBUU1hrdENzaTh2WlAyQTNIRHUxVmZYVURsLXZMZW9iZWtOSFdPV1E1bWZEUFpWd25oTmYybEJCVTVsNF9UbW1oUHVyelZVU24wMlJxNmYwYmpyYmVaVWtwZU9MTEdhUmNTNTZsTTY5Q2FHcnc5d0JKd3ppamZfWXdQVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "‘Significant’ coastal storm expected to hit this weekend, but will it reach Upstate NY? - syracuse.com",
    "description": "‘Significant’ coastal storm expected to hit this weekend, but will it reach Upstate NY?  syracuse.com3 Things to Know About the Next Winter Storm  The New York TimesLong Island weather: Bomb cyclone expected to bring 1 to 3 inches of snow, flooding, beach erosion  newsday.comWeekend Nor'easter A Major Winter Storm With Heavy Snow, Wind In Carolinas, Virginia, Then Coastal New England  weather.comSnow this weekend? Latest weather forecast on possible nor'easter storm in Philadelphia, Pa., NJ, and Delaware  6abc.com",
    "published date": "Wed, 28 Jan 2026 15:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQVWs1Qzg3TXRIM3NjRHNaZWlTX3pKQ1h3UlAxWVJJYU9rcWNWRVhNa25nalVVN2ExX2pZWHc0bE8yVVJsb19BRkxSTDJlS1VzaUJ6d0JOcVBGVl9NLUNUdllFUmJyWllzSWpEVm9WeFkwcU5oQlFZSDRLNEdaVWFULTQwTUtaYVczeXJlS2NSUGFvTlhHa0pwWDRKS2l5OHg2VjRvdC1oSkEtZzdrT1g3OFNMcl94WlBIQjk1Ylc1dGUyS2l0eFh0dg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "syracuse.com"
    }
  },
  {
    "title": "Denmark lauds constructive talks with U.S. over Greenland: ‘Now we are back on track’ - CNBC",
    "description": "Denmark lauds constructive talks with U.S. over Greenland: ‘Now we are back on track’  CNBCThe Woman Who Stands Between Donald Trump and Greenland  The New York TimesGreenland minister: Trump push to acquire bases as sovereign US territory a ‘red line’  The HillUS, Denmark Start Talks Over Greenland Deal to Assuage Trump  BloombergDenmark, Greenland leaders meet Merz, heading to Paris to shore up support  Reuters",
    "published date": "Thu, 29 Jan 2026 09:34:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUDdST0xicVZ1Z1FWci1CaW5qUWJRT2lqOEdtc3RfSmY4YW9DWXhRQ3RpUFdIN013a3Bib24wNEFZbFhyVXFtSlJ2a1BzdzVoUS1JTTczQjhYMFFwUlBTQjF2bGU1Rm03ZVNNVW1lS0FNazdka0luXzhoYWJIbDItcER4cmZzMFlhLUp0NG9mbV9SMGoz0gGaAUFVX3lxTFBiVnVhT0RhU1NjeFlNNVgzX2J5TGI1MHJIbnF0SVlPaFF2QnY0MWd2Ykt4VEc5ZU1xTVh0ZlUyTktfOUZsdklKSDNianktMDQ0ZTFmaXZJd3dwblZVakRmNmZxc2I0cWFNTUJ0c1h4bzRaRllzMEV3UzAxMy1wUXQ1clVaYVRjdXpidnByMFpDeFVlLVEzY0o2SVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Marco Rubio tells senators Venezuela transition won't be fast or easy - NPR",
    "description": "Marco Rubio tells senators Venezuela transition won't be fast or easy  NPRIt's in Venezuela's interest to co-operate with US, Rubio says in heated testimony  BBCRubio defends Trump on Venezuela while trying to allay fears about Greenland and NATO  AP NewsCapitol police arrest Rubio hearing disruptor; Republican senator says ‘off to jail’  Fox NewsSecy. of State Rubio Testifies on Venezuela  C-SPAN",
    "published date": "Wed, 28 Jan 2026 18:39:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9UZ1IzOFkwOEw5R3l2cHkxbzg3MXRNMlNoUjF0WE9oYTVqcndjcG85S1NsZjl6aGtfV2NNOWxiVzFNeUo4TWpldkVFakhOajFWMGZzZlNxNjZ0OTRsLXNpME11UkMtUkt2MXgwVWRKMWl4Y3pmT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Judge in Minnesota Says ICE Has Violated Nearly 100 Court Orders - The New York Times",
    "description": "Judge in Minnesota Says ICE Has Violated Nearly 100 Court Orders  The New York TimesView Full Coverage on Google News",
    "published date": "Wed, 28 Jan 2026 23:42:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQZjFZTThLVExXQjNlT3RqNWk2OTdra2NobHo5dnl1M3hQX00tOWpOaWNYZUw3aXFPS2FteXk5VkZrU3VsOU1aTFBkMXR6anFNRlJjbFJMcWRRRVNuZU42Y1pPbHZOT3BzSmZYVWVHTHNLWDB1Ynl1SkhhYlg4Vzd5V0ZsY3B0aUhxM3NCcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Mamdani ratchets up tax-the-rich rhetoric as Hochul launches reelection run - Politico",
    "description": "Mamdani ratchets up tax-the-rich rhetoric as Hochul launches reelection run  PoliticoNYC Mayor Zohran Mamdani to call for tax hike, citing $12B budget deficit from Adams administration  abc7ny.comNew York Mayor Mamdani says city must hike taxes on wealthy to fill $12 billion deficit  CNBCMayor Mamdani calls for raising taxes on the wealthy, citing NYC budget ‘crisis’  gothamist.comMAMDANI’S FIRST 100 DAYS: With NYC facing $12B budget hole, mayor blames Adams for mismanaging city’s finances – amNewYork  amny.com",
    "published date": "Wed, 28 Jan 2026 22:55:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPbUZyQnQ5MW1HZk55dEU1TktidkliNGVDNi1MN1BORTFvdWpBWGFNUGo4OVltSkp2dFNJVGkzdzFYWm9Mek9VTEpVY3U2MHIxZklnQWlTRW1lZTc1QjlYeU45YU1PWVFBM2U5WTBMT01GZTV0SmV1cVBJR0I0SlNYblVrelRwd2thd1RIOHBMaWt4UzRxNEd0X1ZvbTdYUzRXcjByZXlmVGF6Wk5NejVuaGtzUzgwZkIzOC16SVREVDItLXJKR3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "‘The product of court-shopping’: Virginia Democrats appeal judge’s order halting redistricting effort - Democracy Docket",
    "description": "‘The product of court-shopping’: Virginia Democrats appeal judge’s order halting redistricting effort  Democracy DocketVirginia Judge Blocks Democrats’ Efforts to Redraw Congressional Maps  The New York TimesVirginia Democrats appeal ruling on redistricting amendment  The HillJudge strikes down Virginia Democrats’ plan to redraw congressional districts  The GuardianJudge rules Virginia Democrats violated law with redistricting amendment  The Washington Post",
    "published date": "Wed, 28 Jan 2026 21:13:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxORDgyVmMtMDRMTzk3SmJzaHFQWjlUQnE0WDdQOXpBNElRMTY1N2Y5NmRGWXhZakJROXlUb1hnTjZqcDZNTE5zLW1FSTlUSkI5VFpUMU1zTk1xUUFpX0JzeFpiY1p3MDlBTjFONDJmYXVFR0JJNzlia1h2OHQtMU02eEYxX2pMVjJEb0o5SUtZcmxsdGpEVklSMTZTMzNvRXoxbkVaOGQ2bXZWUDBQNjBzbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "‘The folks are fearful.’ Haitians living in Ohio may soon lose temporary protected status - ohiocapitaljournal.com",
    "description": "‘The folks are fearful.’ Haitians living in Ohio may soon lose temporary protected status  ohiocapitaljournal.comTPS Expiration Under Trump Hits Haitian Workers in Critical Health Care Roles  The New York TimesGov. Mike DeWine says Ohio prepping for possible ICE surge in Springfield  dispatch.comLegal fight over ending TPS for Haitian migrants  wdtn.comSpringfield's Haitian community faces uncertainty over potential ICE operations  wlwt.com",
    "published date": "Wed, 28 Jan 2026 10:07:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQdERXUVhHY2haMUM5ell0dGxQMUdIWDFYZ2NodWJSLWRNNDNZeXhlak9JZDNZc0lyMWluNjlId0NNYkExTVlsWnFUQS03REFtaktIZUlOa0ktY3JDWmh2aEEtRjFwVHZydURkOEp2OXV3M0R5TlhLZm9kdWVkc3NaTWt3cmF2YmNiZkRCemwzdjIySk9fNThNeDFVRVIzSWJLcllEd1Z4MVVMdlYwamZodDdDTXE0WWlCUVdGNk9qc0hkM09GWXFkdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ohiocapitaljournal.com",
      "title": "ohiocapitaljournal.com"
    }
  },
  {
    "title": "Trump and the Great Midwestern Divide - The Bulwark",
    "description": "Trump and the Great Midwestern Divide  The BulwarkTrump Returns to Iowa Amid Farm Struggles  The Wall Street JournalIowans protest President Donald Trump and ICE before Clive event  desmoinesregister.comHere’s what President Trump said in his return to Iowa  kttc.comUpdates: Trump touts economy in Iowa amid outrage over Minnesota killings  Al Jazeera",
    "published date": "Thu, 29 Jan 2026 00:27:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5TN0YwM3VyVEZTRXRKcTNmMzhJeEVyRXFubF9mQjBObHowQXpwS2dJWENOMVRXSUFjWjRiZkphWmk4R2EzZE5GS1dlbU5wX2FCSVprYWtBTHZsS0JZZE9faThYSmRWWXVKeXhOcHNwcjNSWnd4TE9BYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Snow likely for Charlotte this weekend and it could be heavy, forecasters say - charlotteobserver.com",
    "description": "Snow likely for Charlotte this weekend and it could be heavy, forecasters say  charlotteobserver.comSnow likely for the Upstate and mountains this weekend  wyff4.comSevere Winter Storm Watch across Triad this weekend  myfox8.comRep. Ilhan Omar Holds Town Hall Meeting in Minneapolis  C-SPANWeather Impact Alert: Snow arrives on Saturday, bitter cold to follow  wfmynews2.com",
    "published date": "Wed, 28 Jan 2026 11:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9hUDNtOXlyUTJuUmNtMlV4ZThneWtweHp0clN3UTBHLXIzNER5bEJOOHVqMkpOdHlwN05CXzktSUFvZ0hxNmtsZF9rXzV6d3lfal9MR2k3dXlZYzdRTmRsTWZXWVdTX0Z1cWNhRnZMNGE2Yk9hcGg1NlZDUHNxUdIBfkFVX3lxTE5SYjZRWHJNYXJKWjUydGJpbXIyUXlMOTFpNHlNTUFNRDQxeFE3TERtbm00TDdJSjZ6Q3ZyM3FfeUc1TmhRSnp2VG1uN3Jmb1h1STJFYVQzM3BOS2VlSGZack5LUnYwRVJvektMVlJJTXZOYWtlaEZwTm9PanNydw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.charlotteobserver.com",
      "title": "charlotteobserver.com"
    }
  },
  {
    "title": "Canada’s New Reality - The New York Times",
    "description": "Canada’s New Reality  The New York TimesTop Canada CEOs’ Group Questions Carney’s Strategy With Trump  BloombergThe World Will Come to Miss Western Hypocrisy  Foreign AffairsCarney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos  AP NewsOpinion: Carney’s speech makes Canada a threat to Trump  The Globe and Mail",
    "published date": "Thu, 29 Jan 2026 05:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQaE02S0RhZGVIenhLWjN1MHlfMHJXeVpVVE00LUxzNWVVc3FkalFJSlBUdUphcXpmdU5DdzEyU19oZ2ZjU2FXVHYzUzhTeXlmZmFuMFEzZEFrVWRiMnhFTnZCbmUxZ1lxOW9Wd1pRdUxZTDhZZDhfUm11Q09NNkRpT1ktWGNzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Popular actor named in federal sex trafficking trial - syracuse.com",
    "description": "Popular actor named in federal sex trafficking trial  syracuse.comBrothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesAlexander brothers raped victims lured with trips, party invites, prosecutors say  The Washington PostBrothers were predators masquerading as party boys, New York court hears  The GuardianIn Alexander brothers trial, first witness testifies to being sexually assaulted  CBS News",
    "published date": "Wed, 28 Jan 2026 20:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQMGZ4UnAtNG9lb0VrUVlvVXNiOUxaMTVueE1pZDBOUXlzRmhGVDl3ZFRzT2tKYnhvMVRrUmhWMV83bk1qMjhjZVZKTFAtWElWZnFDLUNqdDYtZ2FqdVFMN2ZpM0pic014UVlqN1A4MGhkV01CRFJFT3JwdHZwN1QtaEJhSklwUksyWlkyRzJyNVdOc3RhejlsWmJHVWpDdnQ2OWhPb25ta3HSAbwBQVVfeXFMTjBrcVZYZ3B2c19CSjZWWU9GSlcyT29hT3NBVGE4Z3V3WmExTDJXYm5CR09qeWJKZGprLWVCUDVEaWdDTnNjcXl6bGRvM0RrQThfcjZBZzRTenZ1Vktsa3puY0NHRFNWRlJzTEU1T2xRWXRmbTh5RVNtVzhWenRmMTJNY2l4U1FwRWpQNzQtVm8tdXZiMkFwNTVtNVJIZERDWkFEdFk2cGlHTWNmZTcxRTNHOVp2bTRrSWhEbDc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "syracuse.com"
    }
  },
  {
    "title": "EU heavyweights deepen rift with Rutte over Europe’s military power - politico.eu",
    "description": "EU heavyweights deepen rift with Rutte over Europe’s military power  politico.euTo protect itself, Europe needs the systems that make warfare work  The EconomistEurope’s $1 Trillion Race to Build Back Its Defense Industry  The Wall Street JournalEurope must act urgently and stop outsourcing defence, says EU's Kallas  BBCEuropean leaders call Trump Greenland rift a 'wake-up call'  dw.com",
    "published date": "Wed, 28 Jan 2026 15:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOaFgxcDhMWGNSclptZ3pyeGVvVHBYRGtIZnR0WHZGM2hvOWVfZjNiZmFVcnpKZVVZcHlHRTR2N0pMeU9rRk9fZWFtV2ppN3I2UTVMR0ltLUw5QUxIdG5CZ0FPRXdiVkpCM2ctYlhhdHQ4bG92dGNIbXh5cGRnYjhWVVRPZkI3bVVjWVdTOFRqclNWN2xOUjRQaXJUS3pCRVlGYW5oVV9YV29oS054eG9hdDlsZzFOdlJF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "‘Our cities are no longer safe’: GOP mayors condemn Trump immigration enforcement - Politico",
    "description": "‘Our cities are no longer safe’: GOP mayors condemn Trump immigration enforcement  PoliticoMayors warn that Trump's hardline immigration tactics could dent trust in law enforcement  ABC NewsDenver Sues Trump for ICE’s Minneapolis “Invasion”  westword.com‘Hold ICE accountable.’ Fresno mayor says immigration agency has lost public’s trust  fresnobee.comWhen federal force undermines local trust: Todd Selig  seacoastonline.com",
    "published date": "Thu, 29 Jan 2026 00:46:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQaC1XVTlhejZQREhreURtY1hTS2hMUHFjZmkwUmFUTnlMdUJyQkt6a3Rhc2t2X2N2SWUtQkFUUXVVMnJaT2JTQU5feTlQcEh5MHR2UFBiYV9wTEtjeUE3WnRWZXNVbnBOdU1FNGxZUHhLOFBkWUpmUWR0M3Z0UlJDR2prUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "California Democrats have new plans for confronting ICE: Taxes, lawsuits and location bans - calmatters.org",
    "description": "California Democrats have new plans for confronting ICE: Taxes, lawsuits and location bans  calmatters.orgAs Minneapolis Rages, Legislators Move to Restrict ICE in Their States  The New York TimesAfter Minneapolis shootings, California advances a bill allowing lawsuits against federal agents  latimes.comNewsom urges California law enforcement to investigate possible federal agent crimes  PoliticoCA Democratic lawmakers call out ICE  calmatters.org",
    "published date": "Wed, 28 Jan 2026 13:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1qVkIzekxMSER3OElSck4yeE1yWGYwVW9Mcno1VTRxOVBfVXZucS1XUnBNcHNZeTdmcUo5NXVNSFFNUEF0bS11bHJ4akt0X2pIc1dHQ21CdWRuMkhsR0JoeVRIVHh3blMyMzBoLW1hdjJ2MTNyQV9NWldnbW84R0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://calmatters.org",
      "title": "calmatters.org"
    }
  },
  {
    "title": "16 people arrested for attacks on federal officers in Minnesota, Pam Bondi announces - fox9.com",
    "description": "16 people arrested for attacks on federal officers in Minnesota, Pam Bondi announces  fox9.comJudge Scolds Bondi for Publishing Photos of Protesters on Social Media  The New York TimesJustice Dept. charges 16 Minneapolis protesters with assault, interference  The Washington PostFederal agents arrest 16 in Minneapolis for allegedly assaulting officers  valleynewslive.comFeds bring assault charges against protesters and observers they say impeded immigration agents  Star Tribune",
    "published date": "Wed, 28 Jan 2026 21:46:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOSEE4VWZOUklYX3J3OG9KLW9BNndOUWhNRG0tSVNReVVGWEQzWDZ3QlpMNDNqRGhuM0hRNWxsSndaOE1oWGhyQk5QOEJ2UUI3bTl3RXdhX1M2UEdhNG9fVUFVVTMydElPUUdKemFaMFpjaXBpMlVsNDE3ZGc1QTVpX3RIdzFWV1IxWnZ2Y1JlOEhjRW1EVXpwU25vQlJzTG5H0gGmAUFVX3lxTE1aMUs2c25veWthbkFhQ2pKdU45bG9SaElmejI5QXd4SE1oWk5PZUM0N0JXejM1OWdJaldNTXU4Z2JhdlAxQlVaY2Z4bVk4TC1tdWZva0ZxQkV1Y2U0RUNpR3pST2U2V1B4ZUU1eXdEX2RxeEVncFdVX2J2aDR0QW1ndkZXSjR0bXhyd25YZll4b1ExLUxjcFJYeEhZa0RnM2pPMC0yZUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fox9.com",
      "title": "fox9.com"
    }
  },
  {
    "title": "How the Minneapolis killings look from Trump country - NPR",
    "description": "How the Minneapolis killings look from Trump country  NPRWhat Should Americans Do Now?  The AtlanticAfter Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York Times“The Homeland” Is War on America: The Blood-and-Soil Nationalism That Killed Renee Good and Alex Pretti  Vanity FairPretti’s death marks the point of no return for ICE, CBP  The Hill",
    "published date": "Thu, 29 Jan 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOOWxOaU1YRGpfaS1JWVFHdnpTR3hnUGRQajFZRFlsa3NpVDZpWXFqWWZ2NUI2OC05M3B6SlpqRlZXVnVlRldjeG4xeUJGSE13cHFxaWp5U2V2MHJ0YTJGdmM3Rks3RDNoX3ZlM0Z1dUZ4aVVzRjJHWFBVb0hTVGxBMlJUV21FY25xbHNSRHNRa2dEdzdrQnlmMHQ5YWNCZzB6alJHelhQOEtYMzE4bkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump Claims Minneapolis Mayor Frey Is Violating Law: Why That’s False - Forbes",
    "description": "Trump Claims Minneapolis Mayor Frey Is Violating Law: Why That’s False  ForbesTrump warns Minneapolis mayor he's 'playing with fire' after immigration enforcement conversation  Fox NewsTrump’s demands to end federal surge seemingly hard to reach  kstp.comVance, Trump and Frey trade barbs on immigration over social media  Star TribuneLive: Agents involved in shooting of Minnesota man Alex Pretti put on leave  BBC",
    "published date": "Wed, 28 Jan 2026 15:52:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNeDBjVzYyVVRfVjVsZ1pwSjE5WWh6YmdqR0s2ZEwtaXN6ZENSSGFBN2RnTE1HaFRZaldoWnMtRVNoTjVXbVFuYU9MdUxGeW1ybFdzMlllVTZkRjNtVTkyMUhSSzVkN0ZJbzBRSm1HMUc2dE5HVnRzQ0NDNE5DZWFqR2hnYjl3NTJSbWVSVllYUDlvVFFLZ2pua2sxRzBMMnBJaG5ra0lVM19LUE9DeGtfa0s4UURDOVZOSkp6OENrV0J2eEljYmhuX0xOZURBc0RsaXNIMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Officials 'evaluating' why federal agents in Minneapolis 'may not have been following' protocol: Stephen Miller - ABC News",
    "description": "Officials 'evaluating' why federal agents in Minneapolis 'may not have been following' protocol: Stephen Miller  ABC NewsTrump officials trade blame as political pressure mounts over Minneapolis  PoliticoTop White House aide Stephen Miller acknowledges possible breach of protocol before Alex Pretti’s shooting  CNNScoop: Stephen Miller behind misleading claim that Alex Pretti wanted to \"massacre\" agents  AxiosPressure grows on Stephen Miller after Alex Pretti killing but Trump unlikely to cut ties  The Guardian",
    "published date": "Wed, 28 Jan 2026 21:49:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNaUxtSF8zQ051dVRaX2JkSFVNVUpnTjJ5NGpGVG1Kc2E0YnFTX1J3THRMMzBUNVZBeERzc1JvNmktUUtxRFQ4NFJrQkI1VTFULXA5R3UxcHY0VzBhSy12UlRYVjI3ZXdlQVlpQ0ZCcmU0Zmgtb0ZGQTlRQm9ZVHVDalFwT2NhZE41U3VaYUJ1SWJyZWNabFR3WVBMczhBalVPU2VBbkg3bUFsSzJFWW94dUtFaHhDcHVMQzYtTHpEUdIBxAFBVV95cUxQVXFMUlVmeERXRlBXSFk5bDdRX1NyeXkzODZLTUNMUzVhQTNkZjFmTkswOUV6aWc4ZjQxVHE5bzBkdlZQbnhfeURBSDVDdEpVNXVGZWVudk4xTko5cEpoOFRmQm5WWmQ1MzllM01SS211M2NESXZ1djh1RDNvbEhTTGw4dVVLT1dLZWtCb0o0V2ZxVkFsMGl5NHZNc2NyTzZUNE1BV0I4VjU1VUZnNDlSRzNzZVczQ05sTW9WaGVHUTdtTzQx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Car inspections here to stay (for now) - keenesentinel.com",
    "description": "Car inspections here to stay (for now)  keenesentinel.comState working on guidance to public after judge blocks end of vehicle inspection program  wmur.comNew Hampshire car inspections here to stay — for now  nhpr.orgVehicle inspections back on tap in Statehouse  keenesentinel.comFederal judge: NH vehicle inspections to continue for now  unionleader.com",
    "published date": "Wed, 28 Jan 2026 14:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPRXhWbXlrQ2NiMjZIcGJyYzdkZGtwLXhDRkM4U1hZejBOMkliRy1WNy1hRDJqR1RlaVpZRG1hSC1GeFAza2RBMjFYSUVXWklPbDBHYi1qeURlam4xNFpZZXVTQ3ZqN0IweGhMVFI0OURxaDh2RmJEZGE1LTNuOWZMOE5oMTM2OU4yekx3aE5uRnVaa0ZWS2ZET1A0V25VRU5PdEU5T0RTT0VQN0F2OGpGWkJIWHlNYW4xanB5bTZ5WGFTVUl4MTRzSVNXaHNEaVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keenesentinel.com",
      "title": "keenesentinel.com"
    }
  },
  {
    "title": "Tails of the City: San Francisco’s Latest Animal Sensation Is a Mountain Lion - The New York Times",
    "description": "Tails of the City: San Francisco’s Latest Animal Sensation Is a Mountain Lion  The New York TimesVideo: Mountain lion released to Santa Cruz mountains  ktvu.comLive TV report on cougar capture in San Francisco neighborhood interrupted by coyote  The GuardianMountain lion tranquilized, captured after roaming streets in San Francisco  nbcbayarea.comOfficials tranquilize mountain lion loose in San Francisco, later free him into the wild  kcra.com",
    "published date": "Wed, 28 Jan 2026 02:54:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBsWnZ4M1N2TU1BQUZaSG1mSG42LXFncjBGZERONldmazBJeHExRGJOd0JqeGR5TG82TTNfYzJpMDFlNWJOQ1E3cGlaRkY3d3RERzlxc0dJNUFoYmJReTdKNmxTTHhxLWlLcF96QlhmSkNwbzFQeUluRXNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Details emerge about victims killed in private jet crash in Maine - CBS News",
    "description": "Details emerge about victims killed in private jet crash in Maine  CBS News5th victim of fatal Bangor plane crash identified  bangordailynews.comJoel Osteen's Lakewood Church remembers staff member killed in Maine plane crash: 'Beautiful spirit'  Fox News5 on crashed plane named, but still no formal identification by officials  pressherald.comLIVE: Bangor airport officials give update on Sunday plane crash  wabi.tv",
    "published date": "Wed, 28 Jan 2026 14:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNaURGSGpqaktWMUdiano5azY3NkNLeHcyVWNpeG5MX2s4dXZvOHhuMU5zdTl6VVd6RG44cWlNY3hHRlh5NGxWWkswcXpwbUtGT1ZPRXNRM2tTVUlmVnV0T3d5aFJMU2ZaQ1BFV2htUU1kSFg1R3pEWk8yZW1nVkNxaFlB0gGHAUFVX3lxTE04RmJiUVpkOVhKRDVhWndrZ3RCZzhWUzEtZlJOX2U3SW9QU1ZtNkg1aHdtenVUV0xxWVIyQmQ3Yl8zRlIwWG5xZTdBRDlneXdBUXF1ZVFFNHZ2OTRPTEgwdmR1TEIwNkZsTktVNndxdEZmQlFUeF9DMmd5S2ljcmlEZU5IU3Nwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump yanks permitting process from Democrats after California fires - Al Jazeera",
    "description": "Trump yanks permitting process from Democrats after California fires  Al JazeeraLetters to the Editor: Readers debate Trump’s executive order to allow fire victims to skirt permit rules  latimes.comTrump signs executive order aimed at assuming control of Los Angeles wildfire rebuild permits from state, local jurisdictions  CBS NewsPresident Trump's executive order bypasses local permitting process to rebuild post-fires  nbclosangeles.comTrump to put Zeldin in charge of permits to rebuild after California wildfires  Reuters",
    "published date": "Wed, 28 Jan 2026 20:25:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPdE4yUjZxUkZtaGhVVTdndnFjQ1ZmYWVjVE1tQ0laWG5zT1BjSk9Kc2I1ZG1kb0JCSEYzRUJpTzh6VGJKVlJiZTNTcWkyVG1MMEY5VDIyN0QxUTJBTkZ6SE5pMVRTSWVPaGZiMDVIZHpVODdVQzlwQkNZYUtpX1M2TUJPc014Y3dwYm5XY2xHY3FlTEo2Mm1pRndxRW1RWnRNQnNybkFEZFRnR0hJV3fSAbMBQVVfeXFMUG0xeUNjZHVLWVFTaUt1NG5kUVFiNTlRa0FNdnYwdkJaOTVqUVBNWmJDY0hWSHQ0bXlfZzRfaUt5WVhVci1mdlBFa2hTZ0tlOXFkWS15VjBPM3FOdzEya1VQbzhzSUU1VHlqMGp1UUNlT1RaTUpjRkdyMmI2Y0hJanpwWU9Wb3BQZm9TbG9LWlBvakRBR3FyeGxoZGx0SXh2QlhaamVVRS1VVFl2Mlp4Vm1DQlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "N.J. weather: ‘Bomb cyclone’ could bring blizzard conditions, 3 to 6 inches of snow to parts of N.J., AccuWea - nj.com",
    "description": "N.J. weather: ‘Bomb cyclone’ could bring blizzard conditions, 3 to 6 inches of snow to parts of N.J., AccuWea  nj.comNor'easter probably a 'near miss' for NJ, but 6-inch snowfall possible  app.comN.J. weather: Snow forecast updates for weekend storm likely to hit state with 50 mph wind, flooding  nj.comWeather blog: NJ Transit rail service resumes, NYC deaths under investigation  nbcnewyork.comTravel restrictions on New Jersey highways, including AC Expressway, Garden State Parkway and NJ Turnpike  6abc.com",
    "published date": "Wed, 28 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPeHRlOEp3cGYwLXU2NjZOa3VKZXNJZjVIN1MtdXI3NWVKSWNzUUtsVW1kTF9rXzZhRHlhMVBxQVdmTG5xQl9nTXR2d1hpT3lmMzE0Z3NXUUhEUnVSTVZQSG9qd2dTQ21NSzNyZXl4R2FxQjRSRkZRU21vVmF0VmNRZTVGUERhSktUeVBOa2txZHFud0RoOHBBTGxCTXdnUTloT3FSdGtuTUl1Z1l0UzA0VmZRVmRFV2MtVmZ5ZVFJaGFEQ0o2ODRPMWZFVzd0RGNOdFpfNNIB6AFBVV95cUxQUTA2UUlSTkRDejcxREcwdlFTSmw0cUlTamJrNkhkQW9BZHJld0VWcnktM2dFb3U4MnBFQ3E1bkRMcFhlc090UTNpZ20zMXlnS1hxMmpYZU1mQTVNRFppUnNUWUNPdy1OSzQ0bW16OXBhR2xNWkFINkstclVlNTVINVV6NGpBMGhyTDNTQnUzLWl1anktanIyRTRkSTBLZ0FMQWxZUmlRdzloSlNuMF9TZWV1WEpDajBoWUsxWmpZMVFmbE9QOWx3Z2FEN3UybzJvdEk0S1N4ZS1XMjdaZVpEXzdsTzBmVFlX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "nj.com"
    }
  }
]