[
  {
    "title": "Judge orders 5-year-old Liam Conejo Ramos and his dad released from ICE detention - AP News",
    "description": "Judge orders 5-year-old Liam Conejo Ramos and his dad released from ICE detention  AP NewsJudge orders 5-year-old Liam Ramos and his father be released from immigration detention  CNNJudge Orders Release of 5-Year-Old Detained by Immigration Agents in Minnesota  The New York Times‘Mommy, open the door’: Mother recounts her terror as her 5-year-old was taken by ICE  NBC News‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding  MPR News",
    "published date": "Sat, 31 Jan 2026 21:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdnlXMVZtd0xtSm44TDA0Rkx6WFdrbEw0U1MtdkdiMkFJZ3BxYWRZYVk1Tk1fTjNXTklDYXh0SnBDX0FTZG5ER0NuNF9sNm9RZjBsVVRSak81SlpZa1Ffb0ZkWW5HM1JOZW9JeGQ2X1R2ZFBXOGZiTnJELVRLR1U4dDF0ZGtRaWFmZUZjbXFUUlNXczJPb0tpOTRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota - The New York Times",
    "description": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota  The New York TimesJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoJudge denies Minnesota’s request to end ICE surge in Minneapolis  The GuardianMinnesota ICE surge upheld as judge finds 'balance of harms' lacking  AxiosFederal judge denies Minnesota's request to temporarily halt Operation Metro Surge  CBS News",
    "published date": "Sat, 31 Jan 2026 20:44:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1JejBjakZheDBSaUJTbm1yRE9MSWZWMV91U21qTHBlWV9IZm9Hem1BelpMVVZnSUxSYVZuVU9renhEZENkaU1JdTEtcTBBN3R4LU1yN2dsNlFGaE1HZk9pWk9abWFfQUpsNHpXZ1A2WGNmMmRudU1CWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What have we learned from the newly released Epstein files? - The Guardian",
    "description": "What have we learned from the newly released Epstein files?  The GuardianThey Said They Weren’t Close to Epstein. New Documents Show Otherwise.  The New York TimesLA Olympics chief says he ‘deeply regrets’ emails with Ghislaine Maxwell  The GuardianEpstein files: Trump, Howard Lutnick, Steve Tisch among prominent names that appear in latest Justice Department release  CNBCEx-NASCAR driver sent Jeffrey Epstein Valentine's Day email, forwarded sexually explicit message, files show  Fox News",
    "published date": "Sat, 31 Jan 2026 22:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPX3ZTSlVxZWxkMVhMY0JyT3BlN080cTZOY0ZKdGlDdHR6RUlvY0lWcEhGaHQ1aU9BWkFiTnhBWGxWUjNVcWlETVhLSTlIek9OdnQ2TmRWeGVlVUkyRmFTMHRKUU1VQzNaWG13ODVvQjRrUGZnTFR5UGcyblBZZWRQNDBFOUNTejE2aGt3TXNwUHhoc0RyN1JLMUQta1VET0hUaTVxRThEWmRwV3doX0w4cklVd0xST2k0NkFYc2RnT01ERHUtRGtod3JmcjNlQUps?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Officials in Minnesota allege Bovino used language offensive to Jews on conference call - CBS News",
    "description": "Officials in Minnesota allege Bovino used language offensive to Jews on conference call  CBS NewsBovino Is Said to Have Mocked Prosecutor’s Jewish Faith on Call With Lawyers  The New York TimesGregory Bovino reportedly mocked US Minnesota attorney’s Jewish faith  The Guardian‘Chosen people’: Controversial US Border Patrol officer said to mock Jewish prosecutor  The Times of IsraelBreaking News: The Border Patrol leader Greg Bovino mocked the Jewish faith of the U.S. attorney in Minnesota during a call with lawyers, according to several people with knowledge of the conversation.  facebook.com",
    "published date": "Sun, 01 Feb 2026 00:47:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPYkJ5UEx1YjJEZnNETW9KZ0NGNVVobWlNei1JMXhNU2tydzJJM01sVDgzdzFSSXRkdk5IaGJTYXA1VEhMdnpMRGRCV216bVFZYnNnbUMyZ3l1Qm9vNWJoSWVMUHotc0hCWXB2d1dLb0NReFRGVXRXaVVVWXNmN01Ld1RyWUNvbE9QeXR2UkdaMVFnYjTSAZgBQVVfeXFMUHEySGtsRmtLRk1wS0hqS3ZsUlpsdWdKS1N3UW9VYXdRQ3VtRmFqczh3eTJUbUhLYk1YUmZPdW9yby0yWVBmRXNvVFVGOVVnNTZFZ1VNMzN5QzdIQnUydVY2WEU1by11YWlKTXMweEJ0dzNoYlNOb2RFajRuckY2dlRmWDlfU1FKZkg5cHg0dEhsMDhIUENwTEc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct - CNN",
    "description": "Chicago mayor signs executive order calling on police to investigate federal immigration agents accused of misconduct  CNNMayor Brandon Johnson signs executive order, directs Chicago police to investigate alleged illegal activity by ICE, federal agents  ABC7 ChicagoChicago mayor orders police to investigate alleged illegal ICE activity in city  The GuardianMayor Brandon Johnson orders CPD to investigate federal immigration agents for potential prosecution  Chicago Sun-TimesChicago Orders Police to Document Potentially Illegal Federal Immigration Tactics  The New York Times",
    "published date": "Sat, 31 Jan 2026 21:53:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1TWUdtcU9BeFdSUlluVEdlNFNtZl9Xa0NQZzBHZFFBeUJqMjZwSkR2T0U4YXoyVGxUMUM5Y2lhZ19CWGVGdy1kbWxrYnVQTHEtdXBweFk2UzVmZ0hYX2pDeUZmbnJfUlBockNrTkw2dnRCQjkxNnQzYkN4eFA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure - Politico",
    "description": "‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure  Politico‘A hurricane is coming’: Havana prepares people for war as US shuts off Cuba’s oil valve  CNNPresident Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy  Al JazeeraCuba Is Losing a Key Oil Supplier as U.S. Presses Mexico to Pull Back - WSJ  The Wall Street JournalTrump Moves to Cut All Oil to Cuba as U.S. Targets Its Government  The New York Times",
    "published date": "Sat, 31 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOMUk1UEtVNnNNMnQxVW1BZFFMaGpmdlZja1N2QWVUVllqcnZOZDBBN2tBS2VFcnRsTm1NS0JSU3E3VlpOUk1fbUg4N2F6REJFRFp6WHNpMWtScUtSci1aa3NaQ29SMkYzTjdnUGFiRWdWbzRUcThldXl2Tnc5LVhocWVmamFZc1Y5SUJQa1c2VzFPaDlkQXBuUkxJdUdQNW1DQTV3TlprVG1Yak53N1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown - Axios",
    "description": "Mike Johnson warned by Jeffries not to count on Democrats' votes to end shutdown  AxiosFacing Immigration Backlash, Trump Called Schumer to Cut a Deal  The New York TimesHouse minority leader says Republicans can’t rely on Democrats to pass funding bill, raising fears of longer shutdown  CNNSenate passes $1.2T government funding deal — but a brief shutdown is certain  PoliticoHouse Democrats mutiny Schumer’s deal with White House, threatening longer shutdown  Fox News",
    "published date": "Sat, 31 Jan 2026 23:40:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQQ09QU0o5a3U0N1p1RDNLY2dvVlNWaTNjV3UyMmpHR0VZa041MVk3bWREbHpGWTFNSWcxVFZVRzdHT2pIRUY4UU50eG12azFsZDAtYk42Mk1DYWFwYXF5Rlo1eGlWLUFqZFpRLTJsREVBSi1OUDBOQU5yc3lqUXVTTml4SHJ1Q3c4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "New ICE memo gives deportation officers more leeway to conduct warrantless arrests - CBS News",
    "description": "New ICE memo gives deportation officers more leeway to conduct warrantless arrests  CBS NewsICE Expands Power of Agents to Arrest People Without Warrants  The New York TimesBoston lawsuit aims to stop 'warrantless home invasions' by ICE  WBURLawsuit challenges ICE ability to enter homes without warrants from US judges  ReutersICE’s Shocking New Orders For Masked Goons Exposed  The Daily Beast",
    "published date": "Sat, 31 Jan 2026 22:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNUEwwRmVVdFZRNHVRSXFOZUJDV1dZU21HbXZsVFVGWXZiUWRKa0JGZ1lrQjBNQnJIVUZDOHJuTFpab2NMdVFVaHBDSzFqWm1vS1FEM3N6dkFHT2ltZVdhTU5ha1gtMm05WURfZC1yWFpmdE82aXZJSEU1ajYxcGV6VlRNMmd3d9IBiwFBVV95cUxPU0IzTkp2VkNGU3VDa3gtQkVCZTJPTVhyVlozUGxzOC1keUpfOVBBc1RJY2lZV1lld0luZEQ2d1VDc01nYkJtTGx2SUFwSTZtTFo5bkwwVTVBUjNGSjA4XzdnYXQwTWo3WmRoZDJ1TUhlblpNcExrODBFTlE2LUpkVGpNcmFUY3MzR19Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Winter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow - The New York Times",
    "description": "Winter Storm Hits the Carolinas, Bringing Dangerous Ice and Snow  The New York TimesWinter storm to bring accumulating snow, bitter cold to WNC  WLOSSnowstorm 2026: Updates, pictures, video and more!  WYFF News 4Snow is falling fast and heavy in the Piedmont of North Carolina | Winter Storm Warning  WXIIThe biggest snow in years is falling in the Southeast, triggering hundreds of accidents on slick roads  CNN",
    "published date": "Sat, 31 Jan 2026 23:31:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPNzJsU2lHVEh1YUdWNlUzdE5DWURfcUd5VzI4SUdrc1FhVkxET1daNkpPd0RvS0M3Tm1rTWszcEMzUmhqbUZNVHU2SVdaejlMRE5HbXBvWEp0Uloya0JEQWRrdkpBUGRPa3M0b1Ixbk1rWVNYdEhzeFA2d19XUWtVTDdzMERNMlRI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement - WCVB",
    "description": "Boston rally draws crowds protesting ICE, Trump administration immigration enforcement  WCVBWhat to Know About Anti-ICE Protests This Weekend  The New York Times‘Stand up, fight back’: Protesters on Common assail deportation tactics around country  The Boston GlobeThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The GuardianUS protesters hold nationwide strike against Trump’s immigration policies  Al Jazeera",
    "published date": "Sat, 31 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5EYWtjMy1aMERJNmdVN0NyaXpLVEdibF9IR0x1ZTFVVW5lU0Nya0JId2IxOHdaTFF1dzNyYzlhbmFzcDBKQjhJTVREVjZyZlgtTEEwT2pGd1lEN2NpNXExV245ZFRDQ3JPX3hkelptZ2Jmd0phdUI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcvb.com",
      "title": "WCVB"
    }
  },
  {
    "title": "Second Epstein victim claims she was sent to UK for sex with Andrew, lawyer says - BBC",
    "description": "Second Epstein victim claims she was sent to UK for sex with Andrew, lawyer says  BBCLatest Epstein file photos appear to show former Prince Andrew on floor with female  CNNKeir Starmer calls on Andrew to testify in US over Jeffrey Epstein links  The GuardianStarmer tells Andrew: Testify or you’re failing Epstein victims  The TimesFormer Prince Andrew can't escape Epstein's shadow as new documents reveal details about friendship  AP News",
    "published date": "Sat, 31 Jan 2026 22:08:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5EQWU2QmR2YWlqa0xkNlp5LUc4VWI4eHo3Qzd3THBSVmdtM2E4OHRmbmYwRTVvM0p6ZmdXX0h2cVZJV01GU1pMVThyZTM4TXp0djJsZUxlTk9jQdIBX0FVX3lxTE1CZk9qWVlaUjhENmV0WWg0Rk9lUWJsbVFsdnp5Q1VhNE5BMVh2UF9aT1Fob3IxVWZGUkVNM2JWd1JkMFJuT0tlREROSWI2QWtZVkd1MlN6TkhPSmtzZ3d3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Houston runoff sets up next Democratic generational fight - Politico",
    "description": "Houston runoff sets up next Democratic generational fight  PoliticoA US House special election in Texas is set to narrow the GOP majority even further  CNNWhat to expect in Texas' 18th Congressional District special runoff election  PBSLive results: Democrats vie for Sylvester Turner’s House seat in Texas  The HillTexas House Special Election 2026 Live Results  NBC News",
    "published date": "Sat, 31 Jan 2026 12:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5kLW1pbzgzSC1WSERoRUZka1IyRTN4V2VLRXN6U3N1andUUmJkMDBWdGlUZGUwSXhtalV2Ul92djR2ckE5NTl4SGJfYnMwMjJfT2lWUU10bUxpMXhwbnJKOG9qODlOTmN4cHExYThYVWIwSk41REpObUVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "California’s Highway 99 reopens after foggy 59-vehicle pileup - San Francisco Chronicle",
    "description": "California’s Highway 99 reopens after foggy 59-vehicle pileup  San Francisco ChronicleHighway 99 in Tulare County reopens after 59-vehicle pileup, CHP says  ABC30 FresnoCHP: Several injured after 59 vehicles involved in Highway 99 crash near Earlimart  KBAKPhotos: Dense fog reported during massive pileup involving 150 vehicles in California  FOX WeatherViolent 59-Vehicle Collision Injures at Least 10 People and Shuts Down Highway  People.com",
    "published date": "Sat, 31 Jan 2026 22:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQOEhxUzF5Y2ptTklFSThlbkZIRV8wU203SG9rZ0tCZDZJVkRhd2NHTUZKLTZoUVlEa0tMeTJwelItamQwWlVEbF9IRVU3UEVYX3NzOTZuZHhuLUhyX2t5aGhycVNPWkV2UllqT0luZUdaeDA0THZaNnloaFBXOV9IYk1LbWVUa2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Protesters in Copenhagen rally for Danish veterans after Trump remarks - Reuters",
    "description": "Protesters in Copenhagen rally for Danish veterans after Trump remarks  Reuters‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments  The New York TimesHundreds protest Trump's NATO comments and Greenland demands at US embassy in Copenhagen  Fox NewsUS Embassy in Copenhagen removes flags honoring fallen Danish soldiers, angering veterans  CNNDanish veterans protest outside US Embassy over Trump administration's Greenland plans  ABC News",
    "published date": "Sat, 31 Jan 2026 18:09:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNN3NWU1MwY2RNd1VIVVlsQWgxeTFxVHhqbG1nQTZuVzJaQnNjdWZkdXBxczNwRHBaSDBodjhhVVNCV1NVcXZXckdBQ1R3Qll1NUUyU2pBdzR0X1JIWWNPN0dnY2IzWTVfZXlfWnF2OHA1SW13RzFzdTdFQVJaaXczQzZNTXh1UGVHUGk0OEZmbDktM0duSy1CR3lIMl9vQ3lzUWMxeFdIY29pRk5HbEs2M05lc19sOUtPelE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story. - CBS News",
    "description": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story.  CBS NewsTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC NewsHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing  The InterceptFormer officials say DHS tactics undermine public trust after series of contradictory statements  ABC NewsHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNN",
    "published date": "Sat, 31 Jan 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSFVTeEJSdkNuemttNTNOSGlISVFDU1RVSWs5S0hBX0Z6ZmdwUU9faVRNNEdJUG95WUVXYnpFMUVxVHVidHBRYmY0bk5uenp1cHpVVVFVaEdHSTl2NGhYWU1EeXR3X09NRnFzQjhHUEJDQVdXdTBvVWIyUUpPUHEtZzdoaEF3MFHSAYwBQVVfeXFMT3ZzbmRkbkpuT0pLVzEwS2hpanhnUFhyaVNXczlERXpjYi16anBMR0ZEelgwRWQxaDhpUF93VndRT1VKUFhWNW5GNHVZSUVydDhsZjNuV3gtNkF4bVhSb0R0ZGRRTzN3S0lMWndjdVRTQ09GSnNWNWxQMkVrd0E1OEhFTVR1dmxmVTE0T0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners - CBS News",
    "description": "Venezuela's acting president proposes legislation that could lead to release of hundreds of political prisoners  CBS NewsVenezuela plans amnesty law for political prisoners and closure of notorious prison  CNNVenezuela’s acting President Delcy Rodriguez announces prisoner amnesty  Al JazeeraVenezuela releases all known American detainees after Maduro's capture and government takeover  Fox NewsVenezuela announces mass amnesty plan for political prisoners dating back to Chavez era  The Guardian",
    "published date": "Sat, 31 Jan 2026 22:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQQTR4a2FTaTA5bXpabDJacGtLdUZmY3dVczFpZDB6VjRnT3hfQWNBTFNjTDlfY2U5VEtxbEluTGo4U2VOb2prQmhqQnVfd0gtUUhNYm1BNFl6cDBSSnNfa3MzN3JmbWYtWGhWME1zNzRrckluYXNCZ2N1aFdNcTdVMkIwTEFmdWlCdXFSYzZYS3dPdzTSAZgBQVVfeXFMTUNSNm5SOFYxUlJDV1Y0TWFBYzl2YzYzMGEzZWJ6d3JrWTBrLVc3cmd2OWthQjlCdXZubG1vOHdCQ3Q4THBBcmZwRzhvRFJqZ0FucDktdjlsTWU0Y0RMcGJYdm91enFjVEttb29ZZjg5ei1ERjVGVW5ab0NIUlB5SmdPcVBIVFQ3aDg4MG9GNlk5TzVqWnZ5c3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so - AP News",
    "description": "Trump says feds won't intervene during protests in Democratic-led cities unless asked to do so  AP NewsTrump says federal government won’t step into protests in Democratic-led cities ‘until they ask us for help’  CNNTrump news at a glance: president orders homeland security to avoid protests in Democratic-led cities  The GuardianTrump says DHS won't respond to protests in 'Democrat Cities' until they 'ask for help'  NBC NewsTrump vows not to help blue cities with riots, instructs ICE and Border Patrol to protect federal property  Fox News",
    "published date": "Sat, 31 Jan 2026 23:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZVZjSHNrX1l3RW1Mb2NPQ3k1SGo2NER1eFBLZlY4cDRIVVZlc3ZnSGhVQnVONUt3bVEwS1NhckVtODJSSG5vZFFXeTA1bmZya1JEYlNiWlZ6RjdWUUtTbVZqcllDX2VJRlU3WWlKa25XTy1MOG0yZDZoSkdRMjdOUUlMejlXMEpRWnZ2NjdGVjVSVUdQSldxRk5oTWpyY19kNWlYdWd0cm4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Thousands flood downtown Portland for ‘Labor Against ICE’ protest - Oregon Public Broadcasting - OPB",
    "description": "Thousands flood downtown Portland for ‘Labor Against ICE’ protest  Oregon Public Broadcasting - OPBICE halted its surge in Maine. The state might not be quick to forget.  PoliticoCollins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesICE ceases enhanced operations in Maine after Collins presses Noem  The HillHundreds of students walk out of Maine classrooms to protest ICE  WGME",
    "published date": "Sun, 01 Feb 2026 01:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQM0FGUFZMWmMzbm9aUFQ4cks5emR5SVRYbkFYbkFJLTB5LVA0cFlvNjdqT2MxdHA2bjFYRlFpS0VhenVuWnhCS2ZKSEY0UUdELWtlanc3dnJjN1I2dDZLaWZvazlUN2FSNDVWVWJ6MzVRS0l1RDJsWWJCMU1PRDVJZ09LOWhDZlRaODg5bEVVUkJNUzktOXJzQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Top Iranian official says progress made towards launching negotiations with the U.S. - Axios",
    "description": "Top Iranian official says progress made towards launching negotiations with the U.S.  AxiosIranian official says progress made on talks as US-Iran tensions persist  Al JazeeraIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsMiddle East Scrambles to Find U.S., Iran a Diplomatic Off-Ramp  The Wall Street JournalIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNN",
    "published date": "Sat, 31 Jan 2026 20:44:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE8wSUVsVEZyQ1B1MGRBRGdRX1l6SWxmNE5sUHFKTkpkajRvck4wUXNGQzdWWWw0VDhEVW1fQU1Vb2FKX2lyMDE1VnhlYWxSSFdaTWpYN2F5MmZ4TElrOEw4dnRCeU5CY0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Search for survivors halted after Massachusetts fishing boat lost at sea - The Guardian",
    "description": "Search for survivors halted after Massachusetts fishing boat lost at sea  The GuardianUS Coast Guard calls off search for Gloucester fishing vessel with 7 aboard  The Boston GlobeFather and son among crew of 7 on fishing boat Lily Jean that sank off Gloucester, family member says  CBS NewsCoast Guard suspends search for missing crew after boat sinks off Massachusetts  BBCCoast Guard suspends search for survivors after fishing boat sinks off Massachusetts; 1 body recovered  Fox News",
    "published date": "Sat, 31 Jan 2026 15:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeU5uSXZoUkxVdmRuRzFqdzdCcmdTXzVPQWVTbU14SFpkSE12RkozU0J3WElXU0pyYlNJSkJ2ODRFY1F4dHpqOWhKTk1QMWJxR3k5dmdaVjJUUENyeDNfUDY1dnFfcndULWlTTWNMQjRHMGh6U21ncWRpTVRFRldzaU0taVgxMTByOTdUX2hNZ2RTd0ZXX05ERHFjNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Iran Renews Threat to Strike Israel as US Attack Fears Grow - Bloomberg.com",
    "description": "Iran Renews Threat to Strike Israel as US Attack Fears Grow  Bloomberg.comTrump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran.  The Wall Street JournalHere’s what military equipment the US has positioned in the Middle East as Trump considers an Iran strike  CNNWar Threats and Ambiguous Evidence: Trump Again Confronts Iran  The New York TimesIran Update, January 30, 2026  Institute for the Study of War",
    "published date": "Sat, 31 Jan 2026 15:12:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxONF95UUdwdDQtU1VLUGZ2ZC1Kd21OVnhibERmY1R5QXR2WkxxMW1JYTlUdk5MTDhfc0Fza1VjOWRtQVE2dUV2RGgwVWFQd2x6X0lGMFh1Y0lSRVBtMGUwUlcydUlSdEF1cFhTTUJwYUo1VGZ2VnZ3bE5tVWVlclY1RjAwVmllc0RzWmtYUVNJNmNuUGNjMk10aGFIcHNfU3lPTUpLTlVWR01WYTEtWDZFRWtpcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Live updates: Hundreds gather for another anti-ICE protest in DTLA after 8 arrests on Friday - ABC7 Los Angeles",
    "description": "Live updates: Hundreds gather for another anti-ICE protest in DTLA after 8 arrests on Friday  ABC7 Los AngelesLAPD arrests violent agitators after protests erupt outside federal detention center in Los Angeles  Fox NewsProtesters clash with federal agents in downtown Los Angeles  CBS NewsCitywide tactical alert issues after anti-ICE protesters clash with federal officers in downtown LA  NBC Los AngelesMultiple anti-ICE protests being held in Southern California on Saturday  Los Angeles Daily News",
    "published date": "Sun, 01 Feb 2026 01:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism” - Deadline",
    "description": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism”  DeadlineDon Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest  NPRDon Lemon vows to fight charges in First Amendment showdown with Trump  PoliticoDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesLemon blasts corporate media that ‘bend the knee’ to Trump after arrest  The Hill",
    "published date": "Sat, 31 Jan 2026 03:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNZ3cxNS1HejliRHNzWXY2Mk9xb0F3ZWpJM1RacEJvaDVOeE1oaVFWLXZYSGZJVDlYSm1qUlNWeUFPdTlPNXlfOG1SdmN1RWNzSUhYYVAzWk4xc1FWbHVnOXBLUXlpcWJ0T3lCaGt5aFNvd2hocGJJdk03WUlhbTVxdVlNaW9UNWJ3bVhjaWlpLUNDUFViMGNLY3NVWFVGMW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Chicago snow today: More lake-effect snow hits area, impacting road conditions; over 100 flights canceled at O'Hare Airport - ABC7 Chicago",
    "description": "Chicago snow today: More lake-effect snow hits area, impacting road conditions; over 100 flights canceled at O'Hare Airport  ABC7 ChicagoMore lake-effect snow hits Chicago area Saturday, impacting travel and road conditions  YahooBurst of potentially heavy lake effect snow to continue wobbling along Illinois/Indiana shoreline through Saturday morning  WGN-TVSnow totals soar in northwest Indiana after powerful lake-effect burst  NBC 5 ChicagoGround stop at O'Hare, delays at both airports as lake-effect snow brings several inches to Chicago area  Chicago Sun-Times",
    "published date": "Sat, 31 Jan 2026 14:58:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQdkR3LXh0bDJUdzh1WUlfOWNOY3pCdGtyekVkeTlRby1FN0tnZVVLcHlRRVlIUzJlaEZXcDNhNGF1NW5scHIwVTZaeGFSaXBrRUg3VDE0azFBa1BHTTNMdXdIQjlwbmI5NmR0dTR1MXBLY0lTQnFvZVA5QUJmcWtBWVAtX3luWFQwOE5ablpCSXZ1d2dIWm5RT2Z3MXN0bnJiZnVMRFJudVFHQlF2czJV0gG0AUFVX3lxTFBTc2thZmhwQ0xZU2J4d1hCS2kyczBfQzNCbHM1LXVGd0Yyemt4UUJFdEVqZ09wUnN2VlpGUWFxS05MLV9HdmN2TjJMc3FrT0IzZU5EdTY2Q1p0YTRLb3hweEt5WnR4bTI2MHdxZWFwLWRfUFBzV1NhQThPb1oyVVIwazRndVByUkdOZkx0MkY1YUdRYkJnYkNvQzF5QktCeWljYmpxWmJfczhKcjBIWXdmNENEMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "Shooting at Mardi Gras parade in Louisiana leaves six people injured - The Guardian",
    "description": "Shooting at Mardi Gras parade in Louisiana leaves six people injured  The GuardianFive people, including 6-year-old, shot during Clinton Mardi Gras parade  WAFBPhotos: At least three injured in shooting during Mardi Gras parade in Clinton  The Advocate5 people, including 1 child, injured in Mardi Gras parade shooting in East Feliciana Parish  WBRZ5 injured, including 6-year-old, in shooting during Mardi Gras parade in East Feliciana Parish sheriff says  WWLTV.com",
    "published date": "Sun, 01 Feb 2026 01:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUVlHYVQ0Z3dCSFF4QUJyaEd0dmVxZjRiYzB4UlJRX2FnNFVsdzlTT3FhUFZOcUZkcThnQ1MwVDdIRVY4SkJuX2ZjYTZfbTJUcmlSOHp3NkdneHR3QnYwenpkU2xiem91N3ZmT0tVMFIzSVlCWkUxUUZoUWhjVW1wYS1vbVlveHpZY183dQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Luigi Mangione unexpectedly summoned to court next week - ABC7 Chicago",
    "description": "Luigi Mangione unexpectedly summoned to court next week  ABC7 ChicagoLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersManhattan DA wants Luigi Mangione state trial to start July 1, before federal case  ABC NewsFederal judge drops murder rap in UnitedHealthcare CEO case  dw.comFederal Judge Drops Death Penalty Charge Against Luigi Mangione  The New York Times",
    "published date": "Sat, 31 Jan 2026 17:47:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQbDhlYmV5Vi0yVE9tSzZtNk5lV2Y0ZXFOaHJybnF0d2paYkFCMGgyQ1h6OG5odklFRklpaHlrM0VRdUJOOFhZWEUwbmV0T0ZDR0RJZ0tiREVyVFRwaFNUZ0ZlQnhwbENTdjBHZDdtMnNfWjdxb05RU2ljakVPcjI1cmJsTVYwSTlzOGxkWXd3QnN1NHNQaElvbUFPaG1UMC0xUkF2M0d6SFRqWEhIN1BzYUlabVFzUjFqMFI0QjZQUTRCS1VTYWV5QUd6azNGNXZyZV9IaFM4VmJzdzJld3ZBdTR0ejYxUGxWc2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "Another winter storm threatens to drop more snow as dangerous cold lingers - ABC News",
    "description": "Another winter storm threatens to drop more snow as dangerous cold lingers  ABC NewsView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 18:11:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPU0JDZ3VNV3MyRENhYVJNTU5yYUFMRWtzdWE0MlZvOHFUd2RidWdWSWFnb1F6c21mdkpid18wY3drbDV5eWszVFRkQzV2RlZKUTBkRE5yNWNTck1BZlFpNmkzX2FCdzZVUXA0SGQ3NTJLSDlDbGdpam5WbkI2dXJoS19valNGOTBWR1hNNHExYnZsRjNNekg5RXp5Y2lDQ0hmY3fSAacBQVVfeXFMTkNDM3pjZ2prZ1dSSEFaSy15U3BEazVSd1liN3I3Y0dLaW5EbmZVbkZETndHendQM2FYLUcxNVZ6eF82Rm93QVZ1MVBpdlhKNlVqVDl2ZHhtWmN0Ty1VQ3luQmRSOHRDVGFaWVBoZm4wUTZNajdSYkRtaExKN0hCc0pXMS1ocjJfOENQc3BkekVSYTJuV2xXMGhXZFdYVXdKLWVwRkRtZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms - CNN",
    "description": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNAtlanta FBI boss ousted after balking at 2020 election probe  MS NOW‘It’s a Five-Alarm Fire’  The AtlanticTulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington PostJustice Department defends Tulsi Gabbard’s presence at Atlanta election search  Politico",
    "published date": "Sat, 31 Jan 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeFhfU0xOTFg5Q0thZWhCWDFzNm5qZzc1YzNSSkxVVl9OMFhKY3YyeFhabnI3UFJSZGVfbW5zcWg5dWtFYVNucVdUc3dJVG51aWFMM3VPOENSejZGYkk5WEw1czVFVU5idS10S1lUeWJ1amhlbEx2TDlyWnR0NGhsTWhiaVNIbDFHUVBvR1BhVktMUTMwU0xBZWdwNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "NC Highway Patrol responds to 100-car pileup on I-85 in Kannapolis - WCNC",
    "description": "NC Highway Patrol responds to 100-car pileup on I-85 in Kannapolis  WCNCKannapolis NC 100 cars wreck | Hundreds stranded after crashes on I-85 in Kannapolis close down interstate  ABC11100+ vehicles stranded in snow after crash on I-85 in Cabarrus County  WBTVDozens stranded on I-85 in NC after heavy snow forces shutdown; National Guard responds  WYFF News 4100-car pileup on I-85, here's what we know as National Guard works to clear incident  WXII",
    "published date": "Sat, 31 Jan 2026 23:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOeHpVSXlOUXcyeVRZRFhoZVl1ZlVCMTNiTlBCcEVFeXo5dmJMSVFPNEl3Rl9UUkxyS2hzTTZOUDV2MXBCY0NnSDg4ZjBxRXZHcWxKQnA0aGx3MEpqVW1HWnhrMEl5Z1NzcnZPalJCSXFSUEJsTXpTVHllS3ctMjl1QmV3OEJYZkc4T2RWV19HbTQxVHM1UVM0bVNIb0Y3QzZLd21fMk51QWNYTTBzMkFzQ2s4bTh1Q1ZZQWJ1c1ppcnhCd2lkblZJbXhRdUV1M3RHbXlJdzFxcE1JeDJjcWJFUndRUDdKVEx5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wcnc.com",
      "title": "WCNC"
    }
  },
  {
    "title": "What We Saw in Minneapolis - ProPublica",
    "description": "What We Saw in Minneapolis  ProPublicaProtesters Rally Across the U.S. in Solidarity With Minneapolis  The New York TimesLIVE UPDATES | ICE in MN: Alex Pretti memorial ride in Mpls, Operation Metro Surge allowed to continue  FOX 9 Minneapolis-St. PaulJanuary 30, 2026 - Minnesota immigration and nationwide protest updates  CNNAnti-ICE protests take place nationwide following fatal shootings in Minneapolis  ABC News",
    "published date": "Sat, 31 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1xMXd4dTE5aVIyaFp0dC1vV2t0cmswdmV1cl9xSEJDN01LRVpfMWVsUE9oU2paUmg2OG1HMkhwbEVleDktTGtySDMyV1RoaHM1X1A2dWxiU0Z5ZFQwZUpqNXlSS1FNdjZhaDBiQWlMU2MtLURxWG40RTdPeUlJanc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "1 year after deadly Northeast Philadelphia plane crash, inside 10-year-old Ramesses' road to recovery - CBS News",
    "description": "1 year after deadly Northeast Philadelphia plane crash, inside 10-year-old Ramesses' road to recovery  CBS NewsOne year after the Northeast Philly plane crash, ‘eerie,’ ‘devastating’ scene still strong in neighbors’ memories  WHYYPhilly medical plane crash anniversary: 8 dead, 22 hurt, lawsuits filed, community remembers  FOX 29 PhiladelphiaCommunity reflects 1 year after deadly Northeast Philadelphia plane crash  6abc PhiladelphiaPhilly will mark grim first anniversary of plane crash with a remembrance event  Inquirer.com",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQQ0phTmFnc0p5TmNkUDRQUURmZmVKVVduT2MyMHQyaFI3V241ekZSX0tiajBoOFBfSXNTNWh0eE4wbGRZVndwNjZ5QXBScUZVMjhHcEt6LTdPSjA2cnF5Qm00c3dVR3hPNUR4Z0MwY1ZvY3RCUV91QWF1VG5OWkxTajh5TVRGcjBGMTVLOEluX0hWSXAxVlNrVl9kbnBqVERSMzRvMUVLRDlqbUZDY1h2eTE1dDh1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "The West’s water war arrives in Washington - Politico",
    "description": "The West’s water war arrives in Washington  PoliticoFate of Colorado River hangs in balance as political battle brews  The Washington PostWhat happened at the governors summit on the Colorado River? Here's what California said  CalMattersWhat's at stake as Utah, 6 other states seek new Colorado River deal  KSL.comWill federal intervention save the Colorado River from federal control?  Deseret News",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdW1TMnJxNDQyTmZNVVFxd2dxek5GTDhXNzNPakhCWVhvVFdCaFJRT0p2eld4TXhlNFZKMmE2Vm9BWEFDUFEwNkNBTFFkVjExRzlkYkR0aGU1YlJKU0xuZkt0ZE16cEdsVngzOTZNUzluNVhqdHdvUERUd1Y1eTVZOTN3cmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Hundreds of Texas public school students walk out to protest ICE killings - The Texas Tribune",
    "description": "Hundreds of Texas public school students walk out to protest ICE killings  The Texas TribunePhotos: Protesters flood S.F. streets for ‘ICE Out’ strike  Mission LocalBay Area protests live updates: Thousands take to SF streets to protest ICE, Trump  ABC7 San FranciscoSCUSD students hold walkouts Friday to protest immigration operations, policies  KCRAWatch the walkout: Palo Alto students say ‘Melt the ICE’  The Paly Voice",
    "published date": "Sat, 31 Jan 2026 03:24:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQkR4Sk4yWDBvYV9SaDJKRGVwM0JEQ3hJR1l2TTBJV2d1RFFqUDR4bkNHVGVpSG5wdjZNaV9BalNUT1pRRUJwWF9uY1o3dURSVlFCMEcwUDJ3bk91T05WSV80ZWU4RmV0dzlza2pmYnNnRU5nM1JCbEVIUG1xdlJrMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Gas leak caused blast in Iran's Bandar Abbas, Iranian media say - Reuters",
    "description": "Gas leak caused blast in Iran's Bandar Abbas, Iranian media say  ReutersBlast rips through building in Iranian port city of Bandar Abbas, state media says  CNNAt least 1 killed in Iranian port city blast ahead of Iran's naval drill in the Strait of Hormuz  CBS NewsExplosions in Iran Spread Jitters and Rumors Amid Anticipation of Attacks  The New York TimesExplosions reported in Iran, Israel denies involvement  Euronews.com",
    "published date": "Sat, 31 Jan 2026 12:10:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNQ0JlS1BkVW54dTluaUEwYWJ6amkxUmtLcFl1dHZiOEs1Z3V3Wm1CTGV2QU1UMzNzM3gxendlUlc4T0xBbU5hNkVZbko0U3djMi16N2Y4cEFXMFoxbWVaX2l4QVBMNE5xRTdhTHJtSHZTWElieUxlMzByWUdTT09nX0o0VFg5S3l0dl9DazljRlg5aE9BOTZJVEtyeGROQVBOeEk1dGZLQVNQeS1jUWtEUHJpelAyT1dvWGV5ajZGNWhsRWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "North Texas voters to fill vacant Texas Senate seat - The Texas Tribune",
    "description": "North Texas voters to fill vacant Texas Senate seat  The Texas TribuneLive results: Texas state Senate runoff  The HillLive election results: Taylor Rehmet vs. Leigh Wambsganss in TX Senate runoff  Fort Worth Star-TelegramFort Worth voters to elect new state senator on Saturday  NBC 5 Dallas-Fort WorthRunoff special election in open state Senate seat in Tarrant County receives national attention  CBS News",
    "published date": "Fri, 30 Jan 2026 23:38:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPQUpXSE1qREFXd1NhWnZDSDBhbzk4R1FFZFluQVZPNUZON29vTGIxbktGdTd4a3NkRVgyNlFhRXhVR0tseUJCLWlXVjRsVjR4MllCdVB1UE05LTg1TXFXcXJnVUZZTUFpeU1waklnNktsSG9IQlZ5LVVlXzFaSFN4M0tJb25rNW84emJzSXdpaktGTDd0U2RUQzFQLV9VUUNpX0VOMUt4UEtLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach - NPR",
    "description": "Milan protesters call for U.S. ICE agents to leave Italy as Winter Games approach  NPRDemonstrators in Milan protest ICE unit at Winter Olympics  ESPNAnti-ICE protests erupt in Milan ahead of Winter Olympics over planned agent deployment  Fox NewsWhy is ICE at 2026 Winter Olympics? Explaining the agency’s dual functions  The New York TimesUS sending ICE unit to Winter Olympics for security, prompting concern and confusion in Italy  AP News",
    "published date": "Sat, 31 Jan 2026 20:04:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNa2N2TVBSQzZnTDB5SDRjLUZmd0t3OUQ3NHgycEtadGVQdDFFdlVaZE5TZXFsNHlJeGZZM2E4dVhWMVRuZmRaRS1yY1F5aDdMc1NHbWh5UTUxaEtzcElPeXRxQXRoMHZpa2dleG5lRmcxaTdmbDVfMHZ6UW1FQWJCZnVZLXJxMkswd0xocm1laTJQeHNzVFU4TXljRDFSYlNuS1JHVDJEcnh2dVJQa3BDWmV2UkdwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls - Politico",
    "description": "'There’s something bigger going on': State election chiefs rebuff Trump bid to seize voter rolls  PoliticoOpinion | What Pam Bondi's demand for Minnesota's voter rolls is really about  MS NOWRead Bondi’s Letter to Minnesota’s Governor  The New York TimesGOP Opens Up Its Midterm Elections Playbook in Minnesota  The American ProspectBondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’  CNN",
    "published date": "Sat, 31 Jan 2026 19:36:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMG9kWm9STGxkdEo4WVlZcGpfZUVxOVlLd1I2WUMxM3VKLXlZcVdZOHQ4S1dTT29Ma0ZuenFiNXBLVHJ0XzVEZFJIWjhhOVl3dVRTT1BvN2JEU216SGpvVEhlc3p4WDIwT2owSG03S0J3S0QtUndnbXppTm1Hc2V1WFp3ZGtYSzByQlBQZjRQaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response - Politico",
    "description": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response  PoliticoGun Activists Bridle at Suggestion That Pistol Justified Killing  The New York TimesThe Second Amendment Was Never Meant for Everyone  The InterceptIs It Legal to Protest While Armed? First Amendment Analysis  Freedom ForumWhy the Minneapolis killings have driven a wedge between Trump and pro-gun groups  The Guardian",
    "published date": "Sat, 31 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPbTExR1hNVXdpV1g5OTZvQ291Z2h2WjRpRkN5a3d2cVp1c3lIcmM0bWR3VWtFaG1wUW4zYU03VXUtYUZHUUQwbG9qbUtfNzhuVGNBQjBSSEpsTzFFc2RGSGlNbnV2UVEwNDlWU1VVcVc2UnBpM05OaEd2X0FfSmVIZFcyTkNsVEtLY0UwcTdNWHV3dXlaLWFtMWFnVkJiQUJTZi1RNXB1aTB5VEQtazZfU1NDRWw5dHFqcElmcEpiMUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump continues to defend Homan, Noem amid immigration enforcement backlash - ABC News",
    "description": "Trump continues to defend Homan, Noem amid immigration enforcement backlash  ABC NewsNoem says her response to Pretti shooting may have been wrong  PoliticoTrump’s New Method of Humiliation  The AtlanticWhy Democrats won't rush to force Noem impeachment vote  AxiosTrump backs Noem amid criticism, resignation calls  The Hill",
    "published date": "Sat, 31 Jan 2026 18:23:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUms1OUN0U3NGaUMxb3FIdExlTHZUS194WFdpbndLT3pTYTZCVERhVHFZMHJSVTdUVGhFcW0tN0N5TXVuUHlQNnFMOElXenpGRWpmZ3o0SHBzWFJobnp1eVJVR0VabmljdnJmQ1E2RFdPMXFmRFFTMjBteG1DeGdwbjB3dTVVX184dldjdno1VG00VENkemh1SEt1dm1YVmNRZDhjdkxaY1dyVi0zaW9uOUE5Z9IBuAFBVV95cUxQem5fMnE1cFdnaG5xOEVIeER6T2ZRSC02VVJtTUZpX0JjT3JWMUdfWE5FN0lja1NiTEM1R0c2V0FnbTk2cS1kOGJBZkl5Snd1XzYzQjdSbUdrRnc1WnNNc2RlcERTdTM1RVhXMGhla1Z4cHZ2RVZGbGh1QVNxaFZDbnN6bGNaeDJ0U3h6ck53bl9qZTNZTW1FY1poTWd3eG1ORUxzZnM0VWhzZFp3QVJaaXBaSTM0a2NK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "‘Backing down isn’t an option’: Minnesota ICE shootings mobilize Americans to join ICE observer groups - The Guardian",
    "description": "‘Backing down isn’t an option’: Minnesota ICE shootings mobilize Americans to join ICE observer groups  The GuardianThousands of new ICE watchers hit the streets after two killings  The Washington PostAttorneys urge people to know their rights amid reports of abuses by federal agents  5 EYEWITNESS NEWSHundreds gather for constitutional observer training in Moorhead  InForumKnow your rights  The Austin Bulldog",
    "published date": "Sat, 31 Jan 2026 17:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPd1FkTGJiS3lhSEFIV3JVdmdjOFB1ekhtQ0REZEc1eTBYaVhPVTYxdjZ1MFlpcU8tM3N3S1Z0QWJDYnBQbzRyV25pQzRLTlZnMklVdTQ0WVNfeFZvYXh3eTJ5emZ0ekIxamZOUnhJNk5sbVFwUURTRk5OeWd2RVlYUV9oWUhTcDVvM2ZjMjJsa05odG8wMnlLaUM0ZnBzZnhCaFN4eUNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  }
]