[
  {
    "title": "Person Detained In Nancy Guthrie Disappearance Case—Police And FBI Agents Search Property Rio Rico - Forbes",
    "description": "Person Detained In Nancy Guthrie Disappearance Case—Police And FBI Agents Search Property Rio Rico  ForbesNancy Guthrie Live Updates: Man Detained for Questioning Is Released  The New York TimesMan detained for questioning in Nancy Guthrie disappearance reportedly released  The GuardianFBI releases surveillance photos of masked person near Nancy Guthrie's house  WESHWATCH: Man detained by police in Nancy Guthrie search speaks to ABC15  ABC15 Arizona",
    "published date": "Wed, 11 Feb 2026 05:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxNRlo3Y0hob0szZGVJaHBMR0pKNGdBQVFRNXdFeEswRzN1WXBlekp3RENnWDd0ME1kVmFRUDM2b2k4amdaeTczY1pNb1RfVjJZSUQtSnVfc05XcmpkUlFFSXZsU25fcXozci1uLVdFWGVyamtEWTJHdVBUZkFBMmpOMDg2Tkh1RC10QUJZR2QwRG5zRkdTaEhQY2VCYVJraEZxYWZreGJ0Ml9nVE40TlRpRzdfNXhJcm5JNTVGZFNIVnRUTmUyV3piNFlfdlFFODE2NXJBd3pRRW12TkxXbjFxYVFtcW9Ka2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "FAA Lifts Closure at El Paso Airport: Live Updates - The New York Times",
    "description": "FAA Lifts Closure at El Paso Airport: Live Updates  The New York TimesReport: FAA lifts El Paso airspace closure after Mexican cartel drone breach  KFOXFAA lifts restriction that would have shut down Texas border airport for 10 days  PoliticoFAA closes El Paso airspace for 10 days over security concerns  CNNEl Paso flights grounded as FAA cites security reasons in 10-day airspace ban  El Paso Times",
    "published date": "Wed, 11 Feb 2026 14:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9vczhYQTh3ZUJTRjlEUUJwRFR1aEpNM2hUNGI5aVA2TW9JeEI2Z0FLZG53bWlDNGpETEhRWHhIaDlHci1LdXVBTm9Uc3NaOVRFX0FKdDJ2S2xJbVplS1kxc094aG1Cb2lVcTJVbEgyTEFBR013cDZOVmxB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Across the South, Residents Grieve for Thousands of Storm-Ravaged Trees - The New York Times",
    "description": "Across the South, Residents Grieve for Thousands of Storm-Ravaged Trees  The New York TimesIce storm causes fatal crack in 100-year-old oak tree at Nashville botanical garden  WSMVNashville parks face long recovery after ice storm, 6K trees downed  The TennesseanTennessee volunteers are helping families clean up yards for free after the devastating winter storm  News Channel 5 NashvilleOfficials encourage residents to move debris now  The Daily Corinthian",
    "published date": "Wed, 11 Feb 2026 10:02:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBhTFlsZHR6SFJlMGU0N2VyZllZOUNMVWNIS1c4X3VfX05FNklxR2VITlItZ1MzakJIVFQxZ19wMnh5N01HTEZmY21HakMxcTRyRVNuWTB3NExJbXM3eXVXZjdGNEtZWGhEVEJXdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge - CBS News",
    "description": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge  CBS NewsBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressFact check: What Trump got wrong and left out while threatening to block the new US-Canada bridge  CNN",
    "published date": "Wed, 11 Feb 2026 11:18:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOLW5lRVpFamVDd0tZaGMwbFg0dktyXzFKNHJXbHRGeVQ0VEFsNVB5UVFsMUtZVkc1LS10LWxlUTBoUlpfZm1SazI4NUhqRDVnUnRQeE9CUjZZVXI1Q3NSRDkzWDVOZmd4d3R2UHhOeUNOcE9xb0prU1I4S0o2U0tSTW1LWUwwcHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "How the SAVE America Act could make major changes to voting - PBS",
    "description": "How the SAVE America Act could make major changes to voting  PBSGOP Sen. Lisa Murkowski comes out against Trump's election bill, with a warning to her party  NBC NewsRepublicans are pushing to drastically change the way you cast ballots  The Washington PostTrump touts bill that could make voting harder for married women  USA TodayKey House committee advances nationwide voter ID bill, setting up 2026 election fight  Fox News",
    "published date": "Wed, 11 Feb 2026 03:09:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQYUFFSnYyV2VmRjlRZThIR0FZYUxBSjJzb3lZaVZCeElQbDFjdFlydG5mS0QzWEtBMGo5SFE1SmJHWmdpUHlYRm5FQXFJbG15ekdnYXNXdW1BM0xnUUpDM3ZGR3RlaWVWdDhxMjdjclQ4ZXR1ZmV6LTJsOXN2S21mcllITzc4X2l3R3RTVXgzVVA2N1ZRZXQ3MUQ1bi1YZ9IBowFBVV95cUxNWUtFek9MeFlCX3ZWaGh1clRKT0NPaldaQlpfcHpNQ25oemVXMkV4QUpLRXh4dE5lYnBJRUUzZ25LLXhKUEZtU2NSTDZFQlFXZVJYVTBEOURCazMxN0Rhb2RRSzZrYXVHYWNPdHNDMXAxT2tROFZwdldvS0FNRFJWa2liMDJ2dmQ2dVF4bHpPckdwbHJjcnNDYU9YWDFqdFZDOV9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Late Night Mines Trump’s Million Mentions in the Epstein Files - The New York Times",
    "description": "Late Night Mines Trump’s Million Mentions in the Epstein Files  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldEx-police chief said Trump told him in 2006 'everyone' knew of Epstein's behaviour  BBCTrump told police chief 'everyone' knew about Epstein, FBI document says  ReutersHalf of Americans think Donald Trump was involved in Jeffrey Epstein's alleged crimes  YouGov",
    "published date": "Wed, 11 Feb 2026 06:31:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPeFlLRUM0VkpyczlmMS0yZGdqa0VDMFdVMVpaMkJHYmtSbzF4LWtZYzdlRV9RLXVZZ2lLSU5Da2NGWnZNNFVkaDl4eU4xSFdocV84cXdGOXVUMF9Zd1hTZlJaNUtpdGlJSFpOOTd1M0puWi10UXF3a3N0d3JaajNNSzdSNmVNcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Slotkin slams Trump admin after grand jury refuses to indict Democrats over military video - Axios",
    "description": "Slotkin slams Trump admin after grand jury refuses to indict Democrats over military video  AxiosGrand Jury Rebuffs Justice Dept. Attempt to Indict 6 Democrats in Congress  The New York TimesSlotkin knocks Trump administration after grand jury refuses to indict in ‘illegal orders’ video: ‘Embarrassing’  The HillD.C. grand jury declines to indict six Democratic lawmakers  The Washington PostTrump administration fails to indict Democrats involved in 'illegal orders' video  NBC News",
    "published date": "Wed, 11 Feb 2026 06:19:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOQlR1d1gzUTlnU2tKNDhPNzkxdzllQnI1dUxvaDV6bWoyNjd1M3ZPQjN6bFc2YTdOdHdjMkMzUjBPT0RYWmYwd05SanNqRVk4Zi1HOW1DZEFiZzVjYTZMclpUSlJHR0F6b1U3ek9ySGd4OHVtVG9ucFhNWUMzTVNLMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs - CNN",
    "description": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs  CNNHouse Republicans break with Trump, blocking a bid to protect his tariff authority  CBS NewsAfter GOP rebellion, House set for Wednesday vote on Trump's Canada tariffs  CNBCHouse Democrats plot barrage of anti-tariff votes after stunning GOP failure  AxiosHouse Defeats Republican Bid to Block Votes on Trump’s Tariffs  The New York Times",
    "published date": "Wed, 11 Feb 2026 04:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOMklDZ2gtRkYxS252dkhFVG56Q3dDdV9FYUY3ZVZOVi1iczNJRWJLWURJV2lONlZCRENic3J4ODhlcmNQNzIzLWI4QXlaUUhxNmJlU3FYV3VSNFNMbTZnWS1CYU1yV0FHcVVPUVcwaDA5VlBTSXpJTmpBbUxIeThoY3VB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Pam Bondi to face questions from House lawmakers about her DOJ leadership - NPR",
    "description": "Pam Bondi to face questions from House lawmakers about her DOJ leadership  NPRAttorney General Pam Bondi to testify before House Judiciary Committee  CNNBondi Expected to Face Scrutiny Over Release of Epstein Files  The New York TimesCongress should ask Bondi why Blanche personally met with Maxwell  MS NOWWhy Dems think they have the upper hand at Pam Bondi’s big Hill hearing  Politico",
    "published date": "Wed, 11 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQa0Z1MGtWRDBHVGRNa0h1SHVMV0JtbUs0cXo1eE95MEE4TnlzelB2QWtUUWRiRU9QOWNSOUx0Z28wZjl6U3NaU2FQRnZ4cGFEQl9fZnF1UnRXejVoNGtERHJTLUV2bE9FcXBSc052Z2taQUN3Q1JhcnE5TWd4T3VkdzRjcl8xR3ZkMEJzUW5iVTdFOUYzZlY5MVdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Democratic governors pledge to boycott White House events after a Trump snub - Politico",
    "description": "Democratic governors pledge to boycott White House events after a Trump snub  PoliticoAnnual governors' gathering with White House unraveling after Trump excludes Democrats  NPRPritzker joins chorus of Dem governors boycotting White House dinner after snub ignites 'chaos'  Fox NewsTrump Is Hosting Governors at the White House, but Only Republicans  The New York TimesDemocratic governors threaten to boycott Trump dinner over exclusions  The Washington Post",
    "published date": "Tue, 10 Feb 2026 21:53:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOV3dZSmZ4Qk4wM3M5NXFzT1dyZmY5cUQ2M2plMTl0cVlNeGwtU1dCUE5CckdDS0ljM29iUmxnX2NXd3pkbzBhY0JUZmdRbV90bU9NbmpVVzJ4b2J4dFNFaFQ5ZjYzVy1LZDdYVEttcDhZWWhYRENIMEhhRXhBTW0tVTFlelhmRkFlVzNYSw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims - NPR",
    "description": "The FBI seizure of Georgia 2020 election ballots relies on debunked claims  NPRGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesBreaking down the evidence DOJ used to justify searching a Fulton County elections office  CNNFBI cited debunked claims to obtain warrant for Fulton County vote records, documents show  The Washington PostJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  Politico",
    "published date": "Wed, 11 Feb 2026 00:37:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOempoOWp2elFncUJyS1VfWG9NTEV1aVFvN1pvV09jc1I5c3VQZ2lwV3I2bXBPY3RfVXpMTFlSTWtDelRsVjYyRzBibFhZSWtJNHFNV1hBQmF4NHpIQTVQdTRvdlhMSnRpejBZMTlwYkhsODZLSVRFOEdHazBDN3Q4Um1aRTF5b2UwSHo2bzAtTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "ICE chief tells US House agency is 'just getting started' - dw.com",
    "description": "ICE chief tells US House agency is 'just getting started'  dw.comICE and Homeland Security officials testify before Congress  BBCTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoTop 5 takeaways from the House immigration oversight hearing  NPR",
    "published date": "Tue, 10 Feb 2026 20:21:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQQlg0TUVMcGNaZ210d0Z3TmdYMktRYVNXRjhTamZrNWU5blVkZDVKeXdJRU8tOUFSTTZ5NjRrRFoyYThpVkdkRFhOMXQwOEJBdXd3bFhLUlNuNk5VWXFIcGhTX1poaEg1ZmRtYm9GYjdIVm9oZTFzMVBPOHBoYUtROUhzd0tvaTVzc0xKZUZqd1lSQdIBkgFBVV95cUxQNjY3Vm1kaUxzVDhLXzRKeW1xdWg3ZmxRakZKSEs5V0dSRG8yZjllMTlVMHBLdVlmaFdWR3lrOXB0d3BoaGRvYlNuT05fX05VMThid0FWYmF0UURneEpWSThpM0dxbDFMTWk2YXZrcE92WUY4Rk5zaDFyTWRUdkdEZm52Nlc5bDJaeE8wQUtVYUxPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Sherrill endorses Mejia in special election for her old House seat - New Jersey Globe",
    "description": "Sherrill endorses Mejia in special election for her old House seat  New Jersey GlobeAnalilia Mejia Declares Victory in NJ Race After Her Main Rival Concedes  The New York TimesAnalilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage  CNNWhat's next in New Jersey's special election: From the Politics Desk  NBC NewsWhy is a moderate Democrat’s primary loss being called an AIPAC backfire?  Al Jazeera",
    "published date": "Tue, 10 Feb 2026 17:43:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQWHdYZEgxYmdTaXVDcTF6akoteExrWjhmYTBlYXl3WVhSa0xadkNWQXg2UHpSbDJGR3A0UURoMXVHTkhGRmsxdFJzbVdNWEpDelQwWV9VTmM2VElENkRJanphTzFLRmxTek52ekZFTXhGRjktS2QwMm1VU05CU1NLUmZQeTl3OHF3QWsySUN2SldFUTFWQkc1N1V5R2x6Zy1yd1dRcmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://newjerseyglobe.com",
      "title": "New Jersey Globe"
    }
  },
  {
    "title": "Who are the six men named in the unredacted Epstein files? - The Guardian",
    "description": "Who are the six men named in the unredacted Epstein files?  The GuardianSix men named in US Congress: Why is so much redacted in the Epstein files?  Al JazeeraFebruary 10, 2026 – Trump administration updates  CNNJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC NewsU.S. lawmaker Ro Khanna names 6 'powerful men' originally redacted from Epstein files  CBC",
    "published date": "Tue, 10 Feb 2026 20:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcXZzUG8tUUdadGx5MU90ZWx2emRnRHpMLXkzcWdfQm1BNUlsUS01NHZ6VEt0SzI2LXNaZ0MwMm92d0RvWGtLYnZ0R1JSejhCYXdwckJMbm1MbUIyb0JwbjFvR19hb1FIRHBpb0wtVmlPamkwVE9RSW8tbzZXZDExU1A2eFdScWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond - Axios",
    "description": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosRevelations in Epstein Files Lead to Resignations and Investigations Around the World  The New York TimesCould the Epstein files bring down Keir Starmer? – Full Story podcast  The GuardianJeffrey Epstein’s Bonfire of the Élites  The New YorkerThe Epstein files might bring down a government. Just not the US government.  vox.com",
    "published date": "Wed, 11 Feb 2026 01:29:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPRHZ4Q3hqTjFQbDhUZ244a2dFaHJOWUJrSEo1TExQdEp1dDBhckxhZWVfQ1pySU9PTmZCRFE2UlJhNktpUDBFRjlNM1B0SXdiZ0hjLXlzYWNNc1hFTlZsZ282dzhKcm9xa0VxbGxZcDIwejQtdXc4cEk4dWVoNlJtVFFWVkRiUDJQMnBkM21kVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too. - Politico",
    "description": "The White House is shrugging at Lutnick’s Epstein ties. His foes are too.  PoliticoLutnick’s grilling shows Trump a glimpse of a grim possible future  CNNLutnick’s Flip-Flop Deepens White House Epstein Woes  The Wall Street JournalLutnick Acknowledges Traveling to Epstein’s Island  The New York TimesHoward Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties  ABC News",
    "published date": "Tue, 10 Feb 2026 23:14:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBaenVnUWNUWE5oNFVqZWw0MVJZXy1pRHg2aWxFMFZNOTZDMUlMN0FmMGs5ZlRMeUROa0dvckNSZmF2Y3paZGpnQmxicVN1US1DQXNKRy02eFRBcjg4azhySWl3YmtYUURoUlVadGtvaFM3Q2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump EPA set to repeal scientific finding that serves as basis for US climate change policy - AP News",
    "description": "Trump EPA set to repeal scientific finding that serves as basis for US climate change policy  AP NewsTrump set to gut U.S. climate change policy and environmental regulations, White House official says  PBSAs the Trump EPA Prepares to Revoke Key Legal Finding on Climate Change, What Happens Next?  Inside Climate NewsA Campaign to Revoke the Endangerment Finding Appears Near ‘Total Victory’  The New York TimesEPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health  NBC News",
    "published date": "Tue, 10 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNNnpBUk90WWwyN3hUWHN6bWNiWWxiZFRGeC1vSVBjQUx0NW5rdzgzRENxTHpmRW05UHRkRTBscEZzdUVkN1FPaWlFZVNpSV83OUhWNFZxM2FjMVRZQ2szS0R5bEYwT0h1SlROZXVHLWYxdUhaT1lWdGMyWXpESERTbzFDOTJSUU8zdk1uQW5sS3N4TmhsSDc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it - Politico",
    "description": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it  PoliticoPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesTrump administration removes LGBTQ+ Pride flag from Stonewall national monument  The GuardianNYC officials vow to fly Pride flag at Stonewall, after Trump admin takes it down  GothamistTrump admin removes Pride flag from Stonewall National Monument  CNN",
    "published date": "Tue, 10 Feb 2026 18:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOHJGakFVUFN1TzFTS2VYT2JoUGRxTy1YcVpKZkZLMmt0ZWNrUEx0bWh4aDBZNHpyRGxJNGJvN3ViX3FxMk9hSml3MDNCa0FBbzN2blBNVGFyYmM0bkxJSjhxa0VieHpielpONEFvV0hiT0NhQWVXRVZUdFNaWlItUDVzcU1EZkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]