[
  {
    "title": "Jesse Jackson, a leading African American voice on global stage, dies at 84 - The Washington Post",
    "description": "Jesse Jackson, a leading African American voice on global stage, dies at 84  The Washington PostRev. Jesse Jackson, a civil rights icon, dies at 84  NBC NewsBernice King and Al Sharpton are among the leaders paying tribute.  The New York TimesJesse Jackson, civil rights activist and presidential candidate, dies at 84  PoliticoRemembering Jesse Jackson's iconic 'Green Eggs and Ham' 'SNL' cameo  USA Today",
    "published date": "Tue, 17 Feb 2026 16:45:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWDN6UnVmdlc1SHlHQzZXZ3pKem9obzdmZlN1Wk9hZkNNckU1UVo5UnZlMjdiNTU0Q3F0TkZpQ013X2V1V3hadWZMS21DTjVpY004NlhWa1BWbHptRWxlQ284Z1dmNnd1OEVTZWpaTEd1ZmwzUkNWelVpSURIVFl5YWRLVFZJRkZEemRybWl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Nancy Guthrie's family members have been cleared as suspects as search for missing mom continues, sheriff says - CBS News",
    "description": "Nancy Guthrie's family members have been cleared as suspects as search for missing mom continues, sheriff says  CBS NewsNancy Guthrie latest updates: Family cleared as suspects; Savannah pleads to abductor that 'it's never too late to do the right thing'  YahooAmateur detectives and a new kind of journalist descend on Nancy Guthrie case  USA TodayLive updates: Nancy Guthrie’s family members aren’t suspects, sheriff says, as FBI checks glove DNA  CNNMask, clothing worn by suspect in Nancy Guthrie's disappearance believed to be from Walmart, sheriff says  CBS News",
    "published date": "Mon, 16 Feb 2026 21:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBmTmp4OGZkRVJDYnA3U2VUc0pwcmd6cnZzS0hXMDFxSmdVRnprT1cyMnJxLXV1cFdHLW5sdkQ2VC1NdkpNNmZtVzFuQVhOMDhEb0I0cVNPR1FlbE4wVG5jVGVyNFY1WkxkakFOaUJUX3I1bGVHV3VfNzlR0gF_QVVfeXFMT19Gd1pReHZkaDRadmVxUkVlNzBVbWlZT0lpd3RyX2MyTkNLdEtYY0lLWWZoa0liX3JLcHk5d0VDMnAtX0VOOGJvSDdIdnp5MUZ1Y1Z3ZXNuR0tOaExheWxZa2ZtaXdxWGRvNHl0MFhmUUFtVHRCRE1PTjZHZ1hIcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Colbert Says CBS Refused To Air His Interview With Democrat Candidate Fearing FCC Blowback - Forbes",
    "description": "Colbert Says CBS Refused To Air His Interview With Democrat Candidate Fearing FCC Blowback  ForbesColbert Doesn’t Give an FCC About Calling Out CBS  The New York TimesColbert says CBS scrapped his James Talarico interview after Trump FCC’s threats  CNNColbert defies CBS over interview with Texas Senate candidate James Talarico  AxiosStephen Colbert says CBS didn't air Rep. James Talarico interview out of fear of FCC  NBC News",
    "published date": "Tue, 17 Feb 2026 07:21:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPTlJaZzlRcWdJSWhtSXlIV2ZhaHhmREZtdnZqMUdkWFduZ1BTQW9ka3R5X0Z6TGRHQXlISWlSXzFTbFZDTklWWGJMZDFZc0c3SU5ISmZjaE5BZVRwOGtuQVdhVXNwUUFJdzRCbEdXX2twb21JZUFYd1BEMXZqM25qMXNVZGNLMDdsZ2Jkem8tTDJKU1VvMG9VN0RaV3RfRV8tZktvUXBrZkZZdndqTlpJS1I0YkE3TUZKWGxyVldLVGhETzdPSGhVc19oQnp1VGpra3VJQkpyX09jS1d6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Why Congress failed to reach an Obamacare deal - Politico",
    "description": "Why Congress failed to reach an Obamacare deal  PoliticoA single mom's ACA premium jumped from $3 to $164. Now she's skipping her medications.  Business InsiderThe Misleading Chart That Killed the ACA Subsidies  HEALTH CARE un-coveredNEW REPORT: As Open Enrollment Ends, GOP Price Hike Pain Begins for Working Families  Protect Our CareNY woman's health premiums spike $10K after Congress let ACA aid expire  Lohud",
    "published date": "Tue, 17 Feb 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQd0NucEYwQXRBN0hEM00tQWNydldiRU94cWJuSGszcDBCYWw4S0F1blVaY0h2Y25SVkRueGRZSTF2T2FTRG0yTldDb3F3Nm1nX2JwLWNVZ2QzbW1wX1M2NDlNZk1VbmNWa2diSWFiU1RkME5wZGRtZkhSM1ZpaUxPR3FoU2VfQmU3YlBoVU1kTEJNN3BDZmZScXdvZTc3eG9uUDliOGszMWY5V3ZjZmdUN1pqeUJJSVViQ1BxVzh5UFBudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Coast Guard Brass Secretly Fume at ICE Barbie Over Jaw-Dropping Order - The Daily Beast",
    "description": "Coast Guard Brass Secretly Fume at ICE Barbie Over Jaw-Dropping Order  The Daily BeastNoem's use of Coast Guard resources strains her relationship with the military branch, sources say  NBC NewsKristi Noem is using Coast Guard aircraft for migrant deportations irking branch’s top brass: report  The IndependentNoem Pulled Coast Guard Plane off Search-and-Rescue to Deport People  YahooCoast Guard morale 'terrible' as Trump DHS head 'puts so much stress' on branch: officials  Alternet",
    "published date": "Tue, 17 Feb 2026 12:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPNHVDR3lKb2NFazQwb3VleUlSOE5uYWxQUEpTOVUxMzNKempUSEZ2WTk0dmx4ei1Hd3k1TVlKXzNXa1JlRkxJTl9qdXVZTG9mVlFza0RxdGFiTGtETS1FY0lXSlg0UlNyYXJGNkhDdElGdlR4U0dzVnljb29EeGhJYnBJS0VESGFIQWRWaVNJdGVIQVFuZ3JvcFhfVEJvNklGRnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Whirlwind day of diplomacy as US holds talks on Iran and Ukraine in Geneva - CNN",
    "description": "Whirlwind day of diplomacy as US holds talks on Iran and Ukraine in Geneva  CNNIran foreign minister says progress made in nuclear talks with US in Geneva  ReutersIran says progress made in nuclear talks as supreme leader warns Trump over military buildup  NBC NewsUS-Iran talks live: Tehran says understanding on main principles reached  Al JazeeraIran, US Meet for Second Round of Nuclear Talks in Geneva  Bloomberg.com",
    "published date": "Tue, 17 Feb 2026 16:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOb2tXRTFDNEU4YnRsblFuZ01UaFNCWVpUT1JUWEZJa2JHZUFFMGQ1NWxqZXJUV29yMFNWZFYxbGUzX20zckpKVEdzbGdvWXdkaG5Ic2hkem9sOTFFeW9wb0JBdGJyX043TGRiTlBOWTRhY3FfMkpUMFl0Zy1VMDNLLTdhQ28ydw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics - NPR",
    "description": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics  NPRDHS watchdog warns shutdown could imperil immigration enforcement oversight  PoliticoSenate Democrats send counteroffer to White House amid DHS shutdown  The HillThe Case for Keeping ICE and CBP Defunded  The American ProspectLive updates: Partial government shutdown over DHS oversight seems poised to drag on  AP News",
    "published date": "Mon, 16 Feb 2026 12:13:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNTVNGekdEdlBucXM1UF9NakV2M2dzXzZTNmFYa0xKQnkwcWtMS1c1UURJcGVUZlZ5T0J2ODlzNE9kYzZfT1U1WDVIWmtjMG1CcnZDVEVuQlo0MDlkeXFtWUxUek41RUswMXpkOXZwU2syV2xWUlFwTkZhQmNmVTF0WGhmeExMcTN2dGx3bnc0UFloZHo4cHNGbHBZZUQ1VS1uU3JBeEw3TTFicXBveXlvQ1Vpa19DSVV1a1RmVmh6YkxBTGJDUlBJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Hillary Clinton accuses Trump administration of Epstein files cover-up – US politics live - The Guardian",
    "description": "Hillary Clinton accuses Trump administration of Epstein files cover-up – US politics live  The GuardianHillary Clinton accuses Trump administration of a ‘cover-up’ over its handling of Epstein documents  CNNClinton Accuses Trump Admin of Epstein Files 'Cover-Up'  Time MagazineHillary Clinton accuses Trump admin of Epstein ‘cover-up’  The IndependentHillary Clinton accuses Trump administration of Epstein files 'cover-up' in BBC interview  BBC",
    "published date": "Tue, 17 Feb 2026 14:15:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTnYwaHRHSDVpUTNhdXlIdXQ1MEl3Ym1ybW5VNU5aX09OQXlQNGRFQUFwTC1DSldnVE8xMVd6WEROM0dMR0NOdlZPUHFBeURSRVZKd3V5OFYtdk5maDJnOF9nQTlDcFVwdWh0V0pYcEdUYmVJVldiY3pWUUdMZnlRUmlnWWhOY0loMFMwTDg0VEFaa3ViZG5pZE1BT1o2cF9mNk13QldXWGVPVkdlbWpJeWNUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Judge orders slavery exhibit to be restored after Trump administration removal - The Washington Post",
    "description": "Judge orders slavery exhibit to be restored after Trump administration removal  The Washington PostTrump administration must restore slavery exhibit at Philly's President’s House, federal judge rules  WHYYCiting Orwell's '1984,' judge orders Trump administration to restore slavery exhibit it removed in Philadelphia  PBSJudge orders Trump admin to restore slavery exhibits at President's House Site  6abc PhiladelphiaSlavery exhibits must be restored at President's House Site in Philadelphia, judge orders  CBS News",
    "published date": "Tue, 17 Feb 2026 07:58:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOblI5eFlCN2oyMU9ObGQxT2RuLVpJeVpFbGZEUXh2WFJKWFZmOWJRM1JHb1htb285WWJZY3FaT2VveWt6S3A4dElMVFpyRDhuNGktZ05TTkYtR01ScTZseXV4VDVKVmE5TlQwbU5ZcVZSWEJRdFVLNVJjd1drNFVHUHRwSG8wMnZQX1d3ZnRtZFcyTF9Ga1Fr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump and Maryland Gov. Moore trade barbs over Potomac River sewage spill blame - Axios",
    "description": "Trump and Maryland Gov. Moore trade barbs over Potomac River sewage spill blame  AxiosTrump directs federal government to intervene in Potomac sewage spill  The Washington PostTrump, Moore feud expands to Potomac River sewage spill  Baltimore Sun'Remnants of sewage' including toilet paper, left behind after wastewater pipe collapse  WJLATrump says FEMA will play ‘key role’ in coordinating response to Potomac sewage spill  Politico",
    "published date": "Tue, 17 Feb 2026 01:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPNldZVkRrM0M0THJvSjdrTVlDOGcxS1RFWHZJbzVsc3dkTFdVMXB0TEU5M1J0TVFZZHZzUTM0QW56M2ZieWVCeHo1OHY2bmdxbk40dWRpaDJZZzNQV2JSOURkcmlmZkVTc1VYcFpTWW1PNGRxakdqUFlwV1FUNloxMVB1T0tYbnJFb0I3UTZPYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Hochul, Mamdani announce $1.5B for NYC budget ahead of preliminary plan - Gothamist",
    "description": "Hochul, Mamdani announce $1.5B for NYC budget ahead of preliminary plan  GothamistMayor Zohran Mamdani to release preliminary budget for NYC a day after Gov. Kathy Hochul promised more funds  ABC7 New York‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesNew York City’s Looming Deficit Threatens to Curb Mamdani’s Ambitions  The Wall Street JournalState giving $1.5 billion to NYC to help fix massive budget gap  CBS News",
    "published date": "Tue, 17 Feb 2026 14:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQmVqRUplaFEtaHctUUVDbzV2WlFGWlo4YzlqWGpta0VyanQya1BYSjYzQ290WVhvRGI5REFYZzZlTFBvNDNUa2V6cWRuOFZyN2NibEI4LUh1TEdIMUFXT0tfRDZVQ2xQNFhwUkRzMG9KbFdFMHRiXzV2WUdaSDJrV2xmQzcxNTFGdjc3Zzk5a1NOYi15VVk5R2lUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gothamist.com",
      "title": "Gothamist"
    }
  },
  {
    "title": "New Mexico lawmakers launch sweeping investigation into Epstein ranch - Axios",
    "description": "New Mexico lawmakers launch sweeping investigation into Epstein ranch  AxiosNew Mexico approves comprehensive probe of Epstein’s Zorro Ranch  NBC NewsEpstein ranch in New Mexico bought by family of ‘Trump Republican’ candidate  The GuardianDon Huffines’ family bought Epstein's ranch after his death  The Texas TribuneTexas GOP politician Don Huffines plans Christian retreat at Zorro Ranch  Santa Fe New Mexican",
    "published date": "Tue, 17 Feb 2026 06:44:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPZEM5ZFQ4bGpxVmZobldwZ2E1V0ZqdVRXMTFsZlVjS19yeXNaR0prT2p3YmNtNkZPbWEyYjg0NTg2S3JGcmUwUkphTHJoaHFHQzl0OFRLY3RxeHhWWWdLS0poZ1VvN2Y3d0YwLXVVUmtHaS1tTl9RcURJUFF6aUxWZnh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
    "description": "The Epstein files have brought a wave of resignations and investigations  The Washington PostThe Price of Admission to Epstein’s World: Silence  The New York TimesTamara Keith and Amy Walter on the public's response to the Epstein files  PBSEpstein files end business, political careers across globe  AxiosBondi criticised after saying all Epstein files have been released  BBC",
    "published date": "Tue, 17 Feb 2026 16:01:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPOHBiNGo2LTZKbEw0eEdlLVdxYUhYWWJCNUFaSkZjdENjVlF5eHU1UG1jaEw4Q3NfZVhNQ0EyWVhxbVhja2VBMzZOOEc5djRBd01iVHhiOTlWS2R3c1BnUl9jbGQ2dWtTRlh3Rk5PMDhUbTJhZ1pydkxFejJPcmJLUlFicW1MVm5LaFZ6clZMMTd3cl9NS2tfQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "After First Big Overseas Trip, Ocasio-Cortez Expresses Frustrations - The New York Times",
    "description": "After First Big Overseas Trip, Ocasio-Cortez Expresses Frustrations  The New York TimesOpinion | Class warfare comes to Munich  The Washington PostOcasio-Cortez says she went to Munich ‘not because I’m running for president’  The HillTrump news at a glance: Alexandria Ocasio-Cortez blasts president’s ‘age of authoritarianism’ at European conference  The GuardianAOC mocked for ‘absolute train wreck’ weekend on global stage: 'Made a fool out of herself'  Fox News",
    "published date": "Tue, 17 Feb 2026 01:33:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPakc1LWFXSFEydnE5RF8yTi1HWnczRHFrWndWUFl5cGdxczVOdmVkd0QzZGMwMVdOQ3F5aU9FVW9tTEJ6TkxkeFVhVWFrSkVpVWtMbm9SWDJ1c1pCYm43THIwUFVjdW4yRU9NQ21MbHBZdnd4RWlaSWZHb2E4SWRCaXctc3JHODJiZ3J3WlNsWEZuVE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times - Los Angeles Times",
    "description": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times  Los Angeles TimesLive weather updates: SoCal cleaning up toppled trees, flood damage with more rain the way  ABC7 Los AngelesSouthern California to experience lull in storm activity Tuesday  KTLALatest Southern California rainfall totals for Feb. 16  FOX 11 Los AngelesSnow snarls travel in Sierra Nevada as flooding rain closes roads in Southern California  Yahoo",
    "published date": "Mon, 16 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxObEtQN2JwRWRhbEFmcFFXWjV6VmFKU3FaMWZaWjJsaXQ4bkhQOVhyZDdmVFZvVTYyT0JDbWl1aVI5a1p0MXJxa1J2ZXJrLWZITVVMV2VkM0FVam9VV011YV9OYXhlWUxwWG5WRFdqRmYtZXdvOEZKQnBBdlYyNDVYdUFJbXJrNnZaODYwNG1BOWYxb0w0MVNJNzcyeFNLMks0YTdnNmNRRV9GMlkxQzFGSXZlWTdwUUpfVmd1VHItdHJ6ejlldnZ4NHVjTDNJNExKLUlmUE9CblZxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "FBI won't co-operate on Alex Pretti investigation, state officials say - BBC",
    "description": "FBI won't co-operate on Alex Pretti investigation, state officials say  BBCFBI blocks Minnesota officials from accessing Alex Pretti case files, BCA says  KOMOFBI won’t provide Minnesota investigators with evidence in Alex Pretti killing, state says  Minnesota ReformerFBI won’t share Alex Pretti shooting evidence, Minnesota authorities say | Minnesota ICE shootings  The GuardianFBI will not share access to Alex Pretti shooting evidence with Minnesota officials, BCA says  5 EYEWITNESS NEWS",
    "published date": "Tue, 17 Feb 2026 03:43:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5qdHNVWkFWUkxHUzAtb0FYSktJVjkxS2l1MFMxbFBneGE5clp1MmFFVjVXbDFqNlhCMmQ0dGtseEJzTVdYbGNSeW9YbG4wX3RiWnNscEpZZkNZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S. - Axios",
    "description": "Trump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S.  AxiosUS increases military pressure on Iran as countries discuss a deal  CNNUSS Gerald Ford the second aircraft carrier sent to Middle East: Report  Military TimesTrump says he will be involved indirectly in Iran talks  ReutersTrump says he will be involved ‘indirectly’ in Iran nuclear talks  Al Jazeera",
    "published date": "Tue, 17 Feb 2026 04:21:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB3OVhBamN1UU93Sm50ZnJIR2I0R2c3cEMtNG9fR3NrZWR0THJBd200M21aZ1U1QUtiSzNmQnVEejFQVWlwRUJiNmllSEtoSS1ZRG92U2NocDhwaTU5dVdrWjFQS3NwLUNaZkhQMURlcFZiMmlTcmlVeE5yZ2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Little-used ICE agreements with local police have exploded under Trump - NPR",
    "description": "Little-used ICE agreements with local police have exploded under Trump  NPREx-watchdogs warn rush to give power to local police in immigration crackdown risks ‘threat to civil rights’  The GuardianImmigration enforcement takes center stage at state level  USA TodayHow agencies under Gov. Josh Shapiro's control do — and don't — cooperate with ICE  Spotlight PAAgreements that allow local police to work with ICE skyrocket  NBC News",
    "published date": "Tue, 17 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSUhJUGVfRndSMnloT2NSLUlzYXhHYlZ5ZHpKb1lscjA3RC1JeGFLY1RGLWZGTS1JLWZJbGpJNjF2MWo2UnNCRWRNd1YxTTM3b0RxczJDS2E5ZndNSWlnTGhYWEEzT1lhalJXYjZEWndTREFKSi0xTnRnMzB0UkVfTWEtSGprMUpOQ2oxa1FJdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "California Issues Warnings About Dangerous Winter Storm - Newser",
    "description": "California Issues Warnings About Dangerous Winter Storm  NewserWinter Storms Could Bring 8 Feet of Snow to Parts of California  The New York TimesWinter storms could bring 4-8 feet of snow to parts of West. Latest forecast.  USA TodayNorthern California storm forecast: Heavy Sierra snow, rain and wind in the Valley and Foothills  KCRANorthstate under winter storm warning as heavy snow, high winds threaten travel  KRCR",
    "published date": "Mon, 16 Feb 2026 22:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOX3o5djBvTk1CQ0xBQWJVajRvdkUxckQzMHh3VF91QXR6NkJnZnAtdGt1Q2FjNnp4NnNwY2JKVUsyeGpKTEtmVDd5UDlkTUxDcjNxdWdMeWVsQ1dKcll4LVdpck5YdmhxT0c3LTRfRElXQnE2V0ZmbGJDbzB2Z3dTZURNU05pWEdxRjhCQ3p0OElpWll3akx4U29yaEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "\"Just making s**t up\" — David Roberts sounds off on the EPA - Public Notice | Aaron Rupar",
    "description": "\"Just making s**t up\" — David Roberts sounds off on the EPA  Public Notice | Aaron RuparWith Latest Rollback, the U.S. Essentially Has No Clean-Car Rules  The New York TimesTrump’s move ending power to control climate pollution could cost Wisconsin billions  WPROne of Big Oil’s Biggest Defenses Is Getting Blown Up  Bloomberg.comA look at false claims made by the Trump administration as it revokes a key scientific finding  AP News",
    "published date": "Mon, 16 Feb 2026 11:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9WUU0zejRiNWE5ZlFxS2JWYnlEcUU0d2hrMDhtdWkyTlhFSmw2UjdySVEyZEh2QVVmMjN1QUd1b1NqRG96UWZVOVhURTJsc1JZc2p2cENSRHJvVC0wa3dCN044S3ZzeUEweGhEV1lDMUhSRjZGZWVmSnYwdjh5SGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.publicnotice.co",
      "title": "Public Notice | Aaron Rupar"
    }
  },
  {
    "title": "American surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica - CNN",
    "description": "American surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica  CNN‘You left waves’: Shock over apparent slaying of ex-Santa Cruz surfing great in Costa Rica  San Francisco ChronicleUS surfer Kurt Van Dyke found murdered in Costa Rica, authorities say  ABC7 Los AngelesCosta Rican authorities investigate killing of a US citizen in an apparent robbery  AP NewsAmerican Hotel Owner Slain in in Costa Rica Robbery  The Tico Times",
    "published date": "Tue, 17 Feb 2026 06:04:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNN2NybTBZQlNQbG1iSm1lZVVRWHNGRWM1TXdPd1BqMUExTFRkc2ZTWXp1RVJzMHE1VDUzenJma2dJM0s0MWV3WjhGTUw1T1hsaDJxVXl0ZnB5cVdnWUUzU19XdVFaZXpQRUQyc3diQVUwX1VtZHlqUGlpamVncDlFdnpMOUFuSWVxZlVwaHdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "The U.S. ready to make up, Europe ready to break up in Munich - NPR",
    "description": "The U.S. ready to make up, Europe ready to break up in Munich  NPRNo, It’s Not Back to Business as Usual  The AtlanticForget Maga. Welcome to Mega: Make Empire Great Again | Mehdi Hasan  The GuardianThree American Speeches at Munich, and Plenty of Confusion  The New York TimesCNBC Daily Open: Rubio reassures Europe while U.S. CPI calms investors  CNBC",
    "published date": "Mon, 16 Feb 2026 19:49:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5seVFLZE9pRjJNWGNEVldfOWhoVkt5Qnh6WjhLZXVIUExzZnBIM0JMXzQyUlU5MkdaVzBwcHZhX1pycnU4VHU5eWFuVVVHdmpFcXpGc0N3ZmJOZFNFcHdpNTFaQlZuNmdOZi1nUEl5RW42ZFo3SFc5LURaOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "More than 70,000 voters will stay on North Carolina voter rolls after settlement - NBC News",
    "description": "More than 70,000 voters will stay on North Carolina voter rolls after settlement  NBC NewsDemocrats celebrate as 73,000 North Carolina voters without proper ID stay on rolls  Fox NewsRepublicans settle with DNC in lawsuit that sought to purge 225,000 NC voters  News & ObserverLetters from NC elections board confusing voters  Carolina Public PressDare County shares details on nearly 250,000 voter registration letters sent statewide  Island Free Press",
    "published date": "Tue, 17 Feb 2026 00:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOaDJJU3g2QzBmbHNJdFpjTW5aTUhVejNfMGhBZV9YV21YN3F4VEdqSWpmTE1YdXRVemJ6UjBYTE15YWNPdm1tSjI5Uld6RlpNQ0Nmc2tkNFNyOG1wYl9CZ2FiVzZIaTdWZEV4RGZrZHhHN1BXZ1VSWFc3SXdUM2tiWS10SklHMGxYM04wZzVLblN5dlYteWVFN2RmcFpUbHVLSkVRd2szSXJhTFdEVFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  }
]