[
  {
    "title": "Border Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser - The New York Times",
    "description": "Border Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser  The New York TimesSurprise US military plans to use counter-drone laser triggered El Paso airspace closure, sources say  CNNFAA lifts El Paso airspace closure after cartel drone breach, federal officials say  KFOXF.A.A. Halts All Flights at El Paso Airport for 10 Days  The New York TimesCruz calls for classified briefing after Texas airspace closure  Politico",
    "published date": "Thu, 12 Feb 2026 02:56:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNYmlVY2wxNXppRTVFTnNmR0RRa1FEUnJwMTFDVWpZMG54NXdSYnZ6ZC0wUGlRV0p6UHZXa2UzYjRnQjhhM2dPQy1TWXc1V1pUMTlhbjRzRTBzcUNVRkZnZHY0QlJlNlFQSnNHNUN0TF9Jc3Y5VHlsZTB0aWh4TS1IOU00SnpBQUMxc29YcVFEM0dxRl9jZ0dnR2xoM0U4ZGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Pam Bondi lashes out as lawmakers press her on Epstein, cases against Trump foes - The Washington Post",
    "description": "Pam Bondi lashes out as lawmakers press her on Epstein, cases against Trump foes  The Washington Post5 takeaways from Pam Bondi’s fiery testimony  CNNFour takeaways from Pam Bondi's fiery Epstein testimony  BBCAttorney General Pam Bondi Testifies Before House Judiciary Committee  C-SPANEpstein files: AG Pam Bondi seemed to have Rep. Jayapal's DOJ database search history at hearing  CNBC",
    "published date": "Thu, 12 Feb 2026 03:55:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOTi1aMU8wQVJwUXU4X3BDY0g5QzVqSk5EdHZocUxaSDNVakJfRnNHanQxUXM2S01qN3l0ZmM5LWNVTXhtdkJKb3F3dGpJRUNiaW9CVTRpNVlmTENMOGVjWURqa2Z0Mlo3MVdjQnlmNDFHYXZvX1JfNkVZZzBJNG5NMkw4OG5nNXRSSTBLSnZpdDBxbXNkazNYd3FB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Bitcoin reportedly sent to wallet associated with Nancy Guthrie’s ransom letter providing potential clue in investigation - Fortune",
    "description": "Bitcoin reportedly sent to wallet associated with Nancy Guthrie’s ransom letter providing potential clue in investigation  FortuneLive updates: FBI searching roads near Nancy Guthrie’s home as man detained in case says he wants to clear his name  CNNSavannah Guthrie’s Brother-in-Law Hasn’t Been Seen For a Week as Police Search His Home Twice—Here’s the Last Photo of Him  YahooNew activity in crypto wallet tied to Nancy Guthrie ransom note as suspect images surface  AZ FamilyBBC in Nancy Guthrie's hometown as sniffer dogs help search for clues  BBC",
    "published date": "Wed, 11 Feb 2026 18:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQSEttMG96MnNURElMSE5LRVl6VkRrOGh5ZkMwSVAwNDFoZENMQ0MyR3lBMTJ3Vk5aN1dYSk9mdDRTTmJ1eHBxU1ZLM041TWNqcDU3WDlrQk4zZVVIX0VUZ19xdm40Tms3RFdjMmRYbEVUWl9DWjVieTRnNzBVN1ZOUTNSREc0SHc0YUdIMVoxT1E1WkxfZmdOSThETzVjV1hPVjNjOXI3X3J4RkIwZmlZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "These monks' walk for peace captivated Americans. It ends this week - NPR",
    "description": "These monks' walk for peace captivated Americans. It ends this week  NPRMonks bring balm for America’s wounds as Washington cheers peace odyssey  The Guardian‘We show respect': Police officer goes viral for greeting monks with a bow  NBC4 WashingtonBuddhist monk who led 15-week peace walk to D.C. tells CBS News peace \"always begins from within\"  CBS NewsRoad closures as monks walk to DC  WUSA9",
    "published date": "Wed, 11 Feb 2026 22:13:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQX0MxaWRHTEd1MU41al9kSExpZkNDUEF1TGtPOUo0ZTlMemtXZDlmMWxPRDBEWk1tR1hkcVJnN1RQQWkxSVp6d3gzRTUtaGlDQ3FWVzhSNmtUV0FKaVFOZTBQNjl2S0JvUlZPZjdjbmFVRTZZZTBnbDU4V3ZCR1czeDRYazY2R2pJX2JER1FzdFVqVDhhZmZHV3h2YnVtZGZWeGo0VnN4V2txdGNsSUExa1c4cHVOd2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Cybersecurity experts explain how surveillance footage of Nancy Guthrie's home was recovered - CBS News",
    "description": "Cybersecurity experts explain how surveillance footage of Nancy Guthrie's home was recovered  CBS NewsView Full Coverage on Google News",
    "published date": "Wed, 11 Feb 2026 23:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNQmVjQW1GNmpXTnQ4X3NCdEZLY1MzV1RJNFA1WWduSGxsMmNxXzFUX3B5d2RUQTZaeENkbUVhbXBYMlU2WndFemxfQWNDNjNWMk1xeFJwVHdKR1VnRlQ3U0ZybS1abGxvN05PWWNQSHNGejVBYTJyekFSQTdWajl5OGJSRWFOc3Fac1lKYXpTczhzS2ZQQzJKZWt6RdIBoAFBVV95cUxQMDh3VkFST2NPeDBua29ueXZiZ1Z5MFFGd1FTYXhKRl9YMllUNXh1NGpCR290ZEY0dDBaSmxOWGNHRkg4OFlmcjJGV0NjUG5wYS1VVjdLTml3cG1KREhrNHR5dnBLNlVYR2poc3FsemxWb2lIaEpEQlY4S0J3emd3RWVHRGh2UHk5OGhiRVlDbm9ITldzMWZwb0FZdHg4clJm?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "House passes SAVE America Act, sending Trump-backed election bill to the Senate - NBC News",
    "description": "House passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsOnly one House Dem voted in favor of voter ID, proof of citizenship in US elections  Fox NewsHouse passes SAVE Act, sends bill mandating photo ID & proof of citizenship to Senate  KATUSAVE Act: House advances Trump-backed voter ID bill  CNBCHouse passes GOP elections overhaul  Politico",
    "published date": "Wed, 11 Feb 2026 23:45:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNaGR5MFRmeVdXaHRCTUhiN3Y2eER4NnF2ZEw2T0hQSW1OQkl3OXllV08zcy1IOWY4bkJCVG9aTjBYWUVlLWUwcWVNQUxyNnl3VHVfYm8wN29YUWpZUmhtdlZzWHhQcFYxN2h4ZEVjSU1nM3lRX2hzTnFiTms3NU9vMG5Gc2xZMk9sSEk0LXAzcWI1VjI0QW9ndVZmbm9GVzVLQzZuRWU5X1VmRGhyeWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "House Republicans defy Trump on trade - Axios",
    "description": "House Republicans defy Trump on trade  AxiosHouse votes to override Trump's Canada tariffs  CNBCTrump threatens 'consequences' after 6 House Republicans voted to reverse his Canada tariffs  Fox NewsWhite House expects ‘substantial’ GOP defections on Canada tariff vote in House  PoliticoHouse Democrats plot barrage of anti-tariff votes after stunning GOP failure  Axios",
    "published date": "Thu, 12 Feb 2026 03:07:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5QTHozOGlrd2p3QnhMQTVROE5HS3ZodUVuYzR6eURxZkNuX2lGZXlacmQtM0hIR2dzWGlpbjhZdjdjTDduMWZjdnZKcmNYVHVPWWUzVEcycUg4WVdQem1MYTRCNTBUZ0hUOE12NThmRlNrTU04aEJGZU8wQldSajA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "In North Carolina, a Tight Primary Could Upend the Balance of Conservative Power - The New York Times",
    "description": "In North Carolina, a Tight Primary Could Upend the Balance of Conservative Power  The New York TimesElection 2026: Two U.S. Senate primaries, only 1 matchup expected  The Center SquareCooper reports sizable lead in fundraising for 2026 U.S. Senate race  NC NewslineRace for Berger's state Senate seat is key primary contest  Spectrum NewsHelping Berger out the door  PoliticsNC",
    "published date": "Wed, 11 Feb 2026 21:41:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNUE5Ya2ltd19Sa19zRVVISlA2QktGeDl5RjlFNWU3VmRudFUxd0FObzFRUEQtSkstNVByN0RJQjQxV2lGVVpOa1QwYko0LXhsejZGSFlhX0ZkYXpqQVJhUTZlWVhEZWFFaHFBa3VYX1NRVjYteWZEdzhCVFo0MG5YbzdXeDNHMExvQ2JNTFVFZzhBZUN5ODJDVzFtRW0wS0JI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump’s failed attempt to indict Democratic lawmakers, briefly explained - vox.com",
    "description": "Trump’s failed attempt to indict Democratic lawmakers, briefly explained  vox.comProsecutors Fail to Bring Charges Against Democrats Involved in Illegal Orders Video  The New York TimesOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington PostRep. Jason Crow asks Pirro to preserve evidence related to failed indictment  PoliticoGrand jury refuses to indict Democratic lawmakers in connection with illegal military orders video  AP News",
    "published date": "Wed, 11 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOWUE1cHZfZzRFc3lsU0R4MDJUZXY5bjd2bXloWFYyRUdUeTJSV3pYd1Vvakd2OW82X05pQzAzcEx0T09VdVloX1M2Z2Q1emhuVlBrby1taFB6bVVQUUFrRTU2clItV2Y3MG9uQ0owd3RHdklUaDMwbDZvVHR3Z05MQjc0bF9WSGdaU0QyR2U5VUk1R1FJMElpajFacHpYXzVrWjlTNGpuR08zU1BNRFE5TUJ0N1Y1bXZiWFo2dHIyUEJPVnlBVGppTmRwSnBMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "DHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times - Chicago Sun-Times",
    "description": "DHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times  Chicago Sun-TimesMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  Chicago TribuneBorder patrol chief praised federal agent who shot US citizen in Chicago  The GuardianBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsOpinion | We Have to Face What ICE Has Done to Us  The New York Times",
    "published date": "Thu, 12 Feb 2026 01:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOYkduZE1oenJOdEgxcG9WemwzUTdGMTVoM0lvalhRV2hRSGtSdDlUSnFzNkYtN0pEMjcwQl9DRUJWVWF1R2JWa1k0dElfSlF5LUJ6cUdSRWxnUzRCaUZIelNEOUx6N09EbDBTTnl3NGJZRHRuRF93dXNXekFaTVBYUFB4WDVEQnEzMVdHdEFrQVltMktMWUp2ejVZWGZMZENraEdDeFJGZnJjTWxra1Z0cWdwRGJwTnZNQ3U4UjNqZU5kNFRTOWxoS2R1cVRkRXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://chicago.suntimes.com",
      "title": "Chicago Sun-Times"
    }
  },
  {
    "title": "NewYork-Presbyterian Nurses Reject Contract By Overwhelming Margin - THE CITY - NYC News",
    "description": "NewYork-Presbyterian Nurses Reject Contract By Overwhelming Margin  THE CITY - NYC NewsNYC nurses' strike: Mount Sinai, Montefiore ratify tentative agreements; NewYork-Presbyterian nurses vote against proposal  ABC7 New YorkNurses at 4 N.Y.C. Hospitals Vote to End Strike, but It Continues at One  The New York TimesNurses' union pressures NewYork-Presbyterian members to end monthlong strike  GothamistA young cancer patient and his family worry nearly a month into New York City nurses’ strike  AP News",
    "published date": "Wed, 11 Feb 2026 21:23:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBTVjdXbERlVUw5QzNXWUhpeTdCdFhIc2Y0UzNQbjZ5WkRDNEpMaDJBRVpfZ3RKS1hRU19Hd0JPc2Q5TXY2ZzFrMF9maEoySGVkSFFNT0ZqTzViQjEzMmI5MENvOU5SZ0k5eFlKVUdGZlk5cnR2QXQybWQ4dFpDOTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecity.nyc",
      "title": "THE CITY - NYC News"
    }
  },
  {
    "title": "Trump allows Democratic governors at White House meeting after initial snub - The Washington Post",
    "description": "Trump allows Democratic governors at White House meeting after initial snub  The Washington PostTrump says governors from both parties are invited to White House events, except 2 Democrats  CBS NewsTrump Says He Will Now Invite Democrats to Governors’ Meeting  The New York TimesTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House meeting  NBC NewsGovernors group says Trump will welcome Democrats and Republicans to White House  Yahoo",
    "published date": "Thu, 12 Feb 2026 04:06:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPbjU0UFp1S0dqdF92SHhPZ2xISlBqUC04T0p0MExVMnYyRXFKSG5wYzRPRFhnNTZaakRiTjVMS1NGWkJIdzFxSHdBeS1udjAtU1RucXNfbjVQNy1zS0F0eExqQ0dIU3hYWjFoek5MbWsyS083TS1RaGVGb0tERW5hcnRTMTJWSTRDVWtZdFZvQm1BOVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump orders Pentagon to buy power from coal plants - CNBC",
    "description": "Trump orders Pentagon to buy power from coal plants  CNBCTrump named \"undisputed\" champion of coal. Here are all of his recent awards  AxiosTrump orders Pentagon to buy coal power as the polluting fuel struggles to survive  The Washington PostTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York TimesPresident Trump Receives \"Undisputed Champion of Coal\" Award  C-SPAN",
    "published date": "Wed, 11 Feb 2026 22:50:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZDl3aGs5MGN0YjB5RDBuRVRMRW1faXRock11ci1uTjNoczNlTlg2a29wcmE2cGxwS2N1T0dteDJISU5ZT0lON2NxbDV1RTN2Q0FpM2taUzE5bE05djdKM1BVYlpIOUVRRFA4VUNjVzJPcENNaUZfRjRRc3hCekFCYjJ2YUZ3ZlNqSkNaTTIwNExlZ9IBlwFBVV95cUxNdzd3eWo5X2ZmY2ZUcnk4RUpmUlVlTDJfd095ZUFoYmRSeDJnQ3hFbjJrNUc3cDZFOHRuMmZsb0UwV20xaUYyaUdKbmNaM2YtdktHU2JvWTJOY3VGSWljMWgycERCVGxuQ19zdDZrQUZUbW1PdjhuYmpZVzBHZ1F6V25WNy1USS1fX3BweTE4Qll4blJaM3FZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now - Axios",
    "description": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosLive updates: Trump meets with Netanyahu to discuss Iran relations as uproar grows over Epstein files | CNN Politics  CNN‘Nothing definitive’ reached about Iran during Netanyahu’s visit with Trump  Al JazeeraNetanyahu meets with Trump as U.S. restarts talks on Iran’s nuclear program  PBSTrump says no 'definitive' agreement with Netanyahu, US talks with Iran to continue  Reuters",
    "published date": "Wed, 11 Feb 2026 23:22:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA0QUd3U3ZWUi1wNmRKeXNoVWVDaExGTmlZQkRVcV9COTBWbEczOHBqRHdOak5icDhpVEJlLWFTNG1nUWFWMzJ4cFI3NTl2QmV2YU5TVGZId3pKeDloaGJnREo5YnlKdXJKc0txZ2l3T3dfenpXLTRNeU1aT2dmWUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Republicans urge Trump to hold firm against Democrats’ DHS demands as clock ticks toward shutdown - CNN",
    "description": "Republicans urge Trump to hold firm against Democrats’ DHS demands as clock ticks toward shutdown  CNNSome Advocates say Democratic Plan to Rein in ICE has No Teeth  The New York TimesHere's where — and when — a DHS shutdown would cause pain for the public  PoliticoCongress prepares for a Homeland Security shutdown  MS NOWHow Democrats aim to curb ICE without losing votes  The Economist",
    "published date": "Wed, 11 Feb 2026 23:56:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONUVrV0NqS3loOGprQ0NTMFJDMGstd0lzdWVlSzNMRDZCZUotQXN5amd6NVNuQ0VOVVdoTS11WW9DSkZ6U3o3dGgwN09nTkVnZ25DMEZQWmZkanltb3M1NFYtdWtNQVd6LUVYYXhxQnRZLXVUVmk3d1Fta1JPQlhGMEJXbnQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Hochul’s no-tax-hike stance gets an unexpected boost from Mamdani - Politico",
    "description": "Hochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoMamdani Expects Wall Street Taxes Will Ease NYC Budget Crisis by $5 Billion  The Wall Street JournalMamdani Finds Allies, and Skeptics, in Albany as He Asks for Funding  The New York TimesWorking Families Party on 'Tax the Rich'; City Council Oversight on 'Code Blue'; Universities and Democracy; Where Do You Get Your News? | The Brian Lehrer Show  WNYCTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New York",
    "published date": "Wed, 11 Feb 2026 21:53:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNNGdNdTVQUkFDd0ZkU3ZlT1lsMU91SVc0OGtFcjFqMVF3S2pxOVQwMU56TkpPLWRrZnJnck1ZYnZLdVg4dW42WEVpdjhTbmVyTUtTTVdubGQ1YW8xODE3RklmOWQ4d05ZRU92ZHRIUkw4ZGtqSjJodHI0SDBCWUNFS2R2UWwxcXV0YzRzd3BpQW1QR2J4ZzExcGtjY3BSenByUFpRQkJISmZOcTBueVYtTk93dzk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Four States Sue Administration Over Loss of Public Health Funds - The New York Times",
    "description": "Four States Sue Administration Over Loss of Public Health Funds  The New York TimesTrump administration to cut public health funding for Colorado  Colorado NewslineUS to cut $600 million in public health grants to Democrat-led states, Bloomberg reports  ReutersTrump administration cutting millions in Illinois HIV prevention grants, citing 'agency priorities'  Chicago Sun-TimesBay Area groups targeted for massive cuts as Trump pulls health funding from blue states  San Francisco Chronicle",
    "published date": "Thu, 12 Feb 2026 00:45:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOaUtPVXJJemcxd3NleWdKSzZsT3l5SzF6WWNkN2hYV1BYejRoVnR6dVQ5SGpRSWFDdXhBNE9tZGpFZS16a0ZJcDFvUDNDa25KWlo3YUZzZnF3TlRlZWJuMWNpZ3lodmZkSXMySzlfZG1RMU5XOE5waXQzS1VULWpRT3R5WnBwZDhFVE0w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "AI brings Supreme Court decisions to life - NPR",
    "description": "AI brings Supreme Court decisions to life  NPRView Full Coverage on Google News",
    "published date": "Wed, 11 Feb 2026 23:59:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9uRndwSWd3aEZ3UU1qRW9jcFhaTTByekd1QXk3bWhUSU85MlBMc0FwVXM1MTZOVG4ybkE3LVM1X2dpMGRfWEs4ajY4WHQzYkZtZS04b3hveS1QN2kya2g3Rm5VU3o4NkM0T0hzOE1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Congress Showed ICE Leaders Images of ICE Brutality. The Response Was Telling. - Slate",
    "description": "Congress Showed ICE Leaders Images of ICE Brutality. The Response Was Telling.  SlateICE director refuses to resign under pressure from Eric Swalwell not to 'side with killers'  Fox NewsTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoAnalysis | Republicans dig in on defending ICE  The Washington Post",
    "published date": "Wed, 11 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMGh4R2VMS1NlcThCMmRtYlRWMjBVcVE4b2hxUXI2aVp1RkFncFVlVF9ZbUExamd3aGw5ckpGUDk4eUFmTVY0cFNZOTZVeUdFQXJLRm5LVExTaHBlZGp4dmIyZXFxY0V5ZGlLS3JpTTBSQnBqdUs0NG80MWU5UzJvcDVpQmZoMWVYZHBKMkxuYnAtV2o2eWx5bHNqX2NfYTF3MnFF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge - CBS News",
    "description": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge  CBS NewsBefore Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesWhat Gov. Whitmer said in response to Trump’s threat to block opening of Gordie Howe Bridge  ClickOnDetroit | WDIV Local 4Rick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsReports: Moroun met with top official before Trump threatened new bridge  Detroit Free Press",
    "published date": "Wed, 11 Feb 2026 11:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOLW5lRVpFamVDd0tZaGMwbFg0dktyXzFKNHJXbHRGeVQ0VEFsNVB5UVFsMUtZVkc1LS10LWxlUTBoUlpfZm1SazI4NUhqRDVnUnRQeE9CUjZZVXI1Q3NSRDkzWDVOZmd4d3R2UHhOeUNOcE9xb0prU1I4S0o2U0tSTW1LWUwwcHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  }
]