[
  {
    "title": "Nancy Guthrie live updates as FBI searches roadways, investigators get over 4,000 calls to tip line in 24 hours - CBS News",
    "description": "Nancy Guthrie live updates as FBI searches roadways, investigators get over 4,000 calls to tip line in 24 hours  CBS NewsLive updates: FBI searching roads near Nancy Guthrie’s home as man detained in case says he wants to clear his name  CNNNancy Guthrie investigation: What we know about the search  NBC NewsNew activity in crypto wallet tied to Nancy Guthrie ransom note as suspect images surface  AZ FamilyWATCH: Man detained by police in Nancy Guthrie search speaks to ABC15  ABC15 Arizona",
    "published date": "Wed, 11 Feb 2026 22:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQY2l0VlpvdktqYVd4UE1TYzJZOFBwMnFCZ0ljT2hNdEtLX1ZOS3ZIWGxTeHVkdklNMmpqdzhnQW5WM2lJYURNVUV1bzBzTGo0VDJTOERYQ2dqVXRvaUkwa0xIelk0cHlXYmlTNkNpN29zM0x0MEtEalNPam1QZ0lqQmNFekgza0F4VnfSAY8BQVVfeXFMTTM0TnhqRV9wU3p1WGtSaC1JTTE2NXQ1Y1JBM2xNNjU5cE85UzR5UVB3M1oyUEZNTjB3TERpVTI1bVNnSU4zUnBqUlZoTTFVSXVEMGRzaTE3TWlzTU1wZk03eUtHRm11dVJobXl6UG4xVm51YldzcjlsdW5PUVhtaF9yYVVXZVdXbWFqNHkwMWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "‘You’re a washed-up loser lawyer’: Pam Bondi taunts Democrats over Epstein - The Guardian",
    "description": "‘You’re a washed-up loser lawyer’: Pam Bondi taunts Democrats over Epstein  The GuardianAttorney General Pam Bondi’s testimony heats up as she exchanges jabs with lawmakers over Epstein  CNNAttorney General Pam Bondi Testifies Before House Judiciary Committee  C-SPANFour takeaways from Pam Bondi's fiery Epstein testimony  BBCVIDEO: Pam Bondi clashes with members of Congress in Epstein files hearing  Australian Broadcasting Corporation",
    "published date": "Wed, 11 Feb 2026 21:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPWjduSmkzUnBXdGxMX2gzaVlWRVBKcjh0c01JWTZGQVl6S1NxZXM5RlBjeDlFZVYzMTR3UDdMZ1JYaTg2eTMzeGE2OVNkS2Vld2FxeHVFYTcxb3VlU1c1Y0JBOGNHS0t3bTdpSm5CWjVFamtzRm9UcnVfMXpvNGhuZ09pVnNhNDdTLWJF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Pentagon-FAA dispute over lasers to thwart cartel drones led to airspace closure, AP sources say - AP News",
    "description": "Pentagon-FAA dispute over lasers to thwart cartel drones led to airspace closure, AP sources say  AP NewsF.A.A. Halts All Flights at El Paso Airport for 10 Days  The New York TimesThe airspace around El Paso is open again. Why it closed is in dispute  NPRUS military shot down party balloon near El Paso after suspecting drone, official says  Fox NewsPentagon disabled cartel drones before FAA closed El Paso airspace: Updates  El Paso Times",
    "published date": "Wed, 11 Feb 2026 22:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVzZob3l1RXpnUjZJNGJWN3FkM1lmUml1RjhxTllQTGQyMjkwVzI4bzlEOGVqb0dsakVxTnRLNlBiWS00VzJ4aTVnMW1ueU9wNzAyZi1XVFZWQ0xrVThaTDhtUXlYYWlJSTMtWlpJRlk0bXdqdzBsVW5nRGhMV0VSc1VTcDBCb0M4aDQ2V3UxTmg2MjNTUUVfc1R3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now - Axios",
    "description": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosLive updates: Trump meets with Netanyahu to discuss Iran relations as uproar grows over Epstein files | CNN Politics  CNNTrump says he is still seeking Iran anti-nuclear deal after Netanyahu meeting  The GuardianNetanyahu Flies to D.C. to Keep Israel From Being Outflanked on Iran  The Wall Street JournalLIVE: Trump-Netanyahu meeting concludes, US says Iran talks will continue  Al Jazeera",
    "published date": "Wed, 11 Feb 2026 19:32:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA0QUd3U3ZWUi1wNmRKeXNoVWVDaExGTmlZQkRVcV9COTBWbEczOHBqRHdOak5icDhpVEJlLWFTNG1nUWFWMzJ4cFI3NTl2QmV2YU5TVGZId3pKeDloaGJnREo5YnlKdXJKc0txZ2l3T3dfenpXLTRNeU1aT2dmWUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Top Border Official Praised Agent Who Shot Chicago Woman, Evidence Shows - The New York Times",
    "description": "Top Border Official Praised Agent Who Shot Chicago Woman, Evidence Shows  The New York TimesBody camera footage and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsLawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  AP NewsOpinion | We Have to Look Right in the Face of What We Have Become  The New York TimesMarimar Martinez shooting: Chicago woman shot by Border Patrol shooting in Brighton Park to file lawsuit  ABC7 Chicago",
    "published date": "Wed, 11 Feb 2026 05:30:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE15azR5cHFrNk1hZkMyMGV6OS1NN0RxR0d4eWU2elZyRUE4VDJKZl9uVW0yYmZIZ2lFZjhaZkdSWnhaQnFuYnFXTjZhaTd2Si15eXdKZG1xWVZqNFl2YTBSdzE2ekxwQnBXOTl1VmU5c1dtM3ZseVQwSkV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Murdaugh Takes Appeal of Murder Convictions to South Carolina’s Top Court - The New York Times",
    "description": "Murdaugh Takes Appeal of Murder Convictions to South Carolina’s Top Court  The New York TimesWATCH: SC Supreme Court hears arguments in Alex Murdaugh appeal  WIS News 10Murdaugh lawyers: 'We believe him to be innocent' of killing wife and son  YahooIn Alex Murdaugh’s appeal, justices grill attorneys on ‘rogue’ court clerk and financial crimes  CNNAlex Murdaugh continues to insist he didn't kill wife and son as he gets another day in court  Channel 3000",
    "published date": "Wed, 11 Feb 2026 10:04:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5tcGM0Ylo4M05GWmRCVExjR1J6UWNqMVVEUWstbXlKSjdpNjMyUWNQRU9RbHEwMFh6djRRdnVHUDYwRnhKM1dvT1FkYWZwVGtGY0xEX05TeHZWZWRLUXM0RjkzRDZJZi1WVFd2T19ZSzhfZlZtN0tlTlNrazI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Pirro Taps Dance Photographer-Lawyer in Lawmaker Video Case (1) - Bloomberg Law News",
    "description": "Pirro Taps Dance Photographer-Lawyer in Lawmaker Video Case (1)  Bloomberg Law NewsProsecutors Fail to Bring Charges Against Democrats Involved in Illegal Orders Video  The New York TimesGrand jury’s refusal to indict Democrats joins a stunning pattern of DOJ rejections  MS NOWRep. Jason Crow asks Pirro to preserve evidence related to failed indictment  PoliticoLawmakers React After Trump Administration Fails to Indict Democrats Over ‘Illegal Orders’ Video  Time Magazine",
    "published date": "Wed, 11 Feb 2026 17:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNUEl2d1F4dDNvaExPYzU0ZE1JZnRJUGlIc2hMYjFLTEc5NnhRY2VlZF9sYmhkRlYzZlhwQm5oOHFTbUFmWHNmV2RiaUduVDVkS3F3aEhTVG9oWHJqbkNhekhfYzd3djdoN241b3NWWURVNGMyakxXTjd6SF9YTEpEbjNYSmJtWGstdnZoTEhJYVY3NVRmOTRPNkJxdTRWRE04RHpvei1xbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.bloomberglaw.com",
      "title": "Bloomberg Law News"
    }
  },
  {
    "title": "White House expects ‘substantial’ GOP defections on Canada tariff vote in House - Politico",
    "description": "White House expects ‘substantial’ GOP defections on Canada tariff vote in House  PoliticoThree House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs  CNNHouse Is Set to Vote on Canceling Trump’s Canada Tariffs  The New York TimesTrump Canada tariffs face House vote after Republican leaders fail to block rebellion  CNBCThree reasons the latest failure for Trump and Mike Johnson was ‘seismic’  MS NOW",
    "published date": "Wed, 11 Feb 2026 19:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQZlB3aHdtU0txZUc1Z0tPR3ZUOE04Wk1kcEJPZW5JaGNFdUh6X2I5dExGLXN5SV9pc1pDMjdWNWY0MkdKZEJaR0xnUTE1bVhubDNlazdzeHpOOVZaVy0wd3dra2lBa0VYdXB3a1ItelZiOEM2NHVBdmFpRW1RM1VLVVhGdlhaeDdFS1BCMjVVemoyTXNrZTVJdDMzei1LTmpmZXQ4Uw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Congress Showed ICE Leaders Images of ICE Brutality. The Response Was Telling. - Slate",
    "description": "Congress Showed ICE Leaders Images of ICE Brutality. The Response Was Telling.  SlateICE director refuses to resign under pressure from Eric Swalwell not to 'side with killers'  Fox NewsTakeaways from a tense House hearing with Trump immigration officials  CNNICE chief refuses to apologize for Minneapolis shooting victims being labeled terrorists  PoliticoAnalysis | Republicans dig in on defending ICE  The Washington Post",
    "published date": "Wed, 11 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMGh4R2VMS1NlcThCMmRtYlRWMjBVcVE4b2hxUXI2aVp1RkFncFVlVF9ZbUExamd3aGw5ckpGUDk4eUFmTVY0cFNZOTZVeUdFQXJLRm5LVExTaHBlZGp4dmIyZXFxY0V5ZGlLS3JpTTBSQnBqdUs0NG80MWU5UzJvcDVpQmZoMWVYZHBKMkxuYnAtV2o2eWx5bHNqX2NfYTF3MnFF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Mad Emperor Trump declares war on the air - The Hill",
    "description": "Mad Emperor Trump declares war on the air  The HillTrump set to gut U.S. climate change policy and environmental regulations, White House official says  PBSOpinion | EPA is right to reverse Obama overreach  The Washington PostEPA to repeal its own conclusion that greenhouse gases warm the planet and threaten health  NBC NewsTrump to repeal Obama-era finding foundational to US climate rules  The Guardian",
    "published date": "Wed, 11 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQWjNpMlJDZjBWd0JYVkRGWUU5UDhBSklBZ2tycDVucXhMbmJ4dzFkWmFfdXdyYWVFN0ZDbXZOTjVRRW80ZVpiMTZvOG1DVEJkREJDcHBVX1c4a0JoTkJRYWlNOXI4aTh2WVRpclVKOGFsaEtCZ0RpYXdpZkI2OHpmOWlwSTnSAYoBQVVfeXFMUEVad25TMEttWGZRUWxCUTVPQmp5bkR5aXd1UkRRd0VDMm52dDZVaTA0Wlg5eTI1RGQ0Yy1WeXBXaW1FbFEyOE4xcTZvQVJZNi1VSFVKWUFRWEQwWld1UDU2TUhZMFE1U042TVItbF9tZXJFWUZTNjMwdU1tWTdUa0ZQM2xSQmd4Ml9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehill.com",
      "title": "The Hill"
    }
  },
  {
    "title": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge - CBS News",
    "description": "Ambassador Bridge owner reportedly met with federal official hours before Trump's post on Gordie Howe bridge  CBS NewsRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsWhat Gov. Whitmer said in response to Trump’s threat to block opening of Gordie Howe Bridge  ClickOnDetroit | WDIV Local 4Before Trump Blasted U.S.-Canada Bridge, Owner of Competing Span Lobbied Administration  The New York TimesReports: Moroun met with top official before Trump threatened new bridge  Detroit Free Press",
    "published date": "Wed, 11 Feb 2026 11:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOLW5lRVpFamVDd0tZaGMwbFg0dktyXzFKNHJXbHRGeVQ0VEFsNVB5UVFsMUtZVkc1LS10LWxlUTBoUlpfZm1SazI4NUhqRDVnUnRQeE9CUjZZVXI1Q3NSRDkzWDVOZmd4d3R2UHhOeUNOcE9xb0prU1I4S0o2U0tSTW1LWUwwcHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump to Direct Pentagon to Buy Coal Power in Revival Bid - Bloomberg.com",
    "description": "Trump to Direct Pentagon to Buy Coal Power in Revival Bid  Bloomberg.comTrump Orders Pentagon to Buy Coal Power in Boost to Industry  Bloomberg.comPresident Trump Receives \"Undisputed Champion of Coal\" Award  C-SPANTrump directs Energy Department to issue funds to keep coal plants online  The Detroit NewsTrump to direct Pentagon to buy coal to revive industry, Bloomberg News says  Reuters",
    "published date": "Wed, 11 Feb 2026 16:03:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNaEdUNll3YkgwTi1MbTJxa1V3Q1RQU1g2dTgyUkU3azVUQjh1cVRpY0RFd0ZJZTVNbUlHRDN6aGNaeWdhaVR2ZEgzY1JXalN6ellZdk5IVWc5NUZHb3dobURVczliM0lHazJBakdkUmh4dU9zTzhJUmxEeUp0NjJEbENEVVByVGE1bEZwU05BSmNkQmNpdGFEdUZ4UnR3U2Z1YXJ4NDYxVHQwY1l4VUloUHo1MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "From TSA lines to disaster relief, here’s how a DHS shutdown would hurt - Politico",
    "description": "From TSA lines to disaster relief, here’s how a DHS shutdown would hurt  PoliticoOpinion | How to rein in ICE without undermining its mission  The Washington PostDeLauro introduces bill to fund every agency under DHS except ICE, CBP  The HillICE Funding Fight: Democrats Are Turning the Tables on Immigration  Bloomberg.comSome Advocates say Democratic Plan to Rein in ICE has No Teeth  The New York Times",
    "published date": "Wed, 11 Feb 2026 09:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPeHJrUGJsSHBybVBDUXZjc1JhbFluOVlJNVIxMHZ4WGdpR2VieDc3M1lLOXRHTmF6dklHbldNamR1RUZwSXZDVkh3VHFuUHpZc015MHZPQmlYcHJLYlhYeWxuN05UZzR1TGpOYzRMYlRQNGxveFFQRW9aM1NhVTNDT2M5YzBKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Annual governors' gathering with White House unraveling after Trump excludes Democrats - NPR",
    "description": "Annual governors' gathering with White House unraveling after Trump excludes Democrats  NPRDemocratic governors pledge to boycott White House events after a Trump snub  PoliticoTrump agrees to meet at White House with all governors, including Democrats  USA TodayMaryland's Democratic governor among those excluded from White House event  NPRGovernors won’t hold Trump meeting after only Republicans invited  The Hill",
    "published date": "Wed, 11 Feb 2026 07:18:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5yZWJZZUlFRkRLVjNvZW5KZl8ySUJGc0RSVU1jYkNZU3NwVUlwdHVYS3dBZ1d5SXZWSVZUbDNXVHl1aE0xWG4yQmVZaXBKeFVqcnVrREdxbXhtLUs0dVRGY0hUQUdoN0NMSUF4dDBrSHNPTXBkUDZUVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Late Night Mines Trump’s Million Mentions in the Epstein Files - The New York Times",
    "description": "Late Night Mines Trump’s Million Mentions in the Epstein Files  The New York TimesTrump told Palm Beach police chief ‘everyone’ knew about Epstein, Maxwell was ‘evil’  Miami HeraldEx-police chief said Trump told him in 2006 'everyone' knew of Epstein's behaviour  BBCTrump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosTrump told police chief 'everyone' knew about Epstein, FBI document says  Reuters",
    "published date": "Wed, 11 Feb 2026 06:31:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPeFlLRUM0VkpyczlmMS0yZGdqa0VDMFdVMVpaMkJHYmtSbzF4LWtZYzdlRV9RLXVZZ2lLSU5Da2NGWnZNNFVkaDl4eU4xSFdocV84cXdGOXVUMF9Zd1hTZlJaNUtpdGlJSFpOOTd1M0puWi10UXF3a3N0d3JaajNNSzdSNmVNcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond - Axios",
    "description": "Inside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosEpstein Revelations Stir Chaos From Scandinavia to South Asia  The New York TimesSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianJeffrey Epstein’s Bonfire of the Élites  The New YorkerAs pressure mounted to release Epstein files, FBI employees compiled allegations against other men  CNN",
    "published date": "Wed, 11 Feb 2026 07:55:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPRHZ4Q3hqTjFQbDhUZ244a2dFaHJOWUJrSEo1TExQdEp1dDBhckxhZWVfQ1pySU9PTmZCRFE2UlJhNktpUDBFRjlNM1B0SXdiZ0hjLXlzYWNNc1hFTlZsZ282dzhKcm9xa0VxbGxZcDIwejQtdXc4cEk4dWVoNlJtVFFWVkRiUDJQMnBkM21kVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "MAGA blame game shows Trump in retreat - Salon.com",
    "description": "MAGA blame game shows Trump in retreat  Salon.comTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS NewsTrump won’t apologize for sharing since-deleted racist video depicting Obamas as apes on Truth Social  CNNNewsom Says Everyone ‘Should Be Disgusted’ Over Trump’s ‘Racist Trope’ Social Media Post  Time MagazineOpinion | Lamenting ‘Our President’s Overt Racism’  The New York Times",
    "published date": "Wed, 11 Feb 2026 11:30:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9OcTdodFc5RDNpazhYMFlsNWxhTW9raGYta2VyandkWTU4SEFMdnctZ3hsNGV1bVAzSEhuM2gyQ0RqUnctS0pRMFVlVHpVN0RnN3hhZzNIVzdSVzZqNFlmajJpallJalN4NERxaEFVWlVKbTczTkxXdXJJVmQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.salon.com",
      "title": "Salon.com"
    }
  },
  {
    "title": "Exclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East - The Wall Street Journal",
    "description": "Exclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East  The Wall Street JournalUS prepping to send 2nd carrier strike group to Mideast — Wall Street Journal  The Times of IsraelExclusive: Trump says he might send second carrier to strike Iran if talks fail  AxiosIran rules out broader U.S. talks as Trump hints at sending 2nd carrier  NBC NewsTrump hints at second carrier in Middle East as Iran and US near talks  Reuters",
    "published date": "Wed, 11 Feb 2026 20:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNUE84Rk1fZy1qaTRZNW9WWThiZXJ5ZDB3dW9ySk5Sdm9tY0VHdTJrdWFNdEVhR2FDU25Ya1EyZTRhSl9OZVdXSmo4TTYxV0J3UG1SV2UzTVU3V0ctX1ZwUEU4X1BaMnlMZ1ljb3Y0UHNiR3o3THFPVHFBZWF6bGVfV3dHci13YTFGTzkzX2JETG5pb0M5WGNUUFZwMXk0R2FFbFNNUnpfVmhsSUNESUdJUjFYWGVxeWJBV1RBQ2NDUkdnME8t?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "After court order, DOJ divulges search warrant affidavit for FBI’s Fulton County election raid - Democracy Docket",
    "description": "After court order, DOJ divulges search warrant affidavit for FBI’s Fulton County election raid  Democracy DocketGeorgia Ballot Inquiry Originated With Election Denier in Trump White House  The New York TimesOpinion | The Fulton County search affidavit makes claims about the 2020 election. None of them add up.  MS NOWFormer Trump campaign lawyer sparked FBI probe of Fulton County ballots: Affidavit  CNBCJustification unsealed for FBI’s seizure of 2020 Fulton County ballots  Politico",
    "published date": "Tue, 10 Feb 2026 22:06:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNallWaGdFNHRjZVVDYU1zVnNNNk0yMHdreDR5Tk1JTzUwZkpVTnJmU3Z0d01HeFV1dlQ0VWdsWl9pOXBOVHU5SU45NWIzVnlZTGJ6LUZKdTN4MnowNlo4bHU4Nzk3emdnN0JQZzFvaE0zNlptY1d4ZHBYX1JVQ3JjY0FCcnZQc1dzMl9Ndk5iYVc3TTBBdDhOeGtSZEFibWU0emhWT0VIR0hlWUJITDc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "What to know about how the SAVE America Act could change voting - PBS",
    "description": "What to know about how the SAVE America Act could change voting  PBSGOP Sen. Lisa Murkowski comes out against Trump's election bill, with a warning to her party  NBC NewsHouse GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  The Seattle TimesRepublicans are pushing to drastically change the way you cast ballots  The Washington PostWatch LIVE at 7:00 AM PST February 11, 2026 on C-SPAN  C-SPAN",
    "published date": "Wed, 11 Feb 2026 03:09:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQYUFFSnYyV2VmRjlRZThIR0FZYUxBSjJzb3lZaVZCeElQbDFjdFlydG5mS0QzWEtBMGo5SFE1SmJHWmdpUHlYRm5FQXFJbG15ekdnYXNXdW1BM0xnUUpDM3ZGR3RlaWVWdDhxMjdjclQ4ZXR1ZmV6LTJsOXN2S21mcllITzc4X2l3R3RTVXgzVVA2N1ZRZXQ3MUQ1bi1YZ9IBowFBVV95cUxNWUtFek9MeFlCX3ZWaGh1clRKT0NPaldaQlpfcHpNQ25oemVXMkV4QUpLRXh4dE5lYnBJRUUzZ25LLXhKUEZtU2NSTDZFQlFXZVJYVTBEOURCazMxN0Rhb2RRSzZrYXVHYWNPdHNDMXAxT2tROFZwdldvS0FNRFJWa2liMDJ2dmQ2dVF4bHpPckdwbHJjcnNDYU9YWDFqdFZDOV9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it - Politico",
    "description": "NYC officials plan to reraise pride flag at Manhattan’s Stonewall monument after Trump administration removed it  PoliticoPride Flag Is Removed From Stonewall Monument After Trump Directive  The New York TimesTrump administration removes LGBTQ+ Pride flag from Stonewall national monument  The GuardianNYC officials vow to fly Pride flag at Stonewall, after Trump admin takes it down  GothamistPride flag removed from Stonewall monument  Axios",
    "published date": "Tue, 10 Feb 2026 18:59:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOOHJGakFVUFN1TzFTS2VYT2JoUGRxTy1YcVpKZkZLMmt0ZWNrUEx0bWh4aDBZNHpyRGxJNGJvN3ViX3FxMk9hSml3MDNCa0FBbzN2blBNVGFyYmM0bkxJSjhxa0VieHpielpONEFvV0hiT0NhQWVXRVZUdFNaWlItUDVzcU1EZkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]