[
  {
    "title": "Trump Deletes Racist Video Portraying the Obamas as Apes - The New York Times",
    "description": "Trump Deletes Racist Video Portraying the Obamas as Apes  The New York TimesTrump shares racist video depicting Obamas as apes on Truth Social, then removes it amid bipartisan outrage  cnn.comSen. John Curtis condemns \"blatantly racist\" Obama video posted by Trump  AxiosTrump posts racist meme of the Obamas — then deletes it  NPRTrump posts on social media run the gamut from politics to garbage  USA Today",
    "published date": "Fri, 06 Feb 2026 21:47:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPdUFQTXF5anVHMExvYlYweEZsaVVIMTJMUW9qbDlnUjdwdXN4WlB2eHdVTlFKWmVnUUJxNnp3d0lJTmo0eVl5RWxaSEY2d2RxbzZvT1dIUWx0OUg5UWRxVF8tRW1ydG5Xckd5THV3ckU4aGppMWFYRm9nTm83b21Ia2ZKQUZRdG50Z3VLZ1RqNzlpUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump unveils TrumpRx website he says will help Americans buy lower-priced prescription drugs - ABC News",
    "description": "Trump unveils TrumpRx website he says will help Americans buy lower-priced prescription drugs  ABC NewsWhite House launches direct-to-consumer drug site TrumpRx. Here's what to know  CNBCHow TrumpRx drug prices compare to generic alternatives  AxiosWhite House Debuts Drug-Buying Site TrumpRx, With Roughly 40 Medications  The Wall Street JournalWhite House unveils TrumpRx website for medication discounts  NPR",
    "published date": "Fri, 06 Feb 2026 06:24:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNbG02bkVQa1hTakNxVmtTeWs4U2tUZWVwWk5GX3AybHF6QW8za1N0V3JMV000cl9uZkt4elpEVjV6MnlnaXNtSzg0ZXZ1SC1mT1hxbEpWcXViRWVmWlRMV0picEt6S3VLUnhRT2ZLS1h4MXIxaDdLU0xibnlZblR6YjRlNnZjaG00SVB5WFJPN1pzeUZDZUtyNHU4ckJReFI5LTNzekhCQ0h6d9IBrwFBVV95cUxQYWpVSm5sZlEzVl9hUmpfdUFKR24xbjYtVzFvc0t0X0k0TENnZWM4NDBZcl9LcE9vWmZZclc3Si1qSUpkTUVEcENIRmRlTXJhZG9rT1IxNW9HbThOSFU2a3Z5bHo0a3dDZWplYk1jUFpJVkpFSmF0Zk1jc3FpUDZiRnY5bFVNVjRCeXg2dlpJTnJ6aEJwd2JKcGk2ZGhSSWNMVl9zTUpTTGNRWHM2cGFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "How could Nancy Guthrie's kidnapper avoid surveillance cameras? - USA Today",
    "description": "How could Nancy Guthrie's kidnapper avoid surveillance cameras?  USA TodayLive updates: The search for Savannah Guthrie’s missing mother Nancy  cnn.comNancy Guthrie’s Disappearance Rekindles Kidnapping Fears  The New York TimesWhy Elizabeth Smart’s Father Believes Savannah Guthrie’s Family Spoke Directly to Kidnappers  People.comNancy Guthrie latest: Derrick Callella of Torrance, California arrested for demanding Bitcoin ransom from family  ABC7 Los Angeles",
    "published date": "Fri, 06 Feb 2026 14:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxQS01JNXBaNWNCNEtXckNXUkVPNnk5cHRRbl92UzFEd3ZvMFF6aDFSd0pSVzhHZ19QWXRmQkNtN0NYRXN2aUJ3S2pGZmtMc0tpZDF2TFhrTHp1X1B0LWlHM0I2S3FkcFJwTWhSRlVRbGZfRkVQa2ZRWnNIamRhcmwtWktTT1lBSE9TYlhHWWRHV0x1Nzg4a1YtMXFXOGRoV3pzWUNHaFB1UTJVaVNQaDlRb2VQSDBkdzd6Y3ktOFRvU3FaX3d6OWFnRTE0ekRuX0FFdHRnTWh0T1RZdEJtVEJBTHJmaW5ieVRCM3RJZXZ0eEs2bzFqM0pvNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "Paul Weiss Partners Turned on Brad Karp After Learning Extent of His Epstein Ties - The New York Times",
    "description": "Paul Weiss Partners Turned on Brad Karp After Learning Extent of His Epstein Ties  The New York TimesBrad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release  BBCLeader of Paul Weiss Resigns Over Epstein Ties  The Wall Street JournalEpstein’s fondness for elite lawyer ends in downfall  FortuneBrad Karp Steps Down As Chairman Of Paul Weiss  Original Jurisdiction | David Lat",
    "published date": "Fri, 06 Feb 2026 20:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOcktCbjNpaUl3N2d4V0J2RzRhUmFUWGp0S0VMbmpmX0JCWGhlZVBGa0hZd2FibjNnVmU0dDl3TGdCN0NINklONWt0NFgyY3YxY0h5dHN4bVVMemtKWUt1TTlNbWhZME9JckM0ZVoxM3BmMkM4dXhxTTlGa1FYREh1bEgyYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "State election officials brace for possible Trump interference in midterm results - Politico",
    "description": "State election officials brace for possible Trump interference in midterm results  PoliticoHow Autocrats Meddle With Elections  The AtlanticOpinion | A Law That Might Just Save the Midterms  The New York TimesIt’s Past Time to Take Trump’s Election Threats Seriously  The New YorkerTrump laying groundwork to contest 2026 results, election experts warn  MS NOW",
    "published date": "Fri, 06 Feb 2026 21:06:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOSUNlc1U3anBfMmlTQXNuQ1otek8yWDBJbWJkUUZpLXFSdmtxM3dhNGtUakZBS1hqWXhMcGtTcDZncUc4Z3dlNEFaRzE0NnRtb2RFclVQV1FSQkV2bC11dlUzVGNGR012U1RseHViR01vNlhMLTZzUTVHOXVRancxQUVfMEFYbXkwWjdfT2JMMUpTbm9EZ0gxY2hGSXpkcHNyN0tZVm9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "After leaving detention facility, 5-year-old Liam Ramos now faces DHS' request to expedite deportation proceedings - kare11.com",
    "description": "After leaving detention facility, 5-year-old Liam Ramos now faces DHS' request to expedite deportation proceedings  kare11.comU.S. Seeks to Expedite Deportation of 5-Year-Old Liam Conejo Ramos  The New York TimesAdministration seeking expedited removal of 5-year-old and family, Rep. Castro says  ABC NewsFather says 5-year-old son has nightmares and wakes up crying since immigration detention  NBC NewsA judge stands up to Trump, delivers a win for the rule of law  The Hill",
    "published date": "Fri, 06 Feb 2026 19:47:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgJBVV95cUxOVUQ0eE5iYWRJYnoyZkMyMWxMcFNYZDhRZmx5T3hJRnptWDNoZ1ZOOEpoR3BXYmFLUWVrMlZXakpJcXJlRGN1WlFfTGJ2bWZtQWNyckRoZ0twS1J6ZkRXbnV5TTN5T0NLdWxRaE9jamhsaEJnNzJFT2xVMkFvTzlOQkV5VXhiVGJIOC1TYUY3U3NJWFd4SjdnVnNFOC0xWl9HVVJjcGNPRTV5MHhMVUFNdHlZbXlJcGQ0TXlON2xmQnlYS1lLdG9FSG5Eak9XWGNiaHFzRVpyMXVra1FVSklwT0dxQzNOdUU3LWJ1REZuSzBEaElLMEZrWTJrZWNRSlRVTlVKdUtRT21ESWt4bGhJdXJMQjdPbVdHY0pNOWNnX291MkkyNmFFZ1ZVSFA5RFdfd2RJbE5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Suspect in 2012 Benghazi attack arrested and brought to the U.S. - cbsnews.com",
    "description": "Suspect in 2012 Benghazi attack arrested and brought to the U.S.  cbsnews.comBenghazi arrest delivers long-overdue justice and reminds America who failed our fallen  Fox NewsTrump admin captures, charges Libyan man with involvement in 2012 Benghazi attack  PoliticoPam Bondi announces arrest of ‘key participant’ in 2012 Benghazi attack  The GuardianKey participant in 2012 Benghazi attack has been brought to U.S. to face charges, DOJ says  NBC News",
    "published date": "Fri, 06 Feb 2026 14:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA2RF9PT3FUUGVCbEFnd2trY2xaQ2JIdzM3bEJfSmdUQUZaVFJaOXVfMjA2b0dUVEplV2NiZlQwYmNmb3hTVWxIZ2RMUTZQSXM5b3Z4ZTB2Z3RpNlN2WkhqTjJ6WjZSdm5xbXZ0LUxJREF5T2hx0gF6QVVfeXFMT0JTbGljblc3WEJqU0tKaHhpdTNES2VzUGNRUVgxWWZ4anppRUxPUE4tVFRNblNqdWVGd2FXTUZ0R2pfU2dSc3Jua2YwT2xheFliTFRxRUZQbjJwb2dGbzBwVTVqTTRoeVgyXzZsa0UtNktiU0dwR3d0U3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Trump envoys met directly with Iran foreign minister in Oman - Axios",
    "description": "Trump envoys met directly with Iran foreign minister in Oman  AxiosIran Refuses to End Nuclear Enrichment in Talks With U.S.  The Wall Street JournalLatest on the Trump administration: US and Iran agree to continue nuclear talks  cnn.comUS-Iran talks live: FM Araghchi says latest round of talks ‘a good start’  Al JazeeraIran and US hold indirect talks in Oman. America's military leader in the Mideast joins the talks  apnews.com",
    "published date": "Fri, 06 Feb 2026 20:03:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBXdXZVeDRrdlAyYmlWellPMGRQWWZaZUZoV1gxVjR6aGQ3TXVOOFE4clhBbnFlOW9fR1BXVzlpUUsxSjY2V2VQaUwwWlRlVjNhVFRnaWRGMTFYSGZpWWF2X0pKQURkUlR4SFkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "‘It’s pissing people off’: Centrist Democrats are livid with AIPAC after primary fiasco - Politico",
    "description": "‘It’s pissing people off’: Centrist Democrats are livid with AIPAC after primary fiasco  PoliticoA Pro-Israel Group’s Move Backfires as Gaza Tensions Flare in Midterms  The New York TimesNew Jersey Democratic primary contest for House seat on knife-edge as votes trickle in  The GuardianA dozen Democrats are vying for the nomination in N.J. special congressional primary  MS NOWHow a pro-Israel super PAC made a losing bet to open Democratic primary season  NBC News",
    "published date": "Fri, 06 Feb 2026 20:30:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPY0JBM2R6Qkc5VWlvS3hHSGRHOXg1Y0hsaGVJYTN6a0YyQm9iYkR6aDRabUpIejJMN09jVG9MX0hEX0toTTl1WXh1MGJOc0lmOEJHMHM2MXJaTkZmTWhVcnBWS0JvMTFJYzBQa0JYWlYtd3dpX1ZtRzZtUm9WU1lROW5VS3JVQXl1OGxKLVBBSWdJcU5SaGVwZkxPcURlazcyZS15RUprR0dEQ1JCZzNtV19B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Virginia Democrats unveil a redistricting map that would aim to give them 4 more US House seats - cnn.com",
    "description": "Virginia Democrats unveil a redistricting map that would aim to give them 4 more US House seats  cnn.comNew Virginia map uses Richmond to weaken GOP districts  AxiosRedistricting effort aimed at helping Republicans in midterms could cost them dearly in Virginia  cbsnews.comVirginia Democrats release long-awaited 10–1 congressional map  Virginia MercuryVirginia voters considering redrawing congressional districts to favor Democrats  ABC News",
    "published date": "Fri, 06 Feb 2026 16:14:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTHVLWmVSRWtwTGhmUWcxQS1NYlBxdl9RUWpjRW1JUktsWkVVb3hJRDRVZnB6R0t0dlREY1pSYTJJZFMtOEZGdVdZYV9nRkRPbDFqNkJ4Q3ljMGFFcy02d3VnVG1HRlMxSzI0Z1J3XzFtcnpld3hYMWNsUWRPRlhYdjZCMjMxbnFyRWZJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Sanctions to Combat Illicit Traders of Iranian Oil and the Shadow Fleet - U.S. Department of State (.gov)",
    "description": "Sanctions to Combat Illicit Traders of Iranian Oil and the Shadow Fleet  U.S. Department of State (.gov)US announces new sanctions on Iranian oil network amid nuclear talks  PoliticoUS hits Iran with new oil sanctions  The TelegraphUS Announces New Iran Oil Sanctions Moments After Talks In Oman  NDTVExclusive: Iran's surging crypto activity draws US scrutiny  Reuters",
    "published date": "Fri, 06 Feb 2026 16:13:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNcGtxRGViT3NYeWgxMnIwV1hRbXZxbE9QMm8tSm50V0dHS0pYRzQ3RFhPNEJ4Wno5eXhaSW9LMUwzYWQzbkxtd2VnMDFDZGhwOVFIN3o2bmVmNlFUaWpKZnhrMzVqV0FMLWtoLTAxQWNDdjA3RkphZXlYdUI3VkVrS25tVUt4OWNqOTRkcncwVTJzSHRVTkRCcUpnSTJiQkxwVnJFaHcxNXRUUWFFOENYdTdtWHpmOUVTZ05EQW9vSXAwQlYydFR5TmZXVkRVYkZrV29v?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.state.gov",
      "title": "U.S. Department of State (.gov)"
    }
  },
  {
    "title": "Border Patrol agent's texts after he shot a Chicago woman five times will be released, judge rules - NBC News",
    "description": "Border Patrol agent's texts after he shot a Chicago woman five times will be released, judge rules  NBC NewsJudge allows release of body camera footage in case of Chicago woman shot by CBP  ABC NewsJudge Allows Release of Evidence From Border Patrol Shooting  The New York TimesJudge rules to release bodycam video, photos from fed agents in Brighton Park shooting  ABC7 ChicagoFederal judge allows release of evidence related to shooting of woman in Brighton Park by federal agents  WGN-TV",
    "published date": "Fri, 06 Feb 2026 18:51:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQUjFIeUk5czR0b0tkcC01U3IxOE9uRjRXQW1UQnN3Q2ctcFRNVkZONHZfTDIxempWVldaUnozelVXSTM0SGZsQWNIQTNvdF9ZTFdwM3lzLUl3UHBnZVVmY0trbVl4NUE4WV80ZTh0RFloN2dNS1U0dnFESzZwTTItdjhuNHZVMWUwanBOX0FpTHFxcWR2TUhYZUc0MEpsd1J5UmdjQ2Rxbm9oa2RmcjJHOU9PUlotLTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "DOJ admits redaction errors in Epstein docs while names in files face scrutiny - NPR",
    "description": "DOJ admits redaction errors in Epstein docs while names in files face scrutiny  NPRMissing records from Bondi and Patel draw scrutiny in Epstein release  AxiosMembers of Congress will be able to view unredacted Epstein files next week  NBC NewsWoody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files  The GuardianTrump says America should move on from Epstein - it may not be that easy  BBC",
    "published date": "Fri, 06 Feb 2026 09:48:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOQ25SY3hKaDgtMHRUYnloYmxXVWlOdUlxdU85bngyaTZ3NWQ3RFRQSDdtcUF2YmN2V0h1bkVlaGo4U1NlSXFDeW9tQjhlY0VaSDIzYWRsUE9wWVVWV3I1ZWQ5NHZlbkZYbHV6ZmI5bDRjUFFWbnplTWVTMmNHOUwyOFlPRWtORUN2czFYZ19tOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "US appeals court rejects challenge to Trump's efforts to ban DEI - Yahoo",
    "description": "US appeals court rejects challenge to Trump's efforts to ban DEI  YahooDepartment of Education drops appeal, allows funding for curricula with DEI language  The Daily TexanWhite House says it won’t withhold funding from NH schools with DEI programs  New Hampshire Public RadioNational college association reaffirms support of DEI, encourages return to ‘equity-centered’ practices  OU DailyFourth Circuit Allows Enforcement of DEI Executive Orders to Proceed  Littler Mendelson P.C.",
    "published date": "Fri, 06 Feb 2026 18:14:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNMThxV0J4WUZMTU93ek9qV0QtamEwcFQ2Rjk2Vk15bWVjQ2gwcVptZlQ0MnZGTkp6ZXhEd25Vd2hfV1FhVjRzWmJOdVVmcTduLWNZOTRnWlBFMXdySmp4V0p1M2gtUm4yUVZtRnJtTmhLMFBNZEstNW5Ybmd4RDBzZWFmN25CVnVHb1hveWpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change - The New York Times",
    "description": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change  The New York TimesTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsTrump Appears to Shift Tone as the Immigration Debate Goes to Halftime  Bloomberg.comBorder czar tells Minnesotans to stop impeding ICE. It’s not always clear what that means.  Star TribuneDHS to pull 700 officers from Minnesota, leaving about 2,000 officers on the ground. Here’s what we know  cnn.com",
    "published date": "Fri, 06 Feb 2026 01:02:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13RVQtNmJxMVNtbjQ1SE9ZY1FHV3lMMml6VGFDR3JuaVRzMmNMU2ZZd3RxRTdBdFpCM0hlUE5LMjZkVFpLWHFCbmZLaFBBWGJfZTQyTWpZSFY5MjdQZ0I3am5qZVh1Nm9TS2NDV0RPZ185UHpzam1faFB1c3lINWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Opinion | A federal judge schools chaotic Kristi Noem - The Washington Post",
    "description": "Opinion | A federal judge schools chaotic Kristi Noem  The Washington PostCompany lays off Haitian caregivers despite court order protecting work authorization  GBHThe original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th NewsA Judge Accused Noem of Racism. It’s Hard to Defend Her  Bloomberg.comOhio senators, governor respond to calls from Brown to extend protections for Haitians  Ohio Capital Journal",
    "published date": "Fri, 06 Feb 2026 20:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZTFHZVd2WDJnSDJwSGxkTzVhdnZtcTZoWkswTGF0Zk1UZXU5QVR4bHJjaWJRY0tqUmZhSE9uX3BLM0xsWTZvRUxqMjFMdlUwQmtLZkNvREtvak8xSnJjWWltZzluVXpJSWtkSWdEcWpYZW1WM1hmNUhDMTNXblhZNWFuNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Westwood crash: Victim identified after car crashes into 99 Ranch Market - ABC7 Los Angeles",
    "description": "Westwood crash: Victim identified after car crashes into 99 Ranch Market  ABC7 Los AngelesDashcam video shows 92-year-old driver crash into Westwood market, killing 3  KTLA3 dead, several injured after car crashes into 99 Ranch Market in Westwood  latimes.com3 Killed as Vehicle Crashes Into Grocery Store in Los Angeles  The New York TimesMultiple dead, several injured after vehicle crashes into Los Angeles grocery store  Fox News",
    "published date": "Fri, 06 Feb 2026 15:28:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNamstRHhuVjJtVEF5c2NSWGJhUmM0N2RVcXIyWDdycTBZeTZiaUpZaVIzTjlYc0ctTVp0eGZEOUZPYy1MTlVIeE1mNnBrR0FHQWFrcUM2ZDVZU2tDWDliQUtueVloTmVqVklrbVIxZWtWNDM1VzZiVlE4RE9nVVFpNnEzM2ZRMTh4WWZraWpaNTdVNWM3bWlv0gGcAUFVX3lxTFB5LTFqWU55RExTQXlHNjZuSjlwNTkwcFdSSmEtWUVTY3g1VlF2RHpDOUZpRWpOSlpwUWw5bVpVNHpPekt6LWxkRVJPN3ZxRFg1NmhCemlPMXVHTXd2NVRldGl3WWVYLXFSTk9lVVhTTE1pUFAzQ2lOZ2s5Q0JDUVE3RlNnV0xfVm1mYUhVMDBIUmh0QTFrcENvcDNlMQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "What is the SAVE America Act? Here's what to know about the GOP elections bill - cbsnews.com",
    "description": "What is the SAVE America Act? Here's what to know about the GOP elections bill  cbsnews.comNew SAVE Act Bills Would Still Block Millions of Americans From Voting  Brennan Center for JusticeSAVE Act voter ID bill is on the minds of Trump and Congress: What to know  CNBCStephen A. Smith: Democrats ‘playing right into Trump’s hands’ on voter ID bill  The HillGOP fast tracks monster voter suppression bill that could disenfranchise millions by requiring proof of citizenship at polls  Democracy Docket",
    "published date": "Fri, 06 Feb 2026 11:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA0WjFvVWd1VmtoS1pjOF9YbUVIRjlBM1MzT2tzNHVidmUzNTh2N3JTWDc1NUZ0a2M5MmVPUlBYeTlTTkpYX0Rpam5YcnRWcDN6czBTLURoSE05SWNsb2hVNGlCZWpqYUp5czRnNldIWFVubEJfZnNQZFVQaznSAYIBQVVfeXFMUEI0ejl0cTYzMklPZnpmOTdnR1liYllYdWZ3UmZkdEhnN1NuOGc4X0lubndGdEZlNDNBSUoyb2dSVV9mRHZtMVctcExUaUwzX095aXkzTmhOYWJnTzliWHdqd3JTTGd0bFBlbkZJSWV1MnBlT00zY3BNaVFNSWdFWEFHQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "N.Y.P.D. Sergeant Found Guilty in Death of Bronx Man He Threw Cooler At - The New York Times",
    "description": "N.Y.P.D. Sergeant Found Guilty in Death of Bronx Man He Threw Cooler At  The New York TimesNYPD cooler death: Verdict expected for NYPD Sergeant Erik Duran charged in fatal cooler throw  ABC7 New YorkNew York City police officer convicted of manslaughter in cooler throwing death  ABC NewsNYPD sergeant convicted in fatal cooler throw, first cop found guilty of killing someone in NYC in a decade  New York PostNew York police officer charged in cooler throw death says he was trying to protect colleagues  apnews.com",
    "published date": "Fri, 06 Feb 2026 20:10:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQT0NaeTYxN1VPWUtPd3hxVS1vSmo3RVpkNy12LTBvem5yMnNzOXRyeDJ3M3prbmVicTZQWVBGU2NiTlFjMUpRVW9rbjJVOS1OVDd4NFFKY2J5VHhIUkpldmxxODZpSGU0eEZ2NkJiVm9kbk81eFZodVU3TEQzbUZYSEZwRTNjWTRON1U0dWpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump to sign executive order quadrupling beef imports from Argentina - cbsnews.com",
    "description": "Trump to sign executive order quadrupling beef imports from Argentina  cbsnews.comTrump strikes deal to allow $800M in beef imports from Argentina to enter US  The HillArgentina and U.S. Sign Sweeping Trade Deal as Alliance Deepens  The New York TimesArgentina and US sign free trade deal in breakthrough for Milei  ABC NewsArgentina signs critical minerals deal with US, foreign ministry says  Reuters",
    "published date": "Fri, 06 Feb 2026 18:03:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1tOVMzZkEyOG92a19qdHI5MzZIUnhYUUFKX3ZEcDV6SlV0bDNhVXRtZ1ZTV0l4R0NHdFdqa0hYSUE4TUxEWVd0Nlo2SHFXR2xQYXZGYTgxUWRHOFE4SktsWjZWd0hBVXMtSklqV3BwUkJwZHk2RWRxdTg2ckdQVnfSAYQBQVVfeXFMTVBHTzlGbjVyZkJBSmxTQ085TmtENTlTNEN6ay1IZkI5SWYtZE95TEN2V0tUcDVBZWxMNDluV1hwclFLaDhVR25oYjZ2ZjJlVHF5bE5SYlVZZkJhS1VmakV3cW1zQnpUbDZ0YkZ6QktORHpuSmpqdXJIeG1lRU52SnpzN0Jr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown - The New York Times",
    "description": "Senators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown  The New York TimesWhat Democrats are demanding in exchange for funding ICE  The Washington Post'An impossibility': Negotiations to reform ICE sputter as shutdown looms for DHS  NBC NewsFebruary 5, 2026 — Trump administration news, lawmakers divided over DHS funding  cnn.comHakeem Jeffries calls for 'dramatic reform' at DHS  NPR",
    "published date": "Thu, 05 Feb 2026 22:44:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPd2NUeWZSdVlyenp3VW9LX0Jtank4OHBiN1pZWTV4emRHWlZIdE53OWM5Nmx6X3RMc094Z0lQUmRud2huQzJXZk4wbC04bHRIRDYtekZ2Qks2eEp4MjN0VUZJNF9KYm5Pd0FIanYyM1VGRy1iVHJVQjFsSmhLUmpFMHlaNDV3Zi1EUFgtWDhWS2EyQWI0SV9ITVhvTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Homeland Security shutdown grows more likely as Republicans rebuff Democrats’ ICE demands - Chicago Tribune",
    "description": "Homeland Security shutdown grows more likely as Republicans rebuff Democrats’ ICE demands  Chicago Tribune\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosGOP game-plans for a DHS shutdown, as skepticism grows over talks  The HillHomeland Security shutdown grows more likely as Republicans rebuff Democrats' ICE demands  apnews.comDHS negotiations have yet to get underway , Thune says, as shutdown clock ticks  Politico",
    "published date": "Thu, 05 Feb 2026 20:29:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5YOUxXM0xQdDFtOHhxY0F0YjR2a2xCMHlZOGpsZEgyUmV6aDNybnVzSnhIeXFBMmoySklGTjFrUWtqeFdEallSaXl4eHFZcXhHaTF6UlVLSzN4VVdKT2RLbnRkZTA5dFNlN3NhaTlfZGFVMHBQWVN5eQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chicagotribune.com",
      "title": "Chicago Tribune"
    }
  },
  {
    "title": "Luigi Mangione speaks out in court as his state trial is tentatively set for June - ABC News",
    "description": "Luigi Mangione speaks out in court as his state trial is tentatively set for June  ABC NewsLuigi Mangione complains of double jeopardy in courtroom outburst  Fox NewsLuigi Mangione’s state murder trial set for June, judge rules  cnn.comJudge rules Luigi Mangione should not face death penalty  NPRU.S. and N.Y. Prosecutors in ‘Tug-of-War’ to Put Mangione on Trial First  The New York Times",
    "published date": "Fri, 06 Feb 2026 17:12:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQX2VfU1VheWJtbm9RRkFldUxFdU9xUklONjU3b1FlOTJrRkhMM3RyMnZ4dl9iSFZBc2k1Ry16OVFyREE5TXJPS08ySWEzZ3dwTXh3R19EM2JQUDNQRXYyeXdxbDhRWWtkdm5ZRnhETVVuTnFwSHFKSjV0Z0hNOWhWSHktNEZZLXVDTWxNdDcyZUZTU1diNUlkbEExZ0VGMi1U0gGmAUFVX3lxTFAyaktTYWNLdXVOLURtZC14SGZPcldnTV9QOXQwV3c2Si1mRkxWajBueTcydE9DX3NmcHJzbTFlVEloaXYzM2NBV0RETFFOeVpwbXJwM21PYnZTWUlKQ1VueDRMSnZNWGpSdzRsbm4yLVVCQ0hLbDJhU0NNVUdYNmQ0UlVxR3JWMEVUSm5QaUNxb2poalg5dDZWRVJYZGwwdTNGODNnT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - DW.com",
    "description": "Why Trump and his Republicans can't take over US elections  DW.comTrump obliterates an aide’s efforts to downplay his comments – again  cnn.comRepublicans pretend Trump’s call to ‘nationalize’ elections is about a voter ID bill  MS NOW‘Grind the country to a halt’: Democrat urges national strike if Trump meddles in midterms  The GuardianTrump’s comments on nationalizing elections worry Colorado election officials  Colorado Public Radio",
    "published date": "Thu, 05 Feb 2026 15:32:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid - ABC News",
    "description": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid  ABC NewsTulsi Gabbard went down to Georgia — and no one in the Trump administration wants to take credit  cnn.comBondi defends Gabbard's role in controversial Georgia election probe, FBI search  ABC NewsFulton County challenges FBI’s seizure of its 2020 ballots in court  PoliticoTrump Administration Escalates Election Meddling by Seizing 2020 Voting Records in Georgia  Brennan Center for Justice",
    "published date": "Fri, 06 Feb 2026 04:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOd1BfNC1kZjU4Z0Z5N2VCUG1zX2VFZXpDOTFVdTk2VU8xVV9FRW1XRXZETjBWMjBVYjROZ21EMm1DNHZQZWx1N2MwNmRqYXY5eTBqMDVMZ1hqSEZpNjc1enUtV3FMY1VNN2YwVGxwOGxtelBrTEVGaW9fUklhYVFtNG4wbUF1Y1dtdWEzWnIxNEROTmVwX3N4NjN2bDZneGZUZ1gxSTlMMDhBdE9S0gGyAUFVX3lxTE0wOThjeV9OU1llYWRBVUtnaWdtMzAwMngweGlOQjA2MGN4MFFWVU11cGVCaUdsX3AxU2tBUVp2d1dadjY5cmwyUVY0YW5ENG52aFFtcVFiMU9xWVlnRnQzWnRHaS1EUFNQOWc1R2ZjUnBPbUh2SDZNZmNDTG5IN2swR2VPRFBvNTFRTmxFeW9Zbmp0ZjFjNDRuMlBFTHVITDZyOXFzNlZuMWNGbmcwSWpxVkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "White House ‘can’t guarantee’ ICE won’t be at polls - Democracy Docket",
    "description": "White House ‘can’t guarantee’ ICE won’t be at polls  Democracy DocketSteve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoWhite House ‘can’t guarantee’ ICE won’t send agents to midterm voting sites  The IndependentBannon Calls for ICE to Engage in Voter Intimidation During the Midterms  TruthoutTrump Press Sec Snaps at Media as Spin on Threat to Rig 2026 Goes Awry  newrepublic.com",
    "published date": "Thu, 05 Feb 2026 21:32:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQS0c0OUdLQ0dGVUNQYXdJcGVGN1JlUFBYbERYeUV1QnI4NnlaYjhaYjdLck1qdUFmbVh2N0hUZGlOYzJCdzVmNVRWUkZZMFljdFNHd1FoamxJSmVERC12US1qYmN2Wl9ONjVmb19yOGw0UGM4N0hLTTlVZFBQbnNRc0JyaFVVTE5tUUJBeXl5eER3YXJvenNZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Live Updates: Trump Posts Video Portraying Obamas as Apes, U.S. and Iran Hold Nuclear Talks - The New York Times",
    "description": "Live Updates: Trump Posts Video Portraying Obamas as Apes, U.S. and Iran Hold Nuclear Talks  The New York TimesTrump says he’ll free infrastructure funds for New York if Penn Station is renamed after him  The GuardianTrump’s quest to name things after himself takes an even more desperate turn  cnn.comDemocrats erupt in fury over Trump demanding Schumer help rename Dulles, Penn Station  AxiosDemocrats continue pressure to fund Gateway on day of deadline  Politico",
    "published date": "Fri, 06 Feb 2026 22:08:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTFBSejZDZnpFVTdnQWUxXzVVUS1mMkoyM2kyak9raVp0elpjZWJvVExoRW1OdDFCMlNGa3M1R0hZQkZVSTBORDNWT2ZhYXMzQXRjVENCbk83Ty1fNUdnWXJhQ0Q3MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "As Minnesota Reels Amid Immigration Crackdown, a Sheriff Agonizes Over Her Role - The New York Times",
    "description": "As Minnesota Reels Amid Immigration Crackdown, a Sheriff Agonizes Over Her Role  The New York TimesCounty attorneys nix plan between Minnesota sheriffs and ICE  MinnPostHennepin County Sheriff Dawanna Witt says she feels \"scapegoated\" by feds but is open to some cooperation  cbsnews.comPotential ICE jail agreement’s legality in question  5 EYEWITNESS NEWSAs elected officials in Minnesota seek to end the Trump administration's immigration crackdown, Sheriff Dawanna Witt of Hennepin County says she thinks she could do so by allowing some measure of cooperation with ICE. She also knows that could cost her  Facebook",
    "published date": "Fri, 06 Feb 2026 10:04:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBhT3MzQ0lTc1V4QlNYc0ZlS3lPYzJtTUlZTWpUUC1oYjRxbEdGdDM4bHpVYU1aNThFNWlRTGl0OWhXcHpIcHBDT1ZQN0ZzRFhBOEJvN0RTSE42TVVFQk5hM1ZVTEN0VTZrd3pyc1dVTk5XVGJDS3ByZHJkVWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says - The Chronicle of Higher Education",
    "description": "Tenure Will Be Eliminated at Most of Oklahoma’s Public Colleges, Governor Says  The Chronicle of Higher EducationTenure Eliminated at Oklahoma Colleges  Inside Higher EdOklahoma governor launches accelerated degree study to boost jobs, cut costs  News 9Oklahoma Gov. Kevin Stitt unveils plans for faster degrees and university oversight  KOCOStitt orders higher ed to create plan to tie funding to performance  The Oklahoman",
    "published date": "Fri, 06 Feb 2026 01:52:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQb0dZRFdMWHNRZGE2ZTE3VTFxdy14azBSQTBfWlhITWUyQXR6YXZKVkRCNDJGSm5HTkprTDJBQXlkazUwbnJIZVEwa3hZVnFILUNfcTdPRHlERnJKZDlCclpmVHZxak1Ia2ZEVkFMQVlNem5XakViR0dESUpLNUFaZloySmFvZWNSQlhvbXdteXg4ZmMwcWNISTZFN0dTb29tSmRYZWJ2S2VSRzhYTHg0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chronicle.com",
      "title": "The Chronicle of Higher Education"
    }
  },
  {
    "title": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s - OregonLive.com",
    "description": "Threats to Trump preceded fatal shooting by Portland officers of man who impersonated federal agent, police s  OregonLive.comWanted suspect shot, killed by police during warrant search at Pearl District apartments  KATUPortland police shoot and kill suspect during standoff at Pearl District apartment  KGW‘I was freaking out’: Neighbors react to ‘utter chaos’ of officer-involved shooting at Portland apartment  KOIN.comPortland police say man killed by officers wrote threats against Trump on bullets  KPTV",
    "published date": "Thu, 05 Feb 2026 22:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPdzlFSG4wLWduWE0xNzBVdjZkdXZmS2RSb2VydXA1RE1Uczh0dmhzTnFoVXBZRzU4MzJxelJsQ2ZCUndUQ21pb1hTdTVvR2RHNkdYcVl2RzlQMEdOWnNTY25zdm1vcmptc01mX1hDbXk0b05lQ2NLMjhrNGFsemstSUdBTnl3aHpvSDk1V2JIYlkzMmp5MHRCZi1uaVB2N0xaWW9LLU5KNzcweW1BVFdVQ0prU2pJbTh0SFo0X1FoXzE0UmRtRHp1cDhqUjVMOWItRzNSRnVFc3FZalNwOFRoRGRWM1JFckpOVERiTdIBgAJBVV95cUxQb0VBbWVHVGUzUHV6alF5eXhRbDRITG03c1VDMVhtbksyRzhYak8tLWFUUXM5Z1NoZ3hoU3lvczhodEY1ZWUwOENYYzJxaWpNRi1lOHd2al9va0tTTl9zOWxpdUpxWkhxU0RIdENXaFlReVNmV21hMnlCSXRzLU9qOG1PcVZwM3JpX3phNHE0bWtwNVh0eTRBS0FWa0ItM2ZxQnNuZ1pfMWhhUFM4LXlkdFJjSFNDS3BIeGZyN1BjTmQtaFNBTFNEMDdtN0ZmU016QjdfLTJBT2Q0akplNTFMQ1BkZmZnZVpoeHU3Z295TFM3Rlo0VV9oQ1pjUGVuSFV6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "AOC and NY House Dems endorse Hochul - Politico",
    "description": "AOC and NY House Dems endorse Hochul  PoliticoN.Y. House Democrats Unite to Endorse Hochul Ahead of Convention  The New York TimesHochul projects ‘strength’ as she resoundingly wins Democratic backing for a new term  PoliticoSocialists not thrilled with Mamdani’s guv endorsement: ‘Even Zohran gets it wrong sometimes’  City & State New YorkZohran Mamdani: Why I’m Endorsing Kathy Hochul  The Nation",
    "published date": "Fri, 06 Feb 2026 04:13:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOeDc3RzVvNmU1SFdHWmlaazNDMkIxNlhkLWY2RVBjUXd5ZW12cjAySkUwMkFrTmZyN2F3NHJJeHk3aDV1UXRiWEZySktJNHlqd0pyYi1vMlIzaFVKcmM3QlU1dG9CM0VXMUR5Sl9wMmRad3FSbHVudTJ2RVJDaU5kTjdDLWN0eWloVWIzM18zMUpHblk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]