[
  {
    "title": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota - The New York Times",
    "description": "Federal Judge Denies Request to Temporarily Block ICE Surge in Minnesota  The New York TimesJudge declines to immediately halt Operation Metro Surge in Minnesota with more protests slated across the US Saturday  CNNMinnesota ICE surge upheld as judge finds 'balance of harms' lacking  AxiosJudge denies Minnesota’s request to end ICE surge in Minneapolis  The GuardianJudges across the country rebuke ICE for defying court orders  Politico",
    "published date": "Sat, 31 Jan 2026 18:43:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1JejBjakZheDBSaUJTbm1yRE9MSWZWMV91U21qTHBlWV9IZm9Hem1BelpMVVZnSUxSYVZuVU9renhEZENkaU1JdTEtcTBBN3R4LU1yN2dsNlFGaE1HZk9pWk9abWFfQUpsNHpXZ1A2WGNmMmRudU1CWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What have we learned from the newly released Epstein files? - The Guardian",
    "description": "What have we learned from the newly released Epstein files?  The GuardianThe Famous Names in the Latest Release of Epstein Files  The Wall Street JournalNew Epstein Files Name Elon Musk, Bill Gates and Other Powerful Men  The New York TimesWhat 3 million new documents tell us about Trump’s ties to Jeffrey Epstein  CNNEpstein files: Trump, Howard Lutnick, Steve Tisch among prominent names that appear in latest Justice Department release  CNBC",
    "published date": "Sat, 31 Jan 2026 19:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPX3ZTSlVxZWxkMVhMY0JyT3BlN080cTZOY0ZKdGlDdHR6RUlvY0lWcEhGaHQ1aU9BWkFiTnhBWGxWUjNVcWlETVhLSTlIek9OdnQ2TmRWeGVlVUkyRmFTMHRKUU1VQzNaWG13ODVvQjRrUGZnTFR5UGcyblBZZWRQNDBFOUNTejE2aGt3TXNwUHhoc0RyN1JLMUQta1VET0hUaTVxRThEWmRwV3doX0w4cklVd0xST2k0NkFYc2RnT01ERHUtRGtod3JmcjNlQUps?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump is pressuring Cuba. It’s putting Mexico in a tough spot. - Politico",
    "description": "Trump is pressuring Cuba. It’s putting Mexico in a tough spot.  Politico‘A hurricane is coming’: Havana prepares people for war as US shuts off Cuba’s oil valve  CNNPresident Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy  Al JazeeraTrump Moves to Cut All Oil to Cuba as U.S. Targets Its Government  The New York TimesCuba Is Losing a Key Oil Supplier as U.S. Presses Mexico to Pull Back  The Wall Street Journal",
    "published date": "Sat, 31 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOMUk1UEtVNnNNMnQxVW1BZFFMaGpmdlZja1N2QWVUVllqcnZOZDBBN2tBS2VFcnRsTm1NS0JSU3E3VlpOUk1fbUg4N2F6REJFRFp6WHNpMWtScUtSci1aa3NaQ29SMkYzTjdnUGFiRWdWbzRUcThldXl2Tnc5LVhocWVmamFZc1Y5SUJQa1c2VzFPaDlkQXBuUkxJdUdQNW1DQTV3TlprVG1Yak53N1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Bovino Is Said to Have Mocked Prosecutor’s Jewish Faith on Call With Lawyers - The New York Times",
    "description": "Bovino Is Said to Have Mocked Prosecutor’s Jewish Faith on Call With Lawyers  The New York TimesBorder Patrol Chief Greg Bovino Allegedly Disparaged The Faith of Jewish DOJ Lawyer During Conference Call  YahooGregory Bovino reportedly mocked US Minnesota attorney’s Jewish faith  The GuardianOusted border chief exposed for unhinged phone call that left lawyers 'deeply unsettled'  rawstory.comUS Border Patrol leader made quip about 'chosen people' after Jewish official wouldn't meet on Shabbat - NYT  The Times of Israel",
    "published date": "Sat, 31 Jan 2026 16:12:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQdEZDaXFhZTNVQ3cyN0pBenBueS1pWXRtMEI4VmFVY3M0NlZUUHg4T2xLbGJhZ2Z5R19Bc0F5WVFKY2pyalQ0dnJ3MWRpUUh5bnlLYmZQTkdEVDJLV1ZDOHBubm5Nb1Rjb081UGo4QTBOZnRSdU1BSW1kdFhZUEp1Nm1Eaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story. - CBS News",
    "description": "Agents were pursuing an immigrant when they killed Alex Pretti. Now, he shares his story.  CBS NewsHow two federal agents escalated an encounter with Alex Pretti into a deadly shooting  CNNHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing  The InterceptFormer officials say DHS tactics undermine public trust after series of contradictory statements  ABC NewsTrump calls Alex Pretti an 'insurrectionist' and 'agitator' after new video of ICU nurse emerges  NBC News",
    "published date": "Sat, 31 Jan 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSFVTeEJSdkNuemttNTNOSGlISVFDU1RVSWs5S0hBX0Z6ZmdwUU9faVRNNEdJUG95WUVXYnpFMUVxVHVidHBRYmY0bk5uenp1cHpVVVFVaEdHSTl2NGhYWU1EeXR3X09NRnFzQjhHUEJDQVdXdTBvVWIyUUpPUHEtZzdoaEF3MFHSAYwBQVVfeXFMT3ZzbmRkbkpuT0pLVzEwS2hpanhnUFhyaVNXczlERXpjYi16anBMR0ZEelgwRWQxaDhpUF93VndRT1VKUFhWNW5GNHVZSUVydDhsZjNuV3gtNkF4bVhSb0R0ZGRRTzN3S0lMWndjdVRTQ09GSnNWNWxQMkVrd0E1OEhFTVR1dmxmVTE0T0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "US Senate passes Trump-backed government funding deal to avert partial shutdown - Euronews.com",
    "description": "US Senate passes Trump-backed government funding deal to avert partial shutdown  Euronews.comSenate passes $1.2T government funding deal — but a brief shutdown is certain  PoliticoHalt the ICE Terror Machine  IndivisibleUS government partly shuts down over homeland security funding  The GuardianUS Government Partial Shutdown 2026: Impact on Benefits, Federal Workers, and the U.S. Economy  soulboxproject.org",
    "published date": "Sat, 31 Jan 2026 13:06:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOaTVwYWtCbEN2c0loamh4MUJhM1NEeUhhUlBZcHpDUEtoRnRscXp2Tk1QSDJaNVRLSE1ZUjBKdnJZWlpSYU1CYkllU09CWXhCY004bTF6YU9PQVJpakdrV2N2OVVsVDdDX0xPSG9UMXlac0NKMW1hTWVCTXY5U21LRVhqRmE2aHZNY2t5OUdZX0RmNFRDeXg5RWJyYlpObUZOSDdZZEV1elZKUGhrcFNLTVZ6N2JOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Updated snow totals for southeastern Virginia: Whiteout conditions, frigid wind chills - The Virginian-Pilot",
    "description": "Updated snow totals for southeastern Virginia: Whiteout conditions, frigid wind chills  The Virginian-PilotMost of North Carolina sees measurable snow Saturday; strong gusts and extreme cold follow  WRALPHOTOS: Winter storm begins bringing snow to southeastern NC  WECTSnowfall continues with blistering cold  WJHLHow much snow can I expect, and when?  wfmynews2.com",
    "published date": "Sat, 31 Jan 2026 14:59:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE94SjRwYWRJYlJoTUpOVEFIQ2t5UDRZVDhsV2JNRHdrMFJMOTFNd2NJcU54clJqeUxwblU5VkdGWkJ3eWJBemtSNVc3TE5mSzFaNUhqanU0MG15bGlCSDhiTllmNTIwUlMzd3pfcHFQdFZaVFZPUkEzZWNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pilotonline.com",
      "title": "The Virginian-Pilot"
    }
  },
  {
    "title": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism” - Deadline",
    "description": "‘Real Time’: Marjorie Taylor Greene Says “I Completely Support” Don Lemon’s Arrest: “That’s Not Journalism”  DeadlineDon Lemon Released Without Bond Over Minnesota Protest Charge  The New York TimesDon Lemon vows to fight charges in First Amendment showdown with Trump  PoliticoFormer CNN journalist Don Lemon released following arrest over Minnesota protest: 'I will not be silenced'  ABC NewsAnalysis: Is the case against Don Lemon about winning — or about chilling journalism?  CNN",
    "published date": "Sat, 31 Jan 2026 03:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNZ3cxNS1HejliRHNzWXY2Mk9xb0F3ZWpJM1RacEJvaDVOeE1oaVFWLXZYSGZJVDlYSm1qUlNWeUFPdTlPNXlfOG1SdmN1RWNzSUhYYVAzWk4xc1FWbHVnOXBLUXlpcWJ0T3lCaGt5aFNvd2hocGJJdk03WUlhbTVxdVlNaW9UNWJ3bVhjaWlpLUNDUFViMGNLY3NVWFVGMW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Pho, handwarmers, grief and loss: a week on the block where Alex Pretti was killed - The Guardian",
    "description": "Pho, handwarmers, grief and loss: a week on the block where Alex Pretti was killed  The GuardianAn Ocean of Frozen Flowers Grows Where Alex Pretti Was Killed  The New York TimesMinneapolis Restaurant Owner Opened Her Doors for Protesters Seeking Refuge: ‘Come In, Come In’  TODAY.comSupport comes in waves for restaurant owner who opened doors for protestors to seek refuge  kare11.comGlam Doll Donuts reopens to long lines days after employees filmed Alex Pretti’s killing  Star Tribune",
    "published date": "Sat, 31 Jan 2026 15:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNaS15RkRIcXlQaDBBTE8yckY0NFJ4cU1VWVp3TU9qYWR5UktfTjNUZHZIVjdfTllkUkVnemlFNWw4dW1vQWhJeDl2SktTRGFjMGVSbHFaYTBTQUF1b01icjUyaU15RzhuRTFudnJCUmE5Ym1CeHJMcnhoTEctQVlKUTBxeUJHbFFlYjBiRFpuVzduaUNxVkZFSUp0UjE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Anti-ICE protests take place across US for 'National Shutdown' - Business Insider",
    "description": "Anti-ICE protests take place across US for 'National Shutdown'  Business InsiderWhat to Know About Anti-ICE Protests This Weekend  The New York TimesBoston rally draws crowds protesting ICE, Trump administration immigration enforcement  WCVBThousands march in anti-ICE protest in New York City: ‘If it’s them today, it’s us tomorrow’  The GuardianAustin businesses lock doors, shoppers swear off big box stores, in national ICE protest  KXAN Austin",
    "published date": "Sat, 31 Jan 2026 01:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNU3h6M1FmRjNNWFRGY1h2QTdvdGRSZ0lJcjBQNEQ0d2tfcUNrRzYwb1pOSktLYjhKMDVSRF9kNm40LU13Njd6WHdoek10STdVbHAwRE1nOTZmUXU0VDBESWx5eWUyWlRNTlEtcGFzWmdXMjVCaVlHa2luU1N6WVVxVGZUN3lRYkdtQkxfNl9lVWFEYXNOWU4tTWdIcGxtNWZM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Houston runoff sets up next Democratic generational fight - Politico",
    "description": "Houston runoff sets up next Democratic generational fight  PoliticoA US House special election in Texas is set to narrow the GOP majority even further  CNNWhat to expect in Texas' 18th Congressional District special runoff election  PBSHouse GOP majority on the brink as all-Democrat Texas special congressional election underway  Fox NewsDistrict 18 voters head to the polls in pivotal runoff election to fill seat left vacant after Sylvester Turner's death  ABC13 Houston",
    "published date": "Sat, 31 Jan 2026 12:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5kLW1pbzgzSC1WSERoRUZka1IyRTN4V2VLRXN6U3N1andUUmJkMDBWdGlUZGUwSXhtalV2Ul92djR2ckE5NTl4SGJfYnMwMjJfT2lWUU10bUxpMXhwbnJKOG9qODlOTmN4cHExYThYVWIwSk41REpObUVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "How Fear of ICE Upended Life in One Minnesota School District - The New York Times",
    "description": "How Fear of ICE Upended Life in One Minnesota School District  The New York TimesHow federal immigration activity is affecting Minnesota schools  MPR NewsICE’s Assault on a Minnesota School District  The New YorkerFormer Manitobans living in Minnesota wracked with fear, disgust as turmoil continues to unfold  Winnipeg Free PressICE Is Circling Minnesota Schools, Looking For Children to Take  HuffPost",
    "published date": "Sat, 31 Jan 2026 10:02:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOanFFZ09TejNKbVpjM3BJNm5JTmVWM2g4YXNaRkZRZS1ibEJaWlBBbFU2MUlNOEJIelZBQTY3LVR0ZU5Hczh2a1NMNEwwNGJ1eTRvM1NCN2QxNXhONzJMdWY0Zk5vR1Ixb0FUQlpHUkNMRldDS2VsWTJUZTBEQkZ0R01ZWEpETV9S?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Top Iranian official says progress made towards launching negotiations with the U.S. - Axios",
    "description": "Top Iranian official says progress made towards launching negotiations with the U.S.  AxiosIran is open to US talks but won’t be dictated to and won’t negotiate on missiles, foreign minister says  CNNIran seeks to avert US military action with talks in Ankara  The GuardianIran ready for talks or war, foreign minister says as Trump weighs military action  NBC NewsIran ready for 'fair' talks with US but not on defence capabilities  Reuters",
    "published date": "Sat, 31 Jan 2026 19:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE8wSUVsVEZyQ1B1MGRBRGdRX1l6SWxmNE5sUHFKTkpkajRvck4wUXNGQzdWWWw0VDhEVW1fQU1Vb2FKX2lyMDE1VnhlYWxSSFdaTWpYN2F5MmZ4TElrOEw4dnRCeU5CY0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Intense nor'easter takes aim at the Carolinas as Northeast dodges major storm - FOX Weather",
    "description": "Intense nor'easter takes aim at the Carolinas as Northeast dodges major storm  FOX WeatherWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelThe Southeast is bracing for a bomb cyclone. What to expect this weekend.  The Washington PostA bomb cyclone is forecast to hit the Southeast this weekend, with snow, wind and flooding. Here are the possible impacts and timing.  YahooLive updates: Nor’easter slams Carolinas with snow, vicious winds as storm intensifies to ‘bomb’ out  FOX Weather",
    "published date": "Sat, 31 Jan 2026 01:35:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1Xdk1BbUtMX1htYXcxU0dOQnFjV2dMd3RrYlZyVFgyMjBjRHNYaXlFc3pwb3lXMm5fekZWUWlIN3pvQmF5SHpWTTQwYzVjcjdJZU40SGJuX2VUVGZaU01vTGE0VQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxweather.com",
      "title": "FOX Weather"
    }
  },
  {
    "title": "Trump Gives Bonkers Reason for ICE Barbie Backlash in Late-Night Rant - The Daily Beast",
    "description": "Trump Gives Bonkers Reason for ICE Barbie Backlash in Late-Night Rant  The Daily BeastTrump’s New Method of Humiliation  The AtlanticTrump continues to defend Homan, Noem amid immigration enforcement backlash  ABC NewsNoem says her response to Pretti shooting may have been wrong  PoliticoWhy Democrats won't rush to force Noem impeachment vote  Axios",
    "published date": "Sat, 31 Jan 2026 15:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQWEliSmtZcHU1Vk9GQWtZY3RibU1GeXd6OEVHaUlPTEJiTngxVGhDdDN4NENXWTF5azQtV3Jkd3JwMnNIb09iTTFhQ2VadEdGdU9seHN3Q0NCd0JIclh1SmxUR05ScGZSZl9sdVVpcUU4M0tmTm5iaW1kQ1hya21BNGJVTVFZYkttNmhINnJyYnhQSHRDVkU4aUlTRmdZMVMyb2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms - CNN",
    "description": "‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNTulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub  NBC News‘It’s a Five-Alarm Fire’  The AtlanticWhat does the FBI's seizure of Fulton County ballots mean for elections? An explainer  Georgia Public BroadcastingAtlanta FBI boss ousted after balking at 2020 election probe  MS NOW",
    "published date": "Sat, 31 Jan 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQeFhfU0xOTFg5Q0thZWhCWDFzNm5qZzc1YzNSSkxVVl9OMFhKY3YyeFhabnI3UFJSZGVfbW5zcWg5dWtFYVNucVdUc3dJVG51aWFMM3VPOENSejZGYkk5WEw1czVFVU5idS10S1lUeWJ1amhlbEx2TDlyWnR0NGhsTWhiaVNIbDFHUVBvR1BhVktMUTMwU0xBZWdwNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "The West’s water war arrives in Washington - Politico",
    "description": "The West’s water war arrives in Washington  PoliticoGovernors Dive Into an Impasse Over Colorado River Water Use  The New York TimesWhat happened at the governors summit on the Colorado River? Here's what California said  CalMattersWhat's at stake as Utah, 6 other states seek new Colorado River deal  KSL.comFate of Colorado River hangs in balance as political battle brews  The Washington Post",
    "published date": "Sat, 31 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdW1TMnJxNDQyTmZNVVFxd2dxek5GTDhXNzNPakhCWVhvVFdCaFJRT0p2eld4TXhlNFZKMmE2Vm9BWEFDUFEwNkNBTFFkVjExRzlkYkR0aGU1YlJKU0xuZkt0ZE16cEdsVngzOTZNUzluNVhqdHdvUERUd1Y1eTVZOTN3cmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Denmark: Thousands take part in veteran anti-Trump protest - DW.com",
    "description": "Denmark: Thousands take part in veteran anti-Trump protest  DW.com‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments  The New York TimesDanish veterans protest outside U.S. Embassy over Greenland, combat contributions  CBS NewsUS Embassy in Copenhagen removes flags honoring fallen Danish soldiers, angering veterans  CNNProtesters in Copenhagen rally for Danish veterans after Trump remarks  Reuters",
    "published date": "Sat, 31 Jan 2026 16:09:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZkJLdXNJemJFLVpWZ0R1eWtWUUJ0TzF1SVI1c2prZE8xUV9wUHpkR1h1U1hEUU5lcGZwaEs1b0g0ZDI0QlJvMzA3T1U2U3pVRDRyM0ZpTWY5VGpwU3c4YlNUb0l2QzBqallPVm5YSENxT2dPSFAxZXdoVGhoc3MxYXlibDQzYUtuSHdfRGx4ZmQteXNt0gGUAUFVX3lxTE5HS3htWVVZbDFFdVo3VTg0ZG9YSGw0V2F1cy1PVmJURnBNMXNmTW1GakNJXzFmWFhXOGxvSGgtMXVNaEh2LVVicExXVWJVMUt3OWQxcFhuUS1UbFlVaGFuMS1BLTJGTXB3UXk2ekpuRFd5X0ZEMTdVcF94X1ZQaUtfNEhOYWVsRVRPY2JraGwwalhsV1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Chicago snow today: Chicago weather forecast includes Winter Weather Advisory | LIVE RADAR - ABC7 Chicago",
    "description": "Chicago snow today: Chicago weather forecast includes Winter Weather Advisory | LIVE RADAR  ABC7 ChicagoGround stop at O'Hare, delays at both airports as lake-effect snow brings several inches to Chicago area  Chicago Sun-TimesBurst of potentially heavy lake effect snow to continue wobbling along Illinois/Indiana shoreline through Saturday morning  WGN-TVLake-effect snow returns to Lake Michigan shoreline ahead of another winter system  NBC 5 ChicagoChicago weather: More lake effect snow for parts of the area  FOX 32 Chicago",
    "published date": "Sat, 31 Jan 2026 11:52:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQdkR3LXh0bDJUdzh1WUlfOWNOY3pCdGtyekVkeTlRby1FN0tnZVVLcHlRRVlIUzJlaEZXcDNhNGF1NW5scHIwVTZaeGFSaXBrRUg3VDE0azFBa1BHTTNMdXdIQjlwbmI5NmR0dTR1MXBLY0lTQnFvZVA5QUJmcWtBWVAtX3luWFQwOE5ablpCSXZ1d2dIWm5RT2Z3MXN0bnJiZnVMRFJudVFHQlF2czJV0gG0AUFVX3lxTFBTc2thZmhwQ0xZU2J4d1hCS2kyczBfQzNCbHM1LXVGd0Yyemt4UUJFdEVqZ09wUnN2VlpGUWFxS05MLV9HdmN2TjJMc3FrT0IzZU5EdTY2Q1p0YTRLb3hweEt5WnR4bTI2MHdxZWFwLWRfUFBzV1NhQThPb1oyVVIwazRndVByUkdOZkx0MkY1YUdRYkJnYkNvQzF5QktCeWljYmpxWmJfczhKcjBIWXdmNENEMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7chicago.com",
      "title": "ABC7 Chicago"
    }
  },
  {
    "title": "This Minneapolis family has been in hiding for weeks, fearful of being deported - NBC News",
    "description": "This Minneapolis family has been in hiding for weeks, fearful of being deported  NBC NewsMothers of massive resistance: PTA members organize Minneapolis relief efforts  MinnPostNonprofit puts together care kits for Minnesota families facing uncertainty  CBS News'It's terrifying': Dominicans in Minneapolis on the front lines of ICE surge  Global Sisters ReportAmid ICE Raids, MN Immigrant Parents Plan for Children’s Care  The Imprint",
    "published date": "Sat, 31 Jan 2026 10:00:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQLWh0Nlc0UTFjcElpbjJudDd1YzVyWDFUUTk1dWVvWTE5QU5LcGpHMXVmQmdhalpmSFIzemRUd01mY3JqQWQ2ZWh5RmRpRkw5V3B1SmwwZk01T25JZ2pidEU5ZzV6UnpIYWNCMHdvSFFfQ3p0czhYSXJNRGo0NGJKNGNUalFUbGplUm5BUHlqaS1CQUoxSUxhMkpVeC1tdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "What We Saw in Minneapolis - ProPublica",
    "description": "What We Saw in Minneapolis  ProPublicaView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1xMXd4dTE5aVIyaFp0dC1vV2t0cmswdmV1cl9xSEJDN01LRVpfMWVsUE9oU2paUmg2OG1HMkhwbEVleDktTGtySDMyV1RoaHM1X1A2dWxiU0Z5ZFQwZUpqNXlSS1FNdjZhaDBiQWlMU2MtLURxWG40RTdPeUlJanc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Explosions reported in Iran, Israel denies involvement - Euronews.com",
    "description": "Explosions reported in Iran, Israel denies involvement  Euronews.comBlast rips through building in Iranian port city of Bandar Abbas, state media says  CNNIran gas explosions kill five people, officials say  BBCGas leak caused blast in Iran's Bandar Abbas, Iranian media say  ReutersLive: Iran says progress made towards US talks despite ‘hype’ of strike threats  France 24",
    "published date": "Sat, 31 Jan 2026 13:29:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE42T1RydXdDa2FPZWNjdHRjZVNyVG56LUlyMG96TXEzT2hybFowOERaTWo4bmpNeVVJenJHODJsNHpfXzMtd1N2TFlNWnUtOHJMemtuci1MXzZhYkhrakw4a2dHeGtnSGp5bm5tVFJrRDI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "LIVE UPDATES: Snow falls across north Georgia, temperatures dropping tonight - WSB-TV",
    "description": "LIVE UPDATES: Snow falls across north Georgia, temperatures dropping tonight  WSB-TVPHOTO GALLERY: Snow fun in metro Atlanta, North Georgia  FOX 5 AtlantaState of emergency issued, Cobb under winter storm warning ahead of snow  Marietta Daily JournalWeather Impact Alert | Snow arrives overnight as metro Atlanta drops below freezing for 60+ hours this weekend  11Alive.comGeorgia winter storm updates: Snow beginning to accumulate in north Georgia  CBS News",
    "published date": "Sat, 31 Jan 2026 16:28:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxORlZfdXVGT1ZBRTZJRmdvRWM1MnBlTDZlQlBaUUdkWGtPel9zeW0xaklDOFpVZEQ5QWxYNFIzNmpUdGR0YmJFb2p3TVdyYVM0TTlWdmxCdHdUQ1lHb29ZLVF3QnBrNjNQU1E2NHVGalE3S3BHdXJsQWVQa0d4cVByZEN0cU12Z2hySDhrNENOONIBowFBVV95cUxOZ3NiRlpmVnotTkNmYWNJeTlmRksxUW90Wk1GbUNKYmRwV2U2RV9LZkw1UXZaYU9mRGJoenZMek5vSktiRmQyRmhTeFY3d05EWTBlZHBaYkJFVWtaUUUxdFBwUnhjcHZTQUJ6UExJUlRMSkpIWlRrVTZtcEJFRFZ3eG16YWRQOHBJampOVF85bmRGbEl1ZUdxTjRMSllxN0hPTjVF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsbtv.com",
      "title": "WSB-TV"
    }
  },
  {
    "title": "Judge orders 5-year-old Liam Ramos and his father be released from immigration detention, source says - CNN",
    "description": "Judge orders 5-year-old Liam Ramos and his father be released from immigration detention, source says  CNN‘Mommy, open the door’: Mother recounts her terror as her 5-year-old was taken by ICE  NBC News‘Mommy, why don’t you pick us up?’: Mother of Liam Conejo Ramos shares her story from hiding  MPR NewsProtesters gather outside Texas facility where detained child Liam Ramos is held  BBCFather detained by ICE with five-year-old tells US congressman his son has been ‘depressed’  The Guardian",
    "published date": "Sat, 31 Jan 2026 18:55:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9OU3kwcFZDN25jcjk4TFNVblpmRU5DTGFyOUdOdE94UGJEb0k4MVl1eUxpbl9wSk1JX0xHSzB0dVV1bVh2Z1FVckdWLWZpekpRYVU0ZGxSZFdIYWxkT1pHX01JbFlkMlF2dGFzc3ctNUxrUEIwVmd0TC11WXE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "The ICE surge has disrupted business. Minnesota’s top economic official is ‘very concerned.’ - Star Tribune",
    "description": "The ICE surge has disrupted business. Minnesota’s top economic official is ‘very concerned.’  Star TribuneI'm a business owner in Minneapolis working 16-hour shifts so my staff can stay home to avoid ICE  Business InsiderBasic Services in Minneapolis Are Straining Under ICE Presence and Protests  The Wall Street JournalMinnesota Businesses Resisted ICE, and Now Face DHS Audits  Bloomberg.comList of Twin Cities businesses holding fundraisers amid ICE surge  Bring Me The News",
    "published date": "Fri, 30 Jan 2026 17:05:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5pR3V0Z0g2RjdxRU9iX0M2S2s1NU5UX1lGRHhobndYcVR4X1VKd09YR1RMNlB1bTlzdzB4VkhqaUd4R2NUTkJ3eGdGM0NHMTd5d2F1dDBXc25kTG9ERXEtaGxXSFRoY3RGcjRQcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Venezuela announces amnesty bill that could lead to release of political prisoners - NPR",
    "description": "Venezuela announces amnesty bill that could lead to release of political prisoners  NPRVenezuela plans amnesty law for political prisoners and closure of notorious prison  CNNVenezuelan regime to close dreaded Helicoide prison, announces amnesty bill  Miami HeraldVenezuela releases all known American detainees after Maduro's capture and government takeover  Fox NewsVenezuela announces mass amnesty plan for political prisoners dating back to Chavez era  The Guardian",
    "published date": "Sat, 31 Jan 2026 06:55:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5TMVVhelh2Z1FjenFERjZtRXU1djdLOHlfb2dSNWtOdmZuLXdaOHJyR1dlb2JRTzhqaS1DeHlOcWszVW13bUgxMW5HQkgtUHFTVFlSTTFaVURxOTNjZG53cmlwLXpCcFEydnVLOXVhZE5ZOG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Hundreds of Texas public school students walk out to protest ICE killings - The Texas Tribune",
    "description": "Hundreds of Texas public school students walk out to protest ICE killings  The Texas TribuneBay Area protests live updates: Thousands take to SF streets to protest ICE, Trump  ABC7 San FranciscoPhotos: Protesters flood S.F. streets for ‘ICE Out’ strike  Mission LocalSCUSD students hold walkouts Friday to protest immigration operations, policies  KCRA'This isn't America anymore': Thousands rally against ICE in SF's Dolores Park  SFGATE",
    "published date": "Sat, 31 Jan 2026 03:24:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQkR4Sk4yWDBvYV9SaDJKRGVwM0JEQ3hJR1l2TTBJV2d1RFFqUDR4bkNHVGVpSG5wdjZNaV9BalNUT1pRRUJwWF9uY1o3dURSVlFCMEcwUDJ3bk91T05WSV80ZWU4RmV0dzlza2pmYnNnRU5nM1JCbEVIUG1xdlJrMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "CBP employee in Minnesota charged after reportedly being found ‘covered in vomit’ in car - The Guardian",
    "description": "CBP employee in Minnesota charged after reportedly being found ‘covered in vomit’ in car  The GuardianBorder Patrol Employee Arrested in Minnesota After Being Found Passed Out in Car and ‘Covered in Vomit’  YahooBorder Patrol employee found ‘covered in vomit’ in St. Paul, charged with drunk driving  Sahan JournalBorder Patrol agent arrested for DWI in St. Paul  kare11.comBorder Patrol agent is arrested, accused of drunken driving in Twin Cities  Star Tribune",
    "published date": "Sat, 31 Jan 2026 13:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPSzg3NnlKaDJNY3d3V3hzd0hWem41LVNyUmZ3d1lCWWQ2VTVzV0IzdmxFZEVfc2R6NlJyU3ZHZnV6TGgwalpZWmdXU0FiXzU0d3VMMlc0ZUJDMXIzUlBtNUFpdlJ5MlR1VkRnTml0by1YZm1sTUI5bzMtWVF1bmJGRGJRWE1tZmp4cTgxLU10SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Jewish seniors offer to hide carers as 350,000 Haitians face deportation from US - The Times of Israel",
    "description": "Jewish seniors offer to hide carers as 350,000 Haitians face deportation from US  The Times of IsraelICE eyeing Ohio next, where it is expected to target Haitian immigrants  MS NOWMiami’s Haitian Community Braces for Deportations  The New YorkerFear, faith and preparation as ICE closes in on an Ohio community  Ohio Capital JournalSen. Moreno says Haitians in Ohio should have self-deported already  The Statehouse News Bureau",
    "published date": "Sat, 31 Jan 2026 06:56:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPc0dWcVczV292RkgwWVpsRS1WZjg4bHprQW5LWVc5Q2JvSVNLNVkxLUg2N29LMy1YM0k5N005cDBINGgyNkxBdmh5R0wyeHkxMDZNRFZWZlZ5VkdxNDVCNS1Pb01VSmFDV0U2VnlFaW1faTNzTk9MMG1NRl9zbnp0RW9FeTRsNlVscXRIYmVQY2NzN1ZDTmV1Znh6Y3FXVy1XMGFaVnNnN3NHNHY4bXo40gG0AUFVX3lxTE5haW9xcUxmd29aZVBET19rS196NkNrTWlIYjhWRHRBbkx3NEZCTi1Lc0hXRi1yaTZETE5BRFNnS2FRM25COEhTTEV3UENWR3ZTYkljTk5XYUdQaUc2OFhTeDFscjdrTmZNYmhKRUJsUzNYblV6a1hOaUpMUmctVU1kOV9OcnlGZmhETW84MlRpWXh3UmYzN284aDNhVG1weW5YeUxCVVJKOHhzOVhIa2FfNEFQVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "DOJ has opened a federal civil rights probe into the death of Alex Pretti, deputy AG says - CNBC",
    "description": "DOJ has opened a federal civil rights probe into the death of Alex Pretti, deputy AG says  CNBCView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 17:07:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPLW9CN2paeEhnb0RKc3dRYWRhQzJCWEUwWWNrR3pkeG9ZcHQ1bjJxOG9BdmVvQVU4TzZVYWk2R2FjakhpOFFsWDkxdy1xdXUtdmRBTHBfczVtc21YdmxhZXY3WVQ4d0ljbzU3ak02Z0NrQ2RJaDNWVlZ5YjR1N2RaY05velpZM2dNRnloZV9xLTZ3UUZMM1QySm9uZUNkM3hhSWN0dFpYOVRkendkaWpWMTB6VmZyd2VGdEs5RmhHbS1pcHfSAcgBQVVfeXFMT25xN3VabjZpa19iZDlxNDhLUkZ3VUx2RVRiYWJEV3FTWEdUeTB3aEZqSTd4dTNUS0pwemRyNElpWTVHNDdabXkybWRrNzAyR0poemRlUlZFa3hOWnZfVFYyb0Q5MS16WWFsUU54bndfd0lobVhtNm5raGRlYXFXRk0wbFpMbVVjdGV5TmEtTzBEV1pyS0tNRU9DejNhb3RfMGp6a3hibHREN1BHcUhqZFlPTEN3VjF5a3hab05pdTFhc29rTHVqVkY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran. - The Wall Street Journal",
    "description": "Trump’s Armada Is Getting in Place. Now He Must Decide What to Do With Iran.  The Wall Street JournalHere’s what military equipment the US has positioned in the Middle East as Trump considers an Iran strike  CNNWar Threats and Ambiguous Evidence: Trump Again Confronts Iran  The New York TimesIran Renews Threat to Strike Israel as US Attack Fears Grow  Bloomberg.comU.S. sends additional warship to Middle East amid Iran tensions  Reuters",
    "published date": "Sat, 31 Jan 2026 01:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQSDQyYWZzbWwtYW1JbUhUdlZyQWRtU2NGdTAwb2ZydzR3QUFNaS1zdE1XdkJVWC03a2pQOVRQTmljcFhiTHpqOC1udy1ncC01akg4Nkd3NllteUFGQm9qNGpUckdOS3BPUWhnZTQ3Wm1kRFpqYVNDV0hNenJHeklLd2syLTdvTnZXVkRmbnhLamd0SGYxR2o1VDFpREhxcFNYMkFEald5SHpSMU0zNzIyQ2tURV85WjVJZTZrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C. - The Washington Post",
    "description": "Brace for brutal cold as bomb cyclone drives bitter winds into D.C.  The Washington PostBitter cold grips DC region this weekend but a freeze reprieve is coming  WTOPDC region dodges another round of snow, but bitter cold and wind chill remain this weekend  FOX 5 DC5 things to know | Snowstorm to narrowly miss Baltimore  WBAL-TVDC Forecast | Frigid temperatures last through Monday morning with wicked wind chills on the way  WUSA9",
    "published date": "Sat, 31 Jan 2026 05:25:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOVndZMUd4WC1sQkFiZDhYSUJaY3JyOTU4WjA4alB6azJudTYxdlcxazFmbmw4UGYtajl0Z0RwdVdsRWt1NWw1WHl6QVVDZDU2UFVqMzlKYVRMTF9UeUt4a2VGRE10b19TT19YMWQzT0dERTVNU1VSWm5TZ0FHeUIxV1NkQ1Jrc3RPdXZJLWJTcVB1MTEwOE5QcDlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown - The New York Times",
    "description": "After Bovino Leaves, Minnesotans Search for Signs of Change in Crackdown  The New York TimesTrump signals retreat on immigration even as he doubles down  MS NOW‘Trust Has Been Breached’  The AtlanticWhat’s next for the federal government, immigration enforcement and Minnesota?  KTTC | Rochester, MNBorder Czar Tom Homan says shift in strategy will lead to a drawdown of fed agents in Minneapolis  ABC News",
    "published date": "Sat, 31 Jan 2026 01:07:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMWY0ODZtbkZtak5yZVNxVy1DQkcxX2NyMDVXRE1FVGNpN3AwMG90UU9Ob1BVQ0VUVXI5M2luLW1PNXduTVhVNHE4R0MxVzZiaE1oaXRlRHlocnpicGFXQlRVZjRjTUQ0OFRJRGRYSzNOOFJFcE5Xa2RzbzdpYWpDVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response - Politico",
    "description": "‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response  PoliticoGun Activists Bridle at Suggestion That Pistol Justified Killing  The New York TimesThe Second Amendment Was Never Meant for Everyone  The InterceptWhy the Minneapolis killings have driven a wedge between Trump and pro-gun groups  The GuardianA Breakdown of the American Idea  The Atlantic",
    "published date": "Sat, 31 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPbTExR1hNVXdpV1g5OTZvQ291Z2h2WjRpRkN5a3d2cVp1c3lIcmM0bWR3VWtFaG1wUW4zYU03VXUtYUZHUUQwbG9qbUtfNzhuVGNBQjBSSEpsTzFFc2RGSGlNbnV2UVEwNDlWU1VVcVc2UnBpM05OaEd2X0FfSmVIZFcyTkNsVEtLY0UwcTdNWHV3dXlaLWFtMWFnVkJiQUJTZi1RNXB1aTB5VEQtazZfU1NDRWw5dHFqcElmcEpiMUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "One person dead, 6 missing after fishing boat Lily Jean sinks off Gloucester - CBS News",
    "description": "One person dead, 6 missing after fishing boat Lily Jean sinks off Gloucester  CBS News'Deep in sorrow': Search suspended for crew of fishing boat lost Mass. coast  WCVBCoast Guard suspends search for missing fishing boat crew off Massachusetts coast ahead of powerful nor'easter  FOX WeatherUS Coast Guard calls off search for Gloucester fishing vessel with 7 aboard  The Boston GlobeUPDATE: Brother awaits word after FV Lily Jean sinks off the Gloucester coast  Gloucester Daily Times",
    "published date": "Fri, 30 Jan 2026 19:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE04ZGpsbHFjZWhCckRCX3FxbWlOUkdCWDRYemxfU2l0bldVYXRabDFFNWlrMldXcHluWU5rYXpLRk8yNW8zRXJTTC1ubDNRenZFbGpHVnBQa1ZHNHV1VWRxVjg0OWNDUHIzMWV1VmxneFZmQTF3MW5LQ1A1MXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\" - CBS News",
    "description": "Husband who had affair with au pair testifies on killings of wife, another man: \"Hoping to de-escalate the situation\"  CBS NewsClosing arguments Friday in Brendan Banfield trial after he testifies he saw his wife stabbed before shooting attacker  CNNJury deliberates in Fairfax double murder trial connected to au pair affair  WTOPHusband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York TimesIn 'au pair' double murder trial, Brendan Banfield testifies he confronted stranger fatally stabbing his wife  NBC News",
    "published date": "Fri, 30 Jan 2026 11:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxObUNKaXZycWkzLWhrVTV2RklOanI1bEhrVmdLZFlyOUkteG1BelRQLUpsb2NCR0hhWkJNSzd6YnlwbjJ2cV9wRkJGQ3h4cDZGMUNYckJUeGFKcGlJalRlWlR6Q3RlUlRQSHdENUxqVUg3QUx3VWN5U3BHWXZlWkVXZ195QVZueWc4VWxUeFpKNE9xSzZHOExUUjZkcm1OQy1tRFhkWV9B0gGrAUFVX3lxTE1pY0R3WHpVcnJGMWxTblRPR00wSjB6QTlvV0VZeVJwbUw4VkxtOFdxZG9hY2NVblFfNEJCVUxxaWhEdjNQa1RjSWtCd1NBVkU0QlBMNWlWQ01DWThTc0ZuRnZEU0RmX2ZpUFVjQ2xESWxtNDd2a0pCdjFRVUFBM1dROFl6c0dBTkhjX0NsTHlza3QwT0NnZXFCdWFBRVFwYThzaHVOaDViWFU0SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Lewiston High School students march in protest of ICE - ​​Lewiston Sun Journal​​ ​​​ ​​​",
    "description": "Lewiston High School students march in protest of ICE  ​​Lewiston Sun Journal​​ ​​​ ​​​Collins Took Credit for ICE Leaving Maine. Her Democratic Opponents Pounced.  The New York TimesICE halted its surge in Maine. The state might not be quick to forget.  Politico‘Be unafraid’: Mainers protest Trump’s latest immigration crackdown  The Boston GlobeWhere reports of ICE activity are coming in across Maine  Bangor Daily News",
    "published date": "Fri, 30 Jan 2026 21:06:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdU0xSVpkaG83OUpiRVpia19wSzJad0pfWGNVUmlsalhvU3E0RDRBQlQ3OFdSeXpGRy12UWlZYlVFS1Q4YVRidWtNTDA2VFV6SUQ3UGxmRFczN0NnRVRJMDB5NTVHR1pGaGJ4QUpNSm1vcDVYRjZLRU9CSTE1MjQ5Rk1SeUFhdDRGbEN1bld0UUoxdmJkWmNz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sunjournal.com",
      "title": "​​Lewiston Sun Journal​​ ​​​ ​​​"
    }
  },
  {
    "title": "Federal judge drops murder rap in UnitedHealthcare CEO case - DW.com",
    "description": "Federal judge drops murder rap in UnitedHealthcare CEO case  DW.comLuigi Mangione will not face death penalty after US judge dismisses murder charge  ReutersLuigi Mangione won't face death penalty in CEO murder case, federal judge rules  CNBCNews Wrap: Mangione will not face death penalty after federal murder charge dismissed  PBSLuigi Mangione will not face the death penalty, federal judge rules  CNN",
    "published date": "Sat, 31 Jan 2026 09:53:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQUnNuS3JKV3lTSUk3Q1NGdm5tZVVmUS1pZUxpVUw3bGlzbVZtVUZVcm9jdE40bzBiMDRyNFpqSkkwX2tlVjdzVE9SMkVfdjRNZ0VobmlVY2JvRjFBY3d1UHJ5b29tM3A2TkhmdV9GaGZwTWxKQk1udXlTY2FVOXF2NExRdWpGVldpN0lyQmFEbnhyLVdOOGpR0gGXAUFVX3lxTFAwQkpQVTVNYkRINnNhcXhzb1NMT3BEM2kzNjRDdmdkeDgzZ1k5TGtoZGNwdGNaams2aVdFel91b3F0eXBVYk13ZkhVY1lRclN0Rl9Ba2hUREVZMFV3VHBKY2xfRFRQR0g4OVdqdmhpZTdHdno4Y1VHbUNNWWhjLTMxaFF5czdndUdBbFdrYlgxZF9qekJZTTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues - The New York Times",
    "description": "Hochul Seeks to Bar N.Y. Police From Helping ICE on Non-Criminal Issues  The New York TimesDemocratic governors scramble to build a legal wall against Trump’s deportation agenda  PoliticoHochul campaign quickly weaponizes immigrant announcement against Blakeman  City & State New YorkNew York governor proposes bill to ban local law enforcement from being deputized by ICE  ReutersAlbany Police Chief Brendan Cox Full Comments in New York City  WRGB",
    "published date": "Fri, 30 Jan 2026 22:52:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9HVW9OVEhpSTZ1RElEZzBRb1ZfUWNXWldMaTBpQUNPakNkRFlYZEJnWVlSVGRqamRsd2xLNnlmY0hFN002MkZDa3l5TjFlUExmcGdkUVJTd2lnc1JTa0N1eEtJOVVrNFY2NG1ZRzk5TTk0dE1CVW1Nd2pVT2tQMUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest - ABC7 Los Angeles",
    "description": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest  ABC7 Los AngelesCitywide tactical alert issues after anti-ICE protesters clash with federal officers in downtown LA  NBC Los AngelesPhotos: Anti-ICE protests gets heated on ‘National Shutdown’ day  Los Angeles TimesICE protests spread across Southern California amid nationwide shutdown; L.A. protesters clash with police  KTLAProtesters clash with federal agents in downtown Los Angeles  CBS News",
    "published date": "Sat, 31 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQMVlacWV4T3FETllrM1lITldRaUZ1Rnk2YTJ3TUpXYVQ0VGNGYkU1R0d6WmpsZkhvUkxzNldKTnJZdlB6NmxGckc0d0M3Rjc3SUJ6aTNOaThwYkV5empDSEFqUUgtXzhkNHNydDk4UFpvVmxESnYyNUxqVW5uT25MNDl5d3Fwdk5MSkRZY0VuZkxoUGh5dTBLNnlRckxqRFdfV19aZXhPaWJvM3ZqU2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Trump’s immigration agenda is colliding with a midterms reality - Politico",
    "description": "Trump’s immigration agenda is colliding with a midterms reality  PoliticoTrump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.  The New York TimesTrump is scared of the politics of ICE. And it’s showing.  CNNThe government’s winter of discontent  Federal News NetworkSenate Republicans try to regain footing on immigration after Minneapolis blowback  The Hill",
    "published date": "Sat, 31 Jan 2026 00:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOaXVZcVdOTVJKaEtzR29IUldvQ3dpdU0tbktIUDVNSUhyZzRSeWJzUTRyNHdsSGl4VGtMSUx3dTN5NE9hanZrY21MMGIwbVRXVzg0LUFBWlRXcDZEZzI3V2lEMm11T1pPLXJIbHp1XzNRRDdPV2hleWhnVjhWZURDb2c0ak01VE85cWlJazIycFZHNTBPVmtDQjlQbWk0a3VDSTFQWVZucHlubXllRlVWZWlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say - Business Insider",
    "description": "Trump's political threat to 'decertify' thousands of Canadian-made aircraft risks aviation safety, industry watchers say  Business InsiderTrump says he’s decertifying Canada-made aircraft and threatens 50% tariffs  CNNTrump says U.S. will decertify Canadian-made planes, threatens 50% tariff  The Washington PostTrump’s threats to Canadian jets raise questions about a key customer: The Pentagon  Breaking DefenseTrump threatens tariffs on Canada planes and nations selling oil to Cuba  BBC",
    "published date": "Fri, 30 Jan 2026 20:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNZlRjOTltUDUxMzY2SHhGRGVYZERlWk5JSndCR1g0Wm1DeUNLWmF2aDB3WGdPZTVpakhMQ2p2S1NhNDRrWkN1RkNWa0NBZWpDdlpKOHFhWms5OVR0eUo3eFBlSzIyXzFuekZ6anpWYlA1UWJUSGpYX0UzZ3U3ZFRXV00yQkgxVXZPdWx3SmVUcE9kbWtQa1A0UFdVWmpUX2dRMnlmZ2NWSDdTWWJiMWRr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  }
]