[
  {
    "title": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions - NPR",
    "description": "Ghislaine Maxwell appeals for clemency from Trump as she declines to answer questions  NPRMaxwell Refuses to Answer Questions About Epstein Crimes in House Deposition  The New York TimesGhislaine Maxwell refuses US Congress testimony on Epstein, seeks clemency  Al JazeeraWATCH: Ghislaine Maxwell not cooperating because she is campaigning for Trump pardon, Democrats say  PBSOpinion | Why Congress deposed Ghislaine Maxwell knowing she wouldn't talk  MS NOW",
    "published date": "Tue, 10 Feb 2026 06:30:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE4xRDVxTFdOOHdSVk9oZTRRMHRQM2NwcnNFZHpaS09DSGlzbGphcWdyYmZsbHZTTjFlSHFOTDAzaGJBRlpQbC1wa2dTRU1YREJ1UnBWY3BhYW9ha1FJRUIxcElNR0JCQmx1Ym5rQklkcXpkZkJvb0N3WnlZOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Nancy Guthrie abduction latest: Savannah Guthrie pleads with public, 'We need your help' - ABC News",
    "description": "Nancy Guthrie abduction latest: Savannah Guthrie pleads with public, 'We need your help'  ABC NewsThe search for Nancy Guthrie is in its 10th day. Here are the key developments  cnn.comNancy Guthrie live updates: No ongoing talks between family and suspected kidnappers, FBI says  NBC NewsSavannah Guthrie pleads for public's help finding missing mother  BBCNancy Guthrie was expected at friend’s home, not church on day she vanished: source  foxnews.com",
    "published date": "Tue, 10 Feb 2026 00:55:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQZTRkcExyNk9mUS1SWWhIS1NNekhaQjRXSHhvOGhkdThVRTBVNF9fQ2Q3LUdRMlZLQ0xldXdHSVRLWndmcGgxYlBSMVAwbGU2X2hic3poRS1GM3Ixa2I4R2Z1M2t5YWNhSEhkVHYzLXp6eVJZMXR4UmFpSkY3Qi1EZVYwQ3lxWHdUR2lLR2xhMFo0SzY5UzV5eHBmUXDSAaIBQVVfeXFMTWdybmxTNUdTdE4yeFU2aTJYLXFSZDdISmw0NTl3OXZUYnhhaDlnRm9QUzZQcjVrVnhBRHVGZTBQd1BWSU1NYjRiVmZHS1hrWHZGOGMtcjFKdVZ1Z3Jqalc4eGRyOE1tRHNDODktQ0dCZENtRWRMT01IYTZlTlRKd3FyM3lnQU0yeW9rMVVCajJTY1hMdEZOYXhOUy05bDNFVU1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump threatens to block opening of US-Canada bridge - BBC",
    "description": "Trump threatens to block opening of US-Canada bridge  BBCTrump says Gordie Howe bridge won't open without Canadian concessions  Detroit Free PressPresident Trump threatens to block Gordie Howe Bridge from opening  The Detroit NewsFuture of Gordie Howe Bridge questioned after Donald Trump post despite testing phase  ClickOnDetroit | WDIV Local 4Trump threatens to block new bridge in latest tirade against Canada  The Guardian",
    "published date": "Tue, 10 Feb 2026 02:03:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1BN2FkaFp0cl9pY1F1OXhPT2EwLUtYUm1MM05GMWVQaDZoYl85ZzlLeWt6dzhWRWZHc3lLeVk1TDJpUjcwZVAxYm9HTnFQdlVvSWdzS29CZzBiQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US lawmakers call on Howard Lutnick to step down over ties to Epstein - Financial Times",
    "description": "US lawmakers call on Howard Lutnick to step down over ties to Epstein  Financial TimesHoward Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties  ABC NewsRepublican calls on Trump ally Howard Lutnick to quit cabinet over Epstein files  The GuardianLutnick and Epstein were in business together, Epstein files show  cbsnews.comMassie calls on Lutnick to resign over alleged Epstein ties  The Hill",
    "published date": "Mon, 09 Feb 2026 22:00:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9kaVluRmI5YjlDNkxKejZJa19WM2lYN2xmek5jUWFmekZ2VGt2TFdjUGJGallTRUg2UzJHM1lUU0tocE9GdTh5QXNkdWRheWdicmR4dmx0Zl9mYXRjeXZJcHNKWnpZWEhMTGhSQlZqc0I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Europe is confronting its Epstein shame. Trump wants to move on. - Axios",
    "description": "Europe is confronting its Epstein shame. Trump wants to move on.  AxiosJamie Raskin accuses DoJ of cover-up after viewing unredacted Epstein files  The GuardianLawmakers don’t rule out exposing redacted names of powerful men in Epstein files  PoliticoJeffrey Epstein’s Bonfire of the Élites  The New YorkerAs pressure mounted to release Epstein files, FBI employees compiled allegations against other men  cnn.com",
    "published date": "Tue, 10 Feb 2026 04:34:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9maGhYVTJqeDdzblJZRUpKZlhxdFRKc0c1eXJMSFdmdThSLURuQ0V5ZG5ycjRYNXhMb2tWUGN3NmZnV0ZvV3Y0aFhSZzdaRFJEQ2d5YXREVGZhSDhqU1ZHZXBSVUgtaE9PM1ltOVdUWnJsU0FOa3pYMkt1ZHhHNU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm - AP News",
    "description": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm  AP NewsJudges are regularly threatening contempt charges against the DOJ in immigration cases  cnn.comHow the Trump administration skirts — and defies — court rulings on ICE detentions  PoliticoImmigrants challenging their detention have hit a historic high. Here’s a look at the increase.  KSATHabeas Petitions Filed in Second Trump Term Hit Historic High — ProPublica  ProPublica",
    "published date": "Mon, 09 Feb 2026 18:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNWXdRQTdONzFxWVYwOGJuUlVEV1RiR0NDUzVTTnhVQUpVbHBRTU95QmtMYURWb1ZzZUU2bWQ4ajVJTW83SVo1Ty1Mc2xmc1B3LVBYb2x0RDBJb2VLUWFTa2J0bFo1Q3ZDZXZJSlNvbmVJcjd4NE40NWRKSFVKZTRhZjZjbjlZcHpBUm96alFMYjBCbUYya180VVpWNFk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Sheen beatification confirmed; date and place remain TBD - The Pillar",
    "description": "Sheen beatification confirmed; date and place remain TBD  The PillarU.S. Archbishop Fulton J. Sheen to Be Beatified, One Step Away From Sainthood  The New York TimesFulton Sheen: From popular TV, radio priest to saint?  NewsNationBREAKING: Venerable Fulton Sheen to be beatified  EWTN NewsFrom Emmy Awards to Exposing Communism: 11 Surprising Facts About Fulton Sheen  National Catholic Register",
    "published date": "Mon, 09 Feb 2026 18:11:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5jUnRtLW9mS1ZORjFYZnJRODdCSlp2RXhyd0ZQRDNlYjNTWW5SMFBWNzdQWWtncE5wU2FlZzFXUHJoTmVRR3dzWm52OGQ0N0Jnd1J5akxCWEhxN25UOXFFS0hBNTMyMEMwSnZ0ckMxSkxuLU5ITmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pillarcatholic.com",
      "title": "The Pillar"
    }
  },
  {
    "title": "Judge blocks enforcement of California’s law banning masks for ICE agents - Politico",
    "description": "Judge blocks enforcement of California’s law banning masks for ICE agents  PoliticoFederal judge blocks California’s law enforcement mask ban  cnn.comJudge Strikes Down California’s Ban on Masks for Federal Agents  The New York TimesFederal judge blocks California from enforcing ICE mask ban  The GuardianJudge blocks California law banning federal law enforcement agents from wearing masks  cbsnews.com",
    "published date": "Tue, 10 Feb 2026 02:56:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPOFhFNFc5VVVMTU9CVjRLSFZWNXdvSkFIWmFiQ1NKRHQxSmJSbnZEMFJIR0cydGpDWS15UmxTRERIT3NFNDRTMzAxMnJrb1BvZnJXcC11SWtiSnBpVVNsMXNUSjdmVUljU2loQUFRTWZVbkQ2TWM3MW5hUGo2WG4wSmExU2liTmNPblRrcThpTjN5UVpKNUFhbFNJdkVuNjZQSXotNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "A moment of truth for Democrats ahead of this week's DHS shutdown deadline: From the Politics Desk - NBC News",
    "description": "A moment of truth for Democrats ahead of this week's DHS shutdown deadline: From the Politics Desk  NBC NewsBacklash to Trump emboldens Democrats on DHS and ICE as partial shutdown looms  NBC NewsDems demand more from GOP on DHS  PoliticoTalks on Immigration Enforcement Still Stuck as DHS Funding Deadline Nears  The New York TimesDemocratic centrists stare down tough vote over DHS funding  The Hill",
    "published date": "Mon, 09 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQdVJnX3R1QVBKR1dJMzF5c19GUk83RS1WS2IzcWRvcEV2REc3NElnQ3NybTVHWkZVM0EyY05hblFVaGRSckhoTjNIR2xJN0pucUpDUVRYdDZYTjR6UGpuSHl2UXloRFpFMWdxOUJiNHQ1ZTVISDZVdGI4ZGRZbDIzQVM1dTFzYVRnMXFkeTZDdkZzSFhmTWxPeE9Wc0JnYVB0TkdMNXRDakZQLTB1Rk45a3dHb2lobDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "House approves housing bill, setting stage for tough Senate negotiations - Politico",
    "description": "House approves housing bill, setting stage for tough Senate negotiations  PoliticoHousing affordability package set to advance in Congress amid home-cost concerns  CNBCHouse overwhelmingly passes sweeping bipartisan housing package  The HillComparing the ROAD to Housing Act and the Housing for the 21st Century Act  Bipartisan Policy CenterHouse passes bipartisan housing bill as Trump zeroes in on affordability crisis  foxnews.com",
    "published date": "Tue, 10 Feb 2026 00:20:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOam81Q1UyMmQ4akVSSEllWDJKSVFNcTBBSmlkRlVxdzhJUVpzZTVGVnVRTzVJdHdyMFd5MkNpRnh5bV9DR0tiVDV2NVN2Zi10aUhOUU03LTRJalRCQ3lIaW9JUElNVUpWajRocWg5bTl3VW5ORVdLSF9UOFlDVVVudjY4TzRfYzREWlU3RFR1MWZST29TMEJRZlVSNzVyOWYtVTVLWVRFNVRwWVBTQTAtaTZWNXdnWVF2VGM4aWhrWGRGcV93X0NaenBwalFFaFczOUZPNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Immigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say - cnn.com",
    "description": "Immigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say  cnn.comImmigration court puts an end to Rümeysa Öztürk’s removal proceedings, her lawyers say  The Boston GlobeUS judge blocks Trump administration’s effort to deport Rumeysa Ozturk  Al JazeeraJudge rejects Trump administration effort to deport pro-Palestinian Tufts student  The GuardianImmigration Court Drops Case Against Tufts Student Rumeysa Ozturk  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 03:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNV3R1UkFrWWhZZDhhUHhIY01FVzZyMjJoWmZvdGV0SmJ2dm9uc3RvTEZLempiOE56NFJLX3JLalpXZnRYd2JKS25xbHdHOHlqcFRJSkFNeVdqcVU4R2h4Q0FSZENOSm9Ua25QWl85QkVDSW4yNE9iQWxDMFdUSHBfNTN3Y3FvZ0tI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "SFUSD teachers strike, Day One: Where have all the children gone? - The San Francisco Standard",
    "description": "SFUSD teachers strike, Day One: Where have all the children gone?  The San Francisco StandardSan Francisco Unified schools closed as teachers begin 1st strike in 47 years over pay and health care  ABC7 San FranciscoThese are the ugly facts and truths that are being ignored in the battle over SFUSD  San Francisco ChronicleSan Francisco Teachers Begin Strike, Closing School for 50,000 Students  The New York TimesSF schools to close for second day as thousands strike at Civic Center  SFGATE",
    "published date": "Mon, 09 Feb 2026 21:37:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNclZHS1BlMTVRaXU4Qm1vVnRQcFJtYWM3aThWNkIwZGdMUTN2ZnVEdWxCdlotNEFvRnlJOFNWdHZFOFRPNnNmN095UVJEMU9mT2lwbjMxcG1BcFlDWjNZeG1DUzhBc2FTQ1VuZkZwaXNQbDBSellxbHlhbHZuUDlyWldvSlF1ZWlLblNobHp0ZG9mQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Here’s What a Warm Night Looks Like for Homeless New Yorkers - The New York Times",
    "description": "Here’s What a Warm Night Looks Like for Homeless New Yorkers  The New York TimesExtreme cold in New York City leaves 18 dead  BBCExtreme cold: Sanitation Dept. works to clear snow; Citi Bike stations blocked by ice; School delays due to subzero weather  ABC7 New YorkOutdoor death toll in New York City rises to 18 amid extreme cold  ny1.comAt least 18 people now dead as historic New York cold stretch nears end  The Guardian",
    "published date": "Mon, 09 Feb 2026 23:53:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNRXpIMlpxZ3JZOFlPUDNCcE1zZUhFa2RiaUh0aWZ0UWlkczZYam1jaGNSakhfVVJxLUlqdFhiZkxJN1d5TnNZeUlldDc0UzNseGxEenNPZjZsTnJfeld2QVU5enJXYTlqR2h1QnNqRDcxVnkwUUtzNkRQNmlPdUJJVjIzajM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Air Canada suspends Cuba flights as island set to run out of jet fuel - Yahoo! Finance Canada",
    "description": "Air Canada suspends Cuba flights as island set to run out of jet fuel  Yahoo! Finance CanadaAir Canada Cancels Flights to Cuba as Cuba Runs Out of Jet Fuel  The New York TimesAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  cnn.comCuba says international airlines can no longer refuel there as Trump turns up the pressure  CNBCRussia warns Cuba fuel situation critical; Havana slams ‘cruel’ US tactics  Al Jazeera",
    "published date": "Mon, 09 Feb 2026 19:17:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNeVJ3aUFDM0QwOXJVdExQQjN6NzF1em1UTDE4N1EyVzkyVDJ6YzBrV2xZMnF0Rm8wN1N0aEQzZ2Q1LVlCZ0ZWaDJQMVM4cjc2bUxVc1phb3lnRWg3ZUl3Uk0zZ2pra2pHRGx6X21TWXRYV1FIZElPa093SFpMMXN0ZUtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.finance.yahoo.com",
      "title": "Yahoo! Finance Canada"
    }
  },
  {
    "title": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests - The New York Times",
    "description": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests  The New York TimesThe world’s top nuclear powers have no arsenal limits, here are the countries with nukes  foxnews.comThe Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die  SlateNew START ends. But a one-year extension could bring many benefits  Bulletin of the Atomic ScientistsScoop: U.S. and Russia agree to observe New START nuclear pact after expiration  Axios",
    "published date": "Mon, 09 Feb 2026 23:46:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdkR5U1RKaERQUzc2bkFoRjZuY1NSS0xKVU1YblZjQ0dGcEFKY3lTeFVCV2tKeUhnemI0UmpIU2xYZFBxanZsNTcySzR3eVA3c0xjV05RdWVrb05jUVNRRlFFaHJEWnNONmttVWhoX2xOSGdjTFdOX3VKOFF6X0dzUmNWZGViX1prcGlFLUVVbGJBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "“A new low:” Trump’s racist Obama video finally compels some Ohio Republicans to draw a line - Cleveland.com",
    "description": "“A new low:” Trump’s racist Obama video finally compels some Ohio Republicans to draw a line  Cleveland.comReaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics  The New York Times'Indefensible': Black Trump allies grapple with fallout from racist video of Obamas  ABC NewsGospel Music Singer Sandi Patty Comments on Trump’s Racist Truth Social Post: ‘The Millions of People of Color in Our Country Need You to Do Better’  BillboardTrump refuses to apologize after posting racist meme of the Obamas  NPR",
    "published date": "Mon, 09 Feb 2026 19:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPLUYtM2M5ZHA0eThzQ2hWQnNvc2xnZGFvT0ZybEM5UFRuZWU0WU5PYnpUYzdrV2VET0xKU3RDRGxtRkdFcnM1Q2dybFBydTdyUjgxU210ZUd1ZWI0SWJYcDQwTE11MFJaRUhyTGRWRjM5Zy1GcG5zd0tHY1M2MFNjR1c4TFJBdldaTEpHbUkyRTRMYVNkWDBwTG5lWHZwN3I3cFd4akFnV2tVNWluZ2YyeTRmOXZTOHNLSERPU1N3NEVWM2ZaY3ZlWnFCaEXSAeABQVVfeXFMTlJwOWkwTE96QkxjQXdJNXhhelpYaEtUT2FGaTZOTjM0Szc1YkR0Y2x3b0pBREpOX19Cbmd2UmVQdUZ1ZFNZS19TM1E2VEROQkx3RG91elVvczNhUmFBWUtfNEdqeVdiekItSHhoWUF2bUZoVTNyTlZBR0VLR3pLUTczajYySXhBYzY1YnN5V29SWWx3TTBNeEN4cy1yb2ZEVXpzYXR3Skw1QVJRRGRjb3RJMERSZDZobzI4ZFJBcmZIaUxMcmhPWllmUEEzV3ViUklQNGRpQmg5X0pKd0FEQi0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "In Terse Ruling, Judge Shows Frustration Over Federal Seizure of Georgia Ballots - The New York Times",
    "description": "In Terse Ruling, Judge Shows Frustration Over Federal Seizure of Georgia Ballots  The New York TimesThe Conservative Researcher Being Linked to the FBI’s Seizure of Election Records in Georgia  ProPublicaFulton County argues FBI seizure of 2020 ballots shows ‘callous disregard’ for constitutional rights  Politico“Confidential” Agreements Show Trump Administration’s Plans for States’ Voter Data  Brennan Center for JusticeFederal judge orders Trump administration to produce information that led to Fulton County elections raid  WABE",
    "published date": "Tue, 10 Feb 2026 01:30:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxONTFZM2MtX09iX3pJSU1DV2QxSEZGTHJHelZ5ejNwcXZ4aTRHRFgwZHc2ZVZ0eTZHZlh1c1hLUDZEOHA1LWVRSHlrdnZUdXNpTDVRRC01RldsLVRsY09CTGZtV2xqMjhHanZEUXpzYU5UVjVhN2J6UWVHNVlRRXVQMnFzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House - ABC News",
    "description": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House  ABC NewsMd. Gov. Moore uninvited from White House bipartisan dinner: 'Blatant disrespect'  FOX 5 DCTrump to exclude Democratic governors from usually bipartisan White House meeting  YahooWhite House to host the nation’s governors, but only Republicans are invited  MS NOWWes Moore suggests race may be why he was not invited to gov dinner with Trump  Politico",
    "published date": "Mon, 09 Feb 2026 19:48:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOdlFUdTNqUm91MjBUTUlTSjZxWWQwaDhfQ3lfczFFc3NDMlNIMXFtelhFR1VndXE3VUFBZVBaTEMtWFRRaWVPQ1E1WGZfOXMxU0JlaC1saEtUSzAxX1duNmY5NUswcWtMT2RTM3gySWRPd0w0bEVVZU1fY19sal9jcnBJNjJ5MmFLdU13dUt0bUdGOTk4STctQVBKNUxwSzJwNXAxcVhhclNqZmhtRGpsb0k3UExwYkHSAbwBQVVfeXFMT1gtRjM2QjZXeTZaV1c4V0hEYmE4VDd4aUJwTXBKWnBVM3RldUJVTGZadVNMalZqNzl4N3dEZ2lBUzVvQ1JQNGdQSExHNF92dEVZaWx1YllfaV9mTldtNzhsQ3VQaUFEYk5OV2dlTjFNUXdUQlpBbFRIUUF3clcyREVWWTB0dzFlYmVvZGdNdjY3NThhTlNLVUlCcGR6VEVFWi1JM19Rb0t0czJVYzNfc2duREROQWxrclo4TUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "UN is waiting to see how much the US intends to pay of the nearly $4 billion it owes - Politico",
    "description": "UN is waiting to see how much the US intends to pay of the nearly $4 billion it owes  PoliticoUnited Nations presses for answers on US funding commitments  Al JazeeraUN seeks clarity on when US will pay dues, and how much  ReutersU.S. plans initial payment towards billions owed to the UN, envoy Waltz says  CNBCU.S. plans initial payment toward billions owed to U.N.  The Japan Times",
    "published date": "Tue, 10 Feb 2026 03:22:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPRWdVYWQ4ZzJQZFhkUGk2LXQxcDRQVUhfdnJlSGVMMGM2VUpZNXBZaktIS1A3SVc0bGVHMXE4UEZPVk4tcUhPdXRWdjR5SXBTYnJuVlpsUkRVN2lZbHV3UE1rU1ZCclJBdTRTOFZLTUZKNzA1cnRiOU81N0h5RlZKUFh0ZElwRmFYY2pFMmpVdkNJekhQcDlIVS1OUDJldFQ5N0dnSEl4U2xPdUlFdUJ1YmVqRzR0eDdLNDdJRVQweERyU2tmR0lLczBZbjJLQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  }
]