[
  {
    "title": "Jesse Jackson, a leading voice for civil rights, dies at 84 - The Washington Post",
    "description": "Jesse Jackson, a leading voice for civil rights, dies at 84  The Washington PostJesse Jackson, Charismatic Champion of Civil Rights, Dies at 84  The New York TimesFrom Operation Breadbasket to Mitsubishi: Jesse Jackson's impact on Chicago  AxiosObama, Trump and Biden lead tributes to Jesse Jackson: ‘one of America’s greatest patriots’  The GuardianSharpton honors mentor Jesse Jackson as ‘the steady voice that guided me’  The Hill",
    "published date": "Tue, 17 Feb 2026 20:24:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWDN6UnVmdlc1SHlHQzZXZ3pKem9obzdmZlN1Wk9hZkNNckU1UVo5UnZlMjdiNTU0Q3F0TkZpQ013X2V1V3hadWZMS21DTjVpY004NlhWa1BWbHptRWxlQ284Z1dmNnd1OEVTZWpaTEd1ZmwzUkNWelVpSURIVFl5YWRLVFZJRkZEemRybWl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Top Trump administration immigration spokesperson is leaving - NPR",
    "description": "Top Trump administration immigration spokesperson is leaving  NPRDHS spokesperson Tricia McLaughlin to leave Trump administration  PoliticoDepartment of Homeland Security spokesperson Tricia McLaughlin to leave agency  CNNLive updates: Democrats make new DHS offer as funding fight drags on; Tricia McLaughlin to step down  The HillDHS promoting McLaughlin's deputy as new spokesperson  Axios",
    "published date": "Tue, 17 Feb 2026 19:57:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNUnhzeFlFYS1lX1BqMGpKTGxjWnFvTVBJZjRvaWYzNHhXMHNqS191eElwaTBsWk5fTkFXVlJWWkFmd3pfaWlBSUo4V0ZFdUJIYTlxMXFqWm91czdtTEZiTXR1QkVBejU2Z2tJYnRQUkJ5T2p6bnBRWEFFOGJHdUZWQ1VPMkV2Y3ZpRUxnck5CcHdrZjBxcjVj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Sheriff says Guthrie family ‘cleared’ as suspects in Nancy Guthrie kidnapping - Los Angeles Times",
    "description": "Sheriff says Guthrie family ‘cleared’ as suspects in Nancy Guthrie kidnapping  Los Angeles TimesFebruary 16, 2026 - Nancy Guthrie search  CNNInvestigators Think Savannah Guthrie’s Mom Nancy Guthrie’s Abductor Purchased Clothes From Walmart  YahooSource: Nancy Guthrie’s abduction believed to have been intended burglary  AZ FamilyNancy Guthrie abduction investigation yields no database match for DNA on glove  The Guardian",
    "published date": "Mon, 16 Feb 2026 21:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOSkJwLW04bUlTMzlGdUU5cUhtUHdWMVk4TjVPU2RZN1cxWC00UWNpdUc0d0M2TFZzcjctM3VIdVlmNWx4ZFdJeXhGZ1ZfdnVkaEpUZ0hibHN2bXBaQmpsNy05bzdwRWJxdndwN1ZaTW9WYWhRbmxUcW9lNzZ5NGJxb1FGOUpDdFRPM21nVWVjbXFuWG14b1pTQmxaS3VhUWl6QXpFaWNvb25NaDIzNEpvMW5tMEdobVAwdFlsdS1Bdy02RW0tWjRsdUNFV0hOUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Colbert says CBS spiked planned James Talarico interview amid FCC pressure - Politico",
    "description": "Colbert says CBS spiked planned James Talarico interview amid FCC pressure  PoliticoColbert accuses Trump administration of censorship after CBS pulls interview  The GuardianColbert claims CBS blocked Talarico interview over FCC fears  Honolulu Star-AdvertiserColbert defies CBS over interview with Texas Senate candidate James Talarico  AxiosCBS kills Stephen Colbert’s interview with a Democratic candidate. So why was Josh Shapiro allowed on the show?  Inquirer.com",
    "published date": "Tue, 17 Feb 2026 17:23:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNbDM4UVI4V0EwdFN5NGNsRVEzYU4xaWtXX0RLMkZTMUZzbzU5WGRfUHlBWEc1b05OTDZpU2h5bXJvWnloN2Z1S1JjRXMyWFI4UmNPNmdEOHpFS1NFYWxHRTRrdUl4RkFBX3JMLTM1NktrdE1QVnFicVcxdjdTd0JNWGszR0p2MW1fd0Zhd2c5X1NiUFUzekhoY2VFNzZaZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end - San Francisco Chronicle",
    "description": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end  San Francisco ChronicleCalifornia Forecast: Storms to Bring More Snow and Rain  The New York TimesNorCal storm coverage: Zero visibility due to snow as Interstate 80 remains shut down  KCRABig Bear area schools closed due to hazardous conditions from snowstorm  KTLALatest storm brings heavy rain, frigid temperatures, low snow levels to Bay Area, Central Coast  CBS News",
    "published date": "Tue, 17 Feb 2026 18:39:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNU0lnWDVIUWp5Z3FXMGZtWHc2dzFTbWVzVDJMX1daS29ZaVpxWV9yR0JZZG5jaVNBSFFXaFNSQ1hGUnU4dG1wLTByRmc5SmE0S3hhV2ExREZKd0hxMW00TGNSS1BVNGl4SnY3ckp2cVFZbEFmRDlBLVNmOURyN3FOVW1tWmJfa3pLLU5LVzl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "U.S. and Iran say progress made in Geneva nuclear talks - Axios",
    "description": "U.S. and Iran say progress made in Geneva nuclear talks  AxiosWhirlwind day of diplomacy as US holds talks on Iran and Ukraine in Geneva  CNNUS-Iran talks live: Tehran says understanding on main principles reached  Al JazeeraTrump Administration Live Updates: U.S. and Iran Hold Nuclear Talks in Geneva  The New York TimesIran foreign minister says progress made in nuclear talks with US in Geneva  Reuters",
    "published date": "Tue, 17 Feb 2026 19:08:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPYnUxc1hwRkxmVVRjTS1TNWNUV3hKdFBUbGNPUzdsX19sRURRWm9WT2g5a0tDeHZGZEJ0M0ZHWDFSSFNoOWJwOGI1NXBKWUhxVVhVdDVkNDB1MVNaZ2R6R05VS3lLVEpJOGxhZk5GbVFIZXZ4V2xJYVMwUE5QQWxXaF9LRng?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Democrats send counteroffer on ICE reforms to Republicans as DHS shutdown continues - CBS News",
    "description": "Democrats send counteroffer on ICE reforms to Republicans as DHS shutdown continues  CBS NewsDemocrats and White House Trade Offers but Deal to Reopen D.H.S. Remains Elusive  The New York TimesNo clear path to ending the partial government shutdown as lawmakers dig in over DHS oversight  AP NewsDHS shutdown has no clear off-ramp: 5 takeaways  The HillSenate Democrats send counteroffer to White House amid DHS shutdown  Yahoo",
    "published date": "Tue, 17 Feb 2026 19:27:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPZlo5WWx0V2FfTVRyVF8zaTltT3R6dEIyZWtuTXVRUHRfbnY4dDVBRENQYkZYNkUzQ3RjUG5BNUhFdVBOY2xjcUVfOEdGWnhaa0RTcGl5NEMzdUF1ZFAyVTV6dUl3bHVyVkhDZDhFbHhZdW9nS19tdUI3dGE5SWdBSGt4U3JVbVptaGJpUlV1TU52Z9IBlwFBVV95cUxNTDVseEdCTmJzSTFVMC00SlBYdkFPaVBaSzNQSGoyZTBYcUtRS241MXExXzRGcEdiSUFzdUZzR3B4MnpqVkxiNEZSdExUNlRxaGk1Wm5OOE94OE5fRWN6cWRlRkZjMWRVREhkVE9lc0lsRlgwblJibGNBOVJ5UVJzVDdzOFdsYnRzaUV6SnhaQkxlajhxNlBF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump lashes out at Maryland governor's over Potomac River sewage spill response - PBS",
    "description": "Trump lashes out at Maryland governor's over Potomac River sewage spill response  PBSTrump directs federal government to intervene in Potomac sewage spill  The Washington PostThe Potomac sewer spill turned into a political fight. What to know.  USA TodayPipeline repairs to take up to 6 weeks as Potomac River sewage spill continues  Bethesda Magazine'Remnants of sewage' including toilet paper, left behind after wastewater pipe collapse  WJLA",
    "published date": "Tue, 17 Feb 2026 13:04:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMmd1UlRTSWVzdk00R2hCd1c4SVRBZ0dTbmF1bUswVXJueUpFLTFhSDE0TmJHX0lWOUxSb19SMkxZX19WU1ZqY3JVVTlOWXB1bzhpYzNyVlBTenBEQksyeFdMcmdyeG16UUwzNGlKa19KTG9jYUJmRjBXUEhZQjlzanpnZ3VsbTQ2Ym14TnV0bUV3Y1dSQ0JRT2xQSzFfMmpjNE41N3ctbUVndUZ3cEoyZGVTS3hOdmRN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Mamdani Plans to Hike NYC Property Tax to Fill Budget Hole - Bloomberg.com",
    "description": "Mamdani Plans to Hike NYC Property Tax to Fill Budget Hole  Bloomberg.comMamdani floats increasing New York City property taxes as part of $127B budget plan  PoliticoMayor Zohran Mamdani presents preliminary budget for NYC a day after Gov. Kathy Hochul promised more funds  ABC7 New YorkMamdani Threatens Property Tax Hike, With Income Tax Raise a No-Go in Albany  THE CITY - NYC NewsMamdani to propose property tax hike, pushes Hochul to tax rich  New York Daily News",
    "published date": "Tue, 17 Feb 2026 19:10:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPeFpTOHNVeC1lam9JM0NPc2h4eVFvZFdKSUVhWXFFS1RRMG5hRHhfb0UzUmc4OVNXVjJTN1dsZHo0THU5elJ3elBfQXFUOW83dlJ3QnVnV2tQWDBGM21WOHhRSVQ1dEZuNVdCNDNYS1p6SDM3cmZFS1pSajU4ZFY5S3RKbG1UcUpwWXhiU3FzOTFNLVRxNGd6d21qUVM4MU5na0FHNWZUS1c5UzJEU19INURn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Iran says it temporarily closed the Strait of Hormuz as it held more indirect talks with the US - AP News",
    "description": "Iran says it temporarily closed the Strait of Hormuz as it held more indirect talks with the US  AP NewsIran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.  CNBCIran Holds Exercises in Strait of Hormuz After Trump Threatens Military Action  The New York TimesIran launches war drills in Hormuz Strait as US carrier is flying missions 24/7 before Geneva talks  Fox NewsIran says it closed Strait of Hormuz for live fire drills as it held nuclear talks with U.S.  PBS",
    "published date": "Tue, 17 Feb 2026 18:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNMjZ0NVhNYkR4SmZKR0RBdzFlQjNzTV9kOVBwcmJaRWNTSzBfNnVBbVRMak1Hc3pVY0M0S3RmUHgxa1VocE50UGRweTFhdVJwU3JiV2ZfS2N4SmFjMUJpMDU3cXVUQkdyT3Q1bm9WV1NiY1FWZFQ0eEkyWVh1clZ6OUE2WXRmMzNXNzlzOE5ERQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "New Mexico approves truth commission on alleged Jeffrey Epstein ranch abuse - The Guardian",
    "description": "New Mexico approves truth commission on alleged Jeffrey Epstein ranch abuse  The GuardianNew Mexico approves comprehensive probe of Epstein’s Zorro Ranch  NBC NewsNew Mexico lawmakers launching Epstein ranch investigation  The HillNew Mexico House unanimously enacts Epstein ‘truth commission’  Source New MexicoEpstein ranch in New Mexico bought by family of ‘Trump Republican’ candidate  The Guardian",
    "published date": "Tue, 17 Feb 2026 17:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNMnA1cVBuZVNwQkFITHVqU1RmMklSckNGMTZ6bjQxNDhycWRfclp0ajR1N0dleUZNZ3g4cXBxZ180Q2l5UHZ0cm1zN0tBWi1Wbmx6UjhQOFB0TUwxX0xQcE5NUE1sYWV3NXZCVkVzV21uQUJkZERpWlY5UnZwNjZOdkpHVXlIMjhjNjg4Qg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "The Epstein files have brought a wave of resignations and investigations - The Washington Post",
    "description": "The Epstein files have brought a wave of resignations and investigations  The Washington PostThe Price of Admission to Epstein’s World: Silence  The New York TimesJeffrey Epstein’s Bonfire of the Élites  The New YorkerEpstein files fallout: The high-profile people burned by past dealings with a predator  CNBCEpstein files end business, political careers across globe  Axios",
    "published date": "Tue, 17 Feb 2026 18:00:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPOHBiNGo2LTZKbEw0eEdlLVdxYUhYWWJCNUFaSkZjdENjVlF5eHU1UG1jaEw4Q3NfZVhNQ0EyWVhxbVhja2VBMzZOOEc5djRBd01iVHhiOTlWS2R3c1BnUl9jbGQ2dWtTRlh3Rk5PMDhUbTJhZ1pydkxFejJPcmJLUlFicW1MVm5LaFZ6clZMMTd3cl9NS2tfQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump Admin Ordered to Restore Slavery Exhibits Stripped From Historic Site in Philly - Rolling Stone",
    "description": "Trump Admin Ordered to Restore Slavery Exhibits Stripped From Historic Site in Philly  Rolling StoneTrump administration must restore slavery exhibit at Philly's President’s House, federal judge rules  WHYYJudge cites Orwell in rejecting Trump’s bid to erase history of slavery in Philadelphia  MS NOWJudge orders Trump admin to restore slavery exhibits at President's House Site  6abc PhiladelphiaSlavery exhibits must be restored at President's House Site in Philadelphia, judge orders  CBS News",
    "published date": "Mon, 16 Feb 2026 21:23:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPVkhNaEVsT3JKeTlhLVZnZ3BLNDJUU3Z2OGJ4enIyUlNKMDl3VEVkblhsdHRBQU9JTC1fU3JuaXpaaVc5MDIwSFhZU01FMHdzRWJQSmZIakxNTFR2NVA5Wk1TbHFjS1JiVG92VWJkNE9pWmRxRGhuUXptQlVHQkgzdkpFNXpPalJlUURZbTl6c29xRFVZMXFOV0VrLXZaQlRhRjFFdXJhSlhMR1FnQ29GX194SE14QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Minnesota Republicans defend their focus on fraud despite the ICE surge that followed - NPR",
    "description": "Minnesota Republicans defend their focus on fraud despite the ICE surge that followed  NPRIn Minnesota, Legislature braces for federal immigration fight as enforcement surge winds down  NBC NewsMinnesota lawmakers gear up for ICE policy clash  AxiosMinnesota House Republican leaders don’t want to talk about immigration enforcement  Minnesota ReformerICE access to Minnesota schools restricted under new DFL proposal  FOX 9 Minneapolis-St. Paul",
    "published date": "Tue, 17 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNS1pXaEFpdWJVdWIzcVdzREFYY182VThMRjVFMjk4OTZzTVNVZHlPZmxPX0hGZnpiTXJuRTJNd0VUc1dmMURCR20tVndFWDFpNjcyOGtpOERsQkxfOU5kZ3BBTWxzRHA5Vm5QRVFUUEpDZnFWcEMxa0FCZU0zMFFJRFJwbjBPSmt6clpiRVNyTF9WYjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times - Los Angeles Times",
    "description": "First wave of nearly a week of rain hits Southern California. Snow expected for Mammoth, Tahoe - Los Angeles Times  Los Angeles TimesLos Angeles weather: Several areas see major flooding as first of three storms move in  FOX 11 Los AngelesSouthern California storm totals: See how much rain fell in your neighborhood  YahooTimeline of powerful storms headed to Southern California  ABC7 Los AngelesDamaging winds, rain hit the West as a winter storm approaches the North  Yahoo",
    "published date": "Mon, 16 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxObEtQN2JwRWRhbEFmcFFXWjV6VmFKU3FaMWZaWjJsaXQ4bkhQOVhyZDdmVFZvVTYyT0JDbWl1aVI5a1p0MXJxa1J2ZXJrLWZITVVMV2VkM0FVam9VV011YV9OYXhlWUxwWG5WRFdqRmYtZXdvOEZKQnBBdlYyNDVYdUFJbXJrNnZaODYwNG1BOWYxb0w0MVNJNzcyeFNLMks0YTdnNmNRRV9GMlkxQzFGSXZlWTdwUUpfVmd1VHItdHJ6ejlldnZ4NHVjTDNJNExKLUlmUE9CblZxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say - The New York Times",
    "description": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say  The New York TimesDriver fleeing ICE officers crashes, killing a Georgia teacher, authorities say  NBC NewsMan arrested after DHS/ICE pursuit leads to fatal crash on Whitefield Ave  WSAV-TVLeaders share differing opinions on deadly ICE chase crash in Savannah  WJCLTeacher killed after man fleeing ICE crashes into her car, police say  USA Today",
    "published date": "Tue, 17 Feb 2026 00:41:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPb1BfdkZGbWVFenRvT2l6a3BaaDE3UHQxd080UERBU0pRQVZMWl9Hd21PS2dhdGUxTnFhSzZ2Z2RtOTg0bExUMGpBVEZjSjBwMkNYU2YycklnTU9PZ3QzRkcxMFV3bUk1bXA1Q2dkR2x6Y2RsYmw5dkNtTjRGMnM2Z3RpRExDQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump wants to prosecute anti-fascists as terrorists. This Texas trial will test his power. - MS NOW",
    "description": "Trump wants to prosecute anti-fascists as terrorists. This Texas trial will test his power.  MS NOWTrial for alleged Antifa members charged in Prairieland ICE facility attack begins soon  NBC 5 Dallas-Fort Worth9 alleged Antifa members face domestic terrorism trial for July 4 ICE facility attack  FOX 4 News Dallas-Fort Worth9 people charged in the Prairieland ICE shooting go on trial this week. Here’s what’s at stake  KERA NewsTexas “Antifa Cell” Terror Trial Takes On Tough Questions About Guns at Protests Against ICE  The Intercept",
    "published date": "Tue, 17 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE9jazZPTGdvWV94YXRsUFBOWUZtWTl5T0I0UkNERmpIMkNJMEMtTjNJMGRuWDBvMEZObFEtdjM0dnhYdmM3LVFwVlR5cHZWUUZsNFF2WA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ms.now",
      "title": "MS NOW"
    }
  },
  {
    "title": "Rubio to Europe: We Hit You Because We Love You - The Bulwark",
    "description": "Rubio to Europe: We Hit You Because We Love You  The BulwarkNo, It’s Not Back to Business as Usual  The AtlanticThe U.S. ready to make up, Europe ready to break up in Munich  NPRSecretary of State Marco Rubio at the Munich Security Conference - United States Department of State  U.S. Department of State (.gov)Warmer words but relations remain frosty between the U.S. and its old friends in Europe  NBC News",
    "published date": "Mon, 16 Feb 2026 14:25:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPLVVhVm5yQzRxRlVEcjVIM2ZnT1htN1U1amlhWnZwUFJwVkxCLVpGbDV5X1pzTmk2UTd2S3ZWZUVwQkxFVGdjOXk3N3RmNXJ4elA0S1VONkt4QlVmU2hhZmVYeDBSYXRYYXZqbm56dzBsMl9BM3ZUMXBmbUd3RmJCMVlnbmkxaVF6MXVQV29OQk9USm9TeE1ROTVKY3RUb3o4QmRfY0tObFprRG5VMGRuUDQyeEMzYVVkcm4zX1hkMzRIdnNKTy16MVBIVjh2VUYxd3RpMGZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "After Trip to Germany, AOC Expresses Frustrations - The New York Times",
    "description": "After Trip to Germany, AOC Expresses Frustrations  The New York TimesOpinion | Class warfare comes to Munich  The Washington PostAOC’s Munich Stumble Is a Warning to the Left  New York MagazineOcasio-Cortez says she went to Munich ‘not because I’m running for president’  The HillAOC mocked for ‘absolute train wreck’ weekend on global stage: 'Made a fool out of herself'  Fox News",
    "published date": "Tue, 17 Feb 2026 01:33:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPakc1LWFXSFEydnE5RF8yTi1HWnczRHFrWndWUFl5cGdxczVOdmVkd0QzZGMwMVdOQ3F5aU9FVW9tTEJ6TkxkeFVhVWFrSkVpVWtMbm9SWDJ1c1pCYm43THIwUFVjdW4yRU9NQ21MbHBZdnd4RWlaSWZHb2E4SWRCaXctc3JHODJiZ3J3WlNsWEZuVE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "\"Just making s**t up\" — David Roberts sounds off on the EPA - Public Notice | Aaron Rupar",
    "description": "\"Just making s**t up\" — David Roberts sounds off on the EPA  Public Notice | Aaron RuparWith Latest Rollback, the U.S. Essentially Has No Clean-Car Rules  The New York TimesTrump’s move ending power to control climate pollution could cost Wisconsin billions  WPREPA boss offers forceful defense for scrapping landmark Obama climate policy  PoliticoTrump’s Climate Repeal Will Kill America’s Transition From Gas Guzzlers to EVs  Mother Jones",
    "published date": "Mon, 16 Feb 2026 11:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9WUU0zejRiNWE5ZlFxS2JWYnlEcUU0d2hrMDhtdWkyTlhFSmw2UjdySVEyZEh2QVVmMjN1QUd1b1NqRG96UWZVOVhURTJsc1JZc2p2cENSRHJvVC0wa3dCN044S3ZzeUEweGhEV1lDMUhSRjZGZWVmSnYwdjh5SGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.publicnotice.co",
      "title": "Public Notice | Aaron Rupar"
    }
  },
  {
    "title": "More than 70,000 voters will stay on North Carolina voter rolls after settlement - NBC News",
    "description": "More than 70,000 voters will stay on North Carolina voter rolls after settlement  NBC NewsDemocrats celebrate as 73,000 North Carolina voters without proper ID stay on rolls  Fox NewsRepublicans settle with DNC in lawsuit that sought to purge 225,000 NC voters  Raleigh News & ObserverDemocrats, Republicans strike deal on North Carolina voter rolls  The HillLetters from NC elections board confusing voters  Carolina Public Press",
    "published date": "Tue, 17 Feb 2026 00:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOaDJJU3g2QzBmbHNJdFpjTW5aTUhVejNfMGhBZV9YV21YN3F4VEdqSWpmTE1YdXRVemJ6UjBYTE15YWNPdm1tSjI5Uld6RlpNQ0Nmc2tkNFNyOG1wYl9CZ2FiVzZIaTdWZEV4RGZrZHhHN1BXZ1VSWFc3SXdUM2tiWS10SklHMGxYM04wZzVLblN5dlYteWVFN2RmcFpUbHVLSkVRd2szSXJhTFdEVFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S. - Axios",
    "description": "Trump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S.  AxiosUS increases military pressure on Iran as countries discuss a deal  CNNU.S. Navy’s Supercarrier Deployment Could Surpass Post-Cold War Records  ForbesU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesTrump says he will be involved indirectly in Iran talks  Reuters",
    "published date": "Tue, 17 Feb 2026 01:59:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB3OVhBamN1UU93Sm50ZnJIR2I0R2c3cEMtNG9fR3NrZWR0THJBd200M21aZ1U1QUtiSzNmQnVEejFQVWlwRUJiNmllSEtoSS1ZRG92U2NocDhwaTU5dVdrWjFQS3NwLUNaZkhQMURlcFZiMmlTcmlVeE5yZ2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  }
]