[
  {
    "title": "US judge restricts ICE response to Minneapolis protesters - BBC",
    "description": "US judge restricts ICE response to Minneapolis protesters  BBCJudge limits ICE’s crowd control tactics following Minneapolis shooting  PoliticoJudge Restricts Immigration Agents’ Actions Toward Minnesota Protesters  The New York TimesJudge restricts federal response to Minnesota protests amid outrage over immigration agents’ tactics  CNNJudge bars Trump DHS from retaliating against peaceful Minn. protesters  USA Today",
    "published date": "Sat, 17 Jan 2026 16:49:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5NZnQ3OE9lczI3RnpwVldSNy1MaTZoRVVlU0ZxeGxmNW93cEdXOHRXTERjZDkwRWdJdVd3N2g1aEIwYVBsNFM2NWlneUJtQmhKd0VaZ0VZOUxtZ9IBX0FVX3lxTE9pMkhZRHFoWFlHNnRHRklXdzJmbDRFcmNHQ19DUjQtOGtvdjNLaDJQRkZQdlRQNzhGc3lvaG9fZmFnRldfZkRsMUplWnVMRE5CUlAxQ1F6Nzkzb0s5QjhR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump to POLITICO: ‘It’s time to look for new leadership in Iran’ - Politico",
    "description": "Trump to POLITICO: ‘It’s time to look for new leadership in Iran’  Politico‘He Doesn’t Care About Us’: Iranian Protesters Say They Were Betrayed By Trump  Time MagazineWhy Trump Supports Protesters in Tehran but Not in Minneapolis  The New YorkerTrump Was Told Attack on Iran Wouldn’t Guarantee Collapse of Regime  The Wall Street JournalTrump’s Fateful Choice in Iran  The Atlantic",
    "published date": "Sat, 17 Jan 2026 17:21:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPQzR0SUFOS29QN0VEVTZnS2xYVG1SeDR4d3NEQzdnWklBVEtTRWVWWXphT2dWZjR1dlRGUm80aXNiSDliM2JvdkNIdUI3eGd6T1BFV2xkbDBlUF9MQmpHVWp2ekJHbW4yQlFNa2VpS1lEcGwwM20zUTB3S05tRDBqS3VMUElLbHZocmJfUDBIWnY2OUlfUVRSV1JNd0w3Q1c0MFZhZGJkVmU0dFNZY3VNaA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Abigail Spanberger to be sworn in as Virginia’s first female governor - The Washington Post",
    "description": "Abigail Spanberger to be sworn in as Virginia’s first female governor  The Washington PostSee Spanberger's historic inauguration as Virginia's first woman in highest office  USA TodayIt took 75 governors to elect a woman. Spanberger will soon be at Virginia's helm  NPRWatch: Spanberger becomes Virginia’s 75th governor  WWBTInauguration features a 'First Gentleman's Pancake Breakfast.' The syrup comes from Wise County.  Cardinal News",
    "published date": "Sat, 17 Jan 2026 17:31:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTEdjQ0lYaExkcTVpbU9ZcWhEWnJwQkVqQ2tJLU90WU1Wd2gzMy1LZ0ljSkZsc21OSGl2ZGVKZGEyZWZwTXFZcEp4S1RhamxSdjdoZlBKV19SaGxXZVFLVXYwTDlhdF9waDdjc00yX0RqZl9KWnBadlVrZTAzc0NVVF9sa3BWcUI0V0RETFFYN2ZDSjItMFlVZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Minnesota officials ask protesters to stay peaceful ahead of weekend demonstrations in the state - CBS News",
    "description": "Minnesota officials ask protesters to stay peaceful ahead of weekend demonstrations in the state  CBS NewsMinneapolis braces for march called by pardoned Jan. 6 rioter  The Washington PostMinnesota officials discuss safety surrounding planned weekend demonstrations  5 EYEWITNESS NEWSWeekend protest safety plan presented by MN National Guard, DPS  FOX 9 Minneapolis-St. PaulState police, National Guard ready for weekend protests in Twin Cities  Bring Me The News",
    "published date": "Sat, 17 Jan 2026 15:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQRHo0em9XN2FXdTBkNTVZd05XOUl1VHVFYUNVVmtqWTZxYlEwd1pwU25IVWM0cFh6eFFydnpJcUNVOEhHdEhLSDAwSF9KYm92TnVWWklvZHJQajBkNHJxOGw4NjVnZmJMNmEwd25oQ0ctMHBmMENBeEFRVEhzX1pKd0lOUTBFanhWV19VS0FXaUd5eEVzbERSWGVrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Events in Minneapolis show how immigration enforcement has changed. What's the impact? - NPR",
    "description": "Events in Minneapolis show how immigration enforcement has changed. What's the impact?  NPRThe People of Minneapolis vs. ICE: A Street-Level View  The New York TimesAt least 4 alleged 'anti-ICE agitators' arrested in Minneapolis amid protests, agency says  KOMO‘Make no mistake, this is an occupation’: ICE’s deadly presence casts long shadow over Minneapolis  The GuardianList of ICE raids, protest updates in Minnesota on Saturday, Jan. 17  Bring Me The News",
    "published date": "Sat, 17 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQVGNUMV9CelpjMWR1LWxuVWNNN2loenZYa0J3M2tpU2M5UGMwMzV0WEdQOWlTRnduQ00tS2lKYXpncXlQWVd5V2gwVkd2UWtpRTJFTm5VWnNZQ0gtbkRVRmttbDlBTEQyNWZ0RVVQQ0FZRVpqWk54QVVvdVFjUlJsX3kzczNfT3pKLTZDVjlHMnAxZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Minneapolis ICE shooting live updates: Federal probe opened into Mayor Frey, Governor Walz - ABC7 Los Angeles",
    "description": "Minneapolis ICE shooting live updates: Federal probe opened into Mayor Frey, Governor Walz  ABC7 Los AngelesDOJ Opens Criminal Investigation Into Minnesota Governor and Minneapolis Mayor  The New York TimesJustice Dept. enters new territory with probe of Minnesota officials  The Washington PostUS justice department investigating Minnesota Democrats over alleged obstruction of ICE  BBCJustice Department investigates Minnesota Gov. Walz and Minneapolis Mayor Frey  PBS",
    "published date": "Sat, 17 Jan 2026 15:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNempIbWtVaEtWRDZibmYxVlVRUjdUVTltNGNTVUZSTWFUdTFQNFNaWjBEbVo5N3FLRVYtbThlTzNMem1LZHdIQ1dyTG9KVFB4Q01CU0s5aVdjTm5leC1uU19YWW9qbHN3Yml4MXJYM1RIRFAzQ3g2VTA4OVRpclc1OExPYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "From ‘A+’ grade to ‘we can’t stand this much longer,’ Georgia voters take stock of Trump’s first year back in office - CNN",
    "description": "From ‘A+’ grade to ‘we can’t stand this much longer,’ Georgia voters take stock of Trump’s first year back in office  CNNVoters increasingly unhappy with Trump on economy, new WSJ poll says  USA TodayAre Trump's supporters getting what they want from his second term? Here's what a new poll shows  AP NewsNearly 6 in 10 Americans believe economy is weak under Trump: Poll  The HillAmericans give Trump low marks on handling of economy as midterms likely to center on affordability  Politico",
    "published date": "Sat, 17 Jan 2026 11:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9VTkMyWlpCR3hWZHdmbmlMWWItcmVZRWdETXdkcktpSEk0ZlhGekpIdVduRjU2ckVxSkpLajJoM3FtQ29peDRWYVpWVzFWSEsyM3RDRzdOM01VRFdWZWlFcTM2VG1YOVNPelZoaWMzUnE4emNKbHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Syrian army moves into east Aleppo after Kurdish forces withdraw - BBC",
    "description": "Syrian army moves into east Aleppo after Kurdish forces withdraw  BBCSyria live news: Clashes as army advances after taking towns held by SDF  Al JazeeraSyrian troops clash with Kurdish forces after dispute over withdrawal deal  ReutersKurdish forces retreat as government troops advance across northern Syria  CNNSyrian government forces enter northern towns after Kurdish fighters withdraw  CBS News",
    "published date": "Sat, 17 Jan 2026 12:06:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE52OWFFS1k5TE15X3BpTUhHZGphV0FDWEhfMnhBM1FGM2RrT3ZDVFFFMWZJa28xZWxWWVRFSG10dW5wLVc2UmowZlY2WEYwSk9NMjZ2Z2kydmctd9IBX0FVX3lxTE1tTXozdFlCMUpyMFc4RmhQdk9ERDQ4VElQTXh5b05TcXhnSmxtYWt2dHhqRFZteEN3MkYxNDBFaGRnRkczemJTc0Z0dUtOUG8wdVhTRXZrUWRiQXRGVkVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "A Trump Veto Leaves Republicans in Colorado Parched and Bewildered - The New York Times",
    "description": "A Trump Veto Leaves Republicans in Colorado Parched and Bewildered  The New York TimesColorado Congresswoman Lauren Boebert lauds House passage of funding package providing millions for water projects  CBS NewsTrump’s first veto infuriates MAGA voters  AlterNetU.S. Representatives Lauren Boebert and Jeff Hurd’s veto override attempt on water pipeline bill fails — The #GrandJunction Daily Sentinel #ArkansasRiver #ColoradoRiver  coyotegulch.blogVeto Stirs LinkedIn Comments  Engineering News-Record",
    "published date": "Sat, 17 Jan 2026 10:02:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxObEl1MkxnTnRIWlJONXZINS1QWTFRTjBtdTR2dGFEZWgxTUNhSGFhRzNnMDZFVXFNOFlaYTFCV1ZTcjBCYjNrWDdhUDYwd2h2QzQ4anVEZGFlNEJDRlJRUXpaUHEtZXExdEdsdktsYlk4WVZNN295WXI3ckhPenBjc1VpRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE says Cuban immigrant died while attempting suicide. A witness says guards pinned and choked him - AP News",
    "description": "ICE says Cuban immigrant died while attempting suicide. A witness says guards pinned and choked him  AP NewsMedical examiner likely to classify death of ICE detainee as homicide, recorded call says  The Washington PostMan arrested in Rochester dies at ICE facility in Texas  13wham.comACLU Renews Calls for Closure of Camp East Montana Following Reports that Detained Immigrant Was Choked to Death by ICE Officer  American Civil Liberties UnionAdvocacy groups hold downtown El Paso vigil for detainees who died in federal custody  KFOX",
    "published date": "Sat, 17 Jan 2026 12:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOaXY0WlB4S2VJSGQ4ejdQa1oxdFRJdjFKcnZrMF93SGlKaFlRZWU1WTVBM2c1VjRPb25JclZINDU4TTU5N2ltdFFvMTRuRHlNZWQzOVVPOER6d3NValhGNUtwS0FrVllrTFllQkt0NTZKTjdTWS1wbFRNN25Zb2g1WWc0V2MyOVpKXzFBV1d6Zi1GSzIzTUNpemIxQzIwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Billionaire developer Rick Caruso won’t run for California governor or LA mayor - Politico",
    "description": "Billionaire developer Rick Caruso won’t run for California governor or LA mayor  PoliticoBillionaire developer Rick Caruso will not run for L.A. mayor or California governor  Los Angeles TimesUnpermitted benches  LAistRick Caruso Will Not Run for L.A. Mayor or California Governor in 2026  The New York TimesRick Caruso says he won’t run for California governor or Los Angeles mayor  KTLA",
    "published date": "Sat, 17 Jan 2026 00:18:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRUxMRnVDdEdJazUzVHducllfUHE3YlYtWDhTcVhjUzhFVnpjb3N2UVVKc3NsVEtXdEpTSDZFVUJMZU1kUmJQZGdTLXBZTXYweU9jMkpkNmRFbThKY29pM2F1NUtxN2EwUnJqVTM2a0k2RjdIdTBtMW9Rbk9aV2RTUzJac21fVjBCMmlSVUxnbGw5WWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Snow potential building in Southeast this weekend - FOX Weather",
    "description": "Snow potential building in Southeast this weekend  FOX WeatherLIVE | Georgia snow forecast: Light flurries tonight, snow threat Saturday night  FOX 5 AtlantaEvening showers south of metro Atlanta starting as rain may mix and change over to snow overnight  WSB-TVShooting leaves one dead, another hospitalized in south Macon  WGXASnow chances in GA growing. Here’s where, how much of the white stuff may fall, new forecast shows  Columbus Ledger-Enquirer",
    "published date": "Sat, 17 Jan 2026 11:29:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE85NXA0S0YwX0NaTDFHWXpqS2pNYjdoaWY5SnJoalZlcXNwXy1pemUwV21mMXZ4RXBpUzNzRkQzQjg4R21lMmVXVUwtZXE2SnZtdkNtVk5RN3oxUFVQSjNFb2ZrVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxweather.com",
      "title": "FOX Weather"
    }
  },
  {
    "title": "Trump, 79, Appears to Forget Name of Woman Who Just Gave Him Her Nobel Peace Prize - The Daily Beast",
    "description": "Trump, 79, Appears to Forget Name of Woman Who Just Gave Him Her Nobel Peace Prize  The Daily BeastWhy Trump accepting Machado’s Nobel Peace Prize is no laughing matter  CNNVenezuela’s Machado gave Trump her Nobel Peace Prize. She left the White House with a branded swag bag  The IndependentMachado urges U.S. leaders to push for a democratic government in Venezuela  PBSTrump Confronted to His Face Over Nobel Yoink: ‘Why Would You Want Somebody Else’s Nobel Prize?’  Yahoo",
    "published date": "Sat, 17 Jan 2026 08:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPZnEzTy1WOGR5R3FXYU8wSm9jNmlHbm5VOXBMRDRnY1JwRWhzR3hZRGNGRmNXbUltS2pkZVZsS2RlUDY0UDROaWE1NG9XdHBKbjFiVWpiTE8wbUZFdWYtM1hGSG9UVjBwYkxfMUYzdzVBNWFhaDN4MmlsdWZ5cHdpUjlLY2VHLU13N3cxTkFEb1ZCZURadzJPVzFKOEtwMjdldnVGRUVzZ2lYcHRIT3Qwag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "U-Va. board leaders resign as Spanberger and Democrats take power - The Washington Post",
    "description": "U-Va. board leaders resign as Spanberger and Democrats take power  The Washington PostSome U.Va. Board Members Asked to Resign as Gov. Abigail Spanberger Takes Power  The New York TimesUVA Board members resign at Spanberger’s request, NYT reports  WVIRTop UVA officials resign after pressure from soon-to-be governor Spanberger: NYT  WRIC ABC 8NewsBoard Rector and Vice Rector resign as Spanberger assumes office  The Cavalier Daily",
    "published date": "Sat, 17 Jan 2026 06:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQQzZ5UUFPYTJ0aVdmeUtSeEM0bzBoamtVeVJNbGU1SXA0X0RuWkUwNmRXOHY3YndoalBSX0dYZHBXTHVGTDZOR3RWeGZab3ZDd3VLYWNscm1IRFhFa0tvZm1YMkoxSzZ0dGoybzBkZ01kYXN5RHQ5UVNtd2dBdE1zUk5nZlNTbjRpU0VRV0dnWkxEWG1QVzA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Minnesota wants to win a war of attrition - The Verge",
    "description": "Minnesota wants to win a war of attrition  The VergeMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNNLawsuit accuses federal agents of racial profiling in Minneapolis immigration operation  NBC NewsMinnesota judge won't issue restraining order to stop ICE operations in state, for now  CBS NewsACLU sues Trump administration over ‘racial profiling and unlawful arrests’ in Minnesota ICE surge  The Guardian",
    "published date": "Sat, 17 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNMGVsdS1Oa2hmdEE4OVFSTjZUQ3JkcW1OMnZTZkV6by1tV0R6LWg0RVp2clloMkU1MkdaS29PbGp1ekNscDNZOFJmTFI1NzdyRG1mOTRzMldHRl9ja25WellGSG1zbUdQZXJQLU1tbGlhelZBT2hyRDN6S1BiaXB6akVaRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Trump pardons convicted California fraudster he previously freed for different crime - Los Angeles Times",
    "description": "Trump pardons convicted California fraudster he previously freed for different crime  Los Angeles TimesTrump’s pardon of convicted woman is the second time he’s erased her sentence in a criminal case  CNNTrump Sets Fraudster Free From Prison for a Second Time  The New York TimesTrump pardons Florida fraudster after commuting her sentence during his first term  The GuardianTwice convicted, twice pardoned: Trump again pardons South Bay businesswoman convicted of fraud  inewsource",
    "published date": "Sat, 17 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNNXEwQzU2eEYyMUJYdHNYOU9DYktpd2NNbTg4eFNocWZaQUhMX3pfWVlVMmU3cU9oY3JaUzFlMTdvUGRKbEZRSktiZmxDaThnUXFhNUhMZmlwRUs4eUtsWDlScW12SElVejlWQTlzU0cwTUdnMVhsMENsdXo2dzBiZEJHRlVXOHF5dVMyUFlPcDBJblM0cUhnYVNZWmw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Iran's leader Khamenei accuses Trump of inciting deadly protests - Reuters",
    "description": "Iran's leader Khamenei accuses Trump of inciting deadly protests  ReutersIranian supreme leader admits thousands killed during protests and blames Trump  The IndependentNo sign of new protests in Iran as a hard-line cleric calls for executions  NPRHow Many People Were Killed in Iran’s Crackdown?  The Wall Street JournalIran Protests Quelled Since Deadly Crackdown, Residents Say  The New York Times",
    "published date": "Sat, 17 Jan 2026 17:52:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQM2FFeTJiMnZPd2d3NUZuMkdsby1Bb3NpOFpJYldCRXlMT3J0bkpCUUsybkhwaFY0VzMtQ1FfUmF3cHRsRkkzZzZpSGlCOFEyeTVsZDI4R3pPWXhkMGRmLUcxZGppMEJ3aktPQmh2enpiTUd0X0xqR2ZfZzMzY1gxTEpQZ0hlOC01am12NFROTnNCdFJMdmplMkFTb1VzeHNOTEQ1ZnJKQmpzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump Backs Down on Insurrection Act as Democrats Take the Offensive - The New York Times",
    "description": "Trump Backs Down on Insurrection Act as Democrats Take the Offensive  The New York TimesYour biggest legal questions about ICE and the Minneapolis shooting, answered  CNNWhat would Trump's use of the Insurrection Act look like in Minnesota?  Fox NewsLive updates: Trump warns Minnesota ICE protests will be dealt with 'quickly'  BBCLetters to the Editor: Trump’s Insurrection Act threat is the fear-based behavior of a bully  Los Angeles Times",
    "published date": "Sat, 17 Jan 2026 05:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8zSnBueE9tdkg0UGVzenhPaWlrNUJSbFZBc0Y3UGszdjVKaE5LemttM2R3QVVIYS1nX3hCSXRxemQ0YnpQWW1SYVZQRGZRSUU0S3pXdHdpWkFmMklEMFZwbFZFbS03YUN3QTF4UU55dkt4azhfbXZBVHAtcENsZkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Incident reports provide details of emergency response after fatal ICE shooting in Minneapolis - The Guardian",
    "description": "Incident reports provide details of emergency response after fatal ICE shooting in Minneapolis  The GuardianVideo Analysis of ICE Shooting Sheds Light on Contested Moments  The New York Times911 transcripts and an incident report reveal where Renee Good was shot and how her community faced her killing in real time  CNNRenee Good shooting galvanizes protests across the country | The Excerpt  USA TodayRenee Nicole Good had up to 4 gunshot wounds in fatal ICE shooting, Minneapolis Fire Department incident report reveals  Yahoo",
    "published date": "Fri, 16 Jan 2026 17:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQa2dqUHpPbzdwNVJYVXlJaG5vdTBsSzloUTA0amFaOWxzd2t6ZnpDQjJ1WXE5eWUwSWZGaS0yWlcxeVU5cWh3OUZ4YzNseG5lN2lwb2FhWU9kOFZWXzloY1A5QWhoSXNHYlhPV280QTZvOUExWDlPZE5xVG85SFRGMmpBYmJFWFcxUjRjaWtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Virginia inches closer to gutting GOP seats through redistricting - Politico",
    "description": "Virginia inches closer to gutting GOP seats through redistricting  PoliticoVirginia Democrats move to seize redistricting power, opening door to 4 new left-leaning seats  Fox NewsVirginia Democrats set up a referendum to try to flip as many as 4 GOP-held US House seats  CNNVirginia lawmakers pass redistricting amendment, sending it to voters for approval  NBC NewsVirginia to vote on Democrat-favored redistricting after lawmakers advance plan  The Guardian",
    "published date": "Fri, 16 Jan 2026 18:59:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNa0Vmc2RyLW1Sc2Nfc3hacG1ZaUM1NUcxckpmdWFOeHotUzR0cHZGTlJ1S1FYUDRFdnpzek8tSDlUOTU1Y19WZjVKVDRIQ0ZleGtoeHVORVlNbkVYMHJWdlJNeVl0N2ZFNHhDY044SlI1LWlkZXJwNVppZlZQOS1NNHEyWmZtVEJFQ1ZwUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "At Least $110,000 in Pokémon Cards Stolen From Lower Manhattan Store - The New York Times",
    "description": "At Least $110,000 in Pokémon Cards Stolen From Lower Manhattan Store  The New York TimesNYC Pokémon shop held at gunpoint, reportedly robbed of $100K in merch  USA TodayWatch: Armed group robs Pokémon store in New York City  BBCPokémon shop robbed of $100,000 in merchandise by armed burglars in Manhattan  ABC7 New YorkArmed robbery at Pokémon store in Manhattan's West Village caught on camera  NBC New York",
    "published date": "Sat, 17 Jan 2026 10:02:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOd0hwN2s1NUNvOVZyWXpJeWFieElRMHlWV2dNdzEwT3Y3akZZRGpNVk15dHlsZ1Y3SzQwcEJ1a0NwVkI0RldhZktLaFl3allHUVVwZnE4MEtVcFNzRmNGVG5nVGZKY1ZoeWw4UzZERThiYy0xMldRcXhDNFdaUkJVRVFralpWYkV4RXM0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Some policy experts struggle to make sense of new Trump health plan - ABC News",
    "description": "Some policy experts struggle to make sense of new Trump health plan  ABC NewsThe Great Healthcare Plan  The White House (.gov)What we know about Trump’s ‘Great Health Care Plan’  CNNTrump pitches direct payments to consumers for health care. What policy experts say about the plan  CNBCTrump jettisons the GOP’s corporate allies in health care plan  Politico",
    "published date": "Fri, 16 Jan 2026 21:32:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaGE3RkVERzJmdHhmSHdjU3B2OUwwV3pwb3VWS192OVZpREVVZG1hdXY2ZXI2cjRHNVJNSkMyR281M3NVdDZhOG5pMmtnbkgyNlZXU1hWM0VvTWRqanV6ZXBJZlJpWUh3ak5TNUZHTDlmekxlMHBEQWVNUW4wZ0pQclY2UHUtQUVVTVJadnB0c3BLSFNCWS16Uk5uTy1uUU91RWfSAacBQVVfeXFMUE1UeXBucHJoVWtkWUhjZ1JxNjdxbDJrc0FsLW56dE5IMlRWZnUtSEJraERSNkdnX293Nml0Q1M5eEpOY1NOcXhvdWxPRTJsRkU2a0RMTkprbzR2bGk1LXFMNnZXT25EcGtieHJKY2NmbGFNREQtVnlCajJyNmZKZ0NFb1Y4S0xvSUhpeXVjdTlmcWx6RFNYOVBldW1ydE5fbWI3cVFqN1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Some criminals ICE takes credit for arresting were already in Minnesota prisons - MPR News",
    "description": "Some criminals ICE takes credit for arresting were already in Minnesota prisons  MPR NewsDHS Highlights Worst of the Worst Criminal Illegal Aliens Arrested in Minnesota Yesterday Including Murderers, Drug Traffickers, and an Illegal Alien with TWENTY-FOUR Convictions  Homeland Security (.gov)‘Scourge’ of sexual predators, violent criminals being removed from Minneapolis streets despite backlash  Fox NewsMinnesota DOC disputes claims made by DHS on ICE detainers  5 EYEWITNESS NEWSWhite House, Minnesota clash over ICE detainer policies  FOX 9 Minneapolis-St. Paul",
    "published date": "Sat, 17 Jan 2026 14:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQWlN5LVBxbXc0UnE0VlFiN043SFRDZEhRWDRDbVVhMzhGdUJsdzBnWDRObmgycFhha0gteG5aNWVTMUlIUzA5X2o4R01CX3dHWERILVAzSEhpQ183c2xKREJNQks2Z3YzUXpEekFiaEVFbUZBQmdKOURTeXI4NXlCOTEwdmo5VjE5VGZZSTdDT2lZbXdsOE5lMU1OaF9PYTRHZmhIN19jQXJNUENPb0Z2OHl2UC1lQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Big Oil’s Complicated Calculus for Investing in Venezuela - The New York Times",
    "description": "Big Oil’s Complicated Calculus for Investing in Venezuela  The New York TimesWhy the US, the world's top oil producer, wants Venezuela's oil, too  USA TodayOur perspective regarding the situation in Venezuela as shared with President Trump  Exxon Mobil Corporation | ExxonMobilHere’s who is likely to profit from Trump’s Venezuela takeover  The Washington PostWhy access to Venezuela’s ‘heavy’ oil is ‘tremendous’ news for US refiners  Al Jazeera",
    "published date": "Sat, 17 Jan 2026 13:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9RVGMyTllOOFlkczRWLVZINGJ5TmFHOG1zaWZKVG5FQTZLS0FLYm96SVd0YUkzNzNmcFV6cDFBWUxTbkN5QW9kcU1lRU9tZjNwNFQ4aVplem53TVlCZHhpN2dURkJXMjYxN0hsZGR2YVFBc2ZjR0U2STdzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Celebrity ad promoting males in girls' sports draws ire of champion gymnast: 'Bodies play sports, not identities' - Christian Post",
    "description": "Celebrity ad promoting males in girls' sports draws ire of champion gymnast: 'Bodies play sports, not identities'  Christian PostOpinion | The gaping hole in the transgender sports case  The Washington Post‘They’re here to antagonize us’: trans advocates say hostility at rallies is up as supreme court hears key case  The GuardianThe Question That the Lawyers Representing Trans Athletes Didn’t Answer  The AtlanticWhither Bostock?  SCOTUSblog",
    "published date": "Fri, 16 Jan 2026 18:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPNWtRRE9ienpoeWxuUEZmaWt5bFk4aGtFMWNfUXJFY3pLeW0wX3ZzUHk4b0RhYTc5bkpWczRveXFtX2p1eHc1X2QxeVZDeWRyY2ZzUkNCSWRBRjRTTzB5ZzEwMUtiZnJFMElGMF8tOTlBOER1aHJiN1M4clFYQ1dlMnVBc3FibHBPbmpOZXgyOWhjTDRaU0hGNFRIMGNZSV9E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.christianpost.com",
      "title": "Christian Post"
    }
  },
  {
    "title": "Iran's exiled crown prince implores Trump to strike regime - Axios",
    "description": "Iran's exiled crown prince implores Trump to strike regime  AxiosSon of Iran’s Last Shah Calls for Military Strikes  The Wall Street JournalExiled crown prince implores Trump to follow through on Iran strikes  PoliticoPresident Trump Attends Ceremonial Street Renaming in Florida  C-SPANReza Pahlavi says Iran is undergoing a revolution  The Economist",
    "published date": "Sat, 17 Jan 2026 10:02:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE8wT0lVMXlYS3lIU05lcmJZTVZlNVlOWS1OZktTWnBXX0phNHFURmhwbXh1VmxObEkwTkw4WkJmTVV0TGxNRTgzV2liZkRyOURXNHNIb0E4TEp1d2tlbVJWamxkY3BJdGJnYTVrT3RRZmlGeDI3SUdkdQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "California defies Trump, makes admission free for over 200 parks on MLK Day - SFGATE",
    "description": "California defies Trump, makes admission free for over 200 parks on MLK Day  SFGATECalifornia Will Waive State Park Entry Fees on M.L.K. Day  The New York TimesDid Trump cancel MLK Day? Why the federal holiday might look different  The Clarion-LedgerGovernor Newsom announces free entry to California State Parks on MLK Day — as Trump swaps the “free day” for his birthday and whitewashes civil rights history from National Parks  California State Portal | CA.govDid Trump cancel MLK Day? Is it still a federal holiday? What to know  Cincinnati Enquirer",
    "published date": "Fri, 16 Jan 2026 23:29:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOa3hGR3lhaFN1VzdBcVVZWE16TGhiam1qVDI1aWl1YXZBdkp6MTAwRU1lRV9mcWJQQzljdXBrT0w0ZDJrTFBqbXRpUTZQLXZkcGtXc0plSF8xNTRSYTRabGpsYVdWMW83SUZpY2lNS3JOX2EwS0RwdWMtbko2TF8wUnRCOXQwVUgwSE9YQi01NFYxeGczSUJGclVkRmZtLTlhdWZHeWFBZThWVkFmVlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "Coast Guard OKs less costly Oregon-to-Washington Interstate 5 bridge proposal - Oregon Public Broadcasting - OPB",
    "description": "Coast Guard OKs less costly Oregon-to-Washington Interstate 5 bridge proposal  Oregon Public Broadcasting - OPBCoast Guard approves plan for fixed-span Interstate Bridge replacement  KATURecords show how $140M might be paid to 4 Columbia River companies to offset effects of Interstate Bridge design  Oregon Public Broadcasting - OPBCoast Guard issues Interstate Bridge clearance ruling, allowing fixed span with 116-foot height  KGWCoast Guard OKs I-5 Columbia River bridge with less pricey design  The Seattle Times",
    "published date": "Fri, 16 Jan 2026 22:56:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQTDRQeWlHTkRCV3MwWmlWUV84NVlDY184blNWTkxPcDVrWWg0RWtSU0xDV2pGdk5BT3dNb0xpYk1nMGNEX0JaVnBYRGZRdmM3YW9oaC04OGxXeFFtOHk2bjA3NnIxQ29TUlFiYjVyenJYYzg3aFVFMHlfYzY4aVFIb3I3MW10QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "Ongoing Southern California immigration raids sparking fear in communities - ABC7 Los Angeles",
    "description": "Ongoing Southern California immigration raids sparking fear in communities  ABC7 Los AngelesFederal agents carry out raid in Los Angeles’ Fashion District  KTLAICE in LA: Federal agents conduct raid in downtown’s Fashion District  FOX 11 Los AngelesDAILY MEMO: Over 20 Taken In L.A., As ICE Kidnaps Gardeners, Vendors, and the Unhoused From San Bernardino To Santa Barbara  L.A. Taco‘It was chaotic.' Immigration enforcement operation reported in LA's Fashion District  NBC Los Angeles",
    "published date": "Sat, 17 Jan 2026 01:47:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNMTd0a2kxX01YWXpoS1NYRU8zLW1SeGl2aWM2Y0RRM1VJT1NfRjFTa2U1bWQ1d3dBUHNKRHBJT0Z0Rm9Wa1BVX1FBQ3pRVlBXcVFNdlBEWnlwMXpZS3lja1ZKdFJFaTZmYUUtZ1B4UnZRdUJaWDJRdmh2TTFOSXJfRWFpNVVaOTFMN0pvcEtRMk9NSTdrczd0NzVNNzYwZExBUVBLZGNn0gGrAUFVX3lxTE1fZEx5UTNkMlFKejlBVTBiSUhpNTE2c2F2ZTJXdlNacGRJMEQwclgtbDNEQ19lbEp1VEtjM1VBcW1oalhnQVBVakZHbWNIWXFhZGxYRS1uRENYdS02a01nTzlGSFVyaHJVbUdQVzJnZ0k2TGh6VlotdDZxQ2ZrVFNmQWhxM1hUNHlTSWhqME5uaGNqUXB3QUpVOV9SNHdIMUZSejBmTUQtMGlVTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "Even Nicolás Maduro’s Prosecutors Are Tied Up Reviewing Epstein Files - The New York Times",
    "description": "Even Nicolás Maduro’s Prosecutors Are Tied Up Reviewing Epstein Files  The New York TimesView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 17:26:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE93TWlibjRfOHF4ZzBWM3ljQzVieVpWVHV1MWxOTXRLRmlPT3pwUXNoQ2x5QjVXaUNiREtpQk1PejJQM0NTWTVsaF9VZnQ3LVBSd0EtUFhwbzBFRTdwY0ZoZ1dRdG0wbkNVX3NydDNubHBrX2JmV2lB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Cuba launches mass demonstration to decry US attack on Venezuela and demand Maduro's release - AP News",
    "description": "Cuba launches mass demonstration to decry US attack on Venezuela and demand Maduro's release  AP NewsCuban soldiers killed during Venezuela attack are returned  BBCCubans rally against US 'imperialists' before Havana embassy  ReutersTens of thousands demonstrate outside US Embassy in Cuba  The HillRemains of Cuban officers killed during Venezuela strike repatriated  Military Times",
    "published date": "Fri, 16 Jan 2026 17:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOOG9YaEFnQ2xsYzg3VlZQWEhyNmFyWkpOS1dBcFdjdnZpVnFfTzVpbXZ5MFVxWmY2T3BmUUQweHBmcmRJdS1tM0EwdDJONVZOYXFoWjlZUHVBUnNnZUFLUGo5dzJxLTFlTy1CRkk4ZC03WWM0MDB1OGVNc2dJZ1lWTjdPdnVPd1hEYmxlc2txZWNkTUpUWmtqNExaTGc2dzJqNmlyb01jaEhiaTYxTUdN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Republican dissent as key figures warn Trump against Greenland pursuit - The Guardian",
    "description": "Republican dissent as key figures warn Trump against Greenland pursuit  The Guardian'Diplomatic channels are the way to go' over Greenland, US speaker tells BBC  BBCCan Congress stop Trump from trying to take Greenland?  vox.comRep. Don Bacon would ‘lean’ toward impeaching Trump if U.S. invades Greenland  MS NOW‘Dumbest thing I’ve ever heard’: Republicans amp up their resistance to Trump’s Greenland push  Politico",
    "published date": "Sat, 17 Jan 2026 10:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNN0hDb1lGUXhqQllTNkY0U1JwMlNHNWVMd0ZpV3g0OEs3UmhxTld0ZDExcndJNkFMR3VjaFlFQ0huV3FvWkhDcGtYdFlULVRNMTlHN1I2bTVMUGZTNDNhcGp0U0ZVeUgzaGdYeGV3UUVjdF9qZGhiak5QTDVRenVnZQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Grand jury indicts ex-husband suspected in killings of Tepe couple - 10tv.com",
    "description": "Grand jury indicts ex-husband suspected in killings of Tepe couple  10tv.comIllinois surgeon indicted for double homicide of ex-wife and husband  The GuardianGrand jury indicts Chicago doctor Michael McKee for murder of ex-wife, her new husband in Columbus, Ohio  CBS News'Controlling' Doctor Saw Ex-Wife in Love with Dentist and It 'Destroyed His Fragile Little Ego': Friend (Exclusive)  People.comFriends say arrest in Tepe killings was no surprise  10tv.com",
    "published date": "Fri, 16 Jan 2026 17:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQdGFCd3JJQlVWd3FVdW5UZUlKbEVFcktEcUdDUFBFdGFTS3UzMTJrWkw0d1dvaE1PaE9vLWlSLTR2YjA0amh1U1pxdjR3SHU2a1d2LVlORHJKS09iN28ycGw2dW5OTWJEeTVFR3hEckVsNjNfUVZOeG5sR0pfdDNIYmNWR0JNNGZxVy1aZF9Xbjl0TnU0NWdISEpmelFTTFBFOC03YmVvdzd0YjAzNTA2VEh3bklFeTdTY1FER1lFSlBRd2ZzeTVJMDgwX0ViT3ppVmhaZnVjeThWQkFEYURvLUx1OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.10tv.com",
      "title": "10tv.com"
    }
  },
  {
    "title": "Immigrant-run restaurants are determined to survive ICE crackdown - MinnPost",
    "description": "Immigrant-run restaurants are determined to survive ICE crackdown  MinnPostList of Twin Cities businesses closed from Jan. 17-23 in response to ICE presence  Bring Me The NewsMinnesota’s biggest companies starting to feel heat from ICE surge  Star TribuneSmall Minneapolis businesses hit hard by ICE crackdown, while corporations stay silent  ReutersLocal Restaurants Report Fewer Customers, Staffing Strains During ICE Surge  CCX Media -",
    "published date": "Fri, 16 Jan 2026 20:38:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQaUgxWlJjU1FreXZjX2NjZm5JNjNFX3haVUZmUGJKenRfemhtbk40NEpoQ29nMjVoRnBxbGhmYmRQQjNKNUE0SXVLS0F6TFRRdmZrZnF0UFRPNDVrd21KWjNXdExzdnR2bTJUOUhWM1dNaGd5bmtjU2tnWnlmNUkxMmhtVGxGWmpidlZVMFE0VWU0aFZVeXpYOHRSR2NBeXJOM2JOTE1wc0Q1Nk9NNlBtTFVpb05KYmpkUmdzY21vRVNUNXZmOGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.minnpost.com",
      "title": "MinnPost"
    }
  },
  {
    "title": "Major plumbing headache haunts $13 billion U.S. carrier off the coast of Venezuela - NPR",
    "description": "Major plumbing headache haunts $13 billion U.S. carrier off the coast of Venezuela  NPRView Full Coverage on Google News",
    "published date": "Sat, 17 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNbzk5ZkJMOXR6cXRPc2dKMmF0cVVLaWp0LS1nZXlrSjk0aWpsMDFxQ0x5aVBwdW5CQ05LVVhvcUJYTzhpbmJGV3BXWkpmcXBQMllQbjQyX3QwYno2cUxyQnFxWm5Cd3JqbUhKSl91SEt2QTNPNDhSQzRoSzdCWEhwWVVuN3VKYnlJZjZfWFhiUTVvUmJrUktGVExta0FyUms2QUp1V3N5Qm83eG9GZEVLZDFYa1VrYlFWQ29MSmlHRG1YZFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Defendant in Charlie Kirk's killing asks judge to disqualify prosecution team - PBS",
    "description": "Defendant in Charlie Kirk's killing asks judge to disqualify prosecution team  PBSAlleged Charlie Kirk shooter Tyler Robinson appears in court as defense pushes to disqualify prosecutors from the case  CNNCharlie Kirk murder: Defense attorneys for suspect Tyler Robinson seeking to disqualify prosecutors  LiveNOW from FOXJeff Gray testifies as judge considers disqualification motion in Robinson case  KSL.comJudge in Charlie Kirk case sanctions pool camera for lipreading violation  NewsNation",
    "published date": "Sat, 17 Jan 2026 00:23:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPOE5JdFZGRV92NlhHX09lMm1vUjl1NXR2TDNiU2txS09tTTg4U3Q1MHBYYXhjVjAxOTBLdlFVamZuSU5HXy1ZYjZqSkhxQ19XOV95eVA1TldJa1lsVkRyRm5EbWV1RjYwd25pNUYzQ3I4ZlVhbVdLX0daQUhfY1FKbms1SkpkMVA1ZVBna2FjYUJPYXpqSURrRlY2TVREUXMyZ0FJUlVwdHdVYzY2dmRnRjFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "State Police Provides Update of Line-of-Duty Death Investigation at Wilmington DMV - Delaware State Police (.gov)",
    "description": "State Police Provides Update of Line-of-Duty Death Investigation at Wilmington DMV  Delaware State Police (.gov)Man who killed Delaware state trooper at DMV office had said he was being harassed by police  AP NewsPolice release further suspect details in murder of DSP Trooper Cpl. Snook  WBOC TVWhy DE police believe shooter targeted trooper in 'deliberate' attack  The News JournalBlue Line Network postpones Milton sticker event honoring state trooper  Yahoo",
    "published date": "Fri, 16 Jan 2026 20:48:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNei1NWDJhYnNxS2YxTFpWa0NNQWhrLVowM0RWQktUb05Xalc2bTgtU0NZcS1UUnNuR2IwVm56MU8ySEF3dVQ4UjE2NFVKeDVYaWNOajl5OE8wRjh6cGZ4VWQ1M2licFdhRXE1UENZTVFxcmVWQkRnVHo1RjdUbXYtQUt5ZERncW1TMXVQRW5NTnBHX2VZN0hQek5LaHRHSzNYOElBLW8wVkxvZTJfbUtIQ3FUZk5RaGh5M0Zz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dsp.delaware.gov",
      "title": "Delaware State Police (.gov)"
    }
  },
  {
    "title": "Buddhist monks pass halfway mark on 2,300-mile Walk for Peace through US - The Guardian",
    "description": "Buddhist monks pass halfway mark on 2,300-mile Walk for Peace through US  The GuardianFrom Texas to DC: Buddhist monks take 2,300-mile ‘Walk For Peace’ through North Carolina  WRALAloka, the Peace Dog, reunites with monks in Charlotte after successful surgery  WBTVWhy are Buddhist monks walking across the US? Here's what to know.  USA TodayWhen will the Buddhist Monks pass through the Triad? | Track where they are  wfmynews2.com",
    "published date": "Sat, 17 Jan 2026 14:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPcUhVWl9BWm5SX1R5TEljbzZXUU02c0VJRFFpVlliUHd0LVlhbE9pZmVVeHl1TWtxMnZZbW5TamRIRzBTZDNEQTNpSzhScnJNUTBHa2FRZ1gtSC1XV1kycTBndUJtUzFBZTdtQWEwQWo1alFFMHpIWDFweFAycmJFY0I5bw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Right-wing media are describing pro-immigrant Minnesota activists using the language of war - Media Matters for America",
    "description": "Right-wing media are describing pro-immigrant Minnesota activists using the language of war  Media Matters for AmericaView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 21:05:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQUmFqY0JtWXVzX1NJd01oOWxBdXNXaXN4UXBjLVVDM1NycHhkWld3bG15OS1pMTYzeWl1aUhMM2tjajY0dVVJUmtiZS1KV2hsVDA5Z2V0VHp1UXRndkVNRWJBNDcxbnhYcmVfNkhwbDVOeDJKaTlDbW1XaVBrVVFELU0tdFQzT3FjaEVXYy1GeE9hOVZWczRjT0htc1YtNE1lM3F2QlhaSGx4V2NGWFRjUjNka1FGN3ZCQndlYUxEdmdTN1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mediamatters.org",
      "title": "Media Matters for America"
    }
  },
  {
    "title": "Judge urges US grant visa to college student deported due to 'mistake' - Reuters",
    "description": "Judge urges US grant visa to college student deported due to 'mistake'  ReutersUS apologizes for mistake in deporting Massachusetts college student, but defends her removal  CNNJudge proposes issuing deported Babson College freshman a student visa to rectify government error: ‘Because of your mistake, my life completely changed’  The Boston GlobeUS judge gives Trump administration three weeks to return deported student  The GuardianA mistakenly deported Babson College student tells AP how her life turned upside down  AP News",
    "published date": "Sat, 17 Jan 2026 02:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQcXd1c2dMMndkQ3RqdzRfT2RkV0RGdC11bklpdEg2SXhTSmZ2bTNTUENUWGpWMTRuRmc2bHhGc1B6VXU2ZFBtaEpoU0VUSnlzR1hvZDhoalNjblRSaHJwcHl5cW04a2pIX3l3NE1KZ1dNTW5JcDdjNDdoMTBCYVZLaUlwWnZsODlyVGw2UWxORnM2RzhxNmRObDFHdVBzVjBCVGd5RkhBVzBqdjFEUjV1SnFYemlHdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump quietly appoints 4 members to commission that will review his White House ballroom plan - AP News",
    "description": "Trump quietly appoints 4 members to commission that will review his White House ballroom plan  AP NewsTrump Appoints Allies to Review His Ballroom Plans  The New York TimesTrump quietly makes changes to his White House ballroom project panel  The IndependentWhite House ballroom's original architect picked for commission reviewing the project  CBS NewsTrump appoints loyalists to arts commission that will review White House ballroom plans  CNN",
    "published date": "Sat, 17 Jan 2026 00:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOT0J6dVpNTHBSdVF0YWwyREo3ZHpEa05lUm1QSnBwaDhvQlJSSk9XZU9MNnRETlROUlhFRFNLZlFhZzJtem4tVFJybWJBbEt6RFBBOFdTem52bDZRbXhWWTBhVlF0SExjX3BOY2RuZ2hCRjZVN185OU9vamllakVxTGoyc3BoVW1iQkR6cEhBcy13dXlTYW9jaHdRM2t4c25uUnllUl84SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Videos add new detail to 2nd Minneapolis ICE shooting in a week - Minnesota Reformer",
    "description": "Videos add new detail to 2nd Minneapolis ICE shooting in a week  Minnesota ReformerMinneapolis ICE shooting: Agent shoots immigrant, officer also hurt  FOX 9 Minneapolis-St. PaulDHS names man shot by feds in Minneapolis, but their shared background of him lists only minor prior incidents  CBS NewsFederal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesThree Venezuelan illegals arrested after ICE officer 'ambushed and attacked' during traffic stop: Noem  Fox News",
    "published date": "Fri, 16 Jan 2026 22:42:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcG84WG9tSjFFYlZ5N2tTY2k3RWJvbjVqMFZXQkNka1RFYzFZZTZ4eVMtNkpTMGFLYndObzhCU2I3RXo5cGI2N2J4RWw0UXJMUHMtUE0xTkQxOXJDaHJMR3VzWlBJS0Q1UFdGVVpmS1R5ZzBUTFhYaU82QlNEOFRYcXNmUEwwSV9pRUozdExOelFWcVFHZEZ1dTNBajVfY0tVbHFmdy0xRTE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://minnesotareformer.com",
      "title": "Minnesota Reformer"
    }
  },
  {
    "title": "Nurses describe escalating tension as NYC strike continues - Politico",
    "description": "Nurses describe escalating tension as NYC strike continues  PoliticoNurses Describe Fear on the Job as Bitter Strike Enters Fifth Day  The New York TimesNYC nurses strike: Negotiations between union and NewYork-Presbyterian end with no resolution on 4th day  ABC7 New YorkOpinion | ObamaCare, Mamdani and the Nurses Strike  The Wall Street JournalNurses at 3 Northwell hospitals approve new contracts  Newsday",
    "published date": "Fri, 16 Jan 2026 22:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxORjVkZ21oQ21JVEM1OWE3Yl8wUnd5a2VpZE1UYXdiLWpZS0Jyb1Jnbl82QTJHOFdWOUVUWlBBR3lzcTJ0UlA2RGdHUVIzNnh3QVFCWVU3RVR2SEYxWGlUcHEzY3FOZ01oR0psdFVORWtBTUh3Y2NEd1dKUTNnSDg0d2p0N1VUUEtKUmVNZFVlX1c1X0lfUm9CbW5YVzJ4VmVTMzY5Rzg0eHhIYmxQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Oglala Sioux Tribe says it cannot confirm tribal members were detained by ICE in Minneapolis - MPR News",
    "description": "Oglala Sioux Tribe says it cannot confirm tribal members were detained by ICE in Minneapolis  MPR NewsNative Americans are being swept up by ICE in Minneapolis, tribes say  The Washington PostOglala Sioux leader Frank Star Comes Out walks back claims of DHS pressure, member arrests  CBS NewsTribal leader walks back claims DHS isn’t cooperating with search for members thought detained  Star TribuneMichigan tribes warn members about ICE stops: ‘Irony maybe is the word’  Bridge Michigan",
    "published date": "Sat, 17 Jan 2026 01:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQUENRRVdXZF9pWkZQVEdDbk1LTm5qdG9HY3Q4TUFOZmZzN2ZrcTRaOUlRWWltR0VmRzJYaEpUdzh3V241dkZXVW5nUl9CbUVtZ1VxTzN3dDFzYzBsZVRxWlJpMF9ncE41MF94YkZqY2FjYzJFak1lY0oyazRSMFlrVmRHQXYzN0I4QUhVTnBDREIxMFFRQmF4YXlGRm91NGNLc2FpRTJiaDBrUEVkMmtBczBYU0d1U0xUNXMwaGYxOEhhOVRjWG9Hb1FRWWt3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "MPR News"
    }
  },
  {
    "title": "Democrats grapple with 'rising clamor' for Trump impeachment ahead of midterms - ABC News",
    "description": "Democrats grapple with 'rising clamor' for Trump impeachment ahead of midterms  ABC NewsHouse Democrats aren’t eager to impeach Trump. But that could change.  The Washington PostPress Release: Congressman Al Green Raises Concerns for American Safety and Calls for Trump's Impeachment  Quiver QuantitativeIt's Republicans who should impeach President Trump - Greg Rendahl  Winona Daily NewsLong-shot impeachment effort divides Democrats in response to Trump  NBC Montana",
    "published date": "Sat, 17 Jan 2026 10:12:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQT1NSVlVySzd4b29rcDN2THB1VGJveVVHeGZKX1U3ZzFEaURwT284QkI3MXotR1dkLVdOMF9RTGlodnA5eWhIaTNoWnFqdDNHSW9KenpwejVkVUVUUThqNEJqb0pUWlhna0RFNFA1OXhhQTFwZTBXZlZWc2hndDZtaWtxYVg3Wk92cWoxMU5SZDRDbVdILWhPSW85aGtzQU5LRFVXNHdhWWZjYVhwQ3IyeDRMWkZRUdIBuwFBVV95cUxPaV8wUkpqVloxdUJRWXFwNS1yeVBzSUZGbDNqVW1IdURLZEE4WXZrbzRwS2NacG9PWEZDZEdkUUpSNm9meHoxMy1rMkV2UzJQbjlpNC1ELUJQQkZMdWRleVBTMG1JUGRGVDI5SWRVVVd5alFpNjY4WDNQdUhFU1YtMUVEdXVGLTBZWFI2UnhaU0FJSV9nSXEzZ3p5ajFJVkRmbzh3VThuel9qSHZvWi1WRl95T2NGM0JyZVNF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Making billionaires illegal by taxing their wealth wouldn’t even fund the government for a year, budget expert says - Fortune",
    "description": "Making billionaires illegal by taxing their wealth wouldn’t even fund the government for a year, budget expert says  FortuneHow Much A Billionaire Tax Might Cost Mark Zuckerberg Or Kim Kardashian  ForbesThe Proposed California Wealth Tax Is Far Higher than 5 Percent  Tax FoundationIn San Francisco, Newsom rails against proposed billionaire tax, vows to protect homeless Californians  Los Angeles TimesBillionaire tax sparks intraparty war in California  Politico",
    "published date": "Sat, 17 Jan 2026 13:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPSGJNbHVRTWRiaW9qV08xbjVRX3dienpKSlg3bE9iUEZvWG5mcC1Zcms5dFZzb0FIZ1JBb0hxcVlGLVJZWEU5NFhFekljZ0QydGF0N0FGSWxweVJTdTFlcWRUWThlS1dFS3BTVGxZZ3JZbE1xNWcwM3Ziei12Yk1zWkJmZllpVWhCRmlZaUx1Qjc4OXFwdzdIc20zN1VGS1VCd2Zab0ZuNFU3NXVpMFhEWEM2bVU0d2pKZzZQNGMwYzdLajkwNVJWcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Trump is threatening to cut funding from sanctuary cities. Here’s what to know - NPR",
    "description": "Trump is threatening to cut funding from sanctuary cities. Here’s what to know  NPRTrump threatens to cut off funds to 'sanctuary' cities and their states starting next month  NBC NewsWhy Trump is threatening to cut federal funding from Delaware  The News JournalPresident Trump to cut federal funding to sanctuary cities, states on Feb. 1  KOATUS to cut funding to states over 'sanctuary cities,' Trump says  Reuters",
    "published date": "Sat, 17 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOSlhWQWhvUS1jT202RjVMekN1RlFhYURWMVVkZkR6dmNBNFBTVkJ0Qk16b3psSXhMN0hRTnlxa2c1Z3J6cTU0Z2lIdHcwTEdRSmxOMmtiRzZZbEpER081c1htRjluVnE4NnJtdl9QcGhpUm5PUzJJaWJCbXFjOGkxNXFQeDg1QlRHRjRZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "'Largest outbreak that we've seen in California.' Death cap mushrooms linked to deaths, hospitalizations - Los Angeles Times",
    "description": "'Largest outbreak that we've seen in California.' Death cap mushrooms linked to deaths, hospitalizations  Los Angeles TimesDeath Toll From California Wild Mushroom Poisoning Rises to 3  The New York Times3 deaths, dozens of illnesses linked to California poisonous mushroom outbreak: Officials  ABC NewsMushrooms sicken 35, kill 3 in California. Are Washington residents at risk?  The OlympianCalifornia Combats Largest Mushroom Poisoning Outbreak in the Country  KQED",
    "published date": "Sat, 17 Jan 2026 00:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQNG84Y2ZyUTBsZ09sdjdVcHJUR0ljY09yN3ZWanV4dHJ4ZjJlM09aSmZIMXE5ZDY0bFVUOTZTODhvTmNsMEdxX3l3Wk5UQnd2UE5QZ0pKbnQtbUJkQ2VLelliNVdYbE1kdlVtcHZNQTJES09pSGUyb0NLTHpoVXZKN0RaMVhBamtpN0RORXR1RHpmQlVWTFNrZjJTRUU1UTZVRTJKa2RQOTZvZ2t6MjRUVjcyMGNUMENZd2hCWE5vNTNLOE5DY0ZfQk1kbDRvb3dNSTNHTURzYnBQSEZWcEV1NmZtT2ZfZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Woman shot by Border Patrol agent in Portland appears in court by video - OregonLive.com",
    "description": "Woman shot by Border Patrol agent in Portland appears in court by video  OregonLive.comView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 22:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPRFpWdC14RVNzQk5VS1NJaDFtYlpRWV9QTTJ4ZHBlVlRIdllBM2hacm5xbzU1U2pLSGhNODhHalVmOFZqUlBlcWdLSWRfQjlSN25rSG9HajJETlhWR2NGWENZT0V3TnVCOENEVzNSa0hQNXoxNEFmMWt5Y0xrR0E3QUZLYjNjdFl4aVJ3Zktua2dtbDdHbGVzVnNQdHk0M3JuWnJJX2tIaHhEaUhGaF9zbVZsNXo0Tmxf0gHMAUFVX3lxTFBMeWlHUEJ2WXhhNzJfVlNqRTNWOUhuSnppLXVMbkV4T29EUlZqZThfckZLeVJMZ09peE83ODZpRG5tSUNTQTBNNm5uNlBUbmY1M0NyVU16WG84RUpjTzNvUGYxc2JGX3EwVU1URU9jb1ZIOHA2d29CTDNMWGpRbW9MYU1uRWZnaTFRTFBtQTIwclZqS3JZVGpLM292QXlkSVdsMEN2VnZ2VVhtczJmX0xETURieXZMbmVuc291TjRxQUZ4S0pqZTZNQThNUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "Pierce County sheriff may get expelled from WA law enforcement association - The Seattle Times",
    "description": "Pierce County sheriff may get expelled from WA law enforcement association  The Seattle TimesWASPC considers expelling Pierce County sheriff after testimony to lawmakers  king5.comIn sheriff’s testimony, WA legislators hear a clear threat  Washington State StandardPierce County sheriff’s comments may get him kicked out of statewide police group  MyNorthwest.comWashington bill to change elected sheriff eligibility draws debate  FOX 13 Seattle",
    "published date": "Fri, 16 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOcWdXWlo3SmhpeFI4cS1IelpuV0dJU3hhSm1fcUQ0VV9hZzY3X3JQTkJ1T1ZfeDdfVXItcHZUTVdSVWY3RGtOQVFUTFJrbjhJb21SU2RwTnNHSlpqUWxxYnR5a1V3aHRXRnpBYTVmUk44ZTFTem5JYmVPbkNkSmtBNUVTeGFrQklBQjZWdlJBc3ZyUUVMaUJrZmNtcHY3MGhQM24wZ0tzdGpvOWNQcDFic1lwMEFZNUdKam9nT2tvemtxTTMzUkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Winter’s coldest air is coming to Austin. Here's a weather timeline - Austin American-Statesman",
    "description": "Winter’s coldest air is coming to Austin. Here's a weather timeline  Austin American-StatesmanHow long will South Texas stay below freezing? Here’s a timeline.  San Antonio Express-NewsWEEKEND FORECAST: Elevated fire risk & freeze warning  KSATWeather Impact Alert | Widespread freeze Sunday morning  KVUEDallas weather: MLK weekend brings wind advisories, fire threats and colder temps  FOX 4 News Dallas-Fort Worth",
    "published date": "Fri, 16 Jan 2026 11:06:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPbUdGa3RERDNaNjdVSWdyam53cEwydFQ3Rl9ncWNWLVM5YVh3R0txN0dTd2diVWlaaVloU2JHTWlKenF2N1EtOTRHSVJjT0VMSEdId2pWLU8tdEdWYl9DcEhLYjRfOV9xYkpCOHpGeTJGRVhLVTljRGdwbzRTYktkeUVKQUV3NTBkSHdHTjJoT3JDNGZCVER2T1ppX2xFVEZlNzhKRktSZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statesman.com",
      "title": "Austin American-Statesman"
    }
  },
  {
    "title": "China calls Trump battleship ‘easier target’ amid mixed US reception - Military Times",
    "description": "China calls Trump battleship ‘easier target’ amid mixed US reception  Military TimesUS Navy leaders embrace Trump-class battleships  Navy TimesSECNAV: Shipbuilders Need to Hire 250,000 Workers Over the Next Decade for ‘Golden Fleet’  USNI NewsU.S Navy’s Top Brass Unveils Additional BBG(X) Battleship Information  navalnews.comFirst Trump-class battleship could cost over $20 billion: CBO  Breaking Defense",
    "published date": "Fri, 16 Jan 2026 20:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPTElBQlBYTTJROW9uZmtpaFZFVXRfeHNUeUFIZjFsYUhQUFJQbi1rTWc4cWxBQTdtU2QtcURqandKRmZNbnlyQkhDNUVPLV8wMkMwcm9NVmJBWTF5Wl9xWk5ybTNSbmZkR3lhRU01UnZ2TUhEbll0QUI0Z0VXRTAwQmFETEUwaVA5bFUxTWlYRHFmYWRvOVZZM1lTTnpTNEtZVHJKdUNFWVlGQ2dERDBqa0hEUXRpNmRfZ055RzJxREVBb3BxSWVKdjNIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.militarytimes.com",
      "title": "Military Times"
    }
  },
  {
    "title": "No, Trump can’t cancel the midterms. He’s doing this instead - Yahoo",
    "description": "No, Trump can’t cancel the midterms. He’s doing this instead  YahooIs Trump getting impeached in 2026? Here's what he said about cancelling midterms  The News JournalJimmy Kimmel on the midterms: ‘We can’t have an election soon enough’  The GuardianTrump Says U.S. ‘Shouldn’t Even Have an Election’ as He Threatens Insurrection Act  Rolling StoneTrump says the US ‘shouldn’t even have an election’ in 2026 because of all his accomplishments  Yahoo",
    "published date": "Sat, 17 Jan 2026 15:00:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPZEJyMExRbklyTkwzM2ViQzlzQnFUOTEwbkNlSmhmTmVsTF9SWk9DN2EwakFZSmExV1R0RXRnLVZubXZxNU1Da2hIdlBpS0VtZDZYX2F1RXczZUY3S0R5bDJobHhta1d4Znl6aGIzV3lISVBiT093bTR2MEJ3bzlTbUFLaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Celebrates the Great, Historic Investment in Rural Health - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Celebrates the Great, Historic Investment in Rural Health  The White House (.gov)President Trump Hosts Rural Health Roundtable  C-SPANTrump sharpens health care affordability message for midterms  The HillTrump says $50B rural health plan funded by cutting Medicaid 'waste, fraud and abuse'  Fox NewsWATCH: Trump blames Democrats for rural health care struggles at roundtable event  PBS",
    "published date": "Fri, 16 Jan 2026 17:08:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQYXRkcWwyQ1JRbE9DV3B6RUFFbUdyTENmVHk2alBVX2V3VHhhYVlyeWQxYjEtQ0JOa09RX0E3d0tobi1oN2xHdnd2eVg4RHN3RVY5N0hOc2wzejViYzJXd09ta3Zkekx5bXA5dEVHUWszVU11cW5BLUR4eHhjeDlWRTcyWE5nTEFxTmpXUWE2WkVMWnV2Qy0tWFA4VkFGWUNkbnBxcW5iTXZBYVNxcEl2emdtbTE5Tll3b1V1a3V3S212a0Z0dzJTT2IxWVM1WFhGVzRvQXJ5Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Weather Impact Alert: Arctic blast heads to WNY next week - WGRZ",
    "description": "Weather Impact Alert: Arctic blast heads to WNY next week  WGRZChances for snow in NY, NJ this weekend growing  FOX 5 New YorkSnow in NYC area as 2 systems enter region this weekend. Here's the First Alert Weather Day forecast.  CBS NewsWinter weather advisories: Snow in parts of Upstate NY on Saturday; Syracuse mostly spared  Syracuse.comSnow might hit NYC this weekend—here’s what to know  Time Out Worldwide",
    "published date": "Fri, 16 Jan 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPMUk4M2ZHa3FHTndJRTZxbzJJc1JxbmVqZHIxVGRmTUtHYlVIS1RZaG1VdUpoS0xJZ1JsZzMwMWNOMEFnRGRrTGxONDNOeVlTM1ExbVlFM1pIZi0wb2lRa3RDTWliSkZmQm55MzJZQnF6UURZYVVrN2p0ZkZULTFndUtGVG5YOGVfTWs3b3RYWkZEX2VyMUROQ2VmSHJCMTFfQXk2X0hFUkFjLWJvWmVaZXNxZjNCZ2U3bm1XcFdDNjBCYXhwVFNkR2VoZUNzWmlQdUp3Unpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wgrz.com",
      "title": "WGRZ"
    }
  },
  {
    "title": "Uvalde gunman fired 117 shots in 2 minutes before officer Gonzales entered the school, official says - ABC News",
    "description": "Uvalde gunman fired 117 shots in 2 minutes before officer Gonzales entered the school, official says  ABC NewsTeacher tells court she saw officer accused of failing to delay Uvalde school massacre: ‘He just stayed there’  CNN‘He just stayed there’: Former Robb teacher’s aide discusses interaction with Adrian Gonzales  KSATWitness says officer paced outside as shooter neared in Uvalde case  Texas Public Radio | TPRTrial of former Uvalde CISD officer recesses early Thursday due to family emergency of jury member  KXAN Austin",
    "published date": "Fri, 16 Jan 2026 19:03:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPdF9GZERRNjltS0xKb3BLei0tT094a25tVGpYaGNpd0NaTFhjdWVPdFpKbnhyckF2QTRDNHNSOTRDOXdmSEdMTnJ4bXF0QXpTdElBUUhyenBock1NZU1zbWIxVjNubWhFN3gtUW9RUXJaQkRCdGZCVzBrNm5hX2pHZzFOdThoeE01dk5uaGZkZ0plaDZQajdj0gGcAUFVX3lxTFA3WDM3ZFJpeHM2b3F5N2UxMktZR0xHYy1PekZTYWJhMmd1aW13TjBkVm9KWUNHa2JHelRSOE1nUmE3Y0t3SDFPOGxueU5VOVlMVWR2bTBsd2JuRjNPdHM2MUVPT0V4RnNVczlmSUVyTE5CeGt6eVY0bkVLVktGZ0xiVEtSVjZOZWJPeDRSeWc0X0NCbVJ5MHlaNGR3ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Krysten Sinema | Former US senator sued by Moore County, NC, woman for alienation of affection - ABC11",
    "description": "Krysten Sinema | Former US senator sued by Moore County, NC, woman for alienation of affection  ABC11Former Senator Kyrsten Sinema Accused of Affair With Member of Security Team  The New York TimesKyrsten Sinema sued for allegedly having affair with bodyguard, breaking up marriage  The Washington PostEx-wife of Sinema aide accuses former Arizona senator of wrecking her marriage  The HillVideo: Hecklers in Utah interrupt former Sen. Kyrsten Sinema about allegation of affair with security staffer  The Salt Lake Tribune",
    "published date": "Sat, 17 Jan 2026 02:27:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQNXh1QlFfdE1CbWhQNVJaTE9rUHdmNlVnY3V5dlBCVVFaZDFDYTFCd3FiRDdaU3dyOS05dlRIVXZ1OGdHc3lQNEpiQkg2aG9qeEJRb0pZbzVsMG5LbFY4bE5kMUpoVUM2VU5WT0dXZXg5NFhtQ3NfT2JVR1J6b2dHV1NUcWZOY0ZaRElDQlF6TWtrdllTcXZDbExqZUVkQ1VaRU9XZWQwZHoySWxKUEV0d2Z1SdIBuAFBVV95cUxQNUpVNzdOSnU0b0lPNHVVd3AzZXExWkQ0ZXA2Tm44d0FNRTF4bW45TW4xb1c0NmplWGVSRXFRS3J4bkdMWm00M3dCbUtldUVxQ292aWRxb2QzNlg4ZHFVUFNEcGs4SkdtM2RrWjJKZkRwWXRfMWxrWWRvVkMxQmpINHdTZThuUXdhWFdueFk5X3VCVGJvbHFTdjBFc1EzWmEzNlJzLVMyaXlEaDNUQVBCcVdkeWhEZFZi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc11.com",
      "title": "ABC11"
    }
  },
  {
    "title": "Senate Democrats push for Noem, Homan testimony after Renee Good killing - CBS News",
    "description": "Senate Democrats push for Noem, Homan testimony after Renee Good killing  CBS NewsOpinion | Congressional Democrats need to bring a knife to an ICE fight  MS NOWRepublicans Punt on a DHS Funding Fight with Democrats After Minnesota ICE Shooting  NOTUS — News of the United StatesAbolish ICE? It’s a Slogan Some Democratic Critics of ICE Would Abolish.  The New York TimesDemocrats threaten government shutdown over immigration operations concerns  WCVB",
    "published date": "Fri, 16 Jan 2026 21:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOZkJhRjFHV3ctSmZnSi1sdnRMVFRfNW91TGdlb3VvSVIxd1BtdExJbnVTYksyd01WdnRmcHF4bGFqb0RLci1qR2lBUWctRm9McjRfUmNnX2NuUXBTdlcwODBfN3hzMzNhNEtyV3Y1TkZSZEc2anhPTjIySGRwTUM0VHFvR3BTY1hzbjROSEYyUTBEaXJab3Y1dkRiOTlkcE54UjlR0gGoAUFVX3lxTE1kRlRUM2N0d0NHQkFab1J4TE9fV2w1N2JfeHBlbjBMd0VVMTdjX3IxYUdOenV3Z3plcWFhSnZKam9laHlvTjd5YmFBQjNaX1BaOTN6TGYyMy02d2FlWGd1d09KaFJwTmdJUjctVFAwVmd3V0xqeHhaVnV1a1NES0hGV0lYUk5ENUxobHRkV0R5TF83M1VkamRWakdVS0NUaUM1OWxSNEc3Yg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "US federal forces blind two protesters shot in face with ‘less-lethal’ munitions - The Guardian",
    "description": "US federal forces blind two protesters shot in face with ‘less-lethal’ munitions  The GuardianSecond man shares horrific story of being blinded by officers at anti-ICE rally in Santa Ana  Los Angeles TimesProtester blind in left eye after federal agent fired projectile during Santa Ana protest, family says  ABC7 Los Angeles21-year-old says he's blind in left eye after federal agent shot him with less-lethal round at California protest  CBS NewsMan speaks out after losing sight in one eye during anti-ICE protest in Santa Ana  FOX 11 Los Angeles",
    "published date": "Sat, 17 Jan 2026 13:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPYmI0NUZnbXNwTVF1MS1uUndIdUNvMHFjV19oRGlfaFkzQU9MeENfazJsWU0zM2ZHeHhEVXZQOW5YSV9HM3NBdGdDQUJBSC13a1ZqcDVlaDg2c29adjEwMnBYcjVMY2pGTHlmOUg4bk5icHQ2RjJaTFI4UWFrUE8zMXlZMWg2Q21tekE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Wrestling icon’s massive donation to suspended worker has Trump critics cheering - OregonLive.com",
    "description": "Wrestling icon’s massive donation to suspended worker has Trump critics cheering  OregonLive.comTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostColbert Jokes That Trump Has Found ‘a New National Bird’  The New York TimesTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNA Ford worker heckled Trump. His suspension is a reminder that free speech can get you in trouble at work.  Business Insider",
    "published date": "Fri, 16 Jan 2026 22:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPV1NHblJ1WUpvZkpmcEpXU2NYeGVXQnhuVW5BR242eWxSSUNoOC1mVXdNeVJlTmNJNV9maWtDUnhvenExeXZZRXVWZjdob2dpZy05cDJIMXpuNGw5ZWc3ZVNySmFfVTlWbVV6ZVN5QlppbUdndmVsOWtFeU1yUGdGaE5DZEZ1SGdUYmc3MDdmSDRjQXFQSkRxWUVOcjlGX1lZa2pheE5NUXI0X3N5elQzaTYtcVduLU5VTDhLU1lnZDlFR2810gHYAUFVX3lxTE5JN0N0QzFpamlHQnlYSlc4Z0xBeUVvd0JRTjQ0YVNhNDg0RmZZTWs0VmszWjc0dzkxNDF2b2lZdW1JZmJ1eTBBNVp3VW0tcEFRWFRhbXZJMHFHcm9RNmx2anBjbE9oaUE2WnJhcVRZMm1SXzBPWU0wLWY5TVZHVW44TzdsSmk1WnYxYU83b3hEaGxoZ3NfcTlNMnFwUUMwZlo2Z2luaUNia1d5d3RYMVFpMENVVzVBcWYyN3VDV3BiNDFqbzFwQnF2WXpyZHhJS0RRbTVzQUdOVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "How ‘Mamas of Cedar’ are keeping watch for ICE in Minneapolis - Sahan Journal",
    "description": "How ‘Mamas of Cedar’ are keeping watch for ICE in Minneapolis  Sahan JournalView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPUlNvRXNhMW5wNWdLUzV5MFZLNzJEUnpsQUlFdG5GNDVmN0xVQ1JNS002MlY5VU5GcTlXZWNrc2UzSmw1SnU1MXBBc1MxQVZ5MzJuQ1dNdmF6R1dqdXRqSXRBbU1zVTVsbHpaS0hqLV9Wek5ZUUh2V3Q5b19qTEhyRHV4M3lDeUJfZjJjV1I0Wkg0SkkyeVFNekVXS0RmN2JoNlhPMTIzZGRkdGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sahanjournal.com",
      "title": "Sahan Journal"
    }
  },
  {
    "title": "Trump Has This ‘Backup Plan’ If Supreme Court Strikes Down His Tariffs, Adviser Says - Forbes",
    "description": "Trump Has This ‘Backup Plan’ If Supreme Court Strikes Down His Tariffs, Adviser Says  ForbesSupreme Court is set to rule on constitutionality of Trump tariffs – but not their wisdom  The ConversationSupreme Court tariff ruling: It's not just about refunds. Volume of U.S. freight trade could hinge on decision  CNBCSupreme Court plans rulings for January 20 with Trump's tariffs still undecided  ReutersSupreme Court Sets Tuesday for Next Opinions With Tariff Ruling Pending  Bloomberg",
    "published date": "Fri, 16 Jan 2026 18:20:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQOVpCZEp2cEdERmJmSmp5T2xFeC1LWGFScWJjdUwyYk9QRERFWGdidUZYVW13Nk5FWE4wRjhRcW0xX0tnVEd0WkNmSjZZWjd6aUhrd2JlREJ3MWlJM19FZXhVa0xaSnl2UmFQX2FmNW5jd2Ywd2NqWnJVUm5ZSzJQb081cVZHZWRyak55dHh0TkIxQ2drY2Qybno1VThfa2luTHByX2dISk03VVNsVmlyMGd0UjJzWTVkWWozUnhjcm4zYkVaalphNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Man Who Attacked ‘Grandpa Vicha’ in San Francisco Is Found Not Guilty of Murder - The New York Times",
    "description": "Man Who Attacked ‘Grandpa Vicha’ in San Francisco Is Found Not Guilty of Murder  The New York TimesMan acquitted of murder in S.F. killing of ‘Grandpa Vicha,’ case that sparked Stop Asian Hate movement  San Francisco ChronicleSuspect found guilty of involuntary manslaughter in 2021 San Francisco 'Grandpa Vicha' murder case  ABC7 San FranciscoUS man found guilty of involuntary manslaughter in death of elderly Asian man  The GuardianInvoluntary manslaughter conviction in ‘Grandpa Vicha' trial  NBC Bay Area",
    "published date": "Fri, 16 Jan 2026 23:04:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9TQ3owY09OdU9MRk1uUUxCbnpGbnBQbS1oRHVTeXNHTXBJc1VvOXcyVHNXTkhiMWlzYXJZSjR0RlFueUcwOUJ5bFhuRUlqM3c1cjBDLTJXV1A4VXBhTW84cm0xak1jaHFCZHhieWEydC04SS1KNVJoQ3Jad0o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Major winter storm moving, bringing strong wind gusts, snow to Plains and Northeast - ABC News",
    "description": "Major winter storm moving, bringing strong wind gusts, snow to Plains and Northeast  ABC NewsBack-to-back winter storms hit the East this weekend with arctic blast behind them next week  ABC NewsRelentless snow and frigid temperatures plague much of U.S. ahead of holiday weekend  NBC NewsWeekend snow eyes major Northeast cities from Boston to New York City  YahooWinter Storm Warning As 24 Inches of Snow To Strike  Newsweek",
    "published date": "Fri, 16 Jan 2026 16:09:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOSFQxNEJ5U3g1U1N0cWJCYUpCNk9ZYzZIMG5aWnFUSm5fUXpWRDYzSUxteG5hQUNJY2tBRzNnTFppc09JZEZUOW44TXp2VFhqVjBnVjJyQlY2SGpDRmk3OXhnRWNiUjR3dWRFcVZ0MzBPX3hEQkdoOU1XNzFSb3ZfemRpUTRRSzZZNWc1VFpLb21VQTZGd3JncGJ3azlaQdIBowFBVV95cUxOVGlwVFlHbHNaMHlFT1NCQUhQZWswMkpRM0wzOHFQOVZyYkdzV2FFZEkwazA5SUZUNjZRU252OXMxcjRxUmU0YUlnYzdvakM4ckxvbmQtSGc5dkh2MWd5emUtU051RF9lc3RqaW0tQzMyb2Q2aWoxNmRuaDhWYlRBbFNoTGFpMnVGVy1LWEF4cVdrTUt3a2pWRFVxMjRMWGU4cGhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "The Real Reason the DOJ’s Rampage Against Trump’s Enemies Kicked Up a Notch This Week - Slate",
    "description": "The Real Reason the DOJ’s Rampage Against Trump’s Enemies Kicked Up a Notch This Week  SlateOpinion | One Year In, Trump’s Attack on American Justice is Accelerating  The New York TimesHow the Trump Justice Department is targeting his perceived opponents  NPRInside a year of firings that have shaken Trump Justice Department: ‘Great deal of fear'  NBC4 WashingtonThe latest on Trump’s weaponization of the DOJ, briefly explained  vox.com",
    "published date": "Sat, 17 Jan 2026 10:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNVG50VmI2ZnFRN2hKMG5ydDRJV0h4b0d0a1JyM1o1c09NN0VSNkNXelo4bjN0YjlmUjd5QzdhMzRFal9rd2tEclBoRktFV2tnRjU4bU1DSmU4STR4ZG10MHJtQVRSRW1ZLXVlR3VfbkVGdklnNHlxZDZqTDBWVjAwTmh1WkJ0b2FUbkZCUzh6RGFZWUlSdDNjVkl2NVJBS1Vj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Claims Of ICE Officer’s “Internal Bleeding” Under Heavy Scrutiny - Forbes",
    "description": "Claims Of ICE Officer’s “Internal Bleeding” Under Heavy Scrutiny  ForbesCBS News report on ICE officer’s injuries drew ‘huge internal concern’  The GuardianAgent Who Shot Renee Good in Minneapolis Was Trained to Track and Apprehend Fugitives  The New York TimesNoem blew up plan to protect ICE officer’s ID after shooting: Sources  NewsNationLeaked Emails Show ‘Concern’ in CBS Newsroom Over ICE Agent ‘Internal Bleeding’ Exclusive: Report  Yahoo",
    "published date": "Fri, 16 Jan 2026 21:33:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOYXlONTZOclpoNXoxUmxkR2o1UTRZTzQ2aFJGemhrdlQ3MTlXQ2J4bEEtbUlwTUVuTS1nS0NxVFNBQ00wVlJBMXBKLVJkNEJoOUlkTkJCM2ZJVktKODFmZm1LdkhieVdWa1hrOWdqdUhhOHI4bDRiYWlJeG9yZFZpZ1FDekJ1ekFiTXN3N2xHb0JSelNFZDRUOEV0cjlwSGxuZTRqYVpGb1hid3V4ak1oUVVVWlVxdnVPcjF5MldmakRJbkNNN2libGd2YWJVUWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  }
]