[
  {
    "title": "Houston sketch artist posts rendering of masked suspect in Nancy Guthrie case - Houston Chronicle",
    "description": "Houston sketch artist posts rendering of masked suspect in Nancy Guthrie case  Houston ChronicleLive updates: Nancy Guthrie case suspect described as male with Ozark backpack, FBI reward grows  CNNFBI releases description of suspect in Nancy Guthrie kidnapping  BBCRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOAExclusive | Investigators find black glove during hunt for Nancy Guthrie’s kidnappers — and The Post was there  New York Post",
    "published date": "Thu, 12 Feb 2026 21:18:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNQXlPcUNFc3duczZVYU14Z3dISkpfVFNuUFZJV1B2d3dJU1hqdnlFNldyV1RORlZXWnlEWFdvT2V0OGFlb2hFcXU0VkVDZllLaXdkR2pPdm82Zlg1bWZMRGVMMG9XN2JRYndXMi0xOXRaR2FrQkhqTHdKdW1EVzlRNk9wOWxJM0hScDRrUGhheWNIeW5YbjBGVGR5TUVJd1lxSUlJWEk3anFsV3VPektCMXFSSWo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.houstonchronicle.com",
      "title": "Houston Chronicle"
    }
  },
  {
    "title": "Trump repeals U.S. government’s power to regulate climate - The Washington Post",
    "description": "Trump repeals U.S. government’s power to regulate climate  The Washington PostTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesHawaii environmental leaders condemn EPA rollback  Honolulu Star-AdvertiserTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNNTrump revokes EPA finding on greenhouse gas threat in huge blow to climate change regulations  CNBC",
    "published date": "Fri, 13 Feb 2026 03:43:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPT0tIWHEyTHpLclhSbjJwLXNzWE5Ydlg4Z0tmNEhKSElRcmJ5bnE1VjVtWEdNSktvNFhJZGZXbnhuZmxmcjQyaGlUcWVQVGRVQmd2X1JsM2RVOTNmc0JFX19DUXNrSXdZRHZwaDNpOE8teW5PTlVJSnVQSVZmMGFkZURvTGpDQjBuVTFYWnRIMVBhTGhI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check - CBS News",
    "description": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check  CBS NewsEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticMinneapolis Immigration Crackdown to End, Says Trump Administration  Time MagazineTrump Administration to End Surge of Immigration Agents in Minnesota  The New York Times",
    "published date": "Fri, 13 Feb 2026 04:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcGt6cWQxTzJ4c1lFcHNiZTl0WXd5eEFJdlNpYlFqb21aNmZZNGxBZGZQckJ4cTBHeEZTbGJRV3h0YlVNUE1fRnB6MzN3UzJ0NFNCRjYxY1JEMlYxSXkxRkV3cGNJOXozWU8yZkY5V2loUHM4WEZVUmtyYXRPaEdXaHpwazZwNUxPVi1qZXBMckw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "SC State University on lockdown after fatal shooting, officials say - WYFF",
    "description": "SC State University on lockdown after fatal shooting, officials say  WYFFShooting at SC State University leaves 2 dead, 1 injured  WIS News 10SC State on lockdown following shooting  WACH2 dead, 1 hurt after shooting on SC State campus  Live 5 NewsTwo killed in South Carolina HBCU shooting  The Jerusalem Post",
    "published date": "Fri, 13 Feb 2026 05:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxObXNGTEIxQy1uZHhqQ3lvdUdGTFdHb19zbThfWm9pSHVLYzZIc0FLZEF1eHpxak1jeC01d09jRmI3THd4M1hqQnhWQ0RwdlI3dVg0RFkySVAybXQxQnFpZjVBX2VPcDVkenJlMk9wLVZ2NTRkMThjM2oxMnlscjM1UGtNUjBmd2N1cW01SVJMdTZFTDRCclBZNWdpbTM2X1lQOFVGa1VvWkY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wyff4.com",
      "title": "WYFF"
    }
  },
  {
    "title": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "description": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosHouse Democrats think Pam Bondi just helped them in the midterms  Politico‘Pretty rich’: Republicans claim Democrats are the hypocrites in new DOJ ‘spying’ scandal  MS NOWPam Bondi’s Contempt for Congress  The New YorkerOpinion | Pam Bondi’s Performance Before Congress  The New York Times",
    "published date": "Fri, 13 Feb 2026 04:44:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNdG5Bbnhmb0VxdEpLU0FVcFQ3WUZTbmJ1WU5WeTBJblZyVnpfZFdtZkhXMEdsei1WZk4yQ2QtNEZGcGwtRGxfandyMUJfN0drUVRtbEhyZWMwMkk0WEtpX1p1ZEZYNzdGQVNjdDFOaUFKOWNfQlYwNGFwNXdjaDd5czZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video  CNNFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge blocks US military from demoting Mark Kelly over 'illegal orders' video  BBCJudge temporarily blocks Pentagon action against Mark Kelly over illegal orders video  NPR",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says, as Iran tensions high - AP News",
    "description": "Second US aircraft carrier is being sent to the Middle East, AP source says, as Iran tensions high  AP NewsUS readying another aircraft carrier for deployment amid Iran tensions  Al JazeeraUS sending second aircraft carrier, world’s largest, to Mideast as Iran tensions high  The Times of IsraelUSS Ford ordered to the Middle East, the second aircraft carrier being sent to the region  Fox NewsU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York Times",
    "published date": "Fri, 13 Feb 2026 05:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNVWpDTl82THV5ZTVTMTNhbXpxc0RZSkE1dV9FM3hmV3lyUHhDeTQwS19EREljVEd1OGdhZlhnQjRITmlDS3lwbVFnbG1qQWFYeHZZdk9mdmpUWkVzclJIZTdLM3BlaGFNWFJ6Q005OUpCMTByTFZ1OEI2Nk9IcURadzlEa25ZbHZQOVZ3a2VVN0UybmthdjRhWlNwODc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNA party balloon condemns the El Paso anti-drone laser fiasco | Opinion  USA TodayLaser weapon that shut down El Paso's skies was LOCUST system  AxiosBorder Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser  The New York Times‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  Politico",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Pride flag flies again at Stonewall Inn, challenging federal ban - The Washington Post",
    "description": "Pride flag flies again at Stonewall Inn, challenging federal ban  The Washington PostNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkNY officials raise rainbow flag at Stonewall in rebuke of Trump administration  YahooPride flag reinstated at Stonewall after it was removed by Trump administration  The Guardian",
    "published date": "Fri, 13 Feb 2026 06:56:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTlZKcnY4SHdjSnFPWHhnQjVjcmdBMm5lR3pYeEFLck1XYVR0b25hWVhTczJONlRQSExha1ZMMUhfZ3c5Qk1qbDI2VTlCUUZ1VU0zYW5YemlSVmtLTnI5WnR6RnV4ZXNjbGhNcEwzMGhJbWRoNkp6VUNHb2FyTzRsNWlKZmI1NE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "What is the SAVE America Act that mandates voter ID? - BBC",
    "description": "What is the SAVE America Act that mandates voter ID?  BBCHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsRep. Crow Holds Press Conf. Following Failed DOJ Indictment  C-SPANHouse passes GOP elections overhaul  PoliticoHouse GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBS",
    "published date": "Thu, 12 Feb 2026 22:40:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5XalhoSGFGaTJrWU9qRFFBaHRkS1l2eVFlaEFHOVdPcGIwalBtazdOQTBwV3JfMUNyRTFWalFvSXppZ1dtcFB1RWFiZEFVZmg3enhGRWljeW5LZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "DHS shutdown imminent as Senate leaves town without deal - Axios",
    "description": "DHS shutdown imminent as Senate leaves town without deal  AxiosDepartment of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight  CNNA D.H.S. Shutdown Looms. Bruised Minnesotans Urge Their Parties to Dig In.  The New York TimesDHS heads towards shutdown after funding bill fails in Senate  BBCDHS expected to shut down as immigration talks falter  NPR",
    "published date": "Thu, 12 Feb 2026 20:27:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQTVRpLU5HV1pNdjJBMmQ4aWpFVnJzbWE4OTBfUHBpQno0ZkZROW4wNGJZbjFDaURVa2dCNkxuSEtkd01yMWxBSmplM1dQUGF3WktVOWt6ODM0VjVJckw0LW1ndjBUSk1KTHRDS3pCQ1FGdjRQb3FaRW55bU9TazBlYm5KdnpDUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece - CBS News",
    "description": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece  CBS NewsUS federal immigration officer charged with harboring undocumented person  The GuardianBorder agent charged with hiding person in country illegally  KRIS 6 NewsCPB supervisor accused of harboring undocumented migrant girlfriend who authorities say is also his niece  The IndependentCBP Supervisor Arrested in Laredo on Harboring Charge  Hoodline",
    "published date": "Fri, 13 Feb 2026 02:22:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNYVBkZVptOWFLSjJ5R19mdG9HZEQ3MkF1eEpNY04xbEpkQlEtS0VZXzVFSTZyblJBQlNfdko2V1BLYk51NW1EOFVNZW5mdk1UYlNpVmlPUFcxSEJVbHpzM29wVHVfajNfRTZtc1dpb0xqckloTnJraUlETDNuNUdXMXNzOFBSVXE2S3VGbV9ST2EybnJ2V0Vzd1U0LUdWQzlaUWhHYUJlamlFdEx6NEpiU2lseEowc3h1T2fSAb8BQVVfeXFMTXZYN0cwdjZ1QVFlTGt0MHAxdkZ0enRXdGVUNjJ0dTNkcjRnTDBvMWFjbGM0LVJvUXhzSDd1Nl90cjJTTFhfRGNaejlGRWtrZHVUSWxwUEFFNWJCQWJqSHdBOXE0cnBORzRYcGNFWjJJd2lYTVgxRXFaeGlRcjAzN2l0OVY5ZjlMMGtsZUFvVGNhbTJkRU1SeXFVTWRnRHFUR25YR3JQdU93Zk5iczlzWmVxRWNjS21TZU5lbWREM2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Prosecutor Seeks Dismissal of Charges Against Man Shot by ICE - The New York Times",
    "description": "Prosecutor Seeks Dismissal of Charges Against Man Shot by ICE  The New York TimesJustice department moves to drop charges against men accused of hitting ICE officer in Minnesota  The GuardianGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. PaulCharges dropped against men accused of attacking ICE officer during north Minneapolis shooting  MPR News",
    "published date": "Fri, 13 Feb 2026 08:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUDN5MUdVVDJfRW5FVVN2RXlFNnJJcnVKOTMtTV96RWNwNlVZZlp2ZEhjTFF4SVIwdm1tXzM4RU5KMWNETnZwT1RBb3JuWnppSDlOREN5QXVoX3RCWnN5QVUxVmpSdW1XLWd5RThacE5Yb3JtSXZLaDhrMGdWRWgyTzF5bGJrMjEwNmFRMmtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds - The New York Times",
    "description": "Federal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesJudge blocks Trump admin from rescinding health grants to Democratic-led states  NPRJudge blocks Trump administration move to cut $600 million in HIV funding from states  Los Angeles TimesCalifornia sues as Trump cuts $600M in public health grants to four states  CalMattersIllinois sues Trump administration over more than $100 million in planned cuts to health care grants  Chicago Tribune",
    "published date": "Fri, 13 Feb 2026 01:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ1RtbW1BUUtqUGdIYzVMM1RGcVc2U254c2tNaF82aEFwN20zMWZmcjFFeXkxSUtlLUhKelhpSWVuMkU0YnlHVzlqeVcyMWhKODFhZUxsemhHaE4xNDFYbGpUdHI1T1JNSTJfWVIxcGkyYm9aM3doazVySndxNjhnNVQ3WjFySkFVZ0RaZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump attacked this GOP governor while claiming Democrats were always included in annual meeting - PBS",
    "description": "Trump attacked this GOP governor while claiming Democrats were always included in annual meeting  PBSTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsGov. Moore dismisses Trump’s ‘not worthy’ snub: ‘I will bow down to no one’  WTOPConfusion reigns over Trump meeting with governors  The HillTrump allows Democratic governors at White House meeting after initial snub  The Washington Post",
    "published date": "Thu, 12 Feb 2026 17:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNR1FKT3lEV3FDSGFzWm5hdnlFU3ZRZU1fbUlMM3QzcElpVEwtbFVYbU82MWRnX0ZDY1JjV0hONHlPQmFsdE5KZTItZUYteTh5STlFYXllT1hlYndZNGJFZ2Y1d3JIclRPOUpEclpvM2dTX0NCUENkeXI5WXV0TXplNlh0M1lOTmxscTBEOWxJV3lLZy1iUC1ROTk2RlJMRzcwOXZIb1Y2VkNxei00dkw0TXBPdldBNVVIM2ZiNGFwX19sTXkzcXpGN1RITG1MclXSAdQBQVVfeXFMTVFVa2pGdWFNQS03bDBQR1NQOWVjTVFyVUlTTTliS0pzcVl4MDJmdzBRR0dib052OUswSGtfQUZMb2dmbnFHSUZKbDNSNEtYVkgxbEhPYjF6Qm1ULWNOdENVYVpDY2Utb1kySzZXaHZRXzNUZGh2cU8yTndoS29yWDNiZVowUUJvQ0JFbVRGR3dkS2VWQXpaaFV1NWlBTTZXTHZlaWVPTTlGcnk5MkJzTHVHUWhSX2g3dGVwQzU3ZFpsYUhRY1N1bU1rZ011UDNtQWtsOFM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "A New Frontier in Timidity for Congressional Republicans - The Bulwark",
    "description": "A New Frontier in Timidity for Congressional Republicans  The BulwarkHow Trump failed in his latest bid to weaponize justice  CNNOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York TimesRepublicans chastise Trump administration for failed indictment of Democrats  SemaforOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington Post",
    "published date": "Thu, 12 Feb 2026 20:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNNEpNNHFOM2hxRU4xUFJVMk02OVdkSkdtaFo0SlhoMllKYzFPN1RkSElLbGFSaXZlMmN5ZmpMSk9LTkRBTWZoSVQ2TEUyLXo2VERoQ2NUaDYxVU9ZeEhGR2Z0NTlFdkN5Z0xrN3lKN0o2Z2NYZ2s2ZjVQTC1UYUgwdXRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge rules Whipple detainees must have access to attorneys, private calls  Star TribuneJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York TimesICE blocked detainees' access to lawyers in Minnesota, judge finds  Reuters",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick - The Salt Lake Tribune",
    "description": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake TribuneBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC NewsUtah Sen. John Curtis is sinking Jeremy Carl’s nomination for a State Department post  PoliticoTrump’s pick for top diplomatic role faces scrutiny over ‘white supremacist’ views  The Guardian",
    "published date": "Thu, 12 Feb 2026 23:53:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVlplNU0tZDBIb2NoY09oc2VVQS1jd1ViUGpIVk1jdUFrbXZMTHhEb3hMRm9mbmgyWlMyTk9qQnZlOHZxcU9JQmVxdmY5aGE2S0lncUhQd3RHd0ozMVdzcXpqTExjZFRqeXo4R0ZCOU1iTEFfRnRBSllhb1hfLVpDRThQS3A2Rk9tV0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race - The New York Times",
    "description": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race  The New York TimesAnalilia Mejia wins N.J. Democratic nomination for U.S. House seat  MS NOWNew Jersey 11th Congressional District Special Primary Election Results 2026  The New York Times14 takeaways from Analilia Mejia’s stunning win  New Jersey GlobeThe left smells blood after shocking Democratic primary result  Axios",
    "published date": "Thu, 12 Feb 2026 22:41:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQRTJMWjJRVXZDR0lSV2hDbEJqalF0R2VMYmhPVGpzT2lPbUpnYXotM0VENDZtMmk3U0JDaFYyUWVTZmFDMXVnZzNrYUEtb1hnMHFRRHhLMlFUMVQzVUFkWTE3VjM1SGU5Um1qNGRoUXNlSnJJd3NNY0Z0TEJyM1hSSThQMFJRbVpWbVVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesThe Epstein files come for Hollywood royalty  CNNConspiracy Theories Only Flourish With More Epstein Evidence  The New York TimesInside Epstein's efforts to influence elites, from U.K. to Russia and beyond  AxiosThe Epstein files tell a story of justice denied  The Economist",
    "published date": "Fri, 13 Feb 2026 00:36:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act - NPR",
    "description": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act  NPRAmericans could pay to bring back alleged members of 'foreign terrorist cartel' to US  Fox NewsJudge orders return of Venezuelans formerly detained in El Salvador if they choose to come back  NBC NewsJudge orders Trump administration to help dozens of deportees return to the US  PoliticoJudge cites Abrego in ordering Trump administration to facilitate return of Venezuelans  MS NOW",
    "published date": "Thu, 12 Feb 2026 19:05:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNZEdPVEZXd2xISUJOTHc1SW5tVkhGdmZnRDBSZmVHMTc0NE9KcHRhRFV5UmZSeGdHTS0wYkN4bzlsSUhOVVU4UWxtb3VySERJLUZWT0E2QlVsZGVjdEgzSnpSTm8yT1N1RXlBVTZMdTZTWEtaT1l0WF9IckczS0U0ZF9rcVhTZExSVEY5Uml5a2xCSmRqa0xRQkRtX0JfaGc5QUQzd1lCTzNyWmtrUEdVUmlXYnIzNk1RYmdpY2J4SzZtY2hBbmF3UkpnWWVJck9hdUt3aWxoNWRrTkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing - AP News",
    "description": "Trump immigration officials shown video of Alex Pretti’s death in tense Senate hearing  AP NewsHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneWATCH: Minnesota officials, federal immigration leaders testify before Senate Homeland panel  PBSTakeaways from a tense House hearing with Trump immigration officials  CNNMinnesota & Immigration Enforcement Officials Testify Before Senate Committee  C-SPAN",
    "published date": "Thu, 12 Feb 2026 22:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaDB0WGFKUFRXOWxJSzFoRlF3YzJKVjVoeUxpZ0FlVGhQbjdGcUlvV3BXQlliX0ZnOENFb0VtNU1iRk5kMTY4cVVFWnpFRmJLZlhYNzJacFBqc05nTWxHbHc4N2p5MlZZNG5UT0wtbWlWUnA3c3JTc3NjNGJVRTJwVURZbXhwUEV6ajJWcjcwZXlnQU5FczBxbUdMMGkxa3kyendMQzM0bGhjdzg0dzc0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Republicans just f*cked D.C.’s tax-filing season. City leaders could fight back. - The 51st",
    "description": "Republicans just f*cked D.C.’s tax-filing season. City leaders could fight back.  The 51stSenate clamps down on DC tax bill  PoliticoIn rare move, Congress exerts power over D.C. and blocks tax policy  The Washington PostSenate votes to overturn DC tax code though officials warned taxpayers may need to refile  NBC4 WashingtonBill to prevent DC from opting out of Trump tax cuts goes to president’s desk  WTOP",
    "published date": "Thu, 12 Feb 2026 21:37:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQamUydmFwQ2dWYV9YREMtVFhuUkVVa1kxbDVsLXpkY3FOZElyQk5rN01ySllPM2xaZzZKTTV3b0VFS09Ra0dvTGJKWk1QdnhwT0d3bDFOU3RaTHI1eG1LMUFJNVRRQ2ZDT096NDhUNDBNdFlsRjkzbjZrMjVCNlZNRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://51st.news",
      "title": "The 51st"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRSix House Republicans defy Trump to block his Canada tariffs  CNNWhite House expects ‘substantial’ GOP defections on Canada tariff vote in House  PoliticoColumn | A little Republican rebellion against Trump only goes so far  The Washington PostCalifornia Rep. Kiley breaks with GOP leadership — in a district that just turned blue  CalMatters",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump’s threat to shut down Michigan bridge opens new attack lane for Democrats - Politico",
    "description": "Trump’s threat to shut down Michigan bridge opens new attack lane for Democrats  PoliticoRick Snyder: Trump wrong about Gordie Howe Bridge  The Detroit NewsTrump Threatens to Block Michigan-Canada Bridge He Once Championed  ProPublica‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston GlobeHouse Oversight Committee member launches probe into Lutnick's meeting with Ambassador Bridge owner  CBS News",
    "published date": "Thu, 12 Feb 2026 22:07:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQeFFOdFd6NWVtYzNYRGFyVm1YTWdITU1EaEU2VVVtT3ZqaHNiUXBjTFVmYzFmcWZmT05Ka1lwbDlpd2g3bWktX1NZb2xOR3NzRzY2TEE2T0VuTDdqVlZWQUdxci1FaXlmT2hac3VoU0ZDc0lZMG9JS0Zfa0djMjAwWW00LWhvN2FlZGxyOExyZXEwdkVqdWlQV0tMODZnUE5DMUlJRmladGNzZTFELVViYkdqck1MX2JzUDJqd1VHMnpfMEg0S3dj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNTrump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosIran’s Missile Program Tops Israel’s Concerns as Netanyahu Meets Trump  The New York TimesIsrael may strike Iran alone, defense officials warn US  The Jerusalem Post",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSMarimar Martínez lawyers say officials ‘created a culture of violence’ among agents  YahooBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsImmigration authorities had surveilled Marimar Martinez, Chicago woman shot 5 times during 'Operation Midway Blitz': CBP Report  ABC7 ChicagoBorder patrol chief praised federal agent who shot US citizen in Chicago  The Guardian",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  }
]