[
  {
    "title": "Minnesota Representative Ilhan Omar attacked during town hall meeting - Al Jazeera",
    "description": "Minnesota Representative Ilhan Omar attacked during town hall meeting  Al JazeeraRep. Ilhan Omar Assaulted by Protester at Town Hall Meeting  C-SPANMinnesota congresswoman Ilhan Omar attacked with 'unknown liquid' during town hall  BBCLive updates on Minnesota: Rep. Ilhan Omar sprayed with unknown substance during town hall  CNNRep. Ilhan Omar attacked during town hall meeting in Minneapolis  The Washington Post",
    "published date": "Wed, 28 Jan 2026 01:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQcnFJU1VwamdPNl9Uak5rZE5mVTdWSjlXVzhXcV9tQmt3M1FnYVJ2SFgxMUZrUFFBeVRGYUhucjUyYmsyQ0xkNWF2bUVXQ1p4MTZocFRtcDdCYnd0ZVN4V08tSDhibW1hT05YandMSUlJNUVad28tOG8yY0JoNzE3NkY1bVhnRXNydWs5X2xxa3RtTjFPRmljNGdXbjl5QUJGVFVWckVXWVZyVXB6R1BB0gG0AUFVX3lxTE84T1pvakhMQkhsbmFoWlN1VXVCRkl1OFA0OWIxSnN5WVVDa25ETEw0UXlEUWs3cnhzYVM2cFdVUnNYdnBoWU50aTczVWc3bHlmZ0tTUFdtV3EtZGtxeU1RSUJUUzNfMHoyd0VNSS1Ebjl5THhDal9JbzRyRkp6YVI0dlR0NldXVGYtT0hLR1V6Y2UzeW9CQWJtS05ua2lhazdWVk9aMDRtVEFLSmswclFuektmWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Hill Democrats – and even some Republicans – plot an exit for Noem - CNN",
    "description": "Hill Democrats – and even some Republicans – plot an exit for Noem  CNNRepublicans turn on Noem, demand resignation  AxiosTrump news at a glance: Top Democrats give Trump ultimatum to fire Kristi Noem  The GuardianDemocrats Push to Impeach DHS Secretary Kristi Noem After Minneapolis Shooting  The New York TimesTrump reaffirms ethanol support, calls on Congress to finalize deal  Politico",
    "published date": "Wed, 28 Jan 2026 01:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9lM1lDM0o0TDNYMjJzUVJZN3ZQeVMzbmpLX0J3R3BTc28tMWk0VnI0ZWVteUx4Ym03V0NZWnZhMnFRLUt0bG5lMHhXZUVJN0lPb2F0WjEwS01BTWNoNHZhRWM3NXdsME1ZcTRmWW5JYjJxcXAtSEhjMWh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump says Alex Pretti should not have carried gun that was allowed under Minnesota law - Reuters",
    "description": "Trump says Alex Pretti should not have carried gun that was allowed under Minnesota law  ReutersMinneapolis Shooting Live Updates: Trump Faults Pretti for Carrying Gun but Says He Wants ‘Honest’ Inquiry Into Killing  The New York TimesSupport comes in waves for restaurant owner who opened doors for protestors to seek refuge  kare11.comTrump says government will 'de-escalate a little bit' in Minnesota after Pretti shooting  BBC2 federal officers fired shots during encounter that killed Alex Pretti, DHS tells Congress  wcvb.com",
    "published date": "Wed, 28 Jan 2026 01:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNeUxuUTNmSzdHZ3pINUtZSkl1ZGV3aUdZZU1CY2hiQ1kzSGsxNGVDOUVNZXFzV2Zfd0trZlNsU0hNNVplQ2ZER3BoeEF4VnU2SEVuSXZaaVNDaEJfN040WWhTclE0WVUyTDhvTWE2T3ZqUTVCb3Z0ZGZZLWM5dmQ4a19paVpKOGRjbGYwaWNIbW5PS2NZSGhrclJQOHF2NTlDQlpIbGFONGpHRFJ3NUowVzFwS1k1Z256MVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Texas Moves to Curtail H-1B Visas - The New York Times",
    "description": "Texas Moves to Curtail H-1B Visas  The New York TimesGov. Abbott directs state agencies to freeze H-1B visa petitions  kbtx.com'Need Texans First': Texas Halts H-1B Hiring At State Colleges, Agencies  NDTVGov. Abbott orders Texas universities, agencies to halt H-1B visa petitions  kut.orgGreg Abbott halts the use of H-1B visas at Texas state agencies and universities  houstonchronicle.com",
    "published date": "Tue, 27 Jan 2026 20:47:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBjdXpCd3MxdUVJbi1rQWdpaDlNRm5fWW1iaE0xREtLb1lndjJ6SnhyOElxZGxfbm9YRXlHbTVFbHo3aFhMQWVyNHpVU1lOZFBoQkNrTmNaQjRvcXhLQjVGbk9TSzFSYmdvX3NuZG03NExrcDc0RXBLTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The DHS crisis is squeezing Susan Collins - Politico",
    "description": "The DHS crisis is squeezing Susan Collins  PoliticoMaine’s Immigrant Students Stay Home as ICE Operation Ramps Up  The New York Times‘I want my mom’: Kindergartner left without her mother for several days as ICE detains parents in Maine  The Boston Globe“This Is a Warning”: ICE Agents Follow Protesters Home  The New RepublicICE surge creates new headache for Maine’s Susan Collins  The Washington Post",
    "published date": "Wed, 28 Jan 2026 02:24:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQcEdPRnFjT1ZjNmZzc3F1eHJ2REtOWjV0eElFYkpFalBCamttSzZia2ZNOXpMc2hVamZ6ejFha0hJd2w1NHo3ZTRtSkdxOVF6OTl6SGZKaXpCUm8yVUVwMFd5TlFPbVJWM1J6dENGWGY3bDJlLWZCMVZJMDVucjdqZ0phZ29zbmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Alexander brothers raped victims lured with trips, party invites, prosecutors say - The Washington Post",
    "description": "Alexander brothers raped victims lured with trips, party invites, prosecutors say  The Washington PostWoman Says She Met Alexander Brothers at Celebrity Home Before Assault  The New York TimesBrothers were predators masquerading as party boys, New York court hears  The GuardianAlexander brothers trial: Prosecution paints trio as predators, not party boys in opening statements  ABC NewsDiddy, Luigi Mangione, and My Stint in the Alexander Brothers Jury Pool  Vanity Fair",
    "published date": "Wed, 28 Jan 2026 01:20:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZUJnV1paVjVKT1FfNWVadWIwajUybV94RFpRdTNUT096ZC1wZXVhYjBvbm9oNkdHTzlnbnlHN3NkaHVvNlk4dkNLbkFZanlQdUxDTzhjM1Y4dVhKUW9GbjYySEppQ3ZRWUxYQzR2endyekp3dE1IaWV0eGt2bkN1OWoxR1k4V2t6ZHVxcjQtLTliY3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Mother describes losing 3 sons in frozen North Texas pond: \"I couldn't help them\" - CBS News",
    "description": "Mother describes losing 3 sons in frozen North Texas pond: \"I couldn't help them\"  CBS News‘They were just screaming.’ Mom unable to save 3 sons who fell through icy pond in Texas  AP News3 brothers die in North Texas frozen pond; mother says she 'couldn't save them'  fox4news.com3 young brothers drown after falling through ice into pond  nbcdfw.comNC officials urge caution on frozen water after three Texas boys drown in icy pond  WRAL",
    "published date": "Wed, 28 Jan 2026 00:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPVFl1VnNDald3RFBGSkNZbldRU0RPNTNVZ3VleHVldVUzOEcwREVmT1ZmRjVTS3hZTDlmZVZkb2JmSlgwTHJ4MTRIZURBWnRLb2JoeXJ1dXlOcFJnUW9pWGhpMkJ0S1ZtVG5mTEJzUnVibVNMVWRyeFVKaGhLM2hpdFZYRmFCVFdaVHhIemxXWmJnTEYyWVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington D.C. - NPR",
    "description": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington D.C.  NPRClose helicopter routes and Army crew’s perception of the wrong aircraft determine why a regional jet and helicopter collided  CNNSafety Board Blames F.A.A. For Multiple Failures in D.C. Crash  The New York Times‘This was preventable’: NTSB scorches FAA over fatal DC air disaster  PoliticoFAA ignored warnings before DCA crash, federal investigators say  The Washington Post",
    "published date": "Wed, 28 Jan 2026 00:12:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRGFUd0JYRnkxS3Nvbll3MEI3cG1qeDZMdGM1dm5JWDBaX3hlUERaQWotd0VkTzFaTDZDV0RLb3RNRFh3b3VXOUFETnlVVHRnU0hxVVdVNEptZ0NGZjVaajY0akNKVU1KUFpIUndET21UaHBTSkE3VGZ3NVlWWENfR3NEaWFFTXlIWnN6Sk83WWhSaVBwVkVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling - CNBC",
    "description": "ICE chief ordered to appear in Minnesota federal court, judge threatens contempt ruling  CNBCMinnesota’s chief judge, a veteran in conservative legal circles, takes on ICE  PoliticoJudge Orders ICE Chief to Appear in Court Over Potential Contempt  The New York TimesTrump has a new problem in Minneapolis — a GOP-appointed judge  CNNTrump administration releases Minnesota detainee after judge threatens to hold acting ICE director in contempt  NBC News",
    "published date": "Tue, 27 Jan 2026 14:57:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNV1FlZWhpUGhJbmczVldLSk1Sc01SaEI1bDE1ZEQwUVM2aGt4T2xUZHQtT0pwTWlxMWR3aGJWR1Q5Rk1VSTZjbW5tMERJMGg1VW9NVEdoMGd6Q3lKMWRZTmJEU0J0TmZQOUUxSU05VENSOGNjNi1JaHRnYl9JQ3kzaVhpbXBsbk14QWfSAY8BQVVfeXFMTmpYZ3ltTWQ0OFhvN0YzZDRoZC1ial9YM3lxSWptWXFUMFl6OVRoLUpCTlhFMThUMHlydG1DZ0E2X0ZpZjVfMzhwbTlqNGRmQlFjN1VjakVJVC1UemNGcUUyUHZiMHdNSElmOVB6azBxRlVKamJXWk1kUm5GUnNCSVY1MDVub3NSQmlzd1BPRTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump in Iowa tries to shift the conversation back to the economy - Politico",
    "description": "Trump in Iowa tries to shift the conversation back to the economy  PoliticoTrump Visits Iowa to Speak About the Economy: Administration Live News and Updates  The New York TimesTrump pitches economic record in Iowa amid fallout from ICE shootings  kcci.comFull coverage of President Donald Trump's speech in Iowa on economy  desmoinesregister.comUpdates: Trump touts economy in Iowa amid outrage over Minnesota killings  Al Jazeera",
    "published date": "Wed, 28 Jan 2026 01:10:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPQzBwQXVFVDBkSVBqcDBMU2YyUWdXZjZDdUdvMkhEM2ozemhrZHlHY0lwQmlyUzk4OUhZOXFRZ0NVMmlsQU9OZjZ3aE83OGFzTmN6SERrdGNIYUI5aUtWLVVmY01GOFZfTUZJdGRYeVJkOWxVZ2JJWXEzOHpIT1RCRXQwQ0RoLWs1UzhObzZUMUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Judge finds Virginia Democrats' redistricting resolution illegal; Gov. Moore backs map in Maryland - AP News",
    "description": "Judge finds Virginia Democrats' redistricting resolution illegal; Gov. Moore backs map in Maryland  AP NewsVirginia Democrats’ redistricting push is dealt a setback by state court  CNNJudge strikes down Virginia Democrats’ plan to redraw congressional districts  The GuardianJudge rules Virginia Democrats violated law with redistricting amendment  The Washington PostVirginia judge blocks Democratic-favored map from going into effect ahead of midterms  The Hill",
    "published date": "Tue, 27 Jan 2026 23:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQNUZiT1BuQmZodkxqMFB3YnJ6U3UwQTJ4S0VrejJEWDhGSEVzdTN6eVoybnJhS1RaUXZ6R2xWZGQyVFRHSVFqODVWR1U3bVdpVWhfWkxiTTFFMWI4SWxFWlk1WUppdG8tZ0FUc0IzRHRpWk44UkNDV2Z5TGwtT3dYeWxuRXNUejRJMFFlX1lVVjhOdzY4d0NlTXRscU1EOVhfNnV0UHF2MFdvTVlj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump Suggests He Will ‘De-Escalate’ in Minneapolis, Without Offering Details - The New York Times",
    "description": "Trump Suggests He Will ‘De-Escalate’ in Minneapolis, Without Offering Details  The New York TimesWhy Did the Trump Administration Silence Bovino on Social Media?  The New York TimesICE in Minnesota: Gov. Walz met with Border Czar Tom Homan, Trump comments  fox9.comCBP commander Bovino, who led immigration crackdown in Minneapolis, is set to leave city. Who is he, and what led to his departure?  YahooHoman met with Walz and agreed to 'ongoing dialogue' as Trump reshuffles immigration operation  NBC News",
    "published date": "Wed, 28 Jan 2026 01:53:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQcXFDMjE2RXpYbUpUY2RQZ2NBVF9PamtfOEpUT0JWMlRCN3c4aVRPZk8zQnI5SUNyRXJSQmVNbHlLcG9RTm9uRzl1SmpwTlpoVDZDWmNuWDcyeXFnRy1oYVhmWEhkXzgwclI3eVhGd0FPdU9JX2VtbUQ0TU9SdEVDN1NsZVpKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "See how much snow fell — and where it broke records - The Washington Post",
    "description": "See how much snow fell — and where it broke records  The Washington PostView Full Coverage on Google News",
    "published date": "Tue, 27 Jan 2026 21:48:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNdG5iaHh0b2RITkV2SGluMzRXY0tKbTVaTHlRdFdpUHZnQk1MbDFXdllwSjdDQjl1eFh6R2ZTM09sRXVTdTUyUzJtcnRHd0xFVE5MY1E3YUlkdGwwTGVvczZ5UkxoaG5reW9OS2dPTi1JZ0Q4dl8wMi1RamRJY0hza3NNWVBNZV83?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Suspect in alleged human trafficking incident shot during exchange of gunfire with Border Patrol: Sheriff - ABC News",
    "description": "Suspect in alleged human trafficking incident shot during exchange of gunfire with Border Patrol: Sheriff  ABC NewsOne Person Is Wounded in Shooting Involving U.S. Border Patrol in Arizona  The New York TimesMan shot in incident involving Border Patrol in Arizona  NBC NewsSuspect hospitalized after shootout with Border Patrol agent in southern Arizona  azfamily.comBorder Patrol agents involved in southern Arizona shooting: PCSD  fox10phoenix.com",
    "published date": "Tue, 27 Jan 2026 23:04:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZzhvajJRdDE4QWUwOGxackhCUklOdTZpVDV4ZmVXSGZ0OVpDdGtJYTRGc3ByWkQ4dzg2VEdiWFVPaUZTNzMyQUIwOWttdXg0TlJIbmRLZEVnckVrQ3MtZ0h3bG9rbDhWMmtQTnU0dGtFX2dkbFJhdldQWEtpaHFSVE1zUmNyc3J0U29MNFRPTVh4eFJEWmFRczJ3UDBvbGt0ZTFlbkNsV3HSAa4BQVVfeXFMUG5UemdpS0pkdWkxNmpRQjRsUFFzZllKNFhfOTlsUWJxUHJtbDhtOFdxeG5VdmxBOVlPbkg2S0pYWEtyVFNMdWlBclNSTS16cnZFNUxmZVNQVzJjZUJHLUs4X194NG5HRDVjMnNrS25GQmp2LU1ibXF1Yzdva2dZOExXLXdCbm9Zb0oydkY3eVRhc1JtdnNpRkdjSlJ3V25vdHFvLXU3SUhKaWY1WkFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Forecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios - CNN",
    "description": "Forecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios  CNNStrong coastal storm likely to develop this weekend...but track still uncertain  wfmz.comAnother Weekend Winter Storm? Forecast Details and Updates.  The New York TimesEverything to know about the possibility of a massive nor'easter this weekend  nbcboston.comLive updates: Millions digging out, thousands without power as next winter storm threat looms  FOX Weather",
    "published date": "Tue, 27 Jan 2026 17:19:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5pOGNlWDhiVjJjSVJSSjUwLXRJVWJoNzdSeFVwdklsV1NWc3owS0ZvQzJVZGY3RmRHbUVOWENwLXduYjZNcVJ1WS0yeGstVGtzZTdqTVpmZmx4VU1qemVnVEVHbEliQkhIaTRQUkhpRzVGeFJPbU5CQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Henry Cuellar warns against shutdown , handing DHS ‘blank check’ - Politico",
    "description": "Henry Cuellar warns against shutdown , handing DHS ‘blank check’  PoliticoRep. Ilhan Omar Holds Town Hall Meeting in Minneapolis  C-SPANThe government is barreling toward a partial shutdown over DHS funding. Here's what to expect  CNBCRepublicans scramble to avoid shutdown amid public ICE backlash  The HillDemocrats Vow Not to Fund ICE After Shooting, Imperiling Spending Deal  The New York Times",
    "published date": "Tue, 27 Jan 2026 20:30:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPNXJUSFpoVkxfMElSUy05UnFhMFFqVDZ1c0dTSW9adDI4ZVNoZS0ySGpHdXFvUjhpNVFadGVwVHZpRHozTU5vWWxpM2ZBNVJ0clBNWVBaQzg5dUVmcHJpc1ZJcF9LV2FDNmIxVFRNVi01cHZlczZNWTNPaTVpVXFlSEFOakYtQXV3WFdrQzBtRTd1ZjA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "CBS News chief Bari Weiss tells staff ‘we’re toast’ if they continue on current path - AP News",
    "description": "CBS News chief Bari Weiss tells staff ‘we’re toast’ if they continue on current path  AP NewsBari Weiss Urges CBS News to Think Like a ‘Start-Up’  The New York TimesCBS News names 19 new contributors  CBS NewsBari Weiss to CBS News staff: Without a shift in strategy, “we are toast.”  The Washington PostAfter rocky start, Bari Weiss plans cuts, adds commentators at CBS News  NPR",
    "published date": "Tue, 27 Jan 2026 22:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOVUlNWUVkVDBZOG1ZbW4xRkM1bUVFaV9fN1FnMzZ0VVpiRGdiMjRFMVdCcGJFeWNpZGRsT1dKMkY1Vl9qY0tjUF9oa0owajBxNnkwbWttTE1HbjFvY0c0MXllMWhDTHV4VEpSajRfS19tLVpTSDU3S3RMYnI2SjdPdlI2XzA4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Donald Trump announces second US military armada aimed for Iran - jpost.com",
    "description": "Donald Trump announces second US military armada aimed for Iran  jpost.comUS to conduct military exercises in Middle East as tension with Iran builds  CNNTrump Briefed on Intelligence Saying Iran’s Government Is Weaker  The New York TimesUpdates: US, Iran ramp up rhetoric as carrier Lincoln forms in Middle East  Al JazeeraAFCENT to conduct readiness exercise, generate combat airpower  centcom.mil",
    "published date": "Tue, 27 Jan 2026 23:54:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1TeGt6MXlZUWtTMXlOMG1uRWMzTFV1X0JGNXVKM3A0MzRXNTFNMG1HM1hfaHZJYW1wM1NwZU13bEdMcUhVemQ2R19xNjJkeFZTVVNVdm5FTmltRXFObkVV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "jpost.com"
    }
  },
  {
    "title": "Italian officials voice outrage at the presence of U.S. ICE agents at the 2026 Olympics - NPR",
    "description": "Italian officials voice outrage at the presence of U.S. ICE agents at the 2026 Olympics  NPRICE Agents Will Join Olympics Delegation in Italy. Many Italians are Angry.  The New York TimesItalians furious over deployment of ICE agents to bolster US security at Winter Olympics  CNNUS to send ICE agents to Winter Olympics, prompting Italian anger  BBCICE role at the Winter Olympics prompts fury in Italy  NBC News",
    "published date": "Tue, 27 Jan 2026 22:09:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZ09zejNWN0hBR3JjNDYtU1dLREN5ME50QXBXb2Q5RUtRX1ByTm5QT2k5eGIxSUViaS10LXljSjd2UGwxZXpUNUFmVzZLaXVXd2tocXBrQmNFNUF0Tmxoc3dBMkY2bGlVVERIcmlpZVBxT0cyNFUzc3g2NkxoX011MjQyTzRmV1lwVkRv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Weekend Preview: Rachel McAdams to be First Lady of the Box Office Despite Melania Trump’s Lavishly Backed Doc - hollywoodreporter.com",
    "description": "Weekend Preview: Rachel McAdams to be First Lady of the Box Office Despite Melania Trump’s Lavishly Backed Doc  hollywoodreporter.com‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling StoneCEOs attended a private screening of ‘Melania’ on the day ICE killed Alex Pretti  CNNMaking the Melania Movie Sounds Like a Nightmare  New York MagazineMelania documentary struggles in UK cinemas as Vue admits sales are ‘soft’  The Guardian",
    "published date": "Tue, 27 Jan 2026 22:32:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPUXdnYk5JYndwNGFPeVVnQzF2TmdVdU9hQk5DYXlZMnEySGFWYXRiY1N4ZzRVdS1LcnY1R2ZZU1VpOTJXbW5ybVc3RURtWExxUVZEMC1tQU9CX2l6TlVRRTdPa2ZVelpHbTg3OU1vYjNaSEZNaDdvbmp6Q3BmSTNuUEV3b0dmdFo2MktsbFNjRGJOZmVIYnd5dDdZMjRBdUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "hollywoodreporter.com"
    }
  },
  {
    "title": "Nashville Electric Service accused of rejecting help amid massive power outages - fox17.com",
    "description": "Nashville Electric Service accused of rejecting help amid massive power outages  fox17.comWeather-related fatality confirmed in Knox County, bringing statewide total to 8  wate.com‘This isn’t sustainable’: Middle Tennessee residents speak out after enduring days without electricity  wkrn.comNashville Electric Service customers receive incorrect power restoration texts  wsmv.com'They said they had all the resources they needed.' Union says NES refused linemen help  fox17.com",
    "published date": "Wed, 28 Jan 2026 02:57:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxQczZWSWtZRnlGTXhhRk5yRUdrOTJ2TTdXV2hiN2VKYkpTc3JBNnlCYk5jaWdsandXMG9LUzFXRTI0TXpuaE42ME1nMzF4blEzWkFySGF1b0lJU2pGWTBWY2cyVWdQdGJRaXhrQUZncUJmSlRyUU9acU92ZWRtTmszSGFTcl94Yk5waUx5dDZIanZaMmNsaVNJc1RVS3ZIdDQ2c3N0aFFqOWJzMkxyZUxtbzEtZldzSE1remJnZF82eHRaX2NvamhVTkJoQkRWdzFXZmMtWV8tMm1PaDlNdkZmS1dmTjVlc3IzamhfYllR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fox17.com",
      "title": "fox17.com"
    }
  },
  {
    "title": "Zohran Mamdani Wore Custom Carhartt to Tackle His First Snowstorm as Mayor - GQ",
    "description": "Zohran Mamdani Wore Custom Carhartt to Tackle His First Snowstorm as Mayor  GQStorm Tests Mamdani as Dangerous Cold Grips New York  The New York TimesWinter storm update: 10 deaths in NYC linked to weather, Mayor Mamdani says city increasing homeless outreach  abc7ny.comWinter storm kills dozens as cold lingers in central and eastern U.S.  ReutersAt least 10 found dead as frigid cold grips New York City, mayor says  ny1.com",
    "published date": "Tue, 27 Jan 2026 22:27:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBNeF9tb1E1eE1jblNxdF94MDFzc1dCNnN3Yk5ZMFB1SEFEU0cyTTgzSTlHSTJtV0N6SHNEcXZZc1J0d2xTVnRTb05xbXUtcDFZYVhmVTJxVDBzbUJmeDNrMnA2VGo5VFFqZ1FPUDZ3TGdIMTl6Wm9BRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gq.com",
      "title": "GQ"
    }
  },
  {
    "title": "Even Stephen Miller is jumping on CBP for the killing of Alex Pretti - Politico",
    "description": "Even Stephen Miller is jumping on CBP for the killing of Alex Pretti  PoliticoScoop: Stephen Miller behind misleading claim that Alex Pretti wanted to \"massacre\" agents  AxiosTop White House aide Stephen Miller acknowledges possible breach of protocol before Alex Pretti’s shooting  CNNMiller Shifts Blame as Pretti’s Death Splinters Trump Team Unity  Bloomberg.comNoem Says ‘Everything I’ve Done’ Has Been Directed by Trump and Stephen Miller: Report  Yahoo",
    "published date": "Wed, 28 Jan 2026 03:24:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQNGQ3dHVjT01DWTZRSE5RazljbFBkdFc4MXcyOWczZTUyU1VRamZ6eTdnTmxwU3VnS0dUdXZEbmxvdzcyWm5nbU5sUFJmakc2NjdLVDhkTXNFYnpnaXIxRHV2blFjMVFKcHRyb1lUMU1TU0k0REhWWldaLTh2c0FyZnl1SUZnVTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "FBI to investigate Minneapolis activists after far-right claim about Signal chats - The Guardian",
    "description": "FBI to investigate Minneapolis activists after far-right claim about Signal chats  The GuardianThe New “Signalgate”: Kash Patel’s First Amendment Fail  Cato InstituteKash Patel says the FBI is investigating Signal chats of Minnesotans tracking ICE  MS NOWFBI is investigating Minnesota Signal groups tracking ICE, Patel says  NBC NewsHow Minnesota's rapid responders track ICE agents in real time  Axios",
    "published date": "Tue, 27 Jan 2026 16:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQaTRUSkM3VEt2M1hIUHNlNGVxT2Y3QTRyanBfR1pUTmU3eC1LV1Z6OGJwRWVkRkx1WlJtTVo0X282QzBaRzlMOFh4cXJza0RnV2d3Sm1pZ0pGQjBweTBqMF9YYXh1dk40cjV0NVNsWUVDejA3eDlKbWFuYm1nWWN2bi10QldsTW9GOUppRTktUm0xTzRlUFAwUldlbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump signs executive order to ‘preempt’ permitting process for fire-destroyed homes in L.A. - latimes.com",
    "description": "Trump signs executive order to ‘preempt’ permitting process for fire-destroyed homes in L.A.  latimes.comTrump signs executive order aimed at taking over LA wildfire rebuilding; Newsom says money is 'main obstacle'  abc7.comTrump orders Federal takeover of LA wildfire rebuild permitting  smdp.comTrump signs executive order to fast-track rebuilding of homes destroyed by LA wildfires  foxla.comTrump moves to take over Los Angeles wildfire recovery from local and state authorities  Politico",
    "published date": "Tue, 27 Jan 2026 22:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxObmRvV0JmZnNDVy1jaDNuUGxfV0R5a3FHRXVxZ2hQdFRpUDJWY1dVc3FsXzRjd25Qd0NzSll0TnJrdWtNc0g3Nl9OM2ZsdlI5d3F4THBFNlFfWm9CUTl3Nm9fYTVpeUtfNEQ5di1aM2ZxZVNheVVwMXZ2eVNWV3lsMURsZUs3NFE3QmpKZ0Z4OGJ5eWZINjBwVGpzRFMyNkxDdktHbHFuS2J6ZHViaHJZYnlBb09hWmFFTllMZk0tOEtvR0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "latimes.com"
    }
  },
  {
    "title": "Judge Temporarily Blocks Deportation of 5-Year-Old Detained by ICE in Minnesota - The New York Times",
    "description": "Judge Temporarily Blocks Deportation of 5-Year-Old Detained by ICE in Minnesota  The New York TimesJudge blocks ICE from deporting or transferring 5-year-old Liam Conejo Ramos and his father  CBS News5-year-old who was detained in Minnesota can't be moved, judge rules  NBC NewsInside the Dilley detention facility where 5-year-old Liam Conejo-Ramos is being held  mprnews.orgJudge blocks removal of 5-year-old detained by ICE in Minnesota  ABC News",
    "published date": "Tue, 27 Jan 2026 23:40:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOUmZUTnVaQUY5b200TFNxZU1rdjlnaXUwVjlFdU9yTkRocV9HVGlqTjVqcjJIR0dLMi1Pb093MmdVa0dOUVZwaXctSndzMGVUcUJlYV81cXFJTkpXZjB3WUdOSnBmMUdkWDd5QVVxY2MwWU43b1lNZVRyeHY2S2dNZ2x5YXEwQXlL?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "City Prosecutors Join Forces to Bring Charges Against Federal Agents - The New York Times",
    "description": "City Prosecutors Join Forces to Bring Charges Against Federal Agents  The New York TimesFirst Comes ICE, Then Come Lawsuits  The AtlanticExplainer: Can ICE agents be prosecuted for Minneapolis shootings?  ReutersCan Minnesota prosecute federal agents for using excessive force?  The EconomistIf ICE Can Kill With Impunity, the Rule of Law Is Already Gone  Bloomberg.com",
    "published date": "Tue, 27 Jan 2026 23:50:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOMUU0WVRtUGkxZmU4eFh2d0h5RkkzblZUWGxVck5GcFRyT0ljYUc4SlBJVmM1WUR6X1pMOG1kaUJKdGlqczZMdXY5TnZrb2lTNW92MXFFcHVoSUZRaGFKX3VsVUlTRElvVUJtSXY3U3J0cHE5am1IbFZ4YXczUHVGWDBmVUE5NW1TTkpJMFlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Yale to offer free tuition to families with incomes below $200,000 - YaleNews",
    "description": "Yale to offer free tuition to families with incomes below $200,000  YaleNewsYale Offers Free Tuition to Families With Incomes Under $200,000  The New York TimesYale to waive all costs for new undergraduates from families earning less than $100,000  ABC NewsYale University to offer free tuition to families who earn less than $200,000 a year  CBS NewsExclusive | Yale Will Go Tuition-Free for Families Making Up to $200,000 - WSJ  The Wall Street Journal",
    "published date": "Tue, 27 Jan 2026 13:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQZ3RrSVVWZDV1cmFfWVpkWHhqSjVpUy1WM3VPMHdWbzEyUzNFQ05YT2U2MEE4TFlkZFkySjZjVlVnc09GT1ZwX2ZTdVE2UFZXckp1NGl2SWtFUHpVamtfTHpGVk1jZVdFX3NoZFJvMmlmSEh3Z2oyYnV4YWlBamdKU2VnLWRYSnB0UGt4anZadw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.yale.edu",
      "title": "YaleNews"
    }
  },
  {
    "title": "I grew up with Alex Pretti - The Verge",
    "description": "I grew up with Alex Pretti  The VergeAnn Arbor community honors Alex Pretti as Washtenaw County restricts ICE activity  clickondetroit.comHealth care workers pay tribute to Alex Pretti at vigil outside Seattle VA  The Seattle TimesOrganized Labor Escalates Against ICE Summary Executions  The American ProspectRead the full statement from Micayla Pretti on her brother Alex Pretti  Star Tribune",
    "published date": "Tue, 27 Jan 2026 16:39:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPbEhwTXJYNGQ1SmdlU0UteVYydXpGcFlZai1JeVlLY19YOXBOQjZCcTYwSk5Lcm5ZSFMzUHJyTl9NQm16M0M5ZE11Nmp0ZGt1anFoWWZBYXVtdUZvZVhuYWlHZXJHVUI4SnBqbklQeGl5MUhuSXROT2gtRUdVUEJGeGJKcmg5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Carney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos - AP News",
    "description": "Carney rolls his eyes at US Treasury secretary, says he told Trump he meant what he said at Davos  AP NewsMark Carney Rejects Suggestions That He Walked Back His Davos Speech to Trump  The New York TimesCanada’s Carney Tells Trump ‘I Meant What I Said’ in Davos  The Wall Street JournalMaybe the United States Can Be One of Mark Carney’s “Middle Powers”  The New YorkerThe 'middle powers' are having a moment, but can they stand up to Trump?  CNBC",
    "published date": "Tue, 27 Jan 2026 21:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNd1dEN1N2SFJ2d0NUbUhnYng1VHpFQVlMY0JydV9DRy02MXZPRGtONnBVNHJ5ZzNYUTcxb2RCMUdXN29hb2Q2TzE0Z0JTYnpuam40dElocTdpMlZlcHJsM1pIVFNUUWNxTkVqMTVVbFpqX3dPOGh0c2RBSkZiOV9qZDZELXFoaXBueTl3MVpxWHU2QnQ3M0xiY2gxWEhjYndMdWRUM3lnM2ZoaFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "How much snow did Mass. get from Sunday-Monday storm? Updated list reveals highest totals - boston25news.com",
    "description": "How much snow did Mass. get from Sunday-Monday storm? Updated list reveals highest totals  boston25news.comFIRST ALERT: Greater Boston could see 20+ inches of snow  nbcboston.comSpringfield snow removal faces challenges on side streets  wwlp.comRegion digs out from biggest snowstorm in years; some communities slammed with nearly two feet of snow  The Boston GlobeSnow Emergency and Parking Ban to End, January 26, at 8 p.m.; Schools Closed Tomorrow, January 27  boston.gov",
    "published date": "Tue, 27 Jan 2026 18:25:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOcF9aLTJucUdzbkJINXA1dFZKdld0QjNyd0FFNmNza1ptV3hMcHBKejFqVThOd1NpVVlqMDd3b0Nmd3VERGFodVZzZ1RfYm9MWE9qVklWYXRoMTYxOVl1RHgxQ2RYbURPeWUwQngtNFM3aVdRdlNSUlluOWp3SW5TUjdBOEVRcmduU18yM0VtREhXMWhwOHJuM2FUYUtNRkZDY0tTTGxyUkF0dy1uSFh5ZDhXUlNuUl9HbXNrN2VKRTBqczNwN1NmZnhnZTNPUDlOZ3NiQ19LaFBrMXY3SVBHcjZvdVbSAfgBQVVfeXFMTVByZnBWX1FnM29ZcTVSZ1ozWk15UWlCcTUxdnQzeEpUb1MwalhFV0R4aUdwTW90NEpUNWZxN2o5SndodlJhZGJVb2tIUHJ3TV9yQ0xDTGQ5RDU0RHk2S0lTUnQ2WXRNMjJXMmFPMmVnV08wSzRwcUFXME9hVnJaYXFMSnM5OGZwXzl4eGhNbVJTRTlFY0tqa3IyalgwTEpkUFllSmFRbjRJRFpZV2NqN0l5eHVKQmJpemNncGdZZlRBdkNrRUlxaGxWeEU3Y244aVViNTNDR0Zrbnp4d0JNaDZXQ2dHN3hRZDJXMDU4ek9LczI4RDFIYko?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boston25news.com",
      "title": "boston25news.com"
    }
  },
  {
    "title": "Families of two Caribbean men killed in boat strikes sue Trump administration - Politico",
    "description": "Families of two Caribbean men killed in boat strikes sue Trump administration  PoliticoFamilies sue US over deadly boat strike off Venezuela coast  BBCFirst wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of two men killed in Trump’s military boat strikes sue US government  The GuardianBurnley v. U.S.: Demanding Accountability on Caribbean Boat Strikes  American Civil Liberties Union",
    "published date": "Tue, 27 Jan 2026 18:25:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOeVFxNFZYY1hGQUZEd2hQMTVwUkdRa1ktVm1GTU5qR240NlVONXFkNTlBSlVqVmUyR2Zxa003YXdweHJFY0FrM1ZfRlVYSVN4b3pWYURvMVU2em45ZUZEQ09nc2Z1cmJrZVNCOVV4UlIwdG1RbXdUM3Nub25IMkJuTDV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "U.S. Population Growth Slows Sharply as Immigration Numbers Plunge - The New York Times",
    "description": "U.S. Population Growth Slows Sharply as Immigration Numbers Plunge  The New York TimesForeign-born population falls by 1.5 million due to Trump policies. California economy under threat  latimes.comThe states growing – and shrinking – the fastest, according to Census estimates  The HillNew Population Estimates Show Historic Decline in Net International Migration  Census.govA crackdown on immigration is leading to a sharp drop in U.S. population growth  NPR",
    "published date": "Tue, 27 Jan 2026 23:38:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdHJlNWpqa3VET0gzV2VNSy1aZ3lTRUxPVk9uaXY4ZWRQd3UxTmF6ajBpcDVUZWk1M29RS2YteXVsdjJyQTFWNkJwVVJqdTRTU05sNU5vNGt5M0xzUV9hZUltR3Z6OUFnTEIzYnBYWENlYmRCdlQ4UDFfU3lUUVFHaUZYZklhN003UHM2N254bXFicWM1aEFQWlM2VEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]