[
  {
    "title": "After the Supreme Court's ruling on tariffs, companies line up for refunds - NPR",
    "description": "After the Supreme Court's ruling on tariffs, companies line up for refunds  NPRA defiant Trump vows new tariffs while fuming at Supreme Court  CNNCan I get my tariff money back now? : The Indicator from Planet Money  NPRThe Supreme Court’s Declaration of Independence  The New York TimesTrump’s New Trade Agenda Is on a Collision Course With Midterms  The Wall Street Journal",
    "published date": "Sat, 21 Feb 2026 06:18:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBoM3JFU3VJWWhPRnVCVGRXeWpiYkJYUmJEc25qX2xqQWxveTUzdGJnVlVvT1lWUDJUX0NLSm5TUGxJSTExQklKMnRNa1BlTUQ3V0lPUlM5a1l2LUxacnBULXc4MGNjcGZKSmJRVFl1TzZ3VW1WSnNlUTZRMEI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Speaker Johnson denies request for Jesse Jackson to lie in honor at the Capitol - The Washington Post",
    "description": "Speaker Johnson denies request for Jesse Jackson to lie in honor at the Capitol  The Washington PostHouse Speaker Johnson rejects request for Jesse Jackson to lie in honor at Capitol  CNNMemorial services for Rev. Jesse Jackson expanded to include South Carolina and Washington, DC  Associated Press NewsJesse Jackson, Charismatic Champion of Civil Rights, Dies at 84  The New York TimesThe Day Jesse Jackson Made Me Cry  The Atlantic",
    "published date": "Sat, 21 Feb 2026 04:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNdVFxT0lWekNHNmtwNUdsQnVJLUFSeU5RR2xNTG9ZZ0pfdG9uU2QwYkdKY1J2REpFQXpEelpSTHdySS1lVzJYX1ZsQkhfXzBVRmc1MWxsdHZBUzlUbHdjQzNkbnVsUTJzelpEQlNFWE1CVTVhU1d3ZGN4Z2NIUVBuNmdKM3BTMVV2ZFIxTE45bmFISUloSnBuZV8xQjk1Qkl6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect - Associated Press News",
    "description": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect  Associated Press NewsView Full Coverage on Google News",
    "published date": "Sat, 21 Feb 2026 04:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOUHNPTFpLUTc1eFlWWUh0NUl1aGtiMGVWLWlzbGcyU19mMUR1UGZlQ3NoMVh4VDlsV1RRY2V3R08ydGp1RXdNWHREMTMtVDIydEgzRlhURDFNYXJvM3c1NWwzMExYajBWVkZwRXJ6ZTQ1X3BJOWJjQ1A2bGR4QzhFM3F0ZWU2WWNvalh2eFdtaTl1bDFkTUJQQ3hWY0hoWmVGdFFSS1dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "New York Man Tried to Ram a Nevada Power Station in Act of Terrorism, Police Say - The New York Times",
    "description": "New York Man Tried to Ram a Nevada Power Station in Act of Terrorism, Police Say  The New York TimesMan crashed into power substation fence outside Boulder City in suspected terror attack  FOX5 VegasFBI and Las Vegas police investigate suspected case of terrorism  The GuardianMan found dead after crash outside power facility in southern Nevada  NBC NewsAlbany Law School student dies in Hoover Dam ‘terrorism’ incident  Times Union",
    "published date": "Fri, 20 Feb 2026 23:49:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1HRzlDUjc4Mk9ORFVRTC1ReTJtU0NpZlBIVzZlUTFwcVh5a2dCWXhCckc4RThQSG5LYnBQMGNtQ1BvSlg1eUdBTEJCU0hpM3c2RE1wX0hfZm5SMWsxWUlmbVctRzBodzBwMEtEYUUxWU1pMHJ0SjZNTjFuNkxRVGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump says he is considering limited military strike on Iran - BBC",
    "description": "Trump says he is considering limited military strike on Iran  BBCU.S. Planes Land at Jordan Base, a Key Hub for Planning Possible Iran Strikes  The New York TimesA US War With Iran Is Close. But What's the Goal?  Bloomberg.comA look at the military hardware the US has positioned for potential war with Iran  CNNCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI News",
    "published date": "Fri, 20 Feb 2026 22:38:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1PeXhTN2xIRjlVbDd1WHFjNWJSU0hncjNmYzJJdFViTmlLSW13MTJfR1dMdS1KV3pXUmtRdTNOa3ZBb2RyTEVwWVVRWWhaNktaN1VuVUVXTVNDUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]