[
  {
    "title": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case - Austin American-Statesman",
    "description": "Famed Texas forensic artist releases sketch of masked suspect in Nancy Guthrie case  Austin American-StatesmanFBI releases description of suspect in Nancy Guthrie kidnapping  BBCFBI Takes Key Piece of Evidence from Nancy Guthrie's House—as Search for Missing 84-Year-Old Enters 13th Day  Realtor.comRecovered gloves, wanted Ring doorbell footage highlight Guthrie case latest  KVOALive updates: Police testing gloves in Savannah Guthrie mom case  USA Today",
    "published date": "Fri, 13 Feb 2026 11:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPcDNzRkR2NElGNjlyNVdNNTV1MFZhZk5mN0g5Q0x1SF93OUtVT2JvUjVOcUdobnF6X3Z3NUMxM0VnRE9kbHQ1Si1EZVZYaWJySTFWa3hvMmYwWlpJcG1zUFI0bGNKSlpvOU1RTVVUWFNCUy1WRWNiWkZfOVdXbE5VY0VDUmNQcm1fc2oydWEyZEFyRm9fczBuM1ZjSnVibjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statesman.com",
      "title": "Austin American-Statesman"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateList of ICE raids, major updates in Minnesota on Friday, Feb. 13  Bring Me The NewsICE increasingly targeting Minnesota immigrants with active work permits  Sahan JournalICE crackdown in Minnesota widely unpopular  MinnPost",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump sidelines climate contrarians in science rollback - Politico",
    "description": "Trump sidelines climate contrarians in science rollback  PoliticoTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York Times5 early conclusions from Trump's \"endangerment\" climate move  AxiosTrump revokes landmark ruling that greenhouse gases endanger public health  BBCTrump delivers a deadly blow to EPA’s ability to regulate climate pollution  CNN",
    "published date": "Fri, 13 Feb 2026 12:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOVlpmOTFQa1V4VUpvWEt5ZjZTMXBVaW5TSkgtc1lBazBoWFJlVU9OU1pMN2tHc0FreDVxaFlnQTlFdGkyQ2VnUS1kY0tZLUtEbkR6N2l5cjJtSmZwM2NrNHBQbU0yOGVmZW5xTmRlYnNnYkpiVU1nVWQxY3J3RUpmNzVqSTg3QWVwOVVKcXZUc1NZb1ZaVnM5Q0s5eWFwX3lBdkVldQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump nominates hospitality executive to lead National Park Service - The Guardian",
    "description": "Trump nominates hospitality executive to lead National Park Service  The GuardianView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 02:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOV240VGhiN2tFU0NrN0JtTXFZVFItMTRXYWRJMFM5VHpQeGcyWlUxSnZqU1JHREd3dTQtQm93NGZwaVp1bFVlOTVsdVM4T1dqMUxXMWE5TGNyWkRxLUF2T2tSV3VBRWdZcU85MUhkMEhIeGNkT0RlVFJ5Nl84dHdYNWc1aFpiQUhyUDNHcjBxZlJFTFlmWG5PdGM3Mng0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check - CBS News",
    "description": "Tom Homan says federal agents found thousands of missing children in Minnesota. Here's a fact check  CBS News5 Takeaways From Trump’s Immigration Crackdown in Minnesota  The New York TimesThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticEnd to ICE surge: Gov. Walz says feds need to 'pay for what they broke here'  FOX 9 Minneapolis-St. PaulBorder czar credits ‘significant cooperation’ for end of ICE surge, but sheriffs say policies haven’t changed  Star Tribune",
    "published date": "Fri, 13 Feb 2026 04:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcGt6cWQxTzJ4c1lFcHNiZTl0WXd5eEFJdlNpYlFqb21aNmZZNGxBZGZQckJ4cTBHeEZTbGJRV3h0YlVNUE1fRnB6MzN3UzJ0NFNCRjYxY1JEMlYxSXkxRkV3cGNJOXozWU8yZkY5V2loUHM4WEZVUmtyYXRPaEdXaHpwazZwNUxPVi1qZXBMckw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress - Axios",
    "description": "Democrats eye legal action, GOP seeks answers on Trump admin \"spying\" on Congress  AxiosLetters to the Editor: A series of simple, yes-or-no questions for Atty. Gen. Pam Bondi  Los Angeles TimesHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoEveryone Is Saying The Same Thing About This Incredibly Viral Photo Of Pam Bondi With Her Back To Epstein Survivors At Yesterday's Hearing  YahooPam Bondi vs the courts  Financial Times",
    "published date": "Fri, 13 Feb 2026 09:33:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNdG5Bbnhmb0VxdEpLU0FVcFQ3WUZTbmJ1WU5WeTBJblZyVnpfZFdtZkhXMEdsei1WZk4yQ2QtNEZGcGwtRGxfandyMUJfN0drUVRtbEhyZWMwMkk0WEtpX1p1ZEZYNzdGQVNjdDFOaUFKOWNfQlYwNGFwNXdjaDd5czZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Ocasio-Cortez, Rubio to offer dueling visions of world order in Munich - The Washington Post",
    "description": "Ocasio-Cortez, Rubio to offer dueling visions of world order in Munich  The Washington PostDemocrats at Munich security summit to urge Europe to stand up to Trump  The GuardianNewsom’s mission in Munich  PoliticoAOC to offer a 'working class' perspective on U.S. foreign policy at Munich summit  NBC NewsGavin Newsom, the Traveling Trump Troll, Heads to Germany  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 07:04:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPRUJhZWFXQVpfSmZuRWtKekdMQ0VkYW5jdEQxNUN6a3FrTWprOURISzh2TktMV1hBWXJXREFWX1hqV0ljM01DVl9lWXBLNEtGaVJma2d2ZjBvYjBINlBRM3c2YWJqNk5mTEF4d0V1TUtmU1lXcl9lYThfcXFyS2JlNjJybw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says, as Iran tensions high - AP News",
    "description": "Second US aircraft carrier is being sent to the Middle East, AP source says, as Iran tensions high  AP NewsUS sending second aircraft carrier group to Middle East, sources say  CNNPentagon to move carrier to Middle East from Caribbean, officials say  USA TodayTrump sends second aircraft carrier to Gulf amid Iran threats  AxiosU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 13:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNVWpDTl82THV5ZTVTMTNhbXpxc0RZSkE1dV9FM3hmV3lyUHhDeTQwS19EREljVEd1OGdhZlhnQjRITmlDS3lwbVFnbG1qQWFYeHZZdk9mdmpUWkVzclJIZTdLM3BlaGFNWFJ6Q005OUpCMTByTFZ1OEI2Nk9IcURadzlEa25ZbHZQOVZ3a2VVN0UybmthdjRhWlNwODc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states - NPR",
    "description": "Judge blocks Trump admin from rescinding health grants to Democratic-led states  NPRFederal judge stops Trump plans to cut public health funding to Colorado, other Democratic-led states  The Colorado SunMinnesota sues after CDC cuts millions of dollars in public health grants  MPR NewsIllinois sues feds over $600M in cuts to HIV, lead poisoning prevention grants  Chicago Sun-TimesFederal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York Times",
    "published date": "Fri, 13 Feb 2026 07:31:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaFJlYUJ6QmQ2S1FhdDBkTlI0TEp2MlRmTkxmS1pldjBKUGpiNTFzXzFQcGVrVDNNN0tFYzNCNDd4Mm8yYmpEZlgyNkR6b2NLYmdEX1VJZlM1eFRlY3pZZFdBdm11cHhydGVHeUZQZ2d4QzZJRXZFUmZzanMzUm9DOE1KcEhNZ0NGZWdJOGFUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "DHS heads towards shutdown after funding bill fails in Senate - BBC",
    "description": "DHS heads towards shutdown after funding bill fails in Senate  BBCDepartment of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight  CNNA DHS Shutdown Is Looming. Here’s What Could Be Closed.  Barron'sThe DHS Shutdown Could Affect ICE, Travelers, FEMA and More  The New York TimesDHS shutdown imminent as Senate leaves town without deal  Axios",
    "published date": "Fri, 13 Feb 2026 00:10:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE52S3M0emRQNjZMUGNkQmRPa25mRjdUOUd4WWlJbEMxRFZ2REJaTEpSSi1DXzhHNXpkNHhnZmpLNWsyNFBpSXZnajJQNERMRHVfdXVxTjEzYm9KUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration - CNN",
    "description": "Communications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNNLaser weapon that shut down El Paso's skies was LOCUST system  AxiosUS military’s urgent push for laser weapons behind El Paso airport shutdown  CNNClosing of El Paso Airspace Adds to Tension Between F.A.A. and Pentagon  The New York TimesThis time it was a balloon. Could a 'cartel drone' be next?  USA Today",
    "published date": "Fri, 13 Feb 2026 02:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYXRfcUdHTDA2dm1yM3dQaVlWSWdhVFlxOFpjMVdCU3h1VFB1bTNVSjFUVEZpdkF6VGxyWEFKa2p6YU1YbXVMMGJ3X3J5N3VfNWdvLXNPcVRvcG8wcmcxcWppMGhYMG52RzhlWUZNNl82dU1kRlpuTGd5TXlUQ3hSUTd2ZlpBcENKMzRXZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "RFK Jr. made promises to get his job as health secretary. He's broken many of them - NPR",
    "description": "RFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRThe Senator Who Has Made It Her Mission to Stop RFK Jr.  Rolling StoneTrump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK’s idea of making America healthy starts with making it politically sicker  The EconomistWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOR0dUZnUzemNidUpDTl80Uzh6QnlZODJzS2Jrak9nNFU0R09RanFCaWhUVGVLRUJCekhHWTIxV2NyOURnUVUwaGgxQ1VLRDVmcUVGbXNWQUJOalNjdmhaVXBSY0lyR3dxcmg2VEFzRFBuOHRpYXcxZEhzQi1MbFRLMnplcGdzenZnWjNpZXVKT2tVeFJRZWlKZ24ycGtpY0FvdldjTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "DOJ drops charges against men accused of assaulting ICE officers in Minneapolis, citing \"inconsistent\" evidence - CBS News",
    "description": "DOJ drops charges against men accused of assaulting ICE officers in Minneapolis, citing \"inconsistent\" evidence  CBS NewsProsecutor Says Federal Officials Gave Wrong Information About ICE Shooting  The New York TimesGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSCharges dropped against men accused of attacking ICE officer during north Minneapolis shooting  MPR NewsJustice department moves to drop charges against men accused of hitting ICE officer in Minnesota  The Guardian",
    "published date": "Fri, 13 Feb 2026 01:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTk4xZW54bFpVRzRhRFhJVFhNLXQ3UTkyU0xFaUI0d2VJWkpOZXdENW9wWnh6MGlabTlHdHN3c2JFWmZud1liYm1uUFNzaUQxZVpndFlCNlI3R2E2b1J5YkliZE0zOWJBRG13a3Y3NlIzbjQya09tVF81bHdOeG5wZHdrSnhqcUM3MjQ2dkdXSUFTVlJTMTZvTNIBngFBVV95cUxOdVdrRzlxX3o3bVdyNmRQUWVJSF9jdVFLTS1ITXdoQU1WVVdCdTQtV1pYaEdOWVg0aFdwTmpEUmtxUnQ2YTRQUU5PUTVQRFY4OUpfdE4yQXpHdXVscDB1eXE4QzEzNW5GOGJZWmNkam1rUzNLTUpQNTEwSERrVkplaVpFN2FNX3piX2c5Rk10Q2JNckJ6cUFIVnI0ZFQzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "February 12, 2026 - Letters from an American | Heather Cox Richardson | Substack",
    "description": "February 12, 2026  Letters from an American | Heather Cox Richardson | SubstackTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York Times“Champion of Beautiful, Clean Coal”: President Trump Celebrates Industry Revival  The White House (.gov)Trump directs Pentagon to boost coal use as Energy Department announces $175M infusion for plants  The HillAnalysis: Trump has overseen more coal retirements than any other US president  Carbon Brief",
    "published date": "Fri, 13 Feb 2026 07:44:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5CbkZXVWM0ZlBodXJyR2ZVNlJaNlMzdjROYlNaaFBfTFYzVDVDRXpHbDQ3eXdKRkc5S1hTQUVSM3o1ODhkczdsMEZtdGlCbk1zelgySXNpWmYzb2xIX3o1QmtIX2l4bnJKNGhwMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heathercoxrichardson.substack.com",
      "title": "Letters from an American | Heather Cox Richardson | Substack"
    }
  },
  {
    "title": "US judge blocks Trump administration from punishing Senator Mark Kelly - Al Jazeera",
    "description": "US judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge temporarily blocks Pentagon action against Mark Kelly over illegal orders video  NPROpinion | Sen. Mark Kelly's legal win over Pete Hegseth is a First Amendment victory for all military veterans  MS NOWFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:51:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdlR4dWFEM1k1enJ3LVhXcVYwZ0R5aVpCZ280cHV1a2dNZVFQUG9jZThXLXd6Q1ZaSkVuMU1ZSXpKTkRaNlFtVUVYUENZeXZJZDhlNDV3YnNlWWJGYmhIV2l5UnNVaTJSM01sVndTbDZEbXNGankyXzNmRC1IYjlQSk5NbzlaRzdLU0JMWWZnUFFHT2RhX0tEUGNQd1Q2SXk1RkxabDdJRUYwX1A5QlgzdNIBtgFBVV95cUxQNlVieXRXZHhocy1nWFVTZHZiR2l5TFJHd08xS3U3RC1xZkdiY2stX3hPcjUyTmtoLTE5NzdmNGt2TWtwVFpuc2YyVUtjUGZrLVFMUjk0MWZaQ0xiY2NQdkN4M3NUMFlvZmdDdzNZZVFzdVBVNjljMmxWa0pNc1A1Qng5WG9Qd1FVWGRyVFF5ZHJMc3NfQl9yWXFfT05pUGUzSy1mYUZUaV91X3lnSTA5amR5djU1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "What is the SAVE America Act that mandates voter ID? - BBC",
    "description": "What is the SAVE America Act that mandates voter ID?  BBCHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsHouse passes GOP elections overhaul  PoliticoHouse GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections  PBSRep. Crow Holds Press Conf. Following Failed DOJ Indictment  C-SPAN",
    "published date": "Thu, 12 Feb 2026 22:40:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5XalhoSGFGaTJrWU9qRFFBaHRkS1l2eVFlaEFHOVdPcGIwalBtazdOQTBwV3JfMUNyRTFWalFvSXppZ1dtcFB1RWFiZEFVZmg3enhGRWljeW5LZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Pride flag reinstated at Stonewall after it was removed by Trump administration - The Guardian",
    "description": "Pride flag reinstated at Stonewall after it was removed by Trump administration  The GuardianNYC-area officials raise Pride flag at Stonewall after Trump admin takes another down  GothamistPride flag returns to Stonewall National Monument after Trump administration removal  The HillStonewall National Monument pride flag raised again after Trump administration removal  ABC7 New YorkActivists re-install Rainbow flag at Stonewall National Monument, defying Trump admin  amNewYork",
    "published date": "Fri, 13 Feb 2026 02:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWHg1QnRGQ0Q3Zkk1ajBzeWtNZmExYkFzM1FYRjFLS3U3Yzk3Y1VvaTAyd1I5bGlMSmxybWxVMHlGSkhNOVhNZVpuZ1lLNllBc1poRjRpNVdPNEVLLWprUG5Fa1ZKVGt0YTRXcmJGOWJPWVhmblI4UDQxOF9USUtoOFlOQ2MxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Court rebukes Trump administration for denying immigration detainees access to lawyers - Politico",
    "description": "Court rebukes Trump administration for denying immigration detainees access to lawyers  PoliticoTrump judge slams DHS for blocking detainees' access to lawyers  AxiosJudge: Government flouted constitutional rights of Whipple detainees  Star TribuneMinnesota judge blasts ICE for blocking immigrants from seeing attorneys  USA TodayJudge Says Immigrant Detainees Near Minneapolis Must Have Proper Access to Lawyers  The New York Times",
    "published date": "Fri, 13 Feb 2026 03:46:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQY3B2SnBzMFdISV9mLXJGVEJrVTBDeDNuM3d5di1Nd0F0cXhGMEtiX3ZLNVFOR3FLN3JVRnUtcW8zYmVGUmV2OEFRSXE1MnktbjJWVmo4VnFITmgxMVJSemEtOGhlSEJpaV9hRjZhQ1RoQ3JJQTJCb0xQUEh6SWpZZElWLW5Xbjl2aU9PaWJGT1R5eHJQWU1MaFdIVUZYeVh2aVVmeC1PNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani.  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New YorkMamdani Finds Allies, and Skeptics, in Albany as He Asks for Funding  The New York TimesMAMDANI’S FIRST 100 DAYS: Mayor tells Albany budget gap shrunk by $5 billion, pushes wealth tax to further close it  amNewYork",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump Offers Absurd New Excuse for Vile Obamas Video - The Daily Beast",
    "description": "Trump Offers Absurd New Excuse for Vile Obamas Video  The Daily BeastTrump called Sen. Tim Scott after lawmaker condemned image of Obamas  CBS NewsThe lion speaks tonight – and what he says is despicable: Marvin A. McMickle  Cleveland.com‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesImpeach the President: Rep. Al Green Denounces Trump’s Racist Obama Video & Attacks on Black History  Democracy Now!",
    "published date": "Fri, 13 Feb 2026 07:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOQVBfNWNPbndCaWNGc2k1d3ByV2VISnNoRVlEcjRZd0pIUDZ3UWVUZk9OZm5kX2Ftc3hFa0xhTGotVGdiMkZXOHNGMVFybk5sVGZjUF9UQmp5c2Zfck5qN3ZVLUd6YkJPWXZaaXF0bUdWTzduaE5HRG5SdmlZNzg2WHhHZFFGMk9qQ2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\" - CBS News",
    "description": "Gov. Wes Moore dismisses Trump's \"not worthy\" snub and exclusion from White House events: \"I will bow down to no one\"  CBS NewsConfusion reigns over Trump meeting with governors  The HillMaryland's Democratic governor among those excluded from White House event  NPRTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House gathering  NBC NewsTrump continues to lash out at ‘RINO’ GOP Gov. Kevin Stitt  Politico",
    "published date": "Fri, 13 Feb 2026 02:32:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPenM1UG02RFREX0xuRlYwREd1MzctbVlNLWRIN3ZyTzUyZFhYZWhnbklCbXA3R1RRbXROcmpzRUotLU9ZVkVRWkxLZGg2dnQyTnZRcERKQjVSZWx0OFpEbS1PeVFQbTZ1VUtsa3U5dzVCeTNwX1BuR3dHMWNuYkdreTFMTV9FTDVWZE8xNXJ6TEJ0enZLZkhHckVGRzF6UWFnR0Q4ZXp30gGrAUFVX3lxTE1fOUFXSUpjc2NzS1RoLU81Y3F0Zl9XN01FMno0UFdQSHRuaEQ2UmZBejExQk5vUXFicjcxSk9mSDYxN29jNzR4MzFTdEZKNm1CTjJ2SmpSWXV5UVZDQ1ByZmNlS0szQVBJcDRGcG9TZ3hNZjlrdEVQcmV4emMwdUh4bFlZYXlQaFZFcWpwZ3dVMWxpQUhGaE5yR3MzbkR2bmRIX29jMmp4Tk5uWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianNew revelations from Epstein files take a toll across Europe  AP NewsJeffrey Epstein’s Bonfire of the Élites  The New YorkerThe Epstein files come for Hollywood royalty  CNN",
    "published date": "Fri, 13 Feb 2026 02:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Ukraine Says U.S. Is Increasing Pressure for a Deal as the Midterms Loom - The New York Times",
    "description": "Ukraine Says U.S. Is Increasing Pressure for a Deal as the Midterms Loom  The New York TimesA New Round of US-Brokered Talks Between Russia and Ukraine Is Set for Geneva Next Week  Military.comZelensky Makes His Pitch to Trump  The AtlanticKremlin aide Medinsky to head Russian team as Ukraine peace talks move to Geneva next week  ReutersZelensky says Russia is proposing huge economic deals with U.S.  The Washington Post",
    "published date": "Fri, 13 Feb 2026 11:55:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOMUVvOXZFV3NaX1BSQ0hReElBdzJLQ0hNbzh5YXhvdS1FRmxkdVZMbDhHUkJidTJQLUdSdVBVZUxadlRtajJNVVFWN1F5ak9ybTNOSGFyM040Zi1IeG5wVUJiWWR2aWMxMVRqY1huQ210QUZ2SVlDMDRCSTRBdldBQUxHdU14QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "YouTube star Ms. Rachel sounds alarm on kids held in Texas ICE facility - Chron",
    "description": "YouTube star Ms. Rachel sounds alarm on kids held in Texas ICE facility  Chron‘I Just Want to Get Out of Here’: ICE Is Detaining Hundreds of Children  The New York TimesThe Kids Trump Sent to ICE’s Dilley Detention Center  ProPublicaTalk to your kids about ICE  vox.comYuen: Even if ICE left tomorrow, the damage to kids is already done  Star Tribune",
    "published date": "Thu, 12 Feb 2026 15:38:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE05bmgwWVJHV25TdkJlbmw0NExXdmFTZEtncHhHNEhtU0plOGJTVXV0djRaMXU4VHhMZFZZYU55NlRJMGZHLUtVTHhxbTNWLWNCRUhkSWtwMml6WERDaUV6QkVJR0VpQXZLWl9wSUkxSHJCV0tucGpWQ0xJOXk5VXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chron.com",
      "title": "Chron"
    }
  },
  {
    "title": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece - CBS News",
    "description": "CBP officer faces federal charges over allegations he harbored an unauthorized immigrant who was also his girlfriend and niece  CBS NewsA CBP supervisor is accused of 'harboring' undocumented girlfriend  USA TodayUS federal immigration officer charged with harboring undocumented person  The GuardianBorder agent charged with hiding person in country illegally  KRIS 6 NewsCPB supervisor accused of harboring undocumented migrant girlfriend who authorities say is also his niece  The Independent",
    "published date": "Fri, 13 Feb 2026 02:22:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNYVBkZVptOWFLSjJ5R19mdG9HZEQ3MkF1eEpNY04xbEpkQlEtS0VZXzVFSTZyblJBQlNfdko2V1BLYk51NW1EOFVNZW5mdk1UYlNpVmlPUFcxSEJVbHpzM29wVHVfajNfRTZtc1dpb0xqckloTnJraUlETDNuNUdXMXNzOFBSVXE2S3VGbV9ST2EybnJ2V0Vzd1U0LUdWQzlaUWhHYUJlamlFdEx6NEpiU2lseEowc3h1T2fSAb8BQVVfeXFMTXZYN0cwdjZ1QVFlTGt0MHAxdkZ0enRXdGVUNjJ0dTNkcjRnTDBvMWFjbGM0LVJvUXhzSDd1Nl90cjJTTFhfRGNaejlGRWtrZHVUSWxwUEFFNWJCQWJqSHdBOXE0cnBORzRYcGNFWjJJd2lYTVgxRXFaeGlRcjAzN2l0OVY5ZjlMMGtsZUFvVGNhbTJkRU1SeXFVTWRnRHFUR25YR3JQdU93Zk5iczlzWmVxRWNjS21TZU5lbWREM2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick - The Salt Lake Tribune",
    "description": "Breaking with his party, Utah’s Sen. John Curtis is sinking a Trump State Department pick  The Salt Lake TribuneBipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee  CNNUtah Sen. John Curtis is sinking Jeremy Carl’s nomination for a State Department post  PoliticoTrump nominee stalls after GOP senator challenges him on remarks about Jews and Israel  NBC NewsTrump’s pick for top diplomatic role faces scrutiny over ‘white supremacist’ views  The Guardian",
    "published date": "Thu, 12 Feb 2026 23:53:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNVlplNU0tZDBIb2NoY09oc2VVQS1jd1ViUGpIVk1jdUFrbXZMTHhEb3hMRm9mbmgyWlMyTk9qQnZlOHZxcU9JQmVxdmY5aGE2S0lncUhQd3RHd0ozMVdzcXpqTExjZFRqeXo4R0ZCOU1iTEFfRnRBSllhb1hfLVpDRThQS3A2Rk9tV0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise - NPR",
    "description": "6 GOP reps defy Trump to block Canadian tariffs. And, student loan defaults rise  NPRDemocrats’ tariff gambit sparks new headaches for Mike Johnson  The HillHow many House Republicans voted against Trump this week? Take our business and investing news quiz  The Globe and MailHouse Votes to Cancel Trump’s Canada Tariffs  The New York TimesTariff votes hand Republicans an unwanted referendum on affordability  Politico",
    "published date": "Thu, 12 Feb 2026 11:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPLWhxbkhsMm9UaDRWazJmU19EeDJjQktSWnpLQTRGWTFTbXFpY3dzbzcwNUJtZk9wZkgtbEZNUlNabDVBamd6WDBpeHBKVzc4SjNWRzNkN1VsRGpVVnhZVkFRcHZxUWlsSWtBaHp6NXJYSHVEQzY4cWE1UXlXeDhqRjNrQXotV1BQMDNtWmV0dXRwVHZ5eTBWXzhZREM4OG5hWG1qekM3ZlA4YUhpSHNGaXFBNDllNFFBUXdGczhsRi1aMmFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act - NPR",
    "description": "Federal judge orders return of Venezuelan migrants deported to El Salvador under Alien Enemies Act  NPRJudge orders Trump administration to help dozens of deportees return to the US  PoliticoFederal judge orders deported Venezuelans to be returned to US  Fox NewsJudge orders return of Venezuelans formerly detained in El Salvador if they choose to come back  NBC NewsJudge cites Abrego in ordering Trump administration to facilitate return of Venezuelans  MS NOW",
    "published date": "Thu, 12 Feb 2026 19:05:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNZEdPVEZXd2xISUJOTHc1SW5tVkhGdmZnRDBSZmVHMTc0NE9KcHRhRFV5UmZSeGdHTS0wYkN4bzlsSUhOVVU4UWxtb3VySERJLUZWT0E2QlVsZGVjdEgzSnpSTm8yT1N1RXlBVTZMdTZTWEtaT1l0WF9IckczS0U0ZF9rcVhTZExSVEY5Uml5a2xCSmRqa0xRQkRtX0JfaGc5QUQzd1lCTzNyWmtrUEdVUmlXYnIzNk1RYmdpY2J4SzZtY2hBbmF3UkpnWWVJck9hdUt3aWxoNWRrTkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "A New Frontier in Timidity for Congressional Republicans - The Bulwark",
    "description": "A New Frontier in Timidity for Congressional Republicans  The BulwarkDOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC NewsTrump's revenge tour falls flat in the courts  AxiosRep. Jason Crow asks Pirro to preserve evidence related to failed indictment  Politico",
    "published date": "Thu, 12 Feb 2026 20:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNNEpNNHFOM2hxRU4xUFJVMk02OVdkSkdtaFo0SlhoMllKYzFPN1RkSElLbGFSaXZlMmN5ZmpMSk9LTkRBTWZoSVQ2TEUyLXo2VERoQ2NUaDYxVU9ZeEhGR2Z0NTlFdkN5Z0xrN3lKN0o2Z2NYZ2s2ZjVQTC1UYUgwdXRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas - The Times of Israel",
    "description": "Unpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelNetanyahu leans on Trump ties as Israel heads toward elections  CNNTrump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosIran’s Missile Program Tops Israel’s Concerns as Netanyahu Meets Trump  The New York TimesBenjamin Netanyahu says Israel skeptical of deal with Iran  The Jerusalem Post",
    "published date": "Thu, 12 Feb 2026 13:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNekZtYjA2dml2VHFQaHVyYlRBS0NBUlNZX2Y3S0xybmU5ZkxOaGFJcnlXS3JGRy1ZWUFqd3lhTnZKWlM2WWxHb0VaRDRPT3dWUUgyZlFIWXc4dlUxcnhfMjk2aHRPejh3U2tjb3VCUERrdzNRNEJmV0t2UFVnU1ZjX0k1WnE0M1RnU3VOd2RhSG8zeUZ3b0N2ZGdGRFR0WXdhemhmSUtrTlNpNS1CaGfSAbMBQVVfeXFMUHl3MmppMnVReFJwTEVhX1BCZzJmUjlmN3ZQcVhKT2x5dEV3RkZMNmNpLVc5TUhKaktWcnZrc1ZEOGl1SEpJSHZjbE4zMnBWa0FKZ1lfczFuUWFUR2RvdG9jV1JmQlF1eER1enM0MGFxVWhDV0lORDJHZllFc24yWFg4ZWVMdDJKTDlZNlQ1b2twaXNZUnJTQzZzZHRnRVZxcDFCd1ZvSlZhMDJEXzgzdUFoQVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Senate panel hears from top immigration officials, state leaders on Minnesota surge - CBS News",
    "description": "Senate panel hears from top immigration officials, state leaders on Minnesota surge  CBS NewsHead of ICE says he disagrees that Good, Pretti were domestic terrorists at Senate hearing  Star TribuneSenators Press Immigration Officials on Minnesota Shootings  The New York TimesRand Paul Plays Alex Pretti Killing During Senate Hearing: ‘Not Even a Hint’ of Aggression ‘On His Part’  YahooTrump officials confronted with Pretti shooting video at Senate hearing  Axios",
    "published date": "Thu, 12 Feb 2026 19:47:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOM2ZaaFRIeWxQVmp5LUdjYzVMM0U0V05uSWNrbk5FTnlSLU9vNE50ci1zejVNMDRUVFh0ZjBSbDJfU2Z6NVVWV3JBa2xYT3ZVUEQ3Um5TS3RXdXA3VkJ5WDdSeGhtZmRWRlkyWjdCWWwycnpJMFBaWGpmVmxKSFVoQXptRmk4d1hwN1B5QlZWVzJ4THRENWlPWXhwb1XSAaIBQVVfeXFMT1dlS0FrRG9YZ2plckV2eGJ5cTlwNENvVW04SV9JNnUzb3UwYVRSVURNUTBscXRkZkhPV3puUzhGX3JQZkVYbHNBdnJObzY0bVl5dXVIdTJoUzZJZ2owdUhPRHl1ZWVydGNyVWJuaDh4Y2ZYM21aT3lpem5pZnpQd3BaRTVBcm1TQ3pzUE9feVRLMU10UzVuZ3VZNXRGQ2JoSXlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "House leaders say lawmakers can't attend Munich Security Conference as official delegation - Politico",
    "description": "House leaders say lawmakers can't attend Munich Security Conference as official delegation  PoliticoTrump administration live updates: DHS heads toward shutdown; Munich Security Conference kicks off  NBC NewsPartial Federal Shutdown Shrinks Congressional Presence in Munich  The New York TimesSen. Jeanne Shaheen to lead congressional delegation to Munich Security Conference  WMURWhitehouse and Graham Lead Bipartisan Delegation to Munich Security Conference  U.S. Senate (.gov)",
    "published date": "Thu, 12 Feb 2026 23:46:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNVnhtd2VxWGZwbDNodnlpVXJRbzc4LURRUmNDVHpURXJhRXN6cWxUenpNUUc0R2phTU9aOEJkN1hxNjhwTDIzUGxEcEs2NV9tY0JDQ3FfTmIxNHRDREtnM1JKd3l6LXIxa3VwQVctN3BiVURtaW9lTkJMMGRtNkdKVmFZcXNhbUVOc19paHVOVUo3S0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts - KCUR",
    "description": "Kansas City developers halt sale of warehouse for ICE detention center as public pressure mounts  KCURWoman tried to torch warehouse after ICE detention facility sale cancelled, police say  KCTVWoman seen trying to set fire to South Kansas City warehouse tied to previous ICE detention proposal  KMBCPlatform Ventures won’t move forward on building sale process with U.S. Government  KSHB 41 Kansas CityPlatform Ventures says it will not sell south KC warehouse to federal government  FOX4KC.com",
    "published date": "Thu, 12 Feb 2026 21:55:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPX3UtWDN0YkVfYVBZX3ZPYXRpNnh1WExxaFRqSmJSb09sRDk4eUc0LUJ1dmEwQ3ZwRzZCLV9UZTYxRzlXbUcxa3hBZHZON3hNSmlFTGVUMkZhQ3VKeEdWcnYwN3Qybm8xb1ROb1p2dWxCeHFza1haazVNUXhvX2czSmxiRTRVSjlQa1RaS1gzSWVkLWstdkxwMXFZXzQ5NklMSC1meFpHMEtISGk1N1pQY1dTa3NkWDgtLU9ValN2b09haDloNExuVDJZa0l2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kcur.org",
      "title": "KCUR"
    }
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations - PBS",
    "description": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations  PBSCriminal investigation ongoing into Border Patrol agent who shot Chicago woman Marimar Martinez 5 times during 'Midway Blitz'  ABC7 ChicagoDHS says Border Patrol agent was 'placed on administrative leave' after shooting Chicago woman 5 times  Chicago Sun-TimesBody camera video and texts reveal details of Border Patrol agent's shooting of Chicago woman  NBC NewsLawyers for Chicago woman shot by Border Patrol take steps to file federal lawsuit  WGN-TV",
    "published date": "Thu, 12 Feb 2026 18:13:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNjNKWnE5M0R5MWgwUUJjdk8zeEtzRnRoT2ZyOXQzYnFXR3JnRkFrd0ZYQU44dk9QMzhsdWNRUzlvZzFBTzNDLW8tUXNCWGVKMWlJOFJtV3N2N2xVWjdrLUt4Z0dZTm5Ba0NYdWZGcXF3VTBKbHUzTUZCNk1tU2wxdjhkdGhJVVR1UUJmdkV5NkRsNEdpMWdiY2ZRTkF0LWVuMjdlQ0laYzNHMW5PcUdzS1NUbzFOZWlLU0VuZ1d2ZVV0MlA2WmVZWUVCZUtwSVREWFdKbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Republicans just f*cked D.C.’s tax-filing season. City leaders could fight back. - The 51st",
    "description": "Republicans just f*cked D.C.’s tax-filing season. City leaders could fight back.  The 51stSenate votes to overturn DC tax code though officials warned taxpayers may need to refile  NBC4 WashingtonIn rare move, Congress exerts power over D.C. and blocks tax policy  The Washington PostBill to prevent DC from opting out of Trump tax cuts goes to president’s desk  WTOPSenate clamps down on DC tax bill  Politico",
    "published date": "Thu, 12 Feb 2026 21:37:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQamUydmFwQ2dWYV9YREMtVFhuUkVVa1kxbDVsLXpkY3FOZElyQk5rN01ySllPM2xaZzZKTTV3b0VFS09Ra0dvTGJKWk1QdnhwT0d3bDFOU3RaTHI1eG1LMUFJNVRRQ2ZDT096NDhUNDBNdFlsRjkzbjZrMjVCNlZNRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://51st.news",
      "title": "The 51st"
    }
  },
  {
    "title": "Trump’s threat to shut down Michigan bridge opens new attack lane for Democrats - Politico",
    "description": "Trump’s threat to shut down Michigan bridge opens new attack lane for Democrats  Politico‘We’re hurting. We need the Canadians.’ US tourism agency tries to woo travelers back.  The Boston GlobeMoroun company lobbied Trump administration ahead of Gordie Howe Bridge threats  The Detroit NewsReport: Michigan-Canada bridge delay could cost up to $7M per week  Bridge MichiganTrump Has a Bridge He Wants to Sell You  The Atlantic",
    "published date": "Thu, 12 Feb 2026 22:07:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQeFFOdFd6NWVtYzNYRGFyVm1YTWdITU1EaEU2VVVtT3ZqaHNiUXBjTFVmYzFmcWZmT05Ka1lwbDlpd2g3bWktX1NZb2xOR3NzRzY2TEE2T0VuTDdqVlZWQUdxci1FaXlmT2hac3VoU0ZDc0lZMG9JS0Zfa0djMjAwWW00LWhvN2FlZGxyOExyZXEwdkVqdWlQV0tMODZnUE5DMUlJRmladGNzZTFELVViYkdqck1MX2JzUDJqd1VHMnpfMEg0S3dj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Federal judges picked a new U.S. attorney in Upstate New York. The White House fired him four hours later - Democracy Docket",
    "description": "Federal judges picked a new U.S. attorney in Upstate New York. The White House fired him four hours later  Democracy DocketDOJ fires acting US attorney in NY who was appointed by judges  PoliticoU.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House  The New York TimesWhite House fires U.S. attorney in N.Y. hours after judges appointed him  The Washington PostNY senators rebuke Trump’s handling of upstate US attorney pick  Gothamist",
    "published date": "Thu, 12 Feb 2026 19:08:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPM1VvaG53ZXVrRVJVN3pCSTFfOHhaT2FCcmMyZkNZdG9UMW9ORWZhVHZtY1ozeTZtcDVtY294Z2N1cEV5ZmkxUDUybXc5YzYtRVd1aFNqV0hqLS1oTVVLX3VUNk9sbXdRcE9hSDhmT2lCMFJnbnZWZUUxWUQwS0IyQkdlWE8wWmRMNHZPanFiQlhFR081WlJnNDlTTlV6dzU0U043Qk1ac3l3c0M2XzZOX1hYeks3TmVEamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  }
]