[
  {
    "title": "Agents involved in shooting of Minnesota man Alex Pretti put on leave - BBC",
    "description": "Agents involved in shooting of Minnesota man Alex Pretti put on leave  BBCVideos show altercation between Alex Pretti and federal officers 11 days before he was killed  The GuardianOpinion | Senator Tina Smith: My State Showed Courage. Will Republicans?  The New York TimesInside the White House in the chaotic hours after Alex Pretti's shooting  NBC NewsVideo appears to show Alex Pretti spit at federal agents, violently damage SUV days before fatal CBP shooting  foxnews.com",
    "published date": "Thu, 29 Jan 2026 00:59:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE9JM3hNX0VCYXFhRnJ4U3hoM1Y0LTlNTlhXWkJEdkREVDFNZ2l0bjZTMzhvM2stVldTak5rc2xjel9teTBkYWRsQ3o4RnlDaVhQNEVlNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Driver in custody after car crashes into Chabad World Headquarters in Brooklyn - ABC News",
    "description": "Driver in custody after car crashes into Chabad World Headquarters in Brooklyn  ABC NewsDriver Rams Car Into Headquarters of Chabad Hasidic Movemen  The New York TimesShocking video shows car slamming into Chabad World Headquarters in Brooklyn; driver in custody  YahooDriver crashes into Chabad Lubavitch Headquarters in Brooklyn: NYPD  nbcnewyork.comDriver rams vehicle into Brooklyn’s Chabad Lubavitch headquarters; motive under investigation – amNewYork  amny.com",
    "published date": "Thu, 29 Jan 2026 08:42:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQc2dwNE9NSE4yRG4ySk9WUS1kUmZ0WENSbDV3LUtpWnN1UDFGbWNldGVyM2xQdEFWMmN0VHBfX2dTY0pyby16bEJINDRVZkNNc2lGV2pTZnRXamhqdUdtcUxxaTlRYXlmdWxQVFlaV3NRUHY1cVhyX1Jpdjh5c3BQSWU0dHN0cWkyN3l5c0NiaS1Pd2NNVlHSAZsBQVVfeXFMT211NzRfclBoMmZ2WlBxMEtURGJBVDcxM2NpTnNia2owN0hVSWJvMGZwZlNCa2oxOUtKM3M0UTF2R3dnVjZvYndSYzA0cUNkMWVaWWpxSHV6X0szcjZWdzEzNkdVb05GYzJDQWdYVWFYRFdJY01maHZ4Ry00dWVSSThiWTdXMG9VMmZJLTlhMkdLb05mdjBKbkk2Tmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump and Schumer Move Toward Possible Deal to Avert a Shutdown - The New York Times",
    "description": "Trump and Schumer Move Toward Possible Deal to Avert a Shutdown  The New York TimesSenators march into a doomed funding vote  PoliticoTalks intensify to avert shutdown as White House and Senate leaders eye last-ditch deal  CNNDemocrats demand new ICE restrictions as government shutdown looms  The Washington PostWhen is next vote on government shutdown? Will the Senate vote today?  delawareonline.com",
    "published date": "Thu, 29 Jan 2026 04:19:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5xNW51WU9DSDgyR3dfMXBuNE5XdVZIRHcybG03WlVJUmhVZVNFMHNsRy1kNFZ0Z3g0Nlh6UW9OT3VfQktaOG8ydlNJbkJlOTktMEFPVjF1cy1HdzczQW01eDhRRGs5QkZfTk5Bb19qRWZad2tsYmJnY2N3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge blocks Trump officials from detaining refugees in Minnesota - The Guardian",
    "description": "Judge blocks Trump officials from detaining refugees in Minnesota  The GuardianJudge Orders Release of Minnesota Refugees Targeted in ICE Crackdown  The New York TimesFederal judge bars Trump administration from detaining lawful refugees in Minnesota  CBS NewsJudge Temporarily Bars Trump Administration From Detaining Minnesota Refugees  The Wall Street JournalUS judge blocks Trump policy targeting Minnesota's refugees  Reuters",
    "published date": "Thu, 29 Jan 2026 02:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNN0JkaE9QNF9UUWtELU9aemYxb3pKNDVMQVVPY0N5MVBYdmw2eGUwY3ZvWnh2YXd1UUpVVWtDNUdFM2NKbFE0SkpsQUhMMElXQ1lDdVFiUkdVT3NlNVd1TnpfY3dReXhxRDgxLW9ScGhmQ2lfTkZvWlQ2NDRBWGl3eXJ2Wlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. life expectancy hits a new high, as deaths from overdoses and COVID fall - NPR",
    "description": "U.S. life expectancy hits a new high, as deaths from overdoses and COVID fall  NPRView Full Coverage on Google News",
    "published date": "Thu, 29 Jan 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1zYXp2LXpZQ0l5OEhyZjRDU3E4cDVYLXJGNndoRmw2RzhwV1I3VlpEbUFtMGp0cEZ2cW9JdUprYTdrMWRvWkNUMUpsZ29aV0hBMDVFMlhwVGo1OVlwcXZpNEYzc3hDRGV5Xy1BSEp5YUltUFZES3ZkVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump weighs Iran strikes to inspire renewed protests, sources say - Reuters",
    "description": "Trump weighs Iran strikes to inspire renewed protests, sources say  ReutersTrump weighs major new strike on Iran as nuclear discussions show no progress  CNNTalking or Fighting, All of Iran’s Options Are Bad  The Wall Street JournalVOTE: Do you think President Trump should use military force in Iran?  fox11online.comTrump Threatens Iran With ‘Massive Armada’ and Presses a Set of Demands  The New York Times",
    "published date": "Thu, 29 Jan 2026 01:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOQVZkZzBNN0l6NDBLWWoxblZrQVhBTkNSS0RJMWdpLS10b0NEdE5XMFJvTDhCMms5MktFdm5NdG5pc19PTDdQMU5YU0JRVGRDQW9jak53MGlSZDBoU0Y4NS1JTGJWd1lTX0NidnJvZWtHZVp4Wm5taVNvTU5tbGdpa0JTcmxaZ2J2UHVrd1lXM2xRc0kwYjdNdTlxVGYwN0FOcl9fbFVuTHZOR25IRmxzR0M0SXF0YkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "FBI executes search warrant seeking ballots from Fulton County’s 2020 election - The Washington Post",
    "description": "FBI executes search warrant seeking ballots from Fulton County’s 2020 election  The Washington PostFBI raids Fulton County election office seeking ballots from Trump’s 2020 loss  ajc.comFBI’s Search of Georgia Election Center Is “Dangerous,” Experts Warn  ProPublicaFBI searches Fulton County elections office as it investigates alleged voter fraud  CNNFBI searches Atlanta election office, chasing Trump 2020 vote fraud claims  Reuters",
    "published date": "Thu, 29 Jan 2026 05:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPU0JqQzRPRHp6SkJua2tfeDAxRXRlV0MxWkhlQWVXRnVaa3M3ejFMSzRWRzJic0ptb3cxRVV0YlhrRUFyTFRITkFWS1lqR1k5UmpCOFBxWTRlZW1KVnJ2clZTOWZ2ZExwM3B6eU1rV1g1NXdqcVg2QXhzSEktQmNnNTdEeXAwQXg0T3F4RUx0Q3M1aGpNRVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Judge rips into ICE but backs off demand for agency head to appear in court - Politico",
    "description": "Judge rips into ICE but backs off demand for agency head to appear in court  PoliticoJudge in Minnesota Says ICE Has Violated Nearly 100 Court Orders  The New York TimesTrump has a new problem in Minneapolis — a GOP-appointed judge  CNNTrump administration releases Minnesota detainee after judge threatens to hold acting ICE director in contempt  NBC NewsJudge slams ICE while backing off contempt threat for agency’s director  The Washington Post",
    "published date": "Wed, 28 Jan 2026 23:24:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQbzJvTGVZSmplZTRXY1FTTTV6ZVQ5RTQtUS1nNzlWTmo4NVB4a1dwQkk0MjVtREpKN0tQVENfMGRRNTRsQ0RxblR3bEJNLVl3MlM0MmlsQjJoYUg3eDJ2OE9wZEFFRlBXeWh0S0FKenZqNzZtdjJqVzlzVTdpZDR3azVkWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Immigration was a Republican strength. Now some fear it's slipping away before the midterms - AP News",
    "description": "Immigration was a Republican strength. Now some fear it's slipping away before the midterms  AP NewsImmigration agents have become Donald Trump’s personal posse  The EconomistOpinion | Minneapolis May Be Trump’s Gettysburg  The New York TimesIt Wasn’t Democrats Who Persuaded Trump to Change Course  The AtlanticIn a battle over how to carry out Trump's immigration agenda, one faction has triumphed — for now  NBC News",
    "published date": "Thu, 29 Jan 2026 03:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxON3kwellOU3pYVHRBTmk4QlgxNVZMWU5mTm1jc3VMc0lZRThXazVQdFB4SzVzZXlrX201dWdMSFdHTlNaYk1KSE5QWEJJMU5tYWpaRTcydUVqRTJOOE5FWVVJNFlGaHo0WldLM3dJUUlMZUFMa3A4YUJtdVBXN1p3SlZUQk9XQ0tJdkZEaTJpLWhhNnFHLVc1Y0ZySUVWLXU4T2h2RFlocHlHVmxERnJQZ1MzS2tIdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "A shadow network in Minneapolis defies ICE and protects immigrants - AP News",
    "description": "A shadow network in Minneapolis defies ICE and protects immigrants  AP NewsInside the movement challenging—and disrupting—ICE  The EconomistSome small businesses in the metro will stay open despite 2nd anti-ICE protest, economic blackout planned for Friday  kstp.comMinnesota Proved MAGA Wrong  The AtlanticICE in MN: New Alex Pretti video, Gov. Walz sit down, Ilhan Omar sprayed  fox9.com",
    "published date": "Thu, 29 Jan 2026 05:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPS3F1WGpuS1pJVFJ6Q20zU1VWeWpKZnNyWXVPT3lVdm5ZTGFxRm40RWJFOWV6MHFPbU1WNXFtbmljUEIwaVNkME5oc1hRUUhYNTJsV2Rha3hoNTNPVlFJanlTaVdFUkhnRDJzRktmTGNzWGI0NWxYbzlWRWE3U3F3SVRpaGVIb3VIcmg5OHZmbDFrT0o0aUV3X1JyQS1jWGtNV005Zzlvck1PYVJab09jMURCdEFlUXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Attack on Ilhan Omar Follows Years of Trump’s Targeting Her - The New York Times",
    "description": "Attack on Ilhan Omar Follows Years of Trump’s Targeting Her  The New York TimesOmar says Trump's 'hateful rhetoric' causes threats against her to 'skyrocket'  ABC NewsWho Is the Man That Attacked Ilhan Omar at a Town Hall in Minneapolis?  The New York TimesTrump’s response to Ilhan Omar attack betrays his growing callousness  CNNSubstance sprayed on Rep Ilhan Omar reportedly identified as apple cider vinegar; FBI investigating  foxnews.com",
    "published date": "Thu, 29 Jan 2026 00:58:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTnhLTjBvRHR0RU9BS21KRURzSkFobFppT3ZGNUtRcnBpa3ZMWGtlRUhKeXNMd2JvQ1Z5bW0xdVd6MTBjcVNHZmkwYnRCT2N0ajR5OFV1RVBhWlpjM240MFdOVk5VdjU4ZE1BeVlhSWc5aWpjNHZDbGFpUUc0VlZteQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "House Republicans fume at Kristi Noem as impeachment push looms - Axios",
    "description": "House Republicans fume at Kristi Noem as impeachment push looms  AxiosNoem’s Handling of Shooting Put Her in Trump’s Penalty Box, but Just Briefly  The New York TimesTrump dings Murkowski, Tillis after their Noem criticism, calls them ‘losers’  PoliticoGOP on defense over Noem’s future as Congress nears shutdown deadline  The HillHouse Democratic leaders threaten to impeach Noem if Trump doesn't fire her  ABC News",
    "published date": "Wed, 28 Jan 2026 23:12:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBydzFIWWdMTUlIM1EtLTJUTGZSVDZFZGxFdzJOMFVtcEd6cWFXXzl2Y3l0Znk3VW9GeXlSX0FEbHNwWmhyRDhKLUc5TjNWbGNDVHlQT1BTb0diX01sWkRaQ0VaNmNwckVZbkNvT1lEb3NyU3ppbWphdnRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Nicki Minaj Bravely Vows to Protect World’s Biggest Bully - Rolling Stone",
    "description": "Nicki Minaj Bravely Vows to Protect World’s Biggest Bully  Rolling StoneNicki Minaj says she’s probably Trump’s ‘No. 1 fan’  The HillRap artist Nicki Minaj pledges support for Trump accounts  CNBCRejected by rap, Nicki Minaj becomes Trump's 'No. 1 fan'  USA TodayNicki Minaj Posts Photo Of $1 Million Trump “Gold Card” For Fast-Tracked Citizenship  Forbes",
    "published date": "Thu, 29 Jan 2026 00:15:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPY3cxWUpCV0dCdkVYM3hDUXgwY0JiSVliN3U3V3V4elZYSkVTOU9IVGl6bmUwZGYtN05Rb2RIbjNuNlprTF9mX2piOS0yaS1zbVR3VjRpQmFRMnd5cnFRb3hrNm5jUlV4a2Y0MThveC1SUDFDVFlSVkFiVGp0TzBEQzBCSE80RE53dXNKdm1iNWlJMXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "DPS troopers clash with protesters outside Dilley ICE detention facility - tpr.org",
    "description": "DPS troopers clash with protesters outside Dilley ICE detention facility  tpr.orgUS congressman meets five-year-old Liam Ramos and his father at ICE detention center – as it happened  The GuardianProtesters and lawmakers gather outside Texas facility where Minneapolis child is held  BBC‘ICE conveyor belt’ illegally detaining, moving Minnesota children to Texas faster than courts can respond  mprnews.orgRep. Joaquin Castro meets with the 5-year-old boy held with his father at a Texas detention facility  CNN",
    "published date": "Thu, 29 Jan 2026 03:50:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQNnQ0Szc5QmJtTTJlRXBsbnVub1huRm12MExkRWlmdTdoM1V5Q21waG1ZYlFIaTFNYjdIUHlXem5VNVBTU1hGXzBydXJsZmU5NzV0dThZTkhfNFR5c3N1cWpUQ2k0UHdxa0dRZV9kVUZ6dFQ4V091ZWQxYUFMV2VOM3BlV1FmMUhLalJZVVp4cDV1QThleDZXcmk1U1VTU0oxM3lTRzlGakxJeU9pTEtPc0dTYXpCWUEybmgxcVloMzVka0JhakR4bDJoR3RKVzZFNW1fR3A2djZhWHk5NFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tpr.org",
      "title": "tpr.org"
    }
  },
  {
    "title": "South Africa Cancels Release of ‘Melania’ Documentary - The New York Times",
    "description": "South Africa Cancels Release of ‘Melania’ Documentary  The New York TimesWhat to know about the Melania Trump documentary  CNNThe Canceled Hollywood Director Spinning the Melania Movie Into His Comeback  The Wall Street Journal‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling StoneBig budget Melania Trump documentary premieres with splashy rollout  NPR",
    "published date": "Wed, 28 Jan 2026 19:32:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQTWxkSVdEQVJPRElZUWhjNVpXa2FUN1RvNkVhbTNNWi11bFI5eTUzQlRLT2pFM2Jic0tPNnhMYW4xZE1MWldUaW01NHNrZ3NrVk5nZ0U1amJpOHlhMmlPc0xDcWNqMWFIbENEQ3JWTFdXaTRUSVlRcnI3cWdmaFllNS1OZHl4d05EbXVBVHZfSFhMOHRwOUR4Q05qWEVMQzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Mamdani ratchets up tax-the-rich rhetoric as Hochul launches reelection run - Politico",
    "description": "Mamdani ratchets up tax-the-rich rhetoric as Hochul launches reelection run  PoliticoNew York Mayor Mamdani says city must hike taxes on wealthy to fill $12 billion deficit  CNBCNYC Mayor Zohran Mamdani to call for tax hike, citing $12B budget deficit from Adams administration  abc7ny.comMamdani Faults Adams for $12 Billion Budget Gap, Renews Call for Tax Hikes  thecity.nycMAMDANI’S FIRST 100 DAYS: With NYC facing $12B budget hole, mayor blames Adams for mismanaging city’s finances – amNewYork  amny.com",
    "published date": "Wed, 28 Jan 2026 22:55:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPbUZyQnQ5MW1HZk55dEU1TktidkliNGVDNi1MN1BORTFvdWpBWGFNUGo4OVltSkp2dFNJVGkzdzFYWm9Mek9VTEpVY3U2MHIxZklnQWlTRW1lZTc1QjlYeU45YU1PWVFBM2U5WTBMT01GZTV0SmV1cVBJR0I0SlNYblVrelRwd2thd1RIOHBMaWt4UzRxNEd0X1ZvbTdYUzRXcjByZXlmVGF6Wk5NejVuaGtzUzgwZkIzOC16SVREVDItLXJKR3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "‘The product of court-shopping’: Virginia Democrats appeal judge’s order halting redistricting effort - Democracy Docket",
    "description": "‘The product of court-shopping’: Virginia Democrats appeal judge’s order halting redistricting effort  Democracy DocketVirginia Judge Blocks Democrats’ Efforts to Redraw Congressional Maps  The New York TimesJudge rules Virginia Democrats violated law with redistricting amendment  The Washington PostJudge strikes down Virginia Democrats’ plan to redraw congressional districts  The GuardianVirginia Democrats appeal ruling on redistricting amendment  The Hill",
    "published date": "Wed, 28 Jan 2026 21:13:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxORDgyVmMtMDRMTzk3SmJzaHFQWjlUQnE0WDdQOXpBNElRMTY1N2Y5NmRGWXhZakJROXlUb1hnTjZqcDZNTE5zLW1FSTlUSkI5VFpUMU1zTk1xUUFpX0JzeFpiY1p3MDlBTjFONDJmYXVFR0JJNzlia1h2OHQtMU02eEYxX2pMVjJEb0o5SUtZcmxsdGpEVklSMTZTMzNvRXoxbkVaOGQ2bXZWUDBQNjBzbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "While Minnesotans Rejoice Over Greg Bovino’s Ouster, His Replacement Is a Deportation Hard-Liner - The Intercept",
    "description": "While Minnesotans Rejoice Over Greg Bovino’s Ouster, His Replacement Is a Deportation Hard-Liner  The InterceptNervous Allies and Fox News: How Trump Realized He Had a Big Problem in Minneapolis  The New York TimesHoman to speak in Minnesota as he takes the reins on immigration crackdown in the state  CNNGreg Bovino Loses His Job  The AtlanticWhat does a scaled-back ICE operation look like?  kstp.com",
    "published date": "Wed, 28 Jan 2026 20:00:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNUmtQYkx2S0QzUVQxU19aNEpLSW4zeXJ6dmtFVDVmRl9sSEFrczlkLWpZd1dVSzBJd3VOVXl4OW5OcjJCckR5WmN0a3loWW10c0J1dVJfdlVjVEctSlBTREgwQnl5d3hqX1VQME5xS1hPSWJOS0ZBZkt3Q1ZxZ1JlZjl0b2lKYXRQaXJfdG0xOWFkQ2RYQzdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theintercept.com",
      "title": "The Intercept"
    }
  },
  {
    "title": "Marco Rubio tells senators Venezuela transition won't be fast or easy - NPR",
    "description": "Marco Rubio tells senators Venezuela transition won't be fast or easy  NPRIt's in Venezuela's interest to co-operate with US, Rubio says in heated testimony  BBCSecy. of State Rubio Testifies on Venezuela  C-SPANRubio says Maduro abduction ‘strategic’ necessity, downplays future attacks  Al JazeeraRubio defends Trump on Venezuela while trying to allay fears about Greenland and NATO  AP News",
    "published date": "Wed, 28 Jan 2026 18:39:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9UZ1IzOFkwOEw5R3l2cHkxbzg3MXRNMlNoUjF0WE9oYTVqcndjcG85S1NsZjl6aGtfV2NNOWxiVzFNeUo4TWpldkVFakhOajFWMGZzZlNxNjZ0OTRsLXNpME11UkMtUkt2MXgwVWRKMWl4Y3pmT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘Significant’ coastal storm expected to hit this weekend, but will it reach Upstate NY? - syracuse.com",
    "description": "‘Significant’ coastal storm expected to hit this weekend, but will it reach Upstate NY?  syracuse.comBomb cyclone to bring major Southeast winter storm. Northeast could see a glancing blow or a lot of snow.  CNN3 Things to Know About the Next Winter Storm  The New York TimesWhere a nor’easter will bring heavy snow, strong winds and waves this weekend  The Washington PostTimeline: Nor'easter to slam the East Coast with heavy snow and high winds  FOX Weather",
    "published date": "Wed, 28 Jan 2026 15:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQVWs1Qzg3TXRIM3NjRHNaZWlTX3pKQ1h3UlAxWVJJYU9rcWNWRVhNa25nalVVN2ExX2pZWHc0bE8yVVJsb19BRkxSTDJlS1VzaUJ6d0JOcVBGVl9NLUNUdllFUmJyWllzSWpEVm9WeFkwcU5oQlFZSDRLNEdaVWFULTQwTUtaYVczeXJlS2NSUGFvTlhHa0pwWDRKS2l5OHg2VjRvdC1oSkEtZzdrT1g3OFNMcl94WlBIQjk1Ylc1dGUyS2l0eFh0dg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "syracuse.com"
    }
  },
  {
    "title": "In Alexander brothers trial, first witness testifies to being sexually assaulted - CBS News",
    "description": "In Alexander brothers trial, first witness testifies to being sexually assaulted  CBS NewsBrothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesPopular actor named in federal sex trafficking trial  syracuse.comAlexander brothers raped victims lured with trips, party invites, prosecutors say  The Washington PostBrothers were predators masquerading as party boys, New York court hears  The Guardian",
    "published date": "Wed, 28 Jan 2026 04:58:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQR1F2dGY4MS1Qc0V6ZFRHVlpPbWVwMjdXblRxZDh2WGZibFBKMWdRUVZXY2FRTzQ2dENheDZicGk0bnkxQU5NTkNISlhDVDVRMG9La2FzM19hZXdfbkswclFEU2YzcG9pZHNEY2VPWWhidWRNTlVyb0wwVXoxaXp0cGZQdDHSAYoBQVVfeXFMTnh4dG9QaF9Yd2x4cDdHMUlueEZNVU9uczBXblktU2JGTzZEMktIUlFhTDNqV2I0TkZ0OWxEYUhwODJWYThxLXZDSUdiWGdtdDJDNjdpcGFnN2hLdGlkaGFpQlFTLW1STzJCYzkzNF83MWJZdElQT1ZhZDlOc2lfT1hzakxrSFQ3bW1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump officials trade blame as political pressure mounts over Minneapolis - Politico",
    "description": "Trump officials trade blame as political pressure mounts over Minneapolis  PoliticoTop White House aide Stephen Miller acknowledges possible breach of protocol before Alex Pretti’s shooting  CNNScoop: Stephen Miller behind misleading claim that Alex Pretti wanted to \"massacre\" agents  AxiosReports Indicate Miller’s Grip on Trump Immigration Policy May Be Slipping  TruthoutPressure grows on Stephen Miller after Alex Pretti killing but Trump unlikely to cut ties  The Guardian",
    "published date": "Thu, 29 Jan 2026 00:29:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPdk9GYWlmako0YlZvSDMwOTVSWW1nak1BRDFlYlBERWtOeTFRd09aMk1NVGpMVTluVUp3VmtDM1VuWXlnYnhsQzVJd1NlSF9vM3pxNG84VmIwZTRHRTRTaFhnTjNoRTRieUl1ZlJPRktCaHBfSmp2Rko5eUxCU0ROczJUZzR6YnBHOWNNQk1qU1Q1MlQ4U2U5blZPYXRlOVBENTdLczhFRDExbU5MbGdaRTR6U0JmSlNDakc2QndRekI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington, D.C. - NPR",
    "description": "NTSB blames 'deep' systemic failures for deadly midair collision near Washington, D.C.  NPRInside the Cockpit of the Helicopter That Caused the Potomac Air Disaster  New York MagazinePilots fear airspace limits after DCA disaster could slow DC emergency response times  nbcwashington.comClose helicopter routes and Army crew’s perception of the wrong aircraft determine why a regional jet and helicopter collided  CNNShe’s the Face of Trump’s Aviation Safety Board, and She’s a Democrat  The New York Times",
    "published date": "Wed, 28 Jan 2026 00:12:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRGFUd0JYRnkxS3Nvbll3MEI3cG1qeDZMdGM1dm5JWDBaX3hlUERaQWotd0VkTzFaTDZDV0RLb3RNRFh3b3VXOUFETnlVVHRnU0hxVVdVNEptZ0NGZjVaajY0akNKVU1KUFpIUndET21UaHBTSkE3VGZ3NVlWWENfR3NEaWFFTXlIWnN6Sk83WWhSaVBwVkVJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘The folks are fearful.’ Haitians living in Ohio may soon lose temporary protected status - ohiocapitaljournal.com",
    "description": "‘The folks are fearful.’ Haitians living in Ohio may soon lose temporary protected status  ohiocapitaljournal.comGov. Mike DeWine says Ohio prepping for possible ICE surge in Springfield  dispatch.comHaitians Are Vital to U.S. Health Care. Many Are About to Lose Their Right to Work.  The New York TimesSpringfield resolution asks expected ICE influx to observe local rules on identification  wdtn.comSpringfield braces for 30-day targeted ICE surge after Haitian TPS ends  springfieldnewssun.com",
    "published date": "Wed, 28 Jan 2026 10:07:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQdERXUVhHY2haMUM5ell0dGxQMUdIWDFYZ2NodWJSLWRNNDNZeXhlak9JZDNZc0lyMWluNjlId0NNYkExTVlsWnFUQS03REFtaktIZUlOa0ktY3JDWmh2aEEtRjFwVHZydURkOEp2OXV3M0R5TlhLZm9kdWVkc3NaTWt3cmF2YmNiZkRCemwzdjIySk9fNThNeDFVRVIzSWJLcllEd1Z4MVVMdlYwamZodDdDTXE0WWlCUVdGNk9qc0hkM09GWXFkdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ohiocapitaljournal.com",
      "title": "ohiocapitaljournal.com"
    }
  },
  {
    "title": "Mountain lion found after several sightings in San Francisco's Pacific Heights neighborhood - abc7news.com",
    "description": "Mountain lion found after several sightings in San Francisco's Pacific Heights neighborhood  abc7news.comLive TV report on cougar capture in San Francisco neighborhood interrupted by coyote  The GuardianTails of the City: San Francisco’s Latest Animal Sensation Is a Mountain Lion  The New York TimesSan Francisco mountain lion’s cute baby photos — and life story  sfchronicle.comOfficials tranquilize mountain lion loose in San Francisco, later free him into the wild  kcra.com",
    "published date": "Tue, 27 Jan 2026 07:06:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNTnN5SEU4b21PZnpwamFvSmNVQWx3dXR4MEYwQjFreFRlNXRwTnhEaHdwblFpYl83UHh2VHhYdGF1d3k2M3RYVi1ELW1nUjROTTk0MU9sUjhMRl82V3dBRVF5U1d2aGdrVUpZbG1mNjJXcXRyUEllNWFGQVd5NFpKbGo2UFQ2TzFpNzYzRUJybVV4OFo4MVZIOVI1OEo3bDRQSG03NFZ30gGrAUFVX3lxTE9hU0xKWElpVHRqMk8zUHBVS0NDWk5PNGlkXzRWZ0l2SllvRTFBS2dseExBbmVUczdla3pWLXpLcnNweWxXNjViVHEtRlNuZmZDczFTN1RuTzZIN3VVMFZjMWlJMnNmclZ2Tm56X09jRl9GYW8wZkF3VFJKQ1BEcVZ4aGtYdFVrMkRyeDVfYnBjMC15bjVfNnJXTEVBQkZmdWpqUDlUNWtTVmRLaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7news.com",
      "title": "abc7news.com"
    }
  },
  {
    "title": "Missing Danish flags spark further outrage after Trump's NATO comments - ABC News",
    "description": "Missing Danish flags spark further outrage after Trump's NATO comments  ABC NewsRemoval of flags for fallen Danish soldiers at U.S. Embassy sparks backlash  The Washington PostUS Embassy in Copenhagen removes flags honoring fallen Danish soldiers, angering veterans  CNNFlags honoring Danish troops at US embassy reinstalled after outcry  Military TimesUS embassy removes flags with names of fallen Danish soldiers  Euractiv",
    "published date": "Thu, 29 Jan 2026 02:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQZGFnZ1Rvbkw3c2wzbmVkQTcwbUlDZFcwaVdCYlYzSG5RZFpBUDYyR2Q0MVotV0NwRmJVeWlkaUVDV3FmR3RjdUJvU1hXajJ3dkM3Z2tQRWtpYXItZlJMSDZXRnd1bG5GMWp5ZmZGWnZ2MnVhVGd1dWxDenh5Ml8xeWhGbHRuaGRFYXJkcUx4UUpxYjdYVXA4TXhZc2JaVk5fMkVMUmh30gGrAUFVX3lxTE1ETi1JS2ZrWHB6SW1pVm1jZUQxdExsVk1QZTR3bWtWZWdJTERiWmt6d2l1VC1tbmlYLTh2U3d2QmEyTzRJTllaQ0RyUVB3SHFhNTJnclZDZ1hrNVRmWGMxdzV2clYzWV9McmtwLWQyT2RSV0Eyd3pWdHJ6RG1WcHIwaXAyRFBnN0Npd195SFJhS3JCX0FWLWt0bFJXZ3VSNWhlVnhEWEZta3lWdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump yanks permitting process from Democrats after California fires - Al Jazeera",
    "description": "Trump yanks permitting process from Democrats after California fires  Al JazeeraTrump signs executive order to ‘preempt’ permitting process for fire-destroyed homes in L.A.  latimes.comTrump signs executive order aimed at assuming control of Los Angeles wildfire rebuild permits from state, local jurisdictions  CBS NewsTrump Signs Executive Order on L.A.-Area Wildfire Reconstruction  pasadenanow.comTrump executive order targets 'overly burdensome' permitting in LA fire zones  laist.com",
    "published date": "Wed, 28 Jan 2026 20:25:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPdE4yUjZxUkZtaGhVVTdndnFjQ1ZmYWVjVE1tQ0laWG5zT1BjSk9Kc2I1ZG1kb0JCSEYzRUJpTzh6VGJKVlJiZTNTcWkyVG1MMEY5VDIyN0QxUTJBTkZ6SE5pMVRTSWVPaGZiMDVIZHpVODdVQzlwQkNZYUtpX1M2TUJPc014Y3dwYm5XY2xHY3FlTEo2Mm1pRndxRW1RWnRNQnNybkFEZFRnR0hJV3fSAbMBQVVfeXFMUG0xeUNjZHVLWVFTaUt1NG5kUVFiNTlRa0FNdnYwdkJaOTVqUVBNWmJDY0hWSHQ0bXlfZzRfaUt5WVhVci1mdlBFa2hTZ0tlOXFkWS15VjBPM3FOdzEya1VQbzhzSUU1VHlqMGp1UUNlT1RaTUpjRkdyMmI2Y0hJanpwWU9Wb3BQZm9TbG9LWlBvakRBR3FyeGxoZGx0SXh2QlhaamVVRS1VVFl2Mlp4Vm1DQlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Inside the 'ghost student' scam that uses identity theft to steal college loans and financial aid - ABC News",
    "description": "Inside the 'ghost student' scam that uses identity theft to steal college loans and financial aid  ABC NewsIdentity theft: 'Ghost students' can steal your identity, enroll you in school and take student loans out, ruining your credit  abc7chicago.com'Ghost Students:' The digital network of thieves posing a 'major threat' to CA Community Colleges  abc30.comWhat are ghost students? How criminals are stealing millions in college financial aid | Investigation  6abc.com'Ghost students' steal millions in financial aid using stolen IDs, investigation finds  abc11.com",
    "published date": "Wed, 28 Jan 2026 12:31:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNbU12WnFrcmZyZENDcXJPaVhpRHB3cE55UmNfelFyb0ppaU5qV1VfcE9WcjBrczYwZFNxWENUSUE0bWxEcDBNa1VQZ3lSak15TFB4OGhNTnNxRUZfNmMyS2c5eUYta1lyM00xYk9wQXpIdXdjRUYyNVVaM3dnYnVNZWVVWTVRQVNvOUxJcVVUTTBoNF9iZUg3TkJ4bnl0Q3Vj0gGmAUFVX3lxTFBoVGxra0Z0dlVhTmdEbFhveHlqOU9JMjRkb2d3WUlsMkptUTNDVmhiN2VmZ0ViUllYdHlTSTNzZ2UwRFc0NF9LQ0VYb0pHS05iNU1IMUtXUS1idE5qakIxOXp6NGJOWGZ5Ymg5QjFpVzNDWmNlblZWWmVwbmFmVkVCUkIydDBrZzhadmE1cEJlRWluVTNONWl1VEwtajJ6NlE3VG0tLUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "EU heavyweights deepen rift with Rutte over Europe’s military power - politico.eu",
    "description": "EU heavyweights deepen rift with Rutte over Europe’s military power  politico.euEurope must act urgently and stop outsourcing defence, says EU's Kallas  BBCEuropean leaders call Trump Greenland rift a 'wake-up call'  DW.comEurope’s $1 Trillion Race to Build Back Its Defense Industry  The Wall Street JournalEurope’s Rearmament Paradox  Foreign Policy",
    "published date": "Wed, 28 Jan 2026 15:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOaFgxcDhMWGNSclptZ3pyeGVvVHBYRGtIZnR0WHZGM2hvOWVfZjNiZmFVcnpKZVVZcHlHRTR2N0pMeU9rRk9fZWFtV2ppN3I2UTVMR0ltLUw5QUxIdG5CZ0FPRXdiVkpCM2ctYlhhdHQ4bG92dGNIbXh5cGRnYjhWVVRPZkI3bVVjWVdTOFRqclNWN2xOUjRQaXJUS3pCRVlGYW5oVV9YV29oS054eG9hdDlsZzFOdlJF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "California Democrats have new plans for confronting ICE: Taxes, lawsuits and location bans - calmatters.org",
    "description": "California Democrats have new plans for confronting ICE: Taxes, lawsuits and location bans  calmatters.orgCalifornia Democrats to Congress: Shut down the government over ICE shooting death  calmatters.orgAfter Minneapolis shootings, California advances a bill allowing lawsuits against federal agents  latimes.comGovernor Newsom and Attorney General Bonta to law enforcement: Local and state police have authority to investigate crimes committed by federal agents  gov.ca.govNewsom urges California law enforcement to investigate possible federal agent crimes  Politico",
    "published date": "Wed, 28 Jan 2026 13:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1qVkIzekxMSER3OElSck4yeE1yWGYwVW9Mcno1VTRxOVBfVXZucS1XUnBNcHNZeTdmcUo5NXVNSFFNUEF0bS11bHJ4akt0X2pIc1dHQ21CdWRuMkhsR0JoeVRIVHh3blMyMzBoLW1hdjJ2MTNyQV9NWldnbW84R0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://calmatters.org",
      "title": "calmatters.org"
    }
  },
  {
    "title": "Families in Maine scramble to halt ICE’s transfer of detainees out of state - The Guardian",
    "description": "Families in Maine scramble to halt ICE’s transfer of detainees out of state  The GuardianThe DHS crisis is squeezing Susan Collins  Politico‘We’re not safe right now’: Woman’s dramatic ICE arrest ignites fear in Maine’s immigrant communities  The Boston GlobeMaine’s Immigrant Students Stay Home as ICE Operation Ramps Up  The New York TimesMaine mayor: ‘This is not the America I grew up in’  The Hill",
    "published date": "Wed, 28 Jan 2026 13:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNekhfSUtUdnpuY3R2eW5hamo0ajZFQllZcU14MXpTd3R1WVoxU2k5bWU3MFdRb3pGdmpqcVRyYW1FTENhcTJSV09lT0V2SHVyOEpCeFdIT3dyUnlMZ0p1Y0xzc0dfTEJfVDRieGRnMlB6TmYzYUh5c1VFQTRqemNPX1hn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "N.J. weather: ‘Bomb cyclone’ could bring blizzard conditions, 3 to 6 inches of snow to parts of N.J., AccuWea - nj.com",
    "description": "N.J. weather: ‘Bomb cyclone’ could bring blizzard conditions, 3 to 6 inches of snow to parts of N.J., AccuWea  nj.comNor'easter probably a 'near miss' for NJ, but 6-inch snowfall possible  app.comWeather blog: NJ Transit rail service resumes, NYC deaths under investigation  nbcnewyork.comNew Jersey’s Commute Is Off to a Rough Start  The New York TimesAnother NJ snowstorm this weekend? What forecasts are predicting  northjersey.com",
    "published date": "Wed, 28 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPeHRlOEp3cGYwLXU2NjZOa3VKZXNJZjVIN1MtdXI3NWVKSWNzUUtsVW1kTF9rXzZhRHlhMVBxQVdmTG5xQl9nTXR2d1hpT3lmMzE0Z3NXUUhEUnVSTVZQSG9qd2dTQ21NSzNyZXl4R2FxQjRSRkZRU21vVmF0VmNRZTVGUERhSktUeVBOa2txZHFud0RoOHBBTGxCTXdnUTloT3FSdGtuTUl1Z1l0UzA0VmZRVmRFV2MtVmZ5ZVFJaGFEQ0o2ODRPMWZFVzd0RGNOdFpfNNIB6AFBVV95cUxQUTA2UUlSTkRDejcxREcwdlFTSmw0cUlTamJrNkhkQW9BZHJld0VWcnktM2dFb3U4MnBFQ3E1bkRMcFhlc090UTNpZ20zMXlnS1hxMmpYZU1mQTVNRFppUnNUWUNPdy1OSzQ0bW16OXBhR2xNWkFINkstclVlNTVINVV6NGpBMGhyTDNTQnUzLWl1anktanIyRTRkSTBLZ0FMQWxZUmlRdzloSlNuMF9TZWV1WEpDajBoWUsxWmpZMVFmbE9QOWx3Z2FEN3UybzJvdEk0S1N4ZS1XMjdaZVpEXzdsTzBmVFlX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "nj.com"
    }
  },
  {
    "title": "Car inspections here to stay (for now) - keenesentinel.com",
    "description": "Car inspections here to stay (for now)  keenesentinel.comFederal judge halts New Hampshire law that aims to end vehicle emissions tests  wmur.comElimination of mandatory car inspections in New Hampshire on hold after court ruling  CBS NewsVehicle inspections back on tap in Statehouse  keenesentinel.comNew Hampshire car inspections here to stay — for now  nhpr.org",
    "published date": "Wed, 28 Jan 2026 14:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPRXhWbXlrQ2NiMjZIcGJyYzdkZGtwLXhDRkM4U1hZejBOMkliRy1WNy1hRDJqR1RlaVpZRG1hSC1GeFAza2RBMjFYSUVXWklPbDBHYi1qeURlam4xNFpZZXVTQ3ZqN0IweGhMVFI0OURxaDh2RmJEZGE1LTNuOWZMOE5oMTM2OU4yekx3aE5uRnVaa0ZWS2ZET1A0V25VRU5PdEU5T0RTT0VQN0F2OGpGWkJIWHlNYW4xanB5bTZ5WGFTVUl4MTRzSVNXaHNEaVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keenesentinel.com",
      "title": "keenesentinel.com"
    }
  },
  {
    "title": "Here's what to know about the $50 billion states are getting for rural health - NPR",
    "description": "Here's what to know about the $50 billion states are getting for rural health  NPRState Health Dept. Outlines Spending of $402M Federal Rural Health Grant  kotaradio.comReluctant Republicans bless Trump-backed health stimulus; $189M headed to rural S.D.  thedakotascout.comCounty to seek rural health funding  boulder-monitor.comInside Maryland’s High-Stakes Bid for Trump’s $50 Billion Rural Health Fund  Tradeoffs",
    "published date": "Wed, 28 Jan 2026 15:47:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQk5EVXAweHpJanBKendlcU1BZWxNYXB6ZUd5cDRpeXZVLTI1VWN6RnV0amdMUk9ISUVaTGVFRjd4eklwWkJVOGZaTElvalo5Tm1MSi1FMDVJMnZxLTA3S25FeDVjWVBpWmYyOXV1TzU2Zmp1MGQweklRTHVLUXFOR016OVo3UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Details emerge about victims killed in private jet crash in Maine - CBS News",
    "description": "Details emerge about victims killed in private jet crash in Maine  CBS NewsLIVE: Bangor airport officials give update on Sunday plane crash  wabi.tvWell-known Texas attorney’s wife among victims of deadly private jet crash in Maine  foxnews.com5 on crashed plane named, but still no formal identification by officials  pressherald.comDelay evidently exceeded anti-ice limit in Challenger crash  AOPA",
    "published date": "Wed, 28 Jan 2026 14:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNaURGSGpqaktWMUdiano5azY3NkNLeHcyVWNpeG5MX2s4dXZvOHhuMU5zdTl6VVd6RG44cWlNY3hHRlh5NGxWWkswcXpwbUtGT1ZPRXNRM2tTVUlmVnV0T3d5aFJMU2ZaQ1BFV2htUU1kSFg1R3pEWk8yZW1nVkNxaFlB0gGHAUFVX3lxTE04RmJiUVpkOVhKRDVhWndrZ3RCZzhWUzEtZlJOX2U3SW9QU1ZtNkg1aHdtenVUV0xxWVIyQmQ3Yl8zRlIwWG5xZTdBRDlneXdBUXF1ZVFFNHZ2OTRPTEgwdmR1TEIwNkZsTktVNndxdEZmQlFUeF9DMmd5S2ljcmlEZU5IU3Nwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "How the Minneapolis killings look from Trump country - NPR",
    "description": "How the Minneapolis killings look from Trump country  NPRWhat Should Americans Do Now?  The AtlanticOpinion | ‘Kristi Noem Needs to Go.’ Three Columnists on ICE in Minneapolis.  The New York Times“The Homeland” Is War on America: The Blood-and-Soil Nationalism That Killed Renee Good and Alex Pretti  Vanity FairThe Fatal Shooting of Alex Pretti, and the Aftermath  The Dispatch",
    "published date": "Thu, 29 Jan 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOOWxOaU1YRGpfaS1JWVFHdnpTR3hnUGRQajFZRFlsa3NpVDZpWXFqWWZ2NUI2OC05M3B6SlpqRlZXVnVlRldjeG4xeUJGSE13cHFxaWp5U2V2MHJ0YTJGdmM3Rks3RDNoX3ZlM0Z1dUZ4aVVzRjJHWFBVb0hTVGxBMlJUV21FY25xbHNSRHNRa2dEdzdrQnlmMHQ5YWNCZzB6alJHelhQOEtYMzE4bkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  }
]