[
  {
    "title": "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately - AP News",
    "description": "Trump’s border czar is pulling 700 immigration officers out of Minnesota immediately  AP NewsTrump's 'border tsar' says 700 federal agents leaving Minnesota  BBCTrump says the lesson from Minneapolis is to use a \"softer touch\" in federal immigration enforcement  cbsnews.comTrump admin to withdraw 700 federal officers from Minnesota: Homan  CNBCTrump administration latest: DHS withdrawing 700 personnel from Minnesota  CNN",
    "published date": "Wed, 04 Feb 2026 21:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNd094S2hfeUdZWTFsMkRTZjh0LVhSZDQzVi11STZYT2g5WEdKQ1AxdnQyekhkQmRycXlDV2EwOXFMazZtV3FOQWFuUTRwZUZVRktsRjZzSmdydDBEQzJOSFlzX0VqZS1rWmdFaUNDU0JpWUVPcnlWRF8yaE1MRjBCdXVfVW83WE1mSzZHdHd0RlBuRzU0am5TME5OQVN2OGxTajNFMlY5Q25nZ3lP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Ryan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence - The New York Times",
    "description": "Ryan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesMan sentenced to life in prison for 2024 attempt on Trump's life  BBCRyan Routh sentenced to life in prison for Trump golf course assassination attempt  NBC NewsAttempted Trump assassin Ryan Routh sentenced to life in prison  ABC NewsCongress faces tight deadline to fund DHS. And, Ryan Routh faces sentencing  NPR",
    "published date": "Wed, 04 Feb 2026 21:32:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQa3lYVWQ1d2RFUXVQcFp6OEVaNV9uTnl4Z0VsU18xSUxTamNrRXdoeHNDaThpWmo0S0hkRU1BNTdob1dKdHljd3VIOGwwVFpXWS1JZkdwQ2d4TzIwLUY1ZUNQbXVMdmQ0ZE5ES3F6Mm1SWVUtRmNHQTlfQXpleWs1OWhPYmFJX0plaGFvajlWTkdvcW9D?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Search for Nancy Guthrie, mother of 'Today' show host Savannah Guthrie, enters 4th day - NPR",
    "description": "Search for Nancy Guthrie, mother of 'Today' show host Savannah Guthrie, enters 4th day  NPRSheriff probes possible ransom notes in Nancy Guthrie’s disappearance, while pacemaker data could speak to timeline  CNNTrump spoke to Savannah Guthrie as search for her mother continues  NBC NewsSheriff says ransom note being investigated in disappearance of Nancy Guthrie, Savannah Guthrie's mother  cbsnews.comMystery of Guthrie’s Mother Has Nation Fixated on a Desert Subdivision  The New York Times",
    "published date": "Wed, 04 Feb 2026 16:33:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxORy1EVDNvMnkwdDZ6cEVtUEZIS3JoMUh5ODhfdVdSM190WGR4WU9aVGhiQXpZamZkWFN5RmtPUy11a25ScWNDSHk2ZXpwdlhHNFlHZ1J0WE9maGNXQV9FcDRiZW4zUTdZbVVYU0YxNkVsbVVybkdiNmdSV1pYUlFPMDdjaFF1SUo5OEhfOThqcFk4Umc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘This job sucks’: Government lawyers, drowning in immigration cases, have had it - Politico",
    "description": "‘This job sucks’: Government lawyers, drowning in immigration cases, have had it  PoliticoProsecutor Fired After Voicing Frustration With Immigration Caseload  The New York Times'This job sucks,' DHS lawyer says in court hearing over ICE's response to judicial orders  ABC NewsTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  CNNICE attorney to judge: ‘This job sucks’  MPR News",
    "published date": "Wed, 04 Feb 2026 20:16:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNnBsbVlTQVg4R2haY3BTOTZlNjZrWldQSkF0clRQZnZTSlNuZDFJcElWay1nVmRnZFgxVzJFVHEydkM3b0hTeDBuLTlJLUpaN3kwOXdxUUhqTlhYNEVyWnR5UmhCdjR1cUpfeGdTVmhyVUwyZ1FBZVpqNHI3SHNwVW9fTFRvbXRxZ1dHamV1UWNYVTBwRUxwQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Educators Sue to Keep Immigration Agents From Schools and Bus Stops - The New York Times",
    "description": "Educators Sue to Keep Immigration Agents From Schools and Bus Stops  The New York TimesWhat the Crackdown Has Done to Minneapolis Children  The New York TimesMinnesota teachers sue to keep ICE off school property  The Washington PostWalz demands DHS stop detaining Minnesota children  Star TribuneAt least 23 parents detained by ICE at one Columbia Heights school alone says superintendent  MPR News",
    "published date": "Wed, 04 Feb 2026 18:45:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOOUVsUUM5WmRYQUpSRmJOQk5FcC1FRTZ6cHZ6ck5kOUZGdVZKNXk4YkUxWFROUVlFYzdQWGVrMWRzcFU2UVowQkdwNzNkZnA2dV9uSlNsb003QzhkOGJFNkQyZ1pVS0c0ZWhWRThMYmxJWjZvcGVQNTBUVnFya1RadXRLdEVKS2FZTjNoRXJ4NFIyNHd2UFNxZ0lXTTVNQ1JWbGtid09RN1ZLNDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Steve Bannon calls for immigration agents at polling sites during midterms - The Guardian",
    "description": "Steve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketMAGA Architect Comes Clean on Election Campaign for Midterms  The Daily BeastBannon urges ICE to surround polls in November, as election federalization debate grows  KOMOSteve Bannon calls for Trump to deploy ICE and military troops to polling sites  Politico",
    "published date": "Wed, 04 Feb 2026 18:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSnd5eG1SZ1RycTZmS0wzbHlFTG53LW45cGtDbW93RU8tNHpZQU1oTDdEeERnSTVZN3g3UEo0TWtYZG5rZHp0RDdXRm5OMHRmazgyTlZOVlliWXEzSmotX3ItbzAzVV9ZV1FTYmdScFc3Z0VGeGRTUWd3cDFFQXdEcW1TOU9ESE5aQWJhUVkwY0UwWjFnRnhSNXllVW5fbEVmZVlyNlBraTFTSkFZOTNZNU5WNXI4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Nike facing federal probe of alleged discrimination against white employees - Axios",
    "description": "Nike facing federal probe of alleged discrimination against white employees  AxiosFederal Agency Investigates Nike for Discrimination Against White Workers  The New York TimesTrump administration alleges Nike discriminated against white workers  NBC NewsFederal agency probes Nike over alleged discrimination against White employees  CNNNike Facing EEOC Probe Over Alleged Bias Against White Workers  Bloomberg",
    "published date": "Wed, 04 Feb 2026 18:53:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9tcDNVa2ZPcW4tU0hWVV9GM1M3ZGlndVhseTdlc3VwQmgtZi1yQWtHbUp6SGZVTzBXbTh6bEIzUXp3cDZKLVRNS3dGTnFWQ0laXzBOOVdPaUw4eEZtY281QnpneVlVbDUybVo5T3Y4cWl6dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Supreme Court clears way for California voting map that bolsters Democrats - The Washington Post",
    "description": "Supreme Court clears way for California voting map that bolsters Democrats  The Washington PostSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court lets California use new Democrat-friendly congressional map  CNNSupreme Court leaves California’s Prop 50 maps in place for 2026 midterms  San Francisco ChronicleThrow everything at the wall, see what sticks  Politico",
    "published date": "Wed, 04 Feb 2026 21:09:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQLUpZalhQUzRRdnVOQ3gxVS1obVdjR1B0Y0YtOUJBajFHVXVlUFdZZUtmT2J5TExqLWVWWHRkbEJIWUVsRTM1VkQzbGRLY3c0Z1VwOXdZLWFrWkQ5a3RhM01FdVozV2xBTmJ6V1JMNEhaLWpESFJxbWc5Y2g0andEVm84aWE4c3FMU1I2blhFQ0JtRENDaHcyc3BB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Democrats demand 'dramatic changes' for ICE, including masks, cameras and judicial warrants - AP News",
    "description": "Democrats demand 'dramatic changes' for ICE, including masks, cameras and judicial warrants  AP NewsTrump Live Updates: Homan Plans to Pull 700 Immigration Agents From Minnesota  The New York TimesDemocrats say ‘dramatic changes’ needed for immigration enforcement as DHS funding negotiations continue – live  The GuardianProspects for ICE deal sour on Capitol Hill as shutdown deadline nears for critical agency  CNNOpinion | This good compromise would rein in ICE without undermining its core job  The Washington Post",
    "published date": "Wed, 04 Feb 2026 18:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPNmcxZzNtQWxuUUJGaW10YWxyU0V5UXJINEpkczZkNmVuUEJVY1pod2Njam9rNnpPMlpsZ3Z6aUpEWTdDRDlKUUZ5Ml9CcGNvMUxDNC14ZkRHc1QyQlBmSlprZDJkcC1LaHZ3UVpOMVhKcGI0bGhIaTZDeDRFN1hnME55YzBWanBxLTZnbzZHR1RYcnh3NFFWOFAwQUFJSDlVMEdGOXliUENtWFNPX1RabUJ0UTA1emY2RU1xOURpMGJ0Vk1y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Maxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained - CNN",
    "description": "Maxine Waters’ ‘Can you shut him up’ moment with Scott Bessent, explained  CNN'Can you shut him up?:' Waters and Treasury's Bessent clash over Trump's economic agenda  Fox NewsTreasury Secy. Bessent Testifies on U.S. Economy  C-SPANDemocrats grill Bessent at House oversight hearing: 'Stop covering for the president'  CNBCBessent Says Fed Lacks Accountability and Has Lost Public Trust  The New York Times",
    "published date": "Wed, 04 Feb 2026 18:05:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOZnA3ZlFNMUFjYUUzZThDUDM0RGtYUjdsbVdtZWxKbWtwZEpTSERzQzdiUWk5amhsUGFoWldfVnE1MVlOSWZrVEtZRy04d2tueDBucXY5WGo2aUQtMldQNUt2UGk0dkZYcVlRZzg4ZFJMTFpJQWpPRkZaQ1A0ckU0b0wyd1Z5Y3dpOUdtajNJNWk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Doberman named Penny takes Westminster’s best in show as Catherine O’Hara honored - The Guardian",
    "description": "Doberman named Penny takes Westminster’s best in show as Catherine O’Hara honored  The GuardianWestminster Dog Show 2026: Behind-the-Scenes Photos  The New York TimesDoberman Penny Claims Best In Show At Historic 150th Westminster Dog Show  YahooDoberman pinscher named Penny wins best in show at Westminster  ESPNThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The Guardian",
    "published date": "Wed, 04 Feb 2026 16:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOc0VLQXAyTWJpbGZMUTExTkQtdzh5aW8wcy1hYWJpMjQ5ZGxPT3BTU0hkSzVsM18xdjZpazZxNDZpY20wZXBjNnBKYkp3cmJQclVoUXk0d25YUGJMeS1mbHYwdXdobEphR19WZUxmdEdtM3VtWFZkLWZDenhJU3VfM3VYcnBwRFJLUF9uOEJJbzZoaVlQd3RWR2ZzcHRySE9zY24tSHE3S2hLeUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Iran Plays Hardball With the U.S. to Throw It Off Balance - The Wall Street Journal",
    "description": "Iran Plays Hardball With the U.S. to Throw It Off Balance  The Wall Street JournalU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosIran’s president seeks ‘fair and equitable’ negotiations, while US shoots down drone  AP NewsMediators propose framework for crucial Iran-US talks this week  Al JazeeraUS and Iran talks brought back from the brink after US relents on move to Oman  The Guardian",
    "published date": "Wed, 04 Feb 2026 17:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNFlTcW1KSHVrb2FvVXhhWmIySTlRZVFyN0JPYXlvVTl2VHR2U044SmFnR090OUhIWHRoS1pDSFRxUDRwS1pENlJ1NXMtZzgtVXZBN1hhSnlEYU52Zmo0dndiY2tPZnF1U1NiSzFvQlhnOE9xbG9oOUN2Z1JSbHl3aENtMlo0eDVaMEFsaDhQQnFtemFHWk14cDlFTkZVZXhLMVlWQlVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Lee H. Hamilton, a Foreign Policy Power in Congress, Dies at 94 - The New York Times",
    "description": "Lee H. Hamilton, a Foreign Policy Power in Congress, Dies at 94  The New York TimesFormer Indiana Rep. Lee Hamilton, leader of Sept. 11 panel, dies  PoliticoFormer Indiana Congressman Lee Hamilton dies at 94 after years of public service  WDRBFormer Indiana Congressman dies; flags directed to half-staff  WANE 15Argentina requests extradition of Maduro from the US on crimes against humanity charges  The Derrick",
    "published date": "Wed, 04 Feb 2026 15:29:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE92OGFQSHpsbWFfVHZZM1hxQUVjSkpDT3ktVExUNWRUMDdLOEFBSWEyZEhSRWgzdENKUnZ1bEJwMzNWV044aFlxbEZtWjRySE1JcUJDVGVBcE5iRTBvS0RlYWo4R2hMM09JMk55MGdrMEhSS2RhamVXYUROdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Fears of new arms race as US-Russia nuclear weapons treaty due to expire - BBC",
    "description": "Fears of new arms race as US-Russia nuclear weapons treaty due to expire  BBCA key nuclear weapons treaty is ending. It’s a blow to Russia’s ‘superpower’ myth  CNNTrump prepares to let go of arms control with Russia  PoliticoRussia criticises US as final nuclear warhead treaty set to expire  Al JazeeraDeath of New START heralds \"a world with more nuclear risk\"  Axios",
    "published date": "Wed, 04 Feb 2026 18:39:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBwTk95Wm0wM2RqNThES3c5NWpidTUtM2FMamFxajk1bnNTNXFwbExpR3lvMnNFR3NjLUFjSllZMkZtNDg1TkxoSGRmTXd4SV80MlZOaU9lVzVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US wants to create a critical minerals trading bloc with its allies to counter China - AP News",
    "description": "US wants to create a critical minerals trading bloc with its allies to counter China  AP NewsU.S. plans critical mineral price floors with Mexico, EU and Japan  CNBCTrump Administration to Create $12 Billion Rare-Earth Stockpile to Counter China  The Wall Street JournalWATCH: Rubio holds news conference at State Department critical minerals summit  PBSTrump’s Greenland gambit could undermine critical minerals meeting  Politico",
    "published date": "Wed, 04 Feb 2026 18:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPMjVwN01mTTZFaFZudGpQRWZHYnI4dWdIclRnc0pCc3cyY1c2Q0UwWEowWXJOdGJzazlDckctTklLZTZxUjFuRzlKQ2tTdjlvQm52cjM1M3p6d1ZPa09ZZ1V6ZHV5dGJwNGtJb1R0TmE0MHIyN2MwdnFQM3U5dGdXRGhJSWduWXRXMjRTMzZxdWM5bG9hemNzV0daVWJhV0dKVFoxUGFZNXNET0g2TFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Fulton County files motion seeking return of seized 2020 ballots, spokesperson says - ABC News",
    "description": "Fulton County files motion seeking return of seized 2020 ballots, spokesperson says  ABC NewsWhat is happening in Fulton county is a warning to America | Jamil Smith  The GuardianFulton County in Georgia Challenges the F.B.I.’s Seizure of 2020 Ballots  The New York TimesThe Trump team can’t get its story straight on the president, Gabbard and Fulton County  CNNGabbard says Trump asked her to attend FBI raid at Georgia elections hub  Axios",
    "published date": "Wed, 04 Feb 2026 17:24:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSmxDUHNUem9RVHlRcWxZUEQ3OUc2R2NPWTRWV0ZPbzNqMGl1VWVyRmR5VjNNMzNNZEF4TmhYR2p3RHd0MWxEM21hR2hlWk9fSXgtVkN3V1BZRkE0VTFGVnhPR2FkSzNsMEgyak5fRDQzSmdpUmgzSDlNSUc5b3JvRVNDX3lZdWNzb1paWmJkdVVUMEdSYk4wQ245WlJhdDjSAaQBQVVfeXFMT1J6SHZFVk9PSWpsallIWjZWMmpEY21NQlRSN0NlNmdBakEzYV9mWHJ3cWw1ZnM2cXRTaWxqSXZXazllQWJXdl9FV3NLMDg2UmNUNnVLNXN1ZHZPRVpuRm5jMElsQ1lWblpDQXV6cEhuUXNqR21CVnBLcnY1ZVJ2eHRWcm5SZ3MxZG9sWU1yN2ZxajRrRDlpT1pYMXVfVVNOdEFGeVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm - The New York Times",
    "description": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  CNNTrump suggests Republicans should nationalize voting. Here's what to know.  cbsnews.comTrump’s New Threats to American Elections  The AtlanticCalifornia leaders decry Trump call to ‘nationalize’ election, say they’re ready to resist  Los Angeles Times",
    "published date": "Wed, 04 Feb 2026 21:02:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOakM4RDB5eU1VUzc2NUpSQW9RMTJpaEx2R3BhWUtCTlhtd3NRVFZjVzFKdWJ1eGNLMXMybktzVFVYSlhHa2FUTkZ5M0xCb2dSelQwenl1dmJNdDB1elJPNkxtWlJSLURhdFV0Q2hySkpiM191aW1POEJ3YXJ1WFhLbjBjUDdicTJaT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "More departures at the US attorney’s office in Minnesota, AP sources say - AP News",
    "description": "More departures at the US attorney’s office in Minnesota, AP sources say  AP NewsWith latest Minnesota fraud case looming, the lead prosecutors have quit  cbsnews.comAnother wave of departures in Minnesota’s U.S. Attorney’s Office  Star TribuneMinnesota fraud cases at risk amid US Attorney exodus  5 EYEWITNESS NEWSMore prosecutors leaving MN US Attorney's Office over frustrations: Report  FOX 9 Minneapolis-St. Paul",
    "published date": "Tue, 03 Feb 2026 15:50:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQcnhDNTJ4TXRFRi1FalMycW5GenAyandMS1J5a1owbUt6T0ZZZEJ3VHVZLW9rOTFHWWRoWk1xOWF3UG5WN2JsaGVFcl83aU9mM3I2SVJUZUxralVsMHJoVDV5NFBXckJ5bDF4WGFKeVRtY3FnOUxKaFJSMWE1SkNhaUhhbzRKVWgwTFJZWnk1UW5MdExDYm94cDBqWXJUaXViOW1J?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "New York’s Kathy Hochul forms first women-led ticket, selecting Adrienne Adams as her running mate - Politico",
    "description": "New York’s Kathy Hochul forms first women-led ticket, selecting Adrienne Adams as her running mate  PoliticoHochul’s LG pick is… still a mystery  City & State New YorkHochul Chooses Adrienne Adams to Join Her Re-election Ticket  The New York TimesNY Gov. Kathy Hochul picks Adrienne Adams as her running mate  GothamistHochul picks new running mate, as her current No. 2 makes bid for NY governor  Syracuse.com",
    "published date": "Wed, 04 Feb 2026 17:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOWXRDMU9MT1B5OERuQnBMdHNyUHNvNzIwR2o0R3Zuc0xndHJnNEkwelBUNkFGUGJPZF92MUdSbGZlMjBJQ0I0Ym9zMU5aREVLcVNPUW9OVXU2aVpIejJIQThRRUZmTUdzV1JVN1I2YXFCcW04S0VVU25RU1VMNUNHTWQtUWtIOVFYSmx2d3pHLS00SGJiUC10NHYwYk9lUmxNODFiRTlEU2llZjViOGwwa0JsTDh6bzI1SUdmdjRiNWo3NVRieXhhV0VHaXBYdEoxbl9OU2ZYU3pGamhkMHU4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win - Politico",
    "description": "Choppier seas await Mamdani-backed candidates after Diana Moreno's landslide win  PoliticoDiana Moreno’s Assembly win marks first electoral victory for Mamdani as mayor  City & State New YorkQueens voters pick Mamdani's successor — plus two other New York special election results  Crain's New York BusinessSpecial NYC elections 2026: Diana Moreno wins in Mamdani's Queens district  Spectrum News NY1‘Welcome to the People’s Republic of Astoria’: Diana Moreno cruises to victory in AD 36 special election to fill Mamdani’s old seat  qns.com",
    "published date": "Wed, 04 Feb 2026 15:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVWtTZm9HRGZ0Nzg2RjNsYTRHVFZEZk1ka3k1bTF2cjlycFk2LW4tYmluaFlaT2JWYXJuWFRoNHVXUEI2RkZZY0NwS2VhYzNETVQ3eDlfc2pIQ2x5RHFHckw2WVFPY2lRZ2ZnbWpGRVVrQzEycUxzMGNBS001czBxdzJSTWJpOElKeHZ0RmxrSkMtZW9KdDJEZkpfTTRTTE1DdE5qYzVhRjhIWmtlUzFiblpfYjU1YkxoaFQ3aFp4RURfMWUzenJPbQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack - ABC News",
    "description": "Trilateral US-Ukraine-Russia peace talks resume in UAE after major energy attack  ABC NewsRussia and Ukraine Resume Talks After a Huge Attack by Moscow  The New York TimesIs Putin ready for peace? Abu Dhabi talks will tell.  politico.euU.S. joins new round of talks with Ukraine and Russia, but Ukrainians skeptical of any major breakthrough  cbsnews.comUkraine and Russia begin second round of US-led peace talks in Abu Dhabi  The Guardian",
    "published date": "Wed, 04 Feb 2026 15:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQaC1waW83RTBwbmllVnRjcmlOb25zRUowZGw5ZW5MWkh1Q3JYeDdfbU4xaDJJUW9fMzFma0JTUHlwNERMTTQ1cGw1UmI3WndJSGVEWFFVb0UyQ2hDZ0VSZmk5THZXaUNyczliT2J6Z0lnRlVSM2U0UWZzWW5RanZGTDBSbG9mTkxjZVVxTHZMV2xJNTBHNHVKdnZ3WE90LVJrSjl6am1NdWlGam_SAbABQVVfeXFMUFpBMlpMTE1lTGZDMGk0R1pwNDhuNWVrNjN1MllMakhhck16YkItcXQ0TGtlRkJ3dkc4VlZwVTJNdktZSlM1VE8wRWRZLXJ1eXN0YTN5c0JLN2FDajk1akliSVcyVVZNelR5WFU3dFlKUVRrQjkyRDRjWE1zNUxESkZDV2Z1bUxGYTdIcjIyZnRtSGU0S0t5eGFtSVVEZzNtajM2YnFuY3dBZ0ZqOTRYQjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan - Democracy Docket",
    "description": "Virginia Supreme Court gets chance to revive Democrats’ redistricting plan  Democracy DocketWith General Assembly Democrats deadlocked on maps, Texas results pose a question: Does Virginia really need to redistrict?  Cardinal NewsSpanberger Admin Warns Virginia Dems Ultra-Blue Congressional Map Could Cause Logistical Nightmare  National ReviewVirginia Supreme Court will hear redistricting challenge  PoliticoNew Virginia AG seeks to join legal effort to support redistricting  The Washington Post",
    "published date": "Wed, 04 Feb 2026 16:50:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQdXNSTW9mN1J0RTAzN0JkREtGV1dZMmxaYlZwQ2lDRnlSaGRWcDdrS3FpYWdYWkpGUGluVnJPaGUzYnQxSEFtMG82Z25kMlZ2NjVWRDVFZ1M2OHVvcHRQMmVlQi1NRTJLX0tmeU1WMFZBbml2elI5T1ZEaXUzLWZJN0V2WTY1MnEtVVpmVjBFUjBMWTRJN0pRa0ljODNMUWpSMW1ocmhkeFFlazlpa1k1eFlRUTdiZ0NSZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.democracydocket.com",
      "title": "Democracy Docket"
    }
  },
  {
    "title": "Texas families can now apply for private school vouchers. Here’s what to know. - The Texas Tribune",
    "description": "Texas families can now apply for private school vouchers. Here’s what to know.  The Texas TribuneApplications open for Texas Education Freedom Accounts. Here’s what families need to know  Dallas NewsAfter years of debate, Texas' private school voucher application opens this week  ABC13 HoustonMAP: More than 500 Houston-area private schools approved for Texas voucher program  Click2HoustonWhat to know as applications for Texas’ education savings accounts open Feb. 4  Community Impact | News",
    "published date": "Wed, 04 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOWktSR2hCWGhiOUZoN0RSR0tRb0RwQmktWC1GNm1UQ3RVRFRMWVZuX2J5akRWN1NzaXpiWXpLbklHczJCSWNwN2o3NVB5eldXenFoS2hhYVBVbVNWWHk3dklCY1Aydl8xTDI1SW1HTnVEc0xLbngwTEQ0Sk0zLW5kbWd5R3dXTjcwd1paSjBZVm4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "House Votes To End 4-Day Government Shutdown - Forbes",
    "description": "House Votes To End 4-Day Government Shutdown  ForbesHouse Democrats help Mike Johnson end government shutdown, fund DHS and ICE  AxiosCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  PoliticoTrump signs funding bill to end shutdown after package clears House  cbsnews.comHow every House member voted on the shutdown and ICE funding  The Washington Post",
    "published date": "Tue, 03 Feb 2026 19:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQR0JvdEgtR04tS3pORFZyb0k1ZExaaFBuRkJtOVhHLTljQmVSeDh6WDdTV3BHdlQ1bXFublFhTVNyVU1GSUZlVXdKQkdaVnhoYU5oX3NaVVVQQ2RaZ0VMdG05MlNZZmhNdXNrMm1JMldGcDk1Umw4ejdGaXhqekdSNEJ6M1I5UWxtZ0RKMnMxMXh5Z0huRHJLdm9Oa0Jldk5FaG1HaHpnMDl3c1BYQWg4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "A judge eviscerates Kristi Noem in blocking deportation of Haitians: Today in Ohio - Cleveland.com",
    "description": "A judge eviscerates Kristi Noem in blocking deportation of Haitians: Today in Ohio  Cleveland.comOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesHaitians in U.S. live in fear amid court battle over legal status  PBSJudge Blocks Trump Administration From Ending Legal Protections for Haitians  The Wall Street JournalFederal judge postpones Trump administration's termination of TPS for Haitians  NBC News",
    "published date": "Tue, 03 Feb 2026 15:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNNFN6ellhc0psdDFpTkZGN193b0xRZjF5QW1oRU9uZFEtbTVVTWJPaWMxd3E0by02SDBGLWliWTl6WGI0QzU2T3pLWFptQ0VtYmhLQ2ZVWG80MFRGSk9JbEtQWm1BNDBXd1FyZDNQUVhhdnNGcFAxcmVfX01xcW01ekRsRGRlWUdJUzFoU3FObVp3Y1Y4b0Zadm9lOUhVa2c3Nkc4bzhCUE96ZkZXS0ZEZjIwTFBydmx3RXk0bFk1eXZMeUHSAdcBQVVfeXFMT1lxdjg3SVVZWkRXS1FySHVQUWgtN0liWi1CaWRqNXBwcHdrYnJLR2RuOVQxMjJBQi1JOWlxRUFEQkd2MDExSnBfcW1oeVlvTGxZMU1QUVlOLWtZaHdRdjRCdVJRTDBTX1ljcjVzV2V0YnpnRWhaUDRabmNfdlN4YV9qblBFeTd6aFNRcFk3NWNXWkhEdFpsNlVnYkpFeEx2RWtTWVQyelVMRm04MDR5LXJzVXBabWxSZkpWVVhsSDlkZUU4Z3hpUDZBQUY4STF6T1hUU2dYOUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "‘Our family feels deep distress’: Renee Good’s brothers plead for Democrats’ help at hearing - The Guardian",
    "description": "‘Our family feels deep distress’: Renee Good’s brothers plead for Democrats’ help at hearing  The GuardianRenee Good’s Brothers Call on Congress to Rein In Immigration Crackdown  The New York TimesRenee Good's brothers and a woman shot five times by CBP decry DHS' tactics  NBC NewsSeveral of these Americans experienced aggressive encounters with Trump’s DHS. Now, they’re telling their stories  CNNRenee Macklin Good's brothers, others call for ICE reforms at public forum  MPR News",
    "published date": "Wed, 04 Feb 2026 02:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZTZ1MXpMaER4QjlpXzZkbThPSmxseldodjFCQ04teEpDa19Ua182ZGE3Zmx6U20yc2UxenFwVzBmYzU3ZUZXQUxSVDFzYVFFSlJSVlpfdXQ0aGtFMjJHWWtuMUNLT184WXAzT1dfbnNXOU1SbmZZQ0l0SjNmbkoxdEpkd1hwUGw5dzlpSm9YX0RNMkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed - Quinnipiac University Poll",
    "description": "61% Of Voters Think The Trump Administration Has Not Given An Honest Account Of The Fatal Shooting Of Alex Pretti, Quinnipiac University National Poll Finds; 58% Of Voters Think DHS Secretary Kristi Noem Should Be Removed  Quinnipiac University PollMost Americans support independent investigation into Alex Pretti shooting  AxiosTwo new polls show how Alex Pretti’s killing made the Minneapolis crackdown untenable  CNNSupport for immigration rises, Trump approval rebounds, Iran, the Super Bowl, and the Olympics: January 30 - February 2, 2026 Economist/YouGov Poll  YouGovMore Americans Say Immigration Makes US ‘Better Off’ in 15% Swing: Poll  Newsweek",
    "published date": "Wed, 04 Feb 2026 18:56:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBhWU1ibUFWZmkwZFozSlpXNUlCZE5QSEZka2JUVG92dGJENGVUMlNRRnppejB1d3h1QlFMbEU5NGRaR2pWR1lhTzljZ1BkTm10M0Q0UTVFaGJJcWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://poll.qu.edu",
      "title": "Quinnipiac University Poll"
    }
  },
  {
    "title": "U.S. shoots down Iranian Shahed-139 drone that approached USS Abraham Lincoln aircraft carrier, military says - cbsnews.com",
    "description": "U.S. shoots down Iranian Shahed-139 drone that approached USS Abraham Lincoln aircraft carrier, military says  cbsnews.comUS carrier shoots down Iranian drone as tensions escalate and diplomatic talks hit a snag  CNNIranian media claims drone shot down by US was conducting surveillance in a 'routine and lawful mission'  Fox NewsTrump says talks with Iran continuing as US shoots down an Iranian drone  Al JazeeraIran risks Trump's ire with new diplomatic demands, provocations  Axios",
    "published date": "Tue, 03 Feb 2026 18:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORjdMeU5TSmstSVJSU3U1VDlqRmdOc0lkeXJKdlM4ZGU0VjhrQ210ekkzUmYyS2VuN0xRb3JDa1FLQUtWdW5tRVRIZVFNem1qWU5PMHNZZzJpLWJROEhPMUNhRjBUQXpzOVc3cGhDamx3WFhxdG02bGt6VUVPNlM0Qkw3NnBialc4R1Q3YUd5MHpqWXJraG9ET1dycTZNTUxXSnNxVG1R0gGrAUFVX3lxTE41U0J6WjJPdHl5cVczYU84ZFFvaXQzTEl2aktZdng2bUVOQm9HRHlxaVRheFhQM1Y4ZFhBaHdlTHpHU1dIbFNXOElCdkt1UGFfTHJ0V0VmRG9QSEQ5TTVJN1JhTml0dENMMmJrQ1E2M0c4UFItM1dOQzNWR3lMUXhYYlYwWXM4dThNd3JGWUp6d20xNGpTa2E2WkZwSFNZYks3NXR3a3I0Ri1PTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Judge limits federal officers’ use of crowd control munitions at Portland ICE building - Oregon Public Broadcasting - OPB",
    "description": "Judge limits federal officers’ use of crowd control munitions at Portland ICE building  Oregon Public Broadcasting - OPB‘It is brutal’: Portland couple captures video of chemical munitions deployed at Saturday protest  KPTVJudge temporarily bans use of tear gas at protests near Portland ICE office  The Washington PostResidents, protesters speak out after gas deployed at Portland ICE facility  KATU‘Joyful’ bike ride turned terrible as Trump thugs tear-gassed innocent marchers  BikePortland",
    "published date": "Wed, 04 Feb 2026 03:02:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQT1hxejNMUnpvOVBjNkxSUGs2ZHBtRUN2M1FFdUJrcDFUX1I3UGU1X05jcTdvcUZJX1F6MTZ3NUV2cVROZWtKUHRwV2RLc0Z2TklKRHZ2ZjZMeDJBb3AyNXBGejNhWnFobmZjRVRpNHVsUmlBNENxTTBUM05jVXNPR1l5OWRoMFBuOVNMY2czU1VfTHpyZ2duNE8wSEVxcnlIalYySVpKTXU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.opb.org",
      "title": "Oregon Public Broadcasting - OPB"
    }
  },
  {
    "title": "WA millionaire tax would bypass voters, but Ferguson won’t support it yet - MyNorthwest.com",
    "description": "WA millionaire tax would bypass voters, but Ferguson won’t support it yet  MyNorthwest.comWA Dems’ pitch for ‘generational’ tax reform kind of stinks  The Seattle Times'Millionaires Tax' officially proposed in Washington state  king5.comWA Democrats’ ‘millionaires tax’ is here, but Ferguson doesn’t support it yet  KUOWIncome tax debate opens up in WA Legislature  Washington State Standard",
    "published date": "Tue, 03 Feb 2026 20:13:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE94V1YwNXFZVTMzTWlqRmxCenNuMVo2UVZQMHdya25xQlNMUXRHYkxsYUJvcnBjWUszSklYT1Ywekxfb2lQYVp0cU83bjJ1bDg0bE1KRkRzYkVJdV8tbUJReEtBWVc0ZlpDUEpGMmVEcVJnNFpad0VOLUIySkkxWWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mynorthwest.com",
      "title": "MyNorthwest.com"
    }
  },
  {
    "title": "New Jersey special election will test the sway of Democrats' machine politics: From the Politics Desk - NBC News",
    "description": "New Jersey special election will test the sway of Democrats' machine politics: From the Politics Desk  NBC NewsAP Decision Notes: What to expect in New Jersey’s special congressional primary  AP NewsEarly voting underway in the primary for NJ Gov. Mikie Sherrill's former House seat  WNYCA Mamdani-Style Candidate Looks to Win Over New Jersey’s Suburbs  BloombergOutside groups pour millions into NJ special election  New Jersey Monitor",
    "published date": "Tue, 03 Feb 2026 22:32:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNV3pWdW5NQmI2RmRTck5mSUo1cU83OXVVcVlIQld0RWo5MjAxWWo5QXNRSkFyNWYzS3lkLUdXTmN0aEd0M0cyMkVpTVZLT3dTWi1IMVZmZGRfYkJZSWZjRnVGMnUxRVJlVmRYU05ISDRTOWlUUDNfcDBWU1dSNTEtUjg0Sk1aS2oySmszb1lRNGlsS3hLQzJ1SUJsVTFyaGJyRzBRVk5nanJ2T1U0Ni1GSE9vWGlHa01QNnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Epstein files reveal close ties to Trump's influential inner circle - PBS",
    "description": "Epstein files reveal close ties to Trump's influential inner circle  PBSTrump says America should move on from Epstein - it may not be that easy  BBCThere are many famous names in the Epstein files  CNNThe Government Published Dozens of Nude Photos in the Epstein Files  The New York TimesZimbabwe's Mugabe latest former African leader to be mentioned in Epstein files  BBC",
    "published date": "Tue, 03 Feb 2026 16:34:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPTTlFSlh1Q0FGMEFUeEFWdjFkRDE0aE5JVlZnZUUybUt6bFlkWE5UOHgybjljbEY2aDA0ZFpBdzF0dkl6X1VJeVVNRTJmUXNzbmt1ZWdkdkpONUtnS3kxenNMcWx0NjFQNWotZ2lwb3VLRmpwUTFDZkdyQjhYY0hfbGxDcS1PNVFCSXAtOGJyMF9jaVU0Ul9RUVdfelJmZ1V0MVpvMG9Wc9IBrAFBVV95cUxPS2otdnVXM0hrak8tZ2s1Rkl3bzFMcndCMjd4MTVHNkVtdWVXVFhMNDNaZm1HYUV5eDlWZEMxUDJOTnlSc2s4TFkxamVhSlZwcFdRSWVoaDFEektodHlPQ3h1aWRDUVRtdlpzQWZUYmRVR01KWkxwbEJ2UzBzbHhwUUlYdk5ZYWkzVlU4ZDhfZU5qZzhJWnhrYzQ4WDFObzRzQ3ZWV3FaNWl5UE5o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Texas Education Agency warns districts of potential state takeovers for “encouraging” student protests - The Texas Tribune",
    "description": "Texas Education Agency warns districts of potential state takeovers for “encouraging” student protests  The Texas TribuneKyle police arrest 2 juveniles during school walkout, clarify charges unrelated to protest  KVUEAbbott threatens to strip schools' funding after student anti-ICE walkouts, arrests at protest  FOX 7 AustinTEA releases guidelines for school systems after recent student-led walkouts  KXAN AustinAG demands information from Austin ISD after anti-ICE student walkouts  Austin American-Statesman",
    "published date": "Wed, 04 Feb 2026 01:11:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQQ0JCaWpoNmVHQWprWERzU3ZtLVNMNjFYVnZfVlVkMy1OcS1fQ3VROE1DM2FzRUZ1X205NEFacWNVVk9BNFpoVzdlTllSUUR4M3ljOVFtQmxFNmtZeWVaMkdHSWtMZXFKNVBLZHpMSElhTDVuZ2FCQ1JYa2d0VHEyemVmTmp6Z3g0ZFo2SHdkLTUxZzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.texastribune.org",
      "title": "The Texas Tribune"
    }
  },
  {
    "title": "Texas Democrat who flipped reliably red district says people are 'tired of campaigns of outrage' - ABC News",
    "description": "Texas Democrat who flipped reliably red district says people are 'tired of campaigns of outrage'  ABC NewsRepublicans are freaking out about Hispanic voters after a Texas upset  PoliticoA Democrat flipped a state Senate seat in Texas. Republicans say it’s a ‘wake-up call’ for the midterms  CNNWhat a Democratic upset that sent 'shockwaves' through the Texas GOP could mean for November  KUTOpinion | How a Conservative Texas District Rejected the Politics of Division  The New York Times",
    "published date": "Tue, 03 Feb 2026 23:17:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMnE4V1ZwZHc3NXdxVE9YWkRBaHpPLVBFZ1o2UEticnJsZGVZejM0dGwtT1hYcHhwUFZrcUxnTnoyVW9kV2p0eFd1dFl4ZUl4aURhTXVHMjZSQ1BFSjhOZmhudDFaVFlGOXIyQTI3RldHUXZXQzB4cEs2bmQyWWNVaUZpT3ViRGpic2JUNnJZbkxDTVF3eEN0cEE4aXBkOF9ROUJETGZsUjI1RUVq0gGyAUFVX3lxTFAzTUttamxidzBJbks3dF9oc1pMWnljUmJtV0tWVXZUYU1FN2Z3NTcwd1ByajU1N29Db0FsSjQ3VlJUOU5GN1JFNXFSOUl4RE9MbjNJUy10U0RiTzZMODZCSzR3SjROYXZZZ0RXYV9KZkZlVkZWVE5rMzI4WWZwSGxjay1GWm9pcUxEb2Y0RkgyMlM1R1k4bG05RFZXbDVzalljOWJFUFVRS1FnNUFCeVhQMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Jill Biden’s Ex-Husband Charged With Murder Of Wife In Delaware - Forbes",
    "description": "Jill Biden’s Ex-Husband Charged With Murder Of Wife In Delaware  ForbesWilliam Stevenson, Jill Biden’s Ex-Husband, Is Accused of Killing His Current Wife  The New York TimesBill Stevenson Called Wife Linda 'the Greatest Thing in My Life' as He Reflected on Jill Biden Divorce. Now Police Say He Killed Her  People.comWilliam Stevenson: Jill Biden’s ex-husband charged with murder in death of his current wife  CNNJill Biden's ex-husband arrested and charged with killing his current wife  NBC News",
    "published date": "Tue, 03 Feb 2026 17:55:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNQW5yeWhnX2JxeV9OYVNQTy1kWnhtVkpuZzA0Y3JNa3ZfaGNxLVoxb1c0VGFReTcwUUZSRVdCV0JZZFJlUkkySDJhd3NMV2dBQXVYRUtYTUNsWklkWHNETEYwYXBaRlpnSTlkMmktel8zUFRwZFM3Z3p2cUhheXhUbVdNRmE0LUY4UHNzeW00ZjRHZWlRdTRnZFE3MXZNSlFMVW9IUnI3azZ6UlY2djk4UkhCTzUtelVKSS1DMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Judge skeptical of Pentagon's efforts to punish Democratic Sen. Mark Kelly over \"illegal orders\" video - cbsnews.com",
    "description": "Judge skeptical of Pentagon's efforts to punish Democratic Sen. Mark Kelly over \"illegal orders\" video  cbsnews.comJudge presses DOJ lawyers for a precedent for Pentagon to punish Sen. Mark Kelly over video  ABC NewsDefense Dept. effort to punish Mark Kelly draws skepticism from judge  The Washington PostSenator Kelly to ask judge to block Trump's 'retribution' campaign  USA TodayJudge appears likely to rule in Sen. Mark Kelly's favor in suit over 'illegal orders' video  NBC News",
    "published date": "Tue, 03 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQSFlaWm1wX3VKRS1CVklIa2JYRE16Mzd2dDRoakpOMlFjZ1hsTWFuaGYyakdyOFBvN1QweEM2Y01OSFo5UDQtNjhWaHZkbTN4WlpDRkxYOG9BakdHWlMteHR1QV8zS3dvbTdzNDV6Z0U1UFplQ2FMTzJRako0Z0FKM25ZTmRsU0xLcnZkSmtMU0ZQUHh0a1AwMVZoR3o1bk9VTmVBUEg2U3p5OU8xYzdvX1Rrc9IBuAFBVV95cUxQUGtZWDg5TXVzTHVRZ0xCSnB2Y0pISUE0MUZPUXVEQmFmTE53Zl9fTi1BZkgwYm93cFZSdDhDMTlZVmNBZ1ZpTy1UOUh0cmFxNWN2ak9qMnM4dnF2YkY5UHB6X2gyNEJuNFhINnh0bHN2bmc5VDZSNXFKUGtqbHdoRUhBUXRDV0sxQ2k1M29FSW9lX2s3ZU5iS0VuV2N5Vnk2a0dkbi10aUxLLXVlN0otOGEwV1lyOTlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "‘This job sucks’: DOJ lawyer asks to be held in contempt so she can sleep after judge accuses ICE of blowing court orders - Yahoo News Canada",
    "description": "‘This job sucks’: DOJ lawyer asks to be held in contempt so she can sleep after judge accuses ICE of blowing court orders  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 10:49:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE54NHd1Ny1OTWYtbFN0WThrejJHWjJGczJmQjdDT21nd3ZNdWQ5alNQbzl0aHM2Zl96Z0x2bXVpVWpZbXg0UVlRZldYeGM3WGIwbEVfUDc5bGd0WVFxN0VtQWh6SXlwTnh0R0xCcnlSN0stWThY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Federal Crackdown Means Another Repair Job for the Minneapolis Police Chief - The New York Times",
    "description": "Federal Crackdown Means Another Repair Job for the Minneapolis Police Chief  The New York TimesLaw Enforcement Says ICE & DHS Are Making Policing Worse  The BulwarkMinneapolis police chiefs condemn ICE tactics | Opinion  Detroit Free PressEx-police chief Art Acevedo: ICE agents are poorly trained or supervised, acting unconstitutionally  Texas StandardICE and Border Patrol have undermined local policing with brutal tactics  Houston Chronicle",
    "published date": "Wed, 04 Feb 2026 10:02:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQWmhFV2hQYkUtQjNjSDY1S3Rfai1EWFE0OTFaeEFFMjZ1Nm5DVzdpN2Y5OGhjdFJxTzVxb2k2MV9QLXU5MnpBbU1PN0xpUlh3R3UtUzhoaVU2blJ4RHJuOUVFS1BVRUk2WlhhY3RFYlcwTkw5OFkzbVBWbVpoWVY4TTMyQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]