[
  {
    "title": "Patriots QB Drake Maye misses practice with illness, the latest hiccup to Super Bowl preparations - The Seattle Times",
    "description": "Patriots QB Drake Maye misses practice with illness, the latest hiccup to Super Bowl preparations  The Seattle TimesPatriots QB Maye misses practice with illness, Vrabel says  ESPNDrake Maye among the nine players Patriots list as questionable  NBC SportsNFL news roundup: Patriots QB Drake Maye (illness/right shoulder) sits out practice Friday  NFL.comPatriots' Drake Maye misses practice with injury, illness just 9 days before Super Bowl  Fox News",
    "published date": "Fri, 30 Jan 2026 19:52:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQXzE0U1BsZ3lrWmdFN0tqZ1ZjbmExeFp5UVhRT2NtM1BIMWJVOUxMa1FmUDBOVWphVUFpalhUTHNfVjQ4VHpGaUdlQl9tVUdqVmNkYUJEQ1NVOERGUGs2N2QxcTZhTG8yakstZ1hUeEhKOUc2TjV2bHdKSXBlMFhPNUZEb0FzTFdlQ2JKQXZjRzhNTTUtZUFCMHptQ0xLYVh0UUxfNXRQcGNTOURWTUJJNzRzZmQ0Z1A2cml1ZVJtUmtnRV9uZWx6ZlRFWFMtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Djokovic shocks Sinner in late-night thriller to reach Australian Open final - The Guardian",
    "description": "Djokovic shocks Sinner in late-night thriller to reach Australian Open final  The GuardianNovak Djokovic wins 5-set semifinal thriller over Jannik Sinner  ESPNCarlos Alcaraz and Novak Djokovic make Australian Open final after epic pair of semifinals  CNNSinner on painful Djokovic defeat: 'It hurts, for sure'  ATP TourNovak Djokovic stuns Jannik Sinner to reach Australian Open final against Carlos Alcaraz - The Athletic  The New York Times",
    "published date": "Fri, 30 Jan 2026 20:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNc1hNdkg0bHdsY3p2anRNTUJuckZBUld6ZlNfVS0wTTV1SzBnaXctZE9rVTJuU3BOT193Nkt1OXRPMnlLOGtKT3BhZUtScEdOT2Z1bEZoT19ZaGJ2cXNKeHEzdGNRN2I5dUxweHhETFI3NzRQRERoZHZIMXZha3FhRFVyMUhQX3ZWb3RGT3l1OEpxekpCbzFKQ2NqN1NUMVJxbEpHd3pnbVM1MUJjWmdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Diego Lopes boldly claims UFC 325 rematch might be his 'last chance' to win featherweight title - Bloody Elbow",
    "description": "Diego Lopes boldly claims UFC 325 rematch might be his 'last chance' to win featherweight title  Bloody ElbowUFC 325 picks: Why experts are split between Volkanovski and Lopes  ESPNUFC 325 start time: Where to watch, live stream Alexander Volkanovski vs. Diego Lopes  CBS SportsUFC 325 loses fight after controversial weigh-in failure  Yahoo SportsOfficial Weigh-In Results | UFC 325: Volkanovski vs Lopes 2  UFC.com",
    "published date": "Fri, 30 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQUnZSMUEtNVJTbEREZFpjS1BZSnNfWVhSU1RoQTBsSTNMZTk4WVJsV0Rhbm1CbWJ0QTFGaHJ1NzVKYktTY2V0RS1uby1mbXlvaHNYRXI1UHhwc3JQZzNQMXMtYnVTeXFRcVZMd3VmczljekV5ZktLOTJBNVQ0RndMRi1wLXRYZktpUFhtdWtiSU54N3NySER2QWZBRVdHVW5ad0gwLXk2eERmNW5Zb0RyZi0zYmtIcTNhbGU4MXN6Z0NLTjA2MGlSZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bloodyelbow.com",
      "title": "Bloody Elbow"
    }
  },
  {
    "title": "2026 NFL Draft burning questions: QBs in class to know beyond Fernando Mendoza? Deepest position? - NFL.com",
    "description": "2026 NFL Draft burning questions: QBs in class to know beyond Fernando Mendoza? Deepest position?  NFL.com2026 NFL mock draft, Rounds 1 and 2: Fernando Mendoza to Raiders, Ty Simpson to Jets - The Athletic  The New York TimesSenior Bowl Notebook | NFL Network’s Daniel Jeremiah Zeros In on 2 Players in His Top 50  New York Jets2026 NFL Mock Draft: Raiders select Fernando Mendoza, Jets add Rueben Bain Jr.  PFF2026 nfl Draft Guide  The Ringer",
    "published date": "Sat, 31 Jan 2026 00:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPOWtTbFhoQm5LNXlCQWlwQjNRTldDazRFZmh0TFpBcDFTUW1oU0dYb3h4OUtoOEhFb0RqaloxSXI3Y1VLZWxvbW05aU9Ib240S0tCY29YQnZGZDJmOVBybXFhN3d2amtnUHJveVZkQk9fV0Fpdi1ITFZrN3VmQnEwa01JQ1dfekdtb2pwa2RJMV8ybksya0hvTU5fekJvM1AyX3pGRzN6eEFEMHhNRTVNT0EyR0luQmZ6RjNr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "How the early Senior Bowl standouts affect the Jets’ draft outlook - Jets X-Factor",
    "description": "How the early Senior Bowl standouts affect the Jets’ draft outlook  Jets X-Factor2026 Senior Bowl: Daniel Jeremiah's top 10 standouts from week of practice  NFL.com3 players to watch in 2026 Senior Bowl  Raiders.com2026 Senior Bowl: Rosters, game time, TV channel  NCAA.com2026 Senior Bowl: Top NFL draft prospects, QBs, predictions  ESPN",
    "published date": "Fri, 30 Jan 2026 13:11:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNTzlxMGVZUUZRUC12RjZ6SUxpa2hhVi02eVI2bWc1NTFMV1JwX1hVNkYxdUd2WmpTYXZXaVVRZ2ZBZW1tQVRXblZzREs1cFdzUFlkbEZWdXBVbEJNckI1UU0tSGh3SVBIc2lCQzhwaFFxVml1UXZoSW1pVHVCOGJQSDVINFRXOEllMmU2TW9tN29LUS1DcGd3UGxzSGphTkhkY09n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jetsxfactor.com",
      "title": "Jets X-Factor"
    }
  },
  {
    "title": "Giannis Trade Rumors: Timeline, Lakers, Sixers, Raptors - Hoops Rumors",
    "description": "Giannis Trade Rumors: Timeline, Lakers, Sixers, Raptors  Hoops RumorsSources: Heat, Wolves, Knicks, Warriors among Giannis suitors  ESPNRanking Giannis Antetokounmpo trade packages: Who can make best deadline offer?  CBS SportsThe Bounce: Let’s make some fake Giannis trades! Plus, the Wolves hammer OKC  The New York TimesHow Soon Should the Bucks Trade Giannis? Houston Rockets Check-in + Unrivaled Preview  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 18:00:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNajZ4d2F1Rm5LYUVMZFRkMnJGb09hdXRaS2NHWXJrRnVlVTVnQzZtdXNtVS03UjRxLV9JRms0emtIUE4yUktOVERWNGpxRUFVNmRQczFXbHJCcTgyaklVa3lOeFVMVEtDUW5JVWlOT3hkLTM3akJfN2NFU0FBLVV1VFB2T1NHN1pUWVRjaUxiTWdkR3VJeXdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hoopsrumors.com",
      "title": "Hoops Rumors"
    }
  },
  {
    "title": "Vikings fire G.M. Kwesi Adofo-Mensah - NBC Sports",
    "description": "Vikings fire G.M. Kwesi Adofo-Mensah  NBC SportsWhat led the Vikings to fire GM Kwesi Adofo-Mensah?  ESPNWhy the Vikings may have fired GM Kwesi Adofo-Mensah: J.J. McCarthy gamble, draft misses and cap trouble  CBS SportsVikings Owner Mark Wilf Explains Decision to Part with GM Kwesi Adofo-Mensah & Interim Approach  Minnesota VikingsHere's what former Vikings GM Kwesi Adofo-Mensah said on Sam Darnold weeks before he made the Super Bowl  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 18:06:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNZUt1NzMxR09xR2pId3oyTVM4c0lZUktlenpmdU5ISThGV3UzZlhHRVNPdXZoSVhNeXpVTFZneEoxV2M4Tm1UWUZoYWJ0WmlfTlpVU2N5VjlMX2RJQzY5b2FYZTVuOXZjV1k4NXZDR1NvMFRnNVcxZi1XUjBoUkVOeFplQnBuNjEzbjVuSUtqM3JaQkc5RndUVVhrTmlldw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Trump announces upcoming IndyCar race through Washington's streets — including Pennsylvania Avenue - AP News",
    "description": "Trump announces upcoming IndyCar race through Washington's streets — including Pennsylvania Avenue  AP NewsTrump orders up IndyCar race on the streets of Washington for 'America250 Grand Prix'  NBC NewsFreedom 250 Grand Prix of Washington, D.C. Coming in August  INDYCAR.comPresident Trump issues executive order to begin preparations for IndyCar race in Washington  Yahoo SportsTrump announces August auto race in downtown Washington  Politico",
    "published date": "Fri, 30 Jan 2026 19:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQa3R4cUk2MGF0NHpSM3JrTEZaaE5KbUE1dEdGRzBNZGhpZ0NYRXNoQ2NtY3UwQzFsZzlKZFU0QkhyUTl2bHVTRnduSnN0anJyVU0tVnR4LUw3aGVQUDV3dDBUNnJ3ZzExYlRDVXFseUhzUUpTOTlwNDEteDluQUNUSHctUVdXTmtxODl5dEFoVHlJWU5nNHNMM1ZkNXU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Hauler Talk: NASCAR will hold Cook Out Clash at first available opportunity - NASCAR.com",
    "description": "Hauler Talk: NASCAR will hold Cook Out Clash at first available opportunity  NASCAR.comClash inspection, preparations underway for Bowman Gray as wintry forecast looms  NASCAR.comDue to weather, NASCAR reschedules Saturday’s Clash races to Sunday - The Athletic  The New York TimesNASCAR postpones Cook Out Madhouse Classic, Saturday events; Clash still slated for Sunday at Bowman Gray  FOX8 WGHPNASCAR shortens Clash schedule to one day due to winter storm  ESPN",
    "published date": "Fri, 30 Jan 2026 20:14:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxORzlwTUo1RUJaRl95TFM4d0xUYkt5WnpfLUhCYnJIcl9hR25OVlVjS2I0SV9xd19wSEdIdlZYc0hTQWlkVVd2bl9IT3ZwWjR0cVVESGxkdENhTDRPbjhaMUVzb0FabURyVk9VNEpoNnNuVFRCZmllZVVVNUIwNWVoWXp1SDBQRzZhMm45Z054bF8yc3lOZWVhcnM4ZmFYNFZVWWpDZzZoRVVvejlEN2dmYnBYdEQwelFQTU1ZQ9IBwgFBVV95cUxPYVc4TV93QnhOR3NXRXBLeWNYQTBjbkt5ZlZILTBja1hiZ1lRS2V5Vm5wYW9ibHVIYW9rREw4NmRPT0hCdXFNcDNtUHF3T2VoM1FMRDVSNUhWTGdjbG5UbFdKTlRDb2tVUFdWVWNybEN0QjBLbVZmMmstMjNjSFFzbjNfRHY0b18xYlVIRE9MYUhRcGJvN19oYi1PV1F4a0FhTEptUW40Zmk3eFNGc0xGdElSM2VZb0VSdkllZm9PdkVPZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "What Are the 10 Worst First-Ballot Snubs in History of Pro Football Hall of Fame? - FOX Sports",
    "description": "What Are the 10 Worst First-Ballot Snubs in History of Pro Football Hall of Fame?  FOX SportsPro Football Hall of Fame releases statement following Bill Belichick vote report  NFL.comJimmy Kimmel Unleashes Ruthless Joke About Bill Belichick's Hall Of Fame Snub  YahooSecond Hall of Fame voter explains choosing Robert Kraft over Bill Belichick  Fox NewsGerry Dulac: Bill Belichick's HOF snub a result of committee not following simple logic  Pittsburgh Post-Gazette",
    "published date": "Fri, 30 Jan 2026 21:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOQnBLYko3dUd4elI2SHA3Ny1mTnlPc2dMVmdVVVFWeldzX2lXY1Rsc2VRcE5ZRlpYSkpoYXNsLXBvU2RzcUlFS0l5cmdSWDNoQVhVWFJfa3hZOWp5RGdFSERTZG95ZUNTU1IxWTB2TU45TXJDN0txSkt0dkNaSWhnUmVjSHJlVDJQY2JZQlpBVDViSnRZQUkzMUFUUzdwV2ZyOE1N0gGjAUFVX3lxTFBXcjR0djhaZmdrVTRqMThibnBXM0g2Q21QWUVnMTZLVnV5cnM0NzQ2ZWFLYlJPOXZfYnkxMVMyaEpVZTF2cko5clpxdThYOWxyRVBKT1BFM242clZsX0VkRjRpNFJoZFJ2UGNncVR2a08tWlRLd1pyR3ZBTE4yOVg3Tno0ZDJNZ0JUZDRWSEZvdmQ2ZkdEb0NoczIxRlhnM21tRnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxsports.com",
      "title": "FOX Sports"
    }
  },
  {
    "title": "Skier Lindsey Vonn's Winter Olympic comeback dream is in jeopardy after a crash - NPR",
    "description": "Skier Lindsey Vonn's Winter Olympic comeback dream is in jeopardy after a crash  NPRVonn: Olympic dream not over despite injuring knee in crash  ESPNLindsey Vonn airlifted from course after crash in final downhill before the Olympics  NBC NewsLindsey Vonn crashes during final downhill before Winter Olympics, but says 'Olympic dream is not over'  Yahoo SportsWatch: U.S. skier Lindsey Vonn crashes, airlifted in last pre-Olympic event  upi.com",
    "published date": "Fri, 30 Jan 2026 15:50:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPYks1dzdMbEJuc3U5NlZwUGpKVXRQS2RCakdMTFo4RS1qUEFEeS16T0JZVXM1aUhCa2tReDNRWkhyR2xyWHJJQTFYZUxDNUp6TXV1c2xiT0xkaXlFN2xVanFjeWxHLXk0R25YWGlFYzNaWWJ4SHYxN2xscDduelBJblVDZld0MDVySnB1czQ3ZG5SZk9lZ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "The 12 NFL Teams That Haven’t Won a Super Bowl and Why - Sports Illustrated",
    "description": "The 12 NFL Teams That Haven’t Won a Super Bowl and Why  Sports IllustratedWhich NFL teams have never won a Super Bowl? Four teams have never even made it  FanSided8 NFL Teams With The Most Conference Championship Appearances But No Super Bowl Rings  BroBibleWhy these 12 NFL franchises have never won a Super Bowl  MARCA10 best NFL teams to never win a Super Bowl  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5FRUhjdW1pUUpqa2FJcWVYZW94U0ZPODUtanFQX1hkS0k5Um5EQ0pIR1hTamhsWEsxblF0NHN6UFkwZlJfQW9UcUt2VXpYVW0xUl9hWllMSG1vckVUbng0REFnVDNjWk1mMXRDMU9KdFdPMHBfTDVYNzln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Seahawks say team ‘not for sale’ following report - The Seattle Times",
    "description": "Seahawks say team ‘not for sale’ following report  The Seattle TimesSources: Seahawks will go up for sale after Super Bowl LX  ESPNSeahawks sale rumors swirl ahead of Super Bowl, Paul Allen's estate denies report  Yahoo SportsPaul Allen Estate refutes report that Seahawks will be sold after Super Bowl: 'The team is not for sale'  CBS SportsSeahawks likely headed for sale after Super Bowl, but winning may not boost the price  The Business Journals",
    "published date": "Sat, 31 Jan 2026 00:04:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPNmlyODJpUDdiZ3ZIb1lNS2VQNkVCU1JoRW9yeklKZ1lwUTlER2pQX1d0Y1NvVVVkNnN5d0dGSlMzdlVJa29DbFJQbFpBWUY0Y2JMSVd2eDFfQWlXSGhEeTVoZjhVVGFQZnR3Nks5eWpnZV80c1hYNTV5OGFfTFFNTzl5MmVZekI2RmNCbGNpRzlUQ0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Chicago Bears offensive coordinator Declan Doyle takes job as Baltimore Ravens play caller - Chicago Tribune",
    "description": "Chicago Bears offensive coordinator Declan Doyle takes job as Baltimore Ravens play caller  Chicago TribuneRavens to hire Bears' Declan Doyle to be OC, sources say  ESPNRavens hiring Bears offensive coordinator Declan Doyle as their new OC  NFL.comJesse Minter snatches rising NFL coordinator for Ravens opening  Yahoo SportsNFL coaching and GM tracker: Chicago Bears need a new offensive coordinator after Declan Doyle’s departure  Chicago Tribune",
    "published date": "Fri, 30 Jan 2026 22:01:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQQXhqaV81bzhaYWRRcXl1TXZmRnA4OFB4OUgwYm5vUzRhZl9VYXFCZDluX053Rk0yTHJkMW8tcl9GSGV5VldOaUVkd2x4YVJKa0d2Zmd4TFplWlZzcXNtcmFJWUhKaDBDaVJ5XzVjQjdtN1EyTVgwa3U0VFpmeHdWS0NqMXBxbTBVRlRrcU1Vbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chicagotribune.com",
      "title": "Chicago Tribune"
    }
  },
  {
    "title": "Jeffrey Epstein scouted women for New York Giants co-owner Steve Tisch, emails show - The Athletic - The New York Times",
    "description": "Jeffrey Epstein scouted women for New York Giants co-owner Steve Tisch, emails show - The Athletic  The New York TimesGiants co-owner Steve Tisch named in latest Epstein files  ESPNEmails reportedly show Epstein scouted women for New York Giants co-owner Steve Tisch  The GuardianGiants co-owner Steve Tisch exchanged emails with Jeffrey Epstein, appearing to discuss women, docs show  Fox NewsBREAKING: Tufts alumnus Steve Tisch, namesake of several campus facilities, implicated in Epstein files  The Tufts Daily",
    "published date": "Fri, 30 Jan 2026 22:08:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNN3p4anNNU2dtd0F0N3U1U0NLOGpkN09jVk12Z1JBUmlwRWpUY1RqTmhGQmVpUUxZMzdVR2VxWldWc0NDd21nQWhOLWtuLVlsQmpHa3ZOUVY2cnlnS2ZFdGZEVGFRM3NIN2RPSzdBY2EyUW5qSHhrTWNxWURaNnZ2Z2xnWFgyeEdfeWxkbEhscUdMUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Sha’Carri Richardson’s Olympic sprinter boyfriend also arrested in traffic stop incident - New York Post",
    "description": "Sha’Carri Richardson’s Olympic sprinter boyfriend also arrested in traffic stop incident  New York PostOlympic track star Sha'Carri Richardson arrested in Orange County for super speeding, deputies say  WESHOlympian Sha'Carri Richardson pleads with officer to ‘work with me’ during speeding arrest: ‘I’m begging you’  Fox NewsDallas Olympian Sha'Carri Richardson after alleged 100-mph speeding in Florida: \"I didn't even know my car was speeding\"  CBS NewsSha’Carri Richardson’s Olympian Boyfriend Christian Coleman Also Arrested During Speeding Incident  People.com",
    "published date": "Fri, 30 Jan 2026 21:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQRDI1SVdpUVNHTzJRbHpQZ3otMnNsMUFicWVya0RXNW9IdTN2N0NEeDJwbnY3Q3BFMEJpbXlfR3AyRThUMUQxMkI5NDJXVDFtZkU1QkUyLTR4TjU2a1RRMGd0Qlp0cy1wRVc0QW5PR1ktN2RXenJKNnhkdDNucUJEcXhlbktGZXE3aHFpT0ZPSnRYMGh5MkMxem5EY2k2b0F6THJCaGhZb3pGLXk0N2lUNmg3Wng?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Upside and downside to Sean Mannion as new Eagles offensive coordinator - PhillyVoice",
    "description": "Upside and downside to Sean Mannion as new Eagles offensive coordinator  PhillyVoiceEagles hire Packers QB coach Sean Mannion as new OC  ESPNNFL coaching news recap, Jim Leonhard, Mike McCarthy's hires, Packers updates  Milwaukee Journal SentinelEagles reportedly hire Josh Grizzard as pass game coordinator  Bleeding Green NationWhy Eagles hired Sean Mannion, play-calling question, staff changes: 8 Thoughts  The New York Times",
    "published date": "Fri, 30 Jan 2026 21:21:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPY0NSQ3BzVTR2WUsyeU5SWTNEbG40VGRNczhKdmoyaWZnYU1hVE1aZGhSQkZCYWoyN1djWG4wc3k5YXdUbXk2RmxQOWtkbUExRWpsQmtBNmZQeS0yNndYanloNVV2a19DYnJBRFJsWXVRNGo3RjlRWGoxbE4zTzJzZ05YcFlDanJ0NGgteUNiaW5xMXlNS0pIaUp3bjNjd1ZoME1neF92U3RNZ0UtdkdhVXVESzNza1BMOWNmQ1lIbnZuMmht?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.phillyvoice.com",
      "title": "PhillyVoice"
    }
  },
  {
    "title": "Steelers hire Patrick Graham as Mike McCarthy's D-coordinator - ESPN",
    "description": "Steelers hire Patrick Graham as Mike McCarthy's D-coordinator  ESPNMike McCarthy begins filling out staff, which is expected to include ex-Steelers DB Jason Simmons  TribLIVE.comGraham named Steelers defensive coordinator  Steelers.comSteelers announce hiring of Patrick Graham as DC  NBC SportsPaul Zeise's notebook: Patrick Graham will be under enormous pressure as Steelers defensive coordinator  Pittsburgh Post-Gazette",
    "published date": "Fri, 30 Jan 2026 22:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQkVLQmdDYV9aQUNZZ09fTXI2bEJtY2U4RU45VTFNTnhscElIMkRnNVZ2Z21RVU04QjYzMUIxdURtcnVMU3h1SEh3VHZ3cXRUYTFsT0RuTFVDTmRGR3hydHR4aXprM1BORDJHT0dfVDZRSjhXbWJ3UGFsekJnOUp3d1hkTW5BVmY1OVFJTlRaX1Q1QkZfd0JrN2N3ZmdSQVpydnI4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Alexander Zverev fumes over Alcaraz’s timeout for cramp in semi-final thriller - The Guardian",
    "description": "Alexander Zverev fumes over Alcaraz’s timeout for cramp in semi-final thriller  The GuardianAlcaraz slugs out win over Zverev in over-five-hour semifinal  ESPNCarlos Alcaraz battles into first Australian Open final with marathon win over Zverev  Tennis.comAlcaraz vs. Zverev, Djokovic vs. Sinner live streams: Watch 2026 Australian Open semis free from anywhere  Business InsiderAustralian Open: Carlos Alcaraz outlasts Alexander Zverev in 5.5-hour marathon, moves 1 win from career Grand Slam  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 19:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQNV9uRThCY3lDeXRUUkpqa1hvMkZidFJ1YUZyZ3hGYV9EcTRsdGNFOTNIbGw0LU5jMGxMZUk1TC1DLV9VTUN5cmc3Rm5PZzZySkFkQmNIM193R2VpMWpBanFwdmNtdlpVaHlJMVMxV2QxVTJaSU9IQl9QNTFfeDdUd2dCOHNzNDZSV2FJYWF4Z1Q0MmdpcTA5bmdBZFFMbTcxRW1hbXFWV2c1UTJkTEFqQ0NoQVFjMGFsR3ZDbHdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Todd Monken to Shedeur Sanders: We tried to draft you last year, it all worked out - NBC Sports",
    "description": "Todd Monken to Shedeur Sanders: We tried to draft you last year, it all worked out  NBC SportsNew Browns coach tells Shedeur Sanders 'we tried to draft your a--' while with Ravens: 'It all worked out'  Fox NewsNFL coaching hire grades: Eagles finally land on an offensive coordinator in Sean Mannion  Yahoo SportsBrowns hire Todd Monken as new head coach  ESPNCoaches and players share support for Todd Monken as Browns head coach  Cleveland Browns",
    "published date": "Fri, 30 Jan 2026 15:06:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxOQnFPdzEyZEZwaTZ6YTdJU1l5aUFFcktycDNNMVNtX0NqM3NJZV9jeF9IVGlyOFF0QWNhalRFTVhaZTRwejhKdUxIY3I0UjBZY2hIbFlDSXc0d1JmUkFXT0thQ1REdUpsREtsTEJHN3M4dzNIRURHNl9pOXJidUwyY2ZlbGFLVHFpWHRhcThDT0U1aVpDM0ZqcW9uYXY5S1FKdWdVVlkzYWNHLXk2eGR3SUlQbFUwdkl5WU0ydV9DRm1leEFzZTJrenNIaUtyN1FPMjA1QmtEaEQtQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "2026 F1 Barcelona Pre-Season Test - Complete Fastest Lap Times - racingnews365.com",
    "description": "2026 F1 Barcelona Pre-Season Test - Complete Fastest Lap Times  racingnews365.comDEBRIEF: What happened on Day 5 of the Barcelona Shakedown?  Formula 1What we know (and don't) about F1 in 2026 after Barcelona test  ESPNHamilton ends F1's Barcelona test on top  The RaceLIVE: F1 Barcelona pre-season testing - Day 5 | Live text  Motorsport.com",
    "published date": "Fri, 30 Jan 2026 17:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPcWNtZVpDZ3dremF3RlFweEpsUXlYWmRyV2RTWmlib0hxVHJnLXFlSjRqWk5OVTF2ZEF3cFF3R3FqbF9pT0R0Y210REludEVwaXF4dEZ6RVVYYVg5SGo4MDc5dHpLMzhseGt3OHJPZ1VOWWhxaFBGNzlSZzVVb3BudFVwSXBKUWFkYjhXUERnVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://racingnews365.com",
      "title": "racingnews365.com"
    }
  },
  {
    "title": "NFL hires Dhar Mann as Chief Kindness Officer for Super Bowl 2026 — and he has shady criminal past - New York Post",
    "description": "NFL hires Dhar Mann as Chief Kindness Officer for Super Bowl 2026 — and he has shady criminal past  New York PostDhar Mann Named NFL’s “Chief Kindness Officer” As League Kicks Off Super Bowl Creator Blitz (Exclusive)  The Hollywood ReporterNFL Appoints YouTube Star Dhar Mann as First Chief Kindness Officer for Super Bowl LX  YahooThe Chief Kindness Officer, Novelty Props, and Australian Open  The RingerHour 4 - Bureaucracy Takeover  FOX Sports Radio",
    "published date": "Fri, 30 Jan 2026 14:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQY09oMVRBQ19FUXRBcXVIaU1iZnNmQktBUS02TmRPVnFuM1pLakZ1UnQzRk5tTzloQzg3ZUtaTjdkNW43NXhNLVBZOWNLYlFnaDV3azk2MTUzNUV0YkYwVmlVQXhVX21HQTQtMDI0SWJ4bHpNYXNVYVF2d296VE9FM09ua1JIRGdvNGdHSVRXYkEwZmt2cjRHTjZlalpzbUx2UnFwVzlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "UFC 325 bout cancelled after fighter tries to cheat weigh-in using Daniel Cormier’s infamous trick - Bloody Elbow",
    "description": "UFC 325 bout cancelled after fighter tries to cheat weigh-in using Daniel Cormier’s infamous trick  Bloody ElbowUFC 325: Aaron Tau's fight against Namsrai Batbayar cancelled after weigh-in mishap  BBCAaron Tau issues statement after weight cut debacle, fight cancellation  MMA FightingUFC 325: Kiwi Tau misses weight; fight for UFC contract cancelled  NZ HeraldUFC 325 Fight Pulled From Card Hours Before Event After Weigh-In Controversy  SPORTbible",
    "published date": "Fri, 30 Jan 2026 08:25:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPOThHRnhVMkN4Q25DTDJVQXVIQ0s4RmNYVEVaYmxSSVFtRmwtUWhndFFqR2xfUnJuQ29YQmdYbGZtZm5sT2JXb3hlQ1laVGdfbndTOU5iX1VWS1NOWTJId1l3RVRPZjdSanBLSWFqS1lKYzhFSUVFc29NaGYxVVNMQWpaQUJFQnNJT1FUZkZieFpuNkxTeGV5bHAtV25CTEEybzdvbFRtMEhITHNwMG5WZ1NMQnZtYktjNWl1dGdJNk1YbDVJX3RTT3FR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bloodyelbow.com",
      "title": "Bloody Elbow"
    }
  },
  {
    "title": "NASCAR’s Greg Biffle wasn’t flying his plane before crash that killed him and 6 others - AP News",
    "description": "NASCAR’s Greg Biffle wasn’t flying his plane before crash that killed him and 6 others  AP NewsGreg Biffle wasn't flying his plane before crash, report says  ESPNNTSB releases preliminary report in Greg Biffle plane crash  Jayski's NASCAR Silly Season SiteRetired NASCAR driver Greg Biffle wasn't flying plane before crash that killed him and 6 others, NTSB says  CBS NewsNTSB releases preliminary report on Statesville plane crash that killed Greg Biffle, 6 others  WCNC",
    "published date": "Sat, 31 Jan 2026 00:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNUmVlaUpNNzY5Y1FISVJmSWk1cW1vVjR0N1dUbk1fVWhGWWtGb3ZYRnJKMnVhVGZ1WEw5VG1oZW9KSU82TGI3Smh5MnpCT0UyWmVkeWZOUkJxV2dSYzMzb3FtR1Q5VnpQZG12VXdiRzZwV0hOdktQMVFONThrem15VHpjR2pXSE5mNGM5cXhVT1l0QWZidVRwY3ZET2trRkhfcGFMM09FTXVWQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Cooper Flagg sets NBA record for most points scored by a teenager - NBC News",
    "description": "Cooper Flagg sets NBA record for most points scored by a teenager  NBC NewsKnueppel, Hornets overcome Flagg, Mavs in rookie showdown  ESPNCooper Flagg scores 49 points, most ever by an NBA teenager, in Duke reunion with Kon Knueppel  Yahoo SportsMavericks teenager Flagg breaks 46-year NBA record  BBCHow many points did Cooper Flagg score tonight? Mavericks rookie breaks records  USA Today",
    "published date": "Fri, 30 Jan 2026 13:31:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPbXBiZ3NVQnhOeFJXbzRISDNyWEM5VlRvQ2luYzd0SlZ3N093aVE5b3JkTFBkdFlDWVlON3k0NkVTVlAycFozM3hETDY1cm5SdmtVMzZhV3B5c3hEU0wzRkNxWjhxVHVoN095b05vXzkydWZEOGRGLVhibl9LNVU5cnJRWk1FeEFlTWJmX3dn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Friedman: Some NHL teams believe Capitals are ‘aggressively pursuing’ Artemi Panarin, but will only do trade with a contract extension in place - RMNB",
    "description": "Friedman: Some NHL teams believe Capitals are ‘aggressively pursuing’ Artemi Panarin, but will only do trade with a contract extension in place  RMNBSources: Artemi Panarin likely has played last Rangers game  ESPNArtemi Panarin trade rumors: Six potential landing spots for the star Rangers winger  CBS SportsPanarin out of Rangers lineup for roster management  NHL.comHow Does Panarin Fit (or Not Fit) Sharks? (+)  San Jose Hockey Now",
    "published date": "Fri, 30 Jan 2026 22:33:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNOGZJbHJHU2Z5TGxKa2V0SEp6bzdPbEZtbV83V19Kb242anEtNElDMlkycFpDbENrb09BTXIyWTNIZGlpbWxoSVdoZ1RwLUZxWGVVdFJwbkZ4T3ZUUzdObktsRXpVUzVJNWlwNGFfUThnek1vNl9BYS1qVEFTUGdNOTVNTGxYaWxlSEdpeWo2WWx4VDhvVGRobE8zbXhVMDZuaUhkdnhUZUVpSzRHWkxCMUM5aGoxTFEya3M5d1k5S1VLVGZjVnB6amJPbXJsQVI1YUhKMTdWZE43Wnhq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://russianmachineneverbreaks.com",
      "title": "RMNB"
    }
  },
  {
    "title": "Athletics Extend Jacob Wilson - MLB Trade Rumors",
    "description": "Athletics Extend Jacob Wilson  MLB Trade RumorsAthletics lock up All-Star shortstop Jacob Wilson with 7-year, $70M deal  ESPNA's extend star shortstop Jacob Wilson to 7-year deal  MLB.comAthletics extend Jacob Wilson on 7-year, $70 million deal  Yahoo SportsAthletics Reportedly Sign Jacob Wilson To Extension  Athletics Nation",
    "published date": "Fri, 30 Jan 2026 20:56:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxObmhDblAwM1RRSzFTWjJScUxGVEpQeDhuTUFTQjN2eVlMOGNjd3ZDbUtSV1NmVGp0a3RScHc1UFM5U3JYcTU1cGx4bFNpWDczdm5YWmRtTlNXLWdaUTNHMFNwNFZ4SUtKTXhEdnF1YW54MW9QOEVoYndTLUNHa041ci0wck85UmIxWDFVWjdEWFVUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "He's Now the No. 1 American Player in NHL History - Newser",
    "description": "He's Now the No. 1 American Player in NHL History  NewserKane passes Modano for most points by U.S.-born player  ESPNPatrick Kane gets U.S. record, Red Wings surge back in 3rd for SO loss  Detroit Free PressRed Wings’ Patrick Kane breaks NHL record for most points by American-born player - The Athletic  The New York TimesNHL Power Rankings: Highlighting significant Americans from every team  Sportsnet.ca",
    "published date": "Fri, 30 Jan 2026 13:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQVVJoMVlUTmMwcmxPWi1ZUUQ3b2NUd0xXUzdJSnhnN2ZPOURfTTJIX09COVplWklWdjJOSFFVWk4wLTEwcFVXNnlMaWtYWVB3M2V2NmVRa3BDWUFfc2M2UUNJQmVjazhYeWJGMm9RRjBLWGVUOEw1RTQzWmQ4MGZVanAzRk5QUjhDZWZBaUwyTE52dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Cavs actively discussing trade possibilities ahead of Thursday’s deadline - Cleveland.com",
    "description": "Cavs actively discussing trade possibilities ahead of Thursday’s deadline  Cleveland.comNBA Trade Rumors 2025-26: Lakers in talks about De'Andre Hunter, Keon Ellis remains hot name  Yahoo SportsCavaliers giving controversial strategy one last chance if rumor proves true  King James GospelCavs’ De’Andre Hunter Likely To Be Traded?  Hoops RumorsLakers, Cavs Reportedly Talking De'Andre Hunter Trade, Full Details Revealed in New NBA Rumors  Bleacher Report",
    "published date": "Fri, 30 Jan 2026 20:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTERRY3lWbEwxc09OS1VJZnJiVVl0QzhGM1FOSFFMcWs1eXRGR3otd3JuV0dfV3l0N3FMU2l0ckpZS1pHMlA3Z1JDUkZqeHdfWHgxWU9lT242ampDbFFKa1IxbDZQdEFyejhkWVV5cDJ1VjhMVWVNdkpTOVdWS1N1dG1vRjBwcUJlUTZNX3FnV1RsdnUxQnE0dVA4OW5DYjZQZHpCby05d2UxNThrSWVmZ3VIcDBBaGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Champions League draw: Real Madrid to face Benfica, Newcastle to face Qarabag - BBC",
    "description": "Champions League draw: Real Madrid to face Benfica, Newcastle to face Qarabag  BBCChampions League playoff picks: Real Madrid, PSG to advance  ESPNUEFA Champions League knockout phase play-off draw: Where was it, when was it, who was involved?  UEFA.comChampions League: Who we could play in knockouts | Feature | News  Arsenal.comChampions League play-off draw analysed: Benfica v Real Madrid again and a French first  The New York Times",
    "published date": "Fri, 30 Jan 2026 11:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5SZGlSQ2o3UHhuOXRwVTBRRVlDYm1nTE9VVjF4Um1TakVaU3NOTkF4MzJpVUpmRlNrSVBuZEpnUnFHdnZRQk85X0R0RTY3bXhaTnYzcm93dVg3ZDNvaU1ELV9QV3o3a3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "'If history holds true, he'll be a general manager': A 2007 proclamation becomes reality for Ian Cunningham - Atlanta Falcons",
    "description": "'If history holds true, he'll be a general manager': A 2007 proclamation becomes reality for Ian Cunningham  Atlanta FalconsIan Cunningham leaves Bears, takes over as Falcons' GM  ESPNChicago Bears executives praise Ian Cunningham hire  Atlanta FalconsFalcons hiring Ian Cunningham, ex-Bears assistant GM, as new GM  The New York Times5 things to know about new Falcons GM Ian Cunningham  AJC.com",
    "published date": "Fri, 30 Jan 2026 13:04:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQbDZRcGwwYnkxZUZLVjRhRmVpM0R3aEhES3c3UEF0c1JteHVCWTlLVTZhS2ZPUnRBaUVhTVhfY2pfTnNPUVM3LS1tSUpCWWJNMlMzSUhTajJwUlFYU0VsbEx6b1lEWEw3M2JUWHAzNUd2VXlzRkx0cVRxQk9GLUVVYUxwWWp0bnZkaEs0dkQ0OC1ZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.atlantafalcons.com",
      "title": "Atlanta Falcons"
    }
  },
  {
    "title": "How to watch Saturday's BYU-Kansas game - Deseret News",
    "description": "How to watch Saturday's BYU-Kansas game  Deseret NewsKansas expects Darryn Peterson to play vs. BYU, AJ Dybantsa  ESPNCougars downplaying matchup of superstars ahead of showdown with No. 14 Kansas  Deseret NewsPreview: KU begins challenging phase of schedule with big-time matchup against No. 13 BYU  KU SportsHe coached both Darryn Peterson and AJ Dybantsa in high school. So who’s better?  Kansas City Star",
    "published date": "Fri, 30 Jan 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNY1VVdnFhcmtmZmVFTGJ1UDgybXJIakJ6dDF2YmpqdGtaLU91MjdocENybXIxX3FKcUVKRlhMNTVIUThKUDR4QWtUYkhQbHNvaERaLXZuQTJwZXpWZ19FbEl1TkdwMlNVWnA5ME83OVhzNzJLeWtkRXBYVFVtcklJbDdISzVHOXRvd1JtRzFWUDFjbFBzQjhiWEJGbmNJRE8y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.deseret.com",
      "title": "Deseret News"
    }
  },
  {
    "title": "Packers sign Gutekunst, LaFleur and Ball to contract extensions - Green Bay Packers",
    "description": "Packers sign Gutekunst, LaFleur and Ball to contract extensions  Green Bay PackersPackers announce coach LaFleur, GM Gutekunst, EVP Ball extensions  ESPNPackers sign GM Brian Gutekunst, director of football operations Russ Ball to multiyear extensions  NFL.comPackers sign GM Brian Gutekunst to contract extension  The New York TimesPolicy announces extensions for Packers’ top front office and coaching leaders  WLUK",
    "published date": "Fri, 30 Jan 2026 20:01:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQbEcwUzFHZVkyWFNRSV80VkN1QnBWeU5TTjNKQWZfZDYydFNIRFZWVkFPS056NkdTWEk5aWZIc1Q1RTdONENPdm5iOW9ETi0wOGtmVTFuQm9KVHlJMW96ME1kTng4c1BiRXhsdmNZdXNCV0ZhcVloeTlERmZ0WjdETFRpbXJLTWQwRGJ4dE9SRnpIN00yeDZhbVZXQ2lVb1pNZEJxYlBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.packers.com",
      "title": "Green Bay Packers"
    }
  },
  {
    "title": "Robert Saleh: Experience with Jets led to \"tremendous growth,\" more prepared to be a head coach now - NBC Sports",
    "description": "Robert Saleh: Experience with Jets led to \"tremendous growth,\" more prepared to be a head coach now  NBC SportsSaleh: Playcalling, Cam Ward among priorities with Titans  ESPNNew Titans HC Robert Saleh Has High Hopes for QB Cam Ward, and OC Brian Daboll  Tennessee TitansRobert Saleh wants his Titans 'fast and violent' in second HC stint after finding 'tremendous growth' during time with Jets  NFL.comCam Ward, Jeffery Simmons and other Titans key players show strong support for Robert Saleh  A to Z Sports",
    "published date": "Fri, 30 Jan 2026 12:05:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxPNlI2cnN4Y2hJTm5qN2pfd194M0hhZ0xXVlB0aEt1eDNHYldiZS1nWmhhTGpEVXdUaGVabFI4Q2ZlekJQa1RGWlg1b0c3Z0pfWUM0Z3psYVV3aVpfQnNmSTdPeHhGV2dyeEZISUJ4X3hHbjJPTExMSkJ6cVBVRlRDM0FVVXFqMmU0YXRGMTA0cmxfdTlPU3dqX1FhWFp2UGV3Tkl4SmhWVUw2a1BEVFk3MjBDR1IwXzh4MmZVVlo3SU43dGk0SDIwZ0hNSTE4RUZ1U0dJWmtZak9yLThOX0Z6TGlNMTUzT2I0anRGbkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Missed Fists: Amateur fight ends in scary face-plant knockout at Dan Henderson MMA show - MMA Fighting",
    "description": "Missed Fists: Amateur fight ends in scary face-plant knockout at Dan Henderson MMA show  MMA Fighting",
    "published date": "Fri, 30 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQbWhvcUwySWw4UFRWSG1IT3ZxX3Bvck4yUmYzMjlCVHk3QnRPMG5tNHo4WWxkQXJ3LWVTOHdnbWZ4V21mcGt6NC1Ld0xQenJKWWZmNG1kRHhOMk44a1JaSmstU0NHTUk5WV9yRlVJV2Q0MTRuTnlnMUphZ2EwVFpueWtnSGFtRXN2dDVDcmtESUx2TjdDRUNlYjB4Mjc1Qm9EY2JjZ0JDMWJWVmgwd1lacFl2XzRCUTZWbTk1UU1MMExCWndicklv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "Can Amari Bailey Actually Return to College? Latest on Former NBA Draft Pick's Historic Pursuit - Bleacher Report",
    "description": "Can Amari Bailey Actually Return to College? Latest on Former NBA Draft Pick's Historic Pursuit  Bleacher ReportAmari Bailey, with 10 games in NBA, seeks college eligibility  ESPNFormer UCLA guard Amari Bailey, who's played 10 NBA games, is reportedly seeking college eligibility  Yahoo SportsFormer Hornet Amari Bailey Seeking NCAA Return  Hoops RumorsAmari Bailey seeks college basketball return after playing in NBA | Report  USA Today",
    "published date": "Fri, 30 Jan 2026 23:06:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPVDhTcVJYN0RPOFpUaUFMUno2YktmS3AxR0k1VEQxR0lvWWJERUxDYVhqZGN5a0Nlb0tPMmJyMzZfT3VVVnloM0EtTWdYbHB2Y3ZYeGY3UWQ1WVNnTGlWR2tvdGNFWkpVOS1oSU9sQmpjeHBrVFFCWWRPdjM0QW4wZjZ6ME9qcWxaSkQ4dnVkdUw0dU82UkEwSDQ3dE1EdzlrUUUtTkdxXzF1VVlMVHNoUE8zSGhWenpHbFU2MWktYlFkV1lPLVhfU3ZkOWY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "NFL salary cap projected at $301.2 million to $305.7 million per team for 2026 season - NFL.com",
    "description": "NFL salary cap projected at $301.2 million to $305.7 million per team for 2026 season  NFL.comCommanders should have about $51m in cap space for 2026 free agency before any roster moves are made  Hogs HavenNFL projects 2026 salary cap: Where do the Bears stand?  Bears WireLatest NFL news makes life slightly easier for Kansas City Chiefs GM Brett Veach as he prepares for challenging 2026 offseason  A to Z SportsNFL salary cap will reportedly skyrocket next season to more than $300 million per club  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 20:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMnNQMEotdC0zdW9yaUF3M1hkYzRRaFNlZlBQV2tsWUFIZGQtYjl0QnNiN1NCMkVsczBXZ09rblEzVTJIY0xLQkhsZk9SZEFhcVZaQUpaQXItXzUyemtMRkpOZlZxd1A5LVZWVFJPa1JkT3hIY0hsMnJraHRfQm9vSWR2NUtHVDBvMXBQYzFDVFJuc29rQ2t6anZtcXNUWnAyRFhYckJfQlBucHdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Brooks Koepka's average first round back on the PGA Tour was exactly what he needed: 'I just wanted a warm reception' - Yahoo Sports",
    "description": "Brooks Koepka's average first round back on the PGA Tour was exactly what he needed: 'I just wanted a warm reception'  Yahoo SportsKoepka met with warm reception, cards 73 in PGA Tour return  ESPN‘I was shocked’: Masters champ questions Brooks Koepka’s PGA Tour return  GOLF.comJustin Rose’s 62 good for first-round lead at Farmers Insurance Open  Golf ChannelKoepka’s comeback, Super Bowl countdown and shadows over Crans‑Montana  Reuters",
    "published date": "Thu, 29 Jan 2026 23:46:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPMGQ4OVFfX1NWUjZ3WmRiZXdNT0R6Um9fSU5kS3NSZm1ERHBtWHdwVU01TlBxRG9hZnlVZGlIejAyU0ZFMlVudEVMLUY2azQ4bHNnTkRtbnVyMFVqb0YwVVNrMklWZTFSZEZsV3AzN0k1M3dGSUQxMG5COURFRWVYNnJuTHdmWUJCaUMzcFVzeGxmUGhaZ1BYa2tJblJsMjlUZnNET3lGWW9OSkl2U3ZzbGFFM081a1JLUXpCcTRIRnI5QUtVc2FveWlPb3ozNUFzVFJEQ0luRHpSYWtJczJIckxFU0Vid0xLS3diT1BjaVJvSFJpbDBORC1B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Baltimore Ravens 2026 Coaching Staff Tracker - Baltimore Beatdown",
    "description": "Baltimore Ravens 2026 Coaching Staff Tracker  Baltimore BeatdownHow Jesse Minter Plans to Deploy Kyle Hamilton, Return Ravens Defense to the Top  Baltimore RavensRavens' Minter: Want to help Jackson become best version of self  ESPNFor Jesse Minter, being head coach of the Ravens is a full-circle moment  The New York TimesGrading NFL coaching hires: Steelers and Dolphins get lowest marks in 2026 cycle  CBS Sports",
    "published date": "Fri, 30 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOSUlzcm1Za1JvVm9HdnVqSDU2emh0a0xTUkNsQ2VCMndVLURVUDBGMmtOMEhNSlU2Y2VaNkJtaFMxMFdYRjIwWFFfM3Y2VXhBcmlSNTZrOXZZWXJmeTAxTlRVNE1PVEI4czlKZmplckpIRlhHZ19OOTBkX0w5RkRUQWJWWVNYbFh6TjNwOGV0MzA3RmhYR2x6YlllZjRjalVNZUtzUDFkYi0zckVRT3dvQUltOFdoaE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.baltimorebeatdown.com",
      "title": "Baltimore Beatdown"
    }
  },
  {
    "title": "Bengals QB Joe Flacco, 41, earns 1st Pro Bowl Games nod - ESPN",
    "description": "Bengals QB Joe Flacco, 41, earns 1st Pro Bowl Games nod  ESPNBengals QB Joe Flacco added to AFC Pro Bowl roster as replacement  The New York Times5-win Browns helped produce 2 Pro Bowl QBs this year  Dawgs By NatureJoe Flacco added to AFC Pro Bowl roster  NBC SportsJoe Flacco makes first career Pro Bowl roster at 41 years old after starting 13 games for Browns and Bengals  CBS Sports",
    "published date": "Fri, 30 Jan 2026 20:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQaW5rYTFhNVpzNjdNNjF1V05RUFk2T3FSM1BCLWhYSENia1B3b1hWQ2UxdW5TV05RQ042Q2ZXWnhneFM0aG9TcHhGRnlnU0J6anhqRnlKT0FXaUVGbW5vTTYwZ3J6bU1aTXpaNHhCMzV1bmJZeE1zQkNjX0E3clV3WEI2a20tUjNBNGV0LWFQMWpmNDJuTG9ic2tmSVZUTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Tuch's hat trick and Lyon's record 10 straight win leads the Sabres on Thursday. - Audacy",
    "description": "Tuch's hat trick and Lyon's record 10 straight win leads the Sabres on Thursday.  AudacyLyon makes 37 saves, wins 10th straight as Sabres top Kings  NHL.comFINAL – Kings 1, Sabres 4 – Kempe, Ceci, Hiller  LA Kings InsiderBaldwinsville native gets hat trick in Buffalo Sabres win  Syracuse.comAlex Tuch says Sabres aren’t just headed for playoffs — they want the Stanley Cup  The New York Times",
    "published date": "Fri, 30 Jan 2026 13:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOdDQ3UGlsazVhTUhUUGpVb3N0UTF0eXdTS3RRWF9nMERkb0RCZmZmVlVkZVR4TlBPa2pMcWJFbHE0MGZqTkFuY1BXb2luYkRhMl9PNk5zazZoWE5YUUxaQ2s0a1JKTWV1UDNFRDBpRVFJYmx2alkzc3pIYkJqMDVjYUpKOUpYMjRNS2FhYnNTR1AzRUl6UDVZWnF4d3BFYjhzQmpUbA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.audacy.com",
      "title": "Audacy"
    }
  },
  {
    "title": "Football Footnotes: Mike McCarthy on calling plays, the 3-4 defense, WRs and more - TribLIVE.com",
    "description": "Football Footnotes: Mike McCarthy on calling plays, the 3-4 defense, WRs and more  TribLIVE.comMike McCarthy believes in a 3-4 defense, but how much does he believe in the Steelers' aging veterans?  Pittsburgh Post-GazetteSteelers reportedly give Aaron Rodgers deadline to make decision  Yahoo SportsNow bring on the Penguins' youth, too!  DK Pittsburgh SportsSteelers' Mike McCarthy Shares Phone Call With Mike Tomlin  Sports Illustrated",
    "published date": "Fri, 30 Jan 2026 11:42:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPZEhUeFpIeU5EOEd2N0M1RDFIMDhtdWZsZlR4SHBWTDNPN2VxdGlLMDBUV0FoZllxdnplOHotMGx0d082Mk5BU0x6b2lvc29nc1IyQ0NwTmtwZXFINjFxc05vWVRNY09UNEJDT3hrY1BNWS1pYWxkNXp6TFV6RTdCQmdPMzV0Q0RiMVg3dlpFazcyOXdLSDFLZzc5VlUzQlBycjlXR1N3bEJabHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://triblive.com",
      "title": "TribLIVE.com"
    }
  },
  {
    "title": "Ole Miss Game Moved to Nashville - Vanderbilt Commodores",
    "description": "Ole Miss Game Moved to Nashville  Vanderbilt CommodoresOle Miss 83-75 Vanderbilt (Jan 30, 2026) Game Recap  ESPNWhy Ole Miss upset of Vanderbilt was for 'whole city of Oxford' after winter storm  Yahoo SportsAuburn, Ole Miss women’s basketball game moved from Oxford to Birmingham due to inclement winter weather  WBRCDores Set for Rebels  Vanderbilt Commodores",
    "published date": "Thu, 29 Jan 2026 17:29:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBha2MtMXlVWDdYeC1QOW1PMHM4cTNDbW1xMjRSRU9NdHZud2xrN25WdDIzLWU1TllTS0VQazVGVFpQX1FXOER0dUY3Sl8wdjFHcFRQSUFnR1pNVUppMVp1VEctcnJtS21JX3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vucommodores.com",
      "title": "Vanderbilt Commodores"
    }
  },
  {
    "title": "How American Katie Uhlaender was denied Olympic bid by Canadian coach's point scheme - NPR",
    "description": "How American Katie Uhlaender was denied Olympic bid by Canadian coach's point scheme  NPRBobsled, skeleton, luge athletes appeal for Olympic spots  ESPNTeam Canada coach speaks out after being found to have manipulated competition, US Olympian fires back  Fox NewsKatie Uhlaender: Winter Olympics skeleton controversy rolls on as US athlete looks to JD Vance for help  CNNTeam Canada found to have manipulated competition that cost American shot at 2026 Winter Olympics  New York Post",
    "published date": "Fri, 30 Jan 2026 20:53:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNRDlEbFV2VlhDOGF4OW9oNFU0V1BkbmJqdU5mSi1QdFBraU8ta0gxdmlvaFd4VDBaTXBaU2g3WjdIVjlWOWxVUG92c2laNm95XzNsTzhXZlJkMGlBd09YTU50bWVuUGJCcVRKMGhvR1VYaDNHWWFHYzRteG9sOTRtMzVFRnM1MkFROFVYaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "For U.S. figure skating, grief over the D.C. crash makes for a bittersweet Olympics - NPR",
    "description": "For U.S. figure skating, grief over the D.C. crash makes for a bittersweet Olympics  NPRMaxim Naumov to Skate at 2026 Olympics After Parents’ Death in D.C. Plane Crash  The New York TimesHow a figure skating community lives with the loss of its future greats  USA TodaySkating Club of Boston performs at Frog Pond to honor memory of members killed in D.C. plane crash a year ago  The Boston GlobeMaxim Naumov Feels His Late Parents’ Presence ‘Everywhere I Go’ (Exclusive)  People.com",
    "published date": "Fri, 30 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNMlRLVVM0cFU5Znl3NjlWa0VPNTVhR2NUMGxQdTVTS01EOWlnVm5udkFPVGMxVExvQkZ0TEM3akNoYkRoa2xyaHMxV3JNN25XQktnT21yT3N3a0puUTNjbmYxVnZmekwwZkpwWWxiS3FvR0F1VFBVZXY1a2VDOXR1WFJTVlJ3am5pVHJlZ0R5T0tLYTZqQXcteVZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Pathetic NFL Fans Predictably Furious With Patriotic Patches On Super Bowl Uniforms - OutKick",
    "description": "Pathetic NFL Fans Predictably Furious With Patriotic Patches On Super Bowl Uniforms  OutKickSeahawks To Wear College Navy Uniform Combo In Super Bowl LX  Seattle SeahawksPatriots, Seahawks unveil Super Bowl jerseys. What history says about their selections  The New York TimesNew England Patriots to wear all-white uniforms in Super Bowl LX. What the stats say about that choice.  CBS NewsNew England Patriots reveal Super Bowl uniform with special nod to nation's history  WCVB",
    "published date": "Fri, 30 Jan 2026 12:52:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPbmZwRlZRejBfRjRpcnhqNDJwRlY4d01xNnQ5akRXc3BQU1gxajhVUFptMnFZYXBSWEhXTUlsUFVrRnQtRmdQMHNOSGVYY3duNGJDZU9DdDFnSGxia0hBb0E3NFUzdUlNdW5UbVduS3dhQkZWdTZmdlpsb0hYbEFHQ1JZV19NX0h3dTVqSENvcDBtS2NVckxoQW9Yc3FIRDJnX3J6OVRlTlA0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.outkick.com",
      "title": "OutKick"
    }
  },
  {
    "title": "Sharks Locker Room: Let’s See What San Jose Is Made Of - San Jose Hockey Now",
    "description": "Sharks Locker Room: Let’s See What San Jose Is Made Of  San Jose Hockey NowOilers 4-3 Sharks (Jan 29, 2026) Game Recap  ESPNPROJECTED LINEUP: Oilers vs. Sharks  NHL.comOilers' Connor McDavid achieves NHL history only ever done before by Wayne Gretzky  Yahoo SportsOilers finally secure three-game win streak with thrilling comeback  Sportsnet.ca",
    "published date": "Fri, 30 Jan 2026 09:11:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcDdYc0hiTGRpdlNpMl9sYlo0amNvZXFHc040NEFPQXlTSDFtQjBweVVHUllXMUgwZkhERHF2c1hYZ050b3pxTk1QVkVTU0NiV2EwZS11b2JQRmhrLVNnYnRxMlJ2OVhkOEx4VWFoUi1LVWF1QW04c2pCRTI4bTdOQng5RWtFdDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sanjosehockeynow.com",
      "title": "San Jose Hockey Now"
    }
  }
]