[
  {
    "title": "NBA trade deadline 2026 tracker: Giannis Antetokounmpo’s suitors dwindling - New York Post",
    "description": "NBA trade deadline 2026 tracker: Giannis Antetokounmpo’s suitors dwindling  New York PostNBA Trade Deadline: Latest reports before Thursday  NBATrade Rumors: Giannis, Morant, Alvarado, Knicks, Raptors  Hoops RumorsNBA trade deadline: Why Wizards and Jazz made stunning star moves  ESPNEverything that happened leading up to the 2026 NBA trade deadline: Reaction and analysis from early deals  The New York Times",
    "published date": "Thu, 05 Feb 2026 16:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPN0U5RzVSZjRPcGlDekZ5MldReV9kTVZmQmJ3X20ydWl1d1kzQ0xWMzhZeEczQnFwM1E2dm4teGxzUzEyODNXWVo2TnZUMEE4SzYtTG5zNFJKYkRjbHRIclVacGdwSzNUeGxtQ243UWZDOUhSTzN5blVhclBpMXBrVW54VkF0bnlrcVAzaEkyRkxWeUlsejllRmVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Five minutes into 2026 Winter Olympics’ first event, the lights went out on curling - The New York Times",
    "description": "Five minutes into 2026 Winter Olympics’ first event, the lights went out on curling  The New York TimesWinter Olympics 2026 live updates: Latest from the Games today with ice hockey, skiing, curling action  The New York TimesCurling 2026  Google DoodlesDuluth team wins curling match against Norway to advance in Olympic Games  kare11.comWinter Olympics 2026: How does curling work?  BBC",
    "published date": "Thu, 05 Feb 2026 09:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPdVQ5NVA1TG5mNXdDamFtNG9zaFpFYng3Rm9RaUtqbWYxazJaSFFRYVVfdTNReDB4MTFRel9xSVl4N3lnbFB1NE41RW55R2ZUejhwWmROaV9SRzFXQTdrUk5rbWllMkU5UjNfLUVJWHB3SDJNYjVkOTNZaHJ0Q096UWVmZmdQX2xvSkk3NmZIb0l1M01xa0RiNjA1Z2RYNUd0NktTRzVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "John Biever has photographed every Super Bowl. Here are his 5 favorite shots - The New York Times",
    "description": "John Biever has photographed every Super Bowl. Here are his 5 favorite shots  The New York TimesView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 11:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNzFPTnBlWkpGUWEyMkJpLUswbnpNelhIZ1BYSW5SVndVdjVYbFBkQXc3LWRwXzlfQjFYLUVTdEQ2WGR5MklhMWh2Zkl2eWFJYWFFcGZ5M1ZvTUxMVkVwTG1EMjJ1MExwX0xTODV4MGQwSlFhSHMxc2U4d0RhNWZYLUtMVWc5eG1IRm9vczJLc3k0UmY1d3pWRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Patriots Gameplan: Three Keys to Victory vs. the Seahawks in Super Bowl LX - New England Patriots",
    "description": "Patriots Gameplan: Three Keys to Victory vs. the Seahawks in Super Bowl LX  New England PatriotsNFL Super Bowl 60: Are the New England Patriots back? Drake Maye & Mike Vrabel the new Tom Brady & Bill Belichick  BBCSuper Bowl preview: Which Patriots players should the Seahawks be wary of?  Yahoo SportsNew England Patriots' quick rebuild, rise to Super Bowl underscores shifting AFC landscape  NFL.comWho has the edge between the Patriots and Seahawks in the Super Bowl?  Pats Pulpit",
    "published date": "Thu, 05 Feb 2026 11:02:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNWkxsaHl4eV9JSHVvWnQxTXA0bTI4emEwb3FDeGJrZTJaa3JLMXlNcVMtZEV2Wmg2dGdoLVgtbDl2TmVFcE1BTDZEaElGcUh1NHJvaGh1MEhOaTBGbGtrNUF3TS00Z2k5d002QXNKN0J5YTJKS19zMDlsOTgtbHg2RGRrZW1USDJjdC1DT0VuTWhMaGs3Mkt5UFhoRzRfRXpCM0kwVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patriots.com",
      "title": "New England Patriots"
    }
  },
  {
    "title": "Winners, Losers from shocking Anthony Davis trade to Washington - NBC Sports",
    "description": "Winners, Losers from shocking Anthony Davis trade to Washington  NBC SportsMavericks trade Anthony Davis to Wizards, sources say  ESPNWizards acquire Anthony Davis in bizarre deal ahead of NBA trade deadline; WM Phoenix Open preview  CBS SportsReports: Anthony Davis traded to Wizards in 8-player deal  NBAWhat I’m hearing about Mavericks’ Kyrie Irving plans after Anthony Davis trade  Yahoo Sports",
    "published date": "Thu, 05 Feb 2026 02:51:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNYmdrd1Y3NTd4NllyNVdfTzdjMVRCczJzLWhJcGREMXM3ZlZ4SkR0WGZCS0VfdWhzZzRfeVp3YlRKNVRPTk1rb1MzZEZXdzdld0VTVlFLNkxxS3R0MlU1cTV2SmotaXJuY0JZeFdtcmN0NmMwLTA0NDdmN0xVaUZmYXFMQ2JUUjdqTGQ0U0tiQ1lDM1Z4a0ZLOVB0YW11UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Seahawks have troubling new injury concern with Nick Emmanwori - Seattle Sports",
    "description": "Seahawks have troubling new injury concern with Nick Emmanwori  Seattle SportsSeahawks safety Nick Emmanwori injures ankle in Super Bowl practice  The Seattle TimesNick Emmanwori's injury news before Super Bowl 60 gives Seahawks fans flashbacks of Kam Chancellor  Yahoo SportsSeahawks rookie S Nick Emmanwori injured his ankle at practice  NBC SportsSeattle Seahawks get troubling injury news on star player ahead of Super Bowl 60  Yahoo Sports",
    "published date": "Thu, 05 Feb 2026 04:02:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQd0k3cUxpc3JRU1Z4NFE0Y2lNOXcxLThBQ05CRGpSYVJtbURJS2U3Z0dmNDNtSDRSckt2dEVfXzN5aVY5QXhuLXVXYXE2ZVN5bzJxYWZEbHVDcEtzTWYwUEJ6MzVBZi00LXdaeGZjOUpKbXcxS1cxTlJES0FRNzNXUG5BWlByckR3cjNYSVJnYWViay0tTXFQX20yZ1NxSGhWTE83ZEpCMmRqcGZhNF9mS1BzQ3hndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.mynorthwest.com",
      "title": "Seattle Sports"
    }
  },
  {
    "title": "Postponement of Olympic women's ice hockey game between Finland and Canada - Milano Cortina 2026",
    "description": "Postponement of Olympic women's ice hockey game between Finland and Canada  Milano Cortina 2026Virus delays Finland-Canada women's hockey Olympic opener  ESPN2026 Winter Olympics: Opening ice hockey match postponed due to norovirus  BBCFinland-Canada Olympic women’s hockey game postponed after norovirus breakout  The New York TimesCanada-Finland women's hockey game postponed after Finnish players fall ill with norovirus  CBC",
    "published date": "Thu, 05 Feb 2026 12:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNZzNkcGN5c0lfUG1CSXBnQ2drVjhYMEkzdk9Qci1haGpocVhMTUg3S2RjYVlOaVdzemg5dWl4cUVLQm1icTdlRjJPOHdQU19yVTQtd0NhLWpRS1dFMjlNRjZ0TEhMSDFRN3dyYlpzTzd3czhkVXB4alY0cGMwOElLVGx3TElGUHMzVE1ENXhGMkZxblNZNDRsam5Zc0VBQzJfZHAwelB3YzF4UFVXbGc1b2d6SklNSUtUZXRVdDVtQTVDYXFteUlpVDZ3V1A5OHFuR1p3aVpiVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.olympics.com",
      "title": "Milano Cortina 2026"
    }
  },
  {
    "title": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade - Cleveland.com",
    "description": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade  Cleveland.comSources: Clippers trade James Harden to Cavs for Darius Garland  ESPNJames Harden Is Trapped in Groundhog Day—and the NBA Is, Too  The RingerDarius Garland bids farewell to Cleveland, closing a seven-year chapter  Cleveland.comDonovan Mitchell opens up about the Cavs’ bet on James Harden: ‘We both want a championship’  The New York Times",
    "published date": "Thu, 05 Feb 2026 11:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOTGRSekUzWEtqOG9FaTFJZVpvbnV3QlE0cHN4Y3RIV3duNUhtbmtFdGpwdmpoclI2aDFYRFdkcmt5dzdvR3JrRkE5ODlWdkY2aXRaVVFkOU9rbi1OYkQxbTVnVUwzMkIzbVlxcVBkMk9qTzJGTHJMUzl2cE9KSnBJYUU3WFF5RVVnMnpzZ2w4djlIV183N2VvNHZSWUdDRDFyRW0xOW9vTElNNWp2cDJ1bVo3S0xFaDM3X1kwcWJQUGV4aVQ4bjhVUGZ3OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Winter Olympics 2026: Today’s schedule, results, medal counts and news - New York Post",
    "description": "Winter Olympics 2026: Today’s schedule, results, medal counts and news  New York PostWinter Olympics 2026: all your questions about the Milano Cortina Games, answered  The Guardian2026 Winter Olympics by the numbers: The athletes, events and milestones of the Milano Cortina Games  CBS News2026 Winter Olympics events schedule  The New York TimesHow to watch the Milan Cortina opening ceremony  NBC News",
    "published date": "Thu, 05 Feb 2026 12:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPVThZQk56MnZLLW5lRDdGenUzWnFjNXlKVW5iQ0RlLTNlS2xqS1FicHZLSDREV0d4RHgzRTltWGxPQnVYX3RqUm56MEtpajZxODVTZTdWYzFZUWZKMFRheUI2YXpNcU1MRTJSY1hrbE5TRU5xdm9JTS1YaWZRczhveXhFbWlEcTNZZ2ZQNzVZVEpIenVCdHNjYnI2TEJielV6aGloa2xhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Bowman Gray pushes through ‘wacky’ weather week to reach Clash completion - NASCAR.com",
    "description": "Bowman Gray pushes through ‘wacky’ weather week to reach Clash completion  NASCAR.comRyan Preece wins Cook Out Clash at Bowman Gray amid winter weather  NASCAR.comFox moves coverage of the Clash to FS2 mid-race  Jayski's NASCAR Silly Season SiteRyan Preece overcomes sleet, cautions to win The Clash at Bowman Gray  ESPNNASCAR Clash starting lineup: Kyle Larson, William Byron to line up 1-2 after qualifying at Bowman Gray  Hendrick Motorsports",
    "published date": "Thu, 05 Feb 2026 04:52:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNWXFISWdyNlBCV2tBY1RLZTBtdlJPaFYyd0cybFBWZk9RbWdGWmp1ZlA2a3VJWGtiekVYWENxNmwxZlpScTFqcDU1Y0l0VFRrU0VfYjM5Ml9GN3N1QUMwUGloNm5EQWxHcy0xNkxxTjBUS2dmUGppdWRGQlM1cTJEY0UxVi1TU3ZXQUZheFV5UmdvUksyZjBv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Reports: Warriors deal Jonathan Kuminga, Buddy Hield for Kristaps Porziņģis - NBA",
    "description": "Reports: Warriors deal Jonathan Kuminga, Buddy Hield for Kristaps Porziņģis  NBASources: Warriors trading Jonathan Kuminga, Buddy Hield to Hawks for Kristaps Porzingis  ESPNKristaps Porziņģis-Jonathan Kuminga trade grades: Warriors, Hawks take upside swings  CBS SportsSource: Warriors trade Trayce Jackson-Davis to Raptors for second-round pick  NBC Sports Bay Area & CaliforniaFormer Boston Celtics Teammates Reunited In Surprising Trade  Sports Illustrated",
    "published date": "Thu, 05 Feb 2026 13:05:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBCSlRHY2o4T2pqd285dFpROUg2eGptbU9KdHhzVmRsblNRMGdERU5PX1JEcTc1NDBkWG5lRE1GdUN1N0FQVVdwMDBVQ2M1MUhTYjFBWnM0MVVSckNlUHFGSGZGcWh0UVZLbmhrTWxWOXpyMXR1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "Sources: Bucks don't feel pressure to trade Giannis Antetokounmpo - ESPN",
    "description": "Sources: Bucks don't feel pressure to trade Giannis Antetokounmpo  ESPNNew Rumor Explains Why Warriors Never Had a Chance at Giannis Trade  Yahoo SportsLive: Timberwolves land Ayo Dosunmu, trade Rob Dillingham as NBA remains on Giannis Antetokounmpo watch  Star TribuneNBA Trade Deadline Intel: Timberwolves’ Pursuit of Giannis Antetokounmpo, What to Watch  Sports IllustratedGiannis on likelihood of Bucks trade: ‘I want to be here, but I want to be here to win’ - The Athletic  The New York Times",
    "published date": "Thu, 05 Feb 2026 15:36:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPLWpxc0RaZm5GcVRNTjV3WmQwcWdkal9LdU13SGhvQ18tOVpTREdGSDJwOE5sbEtXQTZOcjhNTVFOdVhyZzZFZlRnRlRwbFpXN3dJSFhQUk1qeldYTVd6SWNLZVZmbHpTak1SY19GaXQ0OVZzdHlKTFlWTEZySmI3a2xsTTB2eHJXQlRfc1NvVWtIbXAxY2ZpTGwtd0RaTzB1S3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Ex-Celtics Coach ‘Embarrassed’ By Rockets’ Disastrous Loss To Boston - NESN",
    "description": "Ex-Celtics Coach ‘Embarrassed’ By Rockets’ Disastrous Loss To Boston  NESNRockets' offense implodes in blowout loss to Jaylen Brown-less Celtics  Houston Chronicle10 Takeaways from the Hospital Celtics upset over Rockets  CelticsBlogHouston Rockets vs. Boston Celtics game preview  The Dream ShakeCeltics trade deadline tracker: More moves coming after Vucevic deal?  NBC Sports Boston",
    "published date": "Thu, 05 Feb 2026 07:34:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPaEdOelp2a1N0YnAxY0tQd3FiWWlRb283NVN5eWpVVHN6SWMtc3dmaTJ6enVYWDMxdC1jZ1ViS2gtckY2bVM2ZVlDNVB5bDhvLW1iRUlEVkhsZW9mMkc0YWJNaDZlRjNLdFUyUVhZNER3LWk5YXB6dWtFdF9SVE5wczhNQWRUalVUMTI5Sjc0VWRQOWhwVlHSAZsBQVVfeXFMT2pkOU5VZkUxdU5nRFZUcGdUOEVQT3J2R2JsalRMcS1XSWI4dktCUmI3T0ZmdVZiblpMZTFMcjBqdF9PdzhwYjZEWXc5c0JoSVQ1WGo1RHpCYS1TV09TcmZzWDV5TTFabmxmTERuVU1DZ1R1S0JHSHZraF9NWkwzT3RNUTlZY3ctZjZ5TGppUnFSdzZvdzNpc1VTV2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nesn.com",
      "title": "NESN"
    }
  },
  {
    "title": "Grading the Artemi Panarin trade: Rangers hasten retool as Kings show urgency - Daily Faceoff",
    "description": "Grading the Artemi Panarin trade: Rangers hasten retool as Kings show urgency  Daily FaceoffKings trade for Rangers' Artemi Panarin, add 2-year extension  ESPNWhat we learned from Chris Drury’s comments, plus an inside look at the Panarin trade  The New York TimesRangers Acquire Liam Greentree, a Conditional Third-Round Pick in 2026 and Conditional Fourth-Round Pick in 2028 in Exchange For Artemi Panarin  NHL.comKen Holland Speaks on Acquiring Forward Artemi Panarin  LA Kings Insider",
    "published date": "Thu, 05 Feb 2026 00:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNSFVuamdzWkI3X3lQM2VFc0w3QTVQazdBRFVaVUFERTVabFVDS1ZuUnYxYkFZN0JVbWh4ekVSY0RSb2VjRGRhOUdjQ3JoNFo1MHNKYVhHSHoyZWZUcTJrMFRVNDBaNWdaZ2JzMDJJTllUQ0Y3blhJT3FjQU56UE5mV2VvREVQRm53ZG92eGVIUFUwT2F0NUJNZTNScnAyOTBZRm15MUlTY2hpUGQ4cWRfQWJ1WFoyZUFsYnM4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailyfaceoff.com",
      "title": "Daily Faceoff"
    }
  },
  {
    "title": "From immigration to AI, 5 takeaways from Trump's NBC interview - Axios",
    "description": "From immigration to AI, 5 takeaways from Trump's NBC interview  AxiosFact-checking Trump's interview and a plan to promote marriage before kids in schools: Morning Rundown  NBC NewsNBC NEWS’ TOM LLAMAS TO SIT DOWN WITH PRESIDENT DONALD TRUMP FOR AN EXCLUSIVE INTERVIEW AT THE WHITE HOUSE TOMORROW  NBCUniversal News GroupThe Real Reason Trump Is Skipping the Super Bowl on Sunday  Zeteo | SubstackTrump Is Too Scared to Go to the Super Bowl After His Aides’ Humiliating Warning  The Daily Beast",
    "published date": "Thu, 05 Feb 2026 06:08:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQzd4N1BVMUd5NGpELTQyaHpQUHRTSC1Qb21kdFoxRUhILVgwZW0ybzBkbVMyeGs5VlhHcU5FZ0c4QldlZ1l4UEZHZFZ3MHRnLVZGM094aWJIeG13cER2VVFrS2NmY3lHV0J2Q0p3d3FKQzZQN1VFMjRSQ09pb21ObmtmV285U0FlUUtN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Analysis: No. 16 BYU hits rock bottom defensively in 99-92 road loss to unranked Oklahoma State - Deseret News",
    "description": "Analysis: No. 16 BYU hits rock bottom defensively in 99-92 road loss to unranked Oklahoma State  Deseret NewsHow to watch no. 16 BYU Basketball at Oklahoma State  Vanquish The FoeWhat Oklahoma State coach Steve Lutz said after an upset win over No. 16 BYU  Yahoo SportsOklahoma State hosts No. 16 BYU following Saunders' 33-point game  FOX SportsAnthony Roy Leads Oklahoma State in Thrilling Win Over No. 16 BYU  Pistols Firing",
    "published date": "Thu, 05 Feb 2026 07:24:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQbThxWlVTYWlnd2lwQ1hKcDFKakRHTHNWb2pqZFJITGltUHp1SENOTENMN3RWOWlfdnNmS3NFVnhtWm9USHlHWXViVXotODFPREZzdFlSWjhjRjZkY1d6NmtXakJRMFNheXRjTEZIZ1VsazZKemRycnRfZUZ4QlhKdmx3eW5zZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.deseret.com",
      "title": "Deseret News"
    }
  },
  {
    "title": "The Winter Olympics get 8 new events, including the first new sport in decades - NPR",
    "description": "The Winter Olympics get 8 new events, including the first new sport in decades  NPRSkinning, boot-packing and downhill skiing: welcome to skimo at the Winter Olympics  The GuardianWhat Is Skimo, the New Sport at the 2026 Winter Olympics?  CNETDo you know what skimo is? Could Vonn and Shiffrin team up? Here's what's new at the Olympics  AP NewsEverything you need to know about ski mountaineering, the newest Olympic sport  Los Angeles Times",
    "published date": "Thu, 05 Feb 2026 12:05:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOaFlQOEd3MTVKWDNUU2JyeTNpdzFHVXIxdVlBRkdVT3hBcEdwRUxQZWFZajhkTHFvWVRCN3l0a3dZRVdvR2JKRmJJbC03ZkthR3NJeC1FbTRIWE9GclY3ME53TE03N2xreUNRS1dZc3VNYlhmQXVGMnlTNV9vSmFjVWRlUG56NjBrTWFqZFAyYmlXenVo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "BYU coach disappointed by anti-Mormon chant during loss to OSU - ESPN",
    "description": "BYU coach disappointed by anti-Mormon chant during loss to OSU  ESPNBYU basketball coach Kevin Young condemns anti-Mormon chants from Oklahoma State fans  The OklahomanBYU coach Kevin Young responds to anti-LDS chants at Oklahoma State. Here is what he said.  The Salt Lake TribuneBYU coach says 'F The Mormons' chants at Oklahoma St. show there's 'too much hate in the world'  WRALBig 12 investigating Oklahoma State for 'inappropriate chants' during BYU game  CBS Sports",
    "published date": "Thu, 05 Feb 2026 11:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQSGloS25xaHFDSVJIbHdxMkFFVDhQYW50Slo2cTVld1B0QnBEMnNUZy1pU3Q1OTgtanJzQ19TX182a2ZadzFERk9HYktrbmxMaUhXbkNUUUl4OUkxdVpxRFlMeTYzVHZwaUFIbEtxQUJuNXlMSU9mcnNabTVmeFN5WmNVNGRxSVJra2p5NkFHYm1mUmZvQVBiSXpHX0VGUmRRRFAtV0dGMXNDSW9wbkROYmFrUDI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Doberman pinscher Penny wins Westminster Kennel Club's Best in Show - upi.com",
    "description": "Doberman pinscher Penny wins Westminster Kennel Club's Best in Show  upi.comThe Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesDoberman Pinscher Who Won 150th Westminster Dog Show Just Made History  YahooPenny the Doberman pinscher wins best in show at 150th Westminster Kennel Club Dog Show  CBS NewsPhotos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPR",
    "published date": "Wed, 04 Feb 2026 07:10:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOOFB5UU5mX29SSDhFWWRJOVdZYU1sVTNVRmRKQXpyR09HNktEaWVvNHJpNUFybV9QN2JFTmYxVFVJNFh6SzJvejB2VHFXTEE3VDFGRVF5N1ZmX1VxZjV0alFKLTAzbVR0OVkzdWVKQk1IWkxoSW1HRHR4TEluXzlORWxXZGtxSDFfS29iOXdwczZ1b3JMcUVZbmdONGxRekhQdlNULUQ0c0NjNnoxRTB0dDBDejY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.upi.com",
      "title": "upi.com"
    }
  },
  {
    "title": "Iconic Eagles coach leaving team after messy ending with Nick Sirianni - New York Post",
    "description": "Iconic Eagles coach leaving team after messy ending with Nick Sirianni  New York PostJeff Stoutland will no longer be Eagles OL coach after 13 seasons  NFL.comOne subtle message some missed in Jeff Stoutland’s Eagles farewell  Yahoo SportsWill Giants’ John Harbaugh try to persuade coaching legend to join him in East Rutherford?  NJ.comVic Fangio adds drama to an Eagles team that has plenty of it | Marcus Hayes  Inquirer.com",
    "published date": "Thu, 05 Feb 2026 14:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQU09IR1dGSmxfbGY4TXVXd1NEXzN2aVdtTUlKeXAwdkIwd0ZoU2xreDBHMmYzVVNvT19kdnh0YUpaQVFINjBfbXowQVlwMGtpY28zR2FKLWt5Y0VRYWZTMjlHRk1HVGYwMlk2czlURGZTbzNSMEdjNWhnQ1FoUUlNaUkwQ0xidGdMWGdNSngxaWdicXZid0s5dEs0NzZwMzNCVjV4UzY1LW5oa203?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "How to watch the 2026 Waste Management Phoenix Open on ESPN - ESPN",
    "description": "How to watch the 2026 Waste Management Phoenix Open on ESPN  ESPNExpert Picks: WM Phoenix Open  PGA Tour2026 WM Phoenix Open Thursday tee times: Round 1 groupings  GOLF.comValue Report: Waste Management Phoenix Open  Establish The RunWM Phoenix Open picks 2026: Is anyone beating Scottie Scheffler?  Golf Digest",
    "published date": "Tue, 03 Feb 2026 01:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQa0hPNXpEeGc0UjEycGh6ZlN0SGN5R2JBN3luakRoaFRxUHM5Nmxtb1BuTXZvUXRqR29kM3l0cExCUlJHc3JhdzB1bEJkRU1UNFhMemVMYTB0aGx4YjhFcDRaaXMxMkhmeEwxdExJUEdVWm1vdkpETVdraWt4XzVHamgtYVpVamVISFNBZjhxaDF2STJRSXJhektn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Team USA settles in to athletes' villages, 'smash' pizzas - NPR",
    "description": "Team USA settles in to athletes' villages, 'smash' pizzas  NPRReporter's notebook: A peek inside the Olympic Village  NPRWelcome to Team GB’s Milan base: TV, games, popcorn and 5,000 teabags  The GuardianSee how athletes live at the Milano Cortina 2026 Olympic Village  USA TodayInside Cortina’s Olympic Village: A snowy haven for hundreds of athletes  AP News",
    "published date": "Thu, 05 Feb 2026 11:57:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNLThQYWRmd3VnR2xRMG5JSzFTT1RjNDlTTU9lbTk4NzdwRUk5eEt0M0dFcUEyek9WTllCZVJfdDMyRkZPaXNOU201VUtJdUFQcnpZTHJCVS1aM0o2eGNnSWllVWtZTXBWd0lpNndncVIzTEJ3S25lODlQdE9zVEtZdTBVcGI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Tigers pull off late free-agent stunner, landing top pitcher on market - MLive.com",
    "description": "Tigers pull off late free-agent stunner, landing top pitcher on market  MLive.comSources: LHP Framber Valdez, Tigers reach 3-year, $115M deal  ESPNElephant Rumblings: Lefties, Lefties, and More Lefties!  Yahoo SportsTarik Skubal’s message to Framber Valdez after signing with Tigers  Detroit Free PressFramber Valdez signing with Tigers: Top free-agent pitcher finally lands three-year contract, per report  CBS Sports",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPVXlZaE9wdGVVbHB5T2lzSVJVTWxtRWstM1RMVUJwSzNMdXZrWHVWOUlCOHlPR2dxX3NEajFrTG9ZTzVsVWV1QmpxWEVBLXF6WndFTU4yYzJCdGIzQ2ZWTV9YSmlRZ3ZJVndyMlFIdzVhQzNZVEVMaWVtVWdFNnN4TElKRDl1T2hzLWNsVUFvSnVxOFA0OWc2bGdVT0Y2X3VrVlh4YTZFSmhCOUg1TWxFNdIBxAFBVV95cUxPUnRBSFBvNW42TUZoNzhUcmFGcG1SbmZ6ZVc1UG1oWVc4YnAxN2lxQW9PS0MxTDRoMzdOR3hZUWNpTjJvbVc3UWlDT0swbFJxeHNuZ0otd216bUV1V3V6ckhWNHBfNjl6RWs4UXRERlhtM21fWGpQV01PaFNDNVgxSHFNaXpaYWx4dHFDOFZYS1Nha2Y1R0tFWW1COXkxblpzNWVESGpDb0RnNXpndGJybXljQUYySmtqY1F1d1ZMSnhZdnFj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlive.com",
      "title": "MLive.com"
    }
  },
  {
    "title": "‘All It Is Is Pain’: The Olympian Testing the Limits of Endurance - The New York Times",
    "description": "‘All It Is Is Pain’: The Olympian Testing the Limits of Endurance  The New York TimesIn her last Olympic season, US cross-country ski phenom Jessie Diggins looks stronger than ever  NPRTo be the best, Olympian Gus Schumacher had to learn to lose  Alaska Public MediaCross country-Led by veterans and rising stars, US poised for podiums at Milano Cortina  ReutersCross-country skiing at Winter Olympics 2026: How to watch Jessie Diggins live – full schedule  Milano Cortina 2026",
    "published date": "Thu, 05 Feb 2026 10:01:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWWwzUEpNUHhJcWQzSngyNzgwaXh2eXpqSDdBT0FaWmtwemZDWTk5Z0JfaVdhYUZaelVnd2JPOWl5V1B4UVpaWUNmYWdRaWRzREtIR1d5VFdZVXV1OUw4WUVfWDBzaHMyWmRObVJOOVlTdkdPZFZfcVNUcGktRHFjcVFEMF84R0hPdVdEdVI3SUFsVmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "CRAWFORD | No Pryor restraint: Forward returns to spark Louisville past Notre Dame, 76-65 - WDRB",
    "description": "CRAWFORD | No Pryor restraint: Forward returns to spark Louisville past Notre Dame, 76-65  WDRBWhat channel is Louisville basketball game vs Notre Dame on today?  The Courier-JournalLouisville bench comes through again in 76-65 win over Notre Dame  247SportsA Major Wrinkle For Louisville Basketball  Busting BracketsNo. 24 UofL rolls to win over Notre Dame  WLKY",
    "published date": "Thu, 05 Feb 2026 03:52:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxNd3pWUGRET0ozNTN5QkNlWnI1Um1tcmNJZUNKaFh2WVZwVW9CZmFBTFlWb0VvTjF6RFVXXzVMYUVwUlFMSDdwMkxQV1VMby1KeGo4ZWw3WGhzdGN3OHBDSnhUMHZTZEFIRHBoS0lmV3YtV2ZyTXhmWndFMmhfckppd3NqMWxZaW10NHVoNjNxNGdxaXNISWt1aXluZFh1SWNGdnlTTU1va3lxdm1JLXJWR2JiUU9vQnByaDdaYTNveWdOSEFJR1F4VjFSRmxQZUtVMkdrcFRXMUo5cVR4QXBtMWVFMlFNSWI5QWdySk9JbzhzZThQWnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wdrb.com",
      "title": "WDRB"
    }
  },
  {
    "title": "Tom Izzo Speaks Out After Jeremy Fears Kicks Minnesota Player in Groin - Sports Illustrated",
    "description": "Tom Izzo Speaks Out After Jeremy Fears Kicks Minnesota Player in Groin  Sports IllustratedIzzo threatens to bench Fears after tech in Michigan State loss  ESPNTom Izzo chides Jeremy Fears after technical foul: 'He ain't gonna play that way'  USA TodayCouch: Michigan State's Jeremy Fears Jr. is in danger of being defined by his antics  Lansing State JournalMichigan State Star Turns Into Ric Flair With Dirty Tactics in Upset Loss to Minnesota  Yahoo Sports",
    "published date": "Thu, 05 Feb 2026 03:57:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPODZmTmduTEZMYnJwUWstSEZacGt3TFRqbnd1c0lDbkFnczFMeGFoZGNmZHZqTV9RenJSeEVjTkc3dC0wRkRfR3dfVnRnb1BrdHJNOTFzVnh0eGpGbDdoeHZiejJKX0JVUVFpNjdMczJjQW9fQy1kdDlEOWFQakQtUjE1bEllSmlxTjA5czZGOTdKenhGNTc4MlNVU2k3c045YzNLTnFaeVc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Lindsey Vonn's latest Olympic quest isn't perfect, but it's her own - NBC Olympics",
    "description": "Lindsey Vonn's latest Olympic quest isn't perfect, but it's her own  NBC OlympicsCoach: Lindsey Vonn has no workout pain, confident she'll race  ESPNLindsey Vonn trains with knee brace after completely rupturing ACL one week before Olympic return  Fox NewsLindsey Vonn will try to race the Olympics on a torn ACL. She wouldn’t be the first  The New York Times'She's gone completely mad': Lindsey Vonn's improbable comeback is poised to ignite Italy  Yahoo Sports",
    "published date": "Tue, 03 Feb 2026 23:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQWmE0al9wbTFsaVN0VGkzeE9oWFJOSG5hWnlkNHh2S1lTT09IUGlLWFRLZHI5R0hERmtoM0JSWnp3WFMzLW41N0ljU21RQlBCQ29jN2hNT1QtRnRINGlYQVFSSEtSV1hwa3NKejdnM0lHdE5PLVVnTUZTQkVQdXdBbkNrVFRGZDB3SVp5ZzJFQ1FzT3lYM2dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Bulls To Trade Ayo Dosunmu To Timberwolves - Hoops Rumors",
    "description": "Bulls To Trade Ayo Dosunmu To Timberwolves  Hoops RumorsView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 14:59:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdVR4QUtsa012em01M0pDWXpGdEFHUFZJemhGXzFsUXlfZjIxb0dSVU9JdEtkNUVQZFZPQ1BEQzJmYzhJNUJlYWlUcndZeEZ0enJHazRnMFpNdGVyV0hkblUzN2oyZGw1SFlBSlh2N3lTQ3ZfdG9XdmlmaTZ2MUoybHI2QkszNzhPYXc4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hoopsrumors.com",
      "title": "Hoops Rumors"
    }
  },
  {
    "title": "UW men's NCAA tournament hopes take hit with loss to Iowa - The Seattle Times",
    "description": "UW men's NCAA tournament hopes take hit with loss to Iowa  The Seattle TimesThe many layers of Iowa basketball's riveting win over Washington  Hawk CentralIowa men's basketball picks up its fifth consecutive win at Washington, 84-74.  thegazette.comIowa Hoops: Hawks beat Washington, 84-74, in PNW sweep  Black Heart Gold PantsIowa basketball provides Tavion Banks injury update vs. Washington  Hawkeyes Wire",
    "published date": "Thu, 05 Feb 2026 07:52:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOcEg3UTlGT1NJWGFrLXBrVktzeVNrUHQzVDFZNnB5WVNHQWE3ZmRiOFFKU3BneENDX2tabGhMTlg0Zlg5SzhpSmhoLURUNTFsb3NQTldnNU54Rm5GWU8zdnR6Z1RHeDM2LWtuT0VodHVWX05OUnRJVEhXNTF3cW5VdHU4S3YtMmpYc3hPYWVHcjBOTEtkQ3NaQUk2WDlORm9ZZE9VT3VMT1QwSnJpSHlMMzR1eFdTR0N5eTVtTDdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Top NHL Draft prospect Gavin McKenna charged with felony aggravated assault - The Athletic - The New York Times",
    "description": "Top NHL Draft prospect Gavin McKenna charged with felony aggravated assault - The Athletic  The New York TimesTop NHL prospect Gavin McKenna charged with assault  ESPNGavin McKenna Facing Felony Charge After Incident On January 31  Onward StatePenn State hockey star Gavin McKenna faces felony, accused of assault in State College  Centre Daily TimesGavin McKenna, potential No. 1 pick in 2026 NHL Draft, reportedly facing assault charges following off-ice altercation  Yahoo Sports",
    "published date": "Thu, 05 Feb 2026 06:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNTVZ1YjNlNWpHb0R3UkJkejM5RXA1YldXUEdmTE5DM1o5QjhHeHc3MUNLZVlLRzZYSklRSjl0ZEZlVTU2c1o3U0hIOENobjNOM2drUF9mSWM3WWVBM0xSWVBjcUM5V3gzdnc5OEU3bjFRS3lySlo4VnZRMEJNeGZuTklGLVJ6R3F3WlZiOGRLNlAtbEphN2RpN0ZJWFB5aF9kSUFzSWNVU2JSbW9E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Jets Hire Frank Reich as Offensive Coordinator - NYJets.com",
    "description": "Jets Hire Frank Reich as Offensive Coordinator  NYJets.comView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 00:41:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNMUdSU051Z1U1Yk1xS2ZTUnFFSzNuM2ZPNEVXYi01bF9HU2VpVGt0aDl0LUh1b2pqaVRUM2Z3OHJ1WGV3UWNjZ19WSUtKSThJMnNKeG91ZGc3NS1ZZGJVQ2dROUFndzdZLUhDOXgwb3B1WS1NSktRUUtLNm9JQzQ2dHhZc0VhWm9LNFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newyorkjets.com",
      "title": "NYJets.com"
    }
  },
  {
    "title": "As NIL, transfer portal dominate recruiting, the nature of the UNC-Duke rivalry is changing - Daily Tar Heel",
    "description": "As NIL, transfer portal dominate recruiting, the nature of the UNC-Duke rivalry is changing  Daily Tar HeelThree things to watch as UNC Basketball takes on Duke  Yahoo SportsChansky’s Notebook: Bluest Bloods  Chapelboro.comWhat Caleb Wilson, UNC basketball players said about Duke rivalry  The Fayetteville ObserverKnow Before You Go: ESPN College GameDay  University of North Carolina Athletics",
    "published date": "Sun, 01 Feb 2026 19:24:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQRkMzeVdfWlBZSDQ4LUVyNkxjVDE2eWN6MDJhdkx5aWpfYkNTZzhGVG5HbWpEVHhCOFR0aGFPTktkNzhvb0U1LXVVYi00TGFYeDZaT0dfajdhVzE1WjJTaXV4bGUxVHNqeFB5NzhUck9BQ2pHVk85RkV4NklBbzlyZm8zN3VGNkNRZi1sTzJKLXBKd05rVThXTVl1QWJlLVg2TXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailytarheel.com",
      "title": "Daily Tar Heel"
    }
  },
  {
    "title": "Reddit thinks Andy Reid quietly sabotaged Bill Belichick’s legacy - Arrowhead Addict",
    "description": "Reddit thinks Andy Reid quietly sabotaged Bill Belichick’s legacy  Arrowhead AddictTom Brady casts doubt on first-ballot Hall of Fame chances after Bill Belichick, Robert Kraft snub: 'I should be a little concerned'  Yahoo SportsWho is the Chiefs’ biggest snub for Pro Football Hall of Fame?  Arrowhead PrideSources: Robert Kraft not voted for Hall of Fame Class of '26  ESPNTerrell Owens calls Hall of Fame process 'broken' after Belichick, Kraft snubs  CNBC",
    "published date": "Wed, 04 Feb 2026 13:38:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOc3lYcVNKbTd5UWpzWkVBdU5zcS10X2ljajBUZERDWGxyNFVzT0lEREVvaktJWUtWb1lQc0xqTEVsR2JFWUFaM3NBQjlrdjR0c0ZfTDNiYjdwN3pLNll3RjZxVUk2WjBhTlZ4WWRUblBRTGFYclpYdzViS2ZjR0hOekxyLTB4YVQxSWx5QzNDaWdHeTMxcUVUUUZWSlJPWkJDaUdYM1h0aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arrowheadaddict.com",
      "title": "Arrowhead Addict"
    }
  },
  {
    "title": "Lengthy injury report leaves OKC shorthanded against Spurs - San Antonio Express-News",
    "description": "Lengthy injury report leaves OKC shorthanded against Spurs  San Antonio Express-NewsSpurs 116-106 Thunder (Feb 4, 2026) Game Recap  ESPNThunder vs. Spurs prediction, odds, line: Proven model reveals 2026 NBA picks for Feb. 4  SportsLineSpurs Outlast Thunder, 116-106, in Gritty Home Win  Pounding The RockWhere to watch OKC vs. San Antonio: Thunder are sidelined by injuries for the Spurs matchup  News 9",
    "published date": "Wed, 04 Feb 2026 20:44:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNSmwzb19OdURCMHFVMVFORUJSRGxleWIwdnRtVkVENXdKRzMzYUlXdFNGM3FlSmhpQkRXNHlFZ045Q3BYZDF3X0xESXhZSHRjTDZPY3ZHR0M0Ql91Nko0ZHJ6YnR2TExYV0Z4V3VXNHJYU0pVS3Q0blBHMDhzVjFWdkxZSGVUUG5IRlN2WllqOUlMX2V5dkEtVW9uM3BxdEVSSnFmMFlmZHFGT3F6WWk2MnVB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.expressnews.com",
      "title": "San Antonio Express-News"
    }
  },
  {
    "title": "Super Bowl LX: DVOA Preview - FTN (For The Numbers)",
    "description": "Super Bowl LX: DVOA Preview  FTN (For The Numbers)Super Bowl picks, odds, score predictions for Seahawks vs. Patriots  NFL.comWhen's the last time Patriots and Seahawks played? History, playoff record, more  USA TodayWhat time is kickoff for Super Bowl 2026? Date, time, how to watch  Democrat and ChronicleThree key Super Bowl matchups, from Sam Darnold vs. pressure to run game  The New York Times",
    "published date": "Wed, 04 Feb 2026 15:15:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1GaHZuaVNtcDYwNUc2X0xobE1KbjRDUjJVX0JTRUNWbG9fWTRWcmVsNkNLdVVLMVQyNUxYTXM1cUZyRmtPWGE2ckl0MVE3NjJXbkxieDFiVGpZMkFtX1BmaWdUSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ftnfantasy.com",
      "title": "FTN (For The Numbers)"
    }
  },
  {
    "title": "Projected Lineup: Feb. 4 at Dallas - NHL.com",
    "description": "Projected Lineup: Feb. 4 at Dallas  NHL.comStars 5-4 Blues (Feb 4, 2026) Game Recap  ESPNHeika’s Take: Deja vu strikes again as Stars defeat Blues late, win six straight  NHL.comStars vs. Blues Prediction, Odds, Picks - Feb. 4  FOX SportsGDT: Stars vs. Blues (8:30 PM CT)  Defending Big D",
    "published date": "Wed, 04 Feb 2026 19:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5oV211RkVUVGl6MXNESlJoVEFVaF9FNHQxVVhiRHpqVmpub1BXOGl0Yzd0bDV2UlIyUjJnOUVCM2o4ZVJPLTNIVVJYUGc1eTQxREtKQnlqcGNIU2RuN3ZuWDlYbnBQN2RIaDc5TnItMWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Super Bowl live updates: Block parties, concerts happening all week long in Bay Area - ABC7 San Francisco",
    "description": "Super Bowl live updates: Block parties, concerts happening all week long in Bay Area  ABC7 San FranciscoCongrats, Your City Gets to Host the Super Bowl. The Party’s 40 Miles Away.  The Wall Street JournalFree Super Bowl events to attend in SF  San Francisco ExaminerTraveling to Super Bowl LX? Here’s what to see and do in Santa Clara.  Boston.comThe Super Bowl will be SF’s ‘boom loop’ reset  The San Francisco Standard",
    "published date": "Thu, 05 Feb 2026 15:56:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPdC1EU051aE03ZVRIWUR3SzFqNnN3WTMxRGUxU250ZmtwTnZTRW9oUXUxbzhHaHpTLUxyek1vTGdfcUs4cGhIQmFBMjVpcXhjMlpQXzB1M25kZ0EyeDQ4Ym52bzZMYk9mX2VJdHQyWW85NW4ybzZvQ0pZQjBia1RCSzA1RDdBa2g2dmJqaEF4WHJ0cFo0eFkxVENWNmp3ckU0Mjc3MnZORmJDczkxOWxWYVhzNkhvdEd0dHVLalQxUXJleUJCcUNzZWRKMEpfSVg3OUkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7news.com",
      "title": "ABC7 San Francisco"
    }
  },
  {
    "title": "Three Keys & a Pick: No. 5 Illinois vs. Northwestern - 247Sports",
    "description": "Three Keys & a Pick: No. 5 Illinois vs. Northwestern  247Sports#5 Illini Set for Orange Out Wednesday vs. Northwestern  University of Illinois AthleticsPlayer Grades: Illini get balanced, full team effort in 84-44 rout of Northwestern  247Sports3 Things to Watch When Illinois Basketball Hosts Northwestern  Sports Illustrated3 keys for Illinois basketball to get a sweep of Northwestern  Writing Illini",
    "published date": "Thu, 05 Feb 2026 02:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNRUJrZVJpRnBFY3FMcUJwQzFwSUhMcmRQUDItUmx2ajZ6YmRCd0phdVljSUU5Qlh1bWNvSmZkR2FYTlZJTjI1QnJ3OXJoUHhpWUUwdkRTY3liZlR0b3R2T0hOOGZTS0dFSG11Y3FCWlBmTkNkZS1iTGpYX3ctaTJBUlBUV1NhdjJ0Q29MemdUd2hyTXhQZldKV3dyczR0ZGhXRWhHVVJMbWcybWVHS3NMQUFrMTlxYkk4MXozeWN3RQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://247sports.com",
      "title": "247Sports"
    }
  },
  {
    "title": "Steelers hiring Brian Angelichio to be offensive coordinator - Pittsburgh Post-Gazette",
    "description": "Steelers hiring Brian Angelichio to be offensive coordinator  Pittsburgh Post-GazetteSteelers hire Brian Angelichio as offensive coordinator  ESPNSteelers add to coaching staff  Steelers.comSteelers hire Vikings' Brian Angelichio as offensive coordinator  NFL.comPaul Zeise: Brian Angelichio will be an excellent addition to Mike McCarthy's staff  Pittsburgh Post-Gazette",
    "published date": "Wed, 04 Feb 2026 19:17:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPZGMxSXExdVd1eVdHS3RVdVJNMGdqZnVob2JnRGNIeU5QVV9fX29uaGppMGM4Vm9Cc3V1UlZWZ2h2Y2QzaDJvM1lsVnpkbWoyMEhEd0M3QkdTOXlMMC16ZG5tRUNDaHdEdWJhY1dXX2V4REt3WWpGblUxVG4wNGpwS1ZzWFc0bmVieWd3QWhuanAwVFBTWEpCYzZFREJwTzR0N1RnUWNQcVpVdE9TZkZpSHV1WTJ4RHVsTmc3YlVzMTlhNmVCaU4w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.post-gazette.com",
      "title": "Pittsburgh Post-Gazette"
    }
  },
  {
    "title": "UFC's Jones needs hip replaced, still wants fight at White House - ESPN",
    "description": "UFC's Jones needs hip replaced, still wants fight at White House  ESPN‘I have severe arthritis’: Jon Jones reveals damage done from fight career preventing Daniel Cormier wrestling match  Yahoo SportsAfter Viral Video, Jon Jones Claims UFC 'Knows the Extent of My Arthritis'  SherdogJon Jones Addresses Health, Reiterates Desire To Fight After Viral Clip  TMZPotential UFC White House main event in doubt as MMA icon has 'severe' condition  The Sun",
    "published date": "Wed, 04 Feb 2026 19:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQdVExQmxpTDJrSUlIc2M1QVM3bFg1b0NGX1MtaXZ4dTFqTXlXMW9wb09ZOHltUFBaN2d1bFdBM2pMQ1h6bm1HMGs2N08zaXBhUEVGNHoxNjFfcHdPN1J5eEptRjl0M0NCaFVQejgtN05zOXVtVnRYRTFLdFlONkFIREwyRmlLb1BfOGR3YjB6UW8zU3RqalB2WmxOS3IwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "5 things learned from Packers GM Brian Gutekunst’s news conference - Green Bay Packers – packers.com",
    "description": "5 things learned from Packers GM Brian Gutekunst’s news conference  Green Bay Packers – packers.comPackers looking at \"different angles\" to make sure they finish stronger in 2026  Yahoo SportsCompete for Championships? Packers GM Brian Gutekunst Knows Awful Numbers  Sports IllustratedBrian Gutekunst: Packers must work on 'finishing games' in 2026 season  NFL.comPackers GM seeks solutions after second late-season collapse  ESPN",
    "published date": "Wed, 04 Feb 2026 21:22:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPSEppSUp2QjJZemlBNjE2bkFncmZyRXQtZHRrbkt1eVl4eExfWVhHaC15Ri12VERPckxuQkdWcjIzQ1BCSFc2aFpISHhaajREWEtUeUJhT0g1aGxLaHVpOUh4alBqZXkwZG1ENWNxVDV4dHFPeURaSnRPaGV4UWpDdzl1ekRiMDBFQlN6X0g4N1VJcV9yQjAtU0xGZUNjQ2RUQjkyU2pqZTAtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.packers.com",
      "title": "Green Bay Packers – packers.com"
    }
  },
  {
    "title": "A Logical Place the Dolphins Could Turn for (Once Again) QB Coach Vacancy - Sports Illustrated",
    "description": "A Logical Place the Dolphins Could Turn for (Once Again) QB Coach Vacancy  Sports IllustratedSource: Cardinals' Mike LaFleur hires Nathaniel Hackett as OC  ESPNCardinals to hire Nathaniel Hackett as offensive coordinator  NFL.comDolphins' new QB coach is leaving after less than a week on the job  Dolphins WireEx-Packers OC Nathaniel Hackett joins Matt LaFleur's brother in Arizona  Milwaukee Journal Sentinel",
    "published date": "Wed, 04 Feb 2026 21:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNeGF0ckxTeUc0ZndPeVUzTFA1MmdWUm9jRERFRW0zSUk0NEhweDFUUDVQOF81VlNyUlhBSVFSai1lYmFTVGttNFVFQWQ3UTRXaXAyOHNoZXJ3MHBWSzdaa3padF82VUlpbE45MTJIZDltVWpXOE9XNDdsLXhwdS1faEo5UUgycl9XV1J5OUNhR2xjb3ZzNGpESnlHMW9RNDlMeWVEUmlrWjBPQWhlaDBSSFZmNFhMZ1g3eWpPMHFIOUlQdnVH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "NHL Stadium Series doubles viewership of Winter Classic - Awful Announcing",
    "description": "NHL Stadium Series doubles viewership of Winter Classic  Awful AnnouncingLightning’s Stadium Series game vs. Bruins receives record viewership  Tampa Bay TimesBruins and Lightning excited for colder-than-expected Stadium Series in Tampa  ESPNNHL Power Players enjoy 'electric' atmosphere at Stadium Series  NHL.comBruins 2026 Stadium Series RECAP: B’s can’t overcome penalty-laden 2nd half in 6-5 SO LOSS  Stanley Cup of Chowder",
    "published date": "Wed, 04 Feb 2026 21:33:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNM0ZxTjRKTzZLM2pKclVYM2RpMkNhcUx5dWhhLWgxTkQ2Yk4zWmpqeE10ekRxYV8teG5lQ3ppS0dWMFN2ZFBlMDlLQ1o5cXNENzUtMW1YQjRfMDFwQlE1dlBpZmkxZ0FQLWJUTVVhTk9uX2Y0M0ZfZlZRYnZsMnZOeEpJLWVDNGNXMTI3TFFUTXpNZ9IBlwFBVV95cUxQUGhiS1FkM1o3RXloa3lJSmZOQXhfWllDY0VQVERrWDJxd3NZVm5fQmdManpONGdBMU9iMUNaRTRjc1pRdnJIdHpQcW5iVnVMdGJjWjNwVFpXZjNjOVBsWkVIZE5Wb0lfTXJVb2pSTGpiVXFQbmtSQzNFQzc4b29VclN0NXJ6LXpUNWdQYW1NSzVWZjVnQ2RJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://awfulannouncing.com",
      "title": "Awful Announcing"
    }
  },
  {
    "title": "Italy Thwarts Russian Cyberattack Targeting Olympic Sites - The Daily Beast",
    "description": "Italy Thwarts Russian Cyberattack Targeting Olympic Sites  The Daily BeastItaly foils 'Russian cyber-attacks' at Winter Games  BBCHow 2026 Winter Olympics Security Is Preparing For The Opening Ceremony  The New York TimesFOILED: Russia-Linked Cyberattacks On The Winter Olympics  HuffPostRussia-linked hackers target Winter Olympics in Italy  Financial Times",
    "published date": "Wed, 04 Feb 2026 15:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOUnRIRTNEamd1bFZ2WlU0cEE0emNVZFhTZ09NLWIxMG9UVk5saGNFdVpwX2ZmX2xMRFZlU2p4MEdnS2w1dng4N3EwOXF2MWJIdS1nVjhVWWxGaS1hQjcwWUlpMW51ZmxHUHFWNGtJZHNoWUhIODdOc18zVkNCUVF3YS0td2JkUWtoWW1uUVhZc2hudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Rob Gronkowski responds to Tom Brady not having rooting interest in Super Bowl 60 - MassLive",
    "description": "Rob Gronkowski responds to Tom Brady not having rooting interest in Super Bowl 60  MassLivePatriots Legend Has Funny Theory For Tom Brady’s Bizarre Super Bowl Pick  Yahoo SportsVince Wilfork on Tom Brady not having a “dog in the fight\": “That’s bullcrap”  NBC SportsBarstool’s Dave Portnoy Breaks Silence On Tom Brady Super Bowl Controversy  NESNTom Brady not pulling for Patriots in Super Bowl LX: 'I don't have a dog in the fight'  NFL.com",
    "published date": "Wed, 04 Feb 2026 23:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQSTNsd09kaGh3Y2otcG9QNW1Fdy1YMmMxVVZfV0FjRW16dE1ncXZla0p6WmRWQTRlYU5ySl9NeE9OdXF2amRwVHdJcDBDLV9sZnhLQjZwY1dRaUwyQVM1b1d6WmphQW42NXR4cVI5eHBhZ3dwekcxNkY1MlBUYzhDSkg4R2dWQ2dzcFFSVWU5djExWG0wS081TDhIbHJHT2dNOUhLb1JsLXdLNU52eGJIYXJLSXJsWFNSOXdZeW5janhwNFpRN1JF0gHbAUFVX3lxTE9RdE1uMHItLU81OTA0QmVDcV9kTlRUQWVUdEVmZVZtWnZVNUYtV1FucXZwQzNuaUp0REVkLUdTcy1DSTItT0p1TjhWZ0cwaTkwRWZ4ME93N1p3ODJGLWI3cWhnUWhRR19jc0VSOHVFUTZJeTR4eTVETC1JMDdSVUppdmMwdVJuNlRBREh6eDRQZEFLanVqVENpTi01c1lMOTZhV2h2S0VrOElILUFjNlpJUlZPeUJPSUx4Ul9yaE1ZUnBHRFlKb1NKQWRJZzFiZ2tzWW9nQTY5N3VyRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive"
    }
  },
  {
    "title": "The 60 Greatest Moments in Super Bowl History - Sports Illustrated",
    "description": "The 60 Greatest Moments in Super Bowl History  Sports Illustrated5 greatest Super Bowl moments of this century  Yahoo SportsRanking 60 greatest Super Bowl moments in NFL history: Seahawks can't escape top play  USA TodaySuper Bowl 60th anniversary all-time team: Tom Brady, Lawrence Taylor and others headline star-studded team  CBS SportsThe greatest Super Bowls in NFL history: Our definitive top five  DAZN",
    "published date": "Wed, 04 Feb 2026 13:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNejl0ZVNQdFhiWFVDZW94MlFSSTQ3OHNuNEV5aDhhQ0dMOEk3UFVtRU96RUhEd2pFT1F6dzlfZlRsQmJvUlhaVjhiRk1DVjNCNW9lOWdoYjN3ZC1RM3gySklDT3lkeW82OHBoNl8wMUlKcHZQTjY2NnNVQ1dNUHZITW95THZZd1BaekE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Warriors Hit Giannis Antetokounmpo Trade Roadblock as Bucks Balk at Acquiring Draymond Green - Yahoo Sports",
    "description": "Warriors Hit Giannis Antetokounmpo Trade Roadblock as Bucks Balk at Acquiring Draymond Green  Yahoo SportsSources: Draymond Green involved in Warriors' trade talks  ESPNDraymond Green, Lakers reportedly would have mutual interest if traded to Bucks  NBC Sports Bay Area & CaliforniaDraymond Green after what might have been his last Warriors game: If it ends, 'what a f***ing run it's been'  Yahoo SportsWarriors’ Draymond Green: Trade rumors ‘got real’ when Steve Kerr talked to him  San Francisco Chronicle",
    "published date": "Thu, 05 Feb 2026 01:54:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPaFFBRC0zNU9neTQ5SWpqb0xFWTZXdW9tdXp5WnFEMmx0MVVPdTMyckZKTWpmTDNNYXg1NFNXd0UtYzdfeTczejZpWGtDMDhvOWxwSVhYLTY0TnZ4WEJ6cDhqcjdoNGlpZE9mZnlSWS1jWkl3NTFhMWQyeFJ5alUyWkI1a3IzbGFoZ19DZ1NOOURLeTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Giardi: What's the Patriots quickest path to victory? The DTs have an idea - Boston Sports Journal",
    "description": "Giardi: What's the Patriots quickest path to victory? The DTs have an idea  Boston Sports JournalNFL trend watch: Heavy personnel could shape Super Bowl LX showdown between Patriots and Seahawks  NFL.comK’Lavon Chaisson reveals how Patriots defense responds to doubters  Yahoo Sports‘We’re like lions’: Milton Williams, Christian Barmore could be Super Bowl game-changers  Boston HeraldInside Patriots-Seahawks Super Bowl matchup: What to watch when New England has the ball  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:31:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOYUdwU1B6d0FWVEFkdzNqeFJrc1V3NEJzSC00LWJjcVVsVWhxRHJ1MDZHNUFvNm55YjRxd21NanVmbzhrejNpRU10S1JzQWRsc09hcWZFZUF4RW50b2NCWXQzWHQtOUNXZHU5UDZUcW1ib29GTUxGYkh2aGliNm1HUDRsN3lRTlhvVzVycThWZF9yLWtweGUxSnp0SnZEM0ZYaml2bEJWVElCTFl1eFhDY3VJWTRaOW9tTWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bostonsportsjournal.com",
      "title": "Boston Sports Journal"
    }
  },
  {
    "title": "Why this Browns job means so much to Todd Monken, and how he has the tears to prove it: Mary Kay Cabot - Cleveland.com",
    "description": "Why this Browns job means so much to Todd Monken, and how he has the tears to prove it: Mary Kay Cabot  Cleveland.comHow Browns coach Todd Monken is already separating himself from Kevin Stefanski — Jimmy Watkins  Cleveland.comBrowns’ brass say very little about the future of Jim Schwartz  NBC SportsTodd Monken escalates Browns coaching drama and Steelers fans are loving it  Yahoo SportsTodd Monken's top priorities for Browns: Staff, QBs, scheme  ESPN",
    "published date": "Wed, 04 Feb 2026 21:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPREhKT0hVd3llZXEwWHhEc21sQWxuNVhwalBHXzdpclYzZm13cnpOTXEwRHlZUlg5alp4RV9mVndGNThJTTBOZ0x1TTN2UHJRQURvTlFpeE5idE5MdTFrZU9kTEFoazRDSkJXN011a3pnWVh3eTdESWo2ZHZYMlVMNjFlMElBTEZ2dm1XakJoOXR3eEJPVFN5RDFuaXc1ZFRhRE5fUEM0bWFHRmtLLTNmZmJWMlpiYTJEYXRDZHFXbS1hTmpwMW93VUpCaERHN3E0eDFET3htNVhiNUhxVGdJ0gHzAUFVX3lxTE5xZVlFWkVqT3Z5OENfSElHbGR3ZW5oYjNBSWRKZEl6Q0t3eXl6OGdiZnVhRGt4R2JzaEdnZDJPcHpVYWpWb29GdkN2MGs5bngyWEJjQmFaZlp6RXNZdXE2aG5YVE5SQmhmVGkwVEtkVVFvVjA5WWoyVXljV1ZLbXRpaXIzSnFxR0NiOGVMdlJTYXlia0dndUY0eDQzVFJDVHVIUzNPZlU3c2QtYTg0SXdxX0t5RHIzdFcwdkxORDBRZHJLN3lvVkVJSE9lSE5BM1c2WnN5SzROVGhYczV6eVpObEVLT2UwVjF6Mk1URDJmYmJ6SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Player Grades: Cavs at Clippers - Donovan Mitchell impresses in wire-to-wire victory - Fear The Sword",
    "description": "Player Grades: Cavs at Clippers - Donovan Mitchell impresses in wire-to-wire victory  Fear The SwordCavaliers 124-91 Clippers (Feb 4, 2026) Game Recap  ESPNCavs clobber Clippers, 124-91, in ‘weird’ game with Darius Garland seated courtside  Cleveland.com3 things to watch in Cavaliers-Clippers on League Pass  NBAHow to watch the Cleveland Cavaliers vs. LA Clippers game tonight: Time, Streaming, Breakdown  Sports Illustrated",
    "published date": "Thu, 05 Feb 2026 05:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPOGxQZFhsTEVKZ2dGUlJEVGJOY0szZWtYbXZuT3U2UlNKemh5VktXOTFGaDl1REtWVnBabGx1TUFqczBYOU5PakJaTkUxb3FrTzlUb2xScXBXdmhwQXcxMURsTTJRNDFoMkZRbmx0YzJFQTFabGVvRXpGVmhRa0ZwbXM3RklLWmRQWnpDNjhJWUNfcWppV1VFZVN5ZHVWYXpOcTlRa19QNUJLZGd1bGlJUU1sR21KZklWaEpMc25PaFlUb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fearthesword.com",
      "title": "Fear The Sword"
    }
  },
  {
    "title": "Andy Larsen: The Jazz’s newest star, Jaren Jackson Jr., signals the end of the long rebuild and the start of playoff competition - The Salt Lake Tribune",
    "description": "Andy Larsen: The Jazz’s newest star, Jaren Jackson Jr., signals the end of the long rebuild and the start of playoff competition  The Salt Lake TribuneSources: Grizzlies trade Jaren Jackson Jr. to Jazz in 8-player deal  ESPNUtah Jazz Acquire Former NBA Defensive Player of the Year and Two-Time NBA All-Star Jaren Jackson Jr.  NBAFormer Florida basketball All-American Walter Clayton Jr. being traded  Gainesville SunCalkins: Jaren Jackson had to be traded. Because it’s time for the Grizzlies to start again.  Daily Memphian",
    "published date": "Wed, 04 Feb 2026 13:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPelNzNGNqWmZaVEc2YTdXUm9Rb0NkR2hVcGN1cE1ES21QQ0FqQTZyOF93bTlYb2pKV05LdTZVa2FaUS1USUVqVlZxV1Q4MVAzLVBNeFQtcDhlWFR2Q2FvSHBWdlFqUVNWSU5FUUI2MFlpQk9McXB0UWRBSm5obmRmVkZDalgzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "3 takeaways from Patriots vs. Seahawks practice reports on Wednesday - Pats Pulpit",
    "description": "3 takeaways from Patriots vs. Seahawks practice reports on Wednesday  Pats PulpitSeahawks' Darnold says oblique feels good; Emmanwori hurt  ESPNNFL news roundup: Patriots QB Drake Maye (shoulder) full participant; Seahawks Sam Darnold (oblique) limited  NFL.comSuper Bowl LX Injury Report: Patriots vs. Seahawks  New England PatriotsSeahawks vs. Patriots Super Bowl Injury Report  Seattle Seahawks",
    "published date": "Thu, 05 Feb 2026 03:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNNk41QmUxNzA3enVaMmFXRDdFcGM1d3pSZUVvTmJJbUlNNHlwcllDdkQ4VFo1RFlockR6T01XcUFOQlJxUl9URGtJX1lTamhpOXVBQTQxaXhHcDUtZEFsbWdOOER3b2NZMjlkZlN3Y3J0aHZLMUVtUUs5N3J1SEV3UGRralpidnJtNWFKRl9idWpsM2wzSmJrQ3FyNEpVNGxUOGZuaE9PejNtYWpGX1AtMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patspulpit.com",
      "title": "Pats Pulpit"
    }
  },
  {
    "title": "Sixers Trade Deadline 2026 Grade Roundup - Sports Illustrated",
    "description": "Sixers Trade Deadline 2026 Grade Roundup  Sports IllustratedSixers deal Jared McCain to Thunder for four draft picks  ESPNThe significant risks, potential benefits of Sixers' Jared McCain trade  NBC Sports PhiladelphiaThunder-76ers trade grades: Who won the Jared McCain deal?  Yahoo SportsReports: Thunder acquire Jared McCain in trade with Sixers  NBA",
    "published date": "Wed, 04 Feb 2026 21:54:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPZnRWcGdnXzI1aFFZa3pFX3pfaG5UcGdKMm1HR0J6Tl9aTVVCek1tS3p6RkRFQ0w0ajNQcThOcmRSZUF2RHBxdXd3WVdBekw0ZnVPb2w0dWtTZU1NSWZBY1RobnN2TWFhUkVHdENReXJVOFFkOFZkX3h5TS02MUo1V0JNWE9FTE1UWG1Xb3QtR3k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "From punchline to Super Bowl contender: Why Sam Darnold's resiliency is his ultimate superpower - NFL.com",
    "description": "From punchline to Super Bowl contender: Why Sam Darnold's resiliency is his ultimate superpower  NFL.comGhostbusters: Back Darnold, Seahawks to exorcise some demons in Super Bowl LX  ESPNRevisiting Sam Darnold’s Rose Bowl Masterpiece  Yahoo SportsSam Darnold went from bust to journeyman to Super Bowl starter. What can NFL teams learn from his path?  CBS SportsSam Darnold Focused On Helping Seahawks Win A Super Bowl, Not Vindication  Seattle Seahawks",
    "published date": "Thu, 05 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOTmhGeFA5QUV2MnM3WS1fZHI1YVlLT1J4VVF0dFhVeGhHZkw0eTh2M09ndFVpUFJ1ZEhiU19nWDZtZF9FOFlxNjhCYUdEbW43N0JkUDFNUDdsQWJBeERwT0NEbEplZGtRTlE0OU5fZ2l6M1dPY2IyX01OSkFRWC0tUmdUeFpsSnJZTVVtQ2xpRThPT3o3ek9mcEppWi1DQW9VZS1iMktYeTJEbFFRSjlGXzkyd1hUSEJjeEln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Team USA Olympians to watch at 2026 Winter Olympics - CBS News",
    "description": "Team USA Olympians to watch at 2026 Winter Olympics  CBS NewsMeet the Michigan Winter Olympians: Chock, Bates lead contingent  The Detroit News32 U.S. Olympians to watch at the Milan Cortina Games  ESPNTen athletes from Team USA to watch at the Milano Cortina Winter Olympics  The GuardianDallas-area Olympians to follow this month  Axios",
    "published date": "Wed, 04 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE41VUFVZ1ZPcjBfY3l0RmNSSmhUc2ZjeUp3SE5mUkI0SlJmcVBHVjFBMFlyX1NLUEN2WU5Rc2dVbzhIOC12MmI3TjlvLVFxTDItYUEyZzlOWW9jOXlFNmxzbEo2aFpQMW04UWcxX0NGal9DMU9EQlhB0gF8QVVfeXFMUDl2MG5DRzdpcXNPS2FCTWpxQ2VrYmt5LVZ6WVdvd1cxd2pseHp0RURVZTViU3Z3dlktVGNhT1JvQUdRM3FUVzJWcjR2Zi0xQ2huMEZkZnYwYmRSeEJSYm9jRmwxNHJPU181WWVWamU3WUVOc3I1c3licUhlUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  }
]