[
  {
    "title": "UFC 325 results: Alexander Volkanovski retains title with impressive win over Diego Lopes - CBS Sports",
    "description": "UFC 325 results: Alexander Volkanovski retains title with impressive win over Diego Lopes  CBS SportsVolkanovski outclasses Lopes to retain title at UFC 325  ESPNUFC 325 odds, picks, predictions: MMA model reveals fight card projections for Saturday's bout  SportsLineOfficial Scorecards | UFC 325: Volkanovski vs Lopes 2  UFC.comAlexander Volkanovski dominates Diego Lopes for unanimous decision win at UFC 325 in Australia  AP News",
    "published date": "Sun, 01 Feb 2026 05:57:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNQTRVb1JENDI4UFhMQ256Z3I1eHc4UzRmX2VyOFI2U05qNldJdFFlNDlIY3dFUGJad0RyVW52aFFsdU93eElMTzlLWFV4MzVUYldGR3p1ekt4RVJDNi1aNVBZSjNiUnFxbVBBQ3NSQ253Q3YzcmdLNHRYNVBEZ2dhQk9FRVJoaTRXbEVQdThITGUzLW9MazV5LXNHbEFIS1FFREdZMXN0Q0ZoNFI5c1FNNF9LZ0lpdTk2MXNrNW9XcXh5S2Fp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbssports.com",
      "title": "CBS Sports"
    }
  },
  {
    "title": "Where to watch Novak Djokovic vs. Carlos Alcaraz: Start time, TV channel, live stream for Australian Open final - Yahoo Sports",
    "description": "Where to watch Novak Djokovic vs. Carlos Alcaraz: Start time, TV channel, live stream for Australian Open final  Yahoo SportsCarlos Alcaraz v Novak Djokovic: Australian Open 2026 men’s singles final – live  The GuardianPrison Stocks Plummet as ICE Backlash Deepens  The Daily BeastDjokovic wins first set vs. Alcaraz in stunning Australian Open final start  ATP TourAustralian Open 2026 final LIVE: Carlos Alcaraz vs Novak Djokovic - scores, radio & updates  BBC",
    "published date": "Sat, 31 Jan 2026 22:30:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONlNHOG1ENU1zNlFfc0NPS1I2cko5SUQ3SWxfUUE4ZXlrS0JDR056bUQ2bXkyN0xSS080YV9KSldYNm9aZ1lUekY0YkNnVFAycDdHd1k3eW5acnJXQlRrYnMyQVZXMlJZaEJtYXkwTXZNNVI2RC04Tjluc1pIUU9UcWNUNF8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Paul George’s suspension changes everything for Sixers ahead of NBA trade deadline - The Athletic - The New York Times",
    "description": "Paul George’s suspension changes everything for Sixers ahead of NBA trade deadline - The Athletic  The New York Times76ers' George banned 25 games for taking 'improper medication'  ESPN76ers’ Joel Embiid shares special moment with son Arthur after dropping 40  Yahoo SportsPhiladelphia 76ers' Paul George suspended 25 games  NBA76ers' Paul George suspended 25 games for violating NBA's anti-drug policy: 'I take full responsibility'  CBS Sports",
    "published date": "Sat, 31 Jan 2026 22:31:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPQTRnMWx0TzdqdTBHTFdwcl9Ja0ZrNllCblZRTEpRUE9MdHpvdGYwV0hhZVlpVkNQYzdqR2xiRWpMeVhKb2FTMFBmZ3JROTBiLU1Ib0dZQXlpYzdnRVNjRjQ5QlczNWxkU2FBUmJqSzRKWFJiNW94enp5SnhLak8waXRxMkdZLTRZS0tzOU01UHp2bnhBMXVZdXdZWGFhakJvYXE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Boxing results: Shakur dominates Lopez; Carrington wins title - ESPN",
    "description": "Boxing results: Shakur dominates Lopez; Carrington wins title  ESPNStevenson seizes Lopez's title to become four-division champion  ESPNShakur Stevenson puts on a virtuoso performance to beat Teofimo Lopez to become four-division world champion  DAZNStevenson humbles López to become four-division champion in Garden masterclass  The GuardianTeofimo Lopez vs. Shakur Stevenson fight start time: Where to watch, live stream and PPV price for title bout  CBS Sports",
    "published date": "Sun, 01 Feb 2026 06:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOWXlMbU1MNmJQdzhzLVI1Q3B0bkVkZk5VME1xZzJsdnlDS1NEeWtpMXBSRC14YlhUVHdHdzk3NE9lZWZWN1prWVMxLXBNYkpUV0l6bVFzS0UwN3pOZUZBdG9RVUxCVEpURlFVeWtDWWFkdHltYjJCSXpnVU1ZQ19nZy1oa2dDTDRNVTlLMGd1WVd0V19RTk95ZGw1ZEZEVEt5WmM4dWt4elNwMnNVd3YxZzQ4d2FvRndxMmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Reports: Cavaliers trade De'Andre Hunter to Kings in 3-team deal with Bulls - NBA",
    "description": "Reports: Cavaliers trade De'Andre Hunter to Kings in 3-team deal with Bulls  NBASources: Cavs trade Hunter to Kings for Schroder, Ellis  ESPNNBA trade grades: Cavs save some cash by shipping away De’Andre Hunter - The Athletic  The New York TimesChicago Bulls reportedly take on player & 2 draft picks in 3-team trade: what it means  Yahoo SportsNBA trade grades: Cavaliers get high marks for acquiring Keon Ellis from Kings  CBS Sports",
    "published date": "Sun, 01 Feb 2026 05:37:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9TaGpYcDRnOVFFVkwwU0pDVGF3azdDS3piU1FvaS1LODgtR0YxbDBoN3JXSm80LThWeC1kRXNhNjNZSWhuQ045a1JVZ2xSZDlIa3dMYWF4Q2hSS2FVZHBrX1dmblpiRHhTWE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "What Kansas coach Bill Self said after defeating No. 13 BYU - Deseret News",
    "description": "What Kansas coach Bill Self said after defeating No. 13 BYU  Deseret NewsAfter draining win over BYU, KU prepares for quick turnaround  Lawrence Journal-WorldDarryn Peterson stars in the first half before missing much of the second in No. 14 Kansas' 90-82 win over No. 13 BYU  Yahoo SportsWhat channel is Kansas basketball vs BYU on? TV schedule, streaming  The Topeka Capital-JournalDarryn Peterson leaves no doubt in duel with AJ Dybantsa — for one half  The New York Times",
    "published date": "Sun, 01 Feb 2026 04:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNdEJwcVJ0Sm9fbTRyRjVfVEU0TXphWDQyQ0ZnQUp2eENHT3NQNFFvWVp5UmZWd1ZzczA2MXNKb1JkT2NRX25CM2V3RFYyWmNoZUhRZTljaVRZVExFcXFvNTdWbDYtMWJlM0ZFWllBMjJ3M2tDR1k2TGFJMFEtLVUxNnVYejhzOVFPLURVTEhxUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.deseret.com",
      "title": "Deseret News"
    }
  },
  {
    "title": "Report: Government approves ESPN, NFL Media merger - NBC Sports",
    "description": "Report: Government approves ESPN, NFL Media merger  NBC SportsRegulators OK ESPN's deal for NFL Network, RedZone rights from NFL  ESPNGovernment regulators approve ESPN’s billion-dollar acquisition of multiple NFL Media assets  The New York TimesGovernment OKs ESPN's blockbuster deal to acquire NFL Network  The Detroit NewsNFL and ESPN officially close massive deal with government approval; league now owns 10% of network  Yahoo Sports",
    "published date": "Sun, 01 Feb 2026 04:17:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQYWtKRWVhZUk1YjBRekFlLVdQOE5vMUdCSnQ3dTMtZF9HemhQQ0lZYWdnQWdrZ0p5NUZTVnZXbVkzODFZT2tzMEk1d2pCcC1SRjNiMFo2TXctWjhtbjJTWEwydENfOUtIWTVFdk1XRmVIRkVwdlFmZlhocHF6MVVlT0J0QWRlNVJ6NDVRazlsMFZkS24xb0JDeERQdEN0YzJkVDk3dEp3RFBlN1VXQ3VV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "2026 Senior Bowl takeaways: Garrett Nussmeier delivers MVP performance in NFL draft showcase - NFL.com",
    "description": "2026 Senior Bowl takeaways: Garrett Nussmeier delivers MVP performance in NFL draft showcase  NFL.comSenior Bowl final score, highlights: American wins defensive struggle  USA TodayGarrett Nussmeier leads American team to 17-9 win over National in Panini Senior Bowl  AL.comJets QB draft target has quickly stolen the show at the Senior Bowl  The Jet PressWinners, Losers & Takeaways As Garrett Nussmeier Rebuilds Draft Stock During Senior Bowl's Day 3  Bleacher Report",
    "published date": "Sat, 31 Jan 2026 23:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5LNmF4UnpTSDBWZ3NBZF8zS1FiQUdpLUhmU0hieUxTNS13MTN5bXpqZWVJNDNheURYZFhkNjZkVHZPM1ZtY1dHQm9GbmJJLTdEVFpVM2lIVi1na25qWndET294bDc3ZnAxVG5UQWtfQVRxQmJ3aWYwYy1ibw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Doug Shows tried to royally screw Kentucky at Arkansas: ‘Worst technical foul I’ve ever seen’ - A Sea Of Blue",
    "description": "Doug Shows tried to royally screw Kentucky at Arkansas: ‘Worst technical foul I’ve ever seen’  A Sea Of BlueKentucky 85-77 Arkansas (Jan 31, 2026) Game Recap  ESPNMBB Preview: Arkansas vs Kentucky  Arkansas RazorbacksUK Sports Network Coverage of Kentucky Men’s Basketball at Arkansas  UK AthleticsKentucky vs Arkansas score: Otega Oweh leads Wildcats in heated, tech-filled game  USA Today",
    "published date": "Sun, 01 Feb 2026 03:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNTmg5cS1udlRNZUNob3BzUXk4TlVYOVRCeVVNQm1oNUxUMTJNWl9MSkpTYmk1M3g2eWFsTnl3bGN4NU00QjVIUnRPSTVLX25pY0o4QmNZM2NxY2FJNmNvS3daSDYtWGZpTW5RZHlUdHpNVE02cDh5X243NXRfTmhGZ2cwanZOby1OOEZzR2c1MVpVY0V2OXFsMUp2cVZUaWV4MnBnOXhXY0FMRXpwOW10SDlqa19oQzJJUGY4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aseaofblue.com",
      "title": "A Sea Of Blue"
    }
  },
  {
    "title": "\"They left it all out there\": IU basketball displays character, grit in double overtime win at UCLA - Inside the Hall",
    "description": "\"They left it all out there\": IU basketball displays character, grit in double overtime win at UCLA  Inside the HallUCLA falls to Indiana in a double-overtime heartbreaker: ‘We deserved to lose’  Los Angeles TimesIU basketball game day essentials: Hoosiers begin west coast trip with UCLA  The Daily HoosierAt the Buzzer: Indiana 98, UCLA 97  Inside the HallThe Peegs Postgame LIVE: UCLA  247Sports",
    "published date": "Sun, 01 Feb 2026 05:11:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNWllGWkd3MVpRUWJaMTBLRGVuTUVJUW5uX0dubnlsUXdES2tBUE05VTFQbVVOYzVZdTR6YjM1cHhiNTlTWHpCdGtoV3VfSjdickZVUFFsaEZfdTlKTk54MUo0SWEwVWVIaG1scElhVFhrc2pseGhDT24yNTgxMzdNV2FmLWhhUkhiU3pBdWpYSzlvLS1rRUpjRE14UzZ6bDdFVDdpREh3V0ctaUg3MHlfUWF0bm5ETldmZFhtcmpheEwyQjRpcVJUc3ZtQVVtbklleTIw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.insidethehall.com",
      "title": "Inside the Hall"
    }
  },
  {
    "title": "Lucas: Peachy - University of North Carolina Athletics",
    "description": "Lucas: Peachy  University of North Carolina AthleticsLucas: Georgia Tech Rapid Reactions  University of North Carolina AthleticsJackets Entertain No. 16 North Carolina Saturday – Men's Basketball  Georgia Tech AthleticsThree keys for UNC to beat Georgia Tech  Tar Heels WireWhat channel is UNC basketball vs Georgia Tech on today? Time, TV schedule for ACC game  The Fayetteville Observer",
    "published date": "Sun, 01 Feb 2026 02:32:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE95VWE5MmFVaEVHblVHWUlkY251MzVQUTdHTmhiMk1zbHlkUndZeTlBUm1ZQXdHc0RPVXd6QXl3TjZIWi1WS1M3eXJUam9NcEtfTXpJM1gyeG13Q3VDZFFpSFlrTnF1M25yVHJLLWVKbTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://goheels.com",
      "title": "University of North Carolina Athletics"
    }
  },
  {
    "title": "McKenna has hot day outdoors for Penn State at Beaver Stadium - NHL.com",
    "description": "McKenna has hot day outdoors for Penn State at Beaver Stadium  NHL.comNo. 2 Michigan State hockey defeats No. 5 Penn State outdoors at Beaver Stadium  NCAA.comCharlie Stramel plays hero as MSU hockey tops Penn State in outdoor overtime win  Lansing State JournalNo. 2/2 Hockey Travels to Penn State for Top Five Matchup  Michigan State University AthleticsNo. 5 Men's Hockey Drops Series Opener to No. 2 Michigan State, 6-3  gopsusports.com",
    "published date": "Sun, 01 Feb 2026 00:59:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQcWdwOXRpN2hlYmRTelBJbUtGcWtfY3JTZ2pLWGFYcmRleC1CYXlzc2pjUHFhX1gyNUJha0M4aU9aNmlTUmJqNlMyYUlkOXlwZXhXbHBlaWFwZERIVE5fM3BFOFJOWTh3Z0g1NjVMTGJoZVF6bU9HZnpxdmUtSGlsX1hGMW5zYzZfbXkxV0MwcmhWMGdCbFY4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Jarrell Miller’s hairpiece punched off during MSG fight … and boxer goes on to claim victory - The Guardian",
    "description": "Jarrell Miller’s hairpiece punched off during MSG fight … and boxer goes on to claim victory  The GuardianJarrell Miller's toupee gets punched off, thrown into crowd in hair-raising scene on Lopez-Stevenson undercard  Yahoo SportsJarrell Miller's toupee gets knocked off in victory over Kingsley Ibeh  ESPNBoxer Jarrell Miller has his hairpiece knocked upward by a punch, then throws it into the crowd  AP NewsJarrell Miller's hair gets knocked off during fight with Kingsley Ibeh  USA Today",
    "published date": "Sun, 01 Feb 2026 04:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPOHBqTkVoZURFLWZ2ZEtrNHdOU05tTmlCTXh5a0ZDN0l1OXRyZXRiRkhtYkluR0RzVkE5X0diVDFHYUxsWTViUVE2cTZfcWRMQ3ROMEJPUDh6cHJhMFFWeThZeHRqRWVQREtaQ1kxWjZiNk1oMnJYc1NKaWRCd3M4aC1qNEZacGhMTzI3U2V0ZnZPODNkZGxsSFpJZlYyZG1ocEZiUjFvMF9VTGlsQnBsUU9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Vikings WR Justin Jefferson: 'I definitely felt like we would've done better' if Sam Darnold returned - NFL.com",
    "description": "Vikings WR Justin Jefferson: 'I definitely felt like we would've done better' if Sam Darnold returned  NFL.comJustin Jefferson says Vikings would have been better with Sam Darnold at QB  Yahoo SportsJustin Jefferson: I definitely feel like we would have done better with Sam Darnold  NBC SportsJustin Jefferson makes shocking Sam Darnold admission as Vikings GM loses job  New York PostJustin Jefferson Opens Up About Watching Sam Darnold Make Super Bowl Run: ‘It’s Tough’  Sports Illustrated",
    "published date": "Sat, 31 Jan 2026 21:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNX2pscUotbDhJLTAwTG4zN2FadS0zQzRaUVNRaXV0N0UxaXZkdzUzUTNUVkUwemREUDhFSUNjY1VVMHZxV3NZbDFWYlAwYkhUWUwxNDQyNWl4a3JhRzdScDZnZE1QUVBNMEdRWVBtUDRrQmREcXptdmVINVVweURFTkZRUlFBalJBNVVZOGxJOGFCSG1rN1FOeU9oTVVMLUdvS282QVJRM1ZhM1drY1dqNW8tVi1HTW5PUDhlaEt5Nmo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Dodgers Notes: Ohtani, Snell, Edman - MLB Trade Rumors",
    "description": "Dodgers Notes: Ohtani, Snell, Edman  MLB Trade RumorsShohei Ohtani will not pitch in World Baseball Classic, Roberts says  ESPNShohei Ohtani will not pitch for Japan in WBC: ‘Just seemed like the right decision’  Los Angeles TimesDodgers' Shohei Ohtani won't pitch for Team Japan in World Baseball Classic, Dave Roberts says  CBS SportsShohei Ohtani full-go for 2-way play on Opening Day, but won’t pitch in WBC  The New York Times",
    "published date": "Sun, 01 Feb 2026 03:31:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNOGhwb3FlSFFxMU1ENTBYQkVkN29DRWNZVXZ4bUVNczZxaHB1N284RlE5WUhtOGIydm50OHJVTlUzczV2RllaVXUwTVNra3NjTDc0b2d0OEpjZWNVb1R0MlV1OUM4V0p5TDc0TkJiT0x0VF92TnFtWDlXSUlBdExxZXpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "The reviews are in on the Stadium Series ice, and not all are raves - Tampa Bay Times",
    "description": "The reviews are in on the Stadium Series ice, and not all are raves  Tampa Bay TimesEverything you need to know going into Lightning’s Stadium Series game  Tampa Bay TimesBruins and Lightning excited for colder-than-expected Stadium Series in Tampa  ESPNEsposito's vision for Lightning hits new heights with outdoor game  NHL.comOutdoor hockey in Tampa? How the NHL is making the Lightning’s dream reality - The Athletic  The New York Times",
    "published date": "Sat, 31 Jan 2026 21:39:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxORldOY0UtRnVlRjcwVDlQdUtIbUQ2Y3JLMlctQjJ5c0o4OHJFN2wteGFuRjFMSDhNVnA5Y0pxUDVYY2RwUTRkcTQ5WnB1bFRvTDlWSWJEbE03ajVmSVZGX2dXZUV2V0Jxd2h4QWY2dEVzVTVEa0R4RjBlNjVCNGFpbFppRXBiNG5ReWtaNHY3SEIwQVR0VGNZNV9VbDVlaUZ4d2JmZG81VjV3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tampabay.com",
      "title": "Tampa Bay Times"
    }
  },
  {
    "title": "NASCAR postpones Clash at Bowman Gray to Monday due to snow - Motorsport.com",
    "description": "NASCAR postpones Clash at Bowman Gray to Monday due to snow  Motorsport.comCook Out Clash postponed to Monday due to winter weather  NASCAR.comNASCAR delays preseason race at Bowman Gray Stadium to Monday  ESPNSnow forces NASCAR to adjust weekend schedule ahead of race in North Carolina  WBTVWho is racing in the NASCAR Clash at Bowman Gray and what is the format?  Motorsport.com",
    "published date": "Sat, 31 Jan 2026 20:44:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQV0Y2dTBqN2QwY3BNanBEMi1rSGRVX1BqemREQk9LSmpxZGllNXBqRkJjTEZra3R3dE82UThwSkhSeW1RVzZyX0pSUUNBemNwdGk4WkN2RS1NRVo4M0FhZEtYWENPU2xCWV8wYk43dU1sb1ZKLV83bGdobTRfdlQzSjZ0TzVvLTFJOVZvR1hFTEJVaHZlZ3lteGpVeW1XYUdseDhQUzhRcWx1LXFZc1Blc3BR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.motorsport.com",
      "title": "Motorsport.com"
    }
  },
  {
    "title": "Darryn Peterson Is Clear No. 1 NBA Draft Pick After Outshining AJ Dybantsa - Sports Illustrated",
    "description": "Darryn Peterson Is Clear No. 1 NBA Draft Pick After Outshining AJ Dybantsa  Sports IllustratedNBA execs: Kansas' Peterson, BYU's Dybantsa top draft prospects  ESPNNBA mock draft 3.0: Is AJ Dybantsa still the top pick?  USA TodayHawks get a perfect chance to complete their star core with Darryn Peterson  Soaring Down SouthNBA Draft intel: AJ Dybantsa shows some flaws, Brayden Burries shines and more - The Athletic  The New York Times",
    "published date": "Sun, 01 Feb 2026 01:29:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQU1BteUVmMUx4Nlo0aFJBUkdvOTFBSWVnRU1meDFrS0RKQ2FuamhVVlA3dnN0UFZNTElRMVZEQXNlOGp3YktYZ0o1ZkN5V2hockdpNjZvRHN5aFhvcjVBeEhIOEZPcFVNeXJfVmJ1V2xFX3B6d1dIN3hBNGJVSjdKVGVYQmpmTG40a28yd3FpSlVLU0RFc1BMSDZQNHludkVPdkFOOGhaZkFTVThKTDMyRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Xander Zayas unifies titles in close decision over Abass Baraou - ESPN",
    "description": "Xander Zayas unifies titles in close decision over Abass Baraou  ESPNXander Zayas outclasses Abass Baraou to unify WBO, WBA titles with sensational performance  Yahoo SportsXander Zayas fights to become the youngest unified world champion in the sport  Sky SportsZayas Unifies WBO & WBA 154 lb. Titles Against Baraou Via Split Decision  Fight NewsXander Zayas Vs. Abass Baraou: Start Time And How To Watch  Forbes",
    "published date": "Sun, 01 Feb 2026 04:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPR0ZiNElpTGlSeUU1eG5lQ3B5YVlpZ3F3VWJwNWw3eW5tWGloclJFX1NPNzR4akdDZjltMDN1WExhQ05jTDdnZERLdWRrVFVtRVJOZFRiQlZMdGRnekZibWxJakdvaTVMaGdOZTlTdGNqYkduN1VIMFNTMUFVUU85LTEyZUM5RVJPY2tWT1VtYXd3dnNhb1N1NTY4SmhObjFnYU1VX05R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Donnie Freeman; Syracuse’s leading scorer, not in starting lineup vs. Notre Dame - Syracuse.com",
    "description": "Donnie Freeman; Syracuse’s leading scorer, not in starting lineup vs. Notre Dame  Syracuse.comSyracuse 86-72 Notre Dame (Jan 31, 2026) Game Recap  ESPNWhere to Watch: SU vs. ND  WSYR22. Saturday Night Inside The Dome  Notre Dame AthleticsEverything Notre Dame Men’s Basketball Coach Micah Shrewsberry Said Before Syracuse  247Sports",
    "published date": "Sat, 31 Jan 2026 22:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOSUhnWEFZWHlXRi1xUFZTanNpTmxfQWxkZkxSUHJEaldOR0ZXZ2VHaFZyaXB0MVA1ek5oajgwNnBZZjVvb1k2Y0txeFpCN1lmS3Raejc1RFRoSUFUYkdQaEhuSUszbnhuc2thVGVJZTk2NmQzUnUwcnpVTVJJN05Id2JmUVlheXJXWFNGRGRSb0lqZG85ekoweXpFWHhNYjJTeUJzeHBWbG5HLS1pUGpMVzFnYTE4SkhoQ0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "Giants, Luis Arraez Agree To One-Year Deal - MLB Trade Rumors",
    "description": "Giants, Luis Arraez Agree To One-Year Deal  MLB Trade RumorsSources: Giants, Luis Arraez agree to one-year deal  ESPNLuis Arraez signs with Giants: Three-time batting champion to join San Francisco as second baseman, per report  CBS SportsWhy Giants are content sacrificing defense with Luis Arráez contract agreement  NBC Sports Bay Area & CaliforniaMLB news: Giants sign Luis Arráez to play second base  McCovey Chronicles",
    "published date": "Sun, 01 Feb 2026 03:52:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNNERWT2V4eEltdXNGY1BObl80bXBKOWFndEdRaXd0YTYyR2lfWDd3Mkc2ZDJ3M2x1VlhVR2JfTHE2ejZqMnMxa0lmemNNQThpVkFLQU1nNVRBY2dxbEUydGVrMTlKdGR3SmlEdWlmZGplWHdiaFZxZUhzSk1lNHdicldZSllaQTcwY1JQWExn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Lindsey Vonn sits out final race before Olympics but remains on track for Games after crash - AP News",
    "description": "Lindsey Vonn sits out final race before Olympics but remains on track for Games after crash  AP NewsLindsey Vonn knows one speed. Now she needs it for an Olympic-sized comeback  The New York TimesThe Crash That Left Lindsey Vonn in a Race to the Olympic Start Line  The Wall Street JournalMalorie Blanc gives Crans-Montana a home winner as Vonn sits out  ESPNLindsey Vonn withdraws from super-G race a day after crash, no update on Winter Olympics status: 'Doing my best right now'  Yahoo Sports",
    "published date": "Sat, 31 Jan 2026 23:52:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQbW1hQnhJYU1oZUtOVWZCUDdHOVo3VlNCck5sdzFFWnE1MURCWHRGT1VlQ29iaExnT2VRYTRaMDRIcGdwcFJQYjJfNXoxUFJmMVhaZGxTWG5UcnFHVmdHbXhLZW52VUJTRGF1QVEtRzE0S01MVFFkUlVHaW9Rblk2WTNQUEdITWxJNFRzY2hValo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Underdog Josh Kelly dethrones Bakhram Murtazaliev in Newcastle - Boxing Scene",
    "description": "Underdog Josh Kelly dethrones Bakhram Murtazaliev in Newcastle  Boxing SceneMurtazaliev vs Kelly: Britain's Josh Kelly wins IBF light-middleweight title  BBCJosh Kelly stuns Bakhram Murtazaliev in major upset to win IBF world title  Yahoo SportsBritain's Josh Kelly outpointed Bakhram Murtazaliev to win the IBF light-middleweight title in Newcastle.  Sky SportsKelly Dethrones Murtazaliev To Seize IBF Junior Middleweight Title  Fight News",
    "published date": "Sat, 31 Jan 2026 22:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNSEtobFFlaGsyeDUteWtwcmhuUzJJOVZBZ2NjMnNIa0tyb1ZWU2xJcC03N0JOak1iX25GM3ZmQVRCbjBocDdwM3dRNnppQnRqcE1MT3FVSEFvOWhUOWFTTXF4U0FtcjM4aFhHUmNwbTBFbFFWazBmZkRLdE85ajUyRjFiM1IyZEpfYlJrOEsxTUp6aUZzU3NyMmpLWDJQNExK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boxingscene.com",
      "title": "Boxing Scene"
    }
  },
  {
    "title": "Projected Lineup: January 31 at Washington - NHL.com",
    "description": "Projected Lineup: January 31 at Washington  NHL.comCaps Return Home, Host Hurricanes  NHL.comCapitals 4-3 Hurricanes (Jan 31, 2026) Game Recap  ESPNSaturday Caps Clips: Capitals vs. Hurricanes Game Day  Japers' RinkCapitals do what feels like the impossible and win two games in a row for the first time in 1 month and 27 days  RMNB",
    "published date": "Sat, 31 Jan 2026 20:00:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPcDdJVFRfQThNY1FFVDM5bTBBSmgtVWFvQUFtM05nQWt3T0p3VWZlWFg0OWVBNVhMeGFIcExmVC1VQnFRcHVsMFlXNWp1UDRINzNuOURWZ18wOTlTdlZRcnJVeHkzTDNETDR1dThISEplcEp1ZGd1MElHandTdlBWd2FiYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Shocking Fact Reportedly Emerges From Bill Belichick Hall Of Fame Snub - NESN",
    "description": "Shocking Fact Reportedly Emerges From Bill Belichick Hall Of Fame Snub  NESNGerry Dulac: Bill Belichick's HOF snub a result of committee not following simple logic  Pittsburgh Post-GazetteMark Madden’s Hot Take: It’s time to fix the Pro Football, Baseball halls of fame  TribLIVE.comInbox: There’s no need for Checkpoint Chickie  Green Bay Packers – packers.comJordon Hudson Planning 'Huge' Party for Bill Belichick on ‘Same Day as HOF Ceremony (Exclusive)  People.com",
    "published date": "Sat, 31 Jan 2026 20:16:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPd3M1dEhpMUVHblhfLUpmYlhHUk1lLTltZExDWlBhZTNLY18wSlZvSVdDcmdxWWM2U3ljQmduWE9hcEFHTF85b0RvZWFlaHNramhwRUdZekw5dk9feXM3cTBTZ20wRUJiQ25fbGpYQXRzaVRXQ1N6dUpYemVVUlIzV0tQQ0dQYnN0QXlJLWdvQ2dnQmJhblZ4dk5GZUHSAaIBQVVfeXFMUG9HMGNsWmNWQ3NCYUtUYWdXR0Z0SExSdnZmVlQ1UGlZZHZXWXlIelI0M2Q1eV9pYThHYktYcXA2el8ySHlEWlJVRlFsOTNsVzFPd1pMcWhaUjZBZTNycnFXbFNEdFlQN2pEbkdnX0VkZ2dqNmdOdUIxMDBLa3lBbGNLLVhMTXVKVlVvNXlDd0d4NGh4TGdlcU8tclYyV1hKYjd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nesn.com",
      "title": "NESN"
    }
  },
  {
    "title": "Elena Rybakina Establishes Herself As Player of the Moment With Australian Open Win - Sports Illustrated",
    "description": "Elena Rybakina Establishes Herself As Player of the Moment With Australian Open Win  Sports IllustratedElena Rybakina wins Australian Open for 2nd Grand Slam title  ESPNA wing and a prayer: Rybakina’s quiet resolve wrests glory from Sabalenka | Jack Snape  The Guardian'She basically capitulated' - is Sabalenka underachieving at Slams?  BBCAustralian Open final analysis: Elena Rybakina beats Aryna Sabalenka for second Grand Slam title - The Athletic  The New York Times",
    "published date": "Sat, 31 Jan 2026 12:24:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOSFVId2NZM2hIcXRKUUNnRWFjT1BfWExRZDNKMW1KY0NiMVNZVHFoM3Jsd2VWaFJWSThwbkZDRlJXTWxmNXVpbWc4cXpBZTNXTFkyMHFRQnFnb3ZHNURQNGpMb3VaMV9TekxpMkt6N24xS3hfaVFnbG1rcFNnb21UR2Z2NjNFYktWY2JrYmxRSDdmbzdPWEkxcmx4ZEM4MFk5NU1SLU5YUUFPVU1haFVtSXU0ZVVQVFljMk1KeVNodjVTenM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Three Keys & a Pick: No. 9 Illinois at No. 5 Nebraska - 247Sports",
    "description": "Three Keys & a Pick: No. 9 Illinois at No. 5 Nebraska  247Sports#9 Illini Set For Sunday Rematch at #5 Nebraska - University of Illinois Athletics  University of Illinois AthleticsMast, Frager on the Mend as No. 5 Nebraska Men’s Basketball Preps for No. 9 Illinois  Hurrdat SportsFred Hoiberg says Rienk Mast went to ER; Braden Frager questionable ahead of Illinois game  KOLN | Nebraska Local News, Weather, Sports | Lincoln, NEHuskers Host Illinois in Top-10 Matchup on Sunday - University of Nebraska - Official Athletics Website  huskers.com",
    "published date": "Sun, 01 Feb 2026 08:26:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxONjF1eG1abnpXbHlUWTJWQkItRHdsTnFPYmt0M3dfN2RMMm5Vc2JrS1JzNDBuVVVnWFBvODBPRVVxQjZLM1lWXzd4YU1TaTQ4MjYxRjFZOEtJeVBxTEk4VXJjTEpxYnI2cVdlVllLVkFPRENyZGV0TGdmc3Vxd0JhQ3Y3UGtiLWRCbUZkQ0VwR2p4QWZDWGtzX1FuOHB1RTY4MVh0Y1prMXQtVTF5SUdGODhCcVlYWHFnc1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://247sports.com",
      "title": "247Sports"
    }
  },
  {
    "title": "Tom Izzo 'disappointed in officiating,’ says Michigan ‘played well, I guess’ in 83-71 win at MSU - On3",
    "description": "Tom Izzo 'disappointed in officiating,’ says Michigan ‘played well, I guess’ in 83-71 win at MSU  On3Wojo: Wolverines are the imposing team to beat in Big Ten after outwrestling Spartans  The Detroit NewsBefore tipoff, Dusty May owned the moment in East Lansing  Wolverines WireTom Izzo: Michigan Basketball ‘played well, I guess’ in win at MSU  Yahoo SportsTop 25 And 1: Michigan solidifies status as clear favorite in loaded Big Ten  CBS Sports",
    "published date": "Sat, 31 Jan 2026 19:19:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQUUhkRkpmWGE4a3ZXZ2NrelhCRVFNZmE4enFPcUNRREh4QmYwNmtVTnVvU2RlS0tuMjNPVFNkMnpmNjZTR3RZM0VoZzJXYzN2dE9NSDQ1ZEFkRUNUN3NBbV82UWdLVEVvREt2ODlEdjlPTlZlM2k5REFsb1BWVkpESzBQa3l6dkRaMXFqU28zdThoSUxfZmQySGhwNGc1c2lRbjUxWmk2UUYySjZTc3ZmeVV3aGN1ay1zRFgwODBzNFpNOTZXdW9LSENvVzdtUkQ0X0M0U1pHUlpaUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "Bills hire former Buffalo safety Jim Leonhard as defensive coordinator - Buffalo Bills",
    "description": "Bills hire former Buffalo safety Jim Leonhard as defensive coordinator  Buffalo BillsBills hire former player Leonhard as defensive coordinator  ESPNBills hire Broncos assistant head coach Jim Leonhard as defensive coordinator  NFL.comBills raid Broncos' coaching staff  9NewsBills reportedly hiring Broncos defensive passing-game coordinator Jim Leonhard as DC  Yahoo Sports",
    "published date": "Sat, 31 Jan 2026 20:33:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPcW4zWlAyRy1XRU1wd2JwckFuSkFvZmQ2cWE2enN3cVNaLUdMU2tyNDdTS1FXWE9BZThzVmhqbHJDWTgtdTJkZ2FJWGtOWG9hNlJ6clVzaEZ4dDBHR2NKZnpkWFk2WDhScVhzenNSMWtQNnhsOHBhVWtmeW5INmpfcm9ocVpzTVZwQ2I4cXlROGZxUTltTTJEdWZicENraWRzNU1NdXE5TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buffalobills.com",
      "title": "Buffalo Bills"
    }
  },
  {
    "title": "Projected Lineup: Jan. 31 vs. Blue Jackets | St. Louis Blues - NHL.com",
    "description": "Projected Lineup: Jan. 31 vs. Blue Jackets | St. Louis Blues  NHL.comBlue Jackets 5-3 Blues (Jan 31, 2026) Game Recap  ESPNColumbus Blue Jackets down St. Louis Blues for fifth straight win  Yahoo SportsBlue Jackets’ Jet Greaves ‘absolutely huge’ in third period to seal win over Blues  The New York Times(1-31-26) Blue Jackets-Blues Gameday Lineup  The Hockey News",
    "published date": "Sat, 31 Jan 2026 19:42:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5Iazh1bWczZjhVVHNGUHVBWTF1aUFyMnJMQ2JSS01fNUtabUVDdGhqNDhoNEVJX002QmFnR1FuVHpQLTJnUUJaa1Z5SjlDSXR1VVB5ZWsyQWhzMHBYU2p2UWp2VTdObWFWSWJsbGRMNW8tWGN4MHZrVTln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Five takeaways from No. 17 Virginia’s underwhelming win at Boston College - Streaking The Lawn",
    "description": "Five takeaways from No. 17 Virginia’s underwhelming win at Boston College  Streaking The LawnVirginia 73-66 Boston College (Jan 31, 2026) Game Recap  ESPNSecond-Half Comeback Carries No. 17 Cavaliers at BC  virginiasports.comPostgame: UVA Basketball coach Ryan Odom on win over Boston College  Augusta Free PressHow to Watch No. 17 Virginia vs Boston College: Tipoff Time and TV Channel  Sports Illustrated",
    "published date": "Sat, 31 Jan 2026 22:27:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPTzN5bDhFNEk2dVlyaUxOblJtOVltakNUM3BOV3oyVzdBZGxOcmlDUFE0akdBaTlJR1pROHBFN2g1RUNTbmFaZnZRMU1obnpKbkRFVmVFbW5sYzZfdDRyc1E4ZExwbUZIcWZZb1hqXzVGbFZHVmE1X3U3MlgwZkFIY3N0VVpBcUFVMkdmalhfQm1PQlRrUEw2aTAxZm5xanNlV3duUFVEeFNhLVR0ZnBPaWFRelR3dUdrcnl3akJ4SUZHQ2xzdllSZWVIWkl6TnRzR1JiMGw2Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.streakingthelawn.com",
      "title": "Streaking The Lawn"
    }
  },
  {
    "title": "Fox to broadcast The Freedom 250 in Washington, D.C. following Donald Trump’s executive order - Awful Announcing",
    "description": "Fox to broadcast The Freedom 250 in Washington, D.C. following Donald Trump’s executive order  Awful AnnouncingPresident Trump issues executive order to begin preparations for IndyCar race in Washington  Yahoo SportsFreedom 250 Grand Prix of Washington, D.C. Coming in August  INDYCAR.comTrump announces August auto race in downtown Washington  PoliticoTrump orders up IndyCar race on the streets of Washington for 'America250 Grand Prix'  NBC News",
    "published date": "Sat, 31 Jan 2026 14:03:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQOEoteTl1ZXpNM3g4MEx1STBEVmNxaloxbFo2MzF6RTJNaXhkZnNULXdiT2N6X2VTRnNnRVpmYWwtenExcm1GY2I0RzQ2ZjFzSzZweE1nM1RjakdVQ2dlRGxSdHZGQXRnZk1oeWlBbXdNdmpTNnVqeFlkcEMyYmdVVWptdlhDOWRTRkt3UmlLUDkwNFk0d043ZnFvOXlhRzdvb3lmNkZJYVg1Nmhv0gGyAUFVX3lxTE1peUo3SmNValpkZld4S1dWR1VwcEo4ZklaYmJuUjhjamZiLWpyWm1Tek01S1ZkRHE4RGJFdU1BbGdLT2FWM04yR0pJMkROM3RFd3dVQy1zdThEMFpLLU1ObkJhN2Y0YkJEUkFtZDdKVWVadmsyajl4ZVB2TjZuQXJteEtIV0pzcXhiZy04S3loWldNM2VGeDFUdmQzak5jMmQ5aUdEQ0xIaEpvWHJDUE9nX3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://awfulannouncing.com",
      "title": "Awful Announcing"
    }
  },
  {
    "title": "Steelers expect Aaron Rodgers to be their quarterback — with one big caveat - New York Post",
    "description": "Steelers expect Aaron Rodgers to be their quarterback — with one big caveat  New York PostSteelers coach Mike McCarthy talks with Aaron Rodgers ‘a number of times,’ but no decision yet from QB  TribLIVE.comNow bring on the Penguins' youth, too!  DK Pittsburgh SportsFormer Packers Exec Recalls Mike McCarthy’s Hometown Love From Interview  Steelers DepotPaul Zeise's mailbag: Is Mike McCarthy merely a bridge coach for the Steelers?  Pittsburgh Post-Gazette",
    "published date": "Sat, 31 Jan 2026 22:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOY2dJaVBpck91NWZkSHp6WVAyRHBDM2FoLVFYaVlPVnJ4U0Fpd1NEV0otNFM0VWFDcXdHQzJpOHFKUkRmSmNETUQ5NUF1d3FjUGU0TGRrRlB5aHd6dVpSRlBBZlE4Z0N6X2QwNjh2OWZnd0xvSE9xNlJHQTk0UWY0UldkbzNjbnI3bzMwVEdLdTdmck9QYkg2akV2T1dZWUYwVjVLMXdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Cowboys finalizing defensive staff: Derrick Ansley, Ryan Smith officially hired - Dallas Cowboys | Official Site of the Dallas Cowboys",
    "description": "Cowboys finalizing defensive staff: Derrick Ansley, Ryan Smith officially hired  Dallas Cowboys | Official Site of the Dallas CowboysPackers DB coach leaves for the Dallas Cowboys  Acme Packing CompanyWhere things stand as Cowboys continue interview process for defensive assistant coaches  Dallas NewsWhy ‘wise beyond his years’ Christian Parker was Cowboys’ pick to be DC  The New York TimesCowboys forging a new defensive identity with Ryan Smith leading the secondary  Blogging The Boys",
    "published date": "Sun, 01 Feb 2026 00:34:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNUEZPYVZxaWhzSE5PX1FwLXNEOEEwMjVVMFladTA1bG91ZXJpZ3BBNkhsNUJKRVVVSmVVS0Y4bGNob0pBNjZQSjFkNHMzdlI3TnBNaE9QQVEyeGN6SHg0RVVWamRkZ3FKZmZ3Z3pFQTlROVdBTUJmOHRqa0RjNXE3ck82R1BrR1VsLWZUQ2kwZUpSQURXam1ZN1J3c1JHcktEcVc3Szh4ZThKNUl6MmdDdnR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dallascowboys.com",
      "title": "Dallas Cowboys | Official Site of the Dallas Cowboys"
    }
  },
  {
    "title": "Is Tennessee basketball playing Auburn on Saturday? Latest update on weather - On3",
    "description": "Is Tennessee basketball playing Auburn on Saturday? Latest update on weather  On3UT Basketball announces parking updates ahead of Saturday’s game against Auburn  WVLTTennessee-Auburn basketball game to continue, campus shuttles won’t run  WATE 6 On Your SideAuburn takes four-game winning streak to Tennessee Saturday  Auburn TigersThis Tennessee freshman is being compared to an NBA star who played at Auburn  AL.com",
    "published date": "Sat, 31 Jan 2026 17:33:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOREVKVUdjdDVrbXhZMFdoNlVLbmpQUUZCWFpISm5ZVGk3MGNZYVNHS0l1YkxhbDYtZ1RJc3VOMEJGVEJxMk0wV0JzOVVyMjJ0VEdwc3pvdVEycWZJRWFpMWZnV2VrbUZsRzNEOG56Vi1ubDNDbWlwb2NBVjd2aWo1dVVUbzVsX0N3bXl0Qm1GdzY0bmNjLTFMVXo2OVk3MXc0TENjYVRRV3FXcm1H?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "Why Myles Garrett will be with the Browns in ‘26 even though he’s seemingly disappointed about DC Jim Schwart - Cleveland.com",
    "description": "Why Myles Garrett will be with the Browns in ‘26 even though he’s seemingly disappointed about DC Jim Schwart  Cleveland.comNew Browns coach tells Shedeur Sanders, 'We tried to draft your a--' while with Ravens: 'It all worked out'  Fox NewsWhy Todd Monken could quickly win Browns fans over: Ashley Bastock  Cleveland.comBrowns hire Todd Monken as new head coach  ESPNFormer Patriots Coach Listed As Possible Browns Target Should Jim Schwartz Leave  NESN",
    "published date": "Sat, 31 Jan 2026 21:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxQUU9kNkxGQnFDcnpLWGpQX2ZGa2pMSjM0NGFVQ3pMMVVRVmloMGF4UnQxZUp4YU5TRktfbHE5bE84WDhxWE1uWEFCeURrRXlMUWF0a2FOR2FMM2JJZnVycFl0dFh2eGFGOWNuNUloNlRiRUdkbGR2Tm54OHBWdkVfdlY4Vko3MWJPMVVtdU5USE1VaDhBWVZZSVI3VGhJbUF6ajF5YnpPRU9Ia2tSSnM3WTdYeUhJRTlpWUtTLUp2SlJEQWhaSThEZVhYdXo4cDdNUkhYZVlyWEJ5Y1RCRTg0ZEg3ZnA0N0FvRllJSUtRQ0hOQnV0Nmc0djBfaWl5OUp3RjNxV9IBmAJBVV95cUxOV1hKeF9TQ29wc0dOUHVKbUJtR1ZuZmZyVG16NlVnNUg0cnl0T1NLd0pTbkN6TEpFQnNocmNEbnhQbFFMc20tRGRsVDRkN2VNMXhaTUE5MHdtS29qeGlhTjg0Nm8xakFPcVQtdkRNZk5BRmkwRzR5QV9fQi12bnhlbjFNSHc0NlN0akpKWVlDSWl1MGx4d0lqZWhfUDVsRk5ZMG40TTNaZzdpeFJwWmJ3dEVzTXFQSEtZRHlnVjFHU3EwdzNwU19aN0FrS09Qd3J1b19LQk52VDZ4X3pnVmZBdG10YzlwaEZEMWVxY1dVTG1wbEJyOGVHYWo5VlgyWmFqdTc3UmhQYno1Tm5iTkVLZ29tTjhTa1dW?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Trade Rumors Continue to Swirl Around Blazers, Knicks, Giannis - Blazer's Edge",
    "description": "Trade Rumors Continue to Swirl Around Blazers, Knicks, Giannis  Blazer's EdgeSources: Heat, Wolves, Knicks, Warriors among Giannis suitors  ESPNHow Blazers can shake up Giannis trade sweepstakes, much to the delight of Bucks  CBS SportsSaturday Morning Confidential: The NBA Trade Season Latest  Marc Stein | SubstackGiannis Antetokounmpo, Bucks are focal point as trade deadline nears  NBA",
    "published date": "Sat, 31 Jan 2026 20:12:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOZzlMSHpZMzQ2YnZwNXZVYXlPRXdWVE1Sd293dzZieWh3VkFIOFV0LUN2eXR0LXVVVVljczR0cTNYdW5GaTR0N0N0TzhzVWpmcGFWTGZTR0treW8wQ2pad1VreVdzTUhvY2htUTVsbzl6bmFDaFBaaVc4UmZPNngyUnFhUjVmcUhTZFB4WjVrQkgxbXBRMWNJRnRfaHplUy0wYmFwY04yRDZreEd0TTVjakRPU01pQmVUOG5mSWZPdk5xcGQ5QlY3TVRLSGZJMFhLdjRXNFo5WVR0S28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.blazersedge.com",
      "title": "Blazer's Edge"
    }
  },
  {
    "title": "1/31 Preview - Kopitar is Back + Trip-Ending Opportunity Awaits, No Morning Skate, Armia at Center, Clarke's Assists - LA Kings Insider",
    "description": "1/31 Preview - Kopitar is Back + Trip-Ending Opportunity Awaits, No Morning Skate, Armia at Center, Clarke's Assists  LA Kings InsiderByfield scores in OT, Kings recover to defeat Flyers  NHL.comKings 3-2 Flyers (Jan 31, 2026) Game Recap  ESPNInstant reactions: Travis Konency scores AGAIN, Flyers comeback hits the post in overtime in loss to LA Kings  PHLY SportsFlyers claw back before falling in overtime to Kings, drop fourth straight loss  Inquirer.com",
    "published date": "Sat, 31 Jan 2026 14:05:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOMm9wS1pJV0tVS3Fvb2pCczhadlhoREJDSGJJamFiMVM3LThQYlE1WUhSazhpNHFXeVpfMDRJQllWdVdTaG11OFFBSWM1WFhfVFNoajZJZzgxdUpnZmtRclNoQ0Y2XzV6R19DUDlweU5RQ0NGYzhHcUFIRVcwZDlYS2w0dW5Uak5MN0RudkxqRnIyRzdxVjROeWlocTZIVC1CX3dQRG1HMF9samp6V2RvQ3UySDBpX3VjTzVtWFNla0YyeHdMQTJYQTFDUHJJQXFkSERfVWJEb2hyMXYxMXZsYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://lakingsinsider.com",
      "title": "LA Kings Insider"
    }
  },
  {
    "title": "Great Group, Great Memories: 2016 Penguins Reunite - NHL.com",
    "description": "Great Group, Great Memories: 2016 Penguins Reunite  NHL.comView Full Coverage on Google News",
    "published date": "Sun, 01 Feb 2026 01:25:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPR194d3YyMWJ2R0F3aEdxbUkzZEdzODBBME53Y0ZhVk51UUtEZmxjS09SdE9JbUJqZVRvakJNa0IzQmd3OXFUd01wYVY2dE01dVhUM0kteWRWQjJBLVdYdTNneTRxVzhpZlViNlU4QnhrUnlFOFlsSmd6Qm1aUFI2d0hLN2E5UDFVbGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "2026 Senior Bowl: Live discussion, TV channel, kickoff time - Pride Of Detroit",
    "description": "2026 Senior Bowl: Live discussion, TV channel, kickoff time  Pride Of DetroitSenior Bowl winners by position: Which 2026 NFL Draft picks impressed scouts this week? - The Athletic  The New York Times2026 Senior Bowl: Rosters, game time, TV channel  NCAA.comFull 2026 Panini Senior Bowl Roster: Complete List  Tampa Bay Buccaneers2026 Senior Bowl: Daniel Jeremiah's top 10 standouts from week of practice  NFL.com",
    "published date": "Sat, 31 Jan 2026 17:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPay1hbDh1dFpJN2p3dFRNaVctdktKMFBIdGpoaDJuWnBXWmE0SW9EZmprUFY5QVNBRGVJX3JaNFVzOXc5Zlp2RFB3TVRHNHZsbXloaldYVEl1cXRZX1JwbXlpQmZCUlR3MlZySTg4Q0otUkl6dVc3cVJNOEhlTFNqMXpscHhMZ2ltUmk0N05JcmJyOWNpTjgxUE1nXy1hMWtpeEdRY0RhMTlKTFg5cWllRjhnWTc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.prideofdetroit.com",
      "title": "Pride Of Detroit"
    }
  },
  {
    "title": "Why MLB stars are being told they can’t play in the World Baseball Classic - The New York Times",
    "description": "Why MLB stars are being told they can’t play in the World Baseball Classic  The New York TimesLindor out of '26 Classic after undergoing cleanup procedure on elbow  MLB.comAstros' Jose Altuve, Carlos Correa not insured, to miss WBC  ESPNPuerto Rico considers pulling out of WBC after insurance keeps stars off team  USA TodayReport: MLB discussing WBC insurance after Puerto Rico threatens to withdraw  theScore.com",
    "published date": "Sun, 01 Feb 2026 02:23:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPaDUxWWpYRzZwOWRnQmZBXzBaSTFNdmd2X1dfaTVSeFNONGFUdldFc3hpTlJwR3pPcHN0blFIbjY4NVo4RWV6YUpqVW1aa3NoRU9Gb1VXZmR3NFl5ZGMzNklvblBrSkZmbFBWcVhEMUtnZk5IYVR3ZjJvQ2FnZlMwcUx1dkdDUDNNZm9MbnhqNkVmdVg1eHg4N3g4SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What Justin Jefferson just said about new Bills head coach Joe Brady will make Buffalo fans even more excited - Syracuse.com",
    "description": "What Justin Jefferson just said about new Bills head coach Joe Brady will make Buffalo fans even more excited  Syracuse.comWhat we learned from Joe Brady’s introductory news conference as Bills head coach  The New York TimesBills HC Joe Brady: My job is to allow QB Josh Allen to be 'a better version of himself'  NFL.comBills promote OC Joe Brady to head coach on 5-year deal  ESPNJoe Brady introduces new direction for Buffalo Bills  Democrat and Chronicle",
    "published date": "Sat, 31 Jan 2026 18:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxNYWVJLTVHQk5vZjlyTHVPTVF4NmVmcXF3RGtSRGIwTlVrVXVTaXBUdjdQb0pKMmFMblVXekRXU3dvYzdnN3NXdWRTandGTWFFdDN4cGNNVW91QVU5c2o1c1hiSkVFYlZvbVZ6LXNmNUNlSjJFYXFEbDJPVjRsa2d0VVBWQWZldVJ5MnhiQmVvR2FDOWV1SXpueGVETHljYmdJMlo1cF9Na1lZX1ZjOXJ4LTVqSlJSX1FraFBGaEpfWUw0MUNEYzVGTFNmYm1LVEQ2VFNqRGpJdnlWa3BfY1dPRHNIc3VsN2tManlLVlBZYXBKQVnSAYcCQVVfeXFMUC1vZXBkWXREVjN4MGZKaU9lUk94cjd6M1JMblZucG5SZlEyWHRHcUlFWG10dWd4YXdiT2c1UGF6N3g5M1NZRFh3U2tTMDFiSi14cnRBWHdCd3J5bVpsbndqeDJJWkNFcjJDM3BoY3VBdkRYeXFDamZrT2hhSVg2NV85QlVnRlRqdlZLYVU1cHBwOTJTaVJUNWtVNzJ4Z2xlalMzYWZPWUY4WmZnc013WmZqVDVQNEU5TEhlcEVNbXhvU1pjejdGaHY0cTRJZTBUT2FxcXU0WGRwZGlra0Rrb1dMcDYxWXd6bWZlLXJldDJQTXBMNVFDdmRyV1dhOXlNSHBaVlRGVEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "Penguins Strike Quickly, Beat Former Coach, & Keep Piling up Wins - Pittsburgh Hockey Now",
    "description": "Penguins Strike Quickly, Beat Former Coach, & Keep Piling up Wins  Pittsburgh Hockey NowGame Preview: 01.31.26 vs. New York Rangers  NHL.comPenguins continue post-Holiday surge: ‘These guys are pretty good’  The New York TimesPenguins 6-5 Rangers (Jan 31, 2026) Game Recap  ESPNPenguins vs. Rangers Prediction, Odds, Picks - Jan. 31  FOX Sports",
    "published date": "Sat, 31 Jan 2026 23:47:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQkVhZUlDWFJKLTdNdU12QTZ2aWVxQnRPYU5wUXhkYXpqOGt5T0RWcFhSNFhWX01sZzZzRWc2elVlaXdrdi01QllYR0Z6MG9BQlpjMlprQ3p6Z2xXS2Z1c1FMQkJPQlFJcVh1aGlOcnY4TzZLQ2hoWExHaWJQOE02dDdRY0U0UXluLXQ3d2FNODhIRFp4aHBLMXdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pittsburghhockeynow.com",
      "title": "Pittsburgh Hockey Now"
    }
  },
  {
    "title": "7 Candidates to Be the Minnesota Vikings' Next General Manager - Sports Illustrated",
    "description": "7 Candidates to Be the Minnesota Vikings' Next General Manager  Sports IllustratedVikings fire GM Kwesi Adofo-Mensah after 4 seasons  ESPNInbox: He does build this team in all ways  Green Bay Packers – packers.comHere's what former Vikings GM Kwesi Adofo-Mensah said on Sam Darnold weeks before he made the Super Bowl  Yahoo SportsShocking GM firing may have opened the door for Bills to make a blockbuster trade  BuffaLowDown",
    "published date": "Sat, 31 Jan 2026 19:22:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNNHdOdndqUGpNNDJJMy1melJxZElKSnp0RnY2aHAtWk1PVGZiLWUzdXN1VDktNzRNXzhPOUxYNDVKVGlILXFmTGFhVml5S1V6a2RXM1lrdllIck5ndEVVbkZoS0xsczdRYmc4ZVZSVnQyNGEzWXpnMEVJNFR3eUR1cFZZNlZJOWVWQkk4aHVkR3ZQSmcwOW0ya0hNT09lLTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  }
]