[
  {
    "title": "Reports: Anthony Davis traded to Wizards in 8-player deal - NBA",
    "description": "Reports: Anthony Davis traded to Wizards in 8-player deal  NBAAnthony Davis traded to Wizards: Trade grades, Dallas' next steps  ESPNMavericks roster reset: A look at where Dallas stands after trading Anthony Davis  Dallas NewsAnthony Davis traded from Mavericks to Wizards, capping Luka Dončić deal fallout: Sources - The Athletic  The New York TimesMavericks reportedly trade Anthony Davis to Wizards in 8-player deal  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 23:07:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBuNzEtQ0RJVnRNOWVJN25aZEFaR25VSG1sRFRRTmRkWjl0Y0JpdENpS3pOc2lUNDJlUlVMc2U2MmM0Rk42NEw4eW41U253TnQtUG5sN0NsSVV2NjhHVVQySzUtcVhHaUZJcHpGeVdxRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "Rangers trade Artemi Panarin to Kings for conditional third-round pick, prospect - The Athletic - The New York Times",
    "description": "Rangers trade Artemi Panarin to Kings for conditional third-round pick, prospect - The Athletic  The New York TimesKings trade for Rangers' Artemi Panarin, add 2-year extension  ESPNLiam Greentree brings ‘power forward game’ to Rangers as Artemi Panarin return  New York PostNHL trade grades: Artemi Panarin is the offensive threat the Kings needed  The New York TimesArtemi Panarin trade grades: Kings land elite playmaker from Rangers for Stanley Cup push  CBS Sports",
    "published date": "Wed, 04 Feb 2026 23:40:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOMElXbnNtNW5jWkEwNVkxbmNLVUNCSE1FU18zWUs1Rk50c2xHT3UtVjNreGVMMzIwVHhBaUZiNU02TWhaOE1kNE14WmVfa3ZfVjViTXZBckRMUnBiUjNOckZ2UmFqSFdfRkxNR21MdTBCRGZFekN4dm9WbVlpanhia043Vm53eURHRUhsWFBLWDZHOXpIbXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Top NHL prospect Gavin McKenna charged with assault - ESPN",
    "description": "Top NHL prospect Gavin McKenna charged with assault  ESPNGavin McKenna Facing Felony Charge After Incident On January 31  Onward StateAggravated Assault Charge Filed Against Penn State Hockey Star Gavin McKenna  StateCollege.comTop NHL prospect Gavin McKenna charged with felony assault  CNNGavin McKenna facing felony charge: Penn State hockey star, potential NHL No. 1 pick accused of assault  CBS Sports",
    "published date": "Wed, 04 Feb 2026 22:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOVHdVNWRjcDR2bktkTVlwcUZ2SWVkeGQ2eDZTTWVIXzdwSUNwd3pFeFdJOEFOTWhvQUZ4a29zeWJRVm95MTBxYVROZUVkbEJKSnhJRW1BM0dUQXEzaVI3cHBSXzVTdEZ0clp3czFnWjdjQnRSRko5YTh0UEE0T2tnUnhUdkJGT3o3UWVYeThLeHU4SFB3NVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "UFC's Jones needs hip replaced, still wants fight at White House - ESPN",
    "description": "UFC's Jones needs hip replaced, still wants fight at White House  ESPNJon Jones says he's suffering from 'severe arthritis' from UFC career: 'Already qualify for a hip replacement'  Yahoo SportsJon Jones Addresses Health, Reiterates Desire To Fight After Viral Clip  TMZJon Jones reveals dealing with ailment 'most people don't know' about  MMA Junkie‘I have severe arthritis’: Jon Jones reveals damage done from fight career preventing Daniel Cormier wrestling match  MMA Fighting",
    "published date": "Wed, 04 Feb 2026 19:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQdVExQmxpTDJrSUlIc2M1QVM3bFg1b0NGX1MtaXZ4dTFqTXlXMW9wb09ZOHltUFBaN2d1bFdBM2pMQ1h6bm1HMGs2N08zaXBhUEVGNHoxNjFfcHdPN1J5eEptRjl0M0NCaFVQejgtN05zOXVtVnRYRTFLdFlONkFIREwyRmlLb1BfOGR3YjB6UW8zU3RqalB2WmxOS3IwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Patriots Rematch Digs Up Memories for Seahawks Who Lost 11 Years Ago - Sports Illustrated",
    "description": "Patriots Rematch Digs Up Memories for Seahawks Who Lost 11 Years Ago  Sports IllustratedQuiz: Test your Seahawks knowledge before Super Bowl  The Seattle TimesDespite Super Bowl hoopla, Seahawks remain locked in  KOMOMike Macdonald: Seahawks are loose and focused, this is how we roll  NBC SportsSuper Bowl 49 broke the Seahawks. They’re back because they recaptured the magic that team lost  The New York Times",
    "published date": "Wed, 04 Feb 2026 13:00:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5CT1RuekgzaXZHWDNvSGxJR2dnMk9BSndFM1N6a3o4dW9Kd3pVYmFmRmdWQ0JsQUdZaGduc3JGR08zc29qU2ZORUJ1QmVqSy13V1o0VlY2em9waWk1TFloMlA5eExmLXliUnd0WmZYcHFzbXQ2RTVr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "First Winter Olympics Event Was Halted Within Moments - Newser",
    "description": "First Winter Olympics Event Was Halted Within Moments  NewserWinter Olympics 2026 live updates: Today’s latest from the Games, including curling  The New York TimesOlympic curling competition, luge training briefly delayed  ESPNWinter Olympics 2026: Curling kicks off Milan Cortina Games, with Sweden and Canada forcing early wins  Yahoo SportsPower outage halts Milan Cortina Olympics curling competition moments after matches begin  Fox News",
    "published date": "Wed, 04 Feb 2026 20:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQQnFDRk9kaEtCMVdHcnFnSG9vWXVMQVlrS20xQTB2WDlIaW1mQks0M0toejZicm1KcnBtSWNHUkV2NUxRdmwwcWh1QklLdlJ6ZnhBUmZWYTRHUkMzWVJZY012WXRxbnlhaWpOTWNPT19JOXZBV0NWa2FCNGZJLXhkeVMyT3hHNUQxc0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Live: Timberwolves in Giannis Antetokounmpo sweepstakes after trading Mike Conley - Star Tribune",
    "description": "Live: Timberwolves in Giannis Antetokounmpo sweepstakes after trading Mike Conley  Star TribuneNBA trade deadline: Six Giannis offers -- which would Bucks pick?  ESPNGiannis Antetokounmpo mock trades: Four sleeper teams that could swing big at deadline  CBS SportsNBA trade deadline: Bucks still collecting Giannis offers? Wolves eyeing Bulls guards?  Yahoo SportsGiannis on likelihood of Bucks trade: ‘I want to be here, but I want to be here to win’ - The Athletic  The New York Times",
    "published date": "Wed, 04 Feb 2026 17:49:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNZldNbHRDNW15QUo1eE9nQVh2UmthZWdOc0RKM3NhMUl4elNYMVlmcGJUeW1lbjM0Vnh3VWQxWnlmTkxHOHQyZTJpV3ltQmdOenI1RHEwQ2RVQ1VfbVNOaWJFeGhOa09vMkxUcWhhekpMLTFRQlFjSGpfYWxpTHVLYngxUVRPUWlhT2FlaDhralFsSUxlQXRXc1dJMkdNRklSeDhzRmxsVnNYZ0hGRE5QbW9LM1BjTUxVT3VpTTBEOGpXWE14M3NFZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show - NPR",
    "description": "Photos: Scenes from the 150th Westminster Dog Show : The Picture Show  NPRThe Unforgettable Best in Show Finalists at the 2026 Westminster Dog Show  The New York TimesDoberman gets moment of redemption as Best in Show at Westminster  YahooDoberman pinscher named Penny wins best in show at Westminster  ESPNWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBC",
    "published date": "Wed, 04 Feb 2026 13:36:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPZGhHTHFvRHpyZ1VXMWgwV1FkdU9POHZUTzE4WGtNc3Q3aEc1alIzVktxb1hGRUlyQXk1VXZWcTBTNWtmRnktczdzdGh2aHlKTGNURVB1RjFmNmZDUlZsSXVBd1FNWjZDTEJKa3NDSlF2ZHNabHJpbkF3WGxkMzcxUXVCcDhOUjBQREtMaEN0VGJlbHpxRFRwSms5RHNmal84WVZXWjhhSEhqUEJHU0ZmbDJxVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Kyle Larson speeds to pole for 2026 Cook Out Clash at Bowman Gray - NASCAR.com",
    "description": "Kyle Larson speeds to pole for 2026 Cook Out Clash at Bowman Gray  NASCAR.com2026 Cook Out Clash at Bowman Gray - Live Leaderboard - February 04, 2026 - NASCAR  FOX SportsNASCAR Cook Out Clash updates: Live results and how to watch race today  USA TodayNASCAR Clash starting lineup: Kyle Larson, William Byron to line up 1-2 after qualifying at Bowman Gray  Hendrick MotorsportsCook Out Clash may have rainy conditions  WXII",
    "published date": "Wed, 04 Feb 2026 20:41:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNUzcwODh0RTY4MkN4Ymt0RThBTThyQzZyZ1F5LUdPckVNTUEwRDNmZkJkQ0xsQWFfcFBwR1BiVjVXYlJSZlk4S1hHZng1MHRMUFB2S2RmWFBqMUJ0Y2tzdzgxYWwtc1duZzlSeFZIYmpLSFRVRE5Bakc0eGd6NXE2SnZqVEpSbTJHcnRobV9UdVBUZEhWOUpDQklRbEM3Rld5aDdZSmxwWk5sZTduUmt5Y9IBtgFBVV95cUxOWGx0dkpBQTA0cUI1ZVhRcjRCVHJGMnlPdC1wMHBvTFhEeHIwbUdfaUtCazJucHdCNWJsTW9KanRSSG9ZY0VacDRuaEgxR2YzSVd6YkFOa0VfT3gtSVBDeERCbDM5WjdkaWh0VWV0amQ2OHBnQ2hkNklZTUNzRDVIeEVwek9ISktUUVl4akkwV1JyZ2xZelEycnlkVkZtNG03Z2VwTW5LVmU0NG9LaTNBWWVpYTFZdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Andy Larsen: The Jazz’s newest star, Jaren Jackson Jr., signals the end of the long rebuild and the start of playoff competition - The Salt Lake Tribune",
    "description": "Andy Larsen: The Jazz’s newest star, Jaren Jackson Jr., signals the end of the long rebuild and the start of playoff competition  The Salt Lake TribuneSources: Grizzlies trade Jaren Jackson Jr. to Jazz in 8-player deal  ESPNHere's what Grizzlies told us about Jaren Jackson Jr. trade to Jazz  The Commercial AppealUtah Jazz Acquire Former NBA Defensive Player of the Year and Two-Time NBA All-Star Jaren Jackson Jr.  NBACalkins: Jaren Jackson had to be traded. Because it’s time for the Grizzlies to start again.  Daily Memphian",
    "published date": "Wed, 04 Feb 2026 13:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPelNzNGNqWmZaVEc2YTdXUm9Rb0NkR2hVcGN1cE1ES21QQ0FqQTZyOF93bTlYb2pKV05LdTZVa2FaUS1USUVqVlZxV1Q4MVAzLVBNeFQtcDhlWFR2Q2FvSHBWdlFqUVNWSU5FUUI2MFlpQk9McXB0UWRBSm5obmRmVkZDalgzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sltrib.com",
      "title": "The Salt Lake Tribune"
    }
  },
  {
    "title": "Exclusive | Ex-NFL superstar’s shocking claim on Tom Brady’s Hall of Fame future - New York Post",
    "description": "Exclusive | Ex-NFL superstar’s shocking claim on Tom Brady’s Hall of Fame future  New York PostSources: Robert Kraft not voted for Hall of Fame Class of '26  ESPNWho is the Chiefs’ biggest snub for Pro Football Hall of Fame?  Arrowhead PrideTerrell Owens calls Hall of Fame process 'broken' after Belichick, Kraft snubs  CNBCTom Brady casts doubt on first-ballot Hall of Fame chances after Bill Belichick, Robert Kraft snub: 'I should be a little concerned'  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 17:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNVW81bWpGZWl1MDQ4RVRFMGdkZFpuaE5uWjVZX3pOdmNRdTdMV0hVZmV3VzlldkVvc1FTT2syT3RYaEY1RWwwMVoyZk9PUnlWZjRNQVNaTERPZE45RUhvLTRrQ2hZblNWc0dDNHF0eGhxY2tJS3Bsa21TbXRuLXdTS2FCa21felZjTUFXZ2c4cHA4WEozTDE4YzIycjVzd0sxR2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Reacting to the Cavs dealing Darius Garland for James Harden — who won the trade? Wine and Gold Talk podcast - Cleveland.com",
    "description": "Reacting to the Cavs dealing Darius Garland for James Harden — who won the trade? Wine and Gold Talk podcast  Cleveland.comSources: Clippers trade James Harden to Cavs for Darius Garland  ESPNLos Angeles Clippers send former MVP James Harden to Cavaliers for 2-time All-Star Darius Garland, pick  Yahoo SportsJames Harden Is Trapped in Groundhog Day—and the NBA Is, Too  The RingerDarius Garland delivers message to Cavs fans after being traded to LA  Akron Beacon Journal",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxPV1RRenN4bXdqQ0RwcDlOZkxYQTFreEFSaFh0YmxhWFZBTUFhR090QkkwcFZhUEpvV3dQQVdwb3YtU0dNYndDWWR2endqNk40RHhhRWpKV2tvY0x4RUtxbjR2c1NKM3BPdWlqT0d5SkxmREJxWVJLWFVGbFVLS19BcHRnZDEzLWRSblB5Z1pOTnFjSXZQOUxVVGJ2Vm9ZbGduc0lNelIzSzkxN2lCTTFxTURrTmNra25sRjNwblkwR2pPY0RsSHV1cTdZQ1hXazV4ekVaY2RKdGZPaEF5UHMxSHg2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Report: Chris Paul dealt to Raptors in three-team deal - NBA",
    "description": "Report: Chris Paul dealt to Raptors in three-team deal  NBASources: Clippers' Chris Paul lands with Raptors in 3-team trade  ESPNChris Paul traded to Raptors in 3-team deal, finalizing bizarre divorce from Clippers  Yahoo SportsBrooklyn Nets acquire Ochai Agbaji, second round pick, cash from Toronto  NetsDailyNBA trade deadline 2026 live tracker, updates: Cavaliers trade Lonzo Ball; Clippers move Chris Paul to Raptors  The New York Times",
    "published date": "Wed, 04 Feb 2026 21:33:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1YZ2xPSG1od0ZndnY5TkRuX1lBRUxqbjU1Z3hOWUloU2s5T25pUWRyZjFPUDB0Q3g5cHZMUEl4b2Y2WnhzLWc3RU5fQW1kc0k1NVhXZzRtb29LRXZreGdncFNxR19VUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "A win on Sunday would give Mike Vrabel a first-year turnaround like no NFL coach, ever - NBC Sports",
    "description": "A win on Sunday would give Mike Vrabel a first-year turnaround like no NFL coach, ever  NBC SportsPatriots players laud Mike Vrabel for setting 'standard' for Super Bowl turnaround  NFL.comPatriots entering critical phase in their Super Bowl preparation  Pats PulpitPatriots coach Mike Vrabel has built a culture that has his team on the verge of Super Bowl history  WCVBMike Vrabel has the Patriots right where he wants them: Counted out | Karen Guregian  MassLive",
    "published date": "Wed, 04 Feb 2026 13:40:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQcV85cVF2bzRtLWlJRWxyRWVKX3lmWHVidHRzdWczYmNjZzZnc2QxLVpKd1A2NHdMVElaUFQydjh4ZHdqX3BKTkNhOW1FZmplUFRRbm5rdGdDNTBaLVBPa3QyY3NBb0YxSnpSVTAzakpQa045WGVvMnBueGE5dGx3SVRQU3ktOWpYcHFDYlNTQ2I2Zy1xWlVlT2JlRHBiZDYzWjV4THc4MEZHQ1NqQXF5RTAwZEVYck5fRW9hQVl3cTBjbVdMenhLdWVyb2tOTFlPcXZKWmZpM2dzYjBEb1M1aQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Steelers add to coaching staff - Steelers.com",
    "description": "Steelers add to coaching staff  Steelers.comSteelers hire Brian Angelichio as offensive coordinator  ESPNSteelers hire Vikings' Brian Angelichio as offensive coordinator  NFL.comOne Saints assistant is reportedly declining a promotion with the Pittsburgh Steelers  NOLA.comReport: Steelers set to hire Vikings assistant as next offensive coordinator  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 21:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBhbmt3SWhhaVByMU9neTcxRzd3V044STZLdTh0WmVXdkkybFFlQnFicnNiOWQwU2dVODIwd01oUUJMM2hRRzNYMjdQX0xQRU5tby1FSmhtdlFSVkNhNHFQNmFNNUtYTHJ0WnBfOEZoOGpsSW4w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.steelers.com",
      "title": "Steelers.com"
    }
  },
  {
    "title": "The 2026 Winter Olympics Opening and Closing Ceremonies: What You Need to Know - WIRED",
    "description": "The 2026 Winter Olympics Opening and Closing Ceremonies: What You Need to Know  WIREDThis is How Hard It Will Be to Get Around Italy’s Winter Olympics  The New York TimesHow to Watch the 2026 Winter Olympics Live Online  The Hollywood ReporterFrom television to digital age, Milano Cortina sees media transformation  ReutersYour guide to 2026 Winter Olympics in Milano Cortina: 10 things to know  USA Today",
    "published date": "Wed, 04 Feb 2026 11:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNYUYtaURCZnZ2LXdWSVM0Mm9sUWhLaHpIRkpvM2VQa3RoUDNwTTFvYndEUGhyQUVfT2tUSGE4aU5LUDJWYzlqblMtVzhfV2p6cHFKcjRFeGZSR1UxTU9idGlfMS1IWktkeGZFUnlIVEZ3eF9HSVlTNUJGb3V6QnJjV2R3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "What Seahawks QB Sam Darnold said about injury as Super Bowl looms - The Seattle Times",
    "description": "What Seahawks QB Sam Darnold said about injury as Super Bowl looms  The Seattle TimesSeahawks' Darnold says oblique 'feels really good' ahead of SB LX  ESPNSuper Bowl LX injury report: Updates on Drake Maye's right shoulder, Sam Darnold's oblique, more  CBS SportsNFL news, live updates ahead of Super Bowl 2026: Sam Darnold optimistic about state of his oblique; Tom Brady wonders about his HOF status  Yahoo SportsSuper Bowl LX Injury Report: Patriots vs. Seahawks  New England Patriots",
    "published date": "Wed, 04 Feb 2026 21:22:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQNzBHNXJtUy1Mc01uR0lBMjdjbjZYRUV1REwyZGlWNmVlUDFVTWdLZld3dGxqcmtXbG1FSGNaVmlPTHMtNDFPRG5LRE5JMHZDbjhXazdRckV6dTlJaGNoWHlKMmJqUUF2c3Q0UHNiX2ZQcGNfZjlLV3EtUHloZ3R4Qjd1N3FiZmozUmh2TF92X09WYWktcjlrSG9kdXlZZEYwWFg4eklrY0xDYVlOeFE3Mlln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Mickey Lolich, hero of the 1968 World Series for the Detroit Tigers, dies at 85 - AP News",
    "description": "Mickey Lolich, hero of the 1968 World Series for the Detroit Tigers, dies at 85  AP NewsFormer Mets Pitcher, Tigers’ 3-Time All-Star And World Series MVP Dies  ForbesMickey Lolich, Detroit Tigers pitching legend and 1968 World Series hero, dies at 85  ClickOnDetroit | WDIV Local 4Mickey Lolich, Detroit’s Hero of the 1968 World Series, Dies at 85  The New York TimesMickey Lolich, 1968 World Series MVP with Tigers, dies at 85  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 22:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOejRnQXZiRW9SLTA1T0w1Z1phQThwTnU4VDRNREV0cUNiYVZ3UWVVUUo3cURrY1ZXalNMMkRHOHMycXJUSk00MjBPMG4tWFhvQ2lMU0o1dTU0WXlkVGRHQjNIMEFlUks5VUIwOFF4ZWFlUWxIak9LWTVvRnQ4dlJlOTVlaW8xdWhrWElGbmhaSFhMS1VINU13Ny1rOWZ5enpFVzc2VEdYcGtqQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Reports: Hornets add Coby White in deal with Bulls - NBA",
    "description": "Reports: Hornets add Coby White in deal with Bulls  NBASources: Bulls send White, Conley to Hornets for Sexton, Dieng  ESPNBulls continue overhaul, trade Coby White to Charlotte and not done  Chicago Sun-TimesHornets-Bulls trade grades: Who won the Coby White deal?  Yahoo SportsHornets add former Tar Heel in trade with Chicago Bulls, reports say  WBTV",
    "published date": "Wed, 04 Feb 2026 21:33:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1YY0tQSGdQTkFTeWZ1YlVtdV95QnBWTGhfY3ZLTno5ZXl6NzJaWnpqMUtSOFY5dktkWkF0dHpZRnJtYU5iandQR3BQRzMzcEdBWlotS0VKTFVETzQ5MFVJdGJNY2ZPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "How Celtics created new valuable option with Anfernee Simons trade - MassLive",
    "description": "How Celtics created new valuable option with Anfernee Simons trade  MassLiveSources: Bulls trade Nikola Vucevic to Celtics for Anfernee Simons  ESPNCeltics trade deadline: Will Boston stay active after reported Nikola Vucevic deal?  Boston HeraldCeltics-Bulls trade grades: Who won the Nikola Vučević deal?  Yahoo SportsPayton Pritchard embraces bench role as Celtics adapt after Anfernee Simons trade  The New York Times",
    "published date": "Wed, 04 Feb 2026 16:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOaU9INWNXVWljaFZkZEFqRHJBTHp2SFFKYk9MWnh2VElhNnpRNUNNdzhxaUpIUnNGLXVwei1vTWttd3VOUHk4OHhtOWVlSGdIZG5peVluRjY1aW04em5kZ1NLYS11Uy1NX0NPalRtdTRmUngyeHlKa1djQVZZSTNqb2ZBRDdRTHJTaWJ4ajZyY0J2V2hRb1F3VGJMdEVZLVFHMlVaczFNa2tSSnhDZXZOTDZB0gHGAUFVX3lxTE5mVEZMVU1yeW10ZmVjRzVTRVE0MHpHZ05CV1k3U3BBeHlEZkc0RGliNk1Zc2NYSHBKWVVNVG83Zkh1YndJLXA1cWVacW9TdmJET3ZRaVlub3BlSmRmUTJRZGp0aEVKMGNHczc2SEZTV1o2eUY5N0IxUDRlU0xrZmNqck41WmluSkowcHJoLXNtbkhRU3pWclhyM0JlRUNHdVZXNWUyMXBWbDVUdFJtbEhLVkpGMTJGZ1NQY0doOXRCM3R2ekZQZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive"
    }
  },
  {
    "title": "Jets Hire Frank Reich as Offensive Coordinator - NYJets.com",
    "description": "Jets Hire Frank Reich as Offensive Coordinator  NYJets.comView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 14:21:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNMUdSU051Z1U1Yk1xS2ZTUnFFSzNuM2ZPNEVXYi01bF9HU2VpVGt0aDl0LUh1b2pqaVRUM2Z3OHJ1WGV3UWNjZ19WSUtKSThJMnNKeG91ZGc3NS1ZZGJVQ2dROUFndzdZLUhDOXgwb3B1WS1NSktRUUtLNm9JQzQ2dHhZc0VhWm9LNFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newyorkjets.com",
      "title": "NYJets.com"
    }
  },
  {
    "title": "Red Sox To Sign Isiah Kiner-Falefa - MLB Trade Rumors",
    "description": "Red Sox To Sign Isiah Kiner-Falefa  MLB Trade RumorsRed Sox, Kiner-Falefa agree to 1-year deal (source)  MLB.comRed Sox sign veteran free agent infielder Isiah Kiner-Falefa, reclaim New Hampshire native Mickey Gasper  The Boston GlobeMarcelo Mayer Fallout After Red Sox-Isiah Kiner-Falefa Deal  Sports IllustratedSources: Isiah Kiner-Falefa reaches 1-year deal with Red Sox  ESPN",
    "published date": "Thu, 05 Feb 2026 01:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOT2RhTUlUaWx4QkMxREVpNnFBWDlBT3lDZVJrRm5HTVZTYTFVSnlfaDZkNHhjR2VnenNvV1d6NU1NMGZCQVpPemNzdXg2U2xIQ0h0emJqODZuUGhGcmdDQXduM3Q2VUdLdm5NSGhvTlU1OEFyOHRBcXpGZzlLSUJhcGE1U1ZxYnNTZV9xQ1BZOUhUZVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Source: Sixers trading Jared McCain to Thunder for first-round pick, three second-round picks - PhillyVoice",
    "description": "Source: Sixers trading Jared McCain to Thunder for first-round pick, three second-round picks  PhillyVoiceSources: 76ers deal Jared McCain to Thunder for 4 draft picks  ESPNReports: Thunder acquire Jared McCain in trade with Sixers  NBAThe significant risks, potential benefits of Sixers' Jared McCain trade  NBC Sports PhiladelphiaTrading Jared McCain is a big risk, unless something bigger is in play  Inquirer.com",
    "published date": "Wed, 04 Feb 2026 19:10:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPUklOZENfeVU0YTZkelVjVEh0Skp3Z01MSUhaQV94SzB4R2ZzdGx0V1FJcm9MeDFTQ21VZWFURnY0NDZBRERhTV9OYV85NjE5RDJSWC0xSGx3N3dvcEM5VUFXcEgyTHZpQWpKNFYtaEtsQzlDai1IQkVjekxXTGtrMmhlTEl5bzV2OW5Vbl9saE05RFU0M0x6eXY4T2M4S1NBci11M2RVQ04yWEsyWU4yZVVGbXh4R1U2ZWtEUmdxRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.phillyvoice.com",
      "title": "PhillyVoice"
    }
  },
  {
    "title": "Doctors call Lindsey Vonn’s return after ACL tear ‘unparalleled’ as she eyes 2026 Olympics - kdvr.com",
    "description": "Doctors call Lindsey Vonn’s return after ACL tear ‘unparalleled’ as she eyes 2026 Olympics  kdvr.comCoach: Lindsey Vonn has no workout pain, confident she'll race  ESPNLindsey Vonn Plans to Compete in the Olympics with a Torn ACL. Surgeon Explains How It’s Possible (Exclusive)  People.comVonn crashes in last race before Winter Games and says ‘My Olympic dream is not over’  AP NewsDespite a 'ruptured' knee ligament, Lindsey Vonn says she will compete in the Olympics  NPR",
    "published date": "Wed, 04 Feb 2026 01:47:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNQ05wWlZaaWJRLTJZMV9VbFkzREUtWGY0bnBGOVI2REZfbTB4VkZKdmlYZFl3MER1MWpYRkJQVnl6VWpHSnNxNHNKWjdSc2U4WDVCUXdQbUVNMUMyNjVGOWItTnFoUHJFdG9hZjJGYzBPTm1qYkhVZEhNVGNpRzh3TTVEb3NVcFJNVU9YN2taOTJtVUdtejRxQ3NvWVZaSUdEb3gycmpHdnZaOGVVOEFyWmhVM28zR1nSAbwBQVVfeXFMT2JPSl8xektsbjZDa2R4SDczbGhrd0FuemxzM1RLWWJQVWxrMHVfNXkyaUZfV3pUcVlSLTAwZHNhTUEwWVNwLVB4Y2h4Tm15Q3VrTzhCUFd2b3JVV3kxeDdEd1QwTk9uMFVRRVU1VG9nR29mY0QtVjBfbFg4R1hVNFJnQU92UlhBZ01oTzczNnBPWEo1UG1aWE5iYmhqM25neXFWR0NMMUw0X0JxeTlFcFlZT0FlUHdoSWluZ0w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kdvr.com",
      "title": "kdvr.com"
    }
  },
  {
    "title": "IOC open to earlier dates for future Winter Olympics and Paralympics because of warmer temperatures - AP News",
    "description": "IOC open to earlier dates for future Winter Olympics and Paralympics because of warmer temperatures  AP NewsIOC open to earlier Winter Olympics due to warmer temperatures  ESPNWinter Olympics Faces New Climate Reality  Bloomberg.comClimate change threatens the Winter Olympics’ future – and even snowmaking has limits for saving the Games  The ConversationHow climate change will make hosting the Winter Olympics more challenging  ABC News",
    "published date": "Wed, 04 Feb 2026 20:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPeXZoek53N3k4VnN5aXhZZy1qSTBiR19nazB6eld1SndTQUk3bHhtV3B4bnhHNGx2UzR1cGhTbkI2TFM1dDdtZlVWLUR4YjM1aFJFbWtILVpkdXp3UC1IMzFyNzVGXzRFUjhIMC1oYzJuclU4NmFnemJaeWRWWk9YVjJhOXVRaGFGOWdaeldNLVNDR3RUQm1fbDdzRV9CRVVf?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "There’s only one way Pats can beat Seahawks in Super Bowl, insider says - Seattle Sports",
    "description": "There’s only one way Pats can beat Seahawks in Super Bowl, insider says  Seattle SportsSuper Bowl picks, odds, score predictions for Seahawks vs. Patriots  NFL.comProjecting the Super Bowl: Box score, final score and over 100 player props by value tiers  ESPNHow to watch Super Bowl LX: Stream the Patriots vs Seahawks NFL championship live  Fox NewsHow to watch the 2026 Super Bowl: TV channel, streaming info, Halftime Show start time and more  Yahoo",
    "published date": "Tue, 03 Feb 2026 22:08:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPMXlKMEFkZUUxSTJ5UnFhTGFyLWhHQW52R0ttcWViMUZKUGlBTlhpeWtqUXViZk1mWXB1d09PVEhGNWhOWDJTMWdUaUdLYmlMNG1qUERmZGd6ZUZnN044ejBqNTJvTkVPMmVfTjZmd2Vyc0ZLNlVQNFYwZDVfU2dva3JTaEJzZ0M2bmpEQkQ3cUsweUQwbmc1T1hQcEN0SjBtRXpvYjVaZXMtbkk5UHRLb3VwaWxJZE5HTnI1MEJpWTMxZ2YwdkcybXBfRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.mynorthwest.com",
      "title": "Seattle Sports"
    }
  },
  {
    "title": "Pro-ICE billboard pops up in San Francisco, California ahead of Super Bowl 60 - ABC7 Los Angeles",
    "description": "Pro-ICE billboard pops up in San Francisco, California ahead of Super Bowl 60  ABC7 Los AngelesSan Francisco Bay Area Is Skeptical ICE Won’t Target the Super Bowl  The New York TimesNFL says ICE not among federal agencies at Super Bowl LX  ESPN‘Defensive player of the year: ICE.’ Billboard sparks outrage in S.F. ahead of Super Bowl  San Francisco ChronicleBay Area's own 'Batman' explains viral outburst over ICE at the Super Bowl  SFGATE",
    "published date": "Tue, 03 Feb 2026 23:48:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQdUVmUzVWVnZyaWF1b3p1Wl95TFp4S25WTk1KN3lIcEtEMlJGUm1yRElHaExYYzYwcjVIdUNOaUFFb1hUYk9FVWNLa252Y0dOWkQ1cW04ZzBaOE1xbkVEckZEWGcwV181V0Jpb3VoTnJ4bkRNUW9Mc2xaSERVaTJYT2RhWlA0eDJreWtmQ2FwMFlMMUdKY1FCU3ZLWm1GckdU0gGmAUFVX3lxTFAyaTVINlY3RmFDMVVPcFB3N2FGQkotNUhYdjNfaUZrRUlTb3hlZUVXeGVRYVRpaC1tdGFyb1VmU2tzM2czOXhVMVJGVW9FZ180UnB1enpVOUdhSVAzMEhHS0V1SEV4NHQwSGRzYnFITGJ3cGhNRFdINjJuLXhvM25TX0hCYi1wOEdYOVdfWUk4cVZOaVRsOW51WXFicWREdVFmWl81U2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abc7.com",
      "title": "ABC7 Los Angeles"
    }
  },
  {
    "title": "The story of Sam Darnold told by those who know him best — from a bust to $100 million - New York Post",
    "description": "The story of Sam Darnold told by those who know him best — from a bust to $100 million  New York PostGhostbusters: Back Darnold, Seahawks to exorcise some demons in Super Bowl LX  ESPNSam Darnold went from bust to journeyman to Super Bowl starter. What can NFL teams learn from his path?  CBS SportsAlbert Breer’s Takeaways: Three Lessons From Sam Darnold’s Rise in Seattle  Sports IllustratedBrock Purdy's advice pays off for Seahawks' Sam Darnold ahead of Super Bowl 60  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQc1ljQzFKZklIczJfc1BSQVN5Q0pBVXMxd3RWSnJSMk0tZFVzT0dlRDlZR2c2dDBtVkFvblg5RGJsVXVLSlNOeUo2aFB1OHlKZldjampIb0lmVXh6anN4MUtMTzBOUmNRV3ZnLXJLN3dXLVUzeWJKT2VTVk5Pa2s2RmhhWEtJQ0hDb3phT2dSY3lfc2NIdWhOaEtn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "The NFL’s Super Bowl Demands Are Crazier Than You Think - Huddle Up | Joe Pompliano",
    "description": "The NFL’s Super Bowl Demands Are Crazier Than You Think  Huddle Up | Joe PomplianoThe Dealmaking 3: Super Bowl LX & Top Issues Behind Big Game  Yahoo SportsSuper Bowl Excitement Sweeps America  DOGO NewsWhy we love watching the Super Bowl live  University of Colorado BoulderFINAL WHISTLE WISDOM: The spectacle to end all spectacles  pictouadvocate.com",
    "published date": "Wed, 04 Feb 2026 15:18:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBIWmhZaWhaT1RYRzd1SXR0VHRmRlVtajdlSkJaYVoxVlo4a0V3bDRjQldmdVNBWUN3S1h6VHZjc0JnSjAtSFFtZEp3ay1CWEhYM3dlaDRLaHZDbWRWNEQ1TjJ2YVVUMTF0dVNDOUUtdTVkT2xUNGNuc1VlRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://huddleup.substack.com",
      "title": "Huddle Up | Joe Pompliano"
    }
  },
  {
    "title": "‘What a f— run it’s been’ — Draymond Green and the Warriors near the end - The San Francisco Standard",
    "description": "‘What a f— run it’s been’ — Draymond Green and the Warriors near the end  The San Francisco StandardSources: Draymond Green involved in Warriors' trade talks  ESPNWarriors Notes: Green, Kerr, Curry, Butler  Hoops RumorsDraymond Green, Lakers reportedly would have mutual interest if traded to Bucks  NBC Sports Bay Area & CaliforniaDraymond Green after what might have been his last Warriors game: If it ends, 'what a f***ing run it's been'  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 14:30:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE81dWRjeks4MDRYSFZaZ29sdTIzZkdVQmZiclBlYnNYbWtCOEtLVFVZTm5HaHVhbUVLUFNmR0ZhaTRndUFDZHRDRkJSQW92M2NNRS1zaEFuY1RUbjJsbjM2VW9MaHcxQ042aDFNY2p0dVJzclNPb2UtYlR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Blues acquire Bordeleau, pick from Devils - NHL.com",
    "description": "Blues acquire Bordeleau, pick from Devils  NHL.comDevils acquire Bjugstad in trade with Blues before roster freeze  ESPNBlues trade center Nick Bjugstad to Devils: What it means for both teams  The New York TimesBlues Make First Deal Of What Could Be Multiple Dominoes, Trade Bjugstad  The Hockey NewsDevils, Blues make NHL trade right before Olympic freeze  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 19:45:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1HRWVNSzdGVlN2amR4OW9sS05WQTZEM3YyRkk5d3FmMktOUUMyUUYtd0RuZVRuTjAyc2ZOamRKYVlYT0JRWDRZT1E2SS1oVUpPMUpjVzVxQ3Y1YmFFcXhHRHNKbmhCYS1KMk1ESzU0dVplMFFrX3RBbFk5Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Insiders Say Giannis Has Wolves at the 'Top of His List,' Would Be 'Thrilled' - Sports Illustrated",
    "description": "Insiders Say Giannis Has Wolves at the 'Top of His List,' Would Be 'Thrilled'  Sports IllustratedView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 03:16:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPYzJacVFCSUFDd2hFUGt0a2ZibkNmbE1oRWZGVi1faVJPdmZyN182Y3d5OFU3MnY2X3kwR2dmVDRjNDlwZEVTbVpybFdKSGh3VkR3d2FUNzJfMHI0TDQ0NG1wLVJCS3ZrdEJIVkNFSjFKZXFiSDN4Y0tSc3JVNmU4cW11OUhkUUh0VVRWM1RNMzNpcTcycVRmdHYzWkl6b1VpNjIxYU5DWWROcmVfVUdoRklWSHRTRnEzN1F3V1liRXRsbEl0WEVKN0hvWm12U3ZBZWliNVBzMWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "NBA Trade Deadline Eve LIVE Buzz Bonanza! - Marc Stein | Substack",
    "description": "NBA Trade Deadline Eve LIVE Buzz Bonanza!  Marc Stein | SubstackNBA trade deadline 2026: Mavs reportedly trading Anthony Davis to Wizards in 8-player swap; Bulls trade Coby White to Hornets; latest on Giannis Antetokounmpo, Ja Morant  Yahoo SportsNBA Trade Board 4.0: Giannis Antetokounmpo, Ja Morant and others still available - The Athletic  The New York TimesNBA trade deadline: Why Wizards and Jazz made stunning star moves  ESPNNBA trade deadline live updates: Rumors and news as Cavs trade for James Harden  CBS Sports",
    "published date": "Wed, 04 Feb 2026 15:26:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5aZUZ2WXpGRDBzRDZHMVdtakxNV1pvc1FQNWU1TWhHMmtGMlRxNFdESk9ZXzVGUzhENWg3cEhCNkxLejJkRGUtQV9vMHFtUUNNOEJSMkdyRzFUZjJmMlktOERPeFhxTVpna2NKRUdYZGZRMFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://marcstein.substack.com",
      "title": "Marc Stein | Substack"
    }
  },
  {
    "title": "LIV Golf to receive Official World Golf Ranking points, with some caveats - Golf Channel",
    "description": "LIV Golf to receive Official World Golf Ranking points, with some caveats  Golf ChannelLIV Golf hits out despite being awarded world ranking points by OWGR amid 'changing landscape'  BBCLIV Golf League: Jon Rahm questions limited world ranking points on offer and explains why OWGR ruling 'doesn't seem fair'  Sky SportsTop-10 finishers in LIV events to receive word ranking points in 2026  ReutersLIV Golf has made some big changes to its prize money payouts this year. Here's what you need to know  Golf Digest",
    "published date": "Tue, 03 Feb 2026 17:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOZHgxWmVJZ0FKS2ZsOTFPTVZjZ3pKbi0xQ3NPWk9BV3lreW9IaTlCeEJUdzl0aDB2Y3VQM3Nnck9GbW8tNEtOYTk4QlFZYzI5c0xLNXBnZ19BajZIajFsRHlNX2NRUHZoTXh2bTZvNnlvUF8zcWlOWUptU2NQS0FaN0dwUl9xNVJhWUJGSi1PeElhVkhqSTRsVXdVenV2ZlFJMGFxRUt0UlNwdWtHVktZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.golfchannel.com",
      "title": "Golf Channel"
    }
  },
  {
    "title": "5 things learned from Packers GM Brian Gutekunst’s news conference - Green Bay Packers – packers.com",
    "description": "5 things learned from Packers GM Brian Gutekunst’s news conference  Green Bay Packers – packers.comPackers GM Gutekunst addresses disappointing end to 2025, team's needs for 2026  WLUKPackers GM seeks solutions after second late-season collapse  ESPNPackers Deliver Bears an Offseason Gift with Official CB Plans  Yahoo Sports6 key questions for Brian Gutekunst's season ending press conference  Packers Wire",
    "published date": "Wed, 04 Feb 2026 21:22:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPSEppSUp2QjJZemlBNjE2bkFncmZyRXQtZHRrbkt1eVl4eExfWVhHaC15Ri12VERPckxuQkdWcjIzQ1BCSFc2aFpISHhaajREWEtUeUJhT0g1aGxLaHVpOUh4alBqZXkwZG1ENWNxVDV4dHFPeURaSnRPaGV4UWpDdzl1ekRiMDBFQlN6X0g4N1VJcV9yQjAtU0xGZUNjQ2RUQjkyU2pqZTAtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.packers.com",
      "title": "Green Bay Packers – packers.com"
    }
  },
  {
    "title": "Browns’ brass say very little about the future of Jim Schwartz - NBC Sports",
    "description": "Browns’ brass say very little about the future of Jim Schwartz  NBC SportsNew Browns HC Todd Monken declines to comment on Jim Schwartz's future; Shedeur Sanders' role TBD  NFL.comBrowns new coach Todd Monken: ‘I didn’t take this job because of Jim Schwartz’  The New York TimesHead coach Todd Monken’s Browns offense starts with one non-negotiable  Cleveland.comTodd Monken may have just shut the door on Jim Schwartz with no-filter comments  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 15:11:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNVXVDNTVGa2F1ZUR4N0hoMkJ6T0trVE5ERnBPZ1pYX0RZWTIyY1NQTE9ONFlGd21JTkxtcWZGcTlDb2JvNjc2UWl2Y2prWlk0OGxHQ2lCLXlObm5PdU4xWHpYcW9sZnMyT2hXd0JYa3BRdUxBOEt4OXdnQnItaTJmMUVEZXluZTNGMnN0RGRmT3Zuc3FHaWRmNDQ3Vm1XX1R2NUZYUDhPVkxNWjVsQk5qQ0VYU1lROWNwMDhwRmZCdi0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "In praise of Pep Guardiola for speaking out, regardless of the inevitable ‘Whataboutery’ accusations - The Athletic - The New York Times",
    "description": "In praise of Pep Guardiola for speaking out, regardless of the inevitable ‘Whataboutery’ accusations - The Athletic  The New York TimesManchester City manager Pep Guardiola speaks out on Minnesota killings, Palestine in news conference  The New York TimesPep Guardiola told to 'focus on football' after conflict comments  BBC‘People are dying, you have to help’: Guardiola decries wars in Sudan, Ukraine and Palestine  The GuardianMan City's Guardiola makes social justice plea ahead of World Cup  ESPN",
    "published date": "Wed, 04 Feb 2026 16:11:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQNUZ1dEVSZUJqRVFKcVk5U1RWUFdMSVQ2Z212OGRxdlhkdjdMY3A2Q0xFVUJkYTRrYTJqdE9PVXQxczdkb1AxdFZhX3VESHFzNDB6YUthLW1uamUzVmdJRnljTXJad29rSWtJUk1DV3g1YVBWVjluUFRacVpCUm5nYnBoN01xYjR6bUwtZXg2XzYtOC02?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Pirates Join Bidding For Framber Valdez - MLB Trade Rumors",
    "description": "Pirates Join Bidding For Framber Valdez  MLB Trade RumorsPirates emerge as aggressive suitor for Framber Valdez: Sources - The Athletic  The New York TimesMLB rumors: Framber Valdez draws interest from surprising team; Astros still hunting for lefty bat  CBS SportsCould the top remaining FA starter join Skenes in Pittsburgh?  MLB.comDo the Pirates actually have a chance of signing top-tier starter Framber Valdez?  Pittsburgh Post-Gazette",
    "published date": "Wed, 04 Feb 2026 17:52:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOTzVaVjlpdEkzNVcwYUpnZHAxYUJET01Zejk5UVBQQmZabHhtcWhOUml6U2VrcjlTUWotSU9oY2FydlNIN19HM0lLVzd6NTN4MWNYSTVBRVB5TnEwOHFsclMzSHk0eGNtbkNZLUZzMnpuaURFRHFPNEVCenpvQ05nTXRmanhWaE1lNDRmLQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Falcons president Matt Ryan won't commit to Michael Penix Jr. as starting QB when healthy - NFL.com",
    "description": "Falcons president Matt Ryan won't commit to Michael Penix Jr. as starting QB when healthy  NFL.comFalcons' Penix vows in post he'll never fold in face of pressure  ESPNMatt Ryan non-committal on Michael Penix Jr. as Falcons starting QB, defers decision to Kevin Stefanski  CBS SportsNew Atlanta Falcons Leadership Shies Away From Michael Penix  sportsnaut.comMichael Penix Jr. makes it clear he won't be discouraged by injuries  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 13:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQd3FCMkR2TlNrdldDYXdaZ2hlMGJVSGh5MC1FRWpGM0g3bHZPUDl5aGdOSXZScExkOWZhTk1GZkExM2VKUVJRV1hGVVNOb25rTkVWTElVV3BOdUIweTMzODl4Y0hqbWNIR0tYTW01X2lTTlhkUUhhcm9kQ2ZFRi1VNmpjTExkbWwzcHVyTVZDLXRJMFp1TS1kSA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Sabres come within 26 seconds of sweeping Florida - Audacy",
    "description": "Sabres come within 26 seconds of sweeping Florida  AudacyLate slip costs Sabres extra point in Tampa Bay  NHL.comLightning come back to beat Sabres on Jake Guentzel’s goal in overtime  Tampa Bay TimesSabres’ disappointing OT loss to Lightning a sign of rising expectations: 5 thoughts  The New York TimesKeep focused: Buffalo Sabres at Tampa Bay Lightning Preview  Raw Charge",
    "published date": "Wed, 04 Feb 2026 12:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOX1NvSERyazJMSUZNcmJkbHdfZzZIU1lHMTBwTlZ6RUdoODZrNDQtQnFqZ00yaGhCeHpzN1A5ODdadjRFcXRWVm10OTBNZXdjeElwM0t1VnNPYXVLYnRMNU9qeUZ1Sll4eGZEMnhCX29jM2RJY0tYRXdHQ2l2V19ZdVdDM2hzNTdvbzhOSnN4WW9zTC1FbHNKUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.audacy.com",
      "title": "Audacy"
    }
  },
  {
    "title": "Hamlin aggravates injury in fall at parents' burned-down house - ESPN",
    "description": "Hamlin aggravates injury in fall at parents' burned-down house  ESPNDenny Hamlin plans to race through shoulder injury as Cup Series season approaches  NASCAR.comDenny Hamlin re-injured shoulder during off season  Jayski's NASCAR Silly Season SiteDenny Hamlin makes first public comments since father’s death at Bowman Gray  FOX8 WGHPDenny Hamlin reveals injured shoulder, speaks for first time since father’s death  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOWWdjS1diTzlpdXhhZHVfd0N5Q0hWY1d6bUQ4czMwc3hxQktBV1dFY2dYREY3QUhEc0I1SUFwbEJwN2NGLS0wZXFvYk9qU0pWcFFHaFhYUmFGUkkzUTdMYjFveXJlbzY4SHBQOUtfUE1YZlozUEJOZUVtWXd2V0ZoQU9KMFZSdXdGT3l5QlUwNU5qMkZmYnhHa19HNExOMjNQcndzSnZUbXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Super Bowl Notebook: Updates on Maye's Shoulder, Spillane's Ankle, Kuhr Scouts Seahawks RB Kenneth Walker and More as Super Bowl Week Kicks Off - New England Patriots",
    "description": "Super Bowl Notebook: Updates on Maye's Shoulder, Spillane's Ankle, Kuhr Scouts Seahawks RB Kenneth Walker and More as Super Bowl Week Kicks Off  New England PatriotsNew England Patriots' quick rebuild, rise to Super Bowl underscores shifting AFC landscape  NFL.comSuper Bowl LX: Who has edge at each position in Seahawks vs. Patriots?  Yahoo SportsFrom Evil Empire to Super Bowl underdogs: is it OK to like the Patriots now?  The GuardianNFL Super Bowl 60: Are the New England Patriots back? Drake Maye & Mike Vrabel the new Tom Brady & Bill Belichick  BBC",
    "published date": "Tue, 03 Feb 2026 22:24:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxQYkFNNmRiV1plWDdmX1J2a0JJdEtqRVI2RVpPWXcxRklSdzhZQzZrTlBSY3dnLXlBSHphUUdFZXI3Qk5tcXN5ZXBVbVR4UXJzUVBOd2c5aFpKd28tdUlEc3VxcGlobmk2RVBmNUtjRlQ1WGFjdmV6dGQ5c3RXU3dMMGtXeEhyTElsV2pTTHFNMWFsU1hobDFSQXU4aEFxU1BsU1RXdVlaRkJyS09HVnNkUm9pd0JRZTFraHFYaGRHSkVqMDRyQ2ZvemptUk9ZVkViS3hfWHRiazBkYmFiUC15NGk3ZW5IQWl3Rkw1MTBBMVh0bktmOWo4aGRsT0M4TjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patriots.com",
      "title": "New England Patriots"
    }
  },
  {
    "title": "Ole Miss coach Chris Beard ejected in wild scene - New York Post",
    "description": "Ole Miss coach Chris Beard ejected in wild scene  New York PostTennessee 84-66 Ole Miss (Feb 3, 2026) Game Recap  ESPN#25/RV Vols Thrash Ole Miss, 84-66, Behind 28 Points from Ament  University of Tennessee AthleticsWhy Chris Beard needed to 'fight' for Ole Miss players, get ejected  The Clarion-LedgerChris Beard explains wild ejection from Tuesday’s game against Tennessee  Yahoo Sports",
    "published date": "Wed, 04 Feb 2026 13:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQYlU3X3RNUGlDbTBsZTVyaVhhTGdrejg4YkdRZnNENktTWkdoNXYwYmFFS2I1a3pyRWJOSnFjNng1eWtZaU9EY3FHR1lSWEU3SjB0bVpLTWctTzF3MjlzVjhiaGtoMkc5SG9lb2dQQXVsN3NaOXloUERkQU9zd1FELWlLazJTV3R0ZEVwWjVfRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "An inside look at Milan's Olympic Village - Axios",
    "description": "An inside look at Milan's Olympic Village  AxiosReporter's notebook: A peek inside the Olympic Village  NPRA look inside the Olympic Village in Milan  YahooSee how athletes live at the Milano Cortina 2026 Olympic Village  USA TodayWelcome to Team GB’s Milan base: TV, games, popcorn and 5,000 teabags  The Guardian",
    "published date": "Wed, 04 Feb 2026 10:30:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1ZWVdtX0NyeWFNNkNlX3JZTldqWTJyZ0xQQm9RNVlUOHZyZ2J5NUJHREVJTWtrOFFZMl8zdmxKWWJyU2JoZ1R2WE5ISWQyeWFMZ08wWDE5emZBMWgyOEEtOHFzOURPYVNSaXRpNll6SFN4X0ZkYWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "L.A. politicians call on Casey Wasserman to resign from Olympics committee - Los Angeles Times",
    "description": "L.A. politicians call on Casey Wasserman to resign from Olympics committee  Los Angeles TimesCalls grow for LA28 chair Casey Wasserman to resign after Epstein files release show emails with Ghislaine Maxwell  ABC7 Los AngelesLA officials call on 2028 Olympics chair to resign over Ghislaine Maxwell emails  The GuardianL.A. Olympic committee chairman Wasserman says he ‘deeply regrets’ emails released in Epstein files - The Athletic  The New York TimesCiting Epstein files, calls grow for LA Olympics chief Casey Wasserman to step down  LAist",
    "published date": "Tue, 03 Feb 2026 23:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOcEI2SUJCM0lCSzFBYXhYaERVODFTZEhLVUJxb3QxWDJFSi11dUJoN2FjLVU4bUJqWEpRX1V0aFZmS1JLMXR4TFFTLWlubV92SXVBZWRiVkxHbkltc3Z5ZlY4SzZSMFlRY25nYnZoWnZITzVBbVgtQUViNXNXWVdrVmpOR3JCTE1ETEUwZDk4NkpxdndLbGNhX1RZM04wLWR1b214dzhUQldBTTNHRHdaeVB1NWM4Q1hEVV9Cak5YVjZJY2xZY1VMbEw4bw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Virginia Tech football announces staff appointments - Virginia Tech Athletics",
    "description": "Virginia Tech football announces staff appointments  Virginia Tech AthleticsTune In: Virginia Tech Football Press Conference  Virginia Tech AthleticsFrom Fired to Fresh Start: Brent Pry, James Franklin Discuss Renewed Reunion  247SportsJames Franklin Discusses Hokies’ Coaching Staff, Roster Construction And More  TechSideline.comEverything From Virginia Tech HC James Franklin At Wednesday's Press Conference  Sports Illustrated",
    "published date": "Wed, 04 Feb 2026 15:04:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQc2trWXNtZHYxaXpKb1JabGtaMkgwYTQ2OUZIOFVsZ3FWNzdpZ1VoWFNBRHdoNFhmVGVSM3FJN21qdjdKX3V1WkJ2TEFDOWk2NDlzbGZsMmkyLTQ4XzlUSzZrX2dCVDk2MEhzVEM2UFQyTGdrWXA1OEwwNzZtU2RpaWZKMGhjYUZNNHl6ZlVycjlkNXZ0MXdLVEZwZlJuRThHVWZjWDJFSk9NOUM5RFJMLWhoSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://hokiesports.com",
      "title": "Virginia Tech Athletics"
    }
  },
  {
    "title": "As Relationships Start Forming, Player Support For Mike LaFleur Becomes Evident - Arizona Cardinals",
    "description": "As Relationships Start Forming, Player Support For Mike LaFleur Becomes Evident  Arizona CardinalsPackers HC couldn't have imagined both LaFleur bros as NFL head coaches: 'I'd say you're full of (expletive)'  NFL.comCards' LaFleur says he'll call plays as QB decision looms  ESPNYou've Got Mail: You've Got A New Coach In Town  Arizona CardinalsMike LaFleur: If Cardinals job was easy, it wouldn’t be worth it  NBC Sports",
    "published date": "Tue, 03 Feb 2026 22:47:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPczBaY0VzLXJIYzJyN0Y4bGxFcDVQbTF2T0J5M1VSQUxNLTVoeGJUOUZKVlNmQnNTZnNYZlpQT0QxVlJnRFBmQnN2SXlJUzRSYlN1RUhOd1RTSzVURGg0MDJlM0pzclBQSGNKZzRnMDJJY2lCcFBfS3RfZHZaMW1XdWlNSDlkQjdfSnhjVll5QTBSc0ZQalhSdzM4aG5qaVNaZmZPQWZ4aEI0NXdKZFBvUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.azcardinals.com",
      "title": "Arizona Cardinals"
    }
  },
  {
    "title": "College Football Playoff announces quarterfinal, semifinal dates, bowl sites for 2026, 2027 - On3",
    "description": "College Football Playoff announces quarterfinal, semifinal dates, bowl sites for 2026, 2027  On3College Football Playoff Announces Quarterfinal and Semifinal Dates and Bowl Sites for the 2026 and 2027 Seasons  College Football PlayoffCFP sets its 2026 and 2027 bowl schedule, keeping Rose Bowl as New Year’s Day quarterfinal - The Athletic  The New York TimesCollege Football Playoff schedule: Dates announced for quarterfinals and semifinals over next two seasons  CBS SportsJon Sumrall labels college football calendar as asinine: 'That's absurd to me'  On3",
    "published date": "Wed, 04 Feb 2026 16:52:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPUFVNTl9Cd19fNmh3N0lveWVLQVF3akNoVHRjLWN0X2hqM2YzcTJsRm5GazA5SjFiN1VCS2pPVzk3SVRfUktoNVNiTGtQeEhvcENITF9LVjFHM3puTWJzVFBPOUlFd0ItN0hpTFlBdHV5RGtfX3hmVVhwWFJqWV8zN0ZUU3J3V1E4Z1dfZGFmWWVXRzhxUllyU1pYNkZyWHpsemJMUW5ab0xRaEVJQzA1UFdoUUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "LPGA Commish Embarrasses Tour Even More With Bizarre Excuse For Cancelling Final Round Of Season Opener - OutKick",
    "description": "LPGA Commish Embarrasses Tour Even More With Bizarre Excuse For Cancelling Final Round Of Season Opener  OutKickCraig Kessler vows improvements after shortened LPGA opener  ESPNLPGA commissioner: TOC didn't go to Monday because tour wasn't prepared  GolfweekICYMI: 2026 Hilton Grand Vacations Tournament of Champions  LPGANelly Korda wins the season opener on the LPGA without having to hit a shot on Sunday  AP News",
    "published date": "Wed, 04 Feb 2026 15:05:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPaE5PRFZIcnBRYmlZbTNKdlpkSk9jaUVHNWloWmF2LUlDM1hhR0JyX0RiV1NISnFIRjVDVXhLWllCejF0RU9ZWXNZa19zNnZMcEVsNnZyU1pJbHJETzZwbFRYYWpJMWltaHVNZlZyM1VoX21WaENLRDBNY0VrNmZBeExYVmFxNEQxNVhHeUZJMklNQXlIU1NYb3N5ZU9SRHlNbWRjeW1GOFpNeEdNd2NvMXZlbFVTcEpWRTV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.outkick.com",
      "title": "OutKick"
    }
  },
  {
    "title": "Lakers Tipped to Land $20 Million All-Star in the Buyout Market - heavy.com",
    "description": "Lakers Tipped to Land $20 Million All-Star in the Buyout Market  heavy.com'I love that guy': Pistons trade Jaden Ivey in three-team deal, acquire two players  The Detroit NewsPistons have another move coming after Jaden Ivey-Kevin Huerter trade  Detroit Free PressPistons add Kevin Huerter, Dario Šarić in three-team swap  NBAIs Timberwolves' Mike Conley trade a precursor to a Giannis Antetokounmpo deal?  CBS Sports",
    "published date": "Wed, 04 Feb 2026 13:14:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE81dmdqUENDa2ViN0NudmlpdzhXZ3VORVVQZy0yaHZhRHgzU0lrRXdMd2oyTXBwTGFSbU8tODAtdXhvZEM5XzRlbnRvWk9zcUpndGZqOW1OSDI0NXdZcTRpVzRSZGh4MmY3ekRMU3h1ZExFa1JXeW9neHRBSkF2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://heavy.com",
      "title": "heavy.com"
    }
  },
  {
    "title": "2026 Pro Bowl Games: What We Learned from NFC's 66-52 win - NFL.com",
    "description": "2026 Pro Bowl Games: What We Learned from NFC's 66-52 win  NFL.comView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 04:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQZHZLclpMX2h2SGJpUzNXUEdPOUJENVktdnRibEtYWER5eERVT05nM2YxQzBvQ1E3NmZ4LVpQOGRIcFJNbEpqb0tLdWJfckZxNTh1SllqYllCcmRNeDltODBodGNTOU1Na1BYeFhTakJ6cmlOc1dlZXU1LU40VGJMbzVESFRpdzFa?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Northwestern Announces 2026 Home Football Venues and Ryan Field Opener - Northwestern Athletics",
    "description": "Northwestern Announces 2026 Home Football Venues and Ryan Field Opener  Northwestern AthleticsNorthwestern to debut Ryan Field vs. Penn State on Oct. 2  ESPNNorthwestern football stadium opening date has been set by the school  NBC 5 ChicagoPenn State to face Big Ten foe in a primetime Friday road matchup in October  PennLive.comNew Ryan Field won’t open until Oct. 2, NU’s third home game of season  Evanston RoundTable",
    "published date": "Tue, 03 Feb 2026 18:05:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPcWI0VkpQb3JGcjh2VklPZF9XVHp2NXFSLUVudjBCWnRyNGJGakppbGlqTTUwRnVkUDZPaTc0akJheVBjRk9sYXEyYVJJRFQxZ1NNVW4yZmV6aldxZDR3RzVSa2NCQW9pVHJQZjB1SHY4NkpjMHJZb044cy11Ri12U2lCWGY3b3g3cE1xSUZiNVZXcU5yUy1jSnhoSGJhR3QzMHAwTGx5U0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nusports.com",
      "title": "Northwestern Athletics"
    }
  },
  {
    "title": "Instant observations: VJ Edgecombe stars in Sixers win over Warriors - PHLY Sports",
    "description": "Instant observations: VJ Edgecombe stars in Sixers win over Warriors  PHLY Sports76ers 113-94 Warriors (Feb 3, 2026) Game Recap  ESPNAs Joe Lacob, Mike Dunleavy toil with trades, the clock is ticking for Warriors  NBC Sports Bay Area & CaliforniaInstant observations: An all-around gem from VJ Edgecombe powers Sixers to fifth consecutive win  PhillyVoiceSixers takeaways: Winning without Joel Embiid, best stretch since 2024, and more from victory over Warriors  Inquirer.com",
    "published date": "Wed, 04 Feb 2026 05:19:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5TT0xaLTJNQ19YNUxqUHRTdGdNNnRDMEZoMG93ZkJfNjlMa2wzc3RnRWZoWGV1b2RwX1NmN1ViUlhoaVNITXE4bHRTVzR1T1NDYkhVcUkzRVdHcnBqa1YwNmczRUduaktJWm5zVlVualVLU0hHcmVmTW9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://allphly.com",
      "title": "PHLY Sports"
    }
  },
  {
    "title": "Player Grades: Lakers vs. Nets - Silver Screen and Roll",
    "description": "Player Grades: Lakers vs. Nets  Silver Screen and RollAustin Reaves nets 15 off bench in return as Lakers top Nets  ESPNLos Angeles Lakers vs. Brooklyn Nets Live Score and Stats - February 3, 2026 Gametracker  CBS SportsAustin Reaves returns from calf injury to play for first time since Christmas as Lakers beat Nets  Yahoo SportsNets receive royal LeBron James Lakers beating in possible New York finale  New York Post",
    "published date": "Wed, 04 Feb 2026 04:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOR3p1VVNyWHZxVWRrNGdfbzN4d0M4NmRaelFwbWFNU3NYUHAtZlEydzMxRmtMN1l5QlpqaUNpTF9SaXhYLTd2MHZYRWs2c0loZks3cFZOQ2hHTk1LSDlrZWNNMXY1UXJkbUx1LURYWDlaZEhvVlFZa1JtZ1lIaGhPNlA5Z1dMaXdpbmhOc1E0N2M2d2oxamgwc09ET3ZSZWlxVGpnLVptNUJ0SEJ6UFVVS3dwUEt1dGtjMFdacm5WUHJIUl9yWlBEeFcxaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.silverscreenandroll.com",
      "title": "Silver Screen and Roll"
    }
  },
  {
    "title": "4 takeaways as Celtics beat Mavericks with new-look lineup after trade - MassLive",
    "description": "4 takeaways as Celtics beat Mavericks with new-look lineup after trade  MassLiveCeltics-Mavs recap: Brown, Pritchard lead C's to third straight win  NBC Sports BostonJaylen Brown and Cooper Flagg's duel highlights Tuesday night  NBA10 takeaways from a night of control and execution in Dallas  CelticsBlogStats Rundown: 2 numbers as the Mavericks lose 110-100 to Boston  Mavs Moneyball",
    "published date": "Wed, 04 Feb 2026 03:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQZ1ktS2hDTzl3M2pQSXdRQWhsc3VlNjhjMzU4U0JDUDQzcjRBeV9zT01NejU5NGtIYUxkSXdxQTBFMlR3OUFabjAzV3dOY2owUjNlbHA3d2ZDcHNZMmRUZTQyWW1qYVRqc3k0blVCQ1FKX1BPQ3lJS1pDZWstblVSczdCbjFod3h3SXppV3hzZHBtZHBLeG4zTnFTZVJLc1FBQUpMbWVnMG11YjAzSS1xWjZGZVFMMHPSAcsBQVVfeXFMT0p2SXk0M0tlZFREeXdQc0hWdy0zVXktaEpPVWRrOG9oMXZucks0dFg3dnhSMnVGZlFHTkNOLUhhQzVsenNpZ0kwYnNmcGw5cDJlZmxxR3dlQUdsQ045ZFAwZWRfZkpLbTlBQWZQd0JpdmpkaVNWSXZZNk1maFQ4WEUzdW43akk3aHVJeFV6YzdkQjdTSTBnX0Fqd09LRVBXYlgydjZQSnRodkZpbGlXV0w2VXZyaTBJV1Nxa3A2QW5BU05COV9uSng1WWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive"
    }
  },
  {
    "title": "The 60 Greatest Moments in Super Bowl History - Sports Illustrated",
    "description": "The 60 Greatest Moments in Super Bowl History  Sports IllustratedRanking 60 greatest players in Super Bowl history: Patriots coach Mike Vrabel makes list  USA TodaySuper Bowl 60th anniversary all-time team: Tom Brady, Lawrence Taylor and others headline star-studded team  CBS SportsSuper Bowl on NBC4: 10 of the most memorable moments  Yahoo SportsJerry Rice, Richard Dent, Jacoby Jones: Ranking HBCU's Super Bowl Stars  HBCU Sports",
    "published date": "Wed, 04 Feb 2026 13:00:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNejl0ZVNQdFhiWFVDZW94MlFSSTQ3OHNuNEV5aDhhQ0dMOEk3UFVtRU96RUhEd2pFT1F6dzlfZlRsQmJvUlhaVjhiRk1DVjNCNW9lOWdoYjN3ZC1RM3gySklDT3lkeW82OHBoNl8wMUlKcHZQTjY2NnNVQ1dNUHZITW95THZZd1BaekE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Super Bowl LX: DVOA Preview - FTN (For The Numbers)",
    "description": "Super Bowl LX: DVOA Preview  FTN (For The Numbers)Prisco's pick for Seahawks vs. Patriots in Super Bowl 2026: Stout Seattle defense shuts down New England  CBS SportsRanking the 9 Greatest Defenses in Super Bowl History  FOX SportsThe Seahawks’ defense got them to the Super Bowl. This is why they’re so good  SB NationWhere Would The 2025 Seahawks Defense Rank In Super Bowl History?  College Sports Network",
    "published date": "Wed, 04 Feb 2026 15:15:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1GaHZuaVNtcDYwNUc2X0xobE1KbjRDUjJVX0JTRUNWbG9fWTRWcmVsNkNLdVVLMVQyNUxYTXM1cUZyRmtPWGE2ckl0MVE3NjJXbkxieDFiVGpZMkFtX1BmaWdUSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ftnfantasy.com",
      "title": "FTN (For The Numbers)"
    }
  },
  {
    "title": "Team USA Olympians to watch at 2026 Winter Olympics - CBS News",
    "description": "Team USA Olympians to watch at 2026 Winter Olympics  CBS NewsHere are the 82 athletes with ties to Utah at the 2026 Winter Olympics  KSL.comMeet the Oregon skiers and snowboarders headed to the 2026 Winter Olympics  OregonLive.comColorado is sending more athletes to the Milan Cortina Winter Olympics than any other state  The Colorado SunTen athletes from Team USA to watch at the Milano Cortina Winter Olympics  The Guardian",
    "published date": "Wed, 04 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE41VUFVZ1ZPcjBfY3l0RmNSSmhUc2ZjeUp3SE5mUkI0SlJmcVBHVjFBMFlyX1NLUEN2WU5Rc2dVbzhIOC12MmI3TjlvLVFxTDItYUEyZzlOWW9jOXlFNmxzbEo2aFpQMW04UWcxX0NGal9DMU9EQlhB0gF8QVVfeXFMUDl2MG5DRzdpcXNPS2FCTWpxQ2VrYmt5LVZ6WVdvd1cxd2pseHp0RURVZTViU3Z3dlktVGNhT1JvQUdRM3FUVzJWcjR2Zi0xQ2huMEZkZnYwYmRSeEJSYm9jRmwxNHJPU181WWVWamU3WUVOc3I1c3licUhlUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Report: Floyd Mayweather sues Showtime, exec to recover $340 million - The Ring Magazine",
    "description": "Report: Floyd Mayweather sues Showtime, exec to recover $340 million  The Ring MagazineFloyd Mayweather Jr. sues Showtime; owed 'at least' $340M  ESPNFloyd Mayweather Jr. Files $340 Million Lawsuit Against Showtime Networks Over Earnings  The Hollywood ReporterFloyd Mayweather sues Showtime Sports for $340 million amid explosive claims of misappropriation  Yahoo SportsPower Jab! Floyd Mayweather Jr Sues Showtime For $340M, Boxer Claims “Elaborate Scheme Of Financial Fraud” By Channel, Exec & Ex-Aide  Deadline",
    "published date": "Wed, 04 Feb 2026 08:21:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNdlp0UjRhRXB2N2w0TlpWRXFRVzZqYVFvVUVpYmlTQnZYR1pJZ2hwc0F4aVBOOVR4SFBUZ1N6WTNwTVlnTG9Fc3FueXM4dGlxOV9pWFRNYjFkN1RXcldkOVdUUWpCY1RLeDVxdnFySmpvUExodjhGaHlRUXV4SzYtMjNTbElhQjlxVWZJcXBsV3pSRlFvUHV1dno1VUVSSXVOenVldk5EUjh4NXhJZkRvWDRXU0k5X3A4QmxkV0xodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringmagazine.com",
      "title": "The Ring Magazine"
    }
  }
]