[
  {
    "title": "NBA All-Star Game’s USA vs. World Format Brings Back Real Intensity - Sports Illustrated",
    "description": "NBA All-Star Game’s USA vs. World Format Brings Back Real Intensity  Sports IllustratedWhy did new NBA All-Star Game format work? Victor Wembanyama 'sets tone' and players 'step up'  CBS SportsWembanyama vows to bring competitiveness to All-Star Game  ESPNWemby Saves the All-Star Game. Plus, Tanking Reform Gets Serious | Group Chat  The RingerIn reviving the All-Star Game, Victor Wembanyama furthers his case as NBA’s next face  The New York Times",
    "published date": "Mon, 16 Feb 2026 03:02:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOZTU1UjRDVUJ6MDhMQUUtZzdKM3pOM1lMZnhjaExwd2ZtR05FVlplQ09zcWhfcTczdE1DSGdZU1hJS0R2Wmw2cXQ5bjBNWG93TVlGS2Z0QUhlLUpHMGMyMzhqcFBzM2oxZUdiVFBXaDJtQnJ5MVlTU3duc0VsampaOWsxRnpITFlVY2MwZ3BMZDhyVE1rOUM1RV9UZ3ZXU0VTUnp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Kansas State AD says Jerome Tang fired for cause after coach’s harsh criticism of players - The New York Times",
    "description": "Kansas State AD says Jerome Tang fired for cause after coach’s harsh criticism of players  The New York TimesKansas State coaching candidates: Josh Schertz, Jerrod Calhoun headline top replacements for Jerome Tang  CBS SportsKansas State basketball coach candidates after Jerome Tang firing  The Topeka Capital-JournalJerome Tang left K-State with no other option — and not because of the results  Kansas City StarCollege basketball coach fired days after rant ripping players  Cleveland.com",
    "published date": "Mon, 16 Feb 2026 15:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPRnVjdzk4SF81bzdLdlduWkYzMVZJWkc3eVhidWZrUnZjdTdBRkpDS0s2bS1PQ1ZuUjMzbEYxaHk2R1hNdi1yc1NCYmw5SW9Qc2xQcl8zSUxIX1gteEYyYmlPcXd2cTRicjZyZnJteTRGY0l2YUU0QmozYVA5NUpKZUlGdEpjaFlkLTQ4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Winter Olympics Day 11 primer: US women’s hockey faces Sweden in the semifinals - The Boston Globe",
    "description": "Winter Olympics Day 11 primer: US women’s hockey faces Sweden in the semifinals  The Boston GlobeTeam USA takes 1-0 lead against Sweden with ticket to women’s ice hockey final on the line  CNNWinter Olympics 2026: USA v Sweden women’s ice hockey, GB men hit by curling blow, Meillard wins men’s slalom – live  The GuardianUSA's Abbey Murphy at center of chippy Olympic hockey win vs. Italy  ESPN2026 Winter Olympics live updates: U.S. women in hockey semifinals; Americans compete for pair skating medals  NBC News",
    "published date": "Mon, 16 Feb 2026 05:16:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPb1R2WlRVcW1ZQ1RINC02V3JZSko2YVdGOEhEYVZXTmhVUEppNFlIaU1jVEY2a3h1SjltU2VaZjhUUVJfS0hQS0R0b1J2UEpobjhpeVFBYXVvb3hHUzFPZ012TXh3dHl6RUJJVFdHMHlFVm04MDA4V0Q3d1BqS3N6ZGd4QWNQdTRTMFk3SHM5SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bostonglobe.com",
      "title": "The Boston Globe"
    }
  },
  {
    "title": "Swearing, illicit filming & rule changes - what next in curling cheating row? - BBC",
    "description": "Swearing, illicit filming & rule changes - what next in curling cheating row?  BBCAs Olympic curling surveillance grows, Britain faces infraction  ESPNWill curling ever be the same after the swearing, allegations and rule flip-flops at the 2026 Olympics?  National PostOlympic curling controversy explained: Sweden accuses Canada of cheating  USA TodayCanadian Olympic curler called for same violation that ignited controversy on men's side  Fox News",
    "published date": "Mon, 16 Feb 2026 10:38:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE5EVWczb1pGTVlKT0taWmZLNDg2d0lEeEpWc1A3TFJoMm9CbHdQVGRhd0Z4WXJkb0F4YTRieWY2cFhEZUVrb1gtNXNMYUVmUXFkQzVoWVBJS0MtYVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Michael Jordan, six-time NBA champion, is now a Daytona 500 winner - NPR",
    "description": "Michael Jordan, six-time NBA champion, is now a Daytona 500 winner  NPRDaytona 500: Tyler Reddick wins Nascar's biggest race for NBA legend Michael Jordan  BBCTyler Reddick lifts Michael Jordan’s 23XI Racing to Daytona 500 win  The New York TimesChase Elliott falls short of first Daytona 500 win after leading on final lap  NASCAR.comTyler Reddick wins Daytona 500 with late pass in crash-filled last lap  Yahoo Sports",
    "published date": "Mon, 16 Feb 2026 09:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbG9vUDNzSGh4azRJUV9sekpmTXZScDVPWm9CS2wwbjJlNG84ZXJzUVZwZHJHdVlySVROY2JndjRCRy1uSHBGVjhxdzBxczJPM0xiT2hoem5vb1R0cHp1cmszTFdoT2JQVTNZTmhTYWhUMm5PdTllOVNTS25FNnJ4VDdRTU91Smc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Dana White confirms UFC White House card is complete but refuses to announce fights: 'So expensive' - Bloody Elbow",
    "description": "Dana White confirms UFC White House card is complete but refuses to announce fights: 'So expensive'  Bloody ElbowMatt Brown claims the UFC is using Conor McGregor to bait fans for White House event  Bloody ElbowDana White confirms UFC White House card is set, but then claims he must discuss it with officials  hitc.comBuilding A Dream UFC White House Card  Stadium RantDana White says White House boxing card already built  Boxing News 24",
    "published date": "Mon, 16 Feb 2026 04:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPMzVHNGhrMUp5aEdHWHBTcXluSWszUkZpcFN4R1FGMGN3WE1HaXhsUl9keGRYZVc2UXNnS1pMYnhBaTItNUw2bHJxSmZWdlN4dUhhVERaMVdsbDc1LWlrcmNPS1FwRktfblo0QVVFcS1kMTg3bjNPMUlEbmNWUF9Ud2Z2Sk5uZlQyMktnN3lHLVF1eTd1SFFHZGJBWjJ4eW9OMlZxbVJlU09CeTRVSFAydkpELXJFTmVFRXQzV2Rrd2ZwbF9MYTl5MFc3eVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bloodyelbow.com",
      "title": "Bloody Elbow"
    }
  },
  {
    "title": "Kevin Durant Accused of Having a New Burner Account After Shocking Group Chats Get Leaked - Yahoo Sports",
    "description": "Kevin Durant Accused of Having a New Burner Account After Shocking Group Chats Get Leaked  Yahoo SportsRockets’ Kevin Durant alleged to have burner account trashing teammates, but nothing is confirmed  Yahoo SportsKevin Durant allegedly trash talked teammates in group chats using burner account; ‘can’t trust Jabari…’  Hindustan TimesLeaked Kevin Durant messages target Rockets teammates including Alperen Sengun  Türkiye TodayThe alleged messages from Kevin Durant against Stephen Curry put him in a delicate situation  MARCA",
    "published date": "Mon, 16 Feb 2026 03:24:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZEI1aW1nY1U4b2c2ZTVTTWdLWlRHV0ZXYnc5SnRDYUlGN3EtcjFsa0RIWFhUV09PeWF0UllzdmRVTEJpYnp3eGZHNzRkcjN5cUhoWjZqS1BhUXVRQloyRHFDOEV1WHRENzNZb3dobjlraTgzeXRiaHBmMmppSEo1TktDYlIxYVlxNXB3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Ilia Malinin to compete at 2026 World Championships, agent confirms - NBC Olympics",
    "description": "Ilia Malinin to compete at 2026 World Championships, agent confirms  NBC OlympicsIlia Malinin hints at 'inevitable crash' amid Olympic pressure  ESPNIlia Malinin writes about ‘inevitable crash’ after Olympic figure-skating shock  The GuardianHow Ilia Malinin’s shocking night to forget at the Olympics unfolded  The New York TimesIlia Malinin postpones press conference a day after eighth-place Olympic finish  Fox News",
    "published date": "Sun, 15 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQbXFwSGg3NVRrMWRrcWJrejZBblRWQ1pYRjdrbjNxaEZ2dDBJeHVlaHZ6WE5zVWpRU25MR2tRN0VhSlJnTk0xNFJpRXRVa1FFcGtfVWlzZ3dwaUZONEhKQnIzRE04RXZSMkNNTmtSR1kwbHVWdkZpbkppdUNfVGFScGNIMWZPRmpGbDFuQ1BodWpuX0FnVllybg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Video highlights: Mikaela Shiffrin, skeleton and Olympic records Sunday at Milan Cortina 2026 - WESH",
    "description": "Video highlights: Mikaela Shiffrin, skeleton and Olympic records Sunday at Milan Cortina 2026  WESH2026 Winter Olympics: Best moments from Sunday in Milan Cortina  ESPN2026 Olympics, Day 9 recap: Shiffrin falters again, USA men claim No. 2 seed in hockey  The New York TimesOlympics news, live updates: Team USA women's hockey takes on undefeated Sweden, Elana Meyers Taylor aims for monobob podium  Yahoo SportsMikaela Shiffrin lines up third for Olympic giant slalom run  USA Today",
    "published date": "Mon, 16 Feb 2026 01:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPQ3g0S1dkdHdvQzk5NVVQMUxKakR0M3B4SWN4VEU4YUVBbFZBR2pra25nZF9WYzZmMWpTZ1BvN2xERmNEQXlvdE9lOE5ueGxLcWZZUFJGWkMyU1lMOVpUa0oxTnpmajNYSjd5RzgyNHhScVZrQnFja2ktTEdVQUFuOTBWenpDRjRkREIw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wesh.com",
      "title": "WESH"
    }
  },
  {
    "title": "2026 Winter Olympics medal count, standings entering February 15 - The Big Lead",
    "description": "2026 Winter Olympics medal count, standings entering February 15  The Big LeadWho leads the medal count at the 2026 Winter Olympics?  NBC OlympicsMilan-Cortina Olympics: Who Leads the Medal Count?  The New York Times2026 Winter Olympics: Meet the medalists from the United States  Chicago TribuneSee how many Olympic medals each country has as of Feb. 16, 2026  IndyStar",
    "published date": "Sun, 15 Feb 2026 14:29:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPQXhDTVNzM1JCT1MzaV9QQXIxN3NHSmN6WlJwYW5BNl9JeE5LeWg2MkxGU2lqek9mQTUxN3RxVE90cDR1STUweGpyNFViaDhLR2wyVEEyY1dicG56QzN2bGt6RHRJZ3M2QXlQU1hobXdYdzlwdUNuZFFMLW5NOUN0SGFjZkg2NTRsZU96bl81aTdCSFhyUXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebiglead.com",
      "title": "The Big Lead"
    }
  },
  {
    "title": "Former NFL All-Pro lineman Tre' Johnson dies at 54 while on family vacation - NBC News",
    "description": "Former NFL All-Pro lineman Tre' Johnson dies at 54 while on family vacation  NBC NewsTre' Johnson, the former Washington O-lineman, dies at 54  ESPNFormer Washington football offensive guard Tre Johnson dies at 54  NBC4 WashingtonFormer NFL offensive lineman Tre’ Johnson dies at 54  NBC SportsTre' Johnson, former Washington Commanders All-Pro, dies at 54  ABC7 Los Angeles",
    "published date": "Mon, 16 Feb 2026 10:42:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1yb2FrUmxfRHdNeDhGTE9KdzBjWEdlMlFiOVQzZXNIMXdBSEJWckhQVjZabVI0eC1FSS1hM2Z1M3RUSElkeTRWaE9oUTNwVVJ5RjFaTnNUc1dvODI5d2IyZW9qOXRFbE5xNVdBV1JZbzZiaXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Anthony Edwards claims MVP award, leads Stars to tourney win in an entertaining NBA All-Star Game - AP News",
    "description": "Anthony Edwards claims MVP award, leads Stars to tourney win in an entertaining NBA All-Star Game  AP NewsTeam Stars prevails in competitive debut for new All-Star Game  ESPNNBA All-Star Game 2026: Youth prevails in all-U.S. final as Team Stars wins in thrilling USA vs. World format  Yahoo SportsDonovan Mitchell and Team Stripes run out of gas in All-Star Game finale  Cleveland.comRadically revamped NBA All-Star Game brings return of defense and competition  NBC News",
    "published date": "Mon, 16 Feb 2026 02:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOXNRLWk3d2FpcWcxTlcyU0FqUVB6N1NBbkl1RHBvSnZpTThPM2xDQkRPLTE3ZUdYakRlM21JNmlNdkVQYzQySGdsbjNNallVS2dxRExRQlFscWdfcEIzMFVWYktZNzc0NjBWay1fQ0taX1dLeElmS1E5UDNIckN1NEtnZWFrSnVJdDZldw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Thompson scores again in win over Germany - Audacy",
    "description": "Thompson scores again in win over Germany  AudacyU.S. men's hockey stays unbeaten at Olympics; knockout round next  ESPNUSMNT star Christian Pulisic attends USA-Germany Olympic hockey game  USA TodayUnited States ready to take on Germany in preliminary round finale  NHL.comFebruary 15, 2026 - Winter Olympics updates  CNN",
    "published date": "Mon, 16 Feb 2026 01:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNaGswX0hpWmR0WXZPV2lVU1VFWEljWm9UUDkyalA2ZXA2ODdLSEI0bmNXb0p1VTdHRk5WY29CVjN0RW5ObDFhR3J2d1dFMjdGODlxeHdTejVCUFhsRUd0aVJKdFhCMkgxbzM1NjRieWhSZzVYckxpeEplLXlfUUhLMkhBNXc0aUxNc1JjMnhn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.audacy.com",
      "title": "Audacy"
    }
  },
  {
    "title": "Padres Sign A.J. Preller To Multi-Year Extension - MLB Trade Rumors",
    "description": "Padres Sign A.J. Preller To Multi-Year Extension  MLB Trade RumorsA.J. Preller agrees to multiyear extension with Padres  ESPNPadres reward GM Preller with multiyear contract extension  MLB.comTom Krasovic: Prudent move is for Padres to stick with A.J. Preller for the short, long term  San Diego Union-TribunePadres extend contract of GM A.J. Preller, who has 2nd-longest tenure behind Yanks' Brian Cashman  FOX Sports",
    "published date": "Mon, 16 Feb 2026 14:40:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOVkUyazJxc3p3Q0RjaDJGUDFMdXFGZEFWLVgyXzdmT1UyQmpsN3JBcGtkSzlubUF0NHRiVmR5SkFMSF9ueXo4cjRyS0FVcXVEb0RycWdST0RRRU5QSDZQaUNHbTNmMzVmYXFYeGsyQmplaW1rc2VaSThteG02a0VtaThMcWZkQXFyUXNSZlg1WUNQYk1zQ0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Player Grades: Mirkovic stars, Boswell makes big impact in return to lead Illini past Indiana - 247Sports",
    "description": "Player Grades: Mirkovic stars, Boswell makes big impact in return to lead Illini past Indiana  247SportsIllinois 71-51 Indiana (Feb 15, 2026) Game Recap  ESPN#8 Illini Welcome Indiana for Stripe State Farm Center Matchup - University of Illinois Athletics  University of Illinois AthleticsDoyel: Has IU coach Darian DeVries overachieved with this small, slow, streaky roster?  IndyStarBoswell's return as impactful as expected  The News-Gazette",
    "published date": "Mon, 16 Feb 2026 01:07:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPOGNMVmx0alN4eWVma1RSV2tpMHl4anpIcjZTM29MSHRuOUJMN0pBbHF1NjBRU1ktcU9MQ0I2LWpoYVpJSHNfa3dOTVdPbElWUEVVTXlOTGNNYi0tSUlJelNpQXhUTnZyTVJTV1FoNTM3YzR3cDV5MG8yVlluQzlSdFJKd2plYkk2QUJyVTF5WUJxSmNHWVFtRVZqS3ozVV92ODhzTVdpWGxmek1UX0dQdUZOdTVOR2lYdllxLUxHcV9qNGh2alk1cUxLVUw1RWNLUzVleENhSEdlOGluZ1lvT3oxc1gwQUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://247sports.com",
      "title": "247Sports"
    }
  },
  {
    "title": "‘King Klaebo’ crowned Winter Olympics royalty with nine gold medals as Norway wins relay - NBC Olympics",
    "description": "‘King Klaebo’ crowned Winter Olympics royalty with nine gold medals as Norway wins relay  NBC OlympicsJohannes Hoesflot Klaebo wins 9th Olympic gold in cross-country skiing  ESPNFrom the sports desk: The new Winter Olympics king  NBC NewsJohannes Høsflot Klæbo sets Winter Olympic gold record as Norway wins cross-country relay  The New York TimesKlæbo leads Norway to relay win and claims record ninth Winter Olympics gold  The Guardian",
    "published date": "Sun, 15 Feb 2026 12:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdGdwTU1Qd1N0OTl2MU0xZ0c3QlBralpqWEY1TzhrYWtYSGtncE1ZYkh3bWhTTmxPeGZFMklwRWFtazctSlVRS05qSW9VN2dJbGg4SVEwTE9wb3I4azJ4NFc5RUdJMTlyalZDWFBFaWMyOTZrNlF6bmR1N001clpBQlRNVUdyOUhTQWUtdWNVV3RpTEloRFVxWFJLQ0Rza0dyLVotaXFhanZQampWVkFSRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Column | With a broken body, Federica Brignone’s Olympic message: Just show up. - The Washington Post",
    "description": "Column | With a broken body, Federica Brignone’s Olympic message: Just show up.  The Washington PostFederica Brignone wins giant slalom for second Olympic gold in stunning comeback - The Athletic  The New York TimesFederica Brignone, Mikaela Shiffrin and the power of not thinking at the Winter Olympics  CNNFederica Brignone sparks Italian joy with second gold as Mikaela Shiffrin struggles  The GuardianWinter Olympics recap: Brignone’s double gold after broken leg, Klaebo sets a medal record  AP News",
    "published date": "Mon, 16 Feb 2026 01:27:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQOHlwMTk1QTBScXJyNHQ5OE5oZk1xdmVQTV85bGZVNmZ0NnM4ZWFzZ3dBcGFSNzM4R096djZuNFhKRFpidUIxVXMzWnRpUmNYcmpENFh3NVpjQ2JOel96WUdZSjhrY0E2OVhwenBrcG9kRTg5Z3dnNDFrZVczMFBUSjlwNjJUR1JYLUFMR3FPRUVKaUtVVHR6ZVNBSVFtaGxtUFhKYU5ibw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "LeBron James Discusses Past, Lakers’ Present, Future - Hoops Rumors",
    "description": "LeBron James Discusses Past, Lakers’ Present, Future  Hoops RumorsLeBron James says he's still unsure if he'll play in 24th season  ESPNLeBron James dodges retirement questions as he made record 22nd All-Star Game appearance  Fox NewsOrioles trade for Twins RHP Jackson Kowar  WBFFEverything LeBron James Said About Lakers, NBA Retirement and More at Historic All-Star Weekend  Bleacher Report",
    "published date": "Mon, 16 Feb 2026 03:00:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPYnZjZ20td19ZT0E5ZGJEenFyUWROMGlpNmNtR0V2ZTF4SVhjSEFvQmpYVGljSTA3UzNBQnlvSVRSVW05TTBNRkQ1eV9aQXlFMjZ5aW1EYWJZQlduMWptRjFTeUZrUjUzUjFJT0ROU2Rfc2NGTi04alZVb1VUUFM5SkhEVGg5N2lUYzhKay1TZUVrbWEzeHVTQ2tn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hoopsrumors.com",
      "title": "Hoops Rumors"
    }
  },
  {
    "title": "Scottie Scheffler Caps Off Unconscious Final Round At Pebble Beach With Picture-Perfect Eagle - OutKick",
    "description": "Scottie Scheffler Caps Off Unconscious Final Round At Pebble Beach With Picture-Perfect Eagle  OutKickScottie Scheffler falls just short after scorching 63 Sunday at AT&T Pebble Beach Pro-Am  PGA TourScottie Scheffler reveals the two shots he wishes he could replay from Sunday at Pebble Beach  Yahoo SportsAT&T Pebble Beach Pro-Am: Collin Morikawa edges PGA Tour thriller after Scottie Scheffler, Rory McIlroy produce big finishes  Sky SportsScottie Scheffler's incredible 3-eagle round at Pebble Beach nearly steals title  Golfweek",
    "published date": "Sun, 15 Feb 2026 22:10:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNdldhdXlGTGR5RUJJbUtEbkFoZk14ZFhOYUJrMzAyQ1hySU9GbEZaSHltdnc3dUZuaW5kSUhoam1kX2ozX3ljZTlTN2RvalYxV2h1VkVyZWJWVzQzRXlvak8tSDl4VU5OMXZRMy11XzRJbFRuQ29nbktHcktBa25rdVlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.outkick.com",
      "title": "OutKick"
    }
  },
  {
    "title": "Crosby, McDavid lead Canada into Olympic hockey quarterfinals - ESPN",
    "description": "Crosby, McDavid lead Canada into Olympic hockey quarterfinals  ESPNCelebrini becomes 1st NHL player to score on penalty shot at Olympics in Canada win  NHL.comCrosby sets record, Wilson drops the gloves as Canada thumps France at Olympics  CBCPenguins captain Sidney Crosby sets record for most points by a Canadian at the Olympics  CBS NewsCanada torches France to complete perfect group stage  NBC Olympics",
    "published date": "Sun, 15 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUXVJMV9FUzB4bmVvYkM4QUVpNWR5MC1EX2pUbTRET3BHZHFZb3c3cHY0VDJjdm0wZXRWam9wUmVGaTN4WUIyU2FadkJkb0ctMkNJYmxTNWxEVjVKQ2owdDhVcy1ES0hSV1pFM0FXTmJVUVI2YXFoREhRLWY2SlJJQldFZ2pTWU5QeFhRaVJ3UkFHWDBidTlfLVpKTWJESjB3RnVfb3VxaVEzS0ZjZFc0Rjh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "American Mac Forehand fronts absolute bonkers qualifying round in freeski big air - NBC Olympics",
    "description": "American Mac Forehand fronts absolute bonkers qualifying round in freeski big air  NBC OlympicsDual moguls makes its Olympic debut: ‘It’s dramatic, it’s chaotic, it’s unpredictable’  The New York TimesMoguls 101: Understanding Moguls and Dual Moguls  FISDual moguls to debut at the Winter Olympics. Here’s how it will work  9NewsWinter Olympics 2026 | Men's Big Air Qualifying | Results & Recap  Newschoolers.com",
    "published date": "Sun, 15 Feb 2026 21:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNTWdKNmNaLUxCbF92R0w1VjY2Y1pjamNHSldwUi1PRXctaTYyX2lkWFd1SWIwR1RnU3IwcDdWNGxSVm5QbXdzYjdyaFIycFNTRnRUOU02Uk5rZ3lnWmRPMTNpMXRkcUlmWnF0UC1yLXdCZElTMW56bVJ6MW50VGhVX19Bb3FycUlKM2NrWUR4alprR05qU3lYaW5fUWZtcm9rYmdjcmJ6eVhubkRWZlpBYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Seahawks going to the 49ers for new OC; Seattle’s QB coach going to Raiders - Tacoma News Tribune",
    "description": "Seahawks going to the 49ers for new OC; Seattle’s QB coach going to Raiders  Tacoma News TribuneSources: Seahawks expected to hire 49ers' Brian Fleury as OC  ESPNSeahawks hiring 49ers tight ends coach Brian Fleury as offensive coordinator  NFL.comGeorge Kittle shares one-word reaction to Brian Fleury reportedly leaving 49ers  NBC Sports Bay Area & CaliforniaSeahawks hire new offensive coordinator  The Seattle Times",
    "published date": "Mon, 16 Feb 2026 01:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZ0FydE0zVzVWNVEtT3AydWctcmdJTzRLYUk5M21NQ2UzT0Yyb3RheWJNZmpHMFpVVC1fMUhub2lCbVBOdkd1OXBZamJMYXdMVHRkTEhUVm1wcXhNWjhYTHNvRFY0OTVtRnd0TnNkblo5Wm9sZHhiQndJcGgzQ0Q0dlFya3ozMDjSAYcBQVVfeXFMTVlEREU2WVJ5VEs1ZF9mVTBYVU1xenYzVDdjb1VybU9tbmtzRFJZQk5YdC1UMlRjNGZhemdRNWdUV0VlUm1IdF9ncWhLa2JKUTk4UHllajFrdTNEN24xTm9jN2ljOVBqNjlVVHRNZ2dJbVotY1lpdGJ3bDdIR0hudTk5VUgyd3Fv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thenewstribune.com",
      "title": "Tacoma News Tribune"
    }
  },
  {
    "title": "The only way to \"align incentives\" for NBA, NFL teams is to remove the incentive to tank - NBC Sports",
    "description": "The only way to \"align incentives\" for NBA, NFL teams is to remove the incentive to tank  NBC SportsAdam Silver considering all remedies for rampant tanking in NBA  ESPNNBA's marquee event now all about the league's issues  Yahoo SportsNBA commissioner Adam Silver touches on variety of topics at All-Star Saturday  NBANBA's effort to stop tanking is 'not working,' Adam Silver says  NBC News",
    "published date": "Sun, 15 Feb 2026 18:00:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNZGNHMFM2SXNFQ3RiU3NKUk9KQWlPSENvQXQ5U3ZoVlAzNGhIVVh2cXFwNUx5NTZJQjVXWFdvWmFaVU1xQS1ya2Nmd0F5dE4ySEdEMlVDMmN4bmcwOWFrbmFlM2l5VGs2RFVjaHJOOFEzeEhWNXJMYUtBV2x1UjJGbm8yZ0UtMlFLSUxjWi1GUVRtSHFtVlBlR09ESzNwMnJxbTRzdVJfQXBERUxCS1EtMFVsaHVBNUllVV8yR2d0dU84UVc2Q1N2Wm1sMnVHX0J0WG1mN0NkNXdRUUstQVRZYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Jordan Stolz calmly looks ahead to trying to win a 3rd Olympic speedskating gold - AP News",
    "description": "Jordan Stolz calmly looks ahead to trying to win a 3rd Olympic speedskating gold  AP NewsAmerican Jordan Stolz wins 2nd speedskating gold at Olympics  ESPNSome of Olympian Jordan Stolz’s biggest fans wear orange | Lori Nickel  Milwaukee Journal SentinelJordan Stolz sets 500m Olympic record, wins 2nd gold medal  NBC OlympicsOlympics news, live updates: Jordan Stolz wins second gold and breaks Olympic record, Team USA takes on Denmark  Yahoo Sports",
    "published date": "Sun, 15 Feb 2026 13:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPV2h2cUc2WlhEUnRMM3dicGVSTG5lWXlwenpCMFFRa1ZWWk9XakZRamdYWENyWlNzWER4SGVvM0dQaFFOdUtPRmhmWnJPenVzM0VkYlpySmdDeFBtVERPcmpqNnZsajlTaUtCVjRyelM4TVBmdHdicE45VlZQcFBBbWRkb3NTVjZJbm8tRWI5R1lISE9uMXlzZmdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "2026 Milano Cortina Olympics qualification playoff games preview - NHL.com",
    "description": "2026 Milano Cortina Olympics qualification playoff games preview  NHL.comWhen does the USA men's hockey team play next? What to know for Olympic quarterfinals  NBC10 PhiladelphiaWhy the U.S., Canada or Sweden could be eliminated early from Olympic men’s hockey  The New York TimesWhat you need to know about the men's Olympic hockey bracket  SportsnetMen’s ice hockey at Winter Olympics 2026: Canada, USA, Switzerland, and Denmark end group play in the winner’s circle – daily highlights, all games & results  olympics.com",
    "published date": "Mon, 16 Feb 2026 00:34:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQYVR3ZV9VQmRZMURCV3RiV1I4TUdBNmE0Y1hJVjA3cDRGQzRnQl8tcGZFQlQ3aXFzSklRNHo3ZXgzYk1wZ0VTMlZIVEJnV3dXQWpBS24wRk9QeEtvQnFveGswM2U3Nm9IekRDY2FNZnp6MXNUbXgxdG9PV3p1LU9aVHpHZ2ZJMUNSOXplZ0NRdlBmZ3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Providence College Response To The Suspension Of Duncan Powell - Providence College Athletics",
    "description": "Providence College Response To The Suspension Of Duncan Powell  Providence College AthleticsBIG EAST Announces Additional Penalties from St. John's-Providence Game  Big East ConferenceTempers flare, six players ejected in St. John's-Providence clash  ESPNFight breaks out during Providence College basketball game  WJARProvidence basketball brawls but falls to St. John's in Big East play  The Providence Journal",
    "published date": "Mon, 16 Feb 2026 01:09:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaFVaNll1SXZLRTBud1JsOUw4MmVSLWV5VktGTTR5czlDN3BxMGNvUlR1c2ZOWWJfQmZNZ1kwWThxeGlObjBxa2llTjN6UEtSdm9GYm56LWlqY2hOQXUtWEpFT3dqc1RUa0gtZWxVWkxiTUJyWThZY3FqWXpFZnFIaWFSclV5a0dHc0pMY2RpRzFaemRTbWVKLTJnYW5pNFN2M2pQblVja3pXTmxKbkoyT29n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://friars.com",
      "title": "Providence College Athletics"
    }
  },
  {
    "title": "Winter Olympian’s gold medal hopes dashed as he’s disqualified over size of his ski boots - New York Post",
    "description": "Winter Olympian’s gold medal hopes dashed as he’s disqualified over size of his ski boots  New York PostOlympic ski jumper disqualified from event over boot size  Fox News'Extremely stupid' - ski jumper disqualified over boots  BBCBelshaw jumps for final time in Olympic games  Steamboat PilotAmerican Ski Jumper Disqualified from Olympic Final Due to One-Centimeter Equipment Issue  People.com",
    "published date": "Mon, 16 Feb 2026 08:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPYWd4NE9PUXVBYktpRWJ1UHpNWnJENW9lamhwam9oek41aDdxRFI2dDVOMW5KQTk3MlVBQURwVzNBOTVZdW9xbWNEN0F5SjJ1SXRHR09laHl2SFhVS2tfS3ZwRzF4LWpmN19KUG9kOFE2QlhYd1dmcHcwT1FMVFk1UWRuU0s1c0RPMnZ4YlVIc2xkMG5namZlSlJKRi1nVmVPeHpwTk9qdmJCU25FRnBudEdTXzVwWTFrVnM3QTBMamw5VUVjeHR4WXAzX2xnNjZodXdqVG8zY211QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "The IOC’s ban of a Ukrainian athlete over his helmet reveals troubling double standards - The Conversation",
    "description": "The IOC’s ban of a Ukrainian athlete over his helmet reveals troubling double standards  The ConversationWinter Olympics Photo of the Day: Disqualified for a ‘Helmet of Remembrance’  The AtlanticDisqualification of Ukraine’s Heraskevych includes dismissal of his sport by Olympic leaders  The New York TimesReactions to the banning of Vladyslav Heraskevych from the Olympics  AP NewsThe week in pictures: an Olympics helmet ban, Bondi's testimony and the start of Carnival  France 24",
    "published date": "Sun, 15 Feb 2026 12:57:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOY1V2RS0wQzlUYXFNSTdORTh0dEM1bHNiSXdHSE8xOGFIcUtzcG1rQ0dHcVFraHpVT1BwTXRQeFpybGlxSjVFVzlMYmRLTmw3WUx4dUZ6aGF3MmZJQTQ3T05OdTdlWFJBRGQwMVZMdkkwOV9VajZjakh3QUl4MDBVQzVMNWJZZlkycHBRWmI3QmxicFBJRUxoN2J1Q0NXMzNZMmpKNTVPdWtkRFh5bjRNVXhwLS1RWWF5QWJSUUln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "USA men score ‘statement’ curling upset in huge boost to medal-round push - New York Post",
    "description": "USA men score ‘statement’ curling upset in huge boost to medal-round push  New York Post'This is a pretty surreal experience': U.S. men's curling takes down defending gold medalists  NBC OlympicsA new generation of American curlers arrives on the Olympic stage  NBC News'Statement win': U.S. men's curling takes down defending gold medalists Sweden  Gulf Coast News and WeatherArdsley Curling Club’s Danny Casper Still In The Hunt in Cortina  The Hudson Independent",
    "published date": "Sun, 15 Feb 2026 23:54:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNdXlGak43VjYwaFJsenFyMkpUeFkybXd3Mlp2RnZ6eTB5UzJfN0huMktuTzZFVk12N3RtVEM2eFBLQkxjQjIzQURjZFoyR3dVTHo1MDViN3ZvMEdXWmJIZ01vb1FxdFVmMWQtOU1pS05mbTZsZDZCSUZJaC1PLVlQZFJOQjc5eDNjMzF0SFc4MXNJYWVSQm9tSEFYNWNFaGxjTndnam1yYjhUWG01MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Celtics’ Jaylen Brown criticizes police for shutting down panel during NBA All-Star Weekend - The New York Times",
    "description": "Celtics’ Jaylen Brown criticizes police for shutting down panel during NBA All-Star Weekend  The New York TimesJaylen Brown: Beverly Hills' explanation for event shutdown 'false'  ESPNJaylen Brown calls out Beverly Hills amid dispute over event shut down during All-Star weekend: ‘I’m offended’  Yahoo Sports'Targeted': Beverly Hills police shut down Jaylen Brown's private event  WCVBJaylen Brown disputes Beverly Hills' claims about his event that was shut down  CBS News",
    "published date": "Mon, 16 Feb 2026 02:43:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeGhJZXlvU3gyVmZQRkF0QnN3VGwwWkRMWTBsN1gxMUNWLTRNd2FoSDdGSjQwb2prRmtQbmdyVU9tUUNIVk9Ubk11QXFpdWRfMDA4Q3lwVlotUFlfRV9LVmhnWUdFdEplVVlCRjgyVHFMaDlxR1NaVTZ2a2NfYXY3eFU1UnBRcjJ1d1BibGVocFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "2026 Three-Round NFL Mock Draft: Jets pick Caleb Downs, Rams find Stafford's successor - PFF",
    "description": "2026 Three-Round NFL Mock Draft: Jets pick Caleb Downs, Rams find Stafford's successor  PFFDan Parr 2026 NFL mock draft 1.0: Jets trade back into Round 1 for QB; Commanders go RB  NFL.com2026 NFL mock draft: Projecting all 32 first-round picks after Seahawks' Super Bowl win  CBS Sports2026 NFL mock draft: Yates' first-round pick predictions  ESPN2026 NFL mock draft: Top 10 features Makai Lemon, run on pass rushers  USA Today",
    "published date": "Mon, 16 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNODFiMWU4U3psVl9lV1NvaG85V2VlejNCOXo3UW4tUVRXS3JDZGh3T2F1andEXzRZSnlsU1lCNlhnblpFbHN1ZWEzNmVyalNSUFFRZ19POUZHVXlJMERmZ3RkOEZjNmIxMmJ6NTVaNUlsXy13YkZPZDh1M3JvZU9ON2NfUHVwN0ktZE9RbmxzcDN5QmVZUzdITg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pff.com",
      "title": "PFF"
    }
  },
  {
    "title": "Eileen Gu Claims Unfair Treatment Because The Olympics Won't Change Its Schedule To Meet Her Needs - BroBible",
    "description": "Eileen Gu Claims Unfair Treatment Because The Olympics Won't Change Its Schedule To Meet Her Needs  BroBibleEileen Gu says her Olympic schedule is ‘really unfair’ and ‘doesn’t make sense’  The New York TimesEileen Gu jumping to defend Olympic gold in big air, an event she hasn't done in 4 years  WCVBEileen Gu, US-born Chinese Olympian, slams organizers for not rearranging events around her schedule  Yahoo SportsDefending Olympic champ Gu into big air final in freestyle skiing  ESPN",
    "published date": "Sun, 15 Feb 2026 16:29:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOaG4yT1lBSGVXeDlXRU1xaE9ZdDY2OGFlZXVxZHVDMmo1U3Vwb0JNc0JkXy03ejZ6bnQzZXFVREZ4ejRYZGwxajJDQkRsU0syM1FzRUttSjlpTmZIbW5wQWJ6S1hBUTdEbVdGV1hId0pxU3FrSnNIajNCby1HNVd1SWtPc0V5Nmpsc1J4anlnaGlJQnJSTlBZMzJabkEyYnhtUnRVWjZiQnN1aGEyRl92RDNZWUV3Vjdt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://brobible.com",
      "title": "BroBible"
    }
  },
  {
    "title": "The Science of Winning: Indiaâ€™s all-round excellence downs Pakistan.. - Greatandhra.com",
    "description": "The Science of Winning: Indiaâ€™s all-round excellence downs Pakistan..  Greatandhra.comIndia v Pakistan: How no handshake at the toss set the tone for a T20 World Cup game filled with tension - The Athletic  The New York Times'We've had enough of that': Waqar Younis brutal admission after another Pakistan defeat  Yahoo Sports'India v Pakistan becoming a political rivalry rather than sporting one'  BBC'Terrible mistake': Ashwin exposes Pakistan's big blunder vs India  Yahoo Sports",
    "published date": "Sun, 15 Feb 2026 17:14:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPTW4zMDdSNUFQVHJYcUJRem9TbHFPZ2k1cGlEZDFvTmlNRmpxOU9GWjRPS0NaanRLaVY2b0ZTNG1YQU5tNmhtRlFPMWYzaXZOSWowZExnM01HaWdkWWFYdldnalhrc1d5X2k0T3RBMjM1QzZtbVdBWkNncWR4bUlzbjRST1p4T1lrOTZzWTZEd2dDWXROOTJHRldlTjhPLTUwVlEyejNEa1owMWp3M2NXRS1mNXdraE9KMWxMMmJzbVowa0x60gGzAUFVX3lxTE91TVFzZG12WldKcV8wbGtqY1hiTWl6N2tmOE50MzFJc3c4UFNDT0l4WUpma3REZFVheEVNQVBZQmtSQi05UEktVkxudjZybGhvdlEzQnJjSVVjU0pxQ1MxaXowVW1lWHFzOV9TTkJYTTEyTFdFSkV5Q3JmTTB6Z01qb2lEa2lnVkNqR1k3bFdsWFhzUlpZWmw2QjhIclRGRm9yYXJMZVVacWFtUWZETlAxUV9j?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.greatandhra.com",
      "title": "Greatandhra.com"
    }
  },
  {
    "title": "Fans who raised Greenland’s flag at US-Denmark hockey game say it was a pro-European gesture - Politico",
    "description": "Fans who raised Greenland’s flag at US-Denmark hockey game say it was a pro-European gesture  PoliticoU.S. men win, keep pace with Canada for top seed at Olympics  ESPNBrady Tkachuk, as he always does, jumps into the fray and drags Team USA into the fight  The New York TimesU.S. men's hockey overcomes Denmark to remain undefeated in Olympic play  NBC OlympicsOlympics news, live updates: Team USA men's hockey defeats Denmark, Jordan Stolz wins second gold and breaks Olympic record  Yahoo Sports",
    "published date": "Sun, 15 Feb 2026 12:33:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNUjJMU1h0Qkc2Q3N6WTc5ajJVZFN2UFMzQkdqSElJbXY0LVd0VnY4d094Zm5NdHptd2w4cGNXbGF4VHU1dFJjMlpIak1NVHN4V3NKS1Y2UWtpMnNGYWpsNVlNaVhZZGNPaEJTVldYckJtdFVIM09YdERnekxWMW1oZEQxZW1fbjR4dWh6V3lR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Top Picks from the CBB Betting Splits for Sunday February 15th - VSiN",
    "description": "Top Picks from the CBB Betting Splits for Sunday February 15th  VSiNManhattan Jaspers vs Canisius Golden Griffins Odds - Sunday February 15 2026  Odds SharkWomen's Basketball Drops Matinee at Manhattan  Canisius University AthleticsManhattan vs Canisius Prediction, Odds & Best Bets Today – NCAAB, Feb. 15  betmgm.comJaden Winston scores 18 and Manhattan wins 69-65 against Canisius  CBS Sports",
    "published date": "Sun, 15 Feb 2026 15:30:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPWGtTNzRqRkFSc29QUUJNNmpLWElxYWZCaFk3dUJwblc2RUotUURvT0RyQzEzMVZrVFExdnpVWmpUc1pLN1ZxbnFUdFAwei1fWGk1RFBmanJ4VEwxeWJvZ0ZRYUl1cDBkWXBCWGtxU253aWw0OUNmUGJXZU10QmV4WFBuRDl6Z3M5NUM1blZ2eU9DRlQwQWVfcXMxY0hpZEd6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vsin.com",
      "title": "VSiN"
    }
  },
  {
    "title": "Italy is having its best Winter Olympics of all time at a pace that crushes its 1994 medal count - AP News",
    "description": "Italy is having its best Winter Olympics of all time at a pace that crushes its 1994 medal count  AP NewsThe best photos of the 2026 Winter Olympics  CNNBest moments of Week 1 at Milan Cortina Winter Olympics  NBC OlympicsOlympic photo highlights from Day 10 of the Milan Cortina Winter Games  Yahoo SportsThe Best Photos from the 2026 Winter Olympics in Milan  People.com",
    "published date": "Sun, 15 Feb 2026 16:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxONTFwTndqVHl2MVZKV3ZtOE5nQS1BdDhnc09iYTR0ME9sXzBSMkRpblRUbE5TYkc5VmFRQnZubnNEaFl3VHIzZnNJa3Yyc1ZIemJUWFBPbFREWTctUnR1U0pzOV8zZDFyb1V6YTRDY0RoTFlrNGVBRkFMR0ljeVBxM3BzT01pRHRUYnhUN2lMdUktdnNmbzhRdHpuZHZBb0hZSzRPZEl5SUxnTFAxY1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Arsenal 4 Wigan 0 – What does Madueke form mean for Arteta? How did Eze, Saka perform in the middle? - The New York Times",
    "description": "Arsenal 4 Wigan 0 – What does Madueke form mean for Arteta? How did Eze, Saka perform in the middle?  The New York TimesArsenal 4-0 Wigan: Fast-starting Gunners cruise through to FA Cup fifth round  BBCHighlights: Arsenal 4-0 Wigan Athletic | Video | News  Arsenal.comEberechi Eze inspires Arsenal to emphatic FA Cup victory against Wigan  The GuardianFA Cup fourth round: Can non-League Macclesfield pull off another huge shock as they host Brentford?  Sky Sports",
    "published date": "Sun, 15 Feb 2026 20:57:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOWWxYRWJ6a2RrWk1yUElNaWN0OVJXbWIwZlI0NTNWNkhrUTFHZmxfY3FRTURoSnJkeTV6R0hUQkdJV1lXTnBBZ3VLS0U1V0ZvZERsVWFGM0hoNTFhVU5kQktvX25EVEt1V0t2Ym14Rnh6cXZTQUtXMVdRZ3NHQkE3dlA4NEhpZXpuMUxKcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US figure skating makes Olympics appeal decision after French judging controversy - Yahoo Sports",
    "description": "US figure skating makes Olympics appeal decision after French judging controversy  Yahoo SportsNo appeal of ice dance scoring that sent Chock, Bates to silver  ESPNWinter Olympics: U.S. Figure Skating will not appeal controversial judging in ice dance competition  Yahoo SportsSkating federation backs French judge in Chock and Bates ice dance Olympic controversy - The Athletic  The New York TimesMadison Chock says ice dance judges should \"be vetted and reviewed\" after France's controversial win at Winter Olympics  CBS News",
    "published date": "Sun, 15 Feb 2026 21:23:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQTWRpTXFnZkhWR3k3YXJ1R3hLdXQyeG5aYzZqUDk4SEdCXzZ5RHU1Qi1iWDQ2WWs1NmRGUmhHX2lkRnZ2dm5uVmliaEF4U3hyVE9kbW8xNGJpUTc0NjlGZHZiYzVvcXZldnUyeFZuN2F6OUJOSnk3bVVTUjM5UXVvSHZuU2ZLQTdN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Newcomers Shine, Nebraska Softball Rallies Past No. 1 Texas Tech - Sports Illustrated",
    "description": "Newcomers Shine, Nebraska Softball Rallies Past No. 1 Texas Tech  Sports IllustratedHuskers Outlast No. 1 Texas Tech - University of Nebraska - Official Athletics Website  huskers.comTexas Tech softball suffers first setback in loss to Nebraska  Lubbock Avalanche-JournalSocial media reacts to Nebraska's upset victory over Texas Tech  Yahoo SportsTexas Tech wraps up Clearwater Invitational, drops to Nebraska  KLBK",
    "published date": "Mon, 16 Feb 2026 00:07:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPWE9UeTlfNnhZS1otcW5JNUYxaExMWU9Ea1JYMVlXT0ZMV1dCLXNzcE9jamVKRkl5T3lSYWdvOS1uZXZtMnRUNjRJWDNVYzhyRnFSdExJZU4tT0Rma2QxcmRGXzdMelpzcWdhZ3RtU0JZYzBNRW83RmlzTmF6RnBnRmw5QTRuOThpdkZaZ1hoUFZMVkl0THZYZllrV2NQWWhqaGUwTlpMb2VrcWpVeDdOQXJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Raiders name Andrew Janocko Offensive Coordinator - Raiders.com",
    "description": "Raiders name Andrew Janocko Offensive Coordinator  Raiders.comRaiders hire Seahawks QB coach Andrew Janocko as new OC  ESPNRaiders hire Seahawks QBs coach Andrew Janocko as offensive coordinator  NFL.comLas Vegas Raiders hire Andrew Janocko as offensive coordinator  Yahoo SportsSeahawks QB coach Andrew Janocko to interview for Raiders offensive coordinator  NBC Sports",
    "published date": "Mon, 16 Feb 2026 04:32:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVnVUcndnR1g3SkN5TVJ4dlNNdllxM0NjMzVFUFN3SkRqOFVTM1Z3SFdONWk1SzJFbkduRVpGTTVPSk85NHpidGgtRl9LMTRlNFRQUVhhcnhrRU9UMU1WR0tQMTNvVGEtMUtYb0lWVF9LXzZDUno4ZEczSGtiNVVSSEp6eEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.raiders.com",
      "title": "Raiders.com"
    }
  },
  {
    "title": "Lindsey Vonn discharged, preparing to leave Italy after Winter Olympics crash, officials say - CBS News",
    "description": "Lindsey Vonn discharged, preparing to leave Italy after Winter Olympics crash, officials say  CBS NewsLindsey Vonn prepares for U.S. return with more surgeries to come  ESPNOrthopedic Specialist Shares Horrifying Update On Lindsey Vonn's Injury  Yahoo SportsVonn leaves Italian hospital, heading to Treviso airport, sources say  ReutersLindsey Vonn shares injury update on latest surgery, set for return to USA  USA Today",
    "published date": "Sun, 15 Feb 2026 16:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNZDNPd0RhRklqbTdFdXNwOGxueGpIR25JYmp4aW5wNkNSX21CVk05QnBQX3VkcmJYdWNIOEpxdWNCS2dNOFRZODZZSEo1UFRsWHRNX3RRZGtKYlhFeHlFdGtmUDc3NG8tV05FMjhOMEk1YjBDTWstcER4Q3JwOGFpR1dBbVhYQ0ZGc256UThGQ0x6RWxDY1FKcF9pV3JPUGY0aUpJ0gGoAUFVX3lxTE5Id0Y0c3lydTdzQ09EYURlNy1oVkhPZ2pEeWFPbUN3ek1lLTRpZFhFTDFtWTJGU2VlOWFQVUFxZU44c0JmVlAtQ3ZOQ2IzZWl6NG00eWxHQ2t3LUh3RFBlWWRhWUxDdktvSEZOcGtCTVlOWm8weXgyeXdZVWptWGlOWDdyT0dKSHFIQWRmblBEWkxLYzlGV09wTVBRMV82YWJVNTE1SnV4MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Anthony Kim wins LIV Golf Adelaide in a remarkable career comeback - AP News",
    "description": "Anthony Kim wins LIV Golf Adelaide in a remarkable career comeback  AP NewsAnthony Kim takes LIV Golf Adelaide for first win since 2010  ESPNThe clubs Anthony Kim used for his comeback victory at 2026 LIV Golf Adelaide  Golf DigestWhere does Anthony Kim stand in the Official World Golf Ranking after LIV win?  Golf ChannelThose closest to Anthony Kim knew his secret all along  GOLF.com",
    "published date": "Sun, 15 Feb 2026 17:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQZVZ1Mnozd0RfeWFPbHVocEFuVmZQb21GdGhJcVhhVXM2VHU2Qy1fVFNfbHphdHpYZVZScFc5M19vVGRLUFp6eURNdVB6ZlByRDd5VFhKWUFkc2NtNVo0OEx0Z29jQjJUUE5KNzhaUldDV2tObnJFMGFKRHd0dzlkbExvbW9fN3lMR3VCTGxQY1ljSEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Nick Castellanos arrives in Padres camp with ‘new vibe’ - San Diego Union-Tribune",
    "description": "Nick Castellanos arrives in Padres camp with ‘new vibe’  San Diego Union-TribuneCastellanos embracing possible move to 1B in 'fresh start' with Padres  MLB.comNick Castellanos talks about Phillies split after signing with Padres: 'I let the emotions get the best of me'  Yahoo SportsFormer Tigers slugger signs with Padres after contentious Philly exit  MLive.comSource: Padres bring in OF Castellanos, pitchers Marquez, Canning  ESPN",
    "published date": "Sun, 15 Feb 2026 21:47:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNM292VUZQV055T2lUbTkydlg4OUh5ZXctcm14dHJQMTh1REhzaURRNDdnYjFxcklsWFdnaE1odFhka2hrV0VhbzZ5UC1WTXZSb19LVGlYNVUzYmlOM19Tb2VMTmYyeE9QNzlaeWxxalRLZ2ZGSEdMY2RfbXBkM0NUTnJreFJPQkR6SUwtZjFMdWk4SDhmTDlwbEtXN0l3eVo4bGFWQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sandiegouniontribune.com",
      "title": "San Diego Union-Tribune"
    }
  },
  {
    "title": "Jake Paul’s speed-skater fiancée Jutta Leerdam takes silver in 500m as American Erin Jackson misses podium - New York Post",
    "description": "Jake Paul’s speed-skater fiancée Jutta Leerdam takes silver in 500m as American Erin Jackson misses podium  New York PostFemke Kok claims Netherlands' first Olympic 500m gold in Milan  NBC OlympicsWho is Jutta Leerdam, the Dutch Olympic speedskater whose fiancé is influencer-boxer Jake Paul?  AP NewsDutch speedskating star Jutta Leerdam, fiancée of Jake Paul, picks up silver medal in 500-meter event  Fox NewsFemke Kok wins speedskating 500M, adds Olympic gold to world mark  ESPN",
    "published date": "Sun, 15 Feb 2026 19:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPTEFhc2dTNTN2X2JzSldlZDM2VWsxQlphYzk4dVJNbnBWUG5lOVdiY0ptSEpFVGtJbzl3cWFDOWprVTdRNUczbFNud3J6SjlNSE5lZmRYa3RCUEREcDJtWVpYdFl1UWIwTXBxT1RWTlZvSEFXOEdoSkJxd09Fbm9PTGxwbnJGbFQxblNQM1JoeXctOWhmQ2RVZHhwN1lGTEk4X1M4RjZJYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Barack Obama Accidentally Steals The Show With Unexpected NBA All-Star Game Moment - HuffPost",
    "description": "Barack Obama Accidentally Steals The Show With Unexpected NBA All-Star Game Moment  HuffPostFormer President Barack Obama to Reggie Miller: 'You did push off Michael (Jordan)'  IndyStarBarack, Michelle Obama attend NBA All-Star Game 2026  USA TodayBarack and Michelle Obama Have Date Night, Joined by Daughter Sasha, at NBA All-Star Game  People.com\"Nobody terrified me more than Reggie Miller\" - Barack Obama details how satisfying it was to see the Bulls bully the Pacers in the '90s  Yahoo Sports",
    "published date": "Mon, 16 Feb 2026 05:04:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPbVl2TklDekQweS1ibmZieWZiMWJxbDJSamZGODBad0UxeUJjMTh1ZW9MT2d1eEFjWjVPMkc4SHpEXzNrcm03U0J6SHVTRENyZ2c3YlBfOUNnNXBZb3lFdEoycVk3ZGRCQkdBTEluazc5QlRfWWRDekIxQU9wdlBJSkctMm5hdWhrNmxVRTlDblBrZ9IBlwFBVV95cUxPamVoOXdueTB6WHNwNGZwaXR1by1xX0RPMGFlVzJrdjQyNG9YR0cxSndEZ01VNXFkX19ydERISzNmVDZoYWwtNThhYlZ0c2tBcG90ZHdfOWFjMXNSakZrZEtvRnd6dmJqNDlxNTQwOFUtR1BVWkhyUjF6R0NCWGROTlM2ZVlUcTJRZS1WazZmU0tWZ1FKdmow?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Nathan MacKinnon, Team Canada appreciative of Tom Wilson fighting France’s Pierre Crinon after head hit: ‘I definitely appreciate him sticking up for me’ - RMNB",
    "description": "Nathan MacKinnon, Team Canada appreciative of Tom Wilson fighting France’s Pierre Crinon after head hit: ‘I definitely appreciate him sticking up for me’  RMNBCanada's Tom Wilson drops gloves in rare Olympic hockey fight  ESPNCanadian hockey star Tom Wilson ejected from Olympic game for fighting  Fox NewsBruce Arthur: Tom Wilson answers the bell after a French cheap shot. But for Team Canada, the Olympics get harder from here  Toronto StarCanada’s Tom Wilson tossed from France massacre at Olympics after getting revenge for Nathan MacKinnon  Yahoo Sports",
    "published date": "Sun, 15 Feb 2026 22:09:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQa2hDUkJ5T0ZqZGQxeHRTc3pOS3ViTzJxb1Q4U2VPek1jMXYwaXFObmZxRVlMSzdmczFxNlZkY3lkaFFmcHlQa1ZjVXhVRC11TUlnd3dyazNIMXZWeGItU0dpX05FQ1dMT0MxN2I4VjFKY25Kd2pPWmRfckdVUkE1Q2ZDSGNFU0ViT2Vlbm4tLVBhR3pHYzR0NWpZcGhIN2tObFhMZGFDR1lTdHhOZnp4VnlQYkxKeGNPYUllWnFIQms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://russianmachineneverbreaks.com",
      "title": "RMNB"
    }
  },
  {
    "title": "2026 Daytona 500 live updates: Results, leaderboard, weather forecast, highlights, stats, standings, news - NBC Sports",
    "description": "2026 Daytona 500 live updates: Results, leaderboard, weather forecast, highlights, stats, standings, news  NBC SportsDaytona 500 start time moved up an hour as bad weather looms  ESPNDaytona 500 results: Full finishing order of 2026 NASCAR race  Daytona Beach News-JournalOrlando weather: Daytona 500 forecast; tornado watch; strong thunderstorm threat, timeline, impacts  FOX 35 OrlandoImpact Weather - Timing Out Damaging Winds, Hail & Rain for the Daytona 500 Valentines Day Forecast  WESH",
    "published date": "Sun, 15 Feb 2026 23:20:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNTkJjd0hPUEpqN2VwcVotTlFjVFFRWmN6MXVZZVZWNllmN2hHNnVVaUctY0NndndNRlQ5VEZyY1R6R3hHekpCZ1dEVEZlQVVUVVdlbWpQSm03QVB4OFVDczZwRFlMM08yNWQxWUpvaGlEdU5BLVpTNVBKX2ZVX2ZlQWo3b0tZSnMtckpTWHd4UGVVN1kwYVV1SlY2VktYZ3NMbm8tVjBoamFmUlBkRTNGSTZGU3I3UXg5SWl6b2FXWmhia1NETGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Mikaela Shiffrin fails to make the podium in women's giant slalom as Olympic drought continues - CBS News",
    "description": "Mikaela Shiffrin fails to make the podium in women's giant slalom as Olympic drought continues  CBS NewsMikaela Shiffrin misses podium in giant slalom as Olympic drought continues - The Athletic  The New York TimesMikaela Shiffrin finishes 11th in women's giant slalom  NBC OlympicsU.S. Alpine skier Mikaela Shiffrin finishes another Olympic race without a medal  NPRAustria wins Olympic team combined, U.S. still takes bronze  ESPN",
    "published date": "Sun, 15 Feb 2026 14:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQRDhONEc1eC1MN0VVV3IxX25BdnVJS2gtVGc4ZFo4bzJ4cmlqRzVVcXlVV1EtcWpUSVRuSHhNeXZWcVJHT1Z0UUlvUkxCbnlITmJMNnNtc0p6VnBxMGJjVVpZWjhKNlg2RFBNb3NjRHdMYVAtU3ZkT2tDVFNZclhQcUp6dWl1ZGF2TTNKTzdnMGtYcXVIejlz0gGcAUFVX3lxTE03T3dlVjhSVWNTUHVGTGw5T3hQTU9YbVk0TUpBRkMzVnRsbzdlOUVKelhuQ1F2RG5vM3JEcy1QQVBYWlNONmRCaHprN2NxRkxjODVra3FJN1BJM21KblgtUE5KR2t5SXZLWDJtVFpvZ2d4Nk1oNXNEOHVBa0xfVy1OSnlSSm8zUnlwcmZuVkl4TnhNbWJKTkhUMXd4dQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Brazil’s Pinheiro Braathen wins gold, and South America’s first Winter Olympics medal - NPR",
    "description": "Brazil’s Pinheiro Braathen wins gold, and South America’s first Winter Olympics medal  NPRColumn | Lucas Pinheiro Braathen dared to be who he is. He won gold because of it.  The Washington PostBrazil's Lucas Pinheiro Braathen falls on 1st run of slalom  ESPNFrom the sports desk: South America breaks 102-year drought  NBC NewsBraathen the man to beat as slalom wraps up men's Alpine skiing at Winter Olympics 2026  olympics.com",
    "published date": "Sun, 15 Feb 2026 12:58:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQcENfZHd3T0pZNU9kQm5hZU5HUE9NRFBESnlEN28zYVZRakJRM2xJSEE3SWlwR3ROa3BlakN6azNiTXBsVnRnZGlHdXBCTU1zUW5xbVg0b0tOSnd3WklqUHlNOGVrS0NWQlQyUjJuS0M0NTZFRmpEd0NLLVB3ZWk4YW9fRGNXS25mdWk3OXdTbmJ2ZlBhTUtqZ3FoZWN4ZmsySFdmMWxGUUNYa0VW?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  }
]