[
  {
    "title": "After ‘Olympic curse’ hits Ilia Malinin in his free skate, the ‘Quad god’ sets his sights on future - AP News",
    "description": "After ‘Olympic curse’ hits Ilia Malinin in his free skate, the ‘Quad god’ sets his sights on future  AP NewsIlia Malinin places 8th after two falls in Olympic free skate  ESPNFigure skating world shocked by Ilia Malinin’s Olympic performance  NBC NewsWinter Olympics 2026: Ilia Malinin confesses after devastating free skate collapse knocks him off podium: 'I blew it'  Yahoo SportsSee How Ilia Malinin Fell From Podium in 2026 Men’s Figure Skating Final  The New York Times",
    "published date": "Sat, 14 Feb 2026 11:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOaGE1V2dJd0twR244cU1sZ3gyemIwX2xDQnlOUTMyU2g0U1NoWFRNZkE3ZEJHU2lGczRlT3lza0NwckRtLU5iR0dJYzV3VGo3Z2h4UDlYUlN2X1psck1rd0NoWnJ0MWZkamx1U1djTE1VZ0JEdnpfdXAtNWFRVWN4Z1JKNXFBU2x0OWF2R3YyaXlSbllITng4Vld6NjBjRXY4NUNPVXBYYThmTUpwZk9VRHNBSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Biathlete’s infidelity confession that rocked the Winter Olympics – and Norway - The Athletic - The New York Times",
    "description": "Biathlete’s infidelity confession that rocked the Winter Olympics – and Norway - The Athletic  The New York TimesWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'  Yahoo News New ZealandEx-girlfriend of Norwegian Olympian speaks out after public cheating confession  The New York TimesNorwegian biathlete who made cheating admission wins another medal  NBC NewsNorwegian Olympian regrets revealing affair after winning medal: 'Not thinking clearly'  Fox News",
    "published date": "Sat, 14 Feb 2026 07:49:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdWFndkhnOWE4bklyMzhVVXZKUVBtTGVxSzNjWHRzbjdEMUotUFRrT3FGb0JQdjdnRFl4M3dibS1GSlRtVkpZcmVDOTc1MXN6RmxrdVlxb2N1ZTJVdThVLUlKTVdoODBDX0x1R1pUVDF6UTFtZmg3S2tRdGttaFpOeVQwSWFMQ1pVdHEyR2ZHRU00bDlEOU5OczBmX2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Brazil’s Lucas Pinheiro Braathen wins giant slalom, earns South America’s 1st medal at Winter Games - AP News",
    "description": "Brazil’s Lucas Pinheiro Braathen wins giant slalom, earns South America’s 1st medal at Winter Games  AP NewsWinter Olympics Day 8: Lucas Pinheiro Braathen wins gold in men’s giant slalom, South America’s first ever Winter Games medal  CNN‘Trust who you are’: Brazil’s Pinheiro Braathen wins South America’s first Winter Olympics medal  The GuardianBrazil's Lucas Pinheiro Braathen wins Olympic giant slalom gold  ESPNSouth America just won its first medal in the Winter Olympics  NBC News",
    "published date": "Sat, 14 Feb 2026 14:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPSWNrT2EwWkVzcGdmMmFvVF9iNUYxMjY0Yl8zWHZENTBQeEVKVVhNbzRPdDA2cVBBRUFSQ3VQZVdSMFNpWDNObWlLSkRiVV9Ud1JWQTFFQlhCQWJxYzBuc2JYUDZUSUd4dk10MEE1OU9lSk9BWlUzUlloYTBrYUptQ3RBcHI1aVhhMnNxbk5IeXRIMG9VXzV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Cheating claims, curse words fly in Olympic curling controversy - ESPN",
    "description": "Cheating claims, curse words fly in Olympic curling controversy  ESPNWinter Olympics 2026: speed skating, skeleton, Norway win 10th gold – live  The Guardian'I told him where to stick it' - Canada and Sweden in curling cheating row  BBCRule violations clarification following men’s session four in Cortina  World CurlingWinter Olympics 2026: Cheating accusation, profanities hurled as Canada beats defending men's curling champ Sweden  Yahoo Sports",
    "published date": "Sat, 14 Feb 2026 12:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNVS1wS0NjVVBvYWVxMG8yMDJoV1hHZFJjS2N1cEZTd19DSDdwSlc5Qk9FYUZPR0ZSZ2NRVFdhaWdfWVZpYjB4R2hvck90SlRReklUX2wwcWR3TXhwT1FDSkJuUzYzd2JnQkcyM0hhVTcycloxODlQNXdBeFJ5aklFWmRab2dlNXJsV0NsR0NLckJVeUdmcU9FZjJsSDh5Mnd4NjVLQzhuT3Y1OVNyMFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "What we learned from the first week of F1 Bahrain testing - Autosport",
    "description": "What we learned from the first week of F1 Bahrain testing  AutosportWho's really fastest in 2026? F1's new rules are confusing the pecking order -- and the drivers  ESPN5 key questions after first pre-season test in Bahrain  Formula 1What we learned from F1’s second preseason test: McLaren’s concerns, trouble for Aston Martin  The New York TimesF1 2026 Bahrain pre-season test: George Russell even faster as Cadillac causes red flag  Motorsport.com",
    "published date": "Fri, 13 Feb 2026 20:33:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOZ29ZSkJtb3pCMVpnUEVUVTlJWUpwVFd4REZOelY5dFhtVGNiMVZPanp4NXdjd2RzWUJDN1JYNy1KUWVQUDN5ZXRtdk1nVWs4eW43YUdvTWxqWFI4SmJqOGg1YUR4NldraVR5Nnc1NkZRNUNPbDlyRnhoZzY0UWtaUVJXTVJlRWdBQXdFQVpOOXJSc2NFMWNhaGJFQzR1cGk2bWJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.autosport.com",
      "title": "Autosport"
    }
  },
  {
    "title": "Padres, Nick Castellanos Agree To Contract - MLB Trade Rumors",
    "description": "Padres, Nick Castellanos Agree To Contract  MLB Trade RumorsHow the Phillies’ $100 million marriage with Nick Castellanos ended in divorce - The Athletic  The New York TimesNick Castellanos says bringing beer into dugout, criticizing Phillies manager Rob Thomson led to 2025 benching  Yahoo SportsPhillies release Nick Castellanos after failing to find trade partner: Where could former All-Star land?  CBS SportsSource: Padres, OF Nick Castellanos agree on one-year deal  ESPN",
    "published date": "Sat, 14 Feb 2026 16:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPVkllYnd4Ylg1ejZ2VkJBRnRkaHo3Z3FqMnZtVlo0ZHF4OHdxZjBPQk02WDRvdFM0TEZ0SXpRT1FkcEZMWmlwZnN0ckVPYUJmZlp2U0owOHprRXc5MkQzXzVKZFN1alh5SGtTZGRVQnh1MWFNUkFyUUd3ZGVBT3gzelc5NkJNZVhwb1NqZFpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "US women’s hockey coach livid over officiating as win over Italy gets heated: ‘Blatantly break the rules’ - New York Post",
    "description": "US women’s hockey coach livid over officiating as win over Italy gets heated: ‘Blatantly break the rules’  New York PostUSA's Abbey Murphy at center of chippy Olympic hockey win vs. Italy  ESPNWinter Olympics 2026: Why this could be the most dominant U.S. women's hockey team of all time  Yahoo SportsAs U.S. women advance to Olympic semifinals, the pressure is one the 'best team in the entire world'  NBC NewsSkirmish breaks out after Hannah Bilka's goal vs. Italy  NBC Olympics",
    "published date": "Sat, 14 Feb 2026 04:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNUzBnQ2UwMmRvMVAyUXE3a29MWFdhSzhwNUhmR0xDcnFEekNVR1RjOW13ZFJBMEtzT1duOXh3cUladldhOC1jRngxV2ZWYUxXSUpKRmxMS3pVdlNEMi12RXRqQ1Z3c1RNS0RsLVlXYnRWeFgtZ1NscXpuN1lPV0czU0xPSkR3MllITGNsNEpIQVV1Sk1TSXBjblJMcl85dG45Yzk0anR5OFk1SnE2V1VLQ0xXRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Meet the power couples of the 2026 Winter Games, from rivals to teammates - NPR",
    "description": "Meet the power couples of the 2026 Winter Games, from rivals to teammates  NPRHeated Rivalry and Marital Bliss: Two Wives Go Head to Head in a Scary Olympic Sport  The New York TimesValentine’s Day at the Winter Olympics might look a little different, but it’s still special  AP NewsLove in the air! Meet Winter Olympics power couples at Milano Cortina  USA TodayValentine's Day at the Winter Olympics might look a little different, but it's still special  WMUR",
    "published date": "Sat, 14 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPQjNycU5ONkRwR2FqZnZ5Zzh5NEJuUjRta2l4Xy1DZXUxM01haHlkQUxGbDd0SDNVbE1PMzBQclFMdmJFekRwRVEwRDkyLVFoeDM3bC1mYzZXZndibVFpZG1aTVRFYm5rUF9neS1ERm1lcUNRRDBJOWthbHhfWWM5WWU4YVl1TnE4Vi1Va0d1Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Everything Tom Izzo said after Michigan State beat Wisconsin - 247Sports",
    "description": "Everything Tom Izzo said after Michigan State beat Wisconsin  247SportsWisconsin knocks off another top-10 team in Michigan State  ESPNCouch: 3 quick takes on Michigan State basketball's 92-71 loss at Wisconsin  Lansing State Journal'Our defense let us down': No. 10 Michigan State suffers lopsided loss  The Detroit NewsWisconsin Men's Basketball beats third top ten team in a season for first time since 1951  Channel 3000",
    "published date": "Sat, 14 Feb 2026 05:39:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNzc3YzNzOG81YWRNNkJFYXFiMkFOV3d1YjFlbFEzVTlBQ3hKU2k3THJNRVpSNVluWWdqQmZRVS15TFJDN0YtczdJOElnXzNoSWZpbWpZNEhqY01GdFpNM1BGbGVaZ3ZnVllYa2VsUTNaeVFmc3dTbWVMcTdYaVRFeE1WV21XcF8zNmY1YVRHcTBfQkQyN2ltTktIX3JfbHM1RXhteElYaktCUmU0RlQ0Nk1ORDJGNXFnUTRqLVp3UWJfM25zODYzVjYwOVVwMy14WTVBRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://247sports.com",
      "title": "247Sports"
    }
  },
  {
    "title": "Top Picks from the CBB Betting Splits for Friday February 13th - VSiN",
    "description": "Top Picks from the CBB Betting Splits for Friday February 13th  VSiNCollege basketball picks: Predictions for Duke vs. Clemson, Kentucky vs. Florida, more top 25 games Saturday  CBS SportsDuke-Clemson, Kansas-Iowa State lead college basketball games this weekend  USA TodayCollege Basketball Picks: The Undervalued Team to Bet & More Saturday NCAAB Best Bets  Action Network'Three Best Bet Weave' For College Hoops Saturday Including Texas Tech-Arizona  OutKick",
    "published date": "Fri, 13 Feb 2026 17:27:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPRDVPVkpwVWkxZTFYWTY3eUFnNmFOZFpoeFJObEdwc1M0T0RyRnRWc0NaX2tudXBiTlZ2aUlUM1hnUU9qX0lfVHRsN0pZQkI0MzNNX3N1ZEo4THNLOXJMVTdRZUlZZE50WTRjMzJxenZMeld4WHZjb3M5ZWJyS01yQUFqM01lVG9EV2p0QUlRZkViLUpoaXZXM3Y4SndrT25P?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vsin.com",
      "title": "VSiN"
    }
  },
  {
    "title": "U.S. Figure Skating will ask ISU to review system that led to ice dance judging controversy - Globetrotting by Philip Hersh",
    "description": "U.S. Figure Skating will ask ISU to review system that led to ice dance judging controversy  Globetrotting by Philip HershControversial French team winning gold is awful for figure skating, abuse survivors | Opinion  USA TodayMadison Chock and Evan Bates respond to judging controversy following silver medal  NBC NewsMadison Chock says ice dance judges should \"be vetted and reviewed\" after France's controversial win at Winter Olympics  CBS NewsWinter Olympics 2026: Judges are stealing figure skating's show (and not in a good way)  Yahoo Sports",
    "published date": "Sat, 14 Feb 2026 01:39:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxQVXgycERUUGpaTEkyQm54NHpEeXdvSWpEM3dnTllVR05KZk1iUHBNUW5XdElqcTBBWmlqdnRFTk8ydVNnRjBtaE92NWNDY1JvRFhYX1prbWxvNFdjQWw0Qm04V2JsVUxndW5YLVQ0X054WThhaXcyOVVUYWpOelRxU0pCdU91MWhMREhKM3dCNzBOanpiLTVsLTYtam5vbE1QT3QzV3VXdjYzQnRtenM1OUk1Q29rX0FKbTdDYWw0QzNtay1FTExveE95N2Q0S011VUNSY3VaTVpYN3E0VklCeXpQalhtN0YyeENfUnpTWTJ0UjE4d3VhSjliYnBYT2xqbTRN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "http://www.globetrottingbyphiliphersh.com",
      "title": "Globetrotting by Philip Hersh"
    }
  },
  {
    "title": "'It means more than any medal' — Ukraine's skeleton racer sacrifices Olympic dream to honor war victims - The Kyiv Independent",
    "description": "'It means more than any medal' — Ukraine's skeleton racer sacrifices Olympic dream to honor war victims  The Kyiv IndependentAmerican Olympian Austin Florian goes viral for incredible helmet design  Fox NewsOpinion: Disqualified but not forgotten  NPRUkrainian skeleton athlete's DQ appeal denied by CAS  ESPNDisqualification of Ukraine’s Heraskevych includes dismissal of his sport by Olympic leaders  The New York Times",
    "published date": "Sat, 14 Feb 2026 01:39:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNTVdlZjZVa2ZKc0d4Z0xxVUlmdEFlV01OSlgxTnlrU1luZW1fc2pQdWVfRGhtamllREJId2xLQ2hWYy10UFMzNmFWcUMxTFRrZXVFXzZPdG9XX1JjUFJ2ZkxNOEIza3pPTG5FdzF3eFFHSTFXRFBxZjhVRVBvbE0yRGpCakk0dkctRXlZaDdvYVlxek9Dd2NIYmxxR2RLa2xXc2UwemJVMDlOR2N6anE0RDFmWXFiWFgwaEdOUnJBZVlRTW8xZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "4 Penn State wrestling takeaways from the Lions' 36-5 win over Ohio State: On Mirasola's win, the Buckeyes' lineup, and more - On3",
    "description": "4 Penn State wrestling takeaways from the Lions' 36-5 win over Ohio State: On Mirasola's win, the Buckeyes' lineup, and more  On3No. 1 Penn State wrestling dominates No. 2 Ohio State 36-5  NCAA.comPenn State wrestling’s Cael Sanderson on a vet’s progress, a record BJC crowd, more  PennLive.comPenn State Clinches Big Ten Regular Season Championship with 36-5 Rout over Ohio State in Record Setting BJC Dual  gopsusports.comThree takeaways from Penn State wrestling’s Big Ten title-clinching win  Centre Daily Times",
    "published date": "Sat, 14 Feb 2026 03:11:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxQU1hsN2RyQUp0aGtBXzVWQk02bXhCMUxTY3VKWUlVYVNfMU1xN2J1d0RlUWUwTTluOVdzTEJiUHFUaDhEQ0tzM3Z4UlExNG1BSndqb1UyQWFBa3pLVlV2RW54UjFGWkQzR3RyeHVaZWZLSVVlUHlHeF9mZGpSaFJqdGtFV0xXclNsWmZWOURydklZbVl6SXV6OWxhMnc4ZUxScTJqTllmWWxMRWg4M0ZKcHRiOGJxcTRsOFF6d2FRWERYakpsemdUQUR4R0szTG8tclBLUnljc2JZZ1NYTXc1OURUR3ZvZm1acHE4QlQxcXFEWDk1YzZYM1pFZDVIMHJhYkFlMHNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "NBA All-Star 2026: Live updates, highlights through the weekend - ESPN",
    "description": "NBA All-Star 2026: Live updates, highlights through the weekend  ESPNNBA All-Star Weekend predictions: Expert picks for 3-point Contest, ASG MVP and more  CBS SportsL.A. Clippers hope fancy new Intuit Dome will help them challenge Lakers' fandom supremacy  NBC News2026 NBA All-Star Weekend schedule: Games, events, times, teams, how to watch it all  NBC SportsHow, where to bet on the NBA 3-Point Contest: Best betting apps, sportsbook promos for NBA All-Star Saturday  CBS Sports",
    "published date": "Fri, 13 Feb 2026 23:05:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPZzRrTkFUa1JWZEU1aC1wbkxiSEx3cEJXVUNGdWQ5bXhqaENiQnpPZlR2WnFuTkdzNERKNTd2NzIxLV9tSHdkdE5iUFBpZjZRUzVvYkItOW91TlFyRFlGbXRkU2JGdVdqanp5MXdTYzY3MFRFdFVTU0JFb1lhLXRjTXRNbHp3d2QxMWlqbEMwMUNMMktUSnZ3ZDhYZGt1d0Z6NEJyOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Matt Walsh, notorious Florida villain, will be at tomorrow's game - On3",
    "description": "Matt Walsh, notorious Florida villain, will be at tomorrow's game  On3A Rivalry and Reunion  Florida GatorsBig Blue Preview: Kentucky at Florida  UK AthleticsWhat Florida coach Todd Golden said about Denzel Aberdeen's return  Gainesville SunKentucky vs. Florida odds, prediction, time: 2026 college basketball picks for February 14 from proven model  CBS Sports",
    "published date": "Sat, 14 Feb 2026 12:13:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPY2lQUlhzYTZXa2lzTVJPaTZMYW9WbDRNYzdEVWFiY3hlZUl0el9OWGxLclNqV0N6cmN0LTRoNjNHaTBOVG16Q0ZwRkoxUVltc2FoYUtzWXFzLUdkNmFsMnRmS0NZTUl6Y253ZDJRdWI0Q2VYTEhkTUlNTHBmTWxvRXBwY1B6cVl1eERsYjhfSnRMTzdBZk9zMXhYeDA1UUxwT0dYTU9XRklhRXJN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "Clingan and Hansen Both Prominent in NBA All-Star Rising Stars Challenge - Blazer's Edge",
    "description": "Clingan and Hansen Both Prominent in NBA All-Star Rising Stars Challenge  Blazer's EdgeNBA Rising Stars: Donovan Clingan and Yang Hansen leave with highlights, memories, motivation  OregonLive.comBlazers’ Yang Hansen fakes out Donovan Clingan for Rising Stars bucket  Yahoo SportsYang Hansen Records Five Minutes in Blazers vs. 76ers — Here’s the Latest Update  Heavy SportsChinese rookie Yang Hansen impresses in NBA Rising Stars debut  Global Times",
    "published date": "Sat, 14 Feb 2026 04:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxQa2lzekNmeTEybEl2WWJWNnlwMGc3TzI3eVQxMTRNWTFRV3RBY2xGUENDQVZubVdCc2Rhay0xZ19oeU5VUFY1NVN2bXc5UWxneEZtWm1ES2hYZWtYQkRYVExPTlUwWEp1c0Y1NjFrZ3hJQlBwRlZlbkpmRnZUbVRrNFhtdUtzaHVZeGw5Z3hIYWxKOHB6aWlXdjF0VV9vejF2N2hwOGkzbDlvNi1VdE5hRHRxbUtrbU04MDJpblFMeW9hZnlNQUt3Yzl2VFhNS21yNVNsSnF1TE16NWVYVS1KVjJEYlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.blazersedge.com",
      "title": "Blazer's Edge"
    }
  },
  {
    "title": "Cleetus McFarland wrecks out, six laps into NASCAR Truck debut at Daytona - Motorsport.com",
    "description": "Cleetus McFarland wrecks out, six laps into NASCAR Truck debut at Daytona  Motorsport.comCleetus McFarland to attempt Truck Series debut at Daytona with Niece Motorsports  NASCAR.comFamed NASCAR, motorcross star returning to Daytona weekend with higher purpose for veterans, first-responders  Fox NewsCleetus McFarland's NASCAR Truck Series debut at Daytona ends in crash  Daytona Beach News-JournalIs NASCAR going to let Garrett Mitchell be Cleetus McFarland?  Motorsport.com",
    "published date": "Sat, 14 Feb 2026 08:16:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQQkZfOUlDZE9UTWx2VEhFSlUtQ3pxN3pVTWxNUThYVzBzMkNCZUoxYUpmekswLWV4NV9MZ0RXamJtSEFZY0hyRXFlcURYQnZxalZrN3ZfdnllRHp6bENUd2FzYk0zSDlMMTJkcVJENlFRTW8wcHlXbGRELUQtYkF1WE5KS1dVN0hra0U4dlpGM1pPbVV0dWR2dXpXYmxsX3ZBS0xESFBuNERIdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.motorsport.com",
      "title": "Motorsport.com"
    }
  },
  {
    "title": "NBA legend Chris Paul announces retirement at 40 - BBC",
    "description": "NBA legend Chris Paul announces retirement at 40  BBCChris Paul announces retirement from NBA after 21 seasons  ESPNLeBron James, Dwyane Wade, Lindsey Vonn, Naomi Osaka among several sports stars to wish Chris Paul a fond farewell after his retirement  Yahoo SportsChris Paul's extraordinary basketball journey paved by relentless pursuit of perfection  NBAChris Paul, the ‘Point God,’ retires as All-Star weekend begins, ending a 21-season NBA run  AP News",
    "published date": "Fri, 13 Feb 2026 19:56:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE44cUp6NW43c1NKSkxib3Y2aEw3WnlOWThvVUtjeUJnbVFmNlNWMnc4blptRmU4X0h1ZWllakV5Z09zZUt3cHgxT011WFRlX2xiSU5yVzVHdXdQZEJYZm1yYTRWVzdEY2M5RUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "3 grand slams in a game? Baylor slugger makes history - MLB.com",
    "description": "3 grand slams in a game? Baylor slugger makes history  MLB.comBaylor's Armstrong 2nd NCAA player with 3 grand slams in a game  ESPNBaylor's Tyce Armstrong makes baseball history with 3 grand slams in season-opener  Yahoo SportsLive updates: College baseball's opening weekend scores, highlights  NCAA.comD1 Digest: Opening Day delivers expected Top 25 chaos  D1Baseball",
    "published date": "Sat, 14 Feb 2026 02:31:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1aOU9NWWJqaEFfdFFhVGlxZjRXVVRGazllc3BMMmhHd2JFakZJZjVmMnlGYjlNTURLNE5zR2Y5QkZ4U2F4VVlhcFlIVkllcmlLbUwzTUlDdW1hbGQ1UThVTDZkLUgzcUhUdzNDbVpHT2Nxb2sxSkZDakc2bGvSAYgBQVVfeXFMT0R6NWZqMVM0SEJCUVlwemFjNHFHazU5bmFWM1NOMFNkOE42cnRiMjk2MTRKempzSHp1aUVlZERJRE50dDFrWk9rWl9hUGktbW1DR2o3SXdLRXVCcUw0ZkhtWm9oaHA3RGpFLUhtTUN3cENzT3FKdjJEb3dfZ29saE1vdVVMWnRZZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlb.com",
      "title": "MLB.com"
    }
  },
  {
    "title": "Norway’s Klaebo ties all-time Winter Olympics gold record, in photos - AP News",
    "description": "Norway’s Klaebo ties all-time Winter Olympics gold record, in photos  AP NewsNorwegian skier Klaebo ties record for golds in multiple Winter Olympics  ESPNJohannes Klæbo wins eighth gold, ties all-time Winter Olympics record after thrilling 10km free victory - The Athletic  The New York TimesHe’s the Michael Phelps of Winter. His Secret Weapon Is Summer in America.  The Wall Street JournalThis Olympian Skied Sub-6:00 Mile Pace—Uphill! Runners, Here’s Your New Favorite Sport.  Runner's World",
    "published date": "Fri, 13 Feb 2026 15:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQQzhWeVhaVUpnUm1kMDRUOUROQllIalc5bXBPejZzZHBUeUdGaUdZQk94VGJSWEMzbXQzQ3prZm5hS2szUlJnTFBzbnhxeWNPaTVyeWp3QkVaRmJ3WW1PMWVMdTktdC1vdkhiSE05T0NYOUdhcmszTXVyYU5aS1JIZE9za2dFOVF2OExZLUExZ3ZxeThSUE9KamVBM2puTlBwZlp6V0RRNWNhbFFlYnFURDE1a25YOWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Nebraska Baseball Run-Rules UConn for Season-Opening Win - Sports Illustrated",
    "description": "Nebraska Baseball Run-Rules UConn for Season-Opening Win  Sports IllustratedHuskers Cruise Past UConn on Opening Day - University of Nebraska - Official Athletics Website  huskers.com'Relentless offensive effort' paces Huskers in run-rule win on opening night  247SportsHow to Watch Nebraska Baseball in the MLB Desert Invitational with Preview, Breakdown, TV & Streaming  Sports IllustratedAround the Horn: Nebraska baseball opens the 2026 season in Arizona  On3",
    "published date": "Sat, 14 Feb 2026 04:55:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxObDZ2TlhKYjRXdFA5dkc1TkprMTdEN0NEaHE4NDFOaEJJam5YLVNfWHczSzQ5U1RXcGk4VHNxOTRFZjVqSmVqZnZOdVUzTkROX1FlVFdheEQzS2NGLW5vQzF5SmJkQkpxZGFPUm0zX3dWUE16Q25YVjZOdWhWblFCeS12Yk5FWElIcDNDeFgxckVVZVBENl9xcUlRYnY4NG9FNVRybGptTmIwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Lindsey Vonn provides latest update from hospital bed: 'Finally feeling more like myself ... long way to go' - NBC Olympics",
    "description": "Lindsey Vonn provides latest update from hospital bed: 'Finally feeling more like myself ... long way to go'  NBC OlympicsVonn hopes to go home after 4th surgery following Olympic crash  ESPNLindsey Vonn awaits answers on next surgical steps after Olympic crash  Fox NewsUS skier Vonn to undergo fourth surgery in Italy, another when home  ReutersInside the terrifying and efficient world of Olympic ski airlifts  Los Angeles Times",
    "published date": "Fri, 13 Feb 2026 17:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPU1VScjdYTnZzek5PNWVBZFFlQ005WnlkOUFyTzdzQ3dsSTdiSGtxeW9SdHZLSkxvMEVHUVhtNjFRWTNHZjNoWHowY0Nnb1Q2aGRWYk4yOVhxYXdtZ1JUT1pxVFcxN1dpV0plVjVsYUN0dnM1QmxZczA0ZmpydWlVWmZtVmNVRkN3cTc4RzRGUENvcThxSXRqalZKc01EUnpteTBZTTVGWFZsb05SelNtNHlHazZvTDFYZHpOWXdIcGFUbjl6T3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Seahawks All-22 review: The good and bad from Seattle’s Super Bowl blowout of the Patriots - Field Gulls",
    "description": "Seahawks All-22 review: The good and bad from Seattle’s Super Bowl blowout of the Patriots  Field GullsSeahawks' Julian Love sets record straight on how much they knew was coming from Patriots offense in Super Bowl LX  NFL.comSeahawks, fans celebrate Super Bowl victory with Championship Ceremony and Parade  king5.comA Plea From Me to You  SPD Blotter (.gov)Seahawks' Super Bowl dominance proves defense can play a lead role in a box-office hit  Yahoo Sports",
    "published date": "Fri, 13 Feb 2026 18:52:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNeUtTejVQSkZHY256bGhnWWU4WnRieXk4STlwNXllX2haak1rTnpnLU9QWjFaUjhvcUYzTnlNZEtlLUVVckJIZ1RFS3hhazhTSzdHa3E4WXlrX1hEUHR4Nk81S1RWcUZ5cW9QN0NoSmNxNmhObVh0bjhvR0h3Q3c4N1BIUjFLMTR1RkJ6cDZCX1AwZENNU0JxNkpCQWEybzA5WWlETmJfdlhaMzFCWWtCUEdKSUNlUllVSnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fieldgulls.com",
      "title": "Field Gulls"
    }
  },
  {
    "title": "The Olympics Has Reportedly Run Out of Condoms - The Cut",
    "description": "The Olympics Has Reportedly Run Out of Condoms  The CutThe Winter Olympics condom supply ran out in 3 days. Athletes have thoughts  The New York TimesOlympic condom crisis hits Milano Games on Valentine's Day  ReutersLove in a cold climate: Winter Olympic village runs out of condoms after three days  The GuardianAhem: The 2026 Winter Olympics Village Ran Out of Condoms In 72 Hours  Cosmopolitan",
    "published date": "Fri, 13 Feb 2026 22:56:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5BZTZhcFl1YlNUUXYwemlmMEp4MEszWXYydjJjZ0JQd24wSkd0OWFBNFhOSENvVDItc0VMSS1qeEYxTjRrVDlqTDI3aHQ0ZVRhWDdhZURGQlZBXzBWVk5aWVBZMkpxVjcwMXdrRmE3Z0c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecut.com",
      "title": "The Cut"
    }
  },
  {
    "title": "Patriots’ Stefon Diggs pleads not guilty to assault allegation - NFL.com",
    "description": "Patriots’ Stefon Diggs pleads not guilty to assault allegation  NFL.comPatriots' Stefon Diggs pleads not guilty to assault allegation  ESPNPatriots’ Stefon Diggs pleads not guilty to assault, strangulation charges  The GuardianPatriots star Stefon Diggs pleads not guilty to felony strangulation charges days after Super Bowl  Fox NewsStefon Diggs Pleads Not Guilty To Felony Charges In First Court Appearance  NESN",
    "published date": "Fri, 13 Feb 2026 15:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYVp0Nkl4YTh2aU1mZHNUb3FVWEtjaUR0V2FMYS0tN0ZBMHNKb3puOEFUektVcHZUVDVTQzNxQ2tZZWIzcnVFNWt2YmM2cTBjX1F6Ti1ka3dYbGVmV0gzRnozMFp5WVBaeTdYQzZNYmdNSENYdFN3dXVFNjQ1TkdtNjJMS2d3T1JjaUF2bV9BOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Chloe Kim scoring questions emerge after losing gold at 2026 Winter Olympics - New York Post",
    "description": "Chloe Kim scoring questions emerge after losing gold at 2026 Winter Olympics  New York PostKim comes up short in bid to win third straight Olympic gold medal  ESPNChloe Kim went after history and missed. She remained proud, unapologetic to the end  The New York TimesWinter Olympics 2026: Chloe Kim stunned in halfpipe final  Yahoo SportsChloe Kim's protégé foiled her Olympic three-peat dreams. She's celebrating anyway  NPR",
    "published date": "Fri, 13 Feb 2026 20:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOQWZTUktjMzltT1BOSVNsd2Z0X29BempuOWhyZWxpR3BsRk95NWZEUlA4R2o1NWhUbzVyRnlfTHUyOTJpM3BfT2p5cTN2WDBjbUlaMDVIVS0xQXlXOXE5dGd0UVQyOGR2cm9SZk9rZ25JN1dOenVZc1dRekJWdHVpSjJodExVS0VmNWQ0b3RGU29vSVZoakt3NmdPMnMwSUhLTERCYTlGWWRHU19nQjNRVzRydWw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Ohio vs Miami (OH) Predictions, Start Time, Odds: NCAAB Picks for Friday, February 13 - Action Network",
    "description": "Ohio vs Miami (OH) Predictions, Start Time, Odds: NCAAB Picks for Friday, February 13  Action NetworkMiami (Ohio) moves to 25-0, remains lone unbeaten D-I team  ESPNCollege basketball rankings: Regardless of schedule, Miami (Ohio)'s undefeated record worth or respect  CBS SportsMiami (Ohio) moves to 25-0 with lopsided win over Ohio  WLWTMiami RedHawks remain undefeated ahead of nationally televised matchup  WCPO 9 News",
    "published date": "Fri, 13 Feb 2026 21:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOTGxTSWJxTHVBRktZUUhfdTJlWm1BNWNYTXZxYjZnSnVhVHRCYlBFa1k2X016NE43N1lhTm5kY1FVOGh5bTdaYnlzaUNnaTRuemoxZnZvR1haNFZFRG8wLWFmV0VZVnNyaG14NExTdjNUNlh0aDNKLWNtZ0Z6UjJHVmllZGtUcXphY3FUWS1aMkxCSmlDRDFSd3VEbVpaT1hBdnRReF9kN0pJeWRxM245SjdsdXNZLU9DR3BPNmR2d1lINjc3aHVmbER3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.actionnetwork.com",
      "title": "Action Network"
    }
  },
  {
    "title": "WR Parker Kingston no longer at BYU after rape charge - ESPN",
    "description": "WR Parker Kingston no longer at BYU after rape charge  ESPNBYU expels receiver Parker Kingston days after arrest on felony rape charge  The New York TimesBYU wide receiver no longer with football team after rape charges  KSL NewsBYU campus police assisted in investigation that led to Parker Kingston's arrest  KUTVParker Kingston Granted Bail, Must Wear Ankle Monitor  KSL Sports",
    "published date": "Sat, 14 Feb 2026 05:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPeVFKQlJZNk5Hak8xQ1I5b3FUX0dVbTFKUjE0THNwOU9MQjZzaVNLUUdJMkhEVnRCNHF4SDE5TGNaOW94WDhobEpnTDdGeFVmd2pZaUJfTjA0R1pHUlY3UXhkVldrMGpJblRPRzNyMFd3REktR3NnX1A5ejluQndJckFpbjRidHZ4OF9EN2thQnZ1bVRWS3lpUmhkTXdOeEgta2Y0NkZyNzBGQTJQSk1iT19RMjJvSWpxbkszSXM5bG5lV2I2X1RNVWIzWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Diamondbacks To Re-Sign Zac Gallen - MLB Trade Rumors",
    "description": "Diamondbacks To Re-Sign Zac Gallen  MLB Trade RumorsSource: D-backs, Zac Gallen reach agreement on 1-year deal  ESPNGallen returning to D-backs on 1-year deal (sources)  MLB.comZac Gallen returning to Diamondbacks on free agent deal  Arizona SportsMLB free agency: Zac Gallen returns to D-backs on 1-year, $22 million deal  Yahoo Sports",
    "published date": "Sat, 14 Feb 2026 04:14:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ZR2lMaEFVNzliLW9SQmFxaWFEVU9EM0dfS2QxRzNhRW40MnRESnRSTWZBRUVUQjNYS1Y4cC1TQkwyNEhSZ3JOMml1bGtkeDg3R3lfY0I0T2tCNXJYZmtEUUdjTml0eXljYnhYcUtkRDQxdktHdHFXVGZxX1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Andersen won't start for Denmark against U.S. in Olympic preliminary round - NHL.com",
    "description": "Andersen won't start for Denmark against U.S. in Olympic preliminary round  NHL.comUnited States vs. Denmark odds, prediction: 2026 Winter Olympics men's ice hockey best bets from proven expert  SportsLine2026 Olympics Game Preview and Gamethread #2: USA v. Denmark  Yahoo SportsUSA Olympic men's hockey schedule, game time, channel vs Denmark  Detroit Free PressOlympic men's hockey scores, live updates: Schedule, where to watch  USA Today",
    "published date": "Fri, 13 Feb 2026 17:02:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOLW14blR6RmsyRVkwZ21kUDQwS1A1dGs0S09ZeWlVMVAtSkFmbUpSeUZTcG9EUUdwZC1HTldELXRfb3V0U3k4a3dMdGtwZ3dicDkxcFBRejI3cDI3NTlkeko0aTVkWEZXenM3VGZVRVhTMW4xSXR5Y2hWNXoxLVhhTGNvQl9idElzeHFwMEo5alNNcC1hdnpBRVNpbENKaE5pQTlPcGNLbEp6ZjdJSU5FTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks - NASCAR.com",
    "description": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks  NASCAR.comWhat to Watch: Prestige, history for the taking in Daytona 500  NASCAR.com2026 Daytona 500 predictions, odds, date, time: NASCAR model that nailed 11 winners reveals leaderboard picks  CBS Sports2026 Daytona 500 preview: Your cheat sheet to the Great American Race  ESPNTiming Out Showers and Strong Winds with Impact Weather Expected For the Daytona 500 | February 13th  WESH",
    "published date": "Sat, 14 Feb 2026 00:12:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxORUhkVWQ2czZMdXVObnJlbExuNUpFWVU3UU5VMmtadUZnTU1CY2xBa2tpTklPT2hsbURZVE5ocnM4ejY2bmNHNzVRXy1UVmQ1OUNVaUN2QWEzSzBIQnhZS3NHMDhCS3pEMlRpWGFBVDFFa1dGMTdueVRvVkg0bUNMN1ZPVU92bnBOMEUzN0JrYTQ1Mnd0eXd6dkNwd2pKYVlkQ2k0NE44RnNXb2prbFFTbzkycw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Raiders announce Mike McCoy as their assistant head coach - NBC Sports",
    "description": "Raiders announce Mike McCoy as their assistant head coach  NBC Sports2026 NFL coaching news: Raiders hire Klint Kubiak; Jim Schwartz resigns as Browns defensive coordinator  Yahoo SportsNFL news roundup: Raiders hiring Mike McCoy as assistant head coach on Klint Kubiak's staff  NFL.comMike McCoy could be good for Raiders, Fernando Mendoza  Raiders WireMike McCoy named Assistant Head Coach  Raiders.com",
    "published date": "Sat, 14 Feb 2026 03:45:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNRU8zbkRLMWtxZ1BsT0hPWHk0a1RXVnFWYk5pUDIwREVjX0VnR3o3UzRyWWEzX1lkQ3NNZUNGTmRZUFRrcWlaZ093TFhIVTFUR1NnbDkwemJtQ1RCRndRdndQZDlSckpHeHZVRm9MaDBiQlFTcXJlWUFONzMyMnlJaGVqZTJFdVF2V2JDYUhaclpXakUzNm5zUFBkb0FLT0liQzBEY2pVLTdNOW1VblZjOXk3LWJNNGtYeFA4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Chris Sale on his future with Braves, won’t challenge via ABS - Battery Power",
    "description": "Chris Sale on his future with Braves, won’t challenge via ABS  Battery PowerChallenge balls and strikes? 9-time All-Star Sale says he'll 'never' do it  MLB.comBraves' Chris Sale has no intention of using ABS system: 'I’m not an umpire. That’s their job.'  Yahoo SportsMLB unveils ABS challenge system guidelines for 2026 season  ESPNWhy Giants’ elite catcher Patrick Bailey is embracing MLB’s new strike zone challenge system  San Francisco Chronicle",
    "published date": "Sat, 14 Feb 2026 01:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPZ0w3Mi1DbTAxZjd2R2J4Tkx4XzlyWWNkbW5ybF9vam0yNDVtbjZrY1gtOHl2VnZEbEFpV3A2eHBVSlNsQ1pjSTZ6QTg2RHhsLXYyZ0RDUFdMSUx6QlY5S25LdWwxTXA5bko2TmZoUUNocVNBb2lMLURKM29qY3FDRGNBWC1LX1NjOUJ5cWdoeDRzc0hnRExWblJhM0ZIQTdFNVZodjRRdzZvZklLNnZtTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.batterypower.com",
      "title": "Battery Power"
    }
  },
  {
    "title": "Czech speedskater Metodej Jilek wins the Olympic 10,000 gold at age 19 after a silver in the 5,000 - Yahoo Sports",
    "description": "Czech speedskater Metodej Jilek wins the Olympic 10,000 gold at age 19 after a silver in the 5,000  Yahoo SportsView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 13:01:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNRjYxYUhtMk9BSjlvX1laNWp0Y2tVell5M29DdGZFYW4tVktMaV9TS2lISzg2bzQzblFZOWRzRUR6aDJGanR4bmgwTjF5VlR2QU0tZG9POVVKUHIyQk1GbTVFS0J1QjJ3THY1ZzlUU29nMER0RFliTzRkWlh2Nnp3Z1gwU0YyWnpZM1VkZGhjaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Giardi: NFL Notebook - Where will the Patriots turn at defensive coordinator? Plus, could Crosby find his way to Foxboro? - Boston Sports Journal",
    "description": "Giardi: NFL Notebook - Where will the Patriots turn at defensive coordinator? Plus, could Crosby find his way to Foxboro?  Boston Sports JournalPatriots to move DC Williams to new role, source says  ESPNPatriots defensive coordinator Terrell Williams being moved to high-ranking role; DC spot now open  NFL.com2026 Patriots offseason moves: Tracking free agent signings, exits and more  NBC Sports BostonPatriots Insider Floats Mike Vrabel’s ‘Longtime Friend’ As New Defensive Coordinator  NESN",
    "published date": "Fri, 13 Feb 2026 21:14:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPRDZuMDFRVUhFSVJ6MHRJZmRUUGlEQUdvaXdiMHdSU1plNUYxTXJOdGl2MmdfTl9BVV9ZN1BnLVlJRHV3ZlRnUWxuZHhGcjNOeGdYakRVRUdEY3lEeXFDYTZXUnhvb05RdHJDT1RUbFlhaWVhLTJpQXQxbkdSeHFTcG9mcFdlbW1PYlBjMy0xUGlhN1VqS2dDSU5jMFR6bmVfSlUyZFFnWnNoSUFYRUZtbVlkX0pfR3hrNE5LdFZTajZhSmd6X190TUtIZFhHNTBQalBqSkZNWk9QRExWMkNnVzEzUGtaMmVQaGlMU05ERE56cXJ6LUhv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bostonsportsjournal.com",
      "title": "Boston Sports Journal"
    }
  },
  {
    "title": "Utah Jazz fined for 'compromising integrity' of NBA by benching healthy players - BBC",
    "description": "Utah Jazz fined for 'compromising integrity' of NBA by benching healthy players  BBCNBA fines Jazz, Pacers, says integrity can't be compromised  ESPNIs the NBA's response enough to curb its tanking epidemic?  Yahoo SportsThe Easiest Way (that you’ve never heard of) to Fix the NBA’s Tanking Problem  Blazer's EdgeInside the NBA’s Tankonomics  Puck",
    "published date": "Fri, 13 Feb 2026 08:20:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5OOEIwMU1hSU9uLWxVeDhDbXprMks5cTVpRGQ1OXROcC16ODVWbGJCZktvS2l2dE53c1JKWHhKeEpTYndVU00tWTFJYVBobUR2U3RsOHpiS21sVi1BNmJhMTZMcmxIYTF4UUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Video highlights: Ilia Malinin, U.S. hockey and more Friday at 2026 Winter Olympics - Gulf Coast News and Weather",
    "description": "Video highlights: Ilia Malinin, U.S. hockey and more Friday at 2026 Winter Olympics  Gulf Coast News and Weather2026 Winter Olympics: Follow live updates from Milan Cortina  ESPN2026 Winter Olympics: Ilia Malinin stumbles and misses the podium  NBC NewsBest Olympic photos from Day 6  ReutersEverything that happened on Day 7 at the Milan Cortina Winter Olympics 2026  The New York Times",
    "published date": "Sat, 14 Feb 2026 02:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPN21QTzU1NF8tT0JNaTVjTG8zS01EU1B1ZU1ocDBMazFpWS15amhmZmdlamlwY1FzWWJ2a1pjOVF1dEphUkd1NjhyR0M3ekhKOXdfTHI4MHpoQ0tJQk5xMkZfVktvcUdrSzNIRmZvOWY4b25RR1RjTURQclJNc0lLUUl0bzZzekV2enVhc2VvUHZxMl8tVVlCQk9mTi01VVZUNGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gulfcoastnewsnow.com",
      "title": "Gulf Coast News and Weather"
    }
  },
  {
    "title": "U.S. women's curling team slides to victory over Canada in an Olympic first - CBS News",
    "description": "U.S. women's curling team slides to victory over Canada in an Olympic first  CBS NewsUSA women's curling team defeats Canada for first time  NBC OlympicsOlympic curling takeaways: Team Homan must perform better to avoid more upsets  SportsnetU.S. Curling Gets First Ever Win Against Canada  Sports IllustratedSweden on two wins after day one at Olympic Winter Games  World Curling",
    "published date": "Sat, 14 Feb 2026 02:06:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBsaF9Ock1tRFk1V3ZhOTNVcGxqQXNyWFdrbEw3cVVETW1aM3djV2N0bzNyMFZ4QkhoV21UZS1vWUxlS1JkZWNTeDVLczI1RkVqR2ZMU0M5bUdyR3VhcTlOWDgxMUFuVWg5UXg4R25iOUdSbkJzeE1pM1ctNlVtYUXSAYQBQVVfeXFMTlo3by1NUnlGZlNiSnU0ZGZucl95WGpVMjB3S2FnUjk4dWJDOTVISGlGT0VjRTFteTJTcWlESWppMFBUcGtRLVNUNE0tLUoxbnUzclJ6NVpUQ3JrSGstanpaRW1LS084cWh4alNuRTdFby1TQnNyNnF6eEZDZ01fZnBpajd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "ACC finalizes which teams will play 8 league games from 2026-32 - On3",
    "description": "ACC finalizes which teams will play 8 league games from 2026-32  On3Clemson’s 2026 Season Set to Start In Charlotte at ACC Football Kickoff Event  Sports IllustratedMustangs To Attend ACC Kickoff On July 17  SMU AthleticsACC may have solved Clemson football’s Power 4 scheduling overload. At least for a few years.  Post and CourierPitt Slated for Day 3 Appearance at 2026 ACC Football Kickoff  pittsburghpanthers.com",
    "published date": "Sat, 14 Feb 2026 08:03:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPYVBhU0FVd3BqYXEzN09ycm9VUWt0b214Sy1odnEwcGd3S1ZZRDJ5YWtQa2hNbkRxYVlYdHZ0RldBNl81ckZpTmFjQ2NOT1JpU2R2NmdzdVJEQ1pzUVo1OFY0TnZiU3hKS3M0T2x2cUo5NEQ5NXM5aHNUcWpSRG9ZOGoyenhhWGtFNW0weFJITFRMenc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "10 boom-or-bust players in the 2026 NFL Draft - PFF",
    "description": "10 boom-or-bust players in the 2026 NFL Draft  PFFDan Parr 2026 NFL mock draft 1.0: Jets trade back into Round 1 for QB; Commanders go RB  NFL.com2026 NFL mock draft: Yates' first-round pick predictions  ESPN2026 NFL Mock Draft: Will Fernando Mendoza Be Lone QB Selected In First Round?  FOX Sports2026 NFL mock draft: Projecting all 32 first-round picks after Seahawks' Super Bowl win  CBS Sports",
    "published date": "Fri, 13 Feb 2026 10:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNbVc3SmFWd0xFbXZpVTJkNGtFSzRZNDZIeDdYMGhPYmhLY2dpc192Mk4yYkZ5VWd3M1VYZ01CWnFfbzd4cDBfVmx5UWNfUEhRYkV0MDNtR0IyODIwRnNFdU95c1o1eXJ5RmN6dGVwSmhKZDRwdDBJVnNmNFA5aFVJOXVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pff.com",
      "title": "PFF"
    }
  },
  {
    "title": "Trump just pardoned 5 former NFL stars, and one of them played for the Buffalo Bills - Syracuse.com",
    "description": "Trump just pardoned 5 former NFL stars, and one of them played for the Buffalo Bills  Syracuse.comEx-Dallas Cowboys star Nate Newton has a message for Donald Trump after pardon  Yahoo SportsTrump Pardons Klecko, Jamal Lewis and Other Former N.F.L. Players  The New York TimesNate Newton 'truly blessed' to receive pardon from President Trump  Dallas Cowboys | Official Site of the Dallas CowboysTrump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking  NPR",
    "published date": "Fri, 13 Feb 2026 20:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNYnpiOXBobzJmZFAxY0VyR3EyRTMxSlZWUWZmbUFWRnRsSVVGdmhPOUtDMnhacFdRRmxJaTBCX3Yyam5nNk04UHNLOFZtYzZXMWNRTFp4NTc0aVlNc3NZLTlSX3dfcVo0QlFma1IySm1uNUgwa3BRMUYwYWxKOEs0bTRqNlE4VFFVQXJBSGdNNkRtcHVYaXg2VUg5amNwYXJiNjRjdFpCVl9xcUdoOGtwWkV0ZnI3TFJkaG5Eb0NGT1hiOG9fa3Z2NUhoQUYyZ25J0gHkAUFVX3lxTFBocHJOaEtTTVQ3bjktcFl3ZjA2VzdEazJyTXlsZjYxNlhJUW4tQTl2UTV0UXNtcHNONDNiM0VvMjZ0bUpxRC13azR4Ul9sQUZtcllTaVhOb0xZenVHZkhZQi1KdktXdEg5Q0FWZHJtMDBHek56aktaWHJiNlNmN0lhYURFbnVqTlVySENRQlR4VU5JLVBVLUFqejRVcTllcmxRdmRNOXVNWmx1WklDenhLX1ptZU1FRG14VHVJWHJmNlo3MEF2OUZLSzZnWjM5MjcwUzFITmQ0YkZpMFZNbWlFZXRTUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "Syracuse.com"
    }
  },
  {
    "title": "How to watch No. 22 BYU face Colorado - Deseret News",
    "description": "How to watch No. 22 BYU face Colorado  Deseret NewsBYU will retire Jimmer Fredette's No. 32 jersey at halftime of Saturday's Big 12 matchup with Colorado  Deseret NewsColorado visits No. 22 BYU after Dybantsa's 36-point game  FOX SportsHow to watch no. 22 BYU Basketball vs. Colorado  Yahoo SportsHow to watch Colorado Buffaloes: Live stream info, TV channel, game time | Feb. 14  Buffaloes Wire",
    "published date": "Fri, 13 Feb 2026 18:57:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWDdkYnZJS0xIeWM0TWNTVG1NSlJJdzRPRU1UaDMydVlvckdfUy1ZN0FxaE02TVNXMld0RjRaYkF6S05feXk1RUlyWC1YRnY1bWU4b3VGdWZSWWpFRkVHY04zdFZ0RmYzeWdwTllBaHVXSnhZc3hYOEc0Qzd3Z2ZRRjVDdjY1UWRfWmhSQWpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.deseret.com",
      "title": "Deseret News"
    }
  },
  {
    "title": "JD Vance Slammed For Controversial Olympics Take — And People Keep Calling Out This 1 Issue - HuffPost",
    "description": "JD Vance Slammed For Controversial Olympics Take — And People Keep Calling Out This 1 Issue  HuffPostChloe Kim, Eileen Gu speak out after President Trump calls an Olympian ‘a loser’ - The Athletic  The New York TimesSnowboarder Chloe Kim expresses support for teammate Trump called 'a real loser'  NBC NewsAs Winter Olympics begin in Italy, some Team USA athletes speak out about politics at home  CBS NewsUS Olympians speaking up about politics at home face online backlash — including from Trump  AP News",
    "published date": "Fri, 13 Feb 2026 22:32:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQZFFUUTdwTlhZM2s1eHZFRWZuelh5anplRG1HaWl5eUw0M3BhWkJsb0RwSEgtTjdaUUZsSHpwc3pUVjN5T1BKbFEtRjRwRGRYbzQ5SVpta0JsaGQwc1R5cWVaTEI3SjE5MzM1YTRvR3VSdnFWYzVWT3hjeHdhVjBOWUM3cEtzN19OaUl5Y0Z4aThqYVnSAZgBQVVfeXFMUDgtal9fVEo1bnlRcXlRdDhtSUdHcXczSTJTTlVIUk96TzdXLXE1QWVKc2JkRnZnTnhGVFQtQ1pEXzNrTEN5YjZCX0dUd2U2UXJtUkdENHh2VVgtXzZsRFlKX2xFVV9YeWJGdWtrMWI4ai00eHJYUGZ0NHVxekdQTWJtMDJ1NU1kWXZIeUExVF9TUnplZGpjMzk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "There’s one common theme of agony for Team USA at these Olympics - New York Post",
    "description": "There’s one common theme of agony for Team USA at these Olympics  New York PostView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 02:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNS1JpTGsxVkpaZHYwaktFWHR4ejNQMm8yTkFBNlVOeG1QNDRYU1dTT0hoRE14V1NrdjdRb0hpYnY5OGFlNDJ2M1VRb29IdUxpYkFHbE5DYzJ1OVNlRzJxeHd2U0xQOVd6enBtaThRZDhhbkZudWpaUVpkTVo4dEJNVXJHZjVLUnFwdUNNYVFrSVB2eTJUelpGYlRCRUxpQlI3NWtB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Peacock Strikes Gold With Outsized Olympics, Super Bowl Audiences - The Hollywood Reporter",
    "description": "Peacock Strikes Gold With Outsized Olympics, Super Bowl Audiences  The Hollywood ReporterWinter Olympics Opens With a Monumental Tribute to Leonardo da Vinci  Artnet NewsIn Milan, Olympics fever arrives fashionably late  The Washington Post‘Are You Feeling the Vibe?’ At Italy’s Spread-Out Olympics, It Depends.  The New York Times200+ MILLION AMERICANS HAVE WATCHED NBCUNIVERSAL’S PRESENTATION OF “LEGENDARY FEBRUARY”  NBC Sports",
    "published date": "Fri, 13 Feb 2026 21:23:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPYU5ROVNibzJDTzRxamZTNTlUemRBa3R0bXdFbDJaS3hja3ByeGhoWTJKd2hEbTJiUkh2M1ZrcERIVFMzR29tQjljb0QxcGxGNWRHVHo0MXdsVEUwdEFiaHcySFYxSDczREVlYURVOGNQMWVxd2k2VUZPRDB0Sk5fZzZwdmFDSFpJaHRFblNQR04wOFpBQTVDZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  }
]