[
  {
    "title": "USA to face Canada for Olympic gold after overpowering Slovakia in men’s hockey - The Athletic - The New York Times",
    "description": "USA to face Canada for Olympic gold after overpowering Slovakia in men’s hockey - The Athletic  The New York TimesU.S. men's hockey routs Slovakia, into gold medal game vs. Canada  ESPNTeam USA crushes Slovakia, advances to Olympic men’s hockey gold-medal game against Canada  Boston.comWinter Olympics 2026: Team USA demolishes Slovakia, setting up epic showdown vs. Canada in gold-medal game  Yahoo SportsJack Eichel nets second U.S. goal in nine seconds in semis  NBC Olympics",
    "published date": "Fri, 20 Feb 2026 23:28:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPZG90UFNzM3Z5UWJ1clJjelNZUV93V1hpUUNZc3M5bXJQRDNJZG1MQl9IYVY1ekxNNHMtQXYxTVFFdEE4YnFCSmp0dFBEa3pwUzFnalhyOVRFdVFvV0l4bFUzOENKdnFwWHNaZWhLUEtPWkxkUEZ2eTI0b3dLdy1VLTE2MElKYUlnSDlqZllOQ2RmdW5MUVNmQ3A5eVZlcHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gold medal greats Alysa Liu and Eileen Gu face uncomfortable comparisons at Olympics - NBC News",
    "description": "Gold medal greats Alysa Liu and Eileen Gu face uncomfortable comparisons at Olympics  NBC NewsPhotos: Alysa Liu's journey from Oakland ice to Olympic gold  AxiosA carefree, joyous, gold-medal performance proves it: There’s no one in figure skating like Alysa Liu  CNNAnalysis | Why are figure skaters so nice to each other nowadays?  The Washington PostBefore Alysa Liu, Who Was the Last American to Win Gold in Women's Figure Skating at the Olympics?  NBC",
    "published date": "Fri, 20 Feb 2026 22:50:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPX3lPeWZLdmFOQWVDU3Q1S2JHQkhNRy1DaE5NdjdSdmF4d3oyZV9haHJOQUh3MmRiaEFBLXZ1cEUzSjBuLVZzZFI3bmt4MlJVQmtmQ0J1bjA1LV9MY3Z3RUFKM2xIQ0FwM1FWRkpJVmtHanhaX2cxTm8ybi1lejdfY0ZQRm9kbEdQUXlxc0FFdTRQNWZLWjliMjRYR2FibW1XbHVsd3pJWVRmTlp1WVVpT0stb0s1TWNPMlM1TXFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Olympic freeskier Hunter Hess flashes an 'L' sign, says he stands by his statement and loves the USA - AP News",
    "description": "Olympic freeskier Hunter Hess flashes an 'L' sign, says he stands by his statement and loves the USA  AP NewsHunter Hess says last two weeks ‘probably hardest’ of his life after President Trump remarks - The Athletic  The New York TimesOur Olympians Are Being Put in an Impossible Position  The AtlanticWinter Olympics 2026: Hunter Hess responds to being called a 'loser' by President Trump  Yahoo SportsAmerican Hunter Hess responds to Trump’s ‘loser’ criticism with ‘L’ gesture at Milan Cortina Olympics  Fox News",
    "published date": "Fri, 20 Feb 2026 21:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTUYxNmlMM0VnSF9HODg1dWJFaUh4dk5PUGRTcXV2bUtqRW9QWjJ0ZGx0WTlmX2tmLXBub2RzNjNtRDZBTkVHbktETllLNjlpd2pRQW9teFNvUmF1LTExRXpNTTBwR21kd0YtWFY4cnF5YUNyOGQyRWlWcXFNRkttOXJLTW9UT1l4YjBFR2lIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson - NFL.com",
    "description": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson  NFL.comNFL Draft: 2026 NFL Draft Two-Round Mock  RotoWire2026 Three-Round NFL Mock Draft: Jets pick Caleb Downs, Rams find Stafford's successor  PFFFornelli's 2026 NFL mock draft 1.0: Two first-round QBs, surprise WR1 headline class light on elite talent  CBS Sports2026 NFL Draft big board: As combine starts, a look at top 30 players list that will surely evolve from college season's midway point  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 15:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOYmVobGtIVEpnX04wZWtZeTRKMUk3SkM5SVQzcGd6VXc4clV6dU51dmgwa1RBVkFBZkVfWnozdEVEMl9HYnYtMVhBRUVmZTEwYnRQSmgtZmFaWHQ4MFMzd09VbXh6dGJfeFNzdlB4QWMyRzBLbUowdHRnTXU0NHBCM3RtTDBJemFEOGoxR3JkYy1WYVZJdHAxSExZRnk3SWdzTk5jYmpHa1ZBbGNqNFZxRTVrNnd1T1NiYVI2UFFNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Norway wins its 17th gold medal, breaking record for most golds won in a single Winter Olympics - AP News",
    "description": "Norway wins its 17th gold medal, breaking record for most golds won in a single Winter Olympics  AP NewsNorway wins 17th gold medal, setting Winter Olympics record  ESPNOlympic medals today: What's the 2026 medal count after Feb. 20 events?  USA TodayNorway’s dominance at Winter Games based on tradition, depth and development  AP NewsWinter Olympics 2026: Norway sets record with 17th gold medal as it continues to dominate competition  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 17:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNNnJHcGJaTnJ0dXplLVMzN3Z0ZXhUY3ZJTmc5eWw3Y0NyTHY1SG1MYnJOb2Zra3RYdzRmdHk5eFQzbHdDYm9SQUpBRW50U29jcXNHak5RVXVoMXpDdUFraDUwel9ybFBZMXdDd0hISmM0Z28tMVM4cURBaUNvSTdOU0VEbFY3WlFNWU12aDhVTHB6RzRtU0RfUEUwSFBpT1VSU2pwbEdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Conor Benn leaves Matchroom, Eddie Hearn to sign with Zuffa Boxing - MMA Fighting",
    "description": "Conor Benn leaves Matchroom, Eddie Hearn to sign with Zuffa Boxing  MMA FightingBritish star Conor Benn inks promotional deal with Zuffa Boxing  ESPNConor Benn leaves Eddie Hearn's Matchroom to join Dana White's Zuffa Boxing  BBCConor Benn signs to Dana White and Zuffa Boxing for 'legacy fights' after splitting from Eddie Hearn's Matchroom  Sky SportsEddie Hearn reacts to Conor Benn’s defection from Matchroom: ‘I misjudged the character’  The Independent",
    "published date": "Fri, 20 Feb 2026 21:39:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOOTk5eGJ1NjhGM1RzYnkxTE1jSzBKdzdCcWxQVVZ5djJTYWhfcTlyTmp4aG9NZnYxakJCMmlSelRteURIVFpRSFFYLUFUbmlOX2FacTZfdVdJRlAxM0lFMV9KTTB0NkJBd1RVREEyOU1reGU1M0p0Nmp3NlF3Ump1dUJYYU53QzJqMWFva1VyOXVfdXpLbFZ3NGl0X1BGQnBvVkxzdUZCYXFlRHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "Mother McAuley Grad Abbey Murphy Wins Gold At Olympics With USA Hockey - Block Club Chicago",
    "description": "Mother McAuley Grad Abbey Murphy Wins Gold At Olympics With USA Hockey  Block Club ChicagoMegan Keller's OT goal lifts U.S. past Canada for Olympic gold  ESPNStill Country For Old Women  DefectorTeam USA writes another chapter in its hockey rivalry with Canada. It’s one they’ll want to read again  CNNTeam USA women's hockey talks impact of winning gold  NBC Olympics",
    "published date": "Thu, 19 Feb 2026 22:03:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdm9VQ3FaZ1N0UXhOOWVrYXVDTGI5OFhiUU1pdkxWVXNhTFhjOWdDV01FWTdZVDJQLWtZZXNMNFRvZE1rUVNhUDBYT2VjVWl4OS0zXzZXTjdfV0p1TWNTTUhIdGc1N2NSQWl1eFJsU2tIRERaTnhjS1d6ZTVJRW5kT0FtaWlKdXhqLXZRRGNrNktXYi1qUXlGWkVqYkZzR3llN3NrbHItc1JyTDNxMWdPdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://blockclubchicago.org",
      "title": "Block Club Chicago"
    }
  },
  {
    "title": "Mayweather to unretire, resume boxing after Tyson exhibition - ESPN",
    "description": "Mayweather to unretire, resume boxing after Tyson exhibition  ESPNFloyd Mayweather, 48, announces return to pro boxing after Mike Tyson exhibition, will put 50-0 record on the line  Yahoo SportsFloyd Mayweather plans to end boxing retirement, return to pro fights after Mike Tyson exhibition  CBS SportsFloyd Mayweather returning to boxing. Could he fight Manny Pacquiao?  USA TodayFloyd Mayweather coming out of retirement to return to professional boxing after exhibition fight with Mike Tyson in April  Sky Sports",
    "published date": "Fri, 20 Feb 2026 22:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOTE0xd3ROSUZwdlJOSjlwSUpscXBydUlBdEc5bWNudEh3N1pMRTR4a0RaRkVwYXhtN3RjelF4OG01cV9idW96REMybmVMbG1CS0pvR3RlZWNPZk1rNHBxanNGMW5VbWY1WWt3YnhWMGI4dXRVck5XdTZWVmp0bS1HTFlSMEFfQ1Bjd2xrYjA1OXg1U3ZzaFptb3l1N3k2aEFqRFJj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Alex Ferreira wins halfpipe gold to complete Olympic medal set - NBC News",
    "description": "Alex Ferreira wins halfpipe gold to complete Olympic medal set  NBC NewsUS skier’s quest for Olympic gold comes to a crushing halt after terrifying crash  Fox NewsAmerican freestyle skier Ferreira wins Olympic halfpipe gold  ESPNWinter Olympics 2026: Alex Ferreira's long wait ends in Olympic gold — 'I am greatness, and this is my moment'  Yahoo SportsOlympics recap: U.S. men win hockey semis; Alex Ferreira takes halfpipe gold  NBC Bay Area",
    "published date": "Fri, 20 Feb 2026 22:26:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNaDhZT1MteUNKVm1XcGluaDBGUlFHM1ZHckNTZWxheWJBX2dvWTk3dkYwcWs5aXpmR2VFcC1OWkdneVQwT0wwRkYxSlQtbUtDbFRlc3NiT2M3SFpaekNiU2R4NkhCazFzdFlrX3RVLWJXRXhPQ2RBTzF4WFRfLXQ2REF5LXcweDlkSHMwazMyZUxBc3VRTGF5cWlGUFNCemtmdGpIcmp6SFdmcEZ0X1hr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Andy Reid breaks silence on Kelce, Rice case and Tyreek talk - Arrowhead Addict",
    "description": "Andy Reid breaks silence on Kelce, Rice case and Tyreek talk  Arrowhead AddictChiefs' Reid offers positive update on talks with star TE Kelce  ESPNAndy Reid: Chiefs have had talks with Travis Kelce; 'nothing happening' with free agent Tyreek Hill  NFL.comAndy Reid Addresses Travis Kelce's Retirement Plans as Chiefs Offseason Is Underway  People.comAndy Reid says there’s “communication” with Travis Kelce on a new deal  NBC Sports",
    "published date": "Fri, 20 Feb 2026 18:37:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaEROU0NndlZLei1OUk13VUVhaGo2SV9EYVdpR2ZxM0I0a0ZrMGNqOWN1akItZnBvOE9tOHRMLXBicEdfalh5QzFBY05FNThSb2NKNjdQa0tWT1o3ZjVyMld3a3hyaDJSZXk3ZHZvMk1UZTQwZTYtemE0S3hiTlNFclBPQ0FtUlJpZEMxaE9mQk9kdzZydEdSVzI0b2N2RG5BdlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arrowheadaddict.com",
      "title": "Arrowhead Addict"
    }
  },
  {
    "title": "What we learned from Day 3 of the second Bahrain test - Formula 1",
    "description": "What we learned from Day 3 of the second Bahrain test  Formula 1F1 testing: Ferrari impress as Charles Leclerc goes quickest in Bahrain  ESPNTeam by team: How Bahrain's double pre-season test went for the F1 2026 field  Motorsport.comLong-run analysis: Piastri wins 'race', Audi surprises  The RaceWhat the new order looks like after 2026 F1 pre-season testing  Autosport",
    "published date": "Fri, 20 Feb 2026 19:53:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQaHdkUWN6Q2YxWDFrMkxqOXBrZk1jcEVUWXlBNVFFc1BTbTV4c24wVy05bzZDeWVkMUdWUTd5a3lTbjhlYi1tZjZTOG1pc3ZQaHJEcGl0WlpwRVg2MFFnWExuRF9QbUZrNWNZem8wbVVvaFFjTGpJbFRZQ1VWREpmeWlXVHV5V0tVenFNYzFqYlB5ZEszUFRfR2pEemdCTmZyTGtzZWJCUUk4QjVVM3FYUmlIV1dDSnpkaDlmSjNvdmdnTE1Nc3pGenhEUUQ0dWlsbFl0cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "Women's Curling Semifinals: USA to play for bronze after loss to Switzerland; Swiss to face Sweden in gold medal game - NBC Olympics",
    "description": "Women's Curling Semifinals: USA to play for bronze after loss to Switzerland; Swiss to face Sweden in gold medal game  NBC OlympicsTabitha Peterson, U.S. women reach Olympic curling semifinals  ESPNWinter Olympics 2026: Team USA women's curling advances to semifinals after clutch hammer by Tabitha Peterson in extra end  Yahoo SportsWatch: U.S. women's curling will play for bronze after semifinal loss  WYFF News 4Winter Olympics 2026, women’s team curling semi-finals: Canada, United States, Sweden and Switzerland prepare for showdown – full schedule, how to watch live  Milano Cortina 2026",
    "published date": "Fri, 20 Feb 2026 16:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPTF81TXhld2hRRXdmZlFKTEU1WTM5NnNVeFRXV0tFQlhhMmFfNndLUjlBUjc3anJ4amMwM3J4aXZfYW5zRzhjdy1RSi1wa0pNcXN5NFk2YUFLS2N6MEZTZy1PbEVzXzViczJpU3JfM20zVUtTMW12a2RYaVRONnpqQXFOMW9mSjZpcGxpeXNVVVgxbDEyallITFRmUUhrMHhuX052aW4xNnBWUzBIYzAxdW1TV1JQd21GRUpYNUR4OFlOcUpl?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "Top-ranked Canada heartbroken after upset loss to Sweden in women's curling at the Olympics - AP News",
    "description": "Top-ranked Canada heartbroken after upset loss to Sweden in women's curling at the Olympics  AP NewsTop-ranked Canada, U.S. fall in women's Olympic curling semis  ESPN'They're heartbroken': Team Rachel Homan out of Olympic gold-medal curling game with loss to Sweden  National PostWinter Olympics 2026 women’s team curling: Canada bag back-to-back wins; United States fall to Italy  Milano Cortina 2026Recap: Canada's Homan loses to Sweden's Hasselborg in Olympic curling semifinal  Sportsnet",
    "published date": "Fri, 20 Feb 2026 20:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNMkNSWk5tY2lsMmdwQWdTeXhpRWp2cFpfUkFJOTlpUzJWSGlVcjlZSjN0QXQxMnhvOHhyVW5hQjYtN2doZU14STN5QkxpYnRWLWo2djdEalJUMWhIeEd1U1BvU0JubkN3aVIwNmlLekdTb1RhTGJRV2RGN0lic1hXYU5iWDlxS0JaR2xMVVJmQWMwNGlq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Winter Olympics 2026: Polish speedskater Kamila Sellier hospitalized after suffering blade cut to her face - Yahoo Sports",
    "description": "Winter Olympics 2026: Polish speedskater Kamila Sellier hospitalized after suffering blade cut to her face  Yahoo SportsBlade slices over Sellier's eye in Olympic speedskating 1500  ESPNCT native Kristen Santos-Griswold disqualified in Olympic 1500 skate, Sellier stretchered from ice  CT InsiderKamila Sellier injury update after skate cuts face during Olympics  USA TodayPolish Speedskater Stretchered Out of Olympic Race After Opponent's Blade Slices Below Her Eye  People.com",
    "published date": "Fri, 20 Feb 2026 20:58:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNa0swOU9BLV9mTEJ3dDJxUnVWR1phcE5sekZ5N0NPYnBUMHlIVFlZaTZXWXcwb2VFeUJvOFA5X05WVG9aZ3Y0S0h2dFVLTVVGLXJpLVU4dkJhUXhSZlBCclhteVJrOG5GU0dZeXBVWGxBXzRkUHpvWnB5R1hWV0RkTGZKT3JBNTludVNoLXF5SS1yY1dwdG1TT3ZRQzVIUmpRQkk3Qk1KMUdyUzR0WlRqMFRZU1NNaDYzQ0FnTzZUVkxOR3I2TU0zcDBiSV9xem9raVNvanRWSDgyWFdJX0xkdXZ5RFk0T0VteXhya3c1VnU4VjF2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Pablo López To Undergo Tommy John Surgery - MLB Trade Rumors",
    "description": "Pablo López To Undergo Tommy John Surgery  MLB Trade RumorsTwins ace Pablo López set for season-ending Tommy John surgery  ESPNWhat now? Here's what López injury means for Twins  MLB.comTwins' Pablo Lopez out for 2026 after Tommy John surgery, which could lead to more trade rumors in Minnesota  CBS SportsTwins’ Pablo López to undergo Tommy John surgery, will miss the season  The New York Times",
    "published date": "Fri, 20 Feb 2026 18:33:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaG5Ndk1NRWhxU1dJbTdsNUZ5Q1A4SzNFUmpubzZyWWRTbkt0bjZTSXBJUl9zSXdPaEJmZi1mUTBPTjBFMGlyYVBtMkVmSGdRSmVKeEhyYlN2UVcwQjBhNHRwV3Znenl1c1dIVWVOZnhiRTZsWXVrdUt4Qkg0RjZLRmpKT0E2UzJnN1JhYkhn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "NCAA Defeats Joey Aguilar In Eligibility Lawsuit, Tennessee QB Loses Bid For 2026 Return - OutKick",
    "description": "NCAA Defeats Joey Aguilar In Eligibility Lawsuit, Tennessee QB Loses Bid For 2026 Return  OutKickJudge denies Tennessee QB Joey Aguilar's eligibility bid  ESPNJoey Aguilar reportedly denied 2026 eligibility, what's next for Tennessee at quarterback  CBS SportsJudge denies QB Joey Aguilar’s bid another season on Rocky Top  WATE 6 On Your SideQB Joey Aguilar reportedly ineligible to play for Tennessee in 2026, will now attend NFL Combine  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 21:20:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPZ1A0LTRZOFlQdmhkU0pWUGptM1hIb2p2TTAyWkJ4eVczR0pXcUJxdEJFaEtaZkFxWWExNlBsNUp0RWxFWjNxdUE4eHcxRlNTUDRvS2ZUMEhkWDBWZlVjN3BDWE8yeWVHdmZheHU4bTA1T3lpRnYya3lnVVp3dm1Td2o2ZV9hRHdXVzdwMzlJMEZCN0RyOGdvLWRYdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.outkick.com",
      "title": "OutKick"
    }
  },
  {
    "title": "NBA may revise draft lottery to address tanking - NBC Sports",
    "description": "NBA may revise draft lottery to address tanking  NBC SportsNBA plans to enact anti-tanking rules next season, sources say  ESPNNBA Tank Score: A tanktastic power ranking of tanking teams  Yahoo SportsMark Cuban slams the NBA for focusing on tanking and ignoring the real issue for fans: ‘It should worry more about pricing fans out of games’  FortuneWho is NBA tanking good for? Lakers, 76ers among playoff hopefuls with easiest matchups down the stretch  CBS Sports",
    "published date": "Fri, 20 Feb 2026 14:08:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNWnI5dlBDYU9nLUxaYmRsNzhjUDVYWG50Q0xQS0p5anNyYlF4TkdVLTZ0OUZCbXNrc2dfLTlYbWk3bTVfTE5YRGQxSHZpNlJLeGJma3FPUjdSTVhoQzFPc3p5ZUJwM3hVWFM3MTdneVAxQ21uLU13VUNNa0JWRXc3UUlQMnNWc19FU1dlVG5uSlhEd1FtSi1RVWJURmhWVHNZd0dXZVdqYVFaMkpaLWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Coco Gauff: American beaten in epic as Elina Svitolina reaches Dubai final - BBC",
    "description": "Coco Gauff: American beaten in epic as Elina Svitolina reaches Dubai final  BBCElina Svitolina “fights like Ukraine,” wins three-hour Dubai tussle vs. Coco Gauff  Tennis.comSvitolina vs. Pegula: Everything to know about the Dubai Tennis Championship final  WTA TennisGauff wins EPIC tie-break but goes down to Svitolina  Sky Sports2026 WTA Dubai, UAE: Svitolina [9th] vs. Gauff [4th] Prediction, Odds and Match Preview  Sportsbook Wire",
    "published date": "Fri, 20 Feb 2026 20:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE1zdElNNVJQUTNuNXBkaUs3TW1sT3JWa0VoM3R3cTNYdTBuTmJhalJCdWtmU0ItWWx5Qm5EX0NZb04tbC0tdms0dnVlaUg0aGZYUFFjX1VGVXpDSktmb1VDNklPbjM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Veteran almost fails to make weight again for UFC Houston - MMA Fighting",
    "description": "Veteran almost fails to make weight again for UFC Houston  MMA FightingPhil Rowe vs. Jean-Paul Lebosnoyani prediction, odds, pick for UFC Houston  Yahoo SportsUFC Fight Night: Philip Rowe vs Jean-Paul Lebosnoyani Preview & Prediction  The Stats ZonePhil Rowe vs Jean-Paul Lebosnoyani Pick, 02/21/2026 Predictions UFC Houston Odds  Doc's SportsUFC Houston: Phil Rowe vs. Jean-Paul Lebosnoyani Predictions & Odds  BetMGM",
    "published date": "Fri, 20 Feb 2026 18:27:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZ2M1YnR5X3I3UzNaR3BNNFZrWURCWUlDWDBBNjBSQlNZMGprMWRNSnQ0UG02WS05X21hbWtVTFpXdE5zclJkWkNSTkFCTl94M3o3bkZVXzVmOFF2aDRPUkE1ejVwU2dIQjI3Z0RQeEZmWFMzTVVSRHhGQ0JZZjhQenFCUDRtWkZvdlMzQ0VRMm1JbXdndnhPR2VfVXZ0ZXJCcUprUVNHOFY1QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "The latest on KU hoops and the Darryn Peterson situation: Kansas Jayhawks Q&A - Kansas City Star",
    "description": "The latest on KU hoops and the Darryn Peterson situation: Kansas Jayhawks Q&A  Kansas City StarKansas' Darryn Peterson misses most of 2nd half with cramping  ESPNBill Self responds to national criticism of Darryn Peterson  247SportsBill Self talks about how Darryn Peterson can silence critics, more  On3Kansas star Darryn Peterson asks to come out early in latest ‘disappointing’ absence in win over Oklahoma State  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 18:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPMnYzSWNKRUV3Vl9OTk5wNUE3Y0VMYThBeUlwdTg4bXR5eGZiaWFpcXJyNUNwQVRFMjQ2cVBjbkNsT2ZYTGNGZDRXTEJsQmdrd0FjWEhfc1VVVlY3NkhJOFhTRTMxVzV0aDdPR05jWmJIRV93MkpBZ1lsR0dXQ05LMlNUYm1FUEVWa2M4ZzAxREtzd3VrRXfSAZYBQVVfeXFMUFhDOHJ2NWlPR2ZkczlCdmZfM0tlWnpSbGdfYWFTLWRFTVJoMHU1aXl0U090V285WF9hQzlWTTlfVmZsS2NRY2tlWmRfblFzZ0VnYTZmcDlWWThhV0g1dDNTSUxXelNHbnU0MWtTNW1MdDZHWmt1WllyVjVmb19jSk5reU5ZOF95cVU5aEFwdXgxVy1xcFJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kansascity.com",
      "title": "Kansas City Star"
    }
  },
  {
    "title": "Lindsey Vonn Posts Health Update After Latest Surgery, Including Gnarly X-Ray - Sports Illustrated",
    "description": "Lindsey Vonn Posts Health Update After Latest Surgery, Including Gnarly X-Ray  Sports IllustratedLindsey Vonn still hospitalized, has yet another leg surgery  ESPNLindsey Vonn 'Struggling' After Her Fifth Surgery to Correct Injuries from Her Olympics Crash  People.comLindsey Vonn shares X-ray, says pain 'hard to manage' after surgery  USA TodayLindsey Vonn back in U.S., says she’s been ‘immobile’ since Olympic crash - The Athletic  The New York Times",
    "published date": "Fri, 20 Feb 2026 18:04:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM25KN1VjT2tDRG5JN2MxbkJIcWxlS1hYcDd4V0VBQ3FaZko0TzB0alBZSURHZWp6TGtJVGlPRXAzZTRFdHN6Y3h5NlU4LVRjWm91Nl9icmliSTY0dUpFcXRoM0kwQVR4Z1dIb2QwZEdTNl9ENDRlSkVKOElIdDI3d1E2aHcyT0Zl?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Steve Kerr shares eye-opening opinion of Celtics after Warriors rout - MassLive.com",
    "description": "Steve Kerr shares eye-opening opinion of Celtics after Warriors rout  MassLive.comPorzingis rusty but provides spark in 12-point Warriors debut  ESPNKristaps Porzingis makes blunt admission about Celtics after Warriors rout  Yahoo SportsCeltics vs. Warriors odds, prediction, time: 2026 NBA picks for Thursday, Feb. 19 from proven model  CBS SportsJaylen Brown’s triple-double leads Celtics past Warriors in All-Star return  Boston Herald",
    "published date": "Fri, 20 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPejdLSVQ5ZXNSTENvV2EyTGNtdEJJVHgxWFpuRTF1RXg1bnNUdERqZkFCRm83Mk8tREJ0OFN5WGNCckdGS1YyRVBvS0ctcU8xcTlIeXhlbzEzbTZUdnh5VllnTkY4d0djOHUwYlQtekoyZDdNdFpGQXNvRnNlRTkwQU5ZUHRMeGFRQWgzRE85V0U4MGUtN3Q0a3hYVi1mbjhDTExSV2Yzbk1JNm5fUDZYaFpZcULSAcgBQVVfeXFMTVFNNWczZl83dE4xT0IwcFpOVGtaLWc1Wmw4dXFBVjlVNUFNcGwyaHI3Z3MxUkM3OUQzdWZxNnB5OUpSRkc3ckxKN0l4RXFkUFlScXhWVTRHd2NlcFFlZUVaUzQwMFRCSldsZExPTUQ3S29RQnI2ZERxMk9jdW5IMWZYYlQ4a3haNnZLbDVLaHdSSkdiaDVGY1FyX1BtdkNvSFBWbGZwei1KbmJWeUplUUF5eDdJbHI3ck90cFcxd20tUWJ1aEpyZVY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.masslive.com",
      "title": "MassLive.com"
    }
  },
  {
    "title": "Mick Cronin claims he’s a good fit at UCLA: ‘I’m not the story’ - New York Post",
    "description": "Mick Cronin claims he’s a good fit at UCLA: ‘I’m not the story’  New York PostUCLA's Cronin apologizes to player for ejecting him from game  ESPNUCLA’s Mick Cronin apologizes for ejecting player, says he’s still ‘a good fit’ as coach  Los Angeles TimesUCLA coach Mick Cronin apologizes after ejecting his own player in blowout loss to Michigan State  Yahoo SportsCronin’s viral shaming of Jamerson’s foul highlights flaw in UCLA men’s basketball  Daily Bruin",
    "published date": "Fri, 20 Feb 2026 17:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUmVaWUFyM25nRTZOSlNTQS1HNVNOX2J6MURKN2dtM3ZwMFoyRDNNamcxU0ctSkpKa05NeE9YaEc1ZlVuaGdyUnBiNU5OVGJnT2d1RVVKbXpTQ0g5NGp3Q1RrYmdmRFplbXhyQ2VkNlIzZVQwbnk4RTItS29Xd1ZyWUpyWFJxWUVnWkhxY3llbUpPVlUtaHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Wes Rucker, longtime Tennessee sports journalist, dies at 43 - WBIR",
    "description": "Wes Rucker, longtime Tennessee sports journalist, dies at 43  WBIRSports reporter Wes Rucker, who covered Tennessee athletics, dies at 43  Knoxville News SentinelKnoxville Police investigating fatal I-40 crash involving 5 vehicles  WATE 6 On Your SideDriver killed in multi-vehicle crash on I-40 near Cedar Bluff Road, KPD says  WVLTLongtime Tennessee sportswriter Wes Rucker killed in car crash  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 14:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQSG1meGZRT1I2djVtMEFYSkJJVk9NVUxaSlVLbXRCZlROdnNIa0xJU2duMnNSUlNLOEtGMzhPQl9jMks3QTNYOEo5OC1xT0dzR295QlhILUFmRGdpTFFYcXhPZ2phQ19iMm9GY2h2RTIyOVBNS29ldDdaSTY4NjJFUm1DdmVYYmU2Ul9tMFhsSnNZWi1JU3o2TXF0SnJFMWRIWkRFWUJzY0JIa3FxMnA2WFVRamluTGFjcWhjSWotSXQ3QlFCNEw0YngyeDVRbnFUMlR5dGd6X2xRYjgzNmllUV93?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wbir.com",
      "title": "WBIR"
    }
  },
  {
    "title": "At halfpipe, neither US-born Olympic medal favorite competes for U.S. Eileen Gu takes the heat - AP News",
    "description": "At halfpipe, neither US-born Olympic medal favorite competes for U.S. Eileen Gu takes the heat  AP NewsOlympian Eileen Gu responds to JD Vance’s comments suggesting she should represent U.S. - The Athletic  The New York TimesOlympian Eileen Gu says she feels like a 'punching bag' amid backlash for competing with China over US  Fox NewsThe Hidden Government Funding of China’s American-Born Olympic Star  The Wall Street JournalEileen Gu responds to criticism from JD Vance, others in United States  USA Today",
    "published date": "Fri, 20 Feb 2026 17:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQSkNBVEF4TFltQ201b3JDNGRYaV92Q2E3QU82Sk9SSzRvUG9xS1lGR0xSNEhHdUM1R1Z5Qk9fZ2N3Zmg5RXBPWFJXb09mMFVrNGJTcjZCRjdtS3pUdS1YSFNaT05YSTJGWWZlaXdwY0N3NVc1VnltMjc5ODlNMXpjamh2LW9ibkwwWjJ1TlZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "2026 draft: Ten debate-worthy prospects to track at the NFL combine - NFL.com",
    "description": "2026 draft: Ten debate-worthy prospects to track at the NFL combine  NFL.com10 Prospects to Watch at the 2026 NFL Scouting Combine  Chargers.comNFL Combine Primer: Highest-graded prospects, sleepers, rankings and schedule  PFFPreviewing an offensive player from each position to watch at 2026 NFL Combine  Raiders.comMy Pre-Combine Top-50 Big Board  The McShay Report",
    "published date": "Fri, 20 Feb 2026 21:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPM0R2WFlnakZiNW5IaWV5em5wOWwwV3B0NXlVcTZ2UWZadWd1LXBNZFR2eFZUaVhOVWZ3b0Q5NVBqUFV4YWZZdm9lejRnTWI5SS03anhxaTJHVlJmTWJCQ2hfVnFFS19TZXNzZHg4UFFDSHk2eVNZWWNrVEFWZVpGRmpqOFZsWTR5R1M2U19JSDliZVo2T1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "20 Moments Of Pure Joy At The Winter Olympics Amid All The Doom And Gloom - HuffPost",
    "description": "20 Moments Of Pure Joy At The Winter Olympics Amid All The Doom And Gloom  HuffPostBy Day, Cortina D’Ampezzo Is an Olympic Hub. By Night, It’s a Party.  The New York TimesMilano Cortina Winter Olympics 2026 day 14 – in pictures  The GuardianOlympics news, live updates: U.S. handles Germany in men's hockey; Mikaela Shiffrin finishes 11th in giant slalom  Yahoo Sports Australia2026 Winter Olympics: Wednesday's top moments from Milan Cortina  ESPN",
    "published date": "Fri, 20 Feb 2026 10:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNbGh6WmoyQnhUNUlOS1prR2VrVUpUT3gtQWdOd0tkQ1Z4TXhCVkhLd0FGNXdteTRjMVJpUUVlbl85ak1GcmE4OEVwUl9FazU0WDRqN3gtUGlZSzVWdlFLM3ZDdkNySUJhX08yU1V6a0tIM3VueDBmUGw4bk1JM0ZQQkxJeWJsZ2k5YmdaTXk3QXFWQWJsSk9WN9IBngFBVV95cUxPQnBGLWdFN0VjRlBQTmoyTzVOV00wdE1wNldlUkt4S2puTFR6c0pTQllSa1VQcmlyWVpLd0t1S3Vzb3FTeTViOHhSMFN3eUQ5MEliTWhzOWphMFhBQVJfRVZ4Mzk2eVNGMmQ4NDNjUWU3QW8zT3VVSnhMVjZKakwyQkxvNGNVaXp5ck1peFNQSXJZbVI0c0E5ZGhDUGhXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Inter Miami CF Acquires International Roster Slot From New England Revolution - Inter Miami CF",
    "description": "Inter Miami CF Acquires International Roster Slot From New England Revolution  Inter Miami CFMLS 2026 season preview: Lionel Messi's Inter Miami reloads, but league faces bigger questions  Yahoo SportsThe Rondo, MLS is back edition: Do Inter Miami have a repeat locked up? Will Lionel Messi snag MVP again? Or can LAFC threaten?  Goal.comCan Anyone Stop Inter Miami?  Sports IllustratedInter Miami's wild offseason: How the MLS Cup champions leveled up  MLSsoccer.com",
    "published date": "Thu, 19 Feb 2026 21:05:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPUzZnVEl5cEFJa19HRUI2SjNLUEtlM2wyTFV3ZXE2TWd6b2xhd2dqU1lUY3loY05LQTFwbHFsOGR1Mlh3S3FZSlFPelNXXzlGUXQzRnhKVVpLU0Y0ZnZfVVkxSFBTZzBxOXA4Mk4zTG41MmUtNjdMUG12T0hUdWROQW11VU5GLWp5c21TYlhqejRVYnNUcjM4bXdSMlU5eDgxV2xmZ0JuRHpuQm9YRmtOLQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.intermiamicf.com",
      "title": "Inter Miami CF"
    }
  },
  {
    "title": "2026 Winter Olympics Friday schedule: Team USA, Canada play in separate men's hockey semifinals - Yahoo Sports",
    "description": "2026 Winter Olympics Friday schedule: Team USA, Canada play in separate men's hockey semifinals  Yahoo SportsView Full Coverage on Google News",
    "published date": "Fri, 20 Feb 2026 18:10:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxQSDBpdV9kUW95dGlCYkdHNmVKamNfR0tTUGszYUhsZHVudk85RFYwTHhNckk2b1JxLUNJUnZubWl2X19DZlFjcy1pdUFTdnRkNzNweGRCcVZvWmhDUmptTjQtbEZDMWtMdnBCVTlZOU1nX1JoaWl4X1dsb2h1eXI3dGFxUkZIRVdRcUlUUlRMLXRfV3JLdUxzbHlMeEtWZUlLNmVHaFY3bWFVT3prMDNnWnBjT0lfV0NxeTBmNUxieERZcGZ4cVZ6MTB2MkpHVGYzV2VoU3pRZnJ6bnNKSi1mazVxaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "NFL's Chicago Bears May Bolt to Pro-Growth Indiana - freebeacon.com",
    "description": "NFL's Chicago Bears May Bolt to Pro-Growth Indiana  freebeacon.comIndiana unanimously passes bill to lure Bears away from Chicago  ESPNGov. JB Pritzker suggests no matter how Indiana vs. Illinois fight goes, new Bears home won’t be in Chicago  Chicago TribuneChicago Bears news: What's next for Bears stadium plans after Indiana lawmakers make push for Hammond site? Illinois reacts  ABC7 ChicagoHammond Bears? Team says Indiana site near Wolf Lake is now its main stadium focus  Chicago Sun-Times",
    "published date": "Fri, 20 Feb 2026 02:44:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQZHdVUWx0WldfanJRU2RVS0oyTUVGcTFBU3V6UUlTVHBHeEw4M2pOZHdkLVQtMHVYWHpjNUZUdXRBLWM1dTBmcjFYeDZwY3Fiei1wbGZrdnA5UW43ZGM5ZTc3aWZkRTZFNFVkbU5vcjZYVU4tcXlRdFlCNnNBYzdibEpYZTNQX09s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://freebeacon.com",
      "title": "freebeacon.com"
    }
  },
  {
    "title": "Mikaela Shiffrin's R-Rated Victory Post Goes Viral - HuffPost",
    "description": "Mikaela Shiffrin's R-Rated Victory Post Goes Viral  HuffPostTaylor Swift Responds to Team USA's Mikaela Shiffrin Quoting Her Song Lyrics After Winning Olympic Gold  People.comTo win gold, Mikaela Shiffrin needed to hear these words  NBC NewsOlympics news, live updates: Women's figure skating final; USA vs. Canada play for hockey gold; Jordan Stolz goes for No. 3  Yahoo SportsMikaela Shiffrin exorcised her Olympic demons. Then came silence  The New York Times",
    "published date": "Thu, 19 Feb 2026 13:38:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQWRsM3gyeUJwcVJfTWx3Y2FPX01OdmdUZ3FkNllET0tlSWloRGlFZkpMazBfVEhudW00TWxHMTFpMnBQdkdkdnZ2SDRURGppMlBVMTlzYUwxTzNCN2xsSmY2Wlc1ZFl6eG0xampDRlR3N2RmX2R4cUZNd0YwczcyYVAyUjRuTnNDblNSUDVPZXdlMWJoWXNJSzBfMzXSAaIBQVVfeXFMTnZoNjFZTUYtMFNnR3IxMEJCRzVaWDNkOHc0ZGVrbXNLbWxGR3AtbEZnS3M3N2ZiS1dYUl81WllEeTF1RV9hdENUaWRrNU80anEwM3pTUHNpZ0tuR2pDTlhSM1N1YUtxQmt6LXRZVHVHVlhWaFMwVDNrZUVtMkVmU1RfR1RSR082MXZnaC1mYk1GSldlTGJQNHZYLWJnRV9ZT2xR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "IOC to investigate FIFA president Gianni Infantino over Trump hat and collaboration - The New York Times",
    "description": "IOC to investigate FIFA president Gianni Infantino over Trump hat and collaboration  The New York TimesIOC to probe FIFA president Infantino after Trump meeting  ESPNFIFA and Trump’s Board of Peace enter formal partnership aimed at Gaza regeneration  The New York TimesWar-hammered Gaza needs basics like homes, roads and power. FIFA is offering a $50M soccer stadium  AP NewsFIFA and Peace Board pledge to help Gaza reconstruction through football  Al Jazeera",
    "published date": "Fri, 20 Feb 2026 22:22:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNTUw1VzV1VWFVV256cGt6UGRwX0FDTjZ4UjJoNmxITzhtSkpUX3RKTzM4N2hRQWVkR1F3eXFjaDVnYlhrcFRNSTdRSFM4VU5za1duUHE0S0lVVHltU3RGeG1CYW5GMUpPcFNZakp5UFpnXzZiSjZ3dHVEOXgwR01sZ3ZHX3ZhMkwyazcyYUFVZDdncEdQbmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Penguins Notebook: More on Crosby; St. Ivany Update; Surprise Goalie - Pittsburgh Hockey Now",
    "description": "Penguins Notebook: More on Crosby; St. Ivany Update; Surprise Goalie  Pittsburgh Hockey NowCrosby misses Canada's Olympic hockey semifinal win over Finland  ESPNCrosby could return for Team Canada in Olympic gold medal game  NHL.comCrosby’s injury re-opens debate on NHL participation in Olympics  Yahoo SportsThe passing of the torch from Sidney Crosby to Connor McDavid has begun - The Athletic  The New York Times",
    "published date": "Thu, 19 Feb 2026 18:43:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPajRBeGdnS01xQVNqeUo2Sk1hWktycnl1ZDc2YzFsM083UkJ6ZEFKZ1BrVEtFMnkxY2dIblhFSnljRXVmY2tjYW1rcmM5OWR0Wms2WURIcHJMaHlZaVJVbE52YTZyWWd1S3F4cEt0RDB1cG1MTlZtWl9WTkxCYVpZcmlGcnc5TUFURVgwd2NB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pittsburghhockeynow.com",
      "title": "Pittsburgh Hockey Now"
    }
  },
  {
    "title": "Browns name coordinators for the 2026 coaching staff - Cleveland Browns",
    "description": "Browns name coordinators for the 2026 coaching staff  Cleveland BrownsBrowns hire former Ravens assistant Travis Switzer as offensive coordinator  NFL.comBrowns to hire Falcons’ Mike Rutenberg as defensive coordinator: Source - The Athletic  The New York TimesBrowns LB coach Jason Tarver promoted to defensive run game coordinator; DB coaches Ephraim Banda, Brandon Ly  Cleveland.comBrowns new DC Mike Rutenberg makes his first staffing decision  Browns Wire",
    "published date": "Fri, 20 Feb 2026 17:03:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaVM3RkRDZHotS2g1enlBZUJwNUkyS3JVRzFqa1hKbmE0RWtRZmJaN2gzeUxmdTduMWdCX3MyeUdPQUJUdFp5TEhQVmJLcHZZWUVkYlYwTndGUnB2WFQzbTFSTDNTeHlMa0RiT0JMdWZVcVpEcktMbDB0TEVnb1VGMFZIY2JHc2gxcFV5cV9KSXo5bUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.clevelandbrowns.com",
      "title": "Cleveland Browns"
    }
  },
  {
    "title": "Ranking college football's top 100 quarterbacks of the 2000s - ESPN",
    "description": "Ranking college football's top 100 quarterbacks of the 2000s  ESPNWhere do Cam Newton, Tua Tagovailoa, other in-state stars rank on ESPN’s top college football QBs of 2000s?  AL.comBaker Mayfield named best college football QB of the 21st-century  Yahoo SportsTwo Michigan QBs ranked among ESPN's top 100 college football QBs since 2000  Wolverines WireWhere former Tennessee Vols QB Hendon Hooker lands in ESPN’s Top 100 college QBs of the 2000s  A to Z Sports",
    "published date": "Fri, 20 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPeEk0XzhxZ21RUXIxb0dzaHJoSjFQaVVaRFFBczhfMnFtRl9sQURITG5XZHZaVFZwYzdBSUgtS1hKLXNycXg5a3g2dkRyVHJrVVhCcmhOeUEtSjRleHh4R0p0dE04Vk5nREtlZW1vQTV3OGJqYy1laDhtb0FzLXJlRzlSZzN5SHQxanlMV3JhQWFuRUdHXzNaY1RXR2doMnlPbTFuNHRZZUpZbENDYUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Sweden is refusing to let go of Canada’s alleged Olympic curling cheating - New York Post",
    "description": "Sweden is refusing to let go of Canada’s alleged Olympic curling cheating  New York PostA curling scandal rocks Olympic ice  NPRA cheating claim violated the ‘spirit of curling’ at the Olympics. The sport is moving on  AP NewsOne day later, Canada and Sweden’s Olympic curling beef is still simmering - The Athletic  The New York TimesThe Curling Controversy at the Winter Olympics Isn’t What You Think  WIRED",
    "published date": "Fri, 20 Feb 2026 22:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOQ2ZsOFZtNUUzOTN6TGh3bkpCVUR1T1JpRTlaRE1rUlRENy0zRmhwXzNMc1VodHl4NURtR2t3M0ZoNzFCYzh0dmx3S25WU1ByeHJWaVIwNFF6UEZyVHZOSEl5MmFNeWxiWHhySHJUMGZFaE5BUElBZDRTUU9yY1c3VGJnalJxSzFELU9JMjlNMzNNM0FIbTF4Sy1jemdLWUpiSHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Jordan Westburg Diagnosed With Partial UCL Tear - MLB Trade Rumors",
    "description": "Jordan Westburg Diagnosed With Partial UCL Tear  MLB Trade RumorsOrioles 3B Westburg out until at least May with elbow injury  ESPNWestburg (partial UCL tear) out for all of April; timeline TBD  MLB.comOrioles news: O’s baseball returns today  Camden ChatThe Opener: Spring Training, Westburg, Rays  MLB Trade Rumors",
    "published date": "Fri, 20 Feb 2026 15:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPSjVKYi14SVQ2NGE2eENSZ0RYeVhOdTQtZVJPR0JGcGZmYVFQdEdaek9jamdsS3VmOU5CQWsySlRSV0t3VnVZMDZNYlN6c2REVW1leXZpWWRCdnJhc0M5ZWJpM3BoQWpEdzdGeWg2VHBBTmlrMjNpUGhLSDZ5YkUySW4taHBrc0FIMmFnbUlEaWhuZW40ME4yQjlhcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Mike LaFleur: Late start in building Cardinals’ staff may turn out to be a good thing - NBC Sports",
    "description": "Mike LaFleur: Late start in building Cardinals’ staff may turn out to be a good thing  NBC SportsCardinals round out coaching staff under head coach Mike LaFleur  Arizona SportsMike LeFleur keeps 10 holdovers on Cardinals staff, including defensive coordinator Nick Rallis  Yahoo SportsCardinals OC Nathaniel Hackett aims to help first-year HC Mike LaFleur 'be the best version of himself'  NFL.comMike LaFleur's latest Nate Hackett comments will have Jets fans crying laughing  The Jet Press",
    "published date": "Fri, 20 Feb 2026 09:33:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNSlJOTkdkWDctcDI3di0zdnBMLTZsVzd5MEEwZE9RenpISVU0cXRxZUwzTWpCM3kzVmg3elZ6VDVlLWNHUVowWmhtZUZaM2RMRmczcHpaOXF5QmZLN0Fjd2tTMDJRQktmUDN2ZVNQMkhsQTZzcE5sY25yODl6TGlBYVViTU9XZU42cWl3ZDdMUmx1Tm94Q21FOUNmcDFmdHJzVllTM2dJTEswTGQ0RVJFZUpLNnUydGI1RmszVnNKU1pEWVhkOVg4ZXFjbUNHZmVKRWJyc2xmNURSa21DX2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "What are the Seahawks worth? Whatever the highest bidder will pay. - NBC Sports",
    "description": "What are the Seahawks worth? Whatever the highest bidder will pay.  NBC SportsSuper Bowl champion Seahawks announce franchise has begun formal sale process  NFL.comThe Seahawks sale could set an NFL record — but it isn’t because of their Super Bowl win - The Athletic  The New York TimesSeattle Seahawks Franchise Now For Sale After Super Bowl Win  ForbesSeahawks for sale: A ‘secret list’ and how much they’re worth  Seattle Sports",
    "published date": "Fri, 20 Feb 2026 11:38:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQdjNZN3RHUlNZUWwtUGk4aDFZdldsWFJua21RMWQtRDFPazhQTTBhbXJBUE9zSlZFcklIMmV5MmNfdDJqYzMtT19BQ0VTQlN3ampNZENja1RwRzV6YzRiT2lGM1VpTXAwNXBKSWNqNWtoTmpERTBnR3dteVdjRVVBaEYwOFcyYWhUQ2E2QXpveW1qV045djFIeVdrMDZEcjl5Um9Id2p6Z2FseGwtRWVYSlNXWFQxb3QzRDYyWFBQdjJQMW9W?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Amber Glenn finishes just off the podium after a high-scoring free skate - NBC News",
    "description": "Amber Glenn finishes just off the podium after a high-scoring free skate  NBC NewsThe Olympics took away Amber Glenn's joy. She found it in her final skate  USA TodayWinter Olympics 2026: Amber Glenn finds some redemption ... just not enough for a medal  Yahoo SportsAmber Glenn near-perfect in Olympic free skate  NBC Olympics'It Was Soul Crushing.' Amber Glenn Opens Up About Her Short Program  Time Magazine",
    "published date": "Fri, 20 Feb 2026 00:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPNW95SjFqOUJTYW9pTDNGRVlQb1puOEtBZzZoTU9hYUdXRjl2ZndFQVJKUmFScEQ5Y0trRDhvbUNpaFBIMmtxVFNZUkVUYl9HdDZwLVJacXpIZEFXNFBadHNwOWFyOFRNSUtSMFM5WGVQZC0ta19KVWt2TGlNR1lqLUpFZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "2026 NFL Cut Candidates for All 32 Teams: James Conner, Geno Smith on the chopping block - NBC Sports",
    "description": "2026 NFL Cut Candidates for All 32 Teams: James Conner, Geno Smith on the chopping block  NBC Sports2026 NFL offseason resource rankings: How do all 32 teams stack up by salary cap space and draft capital?  NFL.comOne potential 2026 salary-cap cut for every NFL team: Joe Mixon, Kirk Cousins and more - The Athletic  The New York TimesNFL cut candidates: 20 notable players who could be released in 2026  USA TodayMaking 32 Bold Predictions for the 2026 NFL Offseason  Sports Illustrated",
    "published date": "Fri, 20 Feb 2026 15:32:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNSURfOXMyVHRvNEFxYTVOZTBnNmlHWGNpX2dRTkhBY1FuME02Z01qbUJVSW92cC1IQno2a3NMYkpucmtraFBuY09CVGN3WkU2SDZsQ2VMVmlWREVicDBoZmlHb1dYbXNrelJOTjkxX2xheUppa2RVSmpkRGRKSDY4b1FhYlJpSzV4R0hKaUUwWk5jNDFKY3FpWFhJNi1RYmg1QlZ3RW92a2Nrb0lzb28tTU1kd2JsVHVMS1o1S3IxYWh0aEIxRDRQM2I3ZWkwamk5d094QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Canada to play for gold in Olympic men’s hockey after comeback win over Finland - The Athletic - The New York Times",
    "description": "Canada to play for gold in Olympic men’s hockey after comeback win over Finland - The Athletic  The New York TimesMacKinnon's late goal sends Canada to Olympic gold medal game  ESPNNathan MacKinnon scores late goal, sends Canada to final  NBC OlympicsCanada beats Finland 3-2 in Olympics men's hockey semifinals, will play for gold medal  The TennesseanUSA vs. Slovakia odds, prediction: 2026 Winter Olympics men's ice hockey semifinal picks from proven expert  CBS Sports",
    "published date": "Fri, 20 Feb 2026 21:51:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQX2ZnZ0lHZlJPSU5vODh3RmpSRFo5YTBoY1hBMktDUUcxbmdFbWpJZ1d4eDlucjdlUFNXNlU3NXFSYnR4ZnVVRk1rNjJ4N2NacWZBc1pSOGcwam9sb2FWQVdNT29FUS1EVVZ5TFZ4ZVZxRXkxZ3V5RkN5RXdfdXE5Tno1X014UUxXWUtxZXlhd2xwTWtNVWJfTWFzek9JSm8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]