[
  {
    "title": "Art Rooney II: Mike Tomlin indicated he doesn’t plan to coach in the near future - NBC Sports",
    "description": "Art Rooney II: Mike Tomlin indicated he doesn’t plan to coach in the near future  NBC SportsSteelers owner on rebuild: 'I don't like that word'  ESPNSearch starts for 4th time since '69  Steelers.comOpinion | What Mike Tomlin leaving the Steelers might mean for the NFL  MS NOWMike Tomlin’s breaking point in Pittsburgh, Brian Flores’ candidacy as Steelers’ next coach  The New York Times",
    "published date": "Wed, 14 Jan 2026 18:46:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQVjljdEhHVk9Ia1FpNFNvQjVTN2JnUlFvdDV0b1MzOGhVSVU5Z0ZvMzB6bE9FSzZCVXJvUGRFdHk1eTRpbkcxWkRwbDR2QXhuM3JKZDAwX1lSY2xoU1hVWXVDbjMzYkRUMmJGM0lvd0RqSHdUT25oUGRoZW5uS1MtUGNrT1B1N3NXRW9kRDdIcVlfTV9IdGVsV1NsZXBkejhmT2RWQzVVdTR6eEpHSWJlb3FMN0g1bEtpWjliX1dySnF2MGUxTFIzVURwaGU2dTZkdmJLa1dmWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Dante Moore Will Return to Oregon, Forgo 2026 NFL Draft Amid Dylan Raiola Transfer - Bleacher Report",
    "description": "Dante Moore Will Return to Oregon, Forgo 2026 NFL Draft Amid Dylan Raiola Transfer  Bleacher ReportQB Moore opts against draft, returning to Ducks  ESPNThe biggest winners and losers of Dante Moore's NFL draft decision  Sports Illustrated2026 NFL mock draft: Jets pivot at QB after Dante Moore returns to Oregon  CBS SportsWhat does Dante Moore's return to Oregon mean for Nebraska transfer QB Dylan Raiola?  USA Today",
    "published date": "Wed, 14 Jan 2026 19:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQY1lrZDJEWHM0NWRuckI1cmc3bkNVRURYWk9ONFozTVBsbHZKWk9fck9RNEJiUGw3TktmY3JPdEhuLW1neHRILVJ4RnNtR0FYRzBVdXo5RGFCeXJyNnNIWkNVOVdROW9rUFdMd1NDbWRhdnFtd1gzaWxTT2dicVlDVHZONENsQzEwTG1OWE5XZ2ZVSFRZZW1sRFlISlA3Ty1BQUl5OEkyYTcyLU5yckRQWjZvLU9UMDhRTEZGbE5HeHo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "Report: Harrison-Nunes UFC 324 title clash ppd. - ESPN",
    "description": "Report: Harrison-Nunes UFC 324 title clash ppd.  ESPN'Biggest women's MMA fight ever' is postponed: Harrison has surgery to repair herniated discs in her neck  Eagle-TribuneFive Amanda Nunes Fights To Watch Before UFC 324  UFC.comUFC 324 fight card: Kayla Harrison vs. Amanda Nunes postponed due to injury  CBS SportsKayla Harrison off UFC 324 due to neck injury, Amanda Nunes fight postponed  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORUQ2RGRENC02cHVVazAyNnM3Vm5LcC1LR2ZvX3RxTWs4NDBDeHZuQjlMY0FidjlOZVNKV3c5VjJSajdrTF9DbHVXSXRPTFNsM2hmWlJjdU1RX3R4ODBhWHBWaWxqUnAzUnU0WUNicUV4czVQTURpTU9TNk51QVdtNXdBUExLb0dPNEg3aE00WjYtYnNNbk9qWUlwYmh5dDd0dnR0STF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Denver Broncos vs. Buffalo Bills: How to watch, listen and live stream in AFC Divisional Round - Denver Broncos",
    "description": "Denver Broncos vs. Buffalo Bills: How to watch, listen and live stream in AFC Divisional Round  Denver BroncosBroncos bring different mentality into playoff rematch in Denver against the Buffalo Bills  Yahoo SportsWatch parties, giveaways and more | How Bills fans are celebrating AFC Divisional Round  BuffaloBills.comBills’ thin wide receiver room faces a ‘next man up’ test against the Broncos  The New York TimesSean Payton happy to have a healthy Dre Greenlaw back  Mile High Report",
    "published date": "Wed, 14 Jan 2026 15:06:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQdVYyMXQxUldXd1ZoRG1Id05pX2dNaUxwdURDY3VtQVoybGl4eGZMZFhwM1J2ZExQeU1lb29EeUJvTVQ0Z0J1eGdsN3Izc1R4czZ6UUZSQ0U0MV9LR09rUGY2TUpvdXJGM09nSE5LS2M0Wl9mRnlPLVFsdjJJaHk3ZHV6anpVNnNsZTNkMkVKM1NwcmhQVGRNcnJ0MEhxTVpMUXJMRXQya0lOQU9RVGpIamhsUzIxakpWajgwMFpnaUNVVHlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.denverbroncos.com",
      "title": "Denver Broncos"
    }
  },
  {
    "title": "LA 2028 Olympics open ticket raffle - with seats starting at $28 - BBC",
    "description": "LA 2028 Olympics open ticket raffle - with seats starting at $28  BBC2028 Los Angeles Olympics tickets draw registration opens. Here's what you need to know  ABC7 Los AngelesLA28 Olympics ticket update: Registration opens and ticket-buying windows announced  Los Angeles TimesRegistration for tickets to the 2028 Olympics begins today. Here's what you need to do  LAistWhat to know about registration for the 2028 LA Olympics tickets draw  NBC Los Angeles",
    "published date": "Wed, 14 Jan 2026 15:30:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1PamdHSmVJQUFOQk5VQmowbHZtb0xjcU9VQW91UTVKT2N3U2JtdDBuN3VUTEkzYXBrQXlLTTg4MGU0SDdEZzNhY2tBYjZrRjVxYUxMVDBzbExxZ9IBX0FVX3lxTFBNMEZ4NTM1SGlZRmtOdngtR3lNMFJhM0hRVWlHMndsaEloRG16dTQ0c1hOSGo5eWExcUprYi1UUUZtVVA5aUdJNzJudk0yRzU2bGY3UHpSUk4tMjhCdHRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "NFL divisional round confidence picks: Chicago can upset Los Angeles - The New York Times",
    "description": "NFL divisional round confidence picks: Chicago can upset Los Angeles  The New York TimesBears counting on DE Montez Sweat to even out fight vs. Rams' offensive weapons  Chicago Sun-TimesHow to watch, listen to, stream Bears-Rams Divisional Round playoff game  Chicago Bears Official WebsiteNFL picks: Rams vs. Bears among best spread bets for Divisional Round  CBS SportsBears coach Ben Johnson trades kind words with Sean McVay a week after Matt LaFleur spat: 'He's in the upper echelon'  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 15:07:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQN1IxZFNNQ2FsUTF6M1F5VFNxSVl4ZlExYnZiRmlFLXdLWHVGS05PR2pWUnJNaDJhTlRBUU1wc21oSzMzWld6VWRSSXFuVHRCSEhsRnY3cUZyX25xRG11ZURTaEVOR2R4ZDBuQ3d1M2dEUl9vS1htUHZnRXFNRHVjcEdVZF95UE56VDVpVFhmcjQzMGh1ZnJzdEQ3QU5UNnYyYnpJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "The PGA season is here! Best bets, DFS plays for Sony Open - ESPN",
    "description": "The PGA season is here! Best bets, DFS plays for Sony Open  ESPNHorses for Courses: Tough to find a better Waialae course fit than past champ Russell Henley  PGA Tour2026 Sony Open odds, predictions, field: PGA Tour picks, best bets this week from proven golf model  CBS SportsLarge-Field GPP Breakdown: Sony Open  Establish The Run2026 Sony Open Thursday tee times: Round 1 groupings  GOLF.com",
    "published date": "Wed, 14 Jan 2026 11:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPaWlZY21aY1o0YzFBM01fVUhUSWw5SWRCSUxIZU1BTlNKbnVUQTRBRmRhVGpVYi1nRTRwNURvVTU4Z1JGa2RXVDJDSXA3Z2JtNTdzSndVU3QtR0RnRkFWa193UWFSaEJjM2tTdHJ2ZXQwNUlNblNoX1luTVJna0xDOHNMem54T2lXN0NPMm9UaVhsV3dTV0Mtc2hGV2NaZnEwbkQtcTZPZDdtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Starting 5: Thunder power past Spurs behind Shai Gilgeous-Alexander - NBA",
    "description": "Starting 5: Thunder power past Spurs behind Shai Gilgeous-Alexander  NBAFueled by SGA's 34, Thunder respond, swat Spurs  ESPNHow Shai Gilgeous-Alexander, Thunder finally asserted dominance against Wemby, Spurs  The Oklahoman3 Takeaways as Thunder take one from Spurs, Wembanyama  San Antonio Express-NewsThunder smoke Spurs for 1st win over San Antonio after 0-3 start in growing rivalry: 'Tonight wasn't our Super Bowl'  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 14:29:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBLaGNMSFVtX1FUaGhwRXdmczZONWVKSkVvQUEyMnhleUNDWmhBSUVHSG9hMlFDZ3VaeW9ac0swZ2FuWHphMkhEd0tVN2RFamw1SkhZZmMtVlUzYlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "Australian Open’s ‘One Point Slam’ thrills fans – and one-ups the other Grand Slams - The New York Times",
    "description": "Australian Open’s ‘One Point Slam’ thrills fans – and one-ups the other Grand Slams  The New York TimesAmateur stuns Sinner on way to 1 Point Slam win  ESPNAustralian Open Million Dollar One Point Slam: Amateur Jordan Smith stuns world's best  BBCPHOTOS: Carlos, Jannik, Iga, Coco, Meddy have all the fun playing AO's 1 Point Slam, as amateur Jordan Smith wins  Tennis.comAussie amateur beats AO champ for $1M. payday in 1 Point Slam  Australian Open",
    "published date": "Wed, 14 Jan 2026 15:16:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPZkdHb241aWY2TjRHa25LRzljZ3IxOEE4YkprVHNoLWpoS3pwTG01N0laWG5yaGZfdUZ4MkdTeW9aUnhsWTZGOTRMNzJldlFxRVRzTmt4NXd3OENCdVM2MWVJeVJzQVJiTUZIN0FsNEFPY2xzQktteUluRXZ2TmRXUDVXMjJMTGZYNU1iR2dFZFhGLS1Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Tim McGraw to headline entertainment for 2026 NHL Stadium Series in Tampa - NHL.com",
    "description": "Tim McGraw to headline entertainment for 2026 NHL Stadium Series in Tampa  NHL.comTim McGraw to headline Tampa Bay Lightning’s outdoor game at Raymond James Stadium  FOX 13 Tampa BayWhy there will be ice in Florida for Tim McGraw's first 2026 concert  YahooNHL unveils climate-controlled rink plans for 2026 Stadium Series in Tampa  WFLATim McGraw to perform at Tampa Bay Lightning’s Raymond James Stadium game  Tampa Bay Times",
    "published date": "Wed, 14 Jan 2026 14:04:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPdWxUdlNQMTZrajI0ZC1Nc1RjUFI2RVROT2R2WUstQjFXWDZpWTlEeC1EVWNxUUFKWHhEcHpTanp5cHBkZnZmczhJX2dFZS1rZVhpUFRwZDRScC1kMkMxRGhjLXZ1OFpNX2dVYVFIXzFmM01vS05UdlhSN2JaNXNlalBaR2huMGdoVEVoOFdKeGVCM0Y1Q0QtX00xcWNaeWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Game Preview: Patriots vs. Texans - New England Patriots",
    "description": "Game Preview: Patriots vs. Texans  New England PatriotsFamiliar enemy: Texans are loaded with ex-Patriots under Nick Caserio  NBC Sports BostonSimple Mike Vrabel question puts Patriots’ playoff opportunity into perspective  Yahoo SportsTale of the tape: How Drake Maye and C.J Stroud stack up ahead of the divisional round  WHDHTexans at Patriots: Predictions, picks, odds for NFL Divisional Round  USA Today",
    "published date": "Wed, 14 Jan 2026 11:01:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQd2xLYnloenlvZ2FHNnI2U1dIWjUxQVpWQThYWWNPcGdYQkxBOGdNQl8yNlZzV2RFQlBPTHpxNjNHeU1BMEZJQ3hlSU1zM1Y4bjZzbF9oaDhDMjZIT2lCM0Q2ZktRUV8yTnFhRFdYWTZ1VG5hWUpFUUNqb3g4MjVrc3V1bEtyY2pE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patriots.com",
      "title": "New England Patriots"
    }
  },
  {
    "title": "Greg Biffle's home burglarized weeks after plane crash - ESPN",
    "description": "Greg Biffle's home burglarized weeks after plane crash  ESPNGreg Biffle’s home broken into weeks after he and his family died in Statesville plane crash  WBTVBurglars steal $30,000 from NASCAR legend Greg Biffle's home weeks after fatal plane crash  WCNC$30,000 stolen from Biffle estate weeks after fatal Statesville plane crash  YahooGreg Biffle's House Robbed of $30,000 Less Than a Month After NASCAR Star, Wife and Kids Die in Plane Crash  People.com",
    "published date": "Wed, 14 Jan 2026 20:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRXgyQUlfTnRNSC05ejI4Y1dyNWVURU9BSEtrYkdEbFYycl94NHI4Q1RKU05DeUJvSTBTYWVqWkRQX04yQUFuUXFzaFlxQ1Bmb3p2bVpwcDk2NDJtS3NxejE0YjJLVTNBR1dmSy1HRzJpaXJ0a1pvb1d3LXhsc19ud2tnU0FmNThlZ29pZGpfWG1UeU1zY0R0YjFfZ25nRDhaNENj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Injury Report: Patriots vs. Texans - New England Patriots",
    "description": "Injury Report: Patriots vs. Texans  New England PatriotsPatriots cornerback Christian Gonzalez returns to practice after stint in concussion protocol  The Boston GlobePatriots CB Christian Gonzalez, TE Hunter Henry had limited participation  Yahoo SportsPats Pro Bowl CB Gonzalez in concussion protocol  ESPNPatriots Defensive Starters Return to Practice Before Texans Game  Sports Illustrated",
    "published date": "Wed, 14 Jan 2026 21:52:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5DRmpNUHViSWJQWnMyZThyakxvblMtVDFjWTJSV2NOUkUwUTcxYzBGM0s1YVdFZWlBNGtMWVR4RW9NSGNfakJyWXlWOThTRzQteDVtMTE4QTZsY2FKN2NhYmpXaElULVd2eEZGeDY4RQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patriots.com",
      "title": "New England Patriots"
    }
  },
  {
    "title": "Shanahan Addresses Warner, Kittle and Short-Week Prep Ahead of Divisional Round in Seattle - 49ers.com",
    "description": "Shanahan Addresses Warner, Kittle and Short-Week Prep Ahead of Divisional Round in Seattle  49ers.comHow the 49ers’ approach will change for another short-week game vs. the Seahawks  The New York Times'YEAH!' Lil Jon will perform during halftime at Saturday's Seahawks game  KOMO2025 NFL playoffs, odds, betting: San Francisco 49ers are biggest playoff underdogs in over 40 years against Seahawks  Yahoo SportsFaithful Seattle Invasion Set for Saturday  49ers.com",
    "published date": "Wed, 14 Jan 2026 01:10:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNY1VESFRkd3FsczJ2TXBKb2h0Q0p0enp6VTVRdENvdURMMkg1TDNVRE1Bd2JraXRIMUlVRDlqQU9TMktrQ1kwRnRXcm1oVVV2TGlreEFjYThGeFRXZzR4cmEyVUF1amFfeVlBcklJdHpYR2tGV1M1SjJfRUJvUlNHOVBFS2hxcVdOZFBWMTlFVkZ6djdkVWRuVUstV2tueG5JeXhpX2VXZG5HQW50ckpySVhxVlM2elU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.49ers.com",
      "title": "49ers.com"
    }
  },
  {
    "title": "Eagles make change at offensive coordinator - Philadelphia Eagles",
    "description": "Eagles make change at offensive coordinator  Philadelphia EaglesEagles make change at OC after offense's decline  ESPNEagles offensive coordinator search tracker: Some candidates emerge  NBC Sports PhiladelphiaAfter embarrassing Kevin Patullo pile-on, Eagles must make Mike McDaniel their main OC target  Inquirer.comEagles offensive coordinator search: 12 candidates to replace Kevin Patullo - The Athletic  The New York Times",
    "published date": "Tue, 13 Jan 2026 20:34:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQVzdNRE54aWJvbmdXN0VKWWdHWlVEUFZvaFJhNjlOTjZxb200WWhZWHJ4WG0wX2t4cklQc1A4NUdiUlV3TmpQck94RlFUZm1qeXQyVnlDVzNFcERTTEdxeTk3Tm9ZTzMxMmJVdzMxeGZSY25GZXJxZjh5eVU4bEY3bFRabG9EQlRoQ3NETFhfUFoybmFQMkpjVXVjVUVTZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.philadelphiaeagles.com",
      "title": "Philadelphia Eagles"
    }
  },
  {
    "title": "Anthony Davis is not expected to need surgery on his hand - NBA",
    "description": "Anthony Davis is not expected to need surgery on his hand  NBAMavs' Davis won't have surgery, out six weeks  ESPNNBA trade rumors: Rich Paul wants Mavs to move AD, Morant comments on speculation  CBS SportsAnthony Davis won't need hand surgery, will be re-evaluted in 6 weeks; Mavs renewing trade talks to move him: Report  Yahoo SportsThe Anthony Davis Trade Outlook Latest  Marc Stein | Substack",
    "published date": "Wed, 14 Jan 2026 02:41:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFA0ZzNtMTZJYmVERFZBSVlDTUQwakl4OGV3Wjk0Ml9pSTFXb1ZBV1V2ZFg0LVh0TTIzaW8tUGsxQWJLVksyR3VNSjVqdkZFVFgzRkItV05LV0xDYUw5eHI0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "FTC asks 20 schools if agents are following law - ESPN",
    "description": "FTC asks 20 schools if agents are following law  ESPNParents and student athletes: If you’re hearing from sports agents, you’ll want to read this  Stuttgart Daily LeaderFTC Puts Student-Athlete Representation Back in the Spotlight (via Passle)  Loeb & Loeb LLPFeds Say They’re Investigating College Sports Agents  Front Office SportsA reminder from the FTC: If you represent student athletes, comply with SPARTA  Federal Trade Commission (.gov)",
    "published date": "Wed, 14 Jan 2026 19:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNd1VLbXFGVVNrZWtmbm05RlRQV3BFaU55bTJXSzV5VFp1ZGdsYV9LN3ViOXRvRHJBWjdTQ0Zic0pWMmhvZEp4bDRlMFBDZVdUbHZDVnh4ODFEWEJ1cGdYRHlGVkdoM0p5cy1zcmZ5YWZ3aS1ndzVld1IwUmZRZzNyc29nblU3NGIzc1BKX2FVd2JjN254Sms1aTVSUXVfM3JFYzU0X0FnMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Division I Cabinet adopts new transfer windows in several sports - NCAA.org",
    "description": "Division I Cabinet adopts new transfer windows in several sports  NCAA.orgNew transfer windows OK'd for hoops, other sports  ESPNNCAA makes major change to men's, women's basketball transfer windows  On3NCAA Cabinet Approves Shortened Transfer Portal Window  College Hockey NewsHow the NCAA transfer portal changes the look of basketball rivalries  Peoria Journal Star",
    "published date": "Wed, 14 Jan 2026 21:18:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQV01SXzF3Ykw1WVlQR0gwYTVLNEFfMFVlUllfdkpRSFhIVC0xTkhocnhTVmdXRjZMM1IxczhkdldMc0dRMmJTblFmQ21aeVg1U3dTNlkyenNsWDd3VFhiaGkyYUYwOGhLWTMtMEl0RXhvMEQ4N2ZBeUJVaFFqcjJFR0c1bGtkeFBzUjdyX2VvN3ZEQVpKTHp5NF9FR1UzUGxKdUxRLXY3QXMyZ0FoSEl0NmxqQUxzVC1saWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ncaa.org",
      "title": "NCAA.org"
    }
  },
  {
    "title": "Steve Bisciotti Wants Lamar Jackson to Be Involved in Coach Hiring - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "description": "Steve Bisciotti Wants Lamar Jackson to Be Involved in Coach Hiring  Ravens Home | Baltimore Ravens – baltimoreravens.comRavens owner Steve Bisciotti remains confident in decision to fire John Harbaugh: 'This was the time'  NFL.comThe Giants will have to wait a little bit longer for John Harbaugh  Big Blue ViewWhy is John Harbaugh atop Giants’ coaching wish list? Insights into cycle’s top candidate  The New York TimesGiants can’t sway John Harbaugh with first pitch as coach’s interview tour continues  New York Post",
    "published date": "Wed, 14 Jan 2026 04:12:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxObUlQMjIxNGNlaUNqX0x4Z1Q1anZRSkNWMzU2bjIyUDNwTUpTOFVNa3Z0bFlEQ2dLUE84NTlTMnluVXl0Qjh1ak4wZjFKZWhvbUZ0MHRubDl3UHRmai1ZVWtqd1A0b3VoeTlhSUM5V1BjVTJGRkV5WW1Tb3oyRWhsWXBUZUhSUDgwb3NVOFdSZnltSGwtSUlJWUtxbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.baltimoreravens.com",
      "title": "Ravens Home | Baltimore Ravens – baltimoreravens.com"
    }
  },
  {
    "title": "Cardinals trade Nolan Arenado to D-Backs, ending long saga - The Athletic - The New York Times",
    "description": "Cardinals trade Nolan Arenado to D-Backs, ending long saga - The Athletic  The New York TimesD-backs acquire Arenado in trade with Cardinals  ESPNArenado: a 'no-brainer' to join young, hungry club that's close to home  MLB.comCardinals Trade Nolan Arenado To Diamondbacks  MLB Trade RumorsMike Hazen discusses the Arizona Diamondbacks and Nolan Arenado  AZ Snake Pit",
    "published date": "Tue, 13 Jan 2026 18:27:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOby0tTm1YOGFxUXdhUHgxRndQRnRGOG1KdlFHdmJ4RmxQMU9Va3hhQmxBWmg4UkI0OUdiY2V2cFZXWWlhenpJZFNDbmxOY2IwZG91UnRJV3JXTTcwWXJjWFBaOTNwNTc0d2JKSGJzSjRwR0NqcDNLZUN6MVhEUWN2b3g0bHdzNFZWYjBuVTc1YldEajFwSWFtVFhmR1FrZ0Jp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Virginia Tech, JMU cancel 2026 football game - Virginia Tech Athletics",
    "description": "Virginia Tech, JMU cancel 2026 football game  Virginia Tech AthleticsVirginia Tech, James Madison cancel 2026 non-conference football game  USA TodayVirginia Tech drops JMU game from 2026 schedule: JMU pivots to San Diego State  Augusta Free PressJMU Heads to SoCal to Face San Diego State in 2026  James Madison University AthleticsVirginia Tech pays JMU $800K to cancel next season’s football game  The Virginian-Pilot",
    "published date": "Wed, 14 Jan 2026 15:35:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNN1ZNLWl1djZmMk1kSGtCNEFVdU9fa3cxd19WOHF5UDdTbWhOOHVJcmJrcVk4dE1LR2xSNGdzeWpnZEo2TVBUNXRYczg5XzFXWGh4LXVyQXVGb1RiX1Zzb096bGNPZktYLVV1bXpxUV9BT0E4Z0FTZi1YQVR2eUJnUjM2ZFBsbFBGdXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://hokiesports.com",
      "title": "Virginia Tech Athletics"
    }
  },
  {
    "title": "Ranking every NFL head coach by job security after a wild 2026 coaching carousel - SB Nation",
    "description": "Ranking every NFL head coach by job security after a wild 2026 coaching carousel  SB NationNine open NFL coaching jobs, nine predicted hires: Who will land in Baltimore, Pittsburgh, New York?  ESPNWhich NFL coaches have been fired? Coaching vacancies and firings  USA TodayCoaching Carousel: Matching a Top Candidate with Each of the NFL Vacancies  FOX SportsNFL head coaching vacancies: Best fits for Ravens, Giants, Raiders and more  CBS Sports",
    "published date": "Wed, 14 Jan 2026 14:43:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNSVBUdTRvWU1TMWJQWFJNLWtLX2g4NmVqa3Q0YktyM2Q0cEQ3SGFDcDY5ZzRoMXJOaXhDQ1RGbnQ2ZWhKUHd0UEU5TGVUQVJwVVdpbXplSHlkU1o5NUNWb2FfSTFOYWhZZnRsWkdaeEVFRVFhR3JtUEwxcVZxVi13THBiLXRLLVQ3eFBaX1E0elNXXzRvd0Ffa0ZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sbnation.com",
      "title": "SB Nation"
    }
  },
  {
    "title": "The dos and don’ts of being a Manchester United interim manager - The New York Times",
    "description": "The dos and don’ts of being a Manchester United interim manager  The New York TimesA no-fuss, loyal, safe option: How Man United chose Carrick as head coach  ESPN'Come on Saturday with everything you've got' - Carrick's message to fans  Yahoo SportsBackground on Man Utd's new coaching team | January 2026  Manchester UnitedHow could Michael Carrick’s Manchester United play? - The Athletic  The New York Times",
    "published date": "Tue, 13 Jan 2026 05:12:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPRXJoZ2FBYnpIYWZJRmRzQ3dHdnFEMjRMVDNoVnlicW1LaFhLbmVVeXN4c2xnWXVKaWZfWk85alZseEk0cG5fbVg4ZHMzRkUyTXlPM0k2aEVPMlBfanl5NW1RX2oyUnhENHFMUVBETlZLdWszNk1jYWNya2NVV2l3b3Fn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gators Roll Over Sooners on the Road - Florida Gators",
    "description": "Gators Roll Over Sooners on the Road  Florida GatorsFlorida 96-79 Oklahoma (Jan 13, 2026) Game Recap  ESPNFlorida basketball soars past Oklahoma on road: score, highlights  Gainesville SunHow it happened: No. 19 Florida vs. Oklahoma  247SportsKey takeaways from Florida's win at Oklahoma  Gators Wire",
    "published date": "Wed, 14 Jan 2026 06:56:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQNlVveDU5REloeEktQjE4TlpDQndEbWIzUUhkSnhBVjk4d3htM2pDbTgyam5DX1Uzbkx5LS1pQjRPS3NZNzlBbG43ZkMyeVpoYVlZNVJDUWhkUFA1S2ljVkNTNTk1NHRlbWtSbUNMajBsUGVxSFozeHNGQmx2T0Zrc1BEN3R3cG42OVI2X2VYNlFSOUs1eC1BUkEzdW1SQ3cwd0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://floridagators.com",
      "title": "Florida Gators"
    }
  },
  {
    "title": "Bills announce WR Tyrell Shavers tore his ACL vs. Jaguars - BuffaloBills.com",
    "description": "Bills announce WR Tyrell Shavers tore his ACL vs. Jaguars  BuffaloBills.comShavers has torn ACL as Bills lose another WR  ESPNBuffalo Bills sign WR for playoffs who led position in catches in preseason  Democrat and ChronicleInjury update: 3 Bills receivers out for year, what's next for Broncos  Bills WireNFL Divisional Round Buzz: Bills QB Allen Down to 3 WRs; Rams' Stafford Update  FOX Sports",
    "published date": "Tue, 13 Jan 2026 20:54:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQOWlWZzBpSjJqWWJmblFHek1FR1NMYlRKNkdQVy1XdjNlZ3hOaVZHVzk3RXlWYzZOdzZZS05DQ2R6NGNCaWFVaDdUYjVlNjltR2Uzc1ZsX29PWHRDUDQ3MmVXY1VTMnlVY3dvZnFVNWN0SkE1YWxXb25LU3hGQVdlR2JLRFREZlROQ3VCZ3hCd1pLNGds?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buffalobills.com",
      "title": "BuffaloBills.com"
    }
  },
  {
    "title": "Chargers Announce Changes to Offensive Coaching Staff - Los Angeles Chargers website",
    "description": "Chargers Announce Changes to Offensive Coaching Staff  Los Angeles Chargers websiteBolts fire OC Roman, OL coach after playoff exit  ESPNChargers offensive coordinator candidates who could reshape offense under Justin Herbert - The Athletic  The New York TimesFormer Oregon star blames himself after another early exit from NFL playoffs  OregonLive.comFive OC candidates for Chargers to maximize Justin Herbert after firing Greg Roman  CBS Sports",
    "published date": "Tue, 13 Jan 2026 20:15:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBwYzhDUmxld0lieDY5YVZSQ2pzN3BJd05FVEx4OGhtNVl4NllSOEpETHlNRk45SDM3bTFMTVE2YUVQcGpreU5keEY4VkZuTDI0dTI4eF9aN2F3T1B0aUR2N1l4YVlDYmVzVHp6RnIwYi1LWmw4REFv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chargers.com",
      "title": "Los Angeles Chargers website"
    }
  },
  {
    "title": "Falcons complete interview with Mike McDaniel for head coach position - Atlanta Falcons",
    "description": "Falcons complete interview with Mike McDaniel for head coach position  Atlanta FalconsFalcons Announce Mike McDaniel Decision as Matt Ryan Makes First Move After Raheem Morris Firing  Yahoo SportsFalcons interview Harbaugh, who is vetting teams  ESPNFormer Ravens HC John Harbaugh makes Falcons first known interview since firing  NFL.comJohn Harbaugh meets with Giants exec Chris Mara, is ‘very interested’ in job: Sources - The Athletic  The New York Times",
    "published date": "Tue, 13 Jan 2026 01:34:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOTFdZV1hBMy1oQ09hNXRxRmF4V1lXOFRXTi03d0Q3TEJlbU9YUFFqTWlONDFtTVNhM0cxNTRfQmg1RnhlRlVNWEhKSWNURDBlYUtQaHdwVlFvNWswZnNfNkZ3RUFGeGhxeUQ2OXY1RS16Z01uaFR5bFozMmxoV1JaSVl0SUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.atlantafalcons.com",
      "title": "Atlanta Falcons"
    }
  },
  {
    "title": "More horsepower, new faces as North Wilkesboro test brings offseason rumble - NASCAR.com",
    "description": "More horsepower, new faces as North Wilkesboro test brings offseason rumble  NASCAR.comHigher Horsepower Hits The Track At North Wilkesboro  speed sportNASCAR 750 hp Short Track Testing Reveals Early Results  Heavy SportsCup Series organizational test scheduled Tuesday at North Wilkesboro  Yahoo SportsFord Racing Notes and Quotes – Chris Buescher Q&A Session  SpeedwayMedia.com",
    "published date": "Tue, 13 Jan 2026 22:18:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNQXhNdmlJcl90U1RwOTVFc25FZkJzLVhpR2s4WU1qcmw4SDVSRWdqUWUzR0d5UWhYQVdrcDBfX25IQ0JzLTJCSlhwYVRDbUxudFRtU21qYUtOOUE4Q1kyZ01PMDY2eEZJQVUwWThEYkRlNGxpR2NJMDY3REVyaGQ5NjliSktGTldrUERNY2V1VU54aFhCdVZLTFJNQ0dCVWJWYzhQQXhJSjhRT0c4ZFV6RERORnRZOEVY0gG-AUFVX3lxTE04Ny1wem10RHo2Qy1Xemo3TmN6elRPUWZOTDBoUXI4LWtJNGpiTVNDNWRFRU45UFo1YmszRWlBbGxFYlNUOERNeEk1OXpCakpzNVo1WlF1OHRocXgtb25vUXRFeU42amxVLVBpU19fOVpCQUExeF96SUJlclJNQWJZTDFXQ19sWDZmNGF2RkprQnlMQWx1ZmlZckZyOXVoRVJxYjFKREtEUDFaZXJpZ2xlY2JSOTVvZlZaaGxDMHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "What we learned from Matt Ryan's introduction as Falcons' as president of football - Atlanta Falcons",
    "description": "What we learned from Matt Ryan's introduction as Falcons' as president of football  Atlanta FalconsMatt Ryan seeking to handle 'unfinished business' in new role as Falcons president of football  NFL.comEx-QB Ryan named Falcons' president of football  ESPNMatt Ryan: I think this is the right opportunity  NBC SportsShould the Falcons look to a familiar face to help Matt Ryan in his new role?  The Falcoholic",
    "published date": "Tue, 13 Jan 2026 22:25:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQbTJZWjRQRVVfMktDN2czNFh2RThrY3U4RUpXNDRaTDhZdFZzNFBXTDVBT2U0QUJpT2FNTFh1dGVuVmdOTTV1NG9ERi1yWFVRd1ZkelZGblNCVFM4RDRjWFJnOHBxb04ycy0yaDRyWmpqWHlNY2d0b3pEaDFIM3JpTTdkNFdOVlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.atlantafalcons.com",
      "title": "Atlanta Falcons"
    }
  },
  {
    "title": "Five takeaways from Dan Morgan as he wraps up the 2025 season and previews the Panthers future - Panthers.com",
    "description": "Five takeaways from Dan Morgan as he wraps up the 2025 season and previews the Panthers future  Panthers.comNFL news roundup: Panthers picking up QB Bryce Young's fifth-year option  NFL.comPanthers GM Dan Morgan still has a long way to climb. But consider where he began  Charlotte ObserverDan Morgan just made life uncomfortable for a Panthers locker room favorite  Cat CravePanthers make major decision on quarterback Bryce Young's future following playoff loss  Fox News",
    "published date": "Tue, 13 Jan 2026 21:51:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPZG8zaUx5S0hTem5XUU1XcFdLcWFzRVUzQ3g2bEloZlI3dHlFMnZ6YmNQVXpfeXRHQTBkVXlwVWdlYVFyU0syRVM5SFpCQ0IxaElaUFhWRnpvbnA5d2ZNaEZ4eDNlUkc1UHI5V2thVm1hbVkwM2xNc05wa0tNVnM2b0ZaX0w4T29UenVtcmZzRXc3bkdCQU5oblJST2EtbXpaVHNBdFZLdzhvTUZTa04wYzA5bmFsc25ONFFYTWFpUThpQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.panthers.com",
      "title": "Panthers.com"
    }
  },
  {
    "title": "NBA Berlin Game 2026: Everything to know - NBA",
    "description": "NBA Berlin Game 2026: Everything to know  NBADirk linking up with Wagner brothers leads top Magic-Grizz scenes in Europe  ESPNJa News Official, How to Watch Memphis Grizzlies-Orlando Magic, Injury Report, Betting Lines, Lineups & More  Sports IllustratedGrizzlies vs. Magic odds, line: Proven model reveals picks for NBA Global Games matchup in Berlin, Germany, on January 15  SportsLineMemphis faces Orlando, looks to break road skid  The Washington Post",
    "published date": "Tue, 13 Jan 2026 14:24:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1rUmR0X3lFdVFrTGhaNlpxTFBtdXpVMy04Q3ZtRjluUTQtczhtaWJ0R2c3dUNibTgwRGJvbmVuY0NndlBObU1fVW05MWI5OG5YcHRjaklfSVVBRjNNcC0zdEJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "Yanks, seeking pitching, deal for Marlins' Weathers - ESPN",
    "description": "Yanks, seeking pitching, deal for Marlins' Weathers  ESPNYankees’ playoff hero thrilled about son’s trade to Bronx: ‘Full-circle moment’  The New York TimesMLB rumors: Yankees eye SP; Mets up Tucker offer; Blue Jays still in on Bichette  CBS SportsYankees acquire starting pitcher Ryan Weathers from Marlins for 4 minor leaguers  Yahoo SportsHow Yankees trade addition Ryan Weathers bolsters the starting rotation  Pinstripe Alley",
    "published date": "Wed, 14 Jan 2026 01:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQlRLczN0cjg1cHp0OVJmV19vdXFMM0IzdXR1MmdCR3JES09Wd2QzV3k5VHhlZFFXckRTQmpicnJKTUYwU3gyVUFjQ2s0Z3JqdmlKSHR6eTdxblNZa0pmRkVWMVZQN3JmTXV6N1Q4b09zLXFzS0UyQURERkhOMTREZ1ZXYWF1VmZSeEc2ME9RYVp3eU9yOGktRjBCRlpXQ0pPcFdDdg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "No. 8 Huskers Remain Unbeaten With 90-55 Win Over Oregon - University of Nebraska - Official Athletics Website - huskers.com",
    "description": "No. 8 Huskers Remain Unbeaten With 90-55 Win Over Oregon - University of Nebraska - Official Athletics Website  huskers.comOregon men’s basketball loses to Nebraska 90-55 in worst defeat since 2018  OregonLive.comNo. 8 Huskers Look for 17th Win Tuesday against Oregon - University of Nebraska - Official Athletics Website  huskers.comKRVN 880 – KRVN 93.1 – KAMI - Huskers clobber Ducks  Rural Radio NetworkWednesday Flakes Brings You Another Nebrasketball Win, Football Redshirts, & James Gang  Corn Nation",
    "published date": "Wed, 14 Jan 2026 05:11:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOQ1NhYkpmSDZna2JiLU4tWGVGRnBxM0RiYl9zTDBfRFdIek1iNFpIaC0xdTdCaHd6dEE1QlRpOHROQTJ5U0NuV0ZlaWJweHlQTV9oY1doTDBZYy1rSlpTOS1PZ19EUVY3RUF2WWlZUE96UWFRZmItVGZreHBHVUNqN2ZpRUlRbkxiN1JaZ18yT1V3aVVLOWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://huskers.com",
      "title": "huskers.com"
    }
  },
  {
    "title": "Jaxson Dart nominated for Pepsi Rookie of the Year - Giants.com",
    "description": "Jaxson Dart nominated for Pepsi Rookie of the Year  Giants.comSaints quarterback Tyler Shough is a 2025 NFL Rookie of the Year finalist. Here’s how to vote.  NOLA.comCarson Schwesinger nominated for 2025 NFL Rookie of the Year  Cleveland BrownsPatriots RB TreVeyon Henderson among 6 finalists for NFL's fan-voted Rookie of the Year award  Boston.comPatriots’ TreVeyon Henderson Up For Major NFL Award  NESN",
    "published date": "Tue, 13 Jan 2026 20:03:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxObHMzNWNmQTFjTGV4N085M09kQlo3Ml82S1VQMnVWLXlFUWstQUdrNE8zUC1EUkE2MzM1ZjZuMUJrd3ZRc2E3WXVxWmZMajhuanJwRU93MDJ3cnRXRGhwbTd6dTNBY0Q5LUFyWE9jTXo1Vm5XMGpIUFhKWXdXY3FRNzhBdlJ2UEFKV0pEdHlidDBGSXl1NEdEMUZZMjZvU2lwRlMxVGlMTGY5UElGekt2QzZRN3BNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.giants.com",
      "title": "Giants.com"
    }
  },
  {
    "title": "‘Everyone wins with this format’: NASCAR community lauds return of The Chase - NASCAR.com",
    "description": "‘Everyone wins with this format’: NASCAR community lauds return of The Chase  NASCAR.comDale Earnhardt Jr. shoots down criticism of 16-driver Chase field amid NASCAR fan concern  On3‘The game has changed’: Logano keeping an open mind about NASCAR’s new championship format  RACER - Racing NewsHow NASCAR landed back at the Chase playoff format: ‘The best of both worlds’  The New York TimesNASCAR goes 'Back to the Future' by restoring Chase title format  ESPN",
    "published date": "Tue, 13 Jan 2026 16:09:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOREQwTFRlOXlNdkR4R1hPRjVROWZBM0NWOXZRZUZEY1JlQzBsQjIzb0loc2ZrNzgtT01ud004MTdoRTVSdV9UenY4TG0yT0phU3ZRaHpaa2ZNWHBjbzN6NURSZldHMWFJMFY4MTB4UUhzWkM4TGZ3Q05FTDNtZUJNR1NWcGlSU3otTTEzZll3Z3Y3dTRNQ1Itc3NIT3dkdFJtTVQtbl9iRzBDajVX0gGyAUFVX3lxTE5HTnIxaC1yT2I0RjNZMm1aaUw2QWpTczZuNHdmbDFzZjFxVERXYkF0ckpEdXQ2MlI3VmF4dGNKVkxVc2hKRXoyb09mUlVOeE8zdVJUR29BZnRjV3dkYWE3VXVTcWNtWVNFY1IwbTJnVll1TnBpSGRTc2xXOFFaVWI3cmRuM2NzS3ozM3VYbjJyLWRvNG5DWDJDMTJRNVhuRW13YjhrcUI3OGVZX1lLYXpyeWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Cardinals Look At Two More Defensive Coordinators As Another Coaching Spot Opens Up - Arizona Cardinals",
    "description": "Cardinals Look At Two More Defensive Coordinators As Another Coaching Spot Opens Up  Arizona CardinalsJohn Harbaugh reportedly has interviews with 3 teams this week, Cardinals not on ‘inside track’  Arizona SportsEarly Buzz Has Cardinals on the Outside of John Harbaugh Race  Sports Illustrated3 favorites emerge for John Harbaugh's next job as head coach  Yahoo SportsNFL predictions: Who will land Arizona Cardinals' head coaching job?  USA Today",
    "published date": "Wed, 14 Jan 2026 02:26:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM1lzMXNLa0dTOVNVRHNnSFhlcVdSVFdhZlJ6S0E0TnJrdl9GY2pfck5pa3Ztcm53WkVqZS1Ibzk2Y2lPUEhvR3dOWm4yOVNtQU9aLVlrV3EwemE1dzl6OEtodHNDdWlaUUE2LWJyMy1MUmZlaDhvbS1XcEo5VHBzMHF1YnBwOUhCZDEyM3E3YThOQy1Fek9yeG91dTlWX28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.azcardinals.com",
      "title": "Arizona Cardinals"
    }
  },
  {
    "title": "Projected Lineup: Jan. 13 vs. Carolina - NHL.com",
    "description": "Projected Lineup: Jan. 13 vs. Carolina  NHL.comBlues 3, Hurricanes 0  Canes CountryBlues 3-0 Hurricanes (Jan 13, 2026) Game Recap  ESPNJim Montgomery claims Hall of Fame ceremony inspired Blues in Hurricanes win  Yahoo SportsObservations From Blues' 3-0 Win Vs. Hurricanes  The Hockey News",
    "published date": "Tue, 13 Jan 2026 17:40:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE95eVNlTnV4VU0xc1p1ZWVYSEppMXNxNXhaaVJXdzZYSnVYbTAtUmlLYkVpMmZLenRnYnJ6blF5V2FoZnM4dkFzY2VNVGpmOE9Gc3piWmhRRGlCbVhXRVZfQ0lFOGZPMTVSNGxyZlFtNzNHc0Jp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "MTL@WSH: What you need to know - NHL.com",
    "description": "MTL@WSH: What you need to know  NHL.comCall of the Wilde: Montreal Canadiens bring the fight to Washington, fall 3-2 in OT  Global NewsCapitals vs. Canadiens Recap: Shorthanded Caps Claw Out of Early Deficit in 3-2 Win  Japers' RinkCanadiens focus on process, not excuses after latest loss  Sportsnet.caCaps beat Canadiens 3-2 (OT) with Ethen Frank’s hard carry  RMNB",
    "published date": "Tue, 13 Jan 2026 13:42:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOem1YWnY3a09ZQkYyanZtb1g3WGRybGhlMUs0NDE3OG5zdm9BdmxrWGdORmVWR3A2V05KM3BIaFh3QVZMRm1QYzZ2b0xRM3RYemk3czJIckF1UTdGS0g1V0xFektKazhoMU5XWGV5LVJXRmVmSG90V2FhWTVLbFl4ZWxB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Houston Dynamo FC sign former Club captain Héctor Herrera - Houston Dynamo FC",
    "description": "Houston Dynamo FC sign former Club captain Héctor Herrera  Houston Dynamo FCMLS team set to sign 105-cap Mexico international  Diario ASHéctor Herrera rejoins Houston Dynamo  MLSsoccer.comTwo-time All-Star M Hector Herrera rejoins Dynamo  ReutersToluca agree to Héctor Herrera exit with MLS move in focus  Viva Liga MX",
    "published date": "Wed, 14 Jan 2026 16:05:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxORHVWODZoSE81RzIzZnNHemFVOWx3SUpCM2R0aUQ5ckxIMGRYb1BhLVVFV2tBNWQwanBjQ2VvYXVGcVdPdGdKMjAtMHBuM0RxblFiMEE5NjBYSHJFSHN3cndNLVJ0TWJmcXZlcEt2UlFjeTZhLUJkanJySmFYLUtoYTFSVS1WeXlla0YteEd4N0lLaHgzbzRCd2JR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.houstondynamofc.com",
      "title": "Houston Dynamo FC"
    }
  },
  {
    "title": "Devils' performance 'absolutely not good enough,' GM Fitzgerald says - NHL.com",
    "description": "Devils' performance 'absolutely not good enough,' GM Fitzgerald says  NHL.comFitzgerald: 'This Is On Me' | FEATURE  NHL.comThe Devils Are a Directionless, Dysfunctional Mess  All About The JerseyDevils’ Tom Fitzgerald on Quinn Hughes, trade deadline, slump: ‘I’m working the phones daily’ - The Athletic  The New York TimesDevils’ GM Tom Fitzgerald Speaks to Local Media  The Hockey Writers",
    "published date": "Wed, 14 Jan 2026 18:27:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNYnR3YmI1Uy11YVBabDFwZndUUUlPOTdSLUFJT0stRGZOU05vT3gtYVRMVk9NazlXMEpEbGFNQXQyOEY2VVNSOUFWUzA5ZVBwVjFnV1lNYy14YjBVVHpiQnpnd25Qcm02bGJlWVlpdXNYbW5HYWRPaVlXb2F0YmJJZ3JWTGVWQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Arbeloa: “I've been at this club for 20 years, I know the responsibility placed on me and I'm really excited” - Real Madrid CF",
    "description": "Arbeloa: “I've been at this club for 20 years, I know the responsibility placed on me and I'm really excited”  Real Madrid CFXabi Alonso’s Real Madrid sacking: The full inside story, from Perez’s power to Vinicius Jr’s outburst  The New York TimesBarcelona's Flick: Alonso has great future ahead  ESPNJurgen Klopp to Real Madrid: Former Liverpool manager a candidate for head coach role at LaLiga club  Sky SportsSeven players raise concerns over Xabi Alonso’s approach to senior club officials – report  Yahoo Sports",
    "published date": "Tue, 13 Jan 2026 09:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdGkwam1BX2VBU0wyMHhCNkR1Y2hTWjNER2t2TkFWdXRIS1dEQ3ljZVV1WWF0VlBCdXZld00xTE9pT3ZTOTJ4T283Q0pmZ0xoQlI4YWc3ZWFQWnNXSU1ub0tKR0g4WHBvNmJNbi01Xzc5UkIydU9DamJ5ekpzc2g3UVdpLUJxQUphdlJaRHlFcnEtcWRTczZnMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.realmadrid.com",
      "title": "Real Madrid CF"
    }
  },
  {
    "title": "Chargers' Khalil Mack pondering NFL future heading into free agency - NFL.com",
    "description": "Chargers' Khalil Mack pondering NFL future heading into free agency  NFL.comWhy Khalil Mack is Pondering Football Future After Chargers Playoff Exit  Los Angeles Chargers websiteOther contenders called but Khalil Mack didn't answer: Why he returned to L.A. and how he's become a mentor  ESPNDerwin James may have just revealed Khalil Mack's fate with the Chargers  Bolt BeatKhalil Mack Setting the Stage for Bears Return with New Comments  Da Windy City",
    "published date": "Tue, 13 Jan 2026 12:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPczctTVN1bGJyTzdreEpMNUZ1RWZfRDJOT1lLVzFWQUJKX3ZxdjZmX0lKTEZ0d25jVUFjY0duR1NRM0NLOTBqN01GT1dPaGNDcWRWR3g0TzFDWG5xbDN4OGhCSlVYcEJOZTJYaDRmMFhSWGZ3SnZMWmo2ZnhmSDFKUVc5WnZGZnRkYkVmdmRBaTlDakVzTVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "AUSL Unveils Home Cities - Athletes Unlimited Softball League",
    "description": "AUSL Unveils Home Cities  Athletes Unlimited Softball LeagueWomen's pro softball coming to Durham  WRALAUSL sets permanent home cities for all 6 teams, releases '26 schedule  MLB.comRosemont named AUSL host city, home of the Chicago Bandits  Chicago Sun-TimesAUSL announces Texas Volts softball as latest women’s professional team in Round Rock  KXAN Austin",
    "published date": "Tue, 13 Jan 2026 16:55:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFBHbWJjWHAweFRjQzQ5Y3dndzJFUGR6R25aRktsVUFHREVhRmw4UldveUJNalB0VTJPUGdVRjZuMVdENmhBYUJyZFU4UGVjYUp2SXhsWDVyQkZzNFRWWDdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theausl.com",
      "title": "Athletes Unlimited Softball League"
    }
  },
  {
    "title": "Point week to week for Lightning, status for Olympics unclear - NHL.com",
    "description": "Point week to week for Lightning, status for Olympics unclear  NHL.comInsider Trading: Point’s injury described as ‘not good’  TSNLightning centre Brayden Point week-to-week with lower-body injury  Sportsnet.caOlympic Men's Hockey: Who Should Be Canada's Top Replacements?  The Hockey NewsLightning’s Brayden Point out week-to-week with injury  Daily Faceoff",
    "published date": "Tue, 13 Jan 2026 23:20:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1EVFhFdEV5UExvTGs4ZENIeDllSEc4clBkOTJfLXB3QlVfZW9nX0RUVVNJSmhTRkJ5VjNvZnNVb3RDaE5kb0xEVkphVTh5cC1HcFFZZHJYTUIya0tQeXBKbmJ1MTczLWtiWnR6OEhxcGVzQml6djJ3R0xtcUM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "2026 Australian Open seeds - ATP Tour",
    "description": "2026 Australian Open seeds  ATP TourAlcaraz, Sabalenka top seeds at Australian Open  ESPNFour Canadians seeded at Australian Open  Sportsnet.caElena Dementieva believes Aryna Sabalenka is ready to conquer Melbourne  Yahoo SportsAustralian Open 2026 seeds  Australian Open",
    "published date": "Wed, 14 Jan 2026 08:26:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFA3REsySEVBUy1EZGZiM3I2cXNteHhiNjlXbVRidGF2TlpKUV9JY0tJR2JhYmNlMlNTWjlUN1lDMzNQOVF5N1pIWU9YZUtkZlpiSGJycmZiOUQ2WUpaUzhQQ1ZxdDFkd0FDZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.atptour.com",
      "title": "ATP Tour"
    }
  },
  {
    "title": "Everything to know ahead of Thursday's opening of the 2026 international signing period - MLB.com",
    "description": "Everything to know ahead of Thursday's opening of the 2026 international signing period  MLB.com12 Breakout MLB Prospects In The 2026 International Signing Class  Baseball AmericaAngels 2026 International Free Agency: Bonus Pool, Expected Signings, Full Details  Halo HangoutMLB International Free Agency Opens Back Up Tomorrow  Bleacher NationHere's where the Rangers stand ahead of opening of 2026 international signing period  Nolan Writin",
    "published date": "Wed, 14 Jan 2026 00:38:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1zNlBnLWZ5N1M5UDFGcl9CYW50QjlhdkpKWFRQWVFIV2tORjIyTEMwdlEtUF9mWFQ1dkJxX2RXZTZLYU9BaW9NTjhlUDVMYm1haUtQaUtNNlIwaVJDVkdVMWllQnpMdzhBTHF2cW5QX2duVnpWVU5CZtIBhAFBVV95cUxPdzgteWZvZU94SmlyYndnVlNRNWprU1E5UHlGS2NGTlprSVRJRm51YkVqZTVWTWZSX0tiSnN6UkN3MFRVNTMxOExuc05lczczaHB3RndlUzRhSkx3d0phdi1VSVFZLXZpVTRSZmlNR0hCakJ2WDZfVUdpMHdjaTlBV0Z0VlA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlb.com",
      "title": "MLB.com"
    }
  },
  {
    "title": "Jets happy to see ‘lifer coach’ Bowness back in NHL with Blue Jackets - NHL.com",
    "description": "Jets happy to see ‘lifer coach’ Bowness back in NHL with Blue Jackets  NHL.comWhat to know about Rick Bowness taking over as Blue Jackets head coach  NHL.comRick Bowness wins Columbus Blue Jackets coaching debut: Takeaways  The Columbus DispatchLast-place Blue Jackets fire Evason, hire Bowness  ESPNBlue Jackets fire coach Dean Evason, hire Rick Bowness as playoff hopes dwindle  CBS Sports",
    "published date": "Tue, 13 Jan 2026 20:19:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOUU5IY0RhUG40X2o2MnNFOGw0TkoweGVZTm12N3dOSEpXSXdvcFZORG5qSHRQTGFDUG1mN3hZUklJb2NvbWVDVVQ4a2U0ZXJrQnU0bHdGQWtqSzMwbTg3dVF0cG0tSTE5M2JTNm9fWjA5VDNtejEzbmwxSlNHSTltWGtFZzQydTh0VzBqSDRzWjhqeGQtdHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Patriots Make Changes to the Practice Squad - New England Patriots",
    "description": "Patriots Make Changes to the Practice Squad  New England PatriotsPatriots Release Veteran Following Playoff Win Over Chargers  NESNPatriots sign former Broncos starting wide receiver ahead of divisional round  Yahoo SportsPatriots add 4 players to practice squad before divisional game  98.5 The Sports HubPatriots reignite Bills rivalry by stealing much-needed familiar free agent  Musket Fire",
    "published date": "Tue, 13 Jan 2026 21:23:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQUFBqcHpMemNpQVVkdVRCZ0JtakV6WjAzTWx3dGh3c3M0MENyUlZLSTAyWFMzVlNxTWZ1R0luSkVZbGx4amY5OTlLUExKMUgtMlRoX29LQ0RTdi1DSE1UT3N4cWxzeHJEQUFOZnZRNzl0ZW5ZbTd0ZnQxNUo4bXpoeHBtb2otQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.patriots.com",
      "title": "New England Patriots"
    }
  },
  {
    "title": "Arrest warrant issued for WBA champ G. Davis - ESPN",
    "description": "Arrest warrant issued for WBA champ G. Davis  ESPNBoxer Gervonta Davis faces new domestic violence allegations, this time in Miami Gardens  WPLG Local 10Miami Gardens cops hunt for boxer Gervonta Davis in assault case  Miami HeraldBoxer Gervonta Davis wanted in Miami Gardens domestic violence incident: Police  NBC 6 South FloridaWarrant issued for boxer Gervonta Davis after alleged domestic violence incident, Miami Gardens police say  CBS News",
    "published date": "Wed, 14 Jan 2026 19:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPV0hZRlNiOERPdmhTUUpBekc2UVpUWF9iZk9PSXVyb3pEY1lXUmZrd3lqQklEWUx0dkQ3R2lmb3d3c0VQS1hGUXRwSmNia3JOQUU1VENmeDhYV01abVVwWVA1SEZUOWViNGJDb3dXbllfVDl3Y3VVc24wM1V4N0drVWZjN3M3d3ZiQUtWX0Fsd0s2V0Q5ZmxyQWxjY2JnSmFZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Here are each team's first workout dates of Spring Training 2026 - MLB.com",
    "description": "Here are each team's first workout dates of Spring Training 2026  MLB.com2026 MLB spring training start dates: Pitchers and catchers report to Florida, Arizona next month  CBS SportsBraves pitchers and catchers will have first workout on February 10  Yahoo SportsDiamondbacks report dates for spring training announced  Arizona SportsWhen does spring training start? Report dates for every MLB team  USA Today",
    "published date": "Wed, 14 Jan 2026 19:05:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE55M05UWk9oMDJQX2FIdDdJQzVnc2l5ZVltMFNlT1pJT1BacVctQVd3RjZkaEZsalBoQWw5ZVJVV1ZVTmJMM1E3bjJUWXlrSlF2bXJOT3c5SW0yM0lZRXhWTno2SGRfRkFtVUV5ZVEySGtxWFnSAX9BVV95cUxQcWRxT0tXd1dmcjNNbkFDYnNDRmNPT29XUHBPdlNJb2FhY0JRQ1RvNDcwei1IbHJCNFM2R1htUjNhTlk5ZW9USFBjYW96WEVtZjNfZkwzV1VCLVlpbFVudl80UXBCZmwwME1scmJJejFiWDYyVHFYT0dLXzk0bkMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlb.com",
      "title": "MLB.com"
    }
  },
  {
    "title": "Eagles sign 3 players to future deals - Philadelphia Eagles",
    "description": "Eagles sign 3 players to future deals  Philadelphia EaglesEagles future signing tracker | 2026 Offseason Roster  Philadelphia EaglesEagles sign several more players to future contracts  Bleeding Green NationEagles Announce WR Move After NFL Playoff Exit  Yahoo SportsFormer Penn State standout signs contract with Eagles  PennLive.com",
    "published date": "Tue, 13 Jan 2026 22:06:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOemVKWFo4UTJVTDF2MkV1VURrM0VIcHVGUHpVUk5MNVRXaUFKUHJlY0VTV1QyZF9WVlluMDQ2MFY2MjdTb1YyU3VMNlJCaGpTV1ZnanYtQWVocFpxaWRSQmZ3cXJUZUNvTUJwczNRMkptRncwVU1FV29Zd2dSSUdUQ1RtTWtqRUoyLUVJVHEwellqVVhzc0ZyUEo4U0M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.philadelphiaeagles.com",
      "title": "Philadelphia Eagles"
    }
  },
  {
    "title": "How the Head Coach Search Is Working And What They're Looking For - Ravens Home | Baltimore Ravens – baltimoreravens.com",
    "description": "How the Head Coach Search Is Working And What They're Looking For  Ravens Home | Baltimore Ravens – baltimoreravens.comMailbag: Will the Ravens Make an Offensive-Minded Hire?  Ravens Home | Baltimore Ravens – baltimoreravens.comA list of coaches the Ravens are interviewing to replace John Harbaugh  The Baltimore BannerBeatdown Roundtable: Klint Kubiak emerges as early favorite for HC gig  Baltimore BeatdownDolphins turn to rival Bills for latest head coach interview request  The Phinsider",
    "published date": "Wed, 14 Jan 2026 19:10:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTVgyYlkxQ2dQdHBQcDBpYUVuWmhSMzEwTV96NGh1QzREb2t0QW5nVXpyR2x2SUlDQmtaYmhvSjc5bmZvWVd4aVNOSTl3elRraFRTV0tNMlhody05ZUdLcnU2N2ltQlFOOGJEa0NlOW9zUkl0WTE4cmtlOXhHNVUwSkxzcUw2VjREdnhCdGs1WmdmeW5VV2FpVkRZNGxITVJYcDlPSGI1ODI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.baltimoreravens.com",
      "title": "Ravens Home | Baltimore Ravens – baltimoreravens.com"
    }
  },
  {
    "title": "Cadillac Formula 1® Team Unveils Special Edition Livery for Barcelona Shakedown - General Motors",
    "description": "Cadillac Formula 1® Team Unveils Special Edition Livery for Barcelona Shakedown  General MotorsGALLERY: Cadillac reveal special livery for Barcelona Shakedown Week  Formula 1Cadillac’s Road to Formula 1 Hits a Visible Milestone—Things Are Getting Real  AutoweekF1 rookies Cadillac reveal monochrome car for test  ESPNCadillac F1 Team Reveals Special Edition Testing Livery for 2026 Race Car in Detroit  Road & Track",
    "published date": "Tue, 13 Jan 2026 17:12:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNWDJuNkUxdVZ0eWpRN3pHLTRLeGFKSndvQm9QcWVnTjdjUTFIdnRpY21Celg3MzBGVW9DU3l6bjZGRVM4Y3UxcEJYZDI0ZkdQZUJ2TEo0NjNJUTh2Q251R1oxX2Z6bzZ0aURLZklRd0RqeVltS3VpWGRFRlU2X2VCdA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.gm.com",
      "title": "General Motors"
    }
  },
  {
    "title": "Seahawks Rookies Have Made “Huge” Impact In Team’s Success This Season - Seattle Seahawks",
    "description": "Seahawks Rookies Have Made “Huge” Impact In Team’s Success This Season  Seattle SeahawksCooper Kupp, DeMarcus Lawrence are sages; Jarran Reed’s task for Seahawks fans  Tacoma News TribunePre-Snap Reads 1/14: Rookies for Seahawks playing like stars  Field Gulls‘Job is Not Done’: Seahawks’ Vets Preaching Same Approach for Youthful Squad Entering Playoffs  Emerald City Spectrum",
    "published date": "Wed, 14 Jan 2026 01:04:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOUjNVQWx5R0d5eHJoSzlrX3gxZkw5bDZrZ1hrc1NZTTdoMUtuaEJvbUhIazFaM0o4cDM1LWxsOGh1aFdRRG1rblFfZEFjeTRtYURpcnZqdWpTSGJHVTBHbUMzeGJXVzYtNkZxMlQwYzRNTXpWWkl5aURYaUUxbDJzcXEybXpTSmtpX3V3SVRVdU9hdVJIRDZFdmpiYlZxZkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seahawks.com",
      "title": "Seattle Seahawks"
    }
  },
  {
    "title": "Israel Adesanya And Joe Pyfer Headline UFC Seattle In March - UFC.com",
    "description": "Israel Adesanya And Joe Pyfer Headline UFC Seattle In March  UFC.comJoe Pyfer blown away by Israel Adesanya fight at UFC Seattle: 'This is a life-changing moment'  Yahoo SportsFormer Middleweight Kingpin Tops UFC Seattle Lineup  SherdogIsrael Adesanya vs. Joe Pyfer odds: ‘Stylebender’ surprising underdog for UFC Seattle return  MMA ManiaUFC: Israel Adesanya to return against Joe Pyfer in March  BBC",
    "published date": "Wed, 14 Jan 2026 00:22:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQSnJoWkR0NzY3aGFoVFpWeUt6VUJVbGdqb1ZOM2lNQ0VqY1I5RlJraDYtcTA4UzRidDNrc0U5VzlSa2tlRnBKdldkRmlNcEI4ZHpTTUpKck80RXQ0UjQ5b0EwNDNqb3RJZWoteHNrRHMzZmhUU2hXZnZ6alhrZm04Zkg3by1xTFlM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ufc.com",
      "title": "UFC.com"
    }
  },
  {
    "title": "Endene No Longer On Iowa Wrestling Team As Hawkeyes Prepare For Penn State - FloWrestling",
    "description": "Endene No Longer On Iowa Wrestling Team As Hawkeyes Prepare For Penn State  FloWrestlingIowa wrestling removes three-time Division III champion from roster  Hawkeyes WireHawkeye top transfer Massoma Endene leaving Wrestling Program  KWWLA top Iowa wrestling starter has left the program before Lions-Hawkeyes; what did Tom Brands say about Penn State?  On3Massoma Endene no longer on Iowa wrestling roster  Hawk Central",
    "published date": "Wed, 14 Jan 2026 00:03:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOd1ZmWFFJOGNtM0VVTmk5ZS1ZNHAtMlZ6Yk9zRG92TDVXYjlHeHFYZjc5QnZwdVJMODhjU1hGdVdBMEdLY19NYzE1THAyTVZPN3BSUWhwblQ5NFJzZFVTc2pidVBFM195emZaZVdfVnBTeG42b1ZjZTZqX081NDBtQ0hkLXEzREU3TzlIY2puNGc2X0VveHpEb2NSS09CTmNra2E4WThHZXZKNjRLUklTR1pBMUtrYVliVExROERn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.flowrestling.org",
      "title": "FloWrestling"
    }
  },
  {
    "title": "Temple assistant, ex-Cornell coach Courtney dies - ESPN",
    "description": "Temple assistant, ex-Cornell coach Courtney dies  ESPNTemple University Mourns Loss of Men’s Basketball Assistant Coach Bill Courtney  owlsports.comGeorge Mason Athletics Mourns The Loss of Longtime Assistant Bill Courtney  George Mason University AthleticsLongtime college basketball coach Bill Courtney dead at 55  Fox NewsTemple University asst. men's basketball coach Bill Courtney dies  6abc Philadelphia",
    "published date": "Tue, 13 Jan 2026 18:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNQlVqSE1LSVo4NWxiamtfZ0M1ak9ULW1ndUF4bXBqWk1ncnFWQkhjVXRKT3JWQ1dfUEtJcmNaeTQ3ZlRkSmEtd3BmSE5CWXpVNGtCOEFHVW5MbnRYZldITnJqejVqNFd0NmdyOHVrU2drd0ZkUjQwM1Y4aGlrSTNVcTNPWTVDY2xVa2Z3NmJ5aFRNVGJjMFh4UzVnYVFzVlVmMXFicTYtSmhZMzUyeTFET0tRN01mZDQtU1loag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "2026 REGULATIONS EXPLAINED: All you need to know about F1’s new power units - Formula 1",
    "description": "2026 REGULATIONS EXPLAINED: All you need to know about F1’s new power units  Formula 1Every 2026 F1 car and livery revealed so far  The RaceHow Formula 1 Teams Are Preparing for All of the New Challenges Coming in 2026  Road & Track\"Most will be overweight\" - Why drastic 2026 F1 targets still weigh on teams  Motorsport.comHow to follow the unveiling of new Red Bull 2026 F1 car live  racingnews365.com",
    "published date": "Wed, 14 Jan 2026 16:03:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNZUZvV0wxNmFWd0VWTUFmb2I0eWV1OEVfZVdhSERLZ2EyT2IzbGJfUTU2U3JlenVBc0VPUFQtWHdNcW1CbkpBY3NMODVqWVRnU2RCa1FJYXB0SFFnZV9HY29KWE5lUnFqakxVSFJTdmZVb2dHSEJuY213c0h5OVp4VVJHdlZnWDBWOHB3TlhlcXYwQXpjeUxmbUR4aEJOT0hxOHNKU1ZUSGRjRG9Bb0JZWVJrOHBmdUFmaDdUanBJc0xWc0dIOFkzYnZTNWhieUd0RmN4RExB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "The Athletic: 2026 NBA Draft Top 100 prospects - NBA",
    "description": "The Athletic: 2026 NBA Draft Top 100 prospects  NBAUpdated 2026 NBA mock draft: Which new names enter the first round?  ESPNCollege basketball buy or sell: Is Kansas' Darryn Peterson still the best prospect in the 2026 NBA Draft?  CBS SportsWhere AJ Dybantsa, Darryn Peterson, Cam Boozer Land in ESPN's Latest 2026 NBA Mock Draft  Bleacher Report2026 NBA Mock Draft V.3  No Ceilings | Substack",
    "published date": "Tue, 13 Jan 2026 22:05:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1UYmpPbUJzME9pSTFQYTdCeFUtajEwazNzRkhFQTl5YUhHQURWYkxacXg5SkNyOXlVaFppTEhmLVFJTjQtMVcwQ000TXFjWGZXcFdaWlUzdGxTdzU2Y0R0U1JrYnp0X0taN19tb2djNjFVaG9JSlQta1pB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "Stenhouse Jr. to make Craftsman Truck Series debut with Niece Motorsports at Daytona - NASCAR.com",
    "description": "Stenhouse Jr. to make Craftsman Truck Series debut with Niece Motorsports at Daytona  NASCAR.comRicky Stenhouse Jr. to drive two races for Niece Motorsports in Truck Series  Jayski's NASCAR Silly Season SiteDaytona 500 winner Ricky Stenhouse Jr. set to make NASCAR Truck debut  Motorsport.comStenhouse joins Niece Motorsports for pair of Truck Series races  RACER - Racing NewsNASCAR Cup Series star announces Truck Series debut to face Tony Stewart  Daily Express US",
    "published date": "Wed, 14 Jan 2026 15:33:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQYjVXOVJTWEJlRzUzLWJic0JSZld6N05VMkZVSzFVdENvbll3eFBEUVZwNGI5a05rdTVRTnVjeURDLVJVZ0I2dEItQ3lrVTJlaDY5Ml8zV1k3TTAxTjZfRzQtZTMtYkVsOC1ieGhoeklRUjRqblh3VjJ4eHI1YXY5M3ppaGFGVEpqdUw3STZ3NEFINGpLRVBqa1JaaVlpR2Y1MHlOUWpVdzRDMVRWUVljQdIBtgFBVV95cUxNT09xdlFvNzBSLVVvamZ1YW5pbVVLX1VoSHkwZkx5MGg2VHF2SWdadzJfQzg5dmR6NDBvQWhZOUV6aDFpODRUUGtHUkNlNzJHLVFqeEdnWExuZkFpcHpXUnF6ZU5GU3dMOEZmRVdnVEFDeFlLMDlfcGgtQ2FsOTV3dmtwWWhLQ3ROaGt4aGIyeWhhYVd2YWtWdTNic0dMTHkwQ2RmTXpQNjdaSkpTVElHODBfVGNBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "NFL news roundup: John Harbaugh interviewing with Giants; Patriots add ex-Texans DE to practice squad - NFL.com",
    "description": "NFL news roundup: John Harbaugh interviewing with Giants; Patriots add ex-Texans DE to practice squad  NFL.com",
    "published date": "Wed, 14 Jan 2026 15:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQb0NCOHlObXc0MzdYS0JYTmdHWTBWYU1oMFFGd1hrRk91a2toSkJZZVNnTDVjZ0FMeGE4a2lVS0ItcTg4UEF1b04yR1U2amZYRDh1VWtVQ2JQQ2pvaU16bDZLeFZFTzhxX2k1SWZzZUh4bGtoX29GUlAwcURzQWdqOWtLb1dRY2FTSGhvdjVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Making sense of Bellinger's latest complicated free agency - MLB.com",
    "description": "Making sense of Bellinger's latest complicated free agency  MLB.comSources: Yankees-Bellinger talks at an impasse  ESPNBetting odds on Cody Bellinger’s next team. Where do the Mets and Yankees stand?  NJ.comThe Opener: Bellinger, Relief Market, MLBTR Chat  MLB Trade RumorsYankees-Cody Bellinger staredown features disconnect over free agency trends: Sources - The Athletic  The New York Times",
    "published date": "Tue, 13 Jan 2026 03:02:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1kT1VYeFdybzJwdHBvaWFxTElibklUNHhOMnV5UnU3RDhiXzJxdVJHS3BpYU5aS0VFdnNuWWNtdGthNm8xdXRUNm9zMHlPZHVVb1JzMFpBVzRXSTN6UnNYNFg1ck5rdV8xSU4zY9IBeEFVX3lxTE9VSURZNmJZY0dFVmt6TVV1YlZXOC0yZVMxY0hNeVBjZHZuSUU2YUVXRTRmR1pBUjlqVU1rLWU5ZUdIQTRpc1JKT3pqZFNsTlBzWFRhSmlIUTNrQWpobDBwODljYmJyV194ZXF0VGVPdHlta1JoN284LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlb.com",
      "title": "MLB.com"
    }
  },
  {
    "title": "GALLERY: Racing Bulls unveil race suits for 2026 season - Formula 1",
    "description": "GALLERY: Racing Bulls unveil race suits for 2026 season  Formula 1F1 fans deliver verdict as Racing Bulls reveal 2026 team kit and race suits  Motorsport.comRacing Bulls drop F1 2026 livery hint with team kit reveal  racingnews365.comTop 5 Red Bull Racing Liveries of F1 history  Oracle Red Bull RacingNew kit for Lawson and VCARB  Talk Motorsport",
    "published date": "Wed, 14 Jan 2026 13:49:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOZko4bTZueHdibG5BbnJWV1hTN0hWNk8yMGhlMDhrZWdHWVNDVWs5X1Vac3VoSUtVcllIX2ZnMXRGRXc1RzU5ZGkydTNIRW5QdXhXYTlxRURQQ0JrZDN1c1lWbFdWeDBzZ3I4NHBLTFZqenVsSXdMVEhYR01JSHNTeDcxUWdzMDc3bGNZVUVoajJGMGZ5UElBcHZRR3VyOGpWUXFCcVFaYlRBVjFHV1hKRXktLUlsTEotWGNJZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "Grace (Ind.) Remains at No. 1 in the Fourth Poll Release and Everyone is On the Move - NAIA",
    "description": "Grace (Ind.) Remains at No. 1 in the Fourth Poll Release and Everyone is On the Move  NAIA",
    "published date": "Wed, 14 Jan 2026 16:04:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9Ecldxb3Nqb0lrMGRHUWphX2c4MTdmMHFoSUtXcE5sZ2tuTUE0UzZHVlhwc19OSHFnbGZtV1JyQ3VuOC1acmYyUS1EMng5SHo0b2tpdFZtaVlXekN3SDktSGgyZnM5Rkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.naia.org",
      "title": "NAIA"
    }
  },
  {
    "title": "2026 Head Coach Candidate Tracker: Raiders interview five candidates in first week - Raiders.com",
    "description": "2026 Head Coach Candidate Tracker: Raiders interview five candidates in first week  Raiders.comLas Vegas Raiders coaching search 2026: Thoughts on where it stands  Silver And Black PrideRaiders predicted to hire award-winning head coach to replace Pete Carroll  Yahoo SportsFresh prediction for Raiders new head coach will be loathed by fans if it happens  Just Blog BabyDerek Carr’s Brother Names Favorite for Raiders HC Job  Heavy Sports",
    "published date": "Wed, 14 Jan 2026 18:15:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1GQkU4MG1DRllUV2F2NFZVZk5rTWRQZTVZeWhhYWR3Ni1XeFhlakVHV09wWkUzLVAxMENTeVVTRy1lOU5ELWQ2V1JTVXJGV05SQzZPMkhvNW9jSjIweDc3WTlMblZXdEtEY2Z1V2J0YlRIa3Blb3FCNmx3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.raiders.com",
      "title": "Raiders.com"
    }
  },
  {
    "title": "Geekie back for Bruins against Red Wings following birth of son - NHL.com",
    "description": "Geekie back for Bruins against Red Wings following birth of son  NHL.comMorgan Geekie back in Bruins’ lineup against Red Wings after he and wife Emma welcome son Max  The Boston GlobeWhy did Morgan Geekie leave Saturday's game vs. the Rangers? His wife went into labor at TD Garden.  Boston.comMorgan Geekie, wife Emma, welcome second child  MassLive.comBruins notebook: Geekies welcome baby boy during hectic day  Boston Herald",
    "published date": "Tue, 13 Jan 2026 17:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQbnY5S2h4SmgxbkphbGVUVGFmVGRUQzZMNV90aWNwczN3ZTBrZ3VoUmwxOXo2dDZmekREb3pjRmJTQzgzcVlGRDZFLVZTSE1BQlVFWlZjUnJuUE9nR3Zmd19tcm5DTUJTV1h6VUNrZm5xSXZjSUFkbWpQMUNSMW5zdEZpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "EXCLUSIVE: From trendsetters to title winners – Ross Brawn reveals his favourite car designs - Formula 1",
    "description": "EXCLUSIVE: From trendsetters to title winners – Ross Brawn reveals his favourite car designs  Formula 1",
    "published date": "Wed, 14 Jan 2026 16:29:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPUm9HeVNEcFAyVGY0V3NyNl9SenVfSU1wekNGang1OS1qZGpNbjVEdTVTYlJkeDRwQ3ZmbnhCX2U0amw3UVRaampmQlBJQWYzcHdnbUZxYmppVmtNalNBLU1JR2llTUxlTlphSS13ZVBvYS13NEFmYzlBczBvU1ZMeVctR2t4cTdFek1HdmFEQUJoNkgxUWpXdVA3Tl9abkpHUjZmMHlDZG8zNFRWc3JqMExJaGNoWlJFS2dqUDRhVXFBYUlaMXZQbTIwRmIwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "Kaulig Racing taps Tony Stewart to drive All-Star truck at Daytona - NASCAR.com",
    "description": "Kaulig Racing taps Tony Stewart to drive All-Star truck at Daytona  NASCAR.comStewart back to NASCAR for Daytona trucks race  ESPNTony Stewart returning to NASCAR for Trucks race at Daytona after 10 years away - The Athletic  The New York TimesNASCAR rivals inspired, intrigued by the return of Stewart  RACER - Racing NewsNASCAR Legend Tony Stewart Announces Return To The Sport  Yahoo Sports",
    "published date": "Tue, 13 Jan 2026 17:01:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQdm5STFYxTUFmdV9aTU1jZ0R6TTdFUGw4d1F1T3NLU3huZElWMWJsS0lVUVd1dnVLSnBVZ3U2LUYwNEdXcjZGallqbWo3YTVsdlFOcktjOTJ5Vll3ZU1aRXd0Nm1TUXI5YkgxTU44YTY3dk42b1hNbC1hSkVOZVQ1VDVaY19uNzBPZ19GME8xVFlObHB4c1dwbHhRbDhDOUxHX0hRQlFPQndBUjBQNG5ObGpR0gG3AUFVX3lxTFBMbTJCRVlFYjVoUmdLaVp4dkhsZjJ5amxpbXRfNjFkTlZaY3dRZDV6a1R6UXJGYjFva1VONHJTNlRPTUxsUFc5TUNNRHZPell3cF9VTlU2cVZrZ2pfOUc2S19oX200bkF6OUpVWlJJYlQ0dk5USjJkbjRpZHo0S3NMWW1yN0ZpOXp3VU1oWXUxajE5eDVuUG4xUExlQ0E4cGxZOVpRUVBqbEEwazE1Z2IzekJsOWxOTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Marner's reception in upcoming Toronto return with Golden Knights will be interesting - NHL.com",
    "description": "Marner's reception in upcoming Toronto return with Golden Knights will be interesting  NHL.comInside Mitch Marner’s life after the Maple Leafs: It’s complicated - The Athletic  The New York TimesSIMMONS: Mitch Marner will be cheered in Toronto - just not now, not yet  Toronto SunMitch Marner has a new team, new position and new chapter — and no regrets about leaving the Maple Leafs  Toronto StarBreaking down the pros and cons of Mitch Marner’s departure from the Maple Leafs  Yahoo News Canada",
    "published date": "Wed, 14 Jan 2026 19:21:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNWGpUbW52Z0wtNzZKMEFGeFkyc0JaeFdaSHpCQ09GbjBCcGI5eGo4V2NVVEdyeHpKTVhmRlppU1dpd2VISlRXOENGTlExOXlfYnBGNTVTY1VCRFFaNkFfaF90R3VvbjdBMnhZTVhxSDliUmFMWVYyU1gteXJfT3hud3hpNVNNZDM0UkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "NHL Status Report: Reimer could make 1st start for Senators at Rangers - NHL.com",
    "description": "NHL Status Report: Reimer could make 1st start for Senators at Rangers  NHL.comFormer Red Wings goalie back in the Atlantic Division  MLive.comJames Reimer May Debut For Senators Wednesday In Rare Battle Of Goalie Geezers  Yahoo SportsSenators sign Reimer to tryout | TheAHL.com  The American Hockey League'He's Going To Be Amped Up': Dubnyk Is Excited For NHL Veteran James Reimer Signing With Senators  The Hockey News",
    "published date": "Wed, 14 Jan 2026 20:20:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1oYzFzSkI1YmVsMFlwc0djY1pySzdDbXE4WExhbWc1Ty16bWFUUkR1b2pFRmdXY2JDZXN1NXFzQWp4YmVUYnh6MXpSWlEtRy14ME1vN3hpSGoxYl9sb1NRdkxXR3JWa2Zoa2thdDhDTnoxVV9jemlZRVc4Mm9MQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  }
]