[
  {
    "title": "Sony WF-1000XM6 Earbuds Review: A Cut Above - CNET",
    "description": "Sony WF-1000XM6 Earbuds Review: A Cut Above  CNETI would easily replace my AirPods for Sony's XM6 earbuds - if it weren't for one unavoidable issue  ZDNETLeaked specs for Sony’s next flagship wireless earbuds reveal ANC upgrades  The VergeSony’s New Earbuds Offer Fresh Design and Top-Notch Noise Cancellation  Bloomberg.comThe Sony WF-1000XM6 are here: Price, specs, where to buy  Mashable",
    "published date": "Thu, 12 Feb 2026 16:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1kblItdXdVVnhxQm5sNnh1LWJXQmVVWmRXa25MQTRvcXgtSVBwOHZRRXlPbURPOTZTeFluSm1JXzlDWTRSSGtmeFdTVVZIeElUeDRKQ3RmR01JcmVzZzlKLXNObHVFa3ZQTlpVX21obFZxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnet.com",
      "title": "CNET"
    }
  },
  {
    "title": "Samsung Galaxy S26 colors, renders leak. See them now. - Mashable",
    "description": "Samsung Galaxy S26 colors, renders leak. See them now.  Mashable[Invitation] Galaxy Unpacked February 2026: The Next AI Phone Makes Your Life Easier  samsung.comSamsung’s offering up to $900 of trade-in credit toward its new phones  The VergeSamsung Galaxy Unpacked 2026: Everything we're expecting from the S26 launch on February 25  EngadgetSamsung to Unveil AI-Charged Galaxy S26 Smartphones on Feb. 25  Bloomberg.com",
    "published date": "Thu, 12 Feb 2026 17:10:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBZVVNYczRmc0VaUlhwbktLSmNSWGZjRkd3akJxT2VMYTJEUm1pOWRRNy16c1Rza3g3TTFDMjJxY0xuWFgtZzZYcFFLay1qaFpMN0lEYmtUcHVJWFMxbllvOTBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mashable.com",
      "title": "Mashable"
    }
  },
  {
    "title": "It took two years, but Google released a YouTube app on Vision Pro - Ars Technica",
    "description": "It took two years, but Google released a YouTube app on Vision Pro  Ars TechnicaApple Vision Pro finally gets an official YouTube app  MashableApple’s Vision Pro Gets YouTube, but VR Demand Keeps Sliding  TipRanksYouTube Is Finally on the Apple Vision Pro. Can We Expect More Google Apps to Come?  CNETYouTube finally launches a dedicated app for Apple Vision Pro  TechCrunch",
    "published date": "Thu, 12 Feb 2026 19:53:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOcDBqYWpFLUpVNjBGWkY2MkJodFQ3aEVqSzJldWxXQkI2b09Na3lGTFFSRnRBUFR5YUFhSkcwbDhzNjB0RERILXlEc2xZbDdnZGwtVUE0ZkZZeTNheU96TC1ybFp6R1RiSzVUajIyeG9jSWNLMGVsbGRqa19vUFNxV2RTV1BKZXF1YWNlbmxCSE1zMEd5WGIxa0RCQ1pGdFg4NmhGaFlWYVFyQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Control Resonant Looks Mind-Bendingly Awesome in First PS5 Gameplay - Push Square",
    "description": "Control Resonant Looks Mind-Bendingly Awesome in First PS5 Gameplay  Push SquareNew gameplay details on Control Resonant’s supernatural action  PlayStation.BlogThe first Control Resonant gameplay trailer shows Dylan defying physics in a sideways NYC  EngadgetFinally, State of Play gives us a proper look at Control Resonant  PolygonControl has topped 5 million sales and attracted 20 million players  Game Developer",
    "published date": "Thu, 12 Feb 2026 23:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOZFlhcG1hQlZUbXo2RG5hc2ROTkVOd2tkbWxMSlVXNVA0UlJGUmNmSHlBVmx5OVhmek54SU8teFBCS01xUVdPZlBDTW52TUxTeHhRVWEwWUxEQ0dfTGNTa0stSkRLNTNRX3JKSzdNbGZIZkJDZGZ4YTZqS0NvZE9RdkFaejdieV9SbFozM2x3NExoV0FSZFA5b3VlbUs4QXNlcC1OeFJoczhqMjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pushsquare.com",
      "title": "Push Square"
    }
  },
  {
    "title": "Sony State of Play February 2026: Everything announced - Eurogamer",
    "description": "Sony State of Play February 2026: Everything announced  EurogamerState of Play returns this Thursday, February 12  PlayStation.BlogEverything Announced At The February PlayStation State Of Play  Game InformerPS5 State of Play February 2026 live updates — God of War Remake, MGS Collection Vol. 2 and every game announced  Tom's GuideEvery big announcement from PlayStation’s February State of Play  Polygon",
    "published date": "Thu, 12 Feb 2026 23:43:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOM3Z3UzZKV1ZNeGRZR3ZGR2lBQ2lSajBhLVRBMHVDUHQ4RGVqcmxQZUxTdWRUcDFvWUZKR2Nvb1pURjBjOW5acjdnLWc4YkY1MmpuczczTXVxN2ctS1dXNVZMSFlGbUlIN1p5WkZ3UXZ6UFVPU3NjbUxhbnFrbTJzejdkRzhnZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "God Of War Trilogy Remake Announced, Brings Back Original Voice Actor - GameSpot",
    "description": "God Of War Trilogy Remake Announced, Brings Back Original Voice Actor  GameSpotGod of War Greek trilogy remake in development & God of War Sons of Sparta out now  PlayStation.BlogSanta Monica Studio Is Remaking The Original God Of War Trilogy  Game InformerA surprise God of War prequel is out on the PS5 right now  The VergeGod of War Sons of Sparta Spin-off Out Now, and God of War Trilogy Remake Announced | Sony State of Play  IGN",
    "published date": "Thu, 12 Feb 2026 23:23:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNTE80eXBhV2lHRkpKV241VEhJTlRYMWJMaUtVYlA1Vmo4aFRfT19BSVlVcHJDNExIYl9EZmxQdGJjNFEwcTkxY1lta19mMGJRRmU0NlFiNUlKSGRaSWpmTG10RVpoLU5oUHl0WDE3N1RXUjh0MDJiY3lpdkxKbTRsSmJSQW1CMmk1eGZtU2prZzRubjNuQjZvVF93WFl4SkRSYkplMlRJYUNNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gamespot.com",
      "title": "GameSpot"
    }
  },
  {
    "title": "3 Years Later, John Wick Is Officially Back - Collider",
    "description": "3 Years Later, John Wick Is Officially Back  ColliderJohn Wick game announced for PS5  PlayStation.BlogLIONSGATE ANNOUNCES HIGHLY ANTICIPATED AAA JOHN WICK VIDEO GAME WITH SABER INTERACTIVE FOR PC & CONSOLES  Saber InteractiveUntitled John Wick Game Is A Gun-Fu Brawler Being Developed By Saber Interactive And The Movie's Director  Game InformerKeanu Reeves Confirmed to Star in New John Wick Game from Saber Interactive | Sony State of Play  IGN",
    "published date": "Thu, 12 Feb 2026 23:26:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1DckhmZzlNQmQwWW5URjZ1bHVsSFo4MEJJMmt6MHU5UHlMSW5MeFVxWG9LRThUaG9yVGdqLVA1dHhrRHpoMnljMHhMWm9VU2xMay1vRW03eHZaM0FEVW51bGRCRWJCV1lEM2pXdkV5TUNlcjY5dU4wcUxn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://collider.com",
      "title": "Collider"
    }
  },
  {
    "title": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month - IGN",
    "description": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month  IGNLegacy of Kain: Ascendance Brings the Acclaimed Franchise into a New Stylistic Direction  Xbox WireLegacy of Kain: Defiance Remastered launches on PS5, PS4 March 3  PlayStation.BlogNew Legacy Of Kain 2D Action Game Announced Alongside Defiance Remaster  Game InformerLegacy Of Kain Is Back With Two New Games  GameSpot",
    "published date": "Thu, 12 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQLWtVa2w5bUVBMm43bGdUZ2xVeTBtZGZYUEE2ekN0cWpiTF9ab0ZnYjE4aEdYcG9vUzBCMkpxaGNlR1p6Q0xZRkQwMkVLWHF3b1BZWW82S3Zqang2QXNTOVR5ZUgyY2hybFl4dUdsdUtVY19Nc0tZNHFydVBZdXhWZmtFTm56akFHbDV3b0pLTldUdGpBSlhkb1paQXB3M0VQelRuRVJzYzgybS1vN1BfOXA1aTNURTQ0MGR4T0VJMDRmTmlP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "Rayman 30th Anniversary Edition Releases Tomorrow, Collects Five Versions Of The Original Game - Game Informer",
    "description": "Rayman 30th Anniversary Edition Releases Tomorrow, Collects Five Versions Of The Original Game  Game InformerRayman: 30th Anniversary Edition releases Feb 13 on PS5  PlayStation.BlogRayman 30th Anniversary Edition Announced — And It Launches Tomorrow | Sony State of Play  IGNRayman: 30th Anniversary Edition revealed for Nintendo Switch, out tomorrow  Nintendo EverythingPlay Rayman: 30th Anniversary Edition Tomorrow!  Ubisoft",
    "published date": "Thu, 12 Feb 2026 22:29:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPWXBabWcydE1hWWVfSVBESW9VTnJWTl8tZVBEVVFaVnplSVh6ek5HaFg5OGRERVVnLUV6bDRjTmpUdkNOT2pIVzVDaHozQkVLTXRYWWR5a0tFN1ZWMVNFeEtWT1RQM3VOQVZGNDlzVWhscDlfZm1mWVV4QUhXVThEUW1TTFpXcWgwYjVTVEtZbGprbHI5clYzaDZNNTFoLXdBNTBscU5YMzYtX21kRzhZbm8ydGpuVm9idmRYRWVTWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gameinformer.com",
      "title": "Game Informer"
    }
  },
  {
    "title": "Castlevania: Belmont's Curse Unveiled For Switch, Launching In 2026 - Nintendo Life",
    "description": "Castlevania: Belmont's Curse Unveiled For Switch, Launching In 2026  Nintendo LifeCastlevania: Belmont's Curse, Made By Konami And The Dead Cells Devs, Launches In 2026  Game InformerCastlevania: Belmont's Curse, a New 2D Castlevania Game, Announced | Sony State of Play  IGNCastlevania: Belmont’s Curse launches this year on PS5  PlayStation.BlogCastlevania: Belmont’s Curse announced for Nintendo Switch  Nintendo Everything",
    "published date": "Fri, 13 Feb 2026 01:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPcVVoRXc0UW4zLUt2bTFaY3NSVWE0aVFkV3pJbFlXZmV5UWxnSEg1bFQ5bUdGN0o5a2doMGRJaEVWNnBRalFjRUZqT0I1S1hQZTFtd3RWS2UzWWo5MUd6dS1pQklCbmJGWTk0LS1sRlJpc0hjUzJlU2FXYTNDenJzb0xlWHpPb29QOTJPRUdZampxSE9XaFBYOXV4ZUtQbVFtX2pvVVV1QmYzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nintendolife.com",
      "title": "Nintendo Life"
    }
  },
  {
    "title": "Metal Gear Solid: Master Collection Vol. 2 revealed for Nintendo Switch 2, Switch - Nintendo Everything",
    "description": "Metal Gear Solid: Master Collection Vol. 2 revealed for Nintendo Switch 2, Switch  Nintendo EverythingMetal Gear Solid: Master Collection Vol.2 launches Aug 27, 2026 on PS5  PlayStation.BlogMetal Gear Solid: Master Collection Vol. 2 Finally Frees Guns Of The Patriots From Its PS3 Prison  Game InformerMetal Gear Solid: Master Collection Vol. 2 Finally Frees MGS4 from the PS3 With August Release Date | Sony State of Play  IGNThe next Metal Gear Solid remaster collection arrives this summer  Engadget",
    "published date": "Fri, 13 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOM2VyUUtqNFFSU3E3RE1UR05MVkdTN2RmZjkwWmVTY3FwUnp2eTktS04wVmoyak1YTHBDbkV5RTZVVW9KWFV0amdFVld3LXhiQXNPYTUzaE1XbHQ5VHR6cTNfMDhqaDE2dnVtSXZxdUUxTUYtSzFodFVNeE9lR0MybTFva3E2TFFOVEEwMkhhNndsMEZOemZpQS1idjZlalg4SGpSa2dkQmpLLTdQeVJZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nintendoeverything.com",
      "title": "Nintendo Everything"
    }
  },
  {
    "title": "Silent Hill: Townfall launches in 2026 for PS5, PC; reveal trailer - Gematsu",
    "description": "Silent Hill: Townfall launches in 2026 for PS5, PC; reveal trailer  GematsuSilent Hill: Townfall reveals first-person gameplay in a new trailer  PlayStation.BlogSilent Hill: Townfall Is Coming This Year From Konami And Annapurna  Game InformerFirst-Person Silent Hill: Townfall Transports the Series' Survival Horror to Scotland  IGNSilent Hill Transmission Showcase Highlights Games Tomorrow  Siliconera",
    "published date": "Thu, 12 Feb 2026 22:49:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQMTRCa2J3MWo0NTVwUGJKMmFGM3RRWU9sczBFWFVXZjcteDNCaW9JOFdWMkpBZkVvRVZWS1hORTBuRktmX051SzlrZ1NKRFBON2VXeEhZNnNpNE1McmxXREhYWnVtZzhPXy16dmdXbldJS01EQkU5by1CWmxrd0R1Q0s3Qi12UU1JT2JpZHJ0TThRLWI5MGV2dG5rYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gematsu.com",
      "title": "Gematsu"
    }
  },
  {
    "title": "‘Marathon’ Announces Free Open Beta Release Date, And It’s A Bit Late - Forbes",
    "description": "‘Marathon’ Announces Free Open Beta Release Date, And It’s A Bit Late  ForbesMarathon’s Server Slam Begins February 26  Bungie.netMarathon Reaffirms March Release Date With February Server Slam | Sony State of Play  IGNBungie is hosting a Marathon 'Server Slam' weekend later this month  PolygonBungie’s Marathon Will Be Free To Try During A Server Slam Ahead Of Launch  Kotaku",
    "published date": "Thu, 12 Feb 2026 22:57:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPTTVDbWxkWkhLNTdXSVpxT3J0by1NSGowYUszR0hOMG5wNlVWN1ZtOFdaNkUwekhMeERVS291X3ZKVTZRbGFwM2Fway1DaDBnWmN1Um1nQmIwMWFYVldjZmM3WS1CclR6SU1oQ2M1QVhuRHFaQlJZWmhNM2JOMVBYbnBneTZxS2p1eGtOV1pOLVhSZlpzcHdPdm5wb2VvOFRRSmtraFE3OVhDTXBkTzJWdndlZFprQ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Monster Hunter Stories 3 Preview: Me and My Pet Rathalos - IGN",
    "description": "Monster Hunter Stories 3 Preview: Me and My Pet Rathalos  IGNMonster Hunter Stories 3 Fixes One of Pokemon's Oldest Flaws  GameSpotPreview: Dizzying Detail, Fluctuating Frames - A Good Look At 'Monster Hunter Stories 3: Twisted Reflection'  Nintendo LifeA surprise JRPG on Xbox and PC is outshining Pokémon in all the right ways  Windows CentralAfter 12 hours, Monster Hunter Stories 3 is just as grand as a mainline game  Polygon",
    "published date": "Thu, 12 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObWw0bG5OaUtXOGFyb202amhWMmhiellHVzhrUFdsZmpzZEdhMkJacEtUQmtWcVQ5ZExEMlVlZEQ3NDVxeTN4TVZwVFFJZENtaWppeHctZXlLUXBnMnJKeS1MS0h1UF9xUi1NNExLYW84NDlXalBXQ2NJUkotblhULVNpRE1yaF8ybnJkYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "Hopes Fade For Early 2026 Apple Siri Release. Apple Stock Drops. - Investor's Business Daily",
    "description": "Hopes Fade For Early 2026 Apple Siri Release. Apple Stock Drops.  Investor's Business DailyApple's stock has worst day since April as iPhone maker faces FTC scrutiny, reports of Siri delay  CNBCHere's Why Apple’s Stock Dropped 5% Today  Yahoo FinanceApple’s Latest Attempt to Launch New Siri Runs Into Snags  Bloomberg.comApple sees $200 billion market-cap wipeout as stock slides on AI fears  MarketWatch",
    "published date": "Thu, 12 Feb 2026 22:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPSzRnNElMbHdlQy1ZNm5CazQwSjZ1MHRLVDVQTHBQX3R3N0trNE9sZU5ldWI0ZDM1Sm9YWHBJem43dmI5bkpLb2N1UlcwMWo4LWpOLXViM1VVTEdyMTB2N1N0dlFBZ2dRQ01zLUZXRTJVQ2p1SUxkOUlXbHFMRURPa184SUFDekxWX04xNURLWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "DEAD OR ALIVE 6 Last Round announced for PS5, Xbox Series, and PC - Gematsu",
    "description": "DEAD OR ALIVE 6 Last Round announced for PS5, Xbox Series, and PC  GematsuDead or Alive 6 Last Round launches on PS5 June 25, new game also in development  PlayStation.BlogDead Or Alive 6 Last Round Arrives In June, New Dead Or Alive In Development  Game InformerKoei Tecmo Reveals New Dead or Alive Game and Dead or Alive 6 Last Round | Sony State of Play  IGNTeam Ninja is working on a new Dead or Alive fighting game after half a decade in hibernation  PC Gamer",
    "published date": "Thu, 12 Feb 2026 22:18:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxON3FVd3F3cWp2RUtWZ0Q4c3BVSTI1LVVqbU9waW5jWE9sbng1NExwRXVxTzd6WjRGcWEyZ3d2ODhjQVlfcC1KZC1FZE9kcE82SzhDb2JzZUtHWl93VUZQd1preHowTUNjUVdXdzB4M3NXdXRGZEhIVTB4V2FGd056SHdwT3ZsdG41c1N0OG42Y0hBMWFpamU0Mkpnbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gematsu.com",
      "title": "Gematsu"
    }
  },
  {
    "title": "Open world PS5 game Project Windless is part-God of War, part-Dynasty Warriors, and has a veteran Far Cry director as its lead - Eurogamer",
    "description": "Open world PS5 game Project Windless is part-God of War, part-Dynasty Warriors, and has a veteran Far Cry director as its lead  EurogamerProject Windless Is A Dynasty Warriors-Like Action RPG Where You Play As A Sword-Wielding Chicken  Game InformerPUBG Publisher Krafton Finally Reveals Project Windless, an Ambitious Open-World Action RPG From Ubisoft's Former Far Cry Director | Sony State of Play  IGNProject Windless Announced, Brings Open-World, Chicken-Based Carnage To PlayStation  MMORPG.comPlay As A Ripped Bird And Drink Tears In Project Windless  Cinelinx",
    "published date": "Fri, 13 Feb 2026 01:01:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBmaDZpWXRlUU82YUFuTjlIYmRvTEEzeDVvMjZsbmF4N3JmS0YyN1FIZmJGRmFyTzA1UUc0Tl9SbWRHTnJZelRESVROczZnTjZOZkh2WlVLMXlzMVBYRjc2UGl1V2hkbUFmaWFTbVJYZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "Android Auto will finally get this beloved Google Maps feature - Android Police",
    "description": "Android Auto will finally get this beloved Google Maps feature  Android PoliceGoogle Maps reportedly prepping car icon and color picker for Android Auto  9to5GoogleAndroid Auto may soon let you choose a new paint job — for your Maps avatar  Android AuthorityAndroid Auto will bring interesting navigation features, but in the end it may do more harm than good  Samsung MagazineGoogle Maps May Let Drivers Change Their Avatar Icon Directly in Android Auto  Android Headlines",
    "published date": "Thu, 12 Feb 2026 14:15:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNeWk4bUxGOHRpWHZld210WHB4TGVtaE9PSWhORzRZU0dQaUJMYWJ6QTZRTzdQUFNmMXp2bjlBdlpuNUJNVXdyenZzay1LOURPLXBoX1VYTlVhQTNVN0I0UXVGYkRVQm81d01fc0hpMWJUaXU2czBMbGVzR3VVLVFMRGdhbnh0dnRXaGJVdHBCZ0dTajFENks1Sg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidpolice.com",
      "title": "Android Police"
    }
  },
  {
    "title": "‘Diablo 2’ Gets First Major Update in 25 Years With ‘Reign of the Warlock’ Starring Rahul Kohli - Variety",
    "description": "‘Diablo 2’ Gets First Major Update in 25 Years With ‘Reign of the Warlock’ Starring Rahul Kohli  VarietyRain Annihilation in Reign of the Warlock — Diablo II: Resurrected  Blizzard NewsDiablo Celebrates 30th Anniversary With New Warlock Class, Coming to 3 Games This Year  CNETParty like it’s 2001: Diablo II gets a new expansion, new playable class  Ars Technica\"We don't want to mess up the Mona Lisa\" - Blizzard may expand Diablo 2 even more if the surprise warlock class release goes down well  Eurogamer",
    "published date": "Wed, 11 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOOFJTek9ZWDg3NkVSamRfN3hROXdQSnJteUh4cU5taTBZZ0IyOWpleURwS1BEQzc5YTZreHVrWTVJYmZwbDJhYkY3WlFHNmE4V0Q1ZEs2YzdPazh3bTI0Vk1qM1B3SzVPdjdiTy0zUjk5b0JwSXBpbkZxRjNuLW13U1JGMWxBRXl6WktENHlhc05SWjExMFBRRUd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "PS Plus Extra Games for February 2026 Leaked, Full Lineup at State of Play - Push Square",
    "description": "PS Plus Extra Games for February 2026 Leaked, Full Lineup at State of Play  Push SquarePlayStation Plus Game Catalog for February: Marvel’s Spider-Man 2, Test Drive Unlimited Solar Crown, Neva, Season: A Letter to the Future and more  PlayStation.BlogNew PlayStation Plus Games Revealed, Including Day-One Release For All Subscribers  GameSpotThe PS Plus Game Catalog additions for February include Marvel’s Spider-Man 2  EngadgetLeak: PlayStation Plus February 2026 Extra and Premium Games Revealed  VICE",
    "published date": "Wed, 11 Feb 2026 16:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNZVVtZWFwUEVlUEQwWVBmN0NzRUJoRUVNUWhNMEk2QTNUY1Q0TkJUY21OQnhFLTExMHlZNldyeXFYcjl3U3JOLURoSHMyTkgtdTRRVm1KYUxtX0poeUVWNFdyV3Z5dUpXTkYxV0w0NV9QUzdVWXdfZEpBdHlBQ1FfUm5IRFVhd1hxR1ZZX3BmeDhVQk9fejNneDhfdTdzc0ZzbXY3bE9fVWRGaHlNU2ZtNGFqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pushsquare.com",
      "title": "Push Square"
    }
  },
  {
    "title": "Turns out Game Freak's \"relatively small\" internal team is supported by \"several dozen\" development partners for Beast of Reincarnation - Eurogamer",
    "description": "Turns out Game Freak's \"relatively small\" internal team is supported by \"several dozen\" development partners for Beast of Reincarnation  EurogamerBeast of Reincarnation launches on PS5 August 4, 2026  PlayStation.Blog30 years later, the company behind Pokémon takes us inside its next monster RPG  PolygonBeast of Reincarnation Release Date Announced | Sony State of Play  IGNPokemon developer to launch Beasts of Reincarnation in August, promising \"one-person, one-dog action\" for its first non-Nintendo game in years  GamesRadar+",
    "published date": "Fri, 13 Feb 2026 00:01:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxNRXlSVzB6dmhIUEVJZnZSN2lmeUhZT0U2UkN0QTFKbWdkV3JNLW1ucjFIUVlEX0JFdW5hQkZYeENWM3hFZlRENkFCVFc0WE5fdTRQQzNpaDYxcGFmLXdZeVg0OEdDRUFYRnVWOFNFWDBscTNweGxnQXJlSktLMDBnb0RzV01rc21aS1NOMzlteC01V0dTV2tUNm93ZDVfS01nSWI2d0xrUkxzUUZHclRMUjlfUzZ4ZnZLUG5hSVhWQmZ0LUNhWGhKcS0xZEdabVRmQzE4aGZvQ1QzVDlZWG5HUUw5eXJSZlBLX2lkNw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "Apple patches decade-old iOS zero-day, possibly exploited by commercial spyware - theregister.com",
    "description": "Apple patches decade-old iOS zero-day, possibly exploited by commercial spyware  theregister.comiOS 26.3—Update Now Warning Issued To All iPhone Users  ForbesApple Fixes Exploited Zero-Day Affecting iOS, macOS, and Apple Devices  The Hacker NewsApple Just Patched Its First Zero-Day Security Vulnerability of 2026  LifehackerApple Patches iOS Zero-Day Exploited in ‘Extremely Sophisticated Attack’  SecurityWeek",
    "published date": "Thu, 12 Feb 2026 14:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE44NzZlUVhjYlFpSk9ETzJjX1JwNnl1S0s4VExpZFZsR1RfUnBVV3JEVmFaVldNYzBiblhjbHlLWEtnTHdpVk5UNEYyTTFKdzRsV0pwNGFoS1dwM1ptSWRsbXhHYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Round Up: The Previews Are In For Pokémon Pokopia - Nintendo Life",
    "description": "Round Up: The Previews Are In For Pokémon Pokopia  Nintendo LifeWhat is Pokopia? Inside the calming Pokémon game that ditches battles for gardening  The GuardianPokemon Pokopia is so damn cozy  Engadget'Pokémon Pokopia': Oh God, they made 'Minecraft' for Pokémon  MashablePokopia: Game Freak on how Ruby and Sapphire inspired Pokémon’s biggest ever spin-off  Video Games Chronicle",
    "published date": "Thu, 12 Feb 2026 05:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPWTdwUGFwc05BdTB3Rzk3RE5TdzZCdmdoZlp0VXdQRUFyN21UU0NDcHRPQ2dWMXQxVFlJMXN5cGtUVmt2S2dsTXF6blJqMU82c1JiX2ROMVZnaThUN3FUdHA0d2xIY0RueTVfamc1NWlBNkY2RjlSY0I4cFNlSXpEMUt6azNsYWRZZTBtelRQNDhtNEpK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nintendolife.com",
      "title": "Nintendo Life"
    }
  },
  {
    "title": "Resident Evil Requiem Trailer Reveals Leon Is, Sadly, Once Again Infected — And Another Returning Character | Sony State of Play - IGN",
    "description": "Resident Evil Requiem Trailer Reveals Leon Is, Sadly, Once Again Infected — And Another Returning Character | Sony State of Play  IGNHere's A First Look At Resident Evil Requiem's Raccoon City Police Department Decades After RE2  GameSpotI Played Resident Evil Requiem And Pragmata On Switch 2 – And They Ran Surprisingly Well  Game InformerLeon Kennedy Can't Shoot To Save His Life Thanks To Nintendo  KotakuMore Resident Evil Requiem and PRAGMATA at Today's State of Play  GamingTrend",
    "published date": "Thu, 12 Feb 2026 23:58:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxOZVRreUZ0TTVxV1pFQklPTmFEMXFYTWNvX25oUGtBSVJfY24xcmh1eEl2TkZQTXNDbGNNX05SVkRJZjlGTFRzWW1xSFJrZDhaQW5PQ0FFdk5mc2JLdjg2SktSaFhqXzVGTEhXNVBpbjdVaEFBbHZMMGE0Yk5tcmo3VHYtb0pMNVpaemRWTjJlaXhYQkdvLUh1b0NTUUdBZGZ6OFdtZnAxM3o3aWQ0LWV5a0hsXy1nb0Y1Uk9lTm1WV0pFdFFIRExXZ1UwTDZiQ1FXM3FDWEZUb0FfSFplc2NmamRObEhpUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "High On Life 2′ s Intro Is One Of The Best Video Game Openings Ever - Kotaku",
    "description": "High On Life 2′ s Intro Is One Of The Best Video Game Openings Ever  KotakuHigh On Life 2 Review  IGNHow High On Life 2’s Skateboarding Kickflips the Shooter Genre on Its Head  Xbox Wire'If you're a PlayStation player, you're going to buy it on PlayStation. You're not going to play it on Game Pass' — Squanch Games CEO says making the PS5 version of High on Life 2 it's main platform 'was a no-brainer'  TechRadarHigh On Life 2: Release Date, Release Time & Download Size On Xbox Game Pass  Pure Xbox",
    "published date": "Thu, 12 Feb 2026 15:56:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZ200Q0FxZVAzeEhpT01mcHp1M0V4ODBDVTlRYlZ1RFl3T29fMndLcW84Y0pyTFV6ZW5ubUppa0pNcml4bzc0MUJKM0xmcHNjU2pnRDYxS21QcXpOZWhOTjdaZUZibzhkWGNqN2p1TXBETEUweVIyRXdsNnV3eEI3RjVDWkxTYVN0SW1GMk5LX1dOMUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kotaku.com",
      "title": "Kotaku"
    }
  },
  {
    "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users - TechCrunch",
    "description": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users  TechCrunchPatch Tuesday, February 2026 Edition  Krebs on SecurityMicrosoft Confirms Windows Is Under Attack — Update Now  ForbesFebruary 2026 Patch Tuesday includes six actively exploited zero-days  MalwarebytesMicrosoft Patches 59 Vulnerabilities Including Six Actively Exploited Zero-Days  The Hacker News",
    "published date": "Wed, 11 Feb 2026 20:46:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOeWlNdWZERjhzWFV3NHI0Z005MWVZRHRPVUdJYmpQQmhYVEY4ak1OaWhwWUE5S1M5dUQ1aXJ3eVFESUdPWEsyTnZmRl9mcWpSTS1YWVkyUHljd0wxOWtrREFlZjlWNmxJX1p4NjlMM1UtT2NvTVhSVEdTOGg2ZzlYdVM3RVA1Y2RpTXNHT0tuVWw0clNKbTRQSjByUlBQam52NUcybFdUck1iT0pGZS1EenhwM2I4djZfSjQ2YlFzdmdsZkpENFpJSGRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Free Play Days – NHL 26, Lynked: Banner of the Spark, Sword Art Online Fractured Daydream and Age of Wonders 4 - Xbox Wire",
    "description": "Free Play Days – NHL 26, Lynked: Banner of the Spark, Sword Art Online Fractured Daydream and Age of Wonders 4  Xbox WireThese Four Games Are Free-To-Play On Xbox This Weekend (February 12-15)  Pure XboxGAM3S.GG  GAM3S.GGSix 2K Games titles are playable with any Xbox Game Pass subscription this weekend  Gamereactor UKNHL 26, Age of Wonders 4, and more join Xbox Free Play Days this weekend  Neowin",
    "published date": "Thu, 12 Feb 2026 16:01:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFA3LVVHeXRLN1dheHJURHZ0X1NxMTFILW9nQnJZQW9lQ2xlWHNaUTdHZTJOV3J5OFVycGxNSkY3SHM2OFpfbEZGSjdycHBuVzVLa2NXMWxGME1GOXlsYXJQeFdGQUJ3dmpXS180M3R0UGt2WVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.xbox.com",
      "title": "Xbox Wire"
    }
  },
  {
    "title": "Rules of mysterious ancient board game decoded by AI, scientists say - CBS News",
    "description": "Rules of mysterious ancient board game decoded by AI, scientists say  CBS NewsRules of mysterious ancient Roman board game decoded by AI  Scientific AmericanLudus Coriovalli: using artificial intelligence-driven simulations to identify rules for an ancient board game  Cambridge University Press & AssessmentA Roman-Era Stone Baffled Experts. AI May Have Solved The Mystery.  ScienceAlertAI simulations reveal a Roman era board game in the Netherlands, pushing Europe’s blocking games back centuries  Archaeology News Online Magazine",
    "published date": "Wed, 11 Feb 2026 19:49:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOXzVMTU9XSEZ2WXVqRXo5NEFScjA2RFA3TWJybk42VnZodjFMU1FJVXJ4V1hpSVNCdWh1djVwLTNOSjVscWs1eGlXajdROVpPYnhNVFBGaGVIamJVd2VVYWR6NjlFT0pFdWtqU3g5Unp5LVZMcmxrSEJjTFZnUXEtNHlscmxTb3g1ZkRBaG9wR2bSAZYBQVVfeXFMTVc2a0xNQS1UNTJac2diQ3ZwTUVQM3dfQWIyY2FzOFFxSldCYkRiNzB3Y1YzNlo1YVVqY2xKQTF5NEZXMVlfemVtVkZlMW9PYk9wWE03OHY3VEZZXzMzMVZER3U1UWExSU1CR0dhV19scHM5T2hla1Z0aFpKR1oydGdNcS1lREdKdV9oQjJ0Ujh2RndpYTZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Attackers prompted Gemini over 100,000 times while trying to clone it, Google says - Ars Technica",
    "description": "Attackers prompted Gemini over 100,000 times while trying to clone it, Google says  Ars TechnicaGTIG AI Threat Tracker: Distillation, Experimentation, and (Continued) Integration of AI for Adversarial Use  Google CloudGoogle says attackers used 100,000+ prompts to try to clone AI chatbot Gemini  NBC NewsGoogle Reports State-Backed Hackers Using Gemini AI for Recon and Attack Support  The Hacker NewsOur new report details the latest ways threat actors are misusing AI.  blog.google",
    "published date": "Thu, 12 Feb 2026 19:42:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNTWFOWnVCQ1FGZmRaRnZRQk1Rbko3RkZKRE9JUGZiT2RwN3Fja3owdHFFWVV0am9rSDRnc2JRbzZXdmkwYnhORmhDN2NiUjhxQnpoWlRXNllEN1F4bm40dndkY0lGUEhfUDNoa1V0VjZUbWFGOXV3a19Yc1ZUWXhuejJVSl93Vnl3ZHEwdENqUnJNMWc1LUVSck15ZGtzTEFyRENMNkNWVi1BMTBHcFNwMUFlcEdYc1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Highguard Developer Wildlight Entertainment Reportedly Lays Off 'Most Of The Team' - Game Informer",
    "description": "Highguard Developer Wildlight Entertainment Reportedly Lays Off 'Most Of The Team'  Game InformerUPDATE: Highguard Developer Wildlight Entertainment Confirms Layoffs At The Studio  Game InformerWhy Games Like ‘Highguard’ And ‘Concord’ Are Spontaneously Combusting  ForbesHighguard Dev Who Just Lost His Job Calls Out Toxic Online Reaction  KotakuHighguard Dev Mourns The Game - \"The Future Seemed Bright\" Before TGA Reveal  GameSpot",
    "published date": "Wed, 11 Feb 2026 23:24:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOSFNxZlQ1NV9kRk1jVkczTEpNcGFSX1Y4RFE0VFAzS2lNTEJlUGNNbzVoeTlHZEhYVU0xWDJGSWxPVHlQR21kVEJvZEVDZ1RGLXBJSUVMMUljUFA0WnhSNjMzSDRhVVQwNVE2cTR2QVFVVkUtb3lQcnl4VFpDMXJRM195cTJaYWhpMnQzUmhkNUJidXF3VzRKQmo1aHRNQjlhNUtBYVpPS1NrdGkxR2Y0TjI4dVRnQk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gameinformer.com",
      "title": "Game Informer"
    }
  },
  {
    "title": "Apple issues warning to all iPhone users over new iOS 26.3 update - supercarblondie.com",
    "description": "Apple issues warning to all iPhone users over new iOS 26.3 update  supercarblondie.comApple releases iOS 26.3: New wallpapers, Transfer to Android  MashableUpdate now! iOS 26.3 contains dozens of critical security fixes  MacworldiOS 26.3 Now Available With 5 New Features  bgr.commacOS Tahoe 26.3 fixes two annoying design problems [Update: Nope]  9to5Mac",
    "published date": "Thu, 12 Feb 2026 16:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOTk4dG5hTXl6clNyTWlNTDhwcHkydWg4aWhBY3gtN0JTY3NhRHYwMW9JRDZ4MjNLMmE4RVk3cUItQWpOZjEtLWstTnI4WHBlbmlSOFdKeFVDZXl2azR2UG10bDF4TXFva3h0VVVwOG0yYnUzYlpXOWNPUVhHemZEZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://supercarblondie.com",
      "title": "supercarblondie.com"
    }
  },
  {
    "title": "NASA Completes First Flight of Laminar Flow Scaled Wing Design - NASA (.gov)",
    "description": "NASA Completes First Flight of Laminar Flow Scaled Wing Design  NASA (.gov)New NASA Wing Tech Helps Plane Reach 144 MPH Without Ever Taking Off  SlashGearNASA Successfully Tests Drag-Reducing Laminar-Flow Wing in Flight  Gadgets 360NASA Successfully Flies First Laminar Flow Scaled Wing Design  The Daily GalaxyNASA Successfully Tests Revolutionary Laminar Flow Wing Design in First Flight  FilmoGaz",
    "published date": "Thu, 12 Feb 2026 00:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPQ0V2LXNrd0RVUVI1SnFiU1dPVWt6cUZHLUhPNmVndDczNTlwYnhQX1dNdFVyNTQzdEFCZ2gzal9wMFdpQjd6RU1RNTJnLWNZaTh0Y2daTVV6NWFKbFVpWnh6N0FpREs5VU9YWWpMTVhlOFd4S0VOdUdEalF5MjRjaHd5dEx1Q0p4SEE5SjVWTjhYd0F0T3pRVElPa1otcVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "Edmund McMillen on assembling Mewgenics' meow cameo list: \"the inclusion of people with clashing ideologies felt appropriate\" - Rock Paper Shotgun",
    "description": "Edmund McMillen on assembling Mewgenics' meow cameo list: \"the inclusion of people with clashing ideologies felt appropriate\"  Rock Paper ShotgunThey spent years creating a game about mutant cats. It sold 500,000 copies in 36 hours  San Francisco ChronicleMewgenics Made Back Its 8-Year Development Cost In Just 3 Hours After Launch  Game InformerEssential Mewgenics Tips  IGNMewgenics Skills Guide - The Best Skills For Each Class  GameSpot",
    "published date": "Thu, 12 Feb 2026 11:18:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQclBSXzVMdVRTRWIyeTlwTjRXREIyd1p3WkdtSmVUb0lUY0dvSklMbUJFNDRnMkM3VF9ZUHdxZHFQa3Blc2hZM1lpOE9LdFMxUUJaNGxsbloweTF1bkhOclVhanBDSE9wdlZSVDY0VWVNN09QaTZvQkkzN0dmbkxwSTM3NU8xU0FreWVnNVJFTEJGcDQ4N18tWUxBRWs1Ukt3TGU5dHdaeU04Rmh1Q1JaSy16a0tPdGhrb0VTaDZJOGExMHZtM1hYVDYxU1NWNUFxVGM1Q0x5MUk1enllX1c2RzI0TUhzSG9yYkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rockpapershotgun.com",
      "title": "Rock Paper Shotgun"
    }
  },
  {
    "title": "The Super Hero Team-based PVP Shooter - Marvel Rivals",
    "description": "The Super Hero Team-based PVP Shooter  Marvel RivalsView Full Coverage on Google News",
    "published date": "Wed, 11 Feb 2026 08:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE52YjFmOEF4STNhZjV6Um80SElZUHkwQmRjU1NtdDJ3ci1tS0lST0xmaDVuZ3NwVGV6LVlGZjA5VkpTcXR3YUZtUjV6ZEhhR3R1MGpSTTVuX3ZWSkpieFFsdTBoN0FQVFFmQXZfWTFxYjJ3U2I5R3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marvelrivals.com",
      "title": "Marvel Rivals"
    }
  },
  {
    "title": "Mario Tennis Fever Takes To The Court With A Small Day One Game Update - Nintendo Life",
    "description": "Mario Tennis Fever Takes To The Court With A Small Day One Game Update  Nintendo LifeMario Tennis Fever has arrived on Nintendo Switch 2 - News - Nintendo Official Site  NintendoMario Tennis Fever Review  IGNMario Tennis Fever 1.0.1 update out now, patch notes  Nintendo Everything‘Mario Tennis Fever’: How to Buy the New Nintendo Switch 2 Game Online  Variety",
    "published date": "Thu, 12 Feb 2026 01:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQV0laTkNlTFZSSkc0VlkzMGMyaERrZjZSRTRVR2VKbEVXeElISEFreUpodkItVUdLZTdPMEgxZDVBLWR1Qnc5a0hVRm1tbHJDcDJuRjZCLU9FWVUzeFhNQkoxa0Znb2czajRwZndSWTMzODdzVWxITm1Ldy1TQXhOR0gyODhoNWpkU3BXM2V3bnI1bS1ZaUM1c1k2SzZHVEZYbmNUM1JCc1Mtb2VDM29xaDVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nintendolife.com",
      "title": "Nintendo Life"
    }
  },
  {
    "title": "Reanimal wants to devour you - The Verge",
    "description": "Reanimal wants to devour you  The VergeReanimal Review - Macabre Merit  Game InformerReanimal review – you will never turn your back on a pelican again as long as you live  The GuardianReanimal’s First DLC Chapter is Terrifyingly Closer Than You Think, Drops This Summer  GamingBoltREANIMAL Review  RPGFan",
    "published date": "Wed, 11 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNUlQ2bTQyc3dlN1o0eDVkM09QYXdFdF9XZVZMZE5DVDBGaF9DLUNtMlFmcmRXRVo1dS10VExFa2I2ZUpIdG5QeHc3Z3d6RG1fVkRGV1dsQXFxd0VaRDFXMHdDYUJzY09kSFYtMUhmb3VHa0RwMnNQbl9MSmg5NXFnUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "No Man's Sky REMNANT Update Adds Gravity Gun & More - UploadVR",
    "description": "No Man's Sky REMNANT Update Adds Gravity Gun & More  UploadVRRemnant Update  No Man's SkyNo Man's Sky Now Has Customizable Ground Trucks For Your Space Junk Recovery Efforts  MMORPG.comNo Man’s Sky: Remnant update introduces gravity gun, live today  PlayStation.BlogNo Man’s Sky: Remnant Introduces A Powerful New Gravity Gun Perfect for Turning Trash into Treasure  Xbox Wire",
    "published date": "Wed, 11 Feb 2026 14:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQVjRQb19hdGhrYjJOQjlfVW5HLXZMUmlnRGVhQ213WExiNlBPQmNrTVlHemdvMGVZN2FzR2lMaDNqbEhBQTBWMmpRMXhydDhlazRMYU42ZURRVkxCNnhIbTVfNkEzV1lLLUMtQ3BtbTdMalJfOUl3aURXaWRBY1dUWndSU3A?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.uploadvr.com",
      "title": "UploadVR"
    }
  },
  {
    "title": "AI's Biggest Risk Is the Story We're Not Being Told - CNET",
    "description": "AI's Biggest Risk Is the Story We're Not Being Told  CNETHow to Fall in Love with AI: A Guide to Embracing the Future  Analytics InsightAI and Our Humanity: Matthew Meyer’s ‘promises and perils’ of artificial intelligence in the modern world  spectatornews.com10 Everyday Devices Using Hidden AI Technology to Simplify Daily Life in 2026  Tech TimesLiving With AI: How Intelligent Machines Are Shaping Our Everyday Lives  Daily Excelsior",
    "published date": "Wed, 11 Feb 2026 16:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQNW83QzhuUGdEZzZRbXdhVk9ub1BFNHU0V1BYSTZYdkc0TUlZNnVGdUIySlJaZldfdU9oVzFuNzU0S0NINjU1NWgtUlhLTnZtR1paekIzQTljeEU3Wm5yMjRsOHNwLTBOVi0zZDRyU0JVRGd1eDhsTjAxX1RWeEtUdFBmVmtHYVVCYnlBdEtRNnE2Sk4wMC1ieUFBM0I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnet.com",
      "title": "CNET"
    }
  },
  {
    "title": "New GTA Online Update Fixes Glitches And Prevents App Usage - RockstarINTEL",
    "description": "New GTA Online Update Fixes Glitches And Prevents App Usage  RockstarINTELBreak Up Rival Couples in the New Deadline Duet Mode for Triple Rewards  Rockstar GamesEuro Truck Simulator 2 developers show new Eindhoven and DAF truck factory - Benelux update screenshots  IXBT.gamesGTA Online Celebrates Lunar New Year With Big Bonuses And Stunt Races  TheXboxHubGTA Online Weekly Update Offers Double Money on Bunker Research Missions, Short Trips, and More  IGN India",
    "published date": "Wed, 11 Feb 2026 16:35:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTEtLMklWSzFGWXhzcFl2S2RBMU9UNjg1ZjlGTVkxeW9taHJNTDE4ZDZCeGRkd0g4NUxPSnZia2xyeEdqenR5bFhReWlPX0NBUjhzQW9BemgzTnkwQkJSTTBidmNDdThpOXJTRW5vZmtvY05Lb1hlOVFSWmd6YUxtZWxBNzdwSnZBN0xXcUMySQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://rockstarintel.com",
      "title": "RockstarINTEL"
    }
  },
  {
    "title": "Windows 11 update KB5077181 is causing critical boot loops for some users - Neowin",
    "description": "Windows 11 update KB5077181 is causing critical boot loops for some users  NeowinWindows 11 KB5077181 & KB5075941 cumulative updates released  BleepingComputerMicrosoft Brings Camera Controls and Emoji 16.0 to Windows 11 Insiders  WinBuzzerAnnouncing Windows 11 Insider Preview Build 28020.1611 (Canary Channel)  Windows BlogMicrosoft Releases Critical Windows 11 Cumulative Updates for Versions 25H2, 24H2, and 23H2  CybersecurityNews",
    "published date": "Thu, 12 Feb 2026 12:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQNTBpZFY2OUVLdG9MWHdNaVJYdUhUTk16V05DaTZIM2tpMng0dTVtczdvekVQRmNkODBWZ2diZk9GZEx4Tm5tOE5aeTYtbnFpUXRiUVlCcVNnZG1QU3B6ZkFmRWlZNXFRQVBIS2Fha0RfXzVNaEM1M0UyWUVuajFWVEQ3SGpONV9lTkhkVzBfRW1fVW9KTWN2eEJraDRSQlBYTS1JRdIBowFBVV95cUxPSHE5eWZ1MnBXNmRzaGJzdkJyTjJRanhRczQ4SU9DNHpXN3ZmSUhJUUdSdnE1SWlldjhZNVBRa1JoeXphOEUxSzhrbnZQT19LZ2lHQWYybXB4ZHdsUGpTVTQ4N0dzSGNpYWEwbm82MlNTLXJfVnVFUVlVcXJja2draHR2eHc0Ukg4b2ItbVdKT3M2QVc5WUJpWkRld3JVRjh2ZGVZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.neowin.net",
      "title": "Neowin"
    }
  },
  {
    "title": "\"What would I change if we could go back?\" Inside Blizzard's big plan to put Overwatch back on top - Eurogamer",
    "description": "\"What would I change if we could go back?\" Inside Blizzard's big plan to put Overwatch back on top  EurogamerOverwatch: The New Year-Long Narrative, Explained  Xbox WireOverwatch 2 Is Just 'Overwatch' Again And Five New Heroes Arrive Next Week  Game InformerBlizzard Confirms Overwatch Just Had Its Best Weekend Player Count in a Year Across All Platforms, as Season 1 Officially Goes Live  IGNOverwatch’s “Relaunch” Is Exactly What the Blizzard Shooter Needed  ComicBook.com",
    "published date": "Wed, 04 Feb 2026 08:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5mMFA2RzRBdl8tRHI5anVKdGxQVFZ4VUZ6THBjN2JBTTZsM0dQa3RJWWlPSmdtVlZWRTZRWkRnMXNGNTg1akJ5MF9DanlSZi1meExMNzRfb3k3WGM4d1RaMW9TZnlkMkNGMnM2VXB6SGItdC02ZFNWbFFqRHl1QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "Apple is about to launch a ‘game-changer’ iPhone - thestreet.com",
    "description": "Apple is about to launch a ‘game-changer’ iPhone  thestreet.comApple Prepares to Kick Off 2026 With the iPhone 17e, New iPads and Macs  Bloomberg.comApple Is About to Release a Flood of New Products — Here’s What’s Coming  EntrepreneurMacworld Podcast: iPhone 17e, M5 MacBook Pros, and more coming soon  MacworldFour Apple products could be discontinued imminently  9to5Mac",
    "published date": "Wed, 11 Feb 2026 19:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdzRYakhuYmpHcDJ2cjAyWmZ0OElCZnJhaFFtUGdJUXM1b2hLRHpTUjVTcXFVT3ZxV1NuZnBBTUprOHU0SHZKVmo0T2JTSk1JV3R6OE50cUNadHhtUk5scEcyUk5qeUt6TlhEVFZFY1dtREg5QWhSMnFjTU9EY1NjSUtjZE5ZRVl6dlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestreet.com",
      "title": "thestreet.com"
    }
  },
  {
    "title": "Google releases the first beta of Android 17, adopts a continuous developer release plan - TechCrunch",
    "description": "Google releases the first beta of Android 17, adopts a continuous developer release plan  TechCrunchGoogle cancels today’s Android 17 Beta 1 release  9to5GoogleGoogle Just Dropped An Update For Pixel Phones — And It’s A Surprise  ForbesAndroid 17 Release Schedule is Officially Set  Droid LifeAndroid 17 May Unlock the Full Potential of Galaxy Z Fold and Z TriFold  SammyGuru",
    "published date": "Wed, 11 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNRU5OeXJTWlViSlRYMXduaFZxbVA1UEJGTUlmUU1xNU5USUszZEJuVzNtb0R2dV9HcTdwSVppblpOQUh4TTRaTFVQMWt5TWEwLXZaelpDdEFfYnBUeFFVeW43YXBCb0k3VkNKNE9YY0JONGgwdGk1UU1MTVQtZWVaSE1pOVI0aUMyT3J4anpiejIyUXl1QXFoOElfS2NiX2U3bUJCdXZjM2pyTVAwUmtUNGk0aHV6YURzZk1zUXl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  }
]