[
  {
    "title": "Trump pushes voter ID ‘whether approved by Congress or not!’ - Politico",
    "description": "Trump pushes voter ID ‘whether approved by Congress or not!’  PoliticoTrump says he will issue executive order to get voter-ID requirements before midterms  CNBCTrump seeks to force voter ID for midterm elections  DW.comOpinion | Trump Says He Wants to Cancel Elections, but Here Is the Real Threat - The New York Times  The New York TimesTrump: ‘There will be Voter I.D. for the Midterm Elections, whether approved by Congress or not!’  Democracy Docket",
    "published date": "Fri, 13 Feb 2026 23:47:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBqbU5WLWh0bnRwWktEWEtKVDhuWnlyVm9Wb1FMVTBMUmduUUlDU25ETmJYZVNmbF9YQ0FaQWRNakRiR2ZUd2tNREdNTDJrRm1OV3Q1S0NZdE01Ul9LTndfc0x1OXhJc2tEaThQM1VCN1IwSjdxT0k4ck95UGQwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns - BBC",
    "description": "World's rules-based order 'no longer exists', Germany's Merz warns  BBCGerman Officials Needle Trump at Munich Security Conference  The New York TimesIn Munich, NATO leaders assess America's reliability as an ally - Compass Points  PBSGerman Chancellor Merz says US leadership ‘lost,’ calls for repair of relations  The HillUS ‘not powerful enough to go it alone’, Merz tells Munich conference  The Guardian",
    "published date": "Fri, 13 Feb 2026 18:52:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE91MFdTUmpKdExzR1dIWG10Wk5CWnJ1U0kyMlBSUktucUxCZDd2aU9lek1Wc0NaYTItVWcySDd6Z19DbGRPWUt5OGRaMDZHTGZ0dXlJOEx6d0ZKQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "ICE plans to spend $38.3 billion turning warehouses into detention centers - The Washington Post",
    "description": "ICE plans to spend $38.3 billion turning warehouses into detention centers  The Washington PostICE to spend $38bn turning warehouses into detention centers, documents show  The GuardianImmigration officials plan to spend $38.3 billion to boost detention capacity to 92,000 beds  WOODTV.comRepublicans Have Found the Real Victims of Trump’s Effort to Build Mass Immigrant Detention Centers  SlateICE reveals $38B plan for immigrant mega-jails  Axios",
    "published date": "Fri, 13 Feb 2026 22:11:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUFdJa2JLQ2pCdHM2Rkw5WWpIZmFVOGx6NERrY25fcF9NWG5SdTRLT2Y1QUNEREhNN3RkekJZQm5LeENERlM0b1FXOE1WaU5JVTBBZ3hYS3VWaGZWd3p4U19lSWc5SUZ6d1VRWjlOSGhFTHdLRFNlTkZYbTdIcWRURERyWjZIem5GT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "As Diplomats Talk, Pentagon Prepares for Possible War With Iran - The New York Times",
    "description": "As Diplomats Talk, Pentagon Prepares for Possible War With Iran  The New York TimesExclusive: US military preparing for potentially weeks-long Iran operations  ReutersWhat War With Iran Would Look Like  Foreign PolicyAfter weeks of tension, Trump is still talking tough on Iran. Here's what could happen next  CNBCWhy the U.S. Hasn’t Yet Struck Iran  The Atlantic",
    "published date": "Fri, 13 Feb 2026 23:37:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB0VmRsNFJJZjI2RE9yX2JmNTFOZlF3RXN4WnJjak9SZnR0SDBIcndROUZUZ2YtUm5peGhNLVh5RnF2X1FpTkg4amdFeWlNYVhwX2dpMDBsZFRqMmN5TVlrQlQ2ak5FUEcyX29uVGcza1J1RXo2UVAtbmIyMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "RFK Jr. Allies Target States to Overturn Vaccine Mandates for Schools - The New York Times - The New York Times",
    "description": "RFK Jr. Allies Target States to Overturn Vaccine Mandates for Schools - The New York Times  The New York TimesN.H. lawmakers advance proposal to eliminate hepatitis B vaccine requirement  The Boston GlobeVaccine skeptics renew efforts to rescind New Hampshire’s vaccine requirements in 2026  New Hampshire Public RadioRep. Jim Kofalt: Mandates aren’t good medicine  UnionLeader.comHouse approves bill to make hepatitis B vaccine no longer required in NH  The Keene Sentinel",
    "published date": "Fri, 13 Feb 2026 20:29:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5saWM1RmoybWxrdldHVmlxUnY1alo2WkNPTmpUc0lqWWZPdGhfaWhqZ2ZlZmxmaU5MeFZIVXRQNzFjeW9RbmpHUEdQZjRLOXRic3hfc3RjcTFaZ3A1bzBDVEZSbWI2YU1qeWw0LWtXRHJiU0JWTFpQZzVCWE1PUkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Homeland Security Demands Social Media Sites Reveal Names Behind Anti-ICE Posts - The New York Times",
    "description": "Homeland Security Demands Social Media Sites Reveal Names Behind Anti-ICE Posts  The New York TimesOpinion | The Trump administration is using secretive orders to crack down on dissent  MS NOWOpen Letter to Tech Companies: Protect Your Users From Lawless DHS Subpoenas  Electronic Frontier FoundationThe Department of Homeland Security Is Demanding That Google Turn Over Information About Random Critics  Yahoo🗣 Homeland Security Wants Names | EFFector 38.3  Electronic Frontier Foundation",
    "published date": "Fri, 13 Feb 2026 23:24:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNN3FFZjZtdEZOd0RzOWtmRnlsQklHdHA2WlAxVDFmWll3aHd5NFdzT01CX2ZMZnhQMU1SUDRnQTBueVljWVA3dUUxT2ZtRy0tWmQ0Yk5aZHJQQ240ekMzWGZ3cHZyVnYxZ0QybU16UFV2OVliZ21lamtudEcwenJrRXZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "description": "S.F. teachers strike is over as school district and union reach tentative agreement  San Francisco ChronicleSFUSD fumbled the teachers strike  Mission LocalWho won and lost the S.F. teachers strike, and how will the district pay for the $183 million deal?  San Francisco ChronicleSan Francisco Unified School District and union reach tentative $183 million deal to end historic teachers' strike  ABC7 San FranciscoWhat SFUSD superintendent said about her pay amid teacher strike  KTVU",
    "published date": "Fri, 13 Feb 2026 22:08:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZTZ6MHI5U2dfRHpQdS0yWGRxRk9vbnlESVgyQ0RDQWlXUG9nend5QnhnaXNSR0N1V2JPRGN5NmNHdmdjc1NPcmplZXRSZ1RpVUU4WjFsd0wwZVc5anlmbGZjMk1vZzVDMG1rcERuN3pkZm93RWNzTEhhekVvNldPRjhtZE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "description": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress  PoliticoAfter letting Trump abuse it for a year, the legislative branch shows a little pride  CNNIllinois Republicans weigh fealty to Trump as president’s agenda faces backlash and shutdown threat  Chicago TribuneDonald Trump Loses Grip as Republicans in Deep-Red Districts Start Wavering  Inquisitr NewsShifting Republican Support and Congressional Dynamics with Trump in 2026  Букви",
    "published date": "Fri, 13 Feb 2026 16:44:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTVoxZjhUak52TTZtZFQ5c0s0b2tHRnRmYkpTdWVZZVRfcmNXY3c0czBSZG1sQjgtaTBtb1NiREFkX0VDYWxfTEdueUJZV01qUFlIUld4MXlwTUZLT2JHRi1wTGZOM2RWbGJ2V0UtaXFyMUNVV3BpYi1nOXZDdHZFWDI0UDZqZGVrXzctSmlhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Republicans worry shutdown will overshadow Trump’s State of the Union - Politico",
    "description": "Republicans worry shutdown will overshadow Trump’s State of the Union  Politico",
    "published date": "Fri, 13 Feb 2026 23:13:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPbHNSbUkwMkxPNFFCa1JHZzFPZ2VnQURNdEsxRHFPYUhJaGpFVVZKenloamNmYkhzU3RyM3RZWVlIeDNTblVUTVhaeEVfRlEyNWZ5SU5SVkQxUlBIQjZzZ3RuRUtETWR1Sm1rSFUxSGZXbE82NnpUX2ptWnE5dTJzNzhxOGNxcW94NUtN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "A Surge of ICE Arrests Overwhelms the Federal Court System - The New York Times",
    "description": "A Surge of ICE Arrests Overwhelms the Federal Court System  The New York TimesAs Minnesota ICE crackdown continues, detainees quietly transferred to Nebraska jails  Flatwater Free PressImmigrants sent to Texas from Minnesota ineligible for return — for now  MinnPostRefugees in Minnesota detained and flown to Texas are released with no way home  MPR NewsPrayer vigil at Signature Aviation, where many immigrants have been taken to be flown detention centers in Texas  Audacy",
    "published date": "Fri, 13 Feb 2026 18:44:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB1N19oRWNub0RWckRyQmVFNzV4TjNBVENtS0E3RHNnLWkxZExZU1RrTFBjNVYycEt3aDBsdXE1WkNXc0FXUmIxRThjdG1iRlRsejlRN2J0M0V0al9DeHc3dDFfVUMtbHY3OUFtaDVFWUdnZWdDSjlVYm43Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Spy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader - AP News",
    "description": "Spy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader  AP NewsKim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says  BBCKim close to naming teenage daughter as future North Korean leader, South believes  The GuardianNorth Korea's Kim positioning daughter as successor, Seoul spy agency briefing says  ReutersCould this teenage girl be North Korea’s next leader?  CNN",
    "published date": "Fri, 13 Feb 2026 16:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNbnJtY1lVN0h2RTJxaFRKZHVEdlBqNnVoNkRTd3dCTS1MMG1aS1h6dXlQQTJqM1RfczlyMHVvbHJ6dEFBSHVCX3hYaGFkbDZneWNrc09qcFhCRURvZXVLT29hTWFIem1UQlBEYjZyTEVWUXlnTHRsMVBlLUxpYXlTNWFNdTZsT1gwdHNBMHZHX005YVl2RTZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump’s creation: A Europe that spends more on defense — and can stand up to the US - politico.eu",
    "description": "Trump’s creation: A Europe that spends more on defense — and can stand up to the US  politico.euMacron swipes at Trump tariffs and Greenland threats; Zelenskyy has strong words for Russia – as it happened  The GuardianFrance's Macron says time for Europe to become geopolitical power  ReutersEmmanuel Macron declares a European state of emergency  The EconomistMSC: Macron says world should take 'cue' from Europe  DW.com",
    "published date": "Fri, 13 Feb 2026 20:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPOWhCNzRGc0UyNWpRV205YURXa0FuOFBWMDNEbmt3bWhYUlF3OTM5MERBUlZlMzZIT3JyWlo0Y0V0amp0TkRFOTFubjlXOUs1RVo3eWxlQkZoRmVyMXFzd0I0TlBsdHFIcExHZUFRekdNaVk3ZDhfazRPNDE2UFpYU0ZicnBSOFc0cTB1MFl5RDhnWHdvTW8xNk50bGhfTWZ0dXVUaV9rQmhjU0k0NFVGMUJrNXgwTTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Scientists have discovered one of elephants’ most sensitive secrets - The Washington Post",
    "description": "Scientists have discovered one of elephants’ most sensitive secrets  The Washington PostAn Elephant Is Blind Without Its Whiskers - The New York Times  The New York TimesStudy unlocks the secrets of the whiskers on an elephant's trunk  ReutersUnique structure of elephant whiskers give them built-in sensing \"intelligence\"  Ars TechnicaElephants are smart. So are their whiskers.  Popular Science",
    "published date": "Fri, 13 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBDeHNCVkQwNnA4NFVwZW1KaFdOX2JSSnVFMzF2RkpSZW5IR09idDFhREtxWFJKU1NreXZxZGFwdHo1OElVSWtuMG1EYzhvV1JNMHR0SE5PY2J6R0p2ZUdCbGYzelpFSXc0MUphVGNremNmUndSWUpZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Former McKinsey partner to lead Australian opposition party - Financial Times",
    "description": "Former McKinsey partner to lead Australian opposition party  Financial TimesSussan Ley: Does Liberal Party drama show Australian politics still has a problem with women?  BBCView from The Hill: Sussan Ley leaves Angus Taylor his first hurdle, and it’s a high one  The ConversationAustralia's conservative opposition picks a new leader amid ratings slump  ReutersHere's what we know about Angus Taylor's policies  Australian Broadcasting Corporation",
    "published date": "Fri, 13 Feb 2026 01:27:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zWkZqQ3ZxR0xLNlcyVGRXNlpYZ0thTWNiNzd1SFFON2JNcEZxNmdYQVlXSVRPRXFlVDJMckFaOXJrLUlRSnozc1R5dy03RXQ0TkFIVi16WDY3M0JSTThfUW9wRFhTZ0Uxem1ZU0VuY2Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Rivian Surges On Upgrades As Attention Turns To Its New Tesla Model Y Competitor - Investor's Business Daily",
    "description": "Rivian Surges On Upgrades As Attention Turns To Its New Tesla Model Y Competitor  Investor's Business DailyRivian surges over 20% on delivery guidance, R2 launch in Q2; CEO says 'key inflection' reached  Yahoo FinanceRivian finds a way to shine even as the EV market struggles in the dark  Los Angeles TimesRivian tops fourth-quarter expectations, targets significant production increase  CNBCRivian shares surge as upcoming affordable SUV powers EV delivery forecast  Reuters",
    "published date": "Fri, 13 Feb 2026 23:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOZmpIelVQYXdHMU12OFlycGlaZUlPU3ZwOEVmMG92Tmd4c285V2Z6b3FldTdnODN1YTBIZk12MFZ4aDN1dHpvTmNERWNUS3J2NzNjemV2YUZ2Y19TTHpNZFdSMld5RDNseEo3eE4tVTZ1Y1RBSDJxTHJycEhOZTY5R3ljdnlOWV92bGJIY2FQeUhHTHk3MGVuTHdtWUFiS1lTaVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investors.com",
      "title": "Investor's Business Daily"
    }
  },
  {
    "title": "Why your Valentine's chocolates are so expensive - Axios",
    "description": "Why your Valentine's chocolates are so expensive  AxiosValentine’s Day sticker shock: Chocolate prices are spiking  CNNRoses are red, violets are blue, if cocoa is cheaper why isn't chocolate, too?  PBSLast-minute Valentine’s shoppers in Green Bay face higher jewelry and chocolate prices  WLUKCocoa crunch: Pittsburgh-area chocolatiers face Valentine’s Day amid cost crisis  90.5 WESA",
    "published date": "Fri, 13 Feb 2026 10:00:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOM2VJNTBMMUJPVnVDMHVhOEh1UjA0bnFuS0NuVDRpZ05iMHYwMlc2OXoyakZIMGtwaHd5UE5qcUVzRU4wUE9fU1lMT3JRampEZm1WcWRveEs4a3pIWTdTUVBsbjllSEFoYU83ZmFqLVl4R0t6ZHJWWlVSYWFja3Z3Y1J5RmY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "How packaging and logistics companies are automating their warehouses - CNBC",
    "description": "How packaging and logistics companies are automating their warehouses  CNBCInside the Robot Revolution: How Packaging and Logistics Giants Are Betting Billions on Warehouse Automation to Survive the Labor Crunch  WebProNewsHow robotics is changing the supply chain [Q&A]  BetaNewsDHL's Automation Technology Enhances Efficiency  Intellectia AIDigital Twin Technology in Warehousing: The Future of Logistics  Analytics Insight",
    "published date": "Fri, 13 Feb 2026 12:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54dUpmVUdsMlhSQ1BEeGpad2tZWjJwSi1qc3JwaXFVaDhsY0dVTEtTck1aZHgzTUI1WEY2YllibnlzY0hMU1VISGhuN2RhM3pUODV5eWVtbTRFMXNmbDNxMElqUzI1ZlJ6ZVlqRm5kYTRVUEo0bFk2U0lMa0PSAYIBQVVfeXFMUEdySHRicW9xUDJBbGp3QXNmXzhwOEVnZ1dtQlNqX2Fnd1VObVg2TUJ1Ym5naDhvVVVoRmJNUjE4UjFxdzl2anhCQUkxRmxwZ3c1WHh6MGNoSU11M1htdEJ2LUZOaXV3YmpKdWlfb0VZUC1COHRTR2lreEtha3BfalMxUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry - The New York Times",
    "description": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry  The New York TimesTillis suggests Warsh faces long Fed chair nomination process that could restrict his business life  CBS NewsFed chair drama: Tillis pours cold water on off-ramp for Powell criminal probe  CNBCTillis continues to hold Fed nominees despite latest offer from Treasury  The HillBessent Sees Senate Proceeding With Warsh Confirmation Hearing  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 14:34:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOc2FXUkxlZ3VrMFFmd09nV3huTUttOFRpZHBNMEw4Y1czcnh6VWFiY3pWRHpoeEMtV2Y2bUppUUcwaDlGT0FrbXhTYTBIREpuVlQ4VTJNY2NnNkpDV2cxSDIwUWttWS1ySUpUcXlwMkx3UEltQXIzOE81MF9YVnRXTmI2bS1LWk5jSmFYaDFuT0NlaUxCMVdqTlZORQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "There’s a tiny digital camera inside these retro 35mm film rolls - The Verge",
    "description": "There’s a tiny digital camera inside these retro 35mm film rolls  The VergeThese 35mm Film Rolls Are Actually Tiny Digital Keychain Cameras  PetaPixelvintage film rolls flip into miniature and functional digital cameras  DesignboomKeychain compact cameras like the Kodak Charmera are having a moment, so I tried the Escura SnapRoll. I’m not sure I’m sold…  Digital Camera WorldOPT100 NeoFilm packs compact camera into a film roll format  Notebookcheck",
    "published date": "Fri, 13 Feb 2026 14:39:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPaWw1T3pYckpMaGZIOTQwbzBkX0tVV0Z0OFUwUmpnQUdWcnhXMDRnS0VaZ05GMXc4MlZ5cFZiVXhDay0wQjBvSEkzdU04SGdjUGw3NGtTRW5lc1BVVUgwTC1UV1RfMnNKbm9HSGh4UGtuQUNaOG1uLXh2SU12aXRDcHRtZHg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Here's the first glimpse of a One UI 9.0 Galaxy AI feature! - SamMobile",
    "description": "Here's the first glimpse of a One UI 9.0 Galaxy AI feature!  SamMobileSamsung is preparing a major upgrade for its browser in One UI 9 (Updated)  Android AuthorityGalaxy S26 Now Nudge Leak Reveals Travel Assist  findarticles.comSamsung's Browser Is Getting an AI Makeover: Inside the 'Ask AI' Feature That Could Reshape Mobile Search  WebProNewsTake a Closer Look at the Galaxy S26’s Now Nudge Feature  SammyGuru",
    "published date": "Fri, 13 Feb 2026 17:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5Ucm01c2w2a2lqX0lZUkJtcWFYSENVZFhBX3BQZzAzVU44NzZYMmViVTFpTHhQU25EbnQwbEtYbnRnM0hMRV9WWnNtQ2pMOXlEeTRvMVhCVlF0WmY2RUhKaV9wQjJrckgyaV9xVXA2b2NIdjlDWXI0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sammobile.com",
      "title": "SamMobile"
    }
  },
  {
    "title": "Counterpoint: The foldable smartphone market to open a new chapter in 2026 - GSMArena.com news - GSMArena.com",
    "description": "Counterpoint: The foldable smartphone market to open a new chapter in 2026 - GSMArena.com news  GSMArena.comAndroid book-style foldables expected to dominate in 2026, report says  9to5GoogleBook-Type Devices to Reach 65% of Global Foldable Smartphone Shipments in 2026  Counterpoint ResearchApple Now Testing Flip-Style Foldable iPhone  MacRumorsApple's iPhone Fold could spell the death of the flip phone – analysts suggest a new era of mobile is coming  T3",
    "published date": "Thu, 12 Feb 2026 05:01:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPYzdQZnRseHVRREEySkh0d0MwaDE3X0VwZXBEYTU5Um93NWZrVnVlUkxxdXZlZ3FqQ3ZpbUc0azg0VVZNWUEzT2I1dlRFUlNXUDh4Y2FscEJyblg4OExVTUJoWXAxOGdPaFJBOXlkbk5Nb0pFT3pHcXpWandzSVhNeHUyNmV1UlVPb2lOYTlFcEszRENuNDBKel9pMjctT2laWVlDTlFYQV9tOEVaa1NlZzJn0gGuAUFVX3lxTFAzaXRKc0ZZNWZSbzdnZlAxYVV4NGp0WnRpTUJMdkpYcUE5dmxBSkZtS2x4UTdhb3Q5OHAzamo2YklPTENBQzI4cEZWU3R4Nlg0VXk5bW9xZ2U3bzdvWldJeVVDbjFONEpWS2lkVlphcE94aFc1LXlGdUhFZE1ZTVU1eVppdktRN0tTQmc5ekJSb2xpN3VBWVVqZ3dSVDYyVGE2U05pd3FjMHFIS0FzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gsmarena.com",
      "title": "GSMArena.com"
    }
  },
  {
    "title": "There's Confusion Over God of War Sons of Sparta Having Co-Op, Based on Its PlayStation Store Description - IGN",
    "description": "There's Confusion Over God of War Sons of Sparta Having Co-Op, Based on Its PlayStation Store Description  IGNGod of War Sons of Sparta  playstation.comSanta Monica Studio Is Remaking The Original God Of War Trilogy  Game InformerGod of War Sons of Sparta Spin-off Out Now, and God of War Trilogy Remake Announced | Sony State of Play  IGNThe 'God of War' trilogy is getting a remake  Mashable",
    "published date": "Sat, 14 Feb 2026 00:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQaERlaW93TkppUDJQX1hkeW11bEIwS1dxTUJmZGtCVjJvdHVfTXdRbHNWeGtlaElWTHRrcFo1NGhaQTk5a0RPOFJVLVZrbExpaDlKdTNSeTgya1N0MXMtZXZIVFRYZVBsRWFETkg5c1daeHpwVXRtY0Z2TThXZWdJS3ZnOHdMZi1ja0I1dHpWbTZMNFdpU3h2a0hycnMzVlRVb3lMOW5LTzVsYXFYdTBZNGNnX2RFeC1XdnVNT25tMFFxSXF3SGJQS2d1eXM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "GoFundMe for James Van Der Beek's family tops $2.3 million to help with 'financial strain' following star's death - Yahoo News Canada",
    "description": "GoFundMe for James Van Der Beek's family tops $2.3 million to help with 'financial strain' following star's death  Yahoo News CanadaHe was once a teen 'superstar'. Why did James Van Der Beek need help to pay his medical bills?  BBCJames Van Der Beek to strip again in encore 'Real Full Monty' tribute  USA TodayJames Van Der Beek’s Death Underscores Early-Onset Colorectal Cancers  The New York TimesEXCLUSIVE: James Van Der Beek Bought Family's Rented Texas Ranch for $4.8 Million Just 1 Month Before His Death  Realtor.com",
    "published date": "Fri, 13 Feb 2026 22:50:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNS2ZUTWVxQkJSdGxDMFNpOVdLLXN5WkdKOGt0TU1BUW03QnBHUk0yLXB2aFRGNXFDMGp2T1h6bDlpNE9yUHZwdjViLWNlLWZrcktJYTZ3MnpXVXNMbGZCRG1xSXp0TVZwUUVGa1ZhNEgxNXdmaGNHeUljWE1kUWNhaUNwU2tsbFZzOG1BbFZWRnRCNmlUMkxqTkVTSEwxM3FtVEN5WlRWa2R4OEZBalBvTTZlN2xRbGNLWDVxMW03VW5Jc2JSbzkxWUNHODl1ZEtadHhMN0hERTNtV0owNVhuWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Republicans Have Moved Into a New, Even Dumber Phase of Bad Bunny Outrage - Rolling Stone",
    "description": "Republicans Have Moved Into a New, Even Dumber Phase of Bad Bunny Outrage  Rolling StoneSuper Bowl LX, Bad Bunny's halftime fall shy of ratings records  ESPNDid Diplo perform with Bad Bunny at Super Bowl LX? Fans spot clues in viral video  YahooThe Story Behind Bad Bunny’s Zara Outfit at the 2026 Super Bowl—Including That “64” Jersey  VogueBad Bunny's show offers cultural lifeline to a besieged Hispanic community  Reuters",
    "published date": "Thu, 12 Feb 2026 17:49:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOWGtkR2V0LTR6Yl9oMFd6U3BVbEMtTi1WemVzN29CYzcwNktNU19OS3dJVUM2aFNBSFFpV2lObkZHU2dkQlhnVmk5eVFjZGFNc25aLWd2Tl9veGhOdHo1NmhCRWtKOVdBakdSckRiRmp4TVBnRnVONE9GSjR0eUZRSTd2d3NJM1FHeWU0bVFGdWxQOGxpT2pjUnpGVUpibWdwY2JiTnd5bEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "12 New Albums You Should Listen to Now: Charli XCX, Feng, and More - Pitchfork",
    "description": "12 New Albums You Should Listen to Now: Charli XCX, Feng, and More  PitchforkNew Music Friday: Charli xcx, Cruz Beckham, Perrie and more  Official ChartsNew Music Drops: February 13, 2026  Shatter the StandardsCharli XCX, Bebe Rexha, Lykke Li albums: Music week in brief, February 13  Qazinform",
    "published date": "Fri, 13 Feb 2026 15:08:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxONWxCdUhLblI1NjkzQXNrNkFRMGNKVkVIRFpodk1kYzhxSnNpOVJORHVhOGxjeXlwa3l0S2hMbUNPQmdpVjBrclBpR0x2V0RER2lETllpT3Y4SmZ6U3MtVjNSalFRdWNBbTQ1T3JXN085TV9uME5nTnlocVp1Z2hoTE1EZE9MbmFZckhLeTFXQVJ2eDZJUUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pitchfork.com",
      "title": "Pitchfork"
    }
  },
  {
    "title": "Spoiler: Opening Match for February 13 WWE SmackDown Revealed - Ringside News",
    "description": "Spoiler: Opening Match for February 13 WWE SmackDown Revealed  Ringside NewsSmackDown preview, Feb. 13, 2026: Cody Rhodes, Jacob Fatu, and Sami Zayn battle in a Elimination Chamber Qualifier on Syfy  WWEWWE SmackDown results, live discussion (Feb. 13, 2026): Two title matches  MSNWhere to watch WWE Smackdown tonight in Dallas on free streams and TV during NBC and Fubo dispute  PennLive.comWWE SmackDown live results (Feb. 13): Updates, grades, winners and highlights from Dallas  Yahoo Sports",
    "published date": "Fri, 13 Feb 2026 22:10:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSG1MUDJiZ0p4MllWT1ZfS1h1aW5aVFBDYVN5NW5TdnpwQTlGY0xtV3Y0WmN2SGRHRGxSQ08zZ0k2djc5c1ZrNUlDXzNscXJaQ2hLSm4yWlZ6dXJCdHV5cFBDYlJoN2xOazBJb214NmZXZm1JbkJvOXJ1OXNQcmZSa0dGU1VfRnh2WDV0V0M3Y9IBjwFBVV95cUxNSG1MUDJiZ0p4MllWT1ZfS1h1aW5aVFBDYVN5NW5TdnpwQTlGY0xtV3Y0WmN2SGRHRGxSQ08zZ0k2djc5c1ZrNUlDXzNscXJaQ2hLSm4yWlZ6dXJCdHV5cFBDYlJoN2xOazBJb214NmZXZm1JbkJvOXJ1OXNQcmZSa0dGU1VfRnh2WDV0V0M3Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringsidenews.com",
      "title": "Ringside News"
    }
  },
  {
    "title": "What to Watch: Prestige, history for the taking in Daytona 500 - NASCAR.com",
    "description": "What to Watch: Prestige, history for the taking in Daytona 500  NASCAR.comNASCAR at Daytona: Key information, links, results for 2026 Speedweeks  NASCAR.com2026 Daytona 500 preview: Your cheat sheet to the Great American Race  ESPNTiming Out Showers and Strong Winds with Impact Weather Expected For the Daytona 500 | February 13th  WESHDaytona 500 weather update: What is forecast for NASCAR Truck race?  Daytona Beach News-Journal",
    "published date": "Fri, 13 Feb 2026 18:49:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOd1pHNmVCRl9ya2NrcWF0V09wYk8tMURBUzFuZHA5ZEliSlYwTUlJSVJDaG1wWnVyeEhGWGdBNU43VS1hYXQ2YUw1em1LSmpaZ1ljaXE0bWN3bmRmMXgxY0FGSDlPcElOdUJhS0x5M0JtZ1ZZQ0g3ME5DQUlXYklMaEkwTDdqam90amYwSDg0YkgtRWRXTTh3TElkONIBoAFBVV95cUxQeF9WU0FZZ0tQVE5hQUtwMDRnVGlHVV9pZThabE1iWG92dmNxNm9FM1M5ZEtKdU9OY3g2Nm5JQS1XWkZDRGlCdG9mX1ZzSHN1U2JPQl96YzMwU1BLWFdNcjJGTjZuOTY3ZlYtbFBRd3dGYTVhTEpjODR1aVpfQ0JJZWh0b3BlbVp5cF9XMWhYOURxenNpOGlTbmxfS1NqSjhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Surprise! US women's curling team beats Canada for first time at an Olympic Games - Yahoo Sports",
    "description": "Surprise! US women's curling team beats Canada for first time at an Olympic Games  Yahoo SportsSurprise! US women’s curling team beats Canada for first time at an Olympic Games  AP NewsCanada's Team Homan suffers shocking loss to U.S. at Winter Olympics  SportsnetUSA women's curling team defeats Canada for first time  NBC OlympicsAmericans notch 1st-ever Olympic win over Canadian women's curling team  CBC",
    "published date": "Fri, 13 Feb 2026 18:51:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSmd0WGJ1c0hEUzZLOGZPWjRVRHRWVTBCcFlRT1VFZlJ1WUdVZEg2OHRBUXVxZTZ1cHZJQzZrTGdvRk5hZTZ0WFYwNnJOeHh3NTg0U29HdjlMa1pib21OTXRIenVpNFBISEZyUHF6WTZoSUNlSFl0UGhYamdVOTByWFJmZ3hRWG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sports.yahoo.com",
      "title": "Yahoo Sports"
    }
  },
  {
    "title": "Barcelona players tell Hansi Flick of their tactical concerns after Copa del Rey defeat to Atletico - Barca Blaugranes",
    "description": "Barcelona players tell Hansi Flick of their tactical concerns after Copa del Rey defeat to Atletico  Barca BlaugranesBarcelona taught 'lesson' by Atlético Madrid in Copa rout  ESPNBarcelona players and Hansi Flick hold critical talks after Atletico defeat - The Athletic  The New York TimesBarcelona blown out by Atletico Madrid in Copa del Rey semifinal first leg as Catalans concede four  CBS SportsSix reasons to believe in a comeback against Atlético Madrid  FC Barcelona official",
    "published date": "Fri, 13 Feb 2026 19:37:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxQUTdXRkY0MjMzTzZFcVlXcUhqV25ocG5fWXloSnc5SHpzSVZyWVBFU1FFT21WZmZMTXZzei1wRkFBdXI3SnhmWE1MZW50SGpaWlFRdllqX1pxMUtaSDJwWUZUN1J1YjBTYmVlWGlNaTNzSUl6RnRWVngxM3U3VDFIY3pQT3FWU3pQMTlWQnhrQWp3dXNObEI3Ul9WRFBqd1JDUklDX0JDODgwTW5PNFBMNlJfOTJidVBTNG1PYW5ZcWtjRDJxMmdGcm5BTmtJeTVfUzNYRWpnTlZ3emF4d2VLM1RRYmFSeHF0ZmpQQm03dkJva28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.barcablaugranes.com",
      "title": "Barca Blaugranes"
    }
  },
  {
    "title": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record - AP News",
    "description": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record  AP NewsNorwegian skier Klaebo ties record for golds in multiple Winter Olympics  ESPNJohannes Høsflot Klæbo equals Winter Olympic record of eight golds after winning cross-country skiing men’s 10km at Milano Cortina 2026  Milano Cortina 2026He’s the Michael Phelps of Winter. His Secret Weapon Is Summer in America.  The Wall Street JournalJohannes Klæbo wins eighth gold, ties all-time Winter Olympics record after thrilling 10km free victory  The New York Times",
    "published date": "Fri, 13 Feb 2026 14:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNWGtTZnhSWnh6cHY4RkkzX1pSOEJYTHItamp2X3NkRWd5NnRvSmUwN19NNERfNWkxNVppSmxaMTJDdENaQ0NoTmxVZ1BZaU41a29KNllmTWZlUTJwbUV4RnN2ekI3eTBMdEFXdmh4VGZfMXBwVkxPN1FkRHhPOUYtbzJCZkpRR1I0QnRpRTlIVERJUDB4Y1pEUFY1S0F4TUdla3pqZkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Antarctica 'ghost particle' observatory gets major upgrade that could 'pave the way' to physics breakthroughs - Live Science",
    "description": "Antarctica 'ghost particle' observatory gets major upgrade that could 'pave the way' to physics breakthroughs  Live ScienceWorld’s largest neutrino detector gets 650-sensor boost to track supernova blasts  Interesting EngineeringThe IceCube experiment is ready to uncover more secrets of the universe  Phys.orgHundreds of new ‘eyes’ buried in the Antarctic ice  TU Dortmund10,000 Sensors in the Antarctic Ice Measure Cosmic Neutrinos  All-About-Industries",
    "published date": "Thu, 12 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxNSi1hS0hsaTNFN2dVSFlSNlVCUWh0dUpDbG1McFRDbVZ3ZGR3RUVnVGpnVG96Uno5YjZJWFVoZWVNdlRoaUZrTTRYd0NFemZEUDBqWHZhbEJ0MW43X1RVbW1vTURPSzZhQTREQnpHZUJvZFVHaGY3bjUwX2tidEttQXpDWV9mdjhJcm1sRWFnTXZGN2JjUWNDWVFqQzFZS2JRa0xjVVhSa0VjYVlEZVZaLTJCY3FKb01nV01ndVNYeUVZVTJvdVNnMW9ULUZPcWlwRzhyeWRFcVVnQzdPYzhHYW1MM2EtdE16WDhXdnBnSHNWeTh1NlFWM1hVMEprdk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Astronomers witness vanishing star collapse into a black hole in Andromeda galaxy - Space",
    "description": "Astronomers witness vanishing star collapse into a black hole in Andromeda galaxy  SpaceScientists Capture the Clearest View Yet of a Star Collapsing Into a Black Hole  Columbia UniversityArchival Data From NASA’s NEOWISE Tracks Star Turning Into Black Hole  NASA Science (.gov)Have astronomers witnessed the birth of a black hole?  NPRHow did an entire star vanish in the galaxy next door? A black hole may be to blame  Scientific American",
    "published date": "Thu, 12 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOa25JNTFOTVdRd2F5a3JROTRTTGk2dEVJaVNFMDgyT1JiUUN4RWRvZEtXYTZ0MUgzRmxsZURPQXF3TXIxaHNkTjViSTg2VHZWUUxJb1RaeUxQTnRGX3VqcHhzemI1UUctaTdJN1VwbXNQdXhQUzFzRFVyNVBKVVZ1ZXg1dWRiSnI2Z1BKSjZMako4YU9Wc3FZS2g0YVpQZ0FncmdKYW9DSU56Y1BWT2hoQThWN1lNYlNGZkgwaTVDU3ltemc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test - Spaceflight Now",
    "description": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test  Spaceflight NowWhy are the launch windows for NASA's Artemis 2 moon mission so short?  SpaceNASA Conducts Repairs, Analysis Ahead of Next Artemis II Fueling Test  NASA (.gov)Practice Makes Perfect: The Wet Dress Rehearsal  HackadayNASA is sending Artemis II to the moon. Here’s what to know  Houston Public Media",
    "published date": "Thu, 12 Feb 2026 15:34:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOcmFCcldVNDNLYng1RTNlOWFtU0hvTjlENS1vdkxiVDlRbXlJMUZObjBUN1lWUGJZRnk4aTYwUXdLalZYdGxOYnhpVVlwcnRScXJvbGJzRzhzWEFFa2VkSDJtb3RzZDNMZ056cDRqeWRyWi1NUlpkWEZvLUwydFZpb2cyV1hyckxpTzJsMU5RT1BUTTZkakZzcVdCbnR6QUJhZDV0elpHbDA5V3ZhNmtGMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "Saturn’s Rings Came From a Two-Moon Collision About 100 Million Years Ago, Study Says - Gizmodo",
    "description": "Saturn’s Rings Came From a Two-Moon Collision About 100 Million Years Ago, Study Says  GizmodoSaturn's moon Titan could have formed in a merger of two old moons  Phys.orgThe Cosmic Collision That Formed Saturn’s Rings  YahooSaturn’s Largest Moon Titan Might Have Been Forged in a Cosmic Collision  The Daily GalaxyTitan may have formed in a giant impact between ancient Saturn moons  Space Daily",
    "published date": "Thu, 12 Feb 2026 23:30:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNWFBiQ1RkYmZIRjN1TVF2eWNWX2Y3bWxrNnRwNzZSc1o2Mm9KYkxiS05ZSHJfU05Nbl9ZUUpZZUNic2xOWGR5M213c1k4cTZTTndYeHZsQkh2XzRWN2JKdnRfRTI5U3VuUGJqQl9VMi13bnB2NVRsaENrbExhYUxlRkUyNVpmbzdKMmVrdTFGQl9xa2hKS3cwTFc0bDdRUmFjLVlzUkFCcVZuVzhNWlJlZ2J6dnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "Measles Outbreak Hits Florida College - The New York Times",
    "description": "Measles Outbreak Hits Florida College  The New York TimesMeasles cases at university in Florida soar to nearly 60 amid growing outbreaks nationwide  CBS NewsAve Maria University battles measles outbreak  National Catholic Reporter57 cases of measles confirmed at Ave Maria University, 7 currently contagious  WINK NewsStudents hit by measles outbreak at Florida university  USA Today",
    "published date": "Fri, 13 Feb 2026 23:26:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNdmE3ZC1keXZvaUplWWR6cEpDUW9FVF91cUdwQW5jOHkzY19BT19JdkNxNXhPSmg0aE0ySjRtbWVFT0NfRHZpTlFBVk1fZ0xfcEd4VmVsMVQtQW9EaTZ5NFNBRG5PbWV2MkVqOFZ0bUJzbjFBVl9nWFJkc2QzMHlXYjF0NTY1SXFI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "WHO slams US-funded newborn vaccine trial as \"unethical\" - Ars Technica",
    "description": "WHO slams US-funded newborn vaccine trial as \"unethical\"  Ars TechnicaWHO director-general calls plans for U.S.-funded vaccine trial ‘unethical’  statnews.comStatement on the planned hepatitis B birth dose vaccine trial in Guinea-Bissau  World Health Organization (WHO)Lawmakers want answers on CDC-funded hepatitis B vaccine trial in Africa  CIDRAPGuest post: The CDC hepatitis B study is unethical and must never be published  Retraction Watch",
    "published date": "Fri, 13 Feb 2026 23:16:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNElOc0h0aG1Lck5tVUpRTTFnS2pEOEVxU2hndTl1UFpIYkU3NUZsZlFkNmRfdUh1dEdtS3l4NkN5Nld5N19EeWRuWUNTV2g1ZG1halJSUkVfR0x4YWJqODNVSElpM09SSzh1UGFKODJvLWQ2em1WSzFuSGhaOWl2WFIySnJoMHRuU29sNU9ZbkV4WGxfd09DaklR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Mehmet Oz's vaccine call is 'too little, too late' - DW.com",
    "description": "Mehmet Oz's vaccine call is 'too little, too late'  DW.comOz Offers Forceful Call for Vaccination as Measles Becomes More Dire  The New York TimesOnce-eradicated measles virus on the rise in Ohio  FOX 8 NewsIs measles rising in your state? See case map, weekly outbreak numbers  USA TodaySix measles cases confirmed in Lancaster County | New report  WGAL",
    "published date": "Fri, 13 Feb 2026 20:14:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPQlZsWktPa0o4TGgzTkVTRkdIeUZKbFp3U1pyZ1RQTDAwWWFENTdHOHRhMDhVUjVwQnFHMUdsaFVUUkJqRkk2OGJCN0JIMnp5VHYwNHZTNXFjWUNEaDV1TDZjaS1YbHBWU1REVU1Sc005bXBoYXlFWHQwZ0RXTFRHNTRHakttanNzSGJQU1otX1lMSlBEcmJWQjNkVGlTLVE3MkROa2dNTnMzRkowcTdmNURBMFhDYjFTQUYyT25wS2hlTjZM0gHEAUFVX3lxTFBHZVowQTVzQ0tONjlNdnp0OEVzUFNWdl9DX01ZXzZRVXVjb0lNQjJLMzY2V19Ic0NMYnlhX0VhcDJwdFFjQWVHVEVHbVhZOXlLcWQ4MW1fSGNiS09jQ0d0Z29YZWhuWkRQY0NyWkJ6NHQ3MGZybTFMd0JtZlRoOS0wY25pMVpuV29iQlBjUmxuZVZEdnhQR09PTklfUUhjWTFzM3RCX3RYLU0zazBZTHhMVzdxZU9jYzV6clNOY1BlUFhkeVI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "'You're not just recalling words, but an emotion': The lifelong benefits of making music - BBC",
    "description": "'You're not just recalling words, but an emotion': The lifelong benefits of making music  BBCWhat Happens in a Performer’s Brain While Playing Music? - The New York Times  The New York TimesDepartment of Music to welcome music and brain research scholar for two-day residency Feb. 19-20  Ashland UniversityThe psychology of love’s soundtrack.  Psychology Today‘Take on the world, all with the power of a song’  The Daily Beacon",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQzMyVzJSX29WNnZvM3o5RTU3N0hsdmh0MUF0dm1STmlKWGlUVk5zXzg4RGZmanJwUXh5N1JUOW1tdDlMUUtPaTNwVElqaEgzSlg3OXFRSnhrRVRObzZRMmJXMDVfd0pkUUp1MGhsbzlqX2M5aGU2aDVmQzFlb1VYa3k3NmwxOXEw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]