[
  {
    "title": "Goldman’s Top Lawyer Departs Amid Revelations About Her Ties to Epstein - The New York Times",
    "description": "Goldman’s Top Lawyer Departs Amid Revelations About Her Ties to Epstein  The New York TimesGoldman Sachs' top lawyer Kathy Ruemmler to resign after emails show close ties to Jeffrey Epstein  PBSKathy Ruemmler, top Goldman Sachs lawyer, resigning amid Epstein fallout  CNNJeffrey Epstein gave her a $9,350 handbag, but did Goldman Sachs' departing top lawyer violate any rules?  ReutersGoldman Sachs CEO tells CNBC he 'reluctantly accepted' lawyer Ruemmler's resignation  The Detroit News",
    "published date": "Fri, 13 Feb 2026 16:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPWjZwMHBmNXZlOUl2MGpvOEd0WUJ4RGVoR25RdW0yTGtxNFJiVGpVX1gxZTRwT2x6UlBpaHlVeUVfMGc4THFrdHlEc18yVVZqMjdEVVdUMzJOSE5HRmRhNlVVcTg0aS04cjR0ZC1VSjRTZEcyMXB1QVUxS2VNZWNLdE5SVndZNDVvNkgyS19zdk5VQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "RFK Jr. made promises to get his job as health secretary. He's broken many of them - NPR",
    "description": "RFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRRFK’s idea of making America healthy starts with making it politically sicker  The EconomistTrump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK Jr. promised to restore trust in US health agencies. A year later, it’s eroding  AP NewsWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOR0dUZnUzemNidUpDTl80Uzh6QnlZODJzS2Jrak9nNFU0R09RanFCaWhUVGVLRUJCekhHWTIxV2NyOURnUVUwaGgxQ1VLRDVmcUVGbXNWQUJOalNjdmhaVXBSY0lyR3dxcmg2VEFzRFBuOHRpYXcxZEhzQi1MbFRLMnplcGdzenZnWjNpZXVKT2tVeFJRZWlKZ24ycGtpY0FvdldjTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Dubai's DP World replaces CEO after Epstein links emerge - CNBC",
    "description": "Dubai's DP World replaces CEO after Epstein links emerge  CNBCHead of DP World leaves company after Epstein links revealed  BBCPowerful Dubai tycoon replaced after DOJ reveals sexually explicit emails with Epstein  CNNBusinessman named in Jeffrey Epstein files replaced as chairman of major logistics company  NBC NewsSultan Ahmed Bin Sulayem—”Close Personal Friend” Of Epstein— Resigns As CEO Of DP World  Forbes",
    "published date": "Fri, 13 Feb 2026 11:55:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPb1FaM2VfdlFxNTJSTGNTZl95aS1MNUFja3JYZkk1bUI3Vnp4MnlOMi11cmc5TWFkNnZTeUlxQ3E5R2NqTUw0a1BsckJwMmZfMEZWUWVYNWw0eTlSRTRtTzU1VGExRV9pQkhBSUVzZE5Da0RBMlBPTno3bldyVVI0UDFvc2ZtdEg3emNJNVVJcVl0VS1rdm5V0gGcAUFVX3lxTE8wUkFIOUxxR3d3WmhaajdrY094cXNxNkdWd2hyR2NldW1JSldULUpzWXAzamZoY2RJNXRvbl9QUEloUHhiWldjZTVXZGhzT3hlaWFVcC1yNkVicnNhY3JuWENHWloyWk4tT05laFlnZExoZVQxNHE3MUxRZDE1b010d1oxYUZIZmhxcWFVVzNqTE5jaDZORmg3V0Q0Xw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Before Mass Killing, Mental Breakdowns and Online Violent Extremism - The New York Times",
    "description": "Before Mass Killing, Mental Breakdowns and Online Violent Extremism  The New York TimesTumbler Ridge: What we know about the victims killed in one of Canada’s worst ever school shootings  CNN'Everyone knows somebody affected' - small Canadian town united in grief after mass shooting  BBCSuspect in Canada shooting is identified as an 18-year-old with history of police visits to her home  AP News‘What word is there for this?’ Tumbler Ridge reaches for unity in storm of grief  The Guardian",
    "published date": "Fri, 13 Feb 2026 02:26:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQTnl0NXBvaGQyVVNFYmNKVGowRWF6U2EweE9HMTdYY3M2eEF0ZDlYYWZ2c0NqLUhNYVdneEI0OW5HSFI3dE5NQjNxOVVXY3MtYnM0UTMwa3J4X1pLSThxUG1majF5aFpkNHgxQ3NQT3FTN3U3Z0JZZUg4NElOTmR1OHJMQVd5amFJWDRCMk5PWG5jV0hrVU9hR0hMNGo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Tips Flood In, Prompted by Video of Suspect in Guthrie Kidnapping - The New York Times",
    "description": "Tips Flood In, Prompted by Video of Suspect in Guthrie Kidnapping  The New York TimesThe Guthrie Kidnapping Has Families Rethinking Senior Safety and Independence  The Wall Street JournalNancy Guthrie investigation: What we know about the search  NBC NewsScreening tips in Nancy Guthrie's disappearance is 'tremendous' and critical work, experts say  AP NewsReno Police explain how to keep homes from being targeted  KTVN",
    "published date": "Fri, 13 Feb 2026 10:48:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9SdG9ORTc5a2ZkMGhzNEU0TVpPLTZtLUswWmNQaU9TQWNuSTlYTDRGdEo3ZUdSaGNEUUM0a3Vfa242LThTM0RPMHp5Q2IyUlEwZExpUTRhcUlmNWZLMG9XS2NzdXNnejg5OWZqZU1CMzZHQ3dqMFAzZE1IS0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Bangladesh Nationalist Party claims victory in country’s first election since 2024 uprising - AP News",
    "description": "Bangladesh Nationalist Party claims victory in country’s first election since 2024 uprising  AP NewsFrom Exile to Power: The Rise of Bangladesh’s New Leader  The New York TimesWhat does BNP’s landslide mean for Bangladesh’s post-uprising order?  Al JazeeraA historic election in Bangladesh brings BNP to power. What to know about its leader  NPRBangladesh Nationalist Party sweeps to victory in first election since Gen Z uprising  BBC",
    "published date": "Fri, 13 Feb 2026 10:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOWTA4b2dlUEsyR0cxdVpvZnlpdE9xaVkwSmdlQVBRNElrd1p1aTdGMS1GUEd4My1Cc0EzVG1TN3ZmNHJ4YUJWUlZ0em5xLU51UXVFa3FjLVpwRF9sLXk1a3NySkJZaDB0TENNckc4c3YtbkVIYTByX0wwejQ1Z3NoNVJoclZldlhIM09md2Nqb3JLYm9TWk9sU1M0cHVRMEhrdkg2RlAtZGE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump nominates hospitality executive to lead National Park Service - The Guardian",
    "description": "Trump nominates hospitality executive to lead National Park Service  The GuardianView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 02:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOV240VGhiN2tFU0NrN0JtTXFZVFItMTRXYWRJMFM5VHpQeGcyWlUxSnZqU1JHREd3dTQtQm93NGZwaVp1bFVlOTVsdVM4T1dqMUxXMWE5TGNyWkRxLUF2T2tSV3VBRWdZcU85MUhkMEhIeGNkT0RlVFJ5Nl84dHdYNWc1aFpiQUhyUDNHcjBxZlJFTFlmWG5PdGM3Mng0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Prosecutor Says Federal Officials Gave Wrong Information About ICE Shooting - The New York Times",
    "description": "Prosecutor Says Federal Officials Gave Wrong Information About ICE Shooting  The New York TimesProsecutor moves to dismiss charges against men accused of violent encounter with federal agents in Minneapolis  NBC NewsGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSNorth Minneapolis ICE shooting: DOJ dismisses charges against Venezuelan men  FOX 9 Minneapolis-St. PaulProsecutors move to drop ICE assault charges against 2 Venezuelan men in Minneapolis  KOMO",
    "published date": "Fri, 13 Feb 2026 16:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUDN5MUdVVDJfRW5FVVN2RXlFNnJJcnVKOTMtTV96RWNwNlVZZlp2ZEhjTFF4SVIwdm1tXzM4RU5KMWNETnZwT1RBb3JuWnppSDlOREN5QXVoX3RCWnN5QVUxVmpSdW1XLWd5RThacE5Yb3JtSXZLaDhrMGdWRWgyTzF5bGJrMjEwNmFRMmtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America - The New York Times",
    "description": "Beyond the Big Cities, ICE Is Rattling Small-Town and Exurban America  The New York TimesPressure mounts for U.S. Congress to block funding for Homeland Security  The Globe and MailList of ICE raids, major updates in Minnesota on Thursday, Feb. 12  Bring Me The NewsActivists Are Fighting ICE Even Though It Could Get Them Killed. Here’s Why.  SlateICE is pushing Minneapolis underground  The Verge",
    "published date": "Fri, 13 Feb 2026 10:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9VRm9MdnU4UkwySzJlZVV6S0pJazgxUDZQQ0tYWXRsbEFEeXNCZmU2WjZyUm1MNGxWRWtYUDNPYzFmQ3oxVU5vYnZ5SnBWUkQxYVZuazFBRzU3czEwY2xINUxMUlVyc3pRdUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers - The Washington Post",
    "description": "DOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostSlotkin demands confirmation ‘illegal orders video’ investigation has ended  The HillEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC NewsTrump's revenge tour falls flat in the courts  AxiosHow Trump failed in his latest bid to weaponize justice  CNN",
    "published date": "Fri, 13 Feb 2026 15:41:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPb3BTZWxnWlBiZTNHUTNWYzFGbTlzcnNDLS1MVVEzelVuN1Vhay1UMThnNXpGVFowUVptNXF5YjBSZ1V0UGg4NzN1NVp4SU0zYkg1bTFZNXBRMVNLSl9ReGpDdnR5MnhwMnh1ZHpzYTd0djUwVlhOWHRoQy14a3BxUU5kVURqRVJ1dUl5UE9lZXR6aVB4OTI1VjRUQnEtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Ukrainian forces say Russian troops paid them for a fake Starlink service that instead revealed battlefield locations - Business Insider",
    "description": "Ukrainian forces say Russian troops paid them for a fake Starlink service that instead revealed battlefield locations  Business InsiderMusk’s Starlink Blocks Russian Troops’ Internet Access at Ukraine’s Request  The New York TimesRussian military scrambles to find Starlink alternative after access blocked  The GuardianUkraine Advances in Zaporizhzhia After Russian Troops Lose Starlink Access – NATO Official  The Moscow TimesRussian Attacks Slow a Bit After Starlink Access Denial, Telegram Shut-Down  Kyiv Post",
    "published date": "Fri, 13 Feb 2026 05:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNWFllV25ILW5Pem9TYWl0Z2xKQ2hRZFBVeGZRdXUweTBoVEpqVXlBV0psQXp2Y2JMdklKZG9DM3laa19CczVKaDlkLXBpSnNudkxBWmdyVldlOTZCcDVmNEdxeWhRaU5kaHdkaDJYbkJIZkdlVEMzbHRRbjU5S2dHTWV2b0FBUm1TejJ2Z1VaVHBBNUVlWmVSWkN3cHcwWVZZNVZEOTk3ZWhpNzNJbkVwaQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Who will police Gaza, and how? - NPR",
    "description": "Who will police Gaza, and how?  NPRUS-backed plan faces Gaza militia, contractor conflict  The Jerusalem PostUS security firm that oversaw deadly aid sites in Gaza in talks for future role: Report  Middle East EyeUS firm that secured aid sites talking with administration about new role in Gaza  The Times of IsraelUS firm involved in defunct Gaza aid scheme recruits new officers, website shows  Arab News PK",
    "published date": "Fri, 13 Feb 2026 10:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAyWnhFMDl3SmMyMU00Z1h3aDV3V1lpTUJhaU5sNXVwUkFPLUlyN21JaEN5c2I0S0dFbnNORkVreHpaaUEta3JxdU56Ukxjd0M4M2ZoUXRqVFJkWWgxWjI0VGN2TXdFa0FkelZsbmZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Sister of North Korea’s leader says South Korea’s drone regret was sensible but insufficient - AP News",
    "description": "Sister of North Korea’s leader says South Korea’s drone regret was sensible but insufficient  AP NewsNorth Korea says South Korea should take steps to prevent violation of its sovereignty  ReutersNorth Korea warns of ‘terrible response’ over South Korean drone flights  France 24North Korea Warns of ‘Terrible Response’ to More Drone Incidents  Bloomberg.comSouth Korea police raid spy agency over alleged drone flight into North Korea  Euronews.com",
    "published date": "Fri, 13 Feb 2026 04:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNQ2tqZkZWakl2UzJLLTdTMk5INUdva1VxU3B2ZXhXSFZaNUNfSVB1YWM0Y3VyQk5fODBSZ3k3eG1qYnBfU1NJRXNkRnJ1bnVPZ2NmeUROXzVOY3BIblU5WW5OUzFfa0hFNm5YdWtSc09KUDhDWk82a1dtbzBtZzZva054RUthZWNfRzN3eFpNNFFVbnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Former McKinsey partner to lead Australian opposition party - Financial Times",
    "description": "Former McKinsey partner to lead Australian opposition party  Financial TimesSussan Ley: Does Liberal Party drama show Australian politics still has a problem with women?  BBCOnce demoted, now deputy leader: what will Jane Hume do for the Liberal party?  The GuardianGrattan on Friday: How did the Liberals’ first female leader find herself on the mat in under a year?  The ConversationTony Abbott issues Taylor a warning on what not to become  Australian Broadcasting Corporation",
    "published date": "Fri, 13 Feb 2026 01:27:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zWkZqQ3ZxR0xLNlcyVGRXNlpYZ0thTWNiNzd1SFFON2JNcEZxNmdYQVlXSVRPRXFlVDJMckFaOXJrLUlRSnozc1R5dy03RXQ0TkFIVi16WDY3M0JSTThfUW9wRFhTZ0Uxem1ZU0VuY2Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "S&P 500 bounces after light inflation data, but still heads for weekly loss: Live updates - CNBC",
    "description": "S&P 500 bounces after light inflation data, but still heads for weekly loss: Live updates  CNBCConsumer prices rose 2.4% annually in January, less than expected  CNBCAn encouraging update on inflation steadies Wall Street after its AI-related sell-off  WRALInflation slowed in January as consumer prices rise 2.4% over prior year to start 2026  Yahoo FinanceInflation eased more than expected in January  The Washington Post",
    "published date": "Fri, 13 Feb 2026 16:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1rMzAwSXVIelF1VVJ2WU1YbzFiLWtfa0xMRDFVLTZpVE1WcGlrM3hPZnJScFV1b1A2WTNXX3JQeHFEcWRaTU5HdDlYMF83czJndGZqZUY0Y3piUTkzME5LaWFoVlFQQ0xCSXAyaGtlNUlMMU1JMTBJ0gF8QVVfeXFMUG1WcWJDeUpjZVd1ZDdzSWxFaEQ1VUlWX0NnWnFBZTQ1dFBmVlF1dWY1TzRjS2hUbjItWGxzWjFjczZ4QnU4RWVsQ2thWFMyZ0I4T2lfM0p0U3VaUFc4S0t5RXZVTTUyQS1sMzBQYWhOWlhWZ0lncmpnczY1Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "CEO Marc Benioff's ICE jokes stir outrage in a pivotal time for Salesforce - Business Insider",
    "description": "CEO Marc Benioff's ICE jokes stir outrage in a pivotal time for Salesforce  Business InsiderSalesforce Workers Circulate Open Letter Urging CEO Marc Benioff to Denounce ICE  WIREDSalesforce reportedly lays off hundreds as Benioff jokes about ICE  Yahoo FinanceSalesforce workers outraged after CEO makes joke about ICE watching them  The GuardianSalesforce employees call on CEO Benioff to cancel ICE 'opportunities'  CNBC",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUWJrZE50R0tMYmVnUlRjM0VreUNEYUcyeXZ0Z1ZlWjlhM3FpYlVnSTV3d3Ria2FaTWJZRGhiMzY3Qmo3a0ZCejNhMUdkOTByMlo4bWxoMWItQmRnWWlqZmhaOGNpR09YZExxeDJyaG1QcW9vdHg2YktxQ1lMSWxsME4wekFGRmNJT2pwNkhRa0t6WTkxTHl2SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "How packaging and logistics companies are automating their warehouses - CNBC",
    "description": "How packaging and logistics companies are automating their warehouses  CNBCHow robotics is changing the supply chain [Q&A]  BetaNewseBook: Transforming Global Warehousing with Automation  Logistics BusinessDiscover how an innovative project with Renault is reshaping warehouse operations — exclusive insights into the technology and transformation, expert opinions on the dawning era, and what it means for the industry  russpain.com",
    "published date": "Fri, 13 Feb 2026 12:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54dUpmVUdsMlhSQ1BEeGpad2tZWjJwSi1qc3JwaXFVaDhsY0dVTEtTck1aZHgzTUI1WEY2YllibnlzY0hMU1VISGhuN2RhM3pUODV5eWVtbTRFMXNmbDNxMElqUzI1ZlJ6ZVlqRm5kYTRVUEo0bFk2U0lMa0PSAYIBQVVfeXFMUEdySHRicW9xUDJBbGp3QXNmXzhwOEVnZ1dtQlNqX2Fnd1VObVg2TUJ1Ym5naDhvVVVoRmJNUjE4UjFxdzl2anhCQUkxRmxwZ3c1WHh6MGNoSU11M1htdEJ2LUZOaXV3YmpKdWlfb0VZUC1COHRTR2lreEtha3BfalMxUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Stock Market Today: Dow down 100 points as stocks retreat after inflation report; silver gains after rout - MarketWatch",
    "description": "Stock Market Today: Dow down 100 points as stocks retreat after inflation report; silver gains after rout  MarketWatchThe Chicago Board Options Exchange Volatility Index (VIX) has recently risen to 20.05 points.  Bitget^GSPC Today: VIX Nears 20, Volatility Jumps — February 13  MeykaVolatility roars back: VIX tops 20 amid tech and crypto sell-offs  MSNVIX surges as stock-market selloff looks set to continue after Challenger report  MarketWatch",
    "published date": "Fri, 13 Feb 2026 16:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPS0t2THJJMFZWWTFSWXF3Ml9Cbk9sUkxuZlBULW5PU2JDLUhTbXdjVkxFcDBsZ29ZbTNlckxtVFRVV1BUMHNUUGdvazVLVGdfRERsU2tOMzRuRmQtVl9zU2tjLXFTX3RvbFNTcDFISWhnWllNTndRd1FuRmFSakN3cnJoa256Wk1lVTNxN3UtUFlSREw5UjQtQXRsVDl3OXJBWW1SU1Q0U2x2WElURUkzdlF2MlUxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "iPhone 18 Pro’s new C2 chip will bring three advantages over iPhone 17 - 9to5Mac",
    "description": "iPhone 18 Pro’s new C2 chip will bring three advantages over iPhone 17  9to5MaciPhone could get satellite 5G this year, leaker claims  MacworldApple C2 modem to bring satellite 5G connectivity - GSMArena.com news  GSMArena.comIs Apple about to revolutionize how we connect, again?  applemust.comThe iPhone 18 could get one really cool satellite feature, leaker claims  PhoneArena",
    "published date": "Thu, 12 Feb 2026 16:38:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNRGl4bFZtZ1ZTZE9LcVhMcmRWX0M4MGJiYVJvUEMwYlBzd0l4ekpSTnFnQU9VakgzQlM0REJKLUtZdU1NcHF3V3lMUnJGd3RpSXNlOUk1dXBRSFYxdmZpUjVIeXFONFNGcWJCZ3ZnMUFTNmY2LVRvR1RSUVFzNFRISmEyZ0hjTzZ1Q0xyZmJ1alZfeTJsOWtHOEVhQlk0dkNZRFBn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Windows 11 is getting a big security update - Neowin",
    "description": "Windows 11 is getting a big security update  NeowinMicrosoft to Enable ‘Windows Baseline Security’ With New Runtime Integrity Safeguards  SecurityWeekMicrosoft is giving Windows 11’s security settings a big makeover  Windows CentralMicrosoft wants Windows 11 “secure by default,\" could allow only properly signed apps and drivers by default  Windows LatestWindows 11 gets a new security mode to block risky software before it runs  Moneycontrol",
    "published date": "Thu, 12 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBvdXhsLWJ0TjU1M0swSUR4ek50R3FqREFBRDZVc1FkM2xaeDZrQmhCMUNpckowVGRldHY1ZHg0WU9sVzBLMXpNdEdHNmFXb1FsaGFWNGJkNjc5NzlyOExrZ3ZHN1dSZUhxa0pFNXEyUGc5TmFEVzlhWkxsdUbSAXtBVV95cUxOWkRGc2Z5MDRRa3hPcUNjUFFKR1F4TU1zX1dLYm9xUGRBLS1ocGs4YTduR1ZqbVFPMmM0MzR1dTQxZHNOb3ZucWRiYUhEMHdVRk95MFdOaG1ZYzVHUEJveEh1allucGQzUHBqd3VXd1VRZVgycXpvc2dfbGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.neowin.net",
      "title": "Neowin"
    }
  },
  {
    "title": "Google Docs rolling out Gemini-powered audio summaries - 9to5Google",
    "description": "Google Docs rolling out Gemini-powered audio summaries  9to5GoogleGoogle Adds Gemini-Powered Audio Summaries to Google Docs  Gadgets 360Google Docs gets a big Gemini boost focused on accessibility  Android PoliceToo Long, Didn't Read? Google Docs Now Summarizes Your Files Out Loud  Android HeadlinesGoogle is adding Gemini integration into Google Apps  Miami University",
    "published date": "Fri, 13 Feb 2026 01:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5oMDR3eHBFd2NZR0VFdkdFYjBpRkNoU19pWUNkYkltSFFyUXJ4cWl3cGhIUnRrdWhRbVZydDhkZDVKZmw3TWZiWm5PelFYTWdZN3ZycGFSOEl6Q2FUSU9lVWV4UW1Zb0tudWsteklYQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "Stephen 'tWitch' Boss' widow Allison Holker announces engagement: 'Showed me how to love' - Entertainment Weekly",
    "description": "Stephen 'tWitch' Boss' widow Allison Holker announces engagement: 'Showed me how to love'  Entertainment WeeklyAllison Holker, Stephen 'tWitch' Boss' widow, engaged to Adam Edmunds  USA TodayAllison Holker Is Engaged to Adam Edmunds 3 Years After Stephen \"tWitch\" Boss' Death  E! NewsAllison Holker announces engagement three years after husband Stephen 'tWitch' Boss' suicide  Page SixAllison Holker and Adam Edmunds Get Engaged After Surprise Proposal During Her Birthday Party  People.com",
    "published date": "Fri, 13 Feb 2026 02:07:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQNThZRHNERlJlOGpodXhZcm5vWF9nVUpSbjZreFBQQkQ4QUl5R1RhTTV1Mk9CRkc4RGxSWGU4MU1UZUExOHRIRkQ4MjVjLTlETVJrRXE2djZIajBhUDlZejRxOUdMTG5FY0dqendHblI1VEFlTzVyVldmc09hSG0xWmt6MkxnX3V6R0JSRTF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Here Are All The Best-Dressed Celebrities So Far At New York Fashion Week 2026 - BuzzFeed",
    "description": "Here Are All The Best-Dressed Celebrities So Far At New York Fashion Week 2026  BuzzFeedAll the celebrities at New York Fashion Week, including Anne Hathaway, Pamela Anderson  USA TodayTWP Fall 2026 Ready-to-Wear Collection  VogueThe Most Jaw-Dropping Celebrity Looks At NYFW This Year, From Front-Row Fashion To Street Style  YahooAmanda Seyfried, Lana Del Rey, Tessa Thompson and More: All the Celebrities at New York Fashion Week  Vanity Fair",
    "published date": "Thu, 12 Feb 2026 22:50:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQRVBlOEh4R1dhczFXMno4bWhHZ1VEcjdNVkgwU09oNkIwc3g1QVYzcmhIeVhGejNFc2tfNjdyR3N0YU5qNVdHdlh3ZDE3NXJ3dUs3Y1lJRzZQbHppZXF1VFhYMmhxeW5qaGdtNDRqZzF1S01qZGVrQjh2MTRndW9JYjVmajdJV0dUMlBNLXFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Listen to Charli XCX and Sky Ferreira’s New Wuthering Heights Song - Pitchfork",
    "description": "Listen to Charli XCX and Sky Ferreira’s New Wuthering Heights Song  PitchforkWuthering Heights soundtrack the perfect pivot for Charli XCX, says Brat co-writer  BBCCharli xcx: Wuthering Heights review – atonal, amorous anthems that more than stand apart from the film  The GuardianMusic Review: A post-‘Brat’ Charli xcx broods on the ‘Wuthering Heights’ soundtrack  WTOPCharli XCX Takes Us to ‘Wuthering Heights’: Stream It Now  Billboard",
    "published date": "Fri, 13 Feb 2026 05:13:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZlZVV0oxN21SeWJkYk9YUzVNdVpOTzFiSjBOOFVLWVBvc2tQYUl0VHFCV2NWeFpwWUdDY0p6OGN2eDNWUks4Q09JZ1VwdGxEZldEaHpHYURIdDZCaXhmUXR0cFROekZUTDZ2MlZ2cWVXajNVY05kVzI0WEpIeWNrNWpiUndDV2xaenczRS1UUE9heDlFNHZFZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pitchfork.com",
      "title": "Pitchfork"
    }
  },
  {
    "title": "American Olympic medalist speaks out against judges amid controversy in figure skating competition - Fox News",
    "description": "American Olympic medalist speaks out against judges amid controversy in figure skating competition  Fox NewsMadison Chock and Evan Bates respond to judging controversy following silver medal  Yahoo SportsMadison Chock says ice dance judges should \"be vetted and reviewed\" after France's controversial win at Winter Olympics  CBS News2026 Winter Olympics: ISU backs French judge's controversial score that gave Evan Bates, Madison Chock silver  CBS SportsFans of Chock and Bates launch petition questioning ice dance result  Honolulu Star-Advertiser",
    "published date": "Fri, 13 Feb 2026 16:10:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQb3JFS2gtaHdfWkFfbFVKV0tMMkpyLTZLNko1OXBueG9qYmRTZ1NQbE9OZnpkcDFkNUU2TW5XM1hid25yNmd3WEpERGYzUUVaSFBmSkl0NHhPaElWWHpLcnJtUXRPZU1WWkVQZk1hM3hqRFE1dkJ3elhBSVpYaEd2ajB3V2Zrb2lJVFhiTzZ1VlJqenZqZUNlbi03VFVEZWJ0Zks1TFlPSFRZX3lWOE9kMVljTjQ3Q2VuRTBLaXdzb2ZSUDZv0gHKAUFVX3lxTFBhamE5U3h1Y0ZCa18xQkFrald5Si1rbkNNWWRkQjhXUS15VnNhU2RrUFpuWWFVbTlOTnZEUzA0U2w4ZTkyckdlcXlHZHZ3cGswZ0FNWEhHSUJvWkluZmU1RG5YRG5oSk5WQXB1UDNxZWVVZ0NhOHZhaGNGSWt2QkxzU1NDOWdySHczb29tVU9SNlpIRlprcUl5MjVKTm5OZWNUa1JiRmFQTjUzd1dtdVFxTmE0bS1CTnN3aXVfMVB4eTNUYnV4TUh2cVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  },
  {
    "title": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record - AP News",
    "description": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record  AP NewsNorwegian skier Klaebo ties record for golds in multiple Winter Olympics  ESPNWinter Olympics 2026: Klæbo seals treble; Australian snowboarding gold; GB drought goes on – live  The GuardianWinter Olympics 2026: Norway's Johannes Høsflot Klæbo ties record by winning eighth career gold medal  Yahoo SportsHe’s the Michael Phelps of Winter. His Secret Weapon Is Summer in America.  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 14:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNWGtTZnhSWnh6cHY4RkkzX1pSOEJYTHItamp2X3NkRWd5NnRvSmUwN19NNERfNWkxNVppSmxaMTJDdENaQ0NoTmxVZ1BZaU41a29KNllmTWZlUTJwbUV4RnN2ekI3eTBMdEFXdmh4VGZfMXBwVkxPN1FkRHhPOUYtbzJCZkpRR1I0QnRpRTlIVERJUDB4Y1pEUFY1S0F4TUdla3pqZkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Russell tops Day 3 morning session at Bahrain test - Formula 1",
    "description": "Russell tops Day 3 morning session at Bahrain test  Formula 1F1 testing: Mercedes showcase pace as Antonelli, Russell top day 3 in Bahrain  ESPNAntonelli and Mercedes top final day of first Bahrain test  Formula 1Mercedes sets new F1 test benchmark, more trouble for Cadillac  The RaceF1 Testing: Mercedes set fastest times of week but George Russell warns of 'scary' Red Bull amid pecking order uncertainty  Sky Sports",
    "published date": "Fri, 13 Feb 2026 11:46:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNMUtoNmVPS0M1RG5rdk1fRTFfWE52V3FzcVMxOUtkQ3E3ZHc5cVZadUd2Z01PeUZpMUNtdUJTVll0OE5nT2xraDBUUmlzQjlnY2dzR1htMTlnMXhNWm84T2FoTVEwRkpBT1FNYmJLNXFUcjNhNldUXzZiSFVLY2xEWXJCdXBLX2pqWnlTdTJzVkRsaU9HT2FkbG12cnpCQnlUdEdURGhWX0pqdDlXX2lwMVRWbnlqNWZlQnRwZEhqYW95M05fcVVBTTNoeE5oUWdZY01wSU56dW1mZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "Love in a cold climate: Winter Olympic village runs out of condoms after three days - The Guardian",
    "description": "Love in a cold climate: Winter Olympic village runs out of condoms after three days  The GuardianCondom crisis at Winter Olympics: 10,000 packs at Games Village gone in 3 days  India TodaySex-mad Winter Olympic stars get 10,000 condoms - and promised 'extra supplies'  the-sun.comThere’s so much boning happening at the Winter Olympics that they’ve run out of condoms  SB NationSpanish Skater Reveals Olympic Village Condoms  조선일보",
    "published date": "Fri, 13 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNZFNVZ3BZVjJnQzdEME1VdVo0ZFZCWklkcUg0RV92aXRsTlFocHV1Tkx1dThxeWVDY0pkLUJHQWZqMU1WZTc4Uzd6TTI4ZHNYWTdjSUZaandxdnFjYWdKTkNwcmtLMGVsSEVwa0FXT2dRNi1GbnVycXhsckxsZWxESzdFY2VyMlh2S1pzMk10TG1lcWJIcDFuZUpTbXVJRElOQnhMSFNIckRoU3BMVVFvdkFldmd5bGdHZ2pmOHNiZm91Vkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again - Live Science",
    "description": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again  Live Science",
    "published date": "Fri, 13 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQem9lV1h1VjhkVy1PYzN3czA4WGtHZ0E0eklIWWM1Wm1vQjZkaGJfSl9GYVFwTVA2ZVd6cGtTRENCQVVwSFZYSHltRlhxU010MnEwSU82cFplUUpHbmhZbFl6aWhRSk1iTFVsckd6bEtneVZJaS0xOGlVRnc1Z01JWFFPQk1NZ01weWhZQlZRcVA2cFNEQzZiTE93SG9JLXVzUElXVzAzbFNXeF9RWnk5SHNwRm5XTVQ2SnF1VXB2U3lXX211UjE0bWJuYmplaEs4aUFWYVczNUxiMTNZQXpheUhsV1BpRFZqa3JiWDRvWTV2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Hubble Space Telescope captures the stunning final breaths of a dying star - Space",
    "description": "Hubble Space Telescope captures the stunning final breaths of a dying star  SpaceNASA’s Hubble Captures Light Show Around Rapidly Dying Star  NASA Science (.gov)Last gasps of dying Sun-like star captured by Hubble  Big ThinkHubble captures light show around rapidly dying star  ESA/HubbleThe Hubble Space Telescope is once again giving us a glimpse of something that is thousands of light-years away from Earth.  Facebook",
    "published date": "Wed, 11 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxPeTVrNnlkTDZsZ2JKdFBtOUFLQjR0WnplSUF1MXpqazJpLThMaXFvVVkzbW5NdVdMbjZpX3JJYUZKakJHczVOaHNjc3J1ejg0M0xoRkF4R21EeU5wNmRsWWhzUUp1ZUY2d0VKREoweTRxNmlHZERsb1pJV1g1VHRlUmpPampBVnVlS1Z6UkVHV0RVNVFnZkM5SnYxOXlHdjFPQ1hsbEl6ZVM4Y0hUOTFUQmx1alhLdkZjTkhLbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "ULA’s Vulcan rocket suffers another booster problem on the way to orbit - Ars Technica",
    "description": "ULA’s Vulcan rocket suffers another booster problem on the way to orbit  Ars TechnicaULA to launch geosynchronous orbit surveillance satellite for the U.S. Space Force  Spaceflight NowDeja vu: Vulcan Centaur rocket powers through 'significant performance anomaly' on satellite launch  SpaceULA Successfully Launches Space Force Mission, Despite Booster Anomaly  Air & Space Forces MagazineSparks seen from rocket as ULA Vulcan launches from Florida Thursday  Florida Today",
    "published date": "Thu, 12 Feb 2026 21:33:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQamtfdGR3Y2t3Rk9aOW8tck45ZEhhS1NxbmM0bnZmV2ZBclA0VFM1c21jME9FQk9rT2szYXVzUEl4bVVtZV9HMmxMbl8xWFdEOWJVeVBESi1RY3l4NXlmdkUya3lhbThuaVd3b3c2YUJoVmJsdTl4Rjhjdk9xdWZvaWhmVUZoYlB5aTNFU1VRbFgyNlduOUQ1U2FCNjdQcVJWdFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test - Spaceflight Now",
    "description": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test  Spaceflight NowNASA Conducts Repairs, Analysis Ahead of Next Artemis II Fueling Test  NASA (.gov)Why are the launch windows for NASA's Artemis 2 moon mission so short?  SpacePractice Makes Perfect: The Wet Dress Rehearsal  Hackaday'The moon is our proving ground,' Boeing manager says of NASA's Artemis II  Florida Today",
    "published date": "Thu, 12 Feb 2026 15:34:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOcmFCcldVNDNLYng1RTNlOWFtU0hvTjlENS1vdkxiVDlRbXlJMUZObjBUN1lWUGJZRnk4aTYwUXdLalZYdGxOYnhpVVlwcnRScXJvbGJzRzhzWEFFa2VkSDJtb3RzZDNMZ056cDRqeWRyWi1NUlpkWEZvLUwydFZpb2cyV1hyckxpTzJsMU5RT1BUTTZkakZzcVdCbnR6QUJhZDV0elpHbDA5V3ZhNmtGMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says - EatingWell",
    "description": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says  EatingWell2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf.  The New York TimesA cup (or 2 or 3) of coffee or tea a day helps keep dementia away  NBC NewsWhat to know about a new study on coffee, tea, caffeine and dementia risk  CBS News",
    "published date": "Fri, 13 Feb 2026 00:55:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1CcENJMXh2REwtb2JVY2NNOXlYNXA3UGZ6RFBjb29faXplRFV0ZUdUMzVBQjlUUzZTMzlrbElOeWxjcUxaNzhSU1htSFAwekszTVdaa3VVWEpROGp1bEkzV1hNbEQzMGpWNmh6cC13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eatingwell.com",
      "title": "EatingWell"
    }
  },
  {
    "title": "Colorectal cancer is rising in younger adults. Here's who is most at risk and symptoms to watch for - AP News",
    "description": "Colorectal cancer is rising in younger adults. Here's who is most at risk and symptoms to watch for  AP NewsJames Van Der Beek had colorectal cancer. It's the deadliest cancer for young adults  WBAL-TVThe oncologist taking on rising rates of colorectal cancer in young people  The Washington PostThe deaths of Catherine O’Hara and James Van Der Beek were tied to colorectal cancer. Here’s what it is and what to look out for  Toronto Star",
    "published date": "Thu, 12 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUDFMeE1INnZuYXh2clVPOXVhWXpKRUJ2Y0FJWExHYzVpS2Zaelc3TmNQb1JWU2QzSGdBVjV1U0gzTUMtZ3lnOXlteDNoUkt5R1hSZHRLREVBMXVNbnhXZC1xcU8wUGNYR21YRHJyMmVFLU51YkNjNUVaT3VoaWhXRVdCdFp2cUlUWWFaY3pBYTRjVVBFdnM0dVpGMnR4a2d4czM0QjNzTjZCZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious - WINK News",
    "description": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious  WINK NewsOver 50 nursing students contract measles at Florida university  USA TodayMeasles cases climb to nearly 60 at university in Florida as outbreaks surge across U.S.  YahooMeasles surging in Florida along with vaccine schedule debate  The Palm Beach PostFlorida health department's updated measles numbers shy of Ave Maria report  WUSF",
    "published date": "Wed, 11 Feb 2026 19:48:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPS0ZMdHI4RjFiR0hSUFJMNG5VaFoxRXZTSTMxM1JRR2FiUHdiOGVuRy1pVWEwSzRBbkpUZlFncUFYQ3ZTSGMwWVdibTBLclpXbDNoRzI2YWtld1o5MUNFSkgwdXd6aFlWMGZwaTdPb1ZyYlNIS3FMdmVaSlJjWW1IR2RXQ1hvMlNZVmNhYy1MSXloT3pTdC1Rc2ZETDZxUGtYMTlWc3FTeWNQRWZkZlUzLUhnRE5KZ0xwSWh2NmhRcGJWRXFUWEVIeGFLVF95MUk2UUM0SEY4ZHEzRzYtTkFBTUNNN1FWMENoZm15RThERVcwd29XSkc4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.winknews.com",
      "title": "WINK News"
    }
  },
  {
    "title": "UW-Madison to require students share vaccination status for measles - Milwaukee Journal Sentinel",
    "description": "UW-Madison to require students share vaccination status for measles  Milwaukee Journal SentinelNew rule requires UW-Madison students to disclose vaccination status  Channel 3000UW-Madison introduces new policy requiring students to disclose vaccine status  WKOWNew policy: UW-Madison requires students to share vaccination records amid increase in diseases  WMTV 15 NEWSDane County identifies two new measles exposure locations, continues investigation of confirmed case  The Badger Herald",
    "published date": "Thu, 12 Feb 2026 23:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQWHlidEV0dzdxZ2piYkZRODBFT01OTXM2NkpPUWhncmhQWl94WG10UU55TVJLa1I4YzBJMHhQYnBXam0xUEJEN3ZmZWd0SmtpN2NQelpmRHFsanZJbGNjZnBhY1lYamczc2hrZWtZVzk4WXdYZ0FXT3V1SC1leGpJdnpPTGNFa0tya29ib05vbXVlNzNKNGZOZUZRMy1tVjVfZzhhdkh1VFpCYlRVcnRiY3oySVRzaG01Vmx3SzlGeFVjcHJqcjFWWi0zWXdMU1FfRGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jsonline.com",
      "title": "Milwaukee Journal Sentinel"
    }
  }
]