[
  {
    "title": "Mamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed - The New York Times",
    "description": "Mamdani Threatens 9.5% Property Tax Increase if Wealth Tax Is Not Passed  The New York TimesMamdani asks New York State to raise taxes on ‘ultra-wealthy’ to address city budget deficit  The HillMamdani threatens 'last resort' property tax hike on middle class if state won't play ball on wealth tax  Business InsiderMamdani to Hochul: Tax the rich, or I'll raise New Yorkers' property taxes  Spectrum News NY1Mamdani threatens 9.5% property tax increase to fill NYC budget gap if Albany won't tax rich  NBC New York",
    "published date": "Wed, 18 Feb 2026 03:04:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPSGhpMnljVzB5Y3VPc1BrcnVoMHNtbjRyWExaWml0UFY5ekJxVVpUNnVMbXZRQmR6THhPMnRlRGxGc2VpaUpUZkIxXzdYRHV3Q21aT3MwaFB1eW4tZExCRHBPb3FuS3QwM2JEWjZGSXlNWDRCTk9YR2xlN1J4cjRXRmxjMlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump Bets on Diplomacy Without Diplomats - The New York Times",
    "description": "Trump Bets on Diplomacy Without Diplomats  The New York TimesUS diplomatic overload is at crisis levels  The HillTrump’s Trusted Envoys, Kushner and Witkoff, Handle a Trio of Crises  BloombergTrump administration tries to resolve three crises with Iran, Ukraine and Gaza : Trump's Terms  NPRAnalysis-US envoys juggle two crisis talks, raising questions about prospects for success  AL-Monitor",
    "published date": "Wed, 18 Feb 2026 03:12:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOMDBISkYwb3U5UXMzSHhIM18xVkF3bE9uVVZpZnVYaFlLdW9kbjZEN1gzZ3NUeFpVMUVYbDlOUkFGT3JydUJyN0VRWFZNZUlMWktCeHFaSnJNVFV1OGtFVFA3aE5WOWczdTgyYmhvUGNHckpQMEJPLVNaN3dWRU1YM0xzdGxjeGpLYnJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge declares mistrial in Texas ‘antifa’ protest case over attorney’s T-shirt - The Guardian",
    "description": "Judge declares mistrial in Texas ‘antifa’ protest case over attorney’s T-shirt  The GuardianMistrial declared in Texas ICE detention center ambush trial over defense lawyer's T-shirt  Fox NewsJudge declares mistrial in Prairieland ICE shooting trial over lawyer's 'politically charged' shirt  KERA NewsTrump wants to prosecute anti-fascists as terrorists. This Texas trial will test his power.  MS NOWMistrial declared in federal trial for 9 involved in alleged attack on officers at North Texas ICE facility  CBS News",
    "published date": "Wed, 18 Feb 2026 01:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZWVaMlY3NVNYY2pnNjlBNEVaVlJuZkY2anZLeVpPRC10eUU4VEpMdUVzc2djbmxWbFI3bzRmTmpMYUpzTDNhcElKSEJfbmpLdnhjS3hjcVBiZ1FkdU1rS2lzRFJEeHU1dDhBZzBTb29rTld5dHBlSXNTRjd1T2hWTFA1eXJCUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Air Force One will sport Trump’s preferred paint job, after Air Force again reverses course - CNN",
    "description": "Air Force One will sport Trump’s preferred paint job, after Air Force again reverses course  CNNU.S. Air Force VIP fleet being repainted in Trump's preferred palette, sources say  CBS NewsTrump swaps Air Force One’s Kennedy-era blue for dark navy, red and gold livery  KOMOAir Force One jets to be repainted in Trump’s preferred colors  The HillNew paint scheme for Trump's Air Force One includes gold, red, white and blue  Reuters",
    "published date": "Tue, 17 Feb 2026 23:02:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE82MXFoZGNnQ3o4SU53Yl9OTUZVQjlodUVvNUdaS1hEODczWENZN0phYjhwZmNUck91Vm1LaTFGSjBfcE5KcExkTk4tNFpMeFluQkRza0lHRVlFNDJoaFRxVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Hegseth forces ouster of senior Army spokesman in latest internal clash - The Washington Post",
    "description": "Hegseth forces ouster of senior Army spokesman in latest internal clash  The Washington PostHegseth’s Firing Campaign Reaches Down Into the Ranks  The AtlanticHegseth Is Said to Have Ordered Pentagon Spokesman’s Firing  The New York TimesSCOOP: Hegseth orders removal of Army public affairs chief amid broader Pentagon purge  Fox NewsHegseth has reportedly forced out a top Army adviser  MS NOW",
    "published date": "Wed, 18 Feb 2026 00:37:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPS2pleENDNlJqSWFsV3FPY082cDdDWUQ4WHE1U1IyUUdxWGhvLXkxR0k4WVllVzg1THR0ZTZMay00LVgwQzVwdmNNUnN3aE5Cc2dKamtpWXhRVUpNSmhVcUJIS2szenhLVEFlUklUZDhzaE84czBIVF94QXdEbjBLYkEwdFRubWJfNXZwSWRPMlNfNWVMSTJmWHpZdTJzY3Yt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Potomac Sewage Spill Becomes Ecological Disaster and Political Fight - The New York Times",
    "description": "Potomac Sewage Spill Becomes Ecological Disaster and Political Fight  The New York TimesDC Environment director contradicts Potomac River guidance  NBC4 WashingtonTrump directs federal government to intervene in Potomac sewage spill  The Washington PostPipeline that caused massive sewer spill into the Potomac River had been identified for repairs, DC Water officials say  WUSA9Trump to DC, Maryland, Virginia: ‘I am awaiting your call’ on spill  The Hill",
    "published date": "Wed, 18 Feb 2026 02:59:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBJYU5sUVloVXV1VHdycUNQUWxydTZ5VVNDa2FtTXFTTXBrMmlwOG5HR0otYkxQbzFnTzhRSmVFZl9XRzJhTV9tay0zSnUyQmh1WGVDdTJsQWE5UGZfSmxmRXh4cVd3RkcyZG8zeko4MHVqdkpVTW5uVTNkTkJtdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Here’s how much snow the Sierra got this weekend — and how much is on the way - San Francisco Chronicle",
    "description": "Here’s how much snow the Sierra got this weekend — and how much is on the way  San Francisco ChronicleNorCal forecast: Snow, rain ease Wednesday but not for long  KCRASierra storm drops 28 inches in a day, shuts down I-80  SFGATEWinter Storms Could Bring 8 Feet of Snow to Parts of California  The New York TimesFresh tracks incoming: Snow totals at Tahoe Resorts  Tahoe Daily Tribune",
    "published date": "Tue, 17 Feb 2026 21:47:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQWGp0bWs0RmoyNlpfRXJ3SlBGWGh5dEhLZ1lGVmZZZ0FwTkM1bkpoS0E2Q3dXT0dldGZocm1GVFRiWE81UGNBRHRGeDRseXNUUldfRk1CMlVUdC11LV9mS0IyOGxIT1llajNTcGJ0NkJoOTFGWGR1d0FEek9kcklRNXEybkYwdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "DHS spokeswoman who became a face of Trump deportation campaign steps down - The Washington Post",
    "description": "DHS spokeswoman who became a face of Trump deportation campaign steps down  The Washington PostDHS spokesperson to leave Trump administration amid agency turmoil  PoliticoThe many claims by Trump’s DHS that have fallen apart  CNNTop DHS spokesperson who became a face of Trump immigration policy is leaving  NPRTop DHS spokesperson to exit role amid growing outrage over Trump’s ICE raids  The Guardian",
    "published date": "Wed, 18 Feb 2026 03:57:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQQ1EyOUpnRktCLVR2cUxUa2x6ZjZqaGl4T3d2dlVpeEM2WTVpODBhYjRPalBiTHJGSEtqLXIyeWhFWWI5RmFsZkxYWVhDQ1ZyRUNSN3pWSDJZdE13Q0c2MURlVmQ1am5qZmJaRjhXcDlkMl9QWV9NU3hkQkN2WHRIZkFKMGFzSXRTMnBF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Why California could be the big winner as EPA abandons climate policy - Politico",
    "description": "Why California could be the big winner as EPA abandons climate policy  PoliticoDonald Trump declares the Republican Party the pro-pollution party  California State Portal | CA.govWhat Trump’s Emissions Rollback Means for Drivers  AutoweekOne of Big Oil’s Biggest Defenses Is Getting Blown Up  Bloomberg​Historic Climate Rollback Makes U.S. a Global Outlier on Tailpipe Rules  The New York Times",
    "published date": "Wed, 18 Feb 2026 00:49:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQM2paRUl3T3lBR2RPcU5QWmhCSk5mUkplQ1hqQkJCUXlhX1JidWJnam1qSGIwR2JWekgweENKeHk5cXRVQ3pkNGt4ZHdqYnpBQ2dfT2VNdE9vaVFEdUhybUl6VEw0SG9IWkV3WXd1cHJYUWtoUjc1NG0wWUxRNlUtLU8zUmlTRlpuMDhvaXE1UlVoQkMxXzRVaHM4MU1jTnlFcVBFRlVHVjZ4ZDlOZGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end - San Francisco Chronicle",
    "description": "S.F. Bay Area pounded by storms, hail, snow. Here’s when the worst will end  San Francisco ChronicleLive storm updates: Thousands without power after thunderstorms move through Bay Area  ABC7 San FranciscoBay Area storm timeline: Coldest system of the season sweeps through  KTVUTriple-punch series of storms forecast this week  KRON4Here’s When Rain and Snow Will Hit the Bay Area and Tahoe This Week  KQED",
    "published date": "Tue, 17 Feb 2026 20:37:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNU0lnWDVIUWp5Z3FXMGZtWHc2dzFTbWVzVDJMX1daS29ZaVpxWV9yR0JZZG5jaVNBSFFXaFNSQ1hGUnU4dG1wLTByRmc5SmE0S3hhV2ExREZKd0hxMW00TGNSS1BVNGl4SnY3ckp2cVFZbEFmRDlBLVNmOURyN3FOVW1tWmJfa3pLLU5LVzl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Lunar new year 2026: year of the fire horse around the world – in pictures - The Guardian",
    "description": "Lunar new year 2026: year of the fire horse around the world – in pictures  The GuardianSee Lunar New Year celebrations around the world full of color, tradition  USA TodayLunar New Year prayers, robots and festivities usher in the Year of the Horse  YahooLunar New Year 2026 live: Year of the Fire Horse  BBCGlobal dignitaries send Spring Festival greetings to China  news.cgtn.com",
    "published date": "Wed, 18 Feb 2026 01:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPNWNYNEVlbUJ5akplcXQyWHlUU2VYUkNLQWxIOTRNYWt3eFp5MmtUaGpmblR4RFZRbE5EaWxpRjE0YW1ObTBJcDltY2VSN01RSnBuVkJac0dHYXNRQ3hkT2lwVXZIc1Vaa0p5RUx5MVJhcHNDbWZreG9JU2JUV01heGJXMVdhOFRCMGtmLWdkVkVHVHZtT0VR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. offers more details on claim China conducted secret nuclear weapons test - The Washington Post",
    "description": "U.S. offers more details on claim China conducted secret nuclear weapons test  The Washington PostU.S. Hardens Allegation That China Conducted a Secret Nuclear Test  The Wall Street JournalU.S. releases new details on alleged secret Chinese nuclear test  NPRUS offers more details on claim China conducted secret nuclear weapons test  South China Morning PostUS nuclear testing debate reignites after State Dept alleges China nuclear test  Fox News",
    "published date": "Wed, 18 Feb 2026 03:45:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOWlQtajVWNkJTOHRpUE9TVkxnck1KN05nVWQ1RFFQZXc4QXp4eGNmZ1hnQ2VhWDd4VWhOd3A0YzExdlNrOU9zOEhwRHlOY054NE5qQUc0QTZTcWFPNEk4eVNMOXhTQzEwbDRXSlVGQ3NraWd0bUFFQm1lLUxSR1E2VUJRTW1ZNVlrbmJjMzBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors - AP News",
    "description": "Gisèle Pelicot’s memoir launches in 22 languages, turning horror into hope for survivors  AP NewsReview | Gisèle Pelicot bravely went public as a rape victim. But her life collapsed.  The Washington PostThe Trial of Gisèle Pelicot’s Rapists United France and Fractured Her Family  The New YorkerKey Moments in Gisèle Pelicot’s Interview With The Times  The New York TimesA Hymn to Life by Gisèle Pelicot review – a unique memoir by a figure of astonishing power  The Guardian",
    "published date": "Wed, 18 Feb 2026 00:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQRUxaNzVQd0ZTNjI4NXB3TnpNdzZHNHRqVmx0aC12b0V1Mzh0bTdPMmdzQmQxWkRTeWdPUXFWNkl1RjdHLW5Qdkg5Uk1KMHZxWjJjR1FZRnlDRVl5VkJUaFRuNEJhUVhqMlpGeXc1M1BmdkwtQnF5ZkE5dDBFTUdxTWFtbzA3NHRXT2MzYTZTbEppU0dYOXQ0cWk2SUZzSHUxUzBF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Nine arrested in France over death of far-right student - BBC",
    "description": "Nine arrested in France over death of far-right student  BBCFrance arrests nine over killing of far-right activist Quentin Deranque  Al JazeeraFrench police arrest hard-left members over killing of far-right activist  ReutersFrench police launch murder inquiry after far-right activist’s death in Lyon  The GuardianFrench government blames hard left for 'climate of violence' after killing of far-right activist  France 24",
    "published date": "Tue, 17 Feb 2026 21:08:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBhQjZyZTJ6bEwtOFZXcERFRWk0YV9jeS1WTjBibl9OeDNQTVhyaElxSm80RWdTYnZfcnFEMFl1MDVXelc1cGMtcE5EUUxEdS0wczBTTTFiMHRaZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Bayer agrees to $7.25 billion proposed settlement over thousands of Roundup cancer lawsuits - AP News",
    "description": "Bayer agrees to $7.25 billion proposed settlement over thousands of Roundup cancer lawsuits  AP NewsBayer Agrees to Pay $7.25 Billion to Settle Roundup Lawsuits  The New York TimesBayer proposes $7.2 billion settlement to resolve Roundup weedkiller cases  CBS NewsBayer agrees to pay $7.25bn to settle Roundup weedkiller cancer lawsuits  The GuardianBayer CEO says Roundup settlement is important addition to Supreme Court case  Yahoo Finance",
    "published date": "Tue, 17 Feb 2026 23:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNT1FZaVVZZ0RDVTduMTNncjRJR2xsS0x2Ti1qdmVlUjZUanZqUkwtTTNWWWFvWkh4UFhNcWQtNFNLUUNKb1B5WFJGdUJkZkExUFp4RmRXejJNSnh2Wm5lTTYxZjVENS1YanlQdHhQR3BTTGlIUXhwUHNpNUdfeVE1Z1BRREg3ZEN1Zm9wd2NYLTZnY1Q3YUcyRGxyZ0k4V1lNSU82Zg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Warren Buffett Dumped Shares of Amazon, Apple, and Bank of America, and Added One Brand-New Stock in His Final Quarter Before Retirement - The Motley Fool",
    "description": "Warren Buffett Dumped Shares of Amazon, Apple, and Bank of America, and Added One Brand-New Stock in His Final Quarter Before Retirement  The Motley FoolBerkshire Hathaway trims Apple stake, buys NYTimes stock in Buffett's last moves as CEO  CNBCWarren Buffett's company invests in the New York Times six years after he sold all his newspapers  Yahoo Finance4 Warren Buffett Stocks to Buy From Berkshire’s New 13F  MorningstarBuffett Cuts Amazon Stake, Makes Bet on New York Times  Bloomberg",
    "published date": "Wed, 18 Feb 2026 00:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNZU8yRjdTQmU0Umlpcm8ydDFVNGZrYnNlUFY4cFY3Rk1WNEUtNEtYYWJCQmFBMXk1eVFDb3ZTczZyRDZxRG5PWnNwVU1taTNpMDl6RlJPbXl2WjBYUmluSi0wLTNUX0NrbU1Bb2RwV0FNOEpjQWI5ZDhLSlQ5VFkzODJqOXJxaUdpS2hWbTVCd25BeE12ZXdyXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fool.com",
      "title": "The Motley Fool"
    }
  },
  {
    "title": "Nasdaq Ends Higher to Snap a 4-Session Losing Streak - Barron's",
    "description": "Nasdaq Ends Higher to Snap a 4-Session Losing Streak  Barron'sMarkets News, Feb. 17, 2026: Stocks Eke Out Gains in Volatile Session To Start Week of Inflation, GDP Data  InvestopediaStock Market Averages Rally Off Lows As This Sector Outperforms  Investor's Business DailyStocks Recover on Strength in Apple and Airline Stocks  Yahoo FinanceStock Market News, Feb. 17, 2026: Dow ends flat, S&P 500 and Nasdaq edge up to kick off holiday-shortened week; gold falls below $5,000 mark and silver declines  MarketWatch",
    "published date": "Tue, 17 Feb 2026 22:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1hOGtqem80cGRzVzJBVnFZZWlOYldvbGU2dmo1TndxWjl3SS1ESmZ5ZUZXTC1OMWRHeWhXVS1vTDRQOWlOeDdXLTFRRTRjNUgxb1U5cmV3bDFpNVBtd1RJTnBUVDY3WjYzdlFZUUZ5OWs2MjQwU3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.barrons.com",
      "title": "Barron's"
    }
  },
  {
    "title": "No bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu - NBC News",
    "description": "No bones about it: Judge allows Buffalo Wild Wings to keep 'boneless' chicken on menu  NBC NewsBoneless Wings Are Still Wings, Judge Rules  The New York TimesJudge tosses boneless wing lawsuit, says it has 'no meat on its bones'  USA TodayJudge rules Buffalo Wild Wings can keep calling boneless wings ‘boneless’  WGN-TVA ‘Boneless Wing’ Needn’t Come From Wing Meat, Judge Rules  The Wall Street Journal",
    "published date": "Wed, 18 Feb 2026 00:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOaXM0MkpXLTNTZXVGMGhRLVI0QTdlNEJKVkN1aEwwYlVNcnV2NjNreEJaOTd1QVhxZFVEd2gyUms3WVhla3p4VXlXTGtEUmI5cnhsd0xlU1lGUVAzbmRBOXY3RWE1cVFJbGdPb2FnYmNicElSTnlnU3lHTjNwcUlaUmctRHowZ2taVFJxR2FvVlZtYTh1MEVSVHJtZktHbkVBaDFLTUV1c3hiV2RKNkdrN3I0bVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "GameHub will give Mac owners another imperfect way to play Windows games - Ars Technica",
    "description": "GameHub will give Mac owners another imperfect way to play Windows games  Ars TechnicaGameSir is making a GameHub app for Mac.  The VergeMac gamers are about to get a great new way to play PC games  Cult of MacThis New App Can Turn Your MacBook Into a Gaming Laptop  ProPakistaniMac Gaming Just Declared War on Windows; Steam Libraries May Never Be the Same  NoobFeed",
    "published date": "Tue, 17 Feb 2026 22:45:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPQTltVUlxMmU2SVhkeGdaVVlWdVVRcTRBUUV3Zl9FLVU0V2NKY0p4ZkdhZGVUS3NsRHVCV3Z3MDg3UVNNSXFiUG9veEpOei03amtsQlYzeHVSTzVjRGk4eHZVaTRWUWtieXZxaFcyWkpNU055QjBFekVnYUd3YmEwLTYwNkRHc2NQdXd1N0VBZFU0OVRTc1VTV0JFRlVrenZ3Z3BxNUNBbmI5amM4N2gtYWFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Now Pixel 9 phones can transfer files with AirDrop, too - The Verge",
    "description": "Now Pixel 9 phones can transfer files with AirDrop, too  The VergeGoogle expands Quick Share’s AirDrop support to Pixel 9  9to5GoogleHow to AirDrop on Android With a Pixel 10 or Pixel 9  Droid LifeYour Pixel 9 can now beam files directly to iOS  Android PoliceAirDrop Compatibility Finally Rolls out for the Google Pixel 9 Series  Phandroid",
    "published date": "Tue, 17 Feb 2026 19:48:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1tZy1iZkhOZFVZU0o0YWp3aGlEUm95QlBBLTBiVWV1NVhRYVdadi1UZEt6ZVVaWnlJNU4tNzdKRjd2QUhVMERuX0xYcV84eFM4MzJaREZ5NUxTUlR2cHo1NjRiVml4QzRPYmk3V3N4cmRuc0IwMDNwbHo3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "'Can You Use Labo VR Goggles For Virtual Boy Games On Switch?' & Other Nintendo Classics VB Questions Answered - Nintendo Life",
    "description": "'Can You Use Labo VR Goggles For Virtual Boy Games On Switch?' & Other Nintendo Classics VB Questions Answered  Nintendo LifeVirtual Boy - Nintendo Classics has landed on Nintendo Switch Online + Expansion Pack - News - Nintendo Official Site  NintendoNintendo's Virtual Boy app is now available to download  EngadgetConfirmed: Switch’s Virtual Boy headset can play VR-supported Switch games including Breath of the Wild and Mario Odyssey  Video Games ChronicleNintendo's Virtual Boy For Switch & Switch 2 Review  UploadVR",
    "published date": "Tue, 17 Feb 2026 22:00:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOZ0tlVGZ5dFlZckI0c3d4S19udnVid1lrQkFTTk5EQVBmY0toaHV4Wk4zdEcyTEZEb2EyeXpqdTVwa0NaNFlvUmlHaUpGaDlfakpSYWhvY3RTbW1zT0Y0WTVTM0ZsZHNhdjVXNWpjcExNcV9zVnk3dEFMeDBKTzZJTUFmbDR3NXZtdkV6NXJGcVBWU1hsSFhBSWZOQkhkYUdYLWNjc013SHJXMW5qUUxpNGcwWVc3MDdTTkVyNm9kZFBMMU96ajNWbzBvbFZSS0FieVZkZnZyMHAzOGl2S2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nintendolife.com",
      "title": "Nintendo Life"
    }
  },
  {
    "title": "Google announces dates for I/O 2026 - The Verge",
    "description": "Google announces dates for I/O 2026  The VergeView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 20:56:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBCV3FLdmdWR05YaEJVcHptXzUxUzBpOWt4Z3A1N3lHb0g1ckJDdEhyOVFHN2dJN0FFUV9Ta0lYV3pnTXBjb2hpczJieEtoRmR5UUtwSmx3NVVSSkx1YU81ZzNodEhEUERwYzUxOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "'Wuthering Heights' Box Office Beats Expectations With $83 Million Globally - Variety",
    "description": "'Wuthering Heights' Box Office Beats Expectations With $83 Million Globally  VarietyOpinion | The Greatest Love Story of All Time Is Also the Strangest  The New York TimesEmerald Fennell’s Pursuit of Provocation  The RingerI invited 18 friends to watch 'Wuthering Heights.' Things got feral.  USA TodayWuthering Heights review – too hot, too greedy adaptation guarantees bad dreams in the night  The Guardian",
    "published date": "Mon, 16 Feb 2026 16:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPRWlib2t0WElrZkZld0dCcFV4bXhTNm0zdjUwMlNPZHFKZGQ2cTlFcmR3eTdMM1BDSjJNck1Wb25XNzE2MEFSdVJ3dVhTQlNlVnlDX3NWTnBlbC1ISnFqaUFxdXFvN1pDSjNPNTU5ZmRKanRDY1EtSDhLdkYwMHoxV2dBSTNJOFNEV3dMcURUVVlkUnhMbTNrMGk4YnhkN0hwQ0VHTGctSk42OVNiVC1WZkVtYTRXQ3JPTmIwUHJpUUpTb01rSXVDdVV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "The Women of 'KPop Demon Hunters' on Overcoming Rejection, 'Golden's' Success - Variety",
    "description": "The Women of 'KPop Demon Hunters' on Overcoming Rejection, 'Golden's' Success  Variety‘Awards Chatter’ Pod: EJAE on Her ‘KPop Demon Hunters’ Hit “Golden,” New Single “Time After Time” and Feeling “Very Nervous” About the Oscars  The Hollywood Reporter'Golden' Writer Mark Sonnenblick on the Moment He Knew It Was Special (Exclusive)  People.com‘Golden’ songwriter Ejae on how the ‘KPop’ anthem has been everywhere from the Oscars to the Olympics to Emily Blunt’s party  Gold DerbyKPop Demon Hunters Stars Recall Dull First Introductions to the Characters  Den of Geek",
    "published date": "Tue, 17 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOMy1fZFlPemxwd0JGQ19wU2JpbGxIWHJfeUo0bjV1MU1ULTJDVkNrLTdKZ1p3bm5XRktLWVNMQzVIQzJxd0xlOHM1SXQ3dDcydm5oSGR6NERDQnNxV2dMd3Y0YzhnaVFBZTdFS0E1YjJlalk4N0xyeFF2QzJrYXJmdXlhZ01iblZXclA4a1NOWGhMS2NhN1RQM1ZpZERudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Ray J performs with bleeding eyes weeks after revealing he has months to live: 'Life on the line' - Entertainment Weekly",
    "description": "Ray J performs with bleeding eyes weeks after revealing he has months to live: 'Life on the line'  Entertainment WeeklyRay J concert video appears to show him with bloody eyes and a device in his chest  Los Angeles TimesRay J's Manager Says Her Clients Have 'Gotta Do Their Job' After Singer's Bloody Performance Sparks Concern  People.comR&B star’s eyes appeared to bleed at show weeks after he claimed he is dying  PennLiveRay J’s Valentine’s Day Performance Shocks Viewers  bet.com",
    "published date": "Mon, 16 Feb 2026 22:03:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQMXZkaVhfdHdYOG1uR2VyU1FQUk1Zei14MVNyU0hKYlU5Y2o4OXl1bnZYMDROLVRLcFFUdXlyT3BFY3lpWm9XV2ZJNzQ1cDQ0VGM5TzhkYWdMV3VxcVZpRm9JeW5IMmUxeVZpaFpQRG12UVB2bEg3N0VpY3hlZzZwNm9MMWxtZmJxSUhkMS0zNFFadG8yWVF4LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Pedro Pascal & Rafael Olarra Watch 'Wuthering Heights' Together in Theater - TMZ",
    "description": "Pedro Pascal & Rafael Olarra Watch 'Wuthering Heights' Together in Theater  TMZPedro Pascal and Rafael Olarra seen with arms linked in New York  New York Daily News‘Last of Us’ star, former footballer draw speculation after arm-in-arm appearance  SILive.comPedro Pascal and Rafael Olarra Spotted Linking Arms in New York  YahooWhy Are Pedro Pascal And Footballer Rafael Olarra Rumoured To Be Dating?  zoomtventertainment.com",
    "published date": "Tue, 17 Feb 2026 15:23:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9KLUV0Ui03YWpJTENmOHZwaVVsYWFaS2tSNk8yU2h4WG1ySVRvcUNRd05TMVhWMUtDeUFtOUlSeXZPTDJ5aFh5TTFQRVFlWXJsMXc0UFN4d0daRGoyUWo4LTRzeWJCaV82OXR0cFZtdmNGcHlxTnNxaHZmTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tmz.com",
      "title": "TMZ"
    }
  },
  {
    "title": "Mourinho's 'big mistake' after 'disgusting' Vinicius incident - BBC",
    "description": "Mourinho's 'big mistake' after 'disgusting' Vinicius incident  BBCVinícius Júnior accuses 'coward' Prestianni of racist abuse  ESPN“We ride together and die together,” says Arbeloa after Vini Jr suffers alleged racist abuse  Yahoo SportsReal Madrid’s Vinicius Jr alleges racist abuse by Benfica’s Gianluca Prestianni — What happened - The Athletic  The New York TimesMadrid game at Benfica halted for several minutes as Vinícius says opponent racially insulted him  AP News",
    "published date": "Wed, 18 Feb 2026 00:56:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9Sd3lPdnFvSHdDcmdtRjNIQjNkWEZ0SlhFYUN5ZFpWTmY0eXQxc1hoakE5S0R5cE5nMHRwZ056MFpVbkRjaWtMOXY3bFFhSEN0NWVKRmY0Nm9pNURmc3dNdk5BTHBSQWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "2026 NFL franchise tag primer: Candidates to watch while window is open - NFL.com",
    "description": "2026 NFL franchise tag primer: Candidates to watch while window is open  NFL.comThe Falcons' history with the NFL Franchise Tag  Atlanta FalconsNFL franchise tag advice for all 32 teams: Which free agents are worth keeping?  USA TodayFranchise tag window is open; The Giants shouldn’t care  Big Blue View2026 NFL franchise tag candidates: Kyle Pitts, George Pickens  ESPN",
    "published date": "Tue, 17 Feb 2026 16:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOMVc4WHhwRm1YRmVsTFA4X2thSWVzUjlCTUUydDBHOHcxVEFXUnRYUzN3Mnk2U2ZUVTU1dy1CNGVkMmdvSlJubmVtczVWOTFTVVhDUGU1azhuajJ6b3RCbWlFN0U5UGZjT1pHNzV3cDI4QmM3NDZjTzhVa1BVNXM2U2FiaExJRmgxc0FwWkRkR29ZZldla2NBbUg1MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "The United States and Canada will meet for gold for the 7th time in Olympic women’s hockey - AP News",
    "description": "The United States and Canada will meet for gold for the 7th time in Olympic women’s hockey  AP NewsU.S. women's hockey blanks Sweden, to face Canada for gold  ESPNPierre McGuire previews USA vs. Canada gold medal game  NBC OlympicsThe nastiest rivalry in hockey? Canada vs. USA women’s hockey has drama, line brawls, hatred  The New York TimesWhen's the USA-Canada Olympic women's hockey final? How to watch gold medal game  NBC Bay Area",
    "published date": "Tue, 17 Feb 2026 01:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPWkRWY3FFaXBKbWxES2tzX0dad3ZVTGM4VVBKeHRiYWp1THcwOGJIMEZfT3JaWXp3ZWVuSmlTLVBad0trczR4TVRIdm4yWHhNMDFNYVMzRElpNnBoeXFuY2VOeUpZcGxTdExSc0g5MDcyUHVnS084bUstYWhaQ3RCcVNnZHFWSVoweGJBVElUMzdZMXh3ekIwSg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Daniel Jeremiah 2026 NFL mock draft 2.0: Giants one of six teams to pick WR; Chiefs go RB - NFL.com",
    "description": "Daniel Jeremiah 2026 NFL mock draft 2.0: Giants one of six teams to pick WR; Chiefs go RB  NFL.comJets Mock Draft Roundup 5.0 | ESPN's Field Yates Unveils First Projections of the 2026 Offseason  New York JetsScouting strengths and weaknesses of 2026 NFL Draft’s top 3 QBs  The New York TimesWho are the top offensive prospects entering the 2026 NFL combine? Top 5 by position  CBS SportsNFL Mock Draft: Jets Continue First-Round Tradition with AVT Replacement  Yahoo Sports",
    "published date": "Tue, 17 Feb 2026 13:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9ZYUkyNFdHRlo1T3A2cW9oTlREb0tsdlNaM2trSmRvZGJ5OVRkcXplTzZMck1PSGRfMkdKQldwaG0tM2JMampYX3JtTWlJcERSMVh3eG1FRnBLNmVHR2RNSW03WWxmRlQzSk9QUS1LMDQ1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Record-breaking Antarctic drill reveals 23 million years of climate history - Phys.org",
    "description": "Record-breaking Antarctic drill reveals 23 million years of climate history  Phys.orgPink rocks found in Antarctica lead to the discovery of an enormous structure under the ice  Earth.comSediments Offer an Extended History of Fast Ice  eos.orgRecord-Breaking Sediment Core Provides Unprecedented Evidence Of West Antarctic Ice Sheet Retreat  Scoop - New Zealand Newsmap of West Antarctica (IMAGE)  EurekAlert!",
    "published date": "Tue, 17 Feb 2026 14:15:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5IU3hYaTFEaUZ6ZjZPOUhJbGxFUm5xaFB3RUh4TUE1QmZidVdaZmFBbWtOamg2VTN6YllNejVuNklWUlJoMXZtb0RUT2RIRWhLdnVhTGNLTXVJWml2NTBKVlhYdnRsZnF5Sk5Vclp0RGFoSzNVQUlLT3FiX2E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Antarctica’s ‘Gravity Hole’ Has Been Quietly Growing Stronger - Gizmodo",
    "description": "Antarctica’s ‘Gravity Hole’ Has Been Quietly Growing Stronger  GizmodoAntarctica has a ‘gravity hole’  Popular ScienceGeoscientists Pinpoint Ancient Forces behind Antarctica’s Gravity Hole  Sci.NewsAntarctica sits above Earth's strongest 'gravity hole.' Now we know how it got that way  Phys.orgUnder Antarctic ice, Earth’s deepest gravity “low” points to a 70-million-year story  MercoPress",
    "published date": "Wed, 18 Feb 2026 00:00:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWUVLYVlOTHNtU3Vyby1IeHl5aTE3TjJTUFNGQXM0Tm1LOGpHb3d5X2MwdlJ3SHBuREp3NS15NU5nb0JXNk1BS3pYR0R4VXVFLVJNSjFOd01aTzNxb3psSnZGYm5ienNiUFJEMko2NlA4TS1oVTlhaUZLWVg1ZkhQNmZNVEhTbzBOTUdGMk1SR0thVlk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "Scientists discover recent tectonic activity on the moon - Phys.org",
    "description": "Scientists discover recent tectonic activity on the moon  Phys.orgView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 15:40:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1haW1Qc2EyUG9JRUdTQmlOSWRWV1l0bDlXUmxuQWppVUpfYkoyNFR2Rmgzdl9RNDFmTE5mSUd2WUUweUJTWGZqZGk3T1lSSnNTZFpoX0lteTQxLVRFb05DcmliRGl4RU90RWNj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "New species of ancient crocodile named in honor of Welsh school teacher - Phys.org",
    "description": "New species of ancient crocodile named in honor of Welsh school teacher  Phys.orgScientist names ancient crocodile Jones after 'inspirational' teacher  BBCThis 215-Million-Year-Old Crocodile Was Built to Run, Not Swim  Discover MagazineFast ancient crocodile that ran across the UK eating prey 215m years ago found  the-sun.comScientist’s subtle tribute in name of newly discovered croc species  The Independent",
    "published date": "Mon, 16 Feb 2026 15:20:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9QNVFZZFhkbFlBZmdEN054amNmcDhnUm9MWXktRlFYZWlyRFFuajZTVmwtTmtQbVZab0pxbXBOZ3VQN0tGQlNWNkI2STkzNGE5LXZDQ2FKQkR3Tm1Hd0hPXzRyZWtpRnVpRjdCS185WXU4YkZCenc2dEU1WVI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Air pollution directly linked to Alzheimer’s risk, scientists say - Financial Times",
    "description": "Air pollution directly linked to Alzheimer’s risk, scientists say  Financial TimesThe Link Between Air Pollution And Alzheimer's Is Now Clearer Than Ever  ScienceAlertUrgent warning as air pollution is found to DIRECTLY cause killer dementia  The SunAir Pollution’s Primary Role in Alzheimer’s Risk Identified  Neuroscience NewsNew research warns air pollution may directly contribute to dementia  hpenews.com",
    "published date": "Tue, 17 Feb 2026 19:05:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9YaDVocncyVmlBZjRnazJVRlRGM09fSTVsemZqcm1yOUhIQ1FWLVRWdDdKUkNHQ252WU1wRU9uYmhkQzhfQTFkM0wtVkV3QzduYzdScENOUHktU3NVRDNXamhfVldYMUpQTkd5bk9rbk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Health officials warn of possible measles exposure at St. Louis Lambert Airport, Collinsville church - STLPR",
    "description": "Health officials warn of possible measles exposure at St. Louis Lambert Airport, Collinsville church  STLPRPossible measles exposure at Lambert Airport, says Missouri Health Department  FOX 2Possible measles exposure at St. Louis Lambert prompts health alert from officials  KSDKMo. & Ill. health officials warn of possible measles exposures in St. Louis area  KFVS12Measles case connected to Lambert Airport & Metro East church  KMOV",
    "published date": "Tue, 17 Feb 2026 22:36:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQOUhJM193czE4WnZvNmozYk1JYUFEeDFSM1gyZDJmc295YU1YSXdlQWZlTm9zZGR4cTM0OFpTVnpOWEtQazRZWlh1UHIzcnFqblVMWUE2dUZCdi1IenhuMk1Nb2k3WWFIb0RiQmRsdjAwRU8tVy0wUWcteFBMMHZDQWJFZ2s0X2szWTYycUlmOUVYeGFhWl9YS2xodGJtWkdTdmFJSnNOd3B6eURiei1YZWM0bmlpQkJRR0lTTTVZdmJFT2hHMmZKMmFnSGJFdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.stlpr.org",
      "title": "STLPR"
    }
  },
  {
    "title": "Single Dose of DMT Rapidly Reduces Symptoms of Major Depression - ScienceAlert",
    "description": "Single Dose of DMT Rapidly Reduces Symptoms of Major Depression  ScienceAlertA short-acting psychedelic intervention for major depressive disorder: a phase IIa randomized placebo-controlled trial  NatureSingle dose of potent psychedelic drug could help treat depression, trial shows  The GuardianNature Medicine Publishes Helus Pharma’s Randomized, Placebo-Controlled Phase 2a Trial of SPL026 in Major Depressive Disorder  Yahoo FinancePsychedelic found in Amazonian brew ayahuasca shows anti-depression promise  Financial Times",
    "published date": "Mon, 16 Feb 2026 16:04:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVk1LUEVWM2JocWpRQVh2YmRWYlhHS0JYbkNHeERWYlBfc1BuSklBVnhHTXRQc3AxWU5ZTFF6MkhjVmdaQVVtam16WnhabWJqcDV5SGo2aVlyY1ZuVnhaSVl5aWhqekVjMmlwT0ZEU2RKYVBSQU9Yb3p1MnFwTDBHdWJwdS1GRzV1cFN1QTV0Y0JVZm16Q2Q0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencealert.com",
      "title": "ScienceAlert"
    }
  },
  {
    "title": "State confirms outbreak of sexually transmitted fungal infection, experts urge caution - Fox News",
    "description": "State confirms outbreak of sexually transmitted fungal infection, experts urge caution  Fox NewsMinnesota health officials warn of sexually transmitted fungal infection outbreak  CIDRAPMinnesota experiencing country’s largest-known outbreak of sexually transmitted ringworm  Star TribuneNation’s ‘largest known outbreak’ of sexually transmitted ringworm fungus in Minnesota  5 EYEWITNESS NEWSWhat is TMVII? Minnesota reports largest US outbreak of sexually transmitted ringworm  KOMO",
    "published date": "Tue, 17 Feb 2026 18:58:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOaW1sVF9INVg0TXdyWEkwRVVxazlMbjFUSklpNy0xMWlOVFhKZkdzbXY5YUdIWElFMlJmQnRabWdlMXFUMHdfOE42VXdPSFVBUzgwUmw4UkdUd3NCakpvZ0FZcHYyT3M3R1lYOV90eDRYZC03UVhaY2lrWTNfMlJ6OXVaLVRLLVo2elpqYmYxU0VQV0ViUUFpbk52QndSRjRwNUtRUTAzSlVvenJYenM1VFczd9IBuAFBVV95cUxQRG1SZGVUbXBzaU1qdHFKR1pfa0tJelFIOWJHMU5USlY5b3hyU2ZoOXRtVjVJVGQtdGUtSER0bG04ZjJEVUpFc3NPVlZydmtWaldLaUpyZTlfcTBLVWlaX0d6c3RlSXc0N1lsdzhkbkNlaXM0MnJTZVdzUERoS042YmVLQjRVR0xZM2otQ2NpUVJET1lsdDBQeFBVY2h5cUU5MXlGRFRXVjFxSkZpc21CcVQ5QnM3SkxG?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  }
]