[
  {
    "title": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "description": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest.  The Washington PostDon Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon pleads not guilty to federal charges stemming from church protest  CNNDon Lemon Hires Federal Prosecutor Who Quit Over Immigration Crackdown  The New York TimesCivil rights attorneys predict charges against Don Lemon, others will be dismissed, citing flaws in FACE Act  CBS News",
    "published date": "Sat, 14 Feb 2026 16:02:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTGlxaTVmZGNfZ1lOUlZqRUdNVWZhUnQyZkV1dWpOMFM0V2tsSTZOcUdjMmItUTd4MDBRMWZxZ0x2TFJRUlJMZGx1UVRPeTRhbXVPa1VPUWJZYUNWRUVFS2k2NXhJY1RRZXVZbG9waElyZlZkODZGa0FpUEhiakItLXFna1o4ZnZFQ0I0MGhwZGhiQlJjeXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Thousands Rally for Iran Regime Change in Cities Around the World - The New York Times - The New York Times",
    "description": "Thousands Rally for Iran Regime Change in Cities Around the World - The New York Times  The New York TimesIran’s crown prince says survival of Tehran government ‘sends a clear signal to every bully’  AP NewsIran, US spar as diaspora organises rallies abroad calling for action  Al JazeeraExiled son of Iran’s last shah calls on Trump to help ‘bury’ the Islamic Republic  The Times of IsraelSon of Iran's last shah urges US military intervention in Iran  Reuters",
    "published date": "Sat, 14 Feb 2026 17:04:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOSjVkbnJLOVljbDR2d2V2X3VwTXlGZk1OVVkyYWFsYnR3Vno4NGRoOXgwd2dibXV3NU9HR1JmdXBhR290TW5TUS1CaHNvbFd6M1djMGFGa2tRYjhqTlJETW9LSjVGcW02TVBNVUlHYXVvRkxwNGJMTUNUMXFMN3JKNWc2TDBMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Newsom says Trump’s attacks are bringing Europe together - Politico",
    "description": "Newsom says Trump’s attacks are bringing Europe together  PoliticoNewsom to world leaders: 'Donald Trump is temporary'  PoliticoAs Trump tests alliances, Democrats with 2028 ambitions offer reassurance at Munich conference  CNNWho pays for Newsom's travel? Hint: It's not always taxpayers - Los Angeles Times  Los Angeles Times'Doubling down on stupid': Newsom, AOC, trash Trump at European summit as they raise 2028 profiles  Fox News",
    "published date": "Sat, 14 Feb 2026 18:09:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPSWVTZnMzajhTaldMcExLVzU2Ym5XekttVk9tOFotTTVSa25tcG43RUdSUk1JQl9aLURnUkwybjJsRWd0SHlFQzB1QTRRRmRabzBXYkFTNUpIVGY4LUV2NC1KWTVmcHBHaERRLU1XcVRGRXNuVHgyS0tSOXNGRlVJXzNn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "New careers, relocations and medical problems: How ex-federal workers’ lives have been upended since DOGE - CNN",
    "description": "New careers, relocations and medical problems: How ex-federal workers’ lives have been upended since DOGE  CNNFormer feds turn to tailored job search resources to continue service-oriented work  Government ExecutiveFormer federal workers follow their 'calling' to state and city jobs  USA TodayFormer federal workers are taking up local government jobs  Inquirer.comOne year after DOGE cuts, former federal workers find new roles  CNBC",
    "published date": "Sat, 14 Feb 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA2b1ZldWRadFBRZ3NYVzlKY1lVelc0VFc1ZXVTeXVFaDFIZm9pbUtpQXo3cFR4T1UtU2ZxSGtJRG9QT0NVcDBfbWxSN1pMd0JDaEdPTlFfbFN6eWVERm1kbUtVLXN3MXhxUmgtRS1UU3dFekU4SkNhSTI3M3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Saturday's threat of severe weather increases for Houston, Weather Impact Alert issued - KHOU",
    "description": "Saturday's threat of severe weather increases for Houston, Weather Impact Alert issued  KHOUFirst Alert Weather Day: Showers and thunderstorms possible on Valentine’s Day  KLTV.comScattered storms bring small hail and heavy downpours to San Antonio through early evening  WOAIGov. Abbott activates state emergency resources ahead of severe storms  Click2HoustonRainy, occasionally stormy Valentine’s Day  KXAN Austin",
    "published date": "Sat, 14 Feb 2026 09:19:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQQVQ1OHdkTFd4V3cxN0V0UzJ1SFBiaklMRWludHRZT1hQMlRadVh4ZzBqazQyeHdJYmRuNXZTT19tU3pFSWg1UEMzRmo0SGJmUE10bU1tdHdOamM5U2ItclB6OGZTUDFLaFgzV1dTcEFybDM3SWVadDZrUkNNM3lLMXZnOTFLRUltSV92MFBxWEc3TEdZZ0FhVW0zZUJYVFBvS0x3dzVqZFM4S0Zjdi0tMUZyT194Y3lwTVl6cDJ0aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.khou.com",
      "title": "KHOU"
    }
  },
  {
    "title": "How ICE Failed to Justify the Shooting of Julio Sosa-Celis in Minneapolis - The New York Times - The New York Times",
    "description": "How ICE Failed to Justify the Shooting of Julio Sosa-Celis in Minneapolis - The New York Times  The New York Times2 federal agents placed on leave after appearing to make 'untruthful' statements about violent encounter in Minneapolis  NBC NewsDHS says immigration agents appear to have lied about shooting in Minnesota  NPRICE agents may have lied about shooting of migrant in Minneapolis, officials say  BBCICE says federal agents appear to have lied about confrontation that led to shooting  Politico",
    "published date": "Sat, 14 Feb 2026 10:02:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNMWRuVUJsT04waGxpOGxuLVVCcDdRSGtOdWFkWUZSTVZaSUtnRzNoY0F0TXhkM040R2M2SjR4akVyUDNpQ3JGM1Rpa1pyWGVabVhDcDF2V3I0VmZ5ZDB5akhvVm1hNmdaNkRUdm1LaEFFSlh6VHczd2tTSTJ6S3dxbEE4dnROQ3ZpWElVVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "TSA agents are working without pay at US airports due to another shutdown - AP News",
    "description": "TSA agents are working without pay at US airports due to another shutdown  AP NewsHere's how the DHS shutdown could impact the lives of everyday Americans  Fox NewsHow the Homeland Security shutdown is impacting travel in the U.S.  PBSWhat services will be affected by the DHS government shutdown?  CBS NewsHow a Homeland Security Shutdown Affects ICE and TSA  The Wall Street Journal",
    "published date": "Sat, 14 Feb 2026 21:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZEVGNGdfS3Z6LVowS0doZHgyd0w4VHpxOWJZbTVHYndzUk15ZkpvdXNOcVpIRHJWU0JHNDdXdHcwZ2JjZEFXY1N1NVB6bUtKTjhoMnlJZXNncWw0QlRVWFJJYk1keEdpMXNpLVNYLUNUdG1FOTBPazc0T0ZBYUpXUXFvQ1BuZjIzOHpKTWVhcEs0anlfbHU2bV9FNEdJdnJM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Barack Obama publicly states support for anti-ICE demonstrators in Minneapolis - The Guardian",
    "description": "Barack Obama publicly states support for anti-ICE demonstrators in Minneapolis  The GuardianView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 17:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOSW9UZHhSdnlyU285OE15NVFZcXRqQXdYSkowUEp2ekJKTklYbk1walBzR2FscDczWWczM09fd09YVnNrRDB2QlhLTHRpNE1CVzRvTmVISXpiMkVxbnZpa1Y1Yk9KYjNGcHhzSzdPd0hiaGJtclBtdldlSzdyZ29MWWJNUkhvdTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Ocasio-Cortez Offers a Working-Class Vision in Munich, With Some Stumbles - The New York Times - The New York Times",
    "description": "Ocasio-Cortez Offers a Working-Class Vision in Munich, With Some Stumbles - The New York Times  The New York TimesAOC accuses Trump of trying to usher in ‘age of authoritarianism’ at Munich conference  The GuardianOcasio-Cortez takes progressive vision to Munich: ‘We are ready for the next chapter’  The HillAOC's ap­pearance at Munich con­ference in­ten­sifies spec­u­lation regarding pres­i­dential run  Spectrum News NY1Ocasio-Cortez, Rubio to offer dueling visions of world order in Munich  The Washington Post",
    "published date": "Sat, 14 Feb 2026 19:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPLVJuVFRTU2tieWVCM0JyTDE0cXFFOVFCZFR6ajZDcnBGWHhsZ2piOGdzWGw2aS1UOGJQVFlNdTdkXzJrUFZlclZIOXpyR0Exa240Vlo2WGkzN2p3LTZiYXpyZDh6YUkwTVZ4emlvODI5bERicWhPNVdKTkd3WWx6M0lZbG9ORUcteDR1Z2NmZHhxWDRuMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Kennedy is banning junk food from SNAP. Our quiz shows what counts. - Politico",
    "description": "Kennedy is banning junk food from SNAP. Our quiz shows what counts.  PoliticoSoda ban for food stamp recipients would cost South Dakota $248,000 annually, report says  South Dakota SearchlightSNAP junk-food purchase restrictions taking effect in three more states - see where  LiveNOW from FOXWyoming is asking the USDA to ban candy and soda from SNAP  KHOL 89.1 FMEBT shoppers in Oklahoma to lose access to candy and soda starting Sunday  KOKH",
    "published date": "Sat, 14 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQZWZlem1sVzF2ZGIxeXRTeU5BYTRzVkRLemI4VUxtd3I1ZkU1S3lrR3BHeXNlYThzYU9wMGg2RG5PZGpoZVlhNjBMWC1EYnNvTlZ6enZ2cEsyN0YyN2VRV3dRZ0xPaXBfY2NOdHBJUXIwMmIzWWVzNjBTeFBxT3JJUTFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Orbán slams 'Putin-ing’ as primitive and frivolous as he declares Brussels as the real threat - Euronews.com",
    "description": "Orbán slams 'Putin-ing’ as primitive and frivolous as he declares Brussels as the real threat  Euronews.comOrbán says the EU and not Russia is Hungary’s real threat ahead of April vote  AP NewsOrban scales up 'war or peace' campaign as Hungary heads to pivotal vote  ReutersHungary’s Orban says EU bigger threat than Russia before April elections  Al JazeeraCould this be the election that brings Hungary's Orban down?  Responsible Statecraft",
    "published date": "Sat, 14 Feb 2026 15:01:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNZmxqdDhzUy0wQmN2dFEzT2poeTVpbUEzS3NtcFM2aGlsV2VRM2pYMXZfZUNzam9ab1kycmdtUGk4VUl2djV6WHJyVjA3a04zakowUUtoT01MYXQ3RGZVWmd1bEJDUjU1SFVwT0tEUFVJLUZ1RGRiWUFUeXNHNHdsZE9TeDBLdmxtd0xhcEY2TVdJVDdGMkJMZkR2TnpGdEQxek5zTDM1ZGVFeEJLNVRaa2dVVUYxTllaTzZneWlkdTZYdUNyRFMxWmhaeXF4X0NBTnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Can Bangladesh's new leader bring change after election landslide? - BBC",
    "description": "Can Bangladesh's new leader bring change after election landslide?  BBCTarique Rahman Is Elected Bangladesh’s New Leader - The New York Times  The New York TimesCan Bangladesh’s old guard build a new democracy?  The EconomistA historic election in Bangladesh brings BNP to power. What to know about its leader  NPR‘Bangladesh will be better’: BNP victory puts nation at crossroads  Al Jazeera",
    "published date": "Sat, 14 Feb 2026 00:03:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9CMHFaTlU3NXZZQ21VRm4zWkFrNlA4WGZaNFZYdDRNbUhSdTdFX3NIMVRQRjJFaTE2S2phUWxZOGJzX3c2dnVmVmpZVGRfRG01Z2I4em5VWjRZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Sydney police to be investigated by watchdog after anti-Herzog protest violence - BBC",
    "description": "Sydney police to be investigated by watchdog after anti-Herzog protest violence  BBCClosed-door apologies are not enough for a community confronted by images of worshippers being seized by NSW police | Aftab Malik  The GuardianIsraeli President’s Visit to Australia Splits the Country  The Wall Street JournalWhy Isaac Herzog's visit was important for Australia's Jews  The Jerusalem PostProtests dog Israeli president's last day in Australia  Reuters",
    "published date": "Fri, 13 Feb 2026 05:09:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5OXzFkVTl1S1RlU3h2RXdMTENxMXFlMVhHMS1PRVlOclFLSmV2SHRqcTBfVlJ4RU1lZUs5d3VRZThaVlhkLTdvYzVVZjZweWV4aU5LZWFWTnRCdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times - The New York Times",
    "description": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times  The New York TimesGisèle Pelicot felt overwhelmed and honoured by letter from Queen Camilla  BBCGisèle Pelicot plans to meet ex-husband in prison for answers on other allegations  The GuardianGisèle Pelicot recounts her ex-husband's \"unthinkable\" crimes in first U.S. TV interview since mass rape trial  CBS NewsGisèle Pelicot Recounts Moment Police Officer Told Her About Husband's Crimes  People.com",
    "published date": "Fri, 13 Feb 2026 17:41:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYlJBV1dLeE9waDBORk5TNzJkM0RRRl9IdVJ2WXpUNjR0RUY1QXdMRUZDQlQxdHpIbklxbjJQLTF5SnVJaVk4Y2VsbzJmVi1UNWdjM1RaUEpVWXQtRnVPcjNfTE9xdURLQjJ5Zk1FSXhZZzUzWW1CN2RTQlRDM0piNi1adjRFWXZqem5NRWFZYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ECB makes euro backstop global to bolster currency's role - CNBC",
    "description": "ECB makes euro backstop global to bolster currency's role  CNBCECB Revamps Euro Liquidity Offer to Boost Currency’s Appeal  Bloomberg.comThe EU has a plan to challenge the dollar. It’ll be hard.  politico.euECB opens up euro lifeline in bid to boost global role  ReutersECB President Christine Lagarde wants to boost the euro's global role  themercury.com",
    "published date": "Sat, 14 Feb 2026 16:45:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNb1lzSjloTDNlUjJDX2lJaE1XYl9mNXlZdWhCYjNCTnVsRE8yLXJTLVZPSW1IRjFtWG5RNXROdWJTdWFMZDVqWXdOa3lWdjFISWlkVk9mMThQdEt4VTlBWXNBUHRpQ0ZqZzlxWENUQmc5TzdHVHV0Q05LV0tTcUhoS1RhTk1yTjRqWHhKQkRqeG53cFhBNGVVZ9IBngFBVV95cUxQczFmNm9TTjREUFlzdUhiWjY0aHR6UnBQQTBIMkVEaERUVktQdkdsbDdmQlpxNm1wSVE1ZFpPNnlNTENqUnNTY0M2RXFpRE9KWHJIb2dSY1R6UzBDRE9Yb29rcVBoZEhMaDFYaEJ2UF9XeTZjanA4TDVjdHBVMFp4d0htLW1OWFdyWlhxRWFkNTN0eDBsOThNZjNrWk9CUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Security News This Week: Ring Kills Flock Safety Deal After Super Bowl Ad Uproar - WIRED",
    "description": "Security News This Week: Ring Kills Flock Safety Deal After Super Bowl Ad Uproar  WIREDAmazon ends Flock partnership after backlash over Super Bowl ad  CBS NewsRing Ends Deal to Link Neighborhood Cameras After Backlash to Super Bowl Ad - The New York Times  The New York TimesNo One, Including Our Furry Friends, Will Be Safer in Ring's Surveillance Nightmare  Electronic Frontier FoundationRing cuts ties to company that helps police days after Super Bowl ad  USA Today",
    "published date": "Sat, 14 Feb 2026 11:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMzZtcVZNUFR6eVV4TWp3VkJ3eVhOR3d5czcydGlSdDh0cTJqdXRtVTVIT2dMZVJ4Z2hnVWxhQXAtcGQ1RTQ1LVZIQzJnU18zNmdmdkZscXdtb0dEYnB3N3c2MzBNbTl5ZUtMeEViZzNwU1N0bHQtTmc2UldnUmhqTk5sOU9hMVNoQWJZaUdPaDktVC1tclZhMFUyYkZIWHdsZHFsRGNxdC1UdHV6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "OpenAI and Anthropic spark coding revolution as developers abandoned traditional programming - Fortune",
    "description": "OpenAI and Anthropic spark coding revolution as developers abandoned traditional programming  FortuneAn AI Breakthrough that Will Go Down in History  The Free PressClaude Code Power Tips  KDnuggets😸 Practical Workflows for working with Claude Cowork  The NeuronAnthropic's hive-mind model sets a new pace for AI development  digitimes",
    "published date": "Sat, 14 Feb 2026 02:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxPSVViVEU0eUM1R3d2bXBmVXJKTkxJZHNzc0pnTi1yaUYyQmlfYkxMSGtGOUZKM3lOcU9URE05cUdrVXpnUnB4WVdVc3cyc2xMMEtHTHIzRjdfdk5wbF9RMThjX1FTS1ZVUFZQWUlYUUNCNXBJQXM3WnNWU2dDTlF5U1lZZG04VWVBQVBteHI5Q2F3U3I1SlBqT0pMd2FyODNHMU1pSVFzVVM3RURHbE9iM25sb3RvNHF6eEQtUVU0WW9vcFhSUmU3Xy1iRmt1SnVpMmp0TEg3aldqYkVjaVN2b0JDbnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Presidents' Day sales 2026: The best tech deals to shop this weekend from Apple, Sony, Anker and others - Engadget",
    "description": "Presidents' Day sales 2026: The best tech deals to shop this weekend from Apple, Sony, Anker and others  EngadgetAmazon's Presidents Day Sale Has Kate Spade, Lego, and More for Up to 80% Off — the 100 Best Deals Start at $5  People.comShopping This Weekend? These Are the Best Presidents Day Deals We’ve Seen So Far, Starting at $6  TODAY.comBest Presidents' Day Amazon deals 2026: Apple, Lego, Roborock  MashablePresidents' Day sales 2026 are live: The best deals we're shopping now from Amazon, Best Buy, REI, Apple and more at up to 75% off  Yahoo",
    "published date": "Sat, 14 Feb 2026 14:41:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOMUY1YXJGLVpfXzlOSHhJMmRqV05EY2VPb1d2SlFNVDdzR1RqNWcydEtsck5YenNHaTBVQXlOcEo5cUpWclI2Q19wN3JJWDM2UUo3WVNmZllZOXlnR09DWkxOMjVfcWl5QzdCa3VYcTRlcjdfWG5RMlBMNHZ3RGRMalpsTm5xOE8yZ09wVmFqTUE3emN0VWpRZ29XWVgwTDFNZEFCSXcxdXh0djZ4MjFjVVg1RDhjYTV0c1M1TkFZbkZSMVRfYWtyUnI0N3FkUU9pWWw1dHdGRVZmeFJYd1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.engadget.com",
      "title": "Engadget"
    }
  },
  {
    "title": "The biggest gaming series are going indie. Could it save the games industry? - Polygon",
    "description": "The biggest gaming series are going indie. Could it save the games industry?  PolygonRelooted, Reanimal and other new indie games worth checking out  EngadgetIndie Developers Transform God of War and Silent Hill in Major Revamps  FilmoGaz",
    "published date": "Fri, 13 Feb 2026 18:00:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBsWm15c0RVWG1CS1JSdmZiUUZKU2RiaGFWTEJNUXFDcmRYNnRIRlk0d1ZtWFNaNDFka2RzZDl3cmlERUFmWjJVTGkwT3hFV0RNRWhLSTB1aV81RTU3Vy1uZ0kxeU9zTVpJS1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.polygon.com",
      "title": "Polygon"
    }
  },
  {
    "title": "What it’s like to go on a date with an AI in NYC - CNN",
    "description": "What it’s like to go on a date with an AI in NYC  CNNMy Dinner Date With A.I. - The New York Times  The New York TimesThey have AI boyfriends, girlfriends. Here's how they're celebrating Valentine's Day.  USA TodayCNN Reporter Goes on ‘Stiff’ Date With an ‘AI Companion’: ‘Please Don’t Call Me Sweetheart’  YahooInside the New York City Date Night for AI Lovers  WIRED",
    "published date": "Sat, 14 Feb 2026 12:46:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNMFBwVnlaV0VBWnhYbElQaXpiNlA4WGp1b1hOWVpDYms2S195YnlERERzUkE0RGFieHpoOTRNbGZxc2lzUmkyMGdkUWVpNXFRenV1dXFLNlh3bXltWkd0TEpfcnpyUERmRzBnNFU2d09PVGthZU5MMUhlUXl1OEhqUThJS0pSa0ZVSnY2MWFHRG00ZW9EVEVCSF9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Save $100 on Apple Watch Series 11, plus 28 other Apple Presidents Day deals - CNN",
    "description": "Save $100 on Apple Watch Series 11, plus 28 other Apple Presidents Day deals  CNNApple Presidents' Day sales: Get the Apple Watch Series 11 for $299, plus more deals to shop this weekend  EngadgetAmazon's Presidents' Day Apple sale offers price cuts of up to $400 off  AppleInsiderOura Ring rival drops back to lowest EVER price on Amazon, but only for a very limited time  GB NewsThe Apple Watch Series 11 is more of the same, but that's not a bad thing. Here's why it's our favorite smartwatch.  Business Insider",
    "published date": "Sat, 14 Feb 2026 12:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQSDBubklmMDVEalRrdEtBb0xHSXRNbjJMNUdfUG04NHI5MmNFQk5yZ3FGWkI3Vk0wV0dONVZKcERvUjdwVTdqTHpKUVdOQjEtdHVnRnNadXlkbkJFQ3BUeXY1VzFsM3BEYWk2Z2NJVzhmWUNGaE4zVEc5R2tpNWJVVHYzYWPSAYoBQVVfeXFMUGhRNWl0emlwSGJ2ZEVUNjNfWWlrZDdPcWV2YW4yWW5YMk02dTBQOVprQnRvUVAzaXlHcTRtZU1wWUVHQlZFSUFudTFpd2k4WjVsczljcUtaLUQ4OXF1UkFZSHhFMnNPUFM5QWpOUF9Gb0hidnhqUUZEWS1UOW5jTGpQNzd2WUw1d2ZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "ChatGPT promised to help her find her soulmate. Then it betrayed her - NPR",
    "description": "ChatGPT promised to help her find her soulmate. Then it betrayed her  NPRView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFV1TUFOVkYzVnhNVmFhLUQxZzFtdUZTRFhRZ3Q5ZVRmdWZ3Ylp1Z3pFTnFRVkNKMmktQjNZM2JGU3RkMmhLbURHRFB0SERReC1aelhUaHZBT29qLWJLZUd6UzRQUVpiZG52UEhmWHpTa2JlaVlqWGJVV1BCV0tnd2VObDlacjlSak81ZDZsU1AtSWtKblNXTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Celebrities Celebrating Valentine’s Day 2026 - E! News",
    "description": "Celebrities Celebrating Valentine’s Day 2026  E! NewsValentine's Day celebs as Maya Jama gets 100 red roses and Beckhams swap sweet messages  The MirrorHollywood Stars Celebrate with Heartfelt Gestures!!  indiaherald.comEntertainment: From reviving romance to cherishing companionship — celebs share their take on Valentine’s Day  Tribune IndiaHollywood hearts: Stars on their kind of Valentine's Day  India Today",
    "published date": "Sat, 14 Feb 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNSjFWbzZfbmRXNDE1aGZia1VYQlNNejR6NTMwUHNTRzZYLUtTNnlieGRCUERyVVFNaGVuWGY5Rjg0VjYxeXlpY2VLQ2hLelJ2dEdRNG1zM3JjVDZoYUcwSEVORHhxMUpTekQ4amozTGllRmg0MEszM3VRQ3J0UFg2Y2pWbWRhcG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eonline.com",
      "title": "E! News"
    }
  },
  {
    "title": "Harry Styles: ‘I’ve learnt how to slow down’ - The Times",
    "description": "Harry Styles: ‘I’ve learnt how to slow down’  The TimesHarry Styles on His Love for Italy and How He’s Slowing Down After Hiatus  billboard.comHarry Styles makes rare confession after parting ways with Zayn, Liam, Louis  JangHarry Styles Shares Rare Insight Into Life as an Uncle to Sister Gemma Styles’ Daughter  E! NewsHarry Styles shares wild realisation he had while dealing with global fame  The Independent",
    "published date": "Sat, 14 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOSDloUWVjWEgzZ2NHU2ltRFk0XzhMck96WWxWN0QxZXJPa05hV3ZaUDd4RWVzdDlLTXI5WTI3NC03czlBVWt5RW1ZeVI4VUt1ZGZBYl9lZEVhVzg4S2F2eG1Dbm9jUTJ2MWdteDQ1eG8zLVlZOWlwb19DVVhfX0JGLWlnbUthNlFnekxSdUxOVzBYbGpIV2xMMnNxT29jbDZJNDluNkoyRm8wa2VzUkNnenhlTm1iOGJodFUzNjJUVUc3Xzd0TVVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thetimes.com",
      "title": "The Times"
    }
  },
  {
    "title": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’ - Variety",
    "description": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’  VarietyRupert Grint Quizzed on Rise of Fascism in the U.K. at Berlin ‘Nightborn’ Presser: “I’m Against It… But I Choose My Moments When to Speak”  The Hollywood Reporter‘Nightborn’ Filmmakers Jump Into Berlinale Political Debate: “We Have A Responsibility To Speak Up Against Violence And Injustice”  DeadlineHarry Potter star Rupert Grint shares where he stands politically  The News InternationalRupert Grint Draws Political Spotlight at Berlinale Nightborn Premiere  High On Films",
    "published date": "Sat, 14 Feb 2026 16:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQYk5MTDNDdUNlcGY4R05XNm5wYmxLWVRKOGhwT0kyR1d3NkNHSmFEMXhtV3RrYTZ2V09zUUJ5dHFVTlhkOVFXVlhkY3ZWdzBDa2VUWEllTjM5MUV4QzBJUHlHMjI1M3dnam5OelhhbEZjQWtXT3BUYjFhX3dOWkRGRXd0amxrVklfUFJRekZudmxNNTI0Q0xNLUtWWFRpUmRlSmw0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "‘Rosebush Pruning’ Review: Karim Aïnouz’s Black Comedy Is A Bad-Taste Riot - Deadline",
    "description": "‘Rosebush Pruning’ Review: Karim Aïnouz’s Black Comedy Is A Bad-Taste Riot  Deadline'Rosebush Pruning' Review: Callum Turner, Elle Fanning in Dark Satire  The Hollywood ReporterUltra-wealthy behaving badly in surreal Berlin premiere  YahooKarim Ainouz probes family dynamics with 'operatic absurdity' at Berlin festival  ReutersGermany Berlin Film Festival Rosebush Pruning Photo Call  guardonline.com",
    "published date": "Sat, 14 Feb 2026 18:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQa1B4V3VTU1lnZ1pMdVNXSlI2Mzc3SmVublJmUklGbk9LdkhKUUsxU014d0U1TzNFRDJOQ3oxLWdfX2xjdDdrcGZWaUczcUE1NEJOWnNONWVZY1FrOGpHYXZQb2dYaE5NLVJOWkU3V193VVFEU2wxZGtRMGJIUGlMd01MR3lUcDR5SFQzS3hpRGJ3RjNvNFBoV0dISXlwYnIyS2wtdkM5cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Marie-Philip Poulin returns; Canada into Olympic semifinals - ESPN",
    "description": "Marie-Philip Poulin returns; Canada into Olympic semifinals  ESPNCanada routs Germany in women’s hockey at 2026 Winter Olympics to advance to semifinals: Live updates and reaction  The New York TimesWinter Olympics 2026: Canada thrash Finland to set up women's ice hockey quarter-final against Germany  Milano Cortina 2026Olympic Preview: Canada vs. Germany (Women)  Hockey CanadaCanada reaches Olympic women’s hockey semifinals, Poulin ties Wickenheiser record  CTV News",
    "published date": "Sat, 14 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNR0ZuQlR5SlBlRGZSVGY1R0VjclotLVFUTnhYeUFnTFlaU3F2WXcwVkZIdzJMTFdnNEtIanNhY3FpdkRBdm05UmNKeG01a21vM0hrck9PUUxMV25aQ3ZxU1l3N3RPcTBacFM5QUNNd3Z1empXV2FnWjVZbVVtQzZvOFRULTVPSDI1emxlYUY1RFEtc1VjQnQ0Tk5JbTJiMXEtZXVZc1d6N3ZzZDMyRFJv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "2026 NFL Mock Draft 2.0: Jets pass on QB - New York Post",
    "description": "2026 NFL Mock Draft 2.0: Jets pass on QB  New York Post2026 NFL mock draft: Yates' first-round pick predictions  ESPNDan Parr 2026 NFL mock draft 1.0: Jets trade back into Round 1 for QB; Commanders go RB  NFL.comMock Draft 2.0: A Mendoza-Raiders Marriage, the Jets’ Edge, and More Round 1 Predictions  The McShay Report2026 NFL Draft rankings: Who are the top 100 prospects in this year’s class? - The Athletic  The New York Times",
    "published date": "Sat, 14 Feb 2026 15:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNT0F0SWpxd041Rm03UWRBZEpjamQ1aXRnVEYtOTh0X1J6Qm13U3Z6NUdPQTVtbi1sbzVuUjVXYWZKU2NpQ3dSVnBNNWZydGIxQk1ETE5jN25KSTM3d2dyNkZmZVhFZ0oyU0pVdElBZ1JqUHpYMFFsRGNXbnNzS3RXUHEwVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’ - MMA Fighting",
    "description": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’  MMA FightingPic! Charles Oliveira looks incredibly ripped for ‘BMF’ title fight | UFC 326  Yahoo SportsDoctors Said Charles Oliveira Couldn't Play Soccer, Now He's Fighting For BMF At UFC 326  MMANews.comCharles Oliveira's coach says it's still a mystery why first Max Holloway fight ended in 99 seconds  Bloody ElbowMax Holloway heaps praise on Charles Oliveria ahead of UFC 326 clash  Sherdog",
    "published date": "Sat, 14 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNVklYaXdFX2w4N2JWOERud2V3NnYtcVRVazRwR3B3SDdnYTdUeW9oeUFmaW5QSDNnTkhBWWpHa19pNDFZZkhVQVh0d1huaWd2WTFEOFRLTF9qRlRZckhjajloNFUyMmExWE9wOTc2UHdKZkkwZXdTal9QZW85NzN3ZEpOcE5QcUxhUkRJOS1nel9ISDRmQ3ZuY1E1LV83TG1PTDhHQVpvcnR5UWJObnhRUmwwVnNLVkZEbWNOSTl4SEtiY2xnVi04blMyUGk0WVRlLXNHakZJQm1sTmZRVW52TFNCQVRFUng1TDI3TVhjc3JEWFEx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks - NASCAR.com",
    "description": "NASCAR at Daytona: Key information, links, results for 2026 Speedweeks  NASCAR.comDaytona 500 live updates, NASCAR O'Reilly race start time, TV schedule  Daytona Beach News-JournalNASCAR’s Daytona 500 odds, predictions: Ryan Blaney and Joey Logano narrowly lead field  The New York TimesDaytona 500 start time moved up an hour as bad weather looms  ESPNDaytona 500 start time moved due to threat of inclement weather  WESH",
    "published date": "Sat, 14 Feb 2026 21:28:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQVnlMVVQtNk1nMGNSeGdQZGhZdHdzSnRPa25FLW9tQkFiNDFNbHFRdFNORGNVWXByQzFDM2tiV0RUYWMwUnhoRDVEXzRyYlFPN0dubWFrZF9yU1RwQ0JZSHBmclBCYjFEY0xBMXpoU3l5aHRVdGpmcllGa3U1OWtZMHNfcFk1ZFdVWF8wSGpwaDZMVFNWM0dqeEIzcVBtWTF1RXpUaTFhenduRi1pUHR3SWNENA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts - Space",
    "description": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts  SpaceNASA’s SpaceX Crew-12 Launches to International Space Station  NASA (.gov)Four new astronauts arrive via SpaceX rocket at International Space Station  The GuardianSpaceX, NASA mission arrives at ISS, relieving bare-bones astronaut crew  CNNPHOTOS: Crew-12 launch lights up morning sky over the First Coast  firstcoastnews.com",
    "published date": "Sat, 14 Feb 2026 20:17:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdGdReVYta0tjRjExS2RkYWZsb1Yyb1Z3ZzMzcUxqNWhsWTdNY21qVUFrX0dzRmFSMUdkUXlIdmNIeFlwSE9TZ1RURkVXdHlocU5XMmtSem9mSjdneUtqMW1hanZrajE3ME5QMC1yRVpIdE4zM1ROZl9OMjdqMTU0eGJlUVBWWkNjem83OUVtYzZFQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Astronomers watch a massive star collapse into a black hole without a supernova - ScienceDaily",
    "description": "Astronomers watch a massive star collapse into a black hole without a supernova  ScienceDailyScientists Capture the Clearest View Yet of a Star Collapsing Into a Black Hole  Columbia University in the City of New YorkAstronomers witness vanishing star collapse into a black hole in Andromeda galaxy  SpaceHave astronomers witnessed the birth of a black hole?  NPRSupergiant Star Collapsed into Stellar-Mass Black Hole in Andromeda Galaxy  Sci.News",
    "published date": "Sat, 14 Feb 2026 05:44:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBxSjFkMjBIVGlkQnhDOElaaG9GaVJZZUUtMmlKZm5xdW5HQ0tiTFlzWVZfci01V3M2NjlDSWkydHM2czl1N1RYX1BPWjVjMkVBdG9XU3c1aVNqU0ZWTWhTcXhMcDhzbE1jcmNoR1U3MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencedaily.com",
      "title": "ScienceDaily"
    }
  },
  {
    "title": "ULA’s Vulcan Rocket Suffers Familiar Anomaly During Launch of US Military Satellites - Gizmodo",
    "description": "ULA’s Vulcan Rocket Suffers Familiar Anomaly During Launch of US Military Satellites  GizmodoVulcan suffers solid rocket booster problem during USSF-87 launch  Spaceflight NowULA’s Vulcan launches Space Force mission; solid booster anomaly under investigation  SpaceNewsSparks seen from rocket as ULA Vulcan launches from Florida Thursday  Florida TodayULA’s Vulcan rocket suffers another booster problem on the way to orbit  Ars Technica",
    "published date": "Fri, 13 Feb 2026 20:15:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOQW5XeGxJVUxNUVdLV1NzY29XZlJvYXhYY1pQdm1vVWZjaXpjT3lhUDJwWFhWYWI1VDREQUdndzZkOEVzRHJCWklpa3BNRnRSMG9pMlo3djB2d0RDcXY3ajFXNUFZTUZyZGc1OWN2N3pzeUlGMmVKS1dTNDA0RVU4T1AteXU4cjhVZlVDVHFZUjdjaWtOVElCTzZCVUplQTd2ZTcyeUkzb1ctWXp4aVdnNjBzY1Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "'The beacons were lit!' Scientists name merging supermassive black holes after 'Lord of the Rings' locations - Space",
    "description": "'The beacons were lit!' Scientists name merging supermassive black holes after 'Lord of the Rings' locations  SpaceGravitational lensing technique unveils supermassive black hole pairs  Phys.orgPhysicists propose a new way to spot supermassive black hole pairs  YahooNew method could reveal hidden supermassive black hole binaries  NanowerkNo Sign of Gravitational Waves From Single Supermassive Black Hole Binaries Yet  Universe Today",
    "published date": "Fri, 13 Feb 2026 23:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOT3pwUlJZZXFlcmNnNmMtZy1IZnJEZ3pGenpMVmw1cVMxUkRvVTlCZDBidjVRVnMtNHoyNUh3R29IdExCbmJtNzZuWkwtbVhRZVVnQzczQm1wdjl0X3BxSVhYbV9tTmFoZGtsc0g3MTZMemlXLVZ0MG5EYVBFSGlhNU9aUE5WZjRFQ1U2Z28tUjlDWGdEVU1hQ1hnQTNOeWFJRVp6TFU1SGo3NTNvTlFibXRQSkh1cHVWUll1d1dqTXl0WEVIMS1yRF93Q0I1YWotdEVLdlVNQlVJeENmSmZjZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says - EatingWell",
    "description": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says  EatingWell2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf. - The New York Times  The New York TimesDrinking 2-3 cups of coffee a day tied to lower dementia risk  Harvard GazetteWhat to know about a new study on coffee, tea, caffeine and dementia risk  CBS News",
    "published date": "Fri, 13 Feb 2026 00:55:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1CcENJMXh2REwtb2JVY2NNOXlYNXA3UGZ6RFBjb29faXplRFV0ZUdUMzVBQjlUUzZTMzlrbElOeWxjcUxaNzhSU1htSFAwekszTVdaa3VVWEpROGp1bEkzV1hNbEQzMGpWNmh6cC13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eatingwell.com",
      "title": "EatingWell"
    }
  },
  {
    "title": "Measles Outbreak Hits Ave Maria University in Florida - The New York Times - The New York Times",
    "description": "Measles Outbreak Hits Ave Maria University in Florida - The New York Times  The New York TimesAve Maria University battles measles outbreak  National Catholic ReporterStudents hit by measles outbreak at Florida university  USA TodayMedical professionals provide overnight testing for measles outbreak  WINK NewsFlorida health department's updated measles numbers shy of Ave Maria report  WUSF",
    "published date": "Fri, 13 Feb 2026 23:26:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNdmE3ZC1keXZvaUplWWR6cEpDUW9FVF91cUdwQW5jOHkzY19BT19JdkNxNXhPSmg0aE0ySjRtbWVFT0NfRHZpTlFBVk1fZ0xfcEd4VmVsMVQtQW9EaTZ5NFNBRG5PbWV2MkVqOFZ0bUJzbjFBVl9nWFJkc2QzMHlXYjF0NTY1SXFI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "5 ways losing love affects you and what an expert says you can do to start feeling better - CNN",
    "description": "5 ways losing love affects you and what an expert says you can do to start feeling better  CNNCan you die from a broken heart? Louisville doctor explains the warning signs  WDRBDoctors warn of ‘broken heart syndrome’ spike around Valentine’s Day  WWLPHeartache isn’t just emotional  The Desert ReviewOrlando health cardiologist explains realities of 'broken heart syndrome'  WESH",
    "published date": "Sat, 14 Feb 2026 15:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFAwa2hOX0wteDNOeVFDdXh4VkpIajhGM2Y4VHZkd1Z0eHpnN2xIWGdzc080LVpsQzR5czJHSTdGUE5salJ0Q3piQjl3eldVSGJaU2E0TWVTTmNQX1RNalVlMmlQNmRwZTBmS2lBa3d0ZmRDV3c0QWdpRVVLU1VCdmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "It's a dangerous complication of pregnancy — but a new drug holds promise - NPR",
    "description": "It's a dangerous complication of pregnancy — but a new drug holds promise  NPR",
    "published date": "Sat, 14 Feb 2026 12:46:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNNjFKcE5aZWU1bkN2M0YwXzVLRTVRa2p2aUhUeThiRHlZUlJjWmduWlRrWks4NFdRaWMzb2tSczYxVlJKS2lCeWhzN0lkd3YyOFQ2dWZpZ0J2LTc3MFJSejl1cFZra3pVU3gyT0xvbjdnZW9kQmNqcmdmQ190c1lyLVVzdjNWbU9uUUVPbGYyYndUR1hm?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  }
]