[
  {
    "title": "X to stop Grok AI from undressing images of real people after backlash - BBC",
    "description": "X to stop Grok AI from undressing images of real people after backlash  BBCGrok and the A.I. Porn Problem  The New YorkerX says Grok, Musk's AI chatbot, is blocked from undressing images in places where it's illegal  YahooElon Musk’s Grok can no longer undress images of real people on X  CNNCalifornia investigates Elon Musk’s AI company after ‘avalanche’ of complaints about sexual content  CalMatters",
    "published date": "Thu, 15 Jan 2026 01:20:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1jSDAxakgxMTlTN1BwM1JFanZWUzNlRDBHRk9DNFlJUEVDZlFFcG0zbEZ6TTVLdnlCQXJMMExjb2t6TnhWT2piSEczbW1aZlB1eDE1aDA3NDlVZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Judge skeptical on ICE agents wearing masks in case that could have national implications - Los Angeles Times",
    "description": "Judge skeptical on ICE agents wearing masks in case that could have national implications  Los Angeles TimesDepartment of Justice asks judge to pause California's mask ban on federal officers  ABC7 Los AngelesLA County’s mask ordinance is now in effect, but who’s enforcing it against ICE?  LA Public PressKPCC-FM | Justin Levitt Provides Legal Commentary on ICE Activity in California  Loyola Marymount UniversityNew law strives to relieve tensions between law enforcement and the public  highlandernews.org",
    "published date": "Thu, 15 Jan 2026 01:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOd1RIRmNQcHYzank4S1pyVnpScnZlM0x0NHFwM3NOWlV4NWxTanhtbWtCLTNoSEl0S0dDNXl5VWhTYmlBRUV1UGMwQ240WTVhX3d0aE1KUHFOQ01BM0J1ZkhHYzJaaXdxaG44dGRReGpKNHVaaDhhdmR4bjVVY21YRXBPY3BJWlNuUDhwR0RvNmYxaXZraTlnSEJrWDBDWUZyV1J6aUthNTd6U0t5M1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe - The New York Times",
    "description": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTop Atlanta CEO: U.S. action in Venezuela ‘massive pivot’ in energy  AJC.comThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  FortuneExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  SemaforWhat US oil CEOs know about Venezuela that Trump doesn’t  The Hill",
    "published date": "Wed, 14 Jan 2026 20:48:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOSFJTZnZNWXdONjc5azcyaWRfZVdlTDhVMlNFQ3E5dzA0czhOb2FMVkxjWHBwN25ZeXF6ZTZvUGN3MVEzZERnX05Sa3dYRFpzUVEybUdjbzlIMjFxLWxhRmEycU1VamVHYnhwSGMyeEsyWk96bzdTaDBrUjcyeldtUXp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations - ABC News",
    "description": "Clintons say Comer is 'lying with impunity' about Epstein inquiry, release written declarations  ABC NewsBill and Hillary Clinton Refuse to Testify in Epstein Inquiry  The New York TimesWitnesses Testify on the Use of Chemical Abortion Drugs  C-SPANHouse oversight chair says panel will move to hold Hillary Clinton in contempt  The GuardianHillary Clinton defies subpoena , skips deposition in congressional Epstein inquiry  Politico",
    "published date": "Thu, 15 Jan 2026 01:20:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQcTFXMUdSWFIwZjJUTWV2UG55QTJUU1ZPRGwwQUNTR3MxLXd1VVRzQmFnb2phUGhHRmJRVHFEVmhaUmZlMENfc3c3eTg4c0JsdVhsYXZkM0pIOXE2WDNzc24tSjQ4eWtDcXRHamhUMEV1XzcxeXdGQ29jb2JEb3JwRUgxcG55bTdDeHJabWdoal8tSWpPTHpicmNlMEFxa0JsT2RjQlZKU1BtQkNiaTh0OUlB0gG3AUFVX3lxTFBDUE8wVmNkU3paQlhzRDJONnlMenRfYS0wLUdsRnVGTGU5TFM1ekxrbENfcUNwMWxwMGg3QU5nN3VaaTFzcVVmUmNXeTdFZXlQamYySTFkTGU4bEZrQmROVDAwSGJHUmdtVXQ3enI1djJaNTNiNFFUR1dJcWl0am9wcVYyNk53LS1BX0c1RGRDUXp5RzRyYndoNGNmaUJuQTYzWEswVU5kSlhoQ0VpVXY4SlZTYjVtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Au Pair Testifies of Lurid Plot in Virginia Double-Murder Trial - The New York Times",
    "description": "Au Pair Testifies of Lurid Plot in Virginia Double-Murder Trial  The New York TimesAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNBrazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC NewsWATCH LIVE: Former au pair cross examined, pressed for details in Fairfax Co. double murder trial  WTOP",
    "published date": "Thu, 15 Jan 2026 03:30:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4zd2lvV2RIMmE2Y2FlSHdFazZ5Tkl0QlVjalVxU21HN0NlcFlVODRDaTRVdU10eC1zdllLdlN6SzA0NURqRjVTSHRJS25OV0ZwZlJkU1E2TUlqR3lZY3RjSkRZM1R5SUVLQ1pGWEVXb21TS3phdF9rQTBJNkY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them - The New York Times",
    "description": "3 More Lawmakers in Video Say Federal Prosecutors Are Investigating Them  The New York TimesDOJ wants interviews with Democrats as part of investigation into lawmakers’ ‘illegal orders’ video  CNNSenator Says Prosecutors Are Investigating Her After Video About Illegal Orders  The New York TimesDemocrat Elissa Slotkin says she is under investigation for video on illegal orders  NPRSlotkin says she is under investigation for November military video  Politico",
    "published date": "Thu, 15 Jan 2026 01:50:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPUmZEMF9DYVdieWVhQ2hpSXpNcFN6TjFOWUpGR2NLcmVsTjlob0pNNjlGRV9lUXpYSnZwX09lN0M2R21qc1U2dXJreDgzTDB6eXdMTmlNMk41WWRTRkU4VHlpeWpGOGY4enBZdEVDbmR4aUVwaHZSSDlyOGxvSE81NEUzdVEzZ2NKbFBTdkxpRndrQzhVdFpqQ0xDOUY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal Agent Shoots Man in Minneapolis, Prompting Tense Protests - The New York Times",
    "description": "Federal Agent Shoots Man in Minneapolis, Prompting Tense Protests  The New York TimesICE agent shoots Minneapolis man in the leg  BBCPerson shot in leg by federal law enforcement in Minneapolis after assaulting an officer, DHS says  CNNShooting involving federal law enforcement reported in Minneapolis; two in hospital, including federal officer  KTTCFederal agent shoots man in Minneapolis as tensions in city run high  The Guardian",
    "published date": "Thu, 15 Jan 2026 04:57:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQcGo4a0w5Ui1VTFNZNUNtNXdoTWdxZzV4Tk5pT3FGcl9CY1hsS2RqTUJJSXNrempmTFZkaVR3Tk9mSkd4ZUh0VzZNLUFoMV84dmdTeE5mQUU5dHg5QnJfV3FoZFJrU0FVSlZMYWM5Yk1RWDU4MEdEVzVjMlduMDFJUzBpQzN3V2hITC1aLUJXWTNkcnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation - Star Tribune",
    "description": "33 ex-federal prosecutors ask Trump to reconsider excluding state from Renee Good investigation  Star TribuneSix Prosecutors Quit Over DOJ Push to Investigate Renee Good’s Widow  The New York TimesTop federal Minnesota prosecutors officially terminated after dispute over ICE shooting probe  Fox NewsJoe Thompson, Minnesota's top federal fraud prosecutor, quits over ICE shooting probe  MPR NewsJustice Department sees ‘no basis’ for criminal investigation into ICE officer who shot and killed Renee Good, official says  WEAU",
    "published date": "Wed, 14 Jan 2026 23:59:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNTHlrcWJZajZEZWd5Yk9BdlpSbzZydWEyWUxoRDdhdFdoOW9ScUFhRlg2ZTVWb3ZwRWlYQ0M5eHBYSDUyNHhlU1lRdFdOTGR4ZlNuMlJEQ1FvRkFJMVE2Z1NfVHpwZC1oZnZHTmgtZHotYW1mal91NFc2MWQ4UXBWcWtjell0aVVOa0tTUjBFU1VXWndPWEdKUjFSTm82WmF4cExncUZQUnJXdGZoRFJEYWpFWk5GZm5tUnI0OTh0M3VDc2hPbmUyS2ZQak4xQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.startribune.com",
      "title": "Star Tribune"
    }
  },
  {
    "title": "The U.S. freezes new immigrant visas for 75 countries: See the full list - CNBC",
    "description": "The U.S. freezes new immigrant visas for 75 countries: See the full list  CNBCUS suspending immigrant visa processing for 75 countries  CNNUS freezes all visa processing for 75 countries, including Somalia, Russia, Iran  Fox NewsTrump Administration to Halt Immigrant Visa Processing for 75 Countries  The New York TimesA Guide to the Countries on Trump’s Travel Ban List  Council on Foreign Relations",
    "published date": "Thu, 15 Jan 2026 03:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTHFPYmRaTGxXMEJ0NXhxbXF1SjhKWEI0VFRGQXFjdWVHWEUtY3JpeFBlaEw4Q1RxV0VPMUQxNW1CRHBZX2FRcC1oTWVGNWRianJQRzlzWF9BMzRObjB1Q0ptbXI2MkZ6YURwcElnVmF5U3RVNkF5bXY5d09VM0N2UkdQRHpld2lzdWF2RlZsbk5sMi1DeVBReVY5OVrSAaIBQVVfeXFMTVloOHZMckpxUkd6M2lFVVNQVGJxT0V1NXczZlZ0d0NDYW9jRkVxUkw2b0daTlBPdGVLTmc5XzZqcWVKb2g5dmtLSFp5Mll0ZHNDR2ZRTUxaNFdaaGRLZjRJZkwxcGEyRU9IbExpSE8xN3NEQWNjeDFvRjh1UkRrWEFsSGFkVzgzbEVZVGJBbVQ0bGlNbVJ6WXdwWDRhVUYwNzhn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Twenty one English councils ask for election delays - BBC",
    "description": "Twenty one English councils ask for election delays  BBCPublic don’t want ‘zombie’ council elections, minister says  The Times'People who believe in democracy don't cancel or postpone elections' | ITV News  ITVXThurrock Council Labour leaders say capacity to deliver LGR will be diminished if elections are held - Reform UK says they are 'scared' of a defeat in the poll  Thurrock Nub NewsEssex County Council will not be calling for the postponement of elections  Essex County Council",
    "published date": "Thu, 15 Jan 2026 01:32:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9MMTZfbjZ4VDViYUJYR05VZGZRNVQ3c3gwNFRzOFlSc2ZxTzhydEJQYXdDN2txcEVrcnl0ampDX2oycXdhTnVRYmFNaFlpNTVISmVjeWwzeThTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Indicators of Iranian Regime Instability - Institute for the Study of War",
    "description": "Indicators of Iranian Regime Instability  Institute for the Study of WarIran’s Revolution  Tablet MagazineIran and the Limits of American Power  Foreign AffairsOpinion | Iran's regime has already lost its most potent weapon  MS NOWIran’s opposition is battling to oust regime but hobbled by divisions  The Washington Post",
    "published date": "Wed, 14 Jan 2026 23:03:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNaVZUUmhqVU5hN2xZR3N1S3h1ME9SSGdLVnJrTFVtaWg2S19BN0JyVDZlVFZnZWIwaVY4Zkpib2h2ZWdQNnFXbkViYW81UUN1THN1NjRzMmp5ZERnR1NvOGZhbUxVbDVLa1RsOEtsUUdTYjNicGdfSjY5Z2NFMWMyZEVVYWZ0VWRsbVFXZlczb2hIVW9WZVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://understandingwar.org",
      "title": "Institute for the Study of War"
    }
  },
  {
    "title": "Zelensky declares state of emergency in Ukraine's energy sector - BBC",
    "description": "Zelensky declares state of emergency in Ukraine's energy sector  BBCUkraine war briefing: Zelenskyy declares energy emergency as cities shiver  The GuardianPhotos show Ukrainians enduring a frigid winter after Russian strikes knocked out power  AP NewsRussian attacks cause energy emergency in freezing Ukraine, says Zelenskyy  Al JazeeraHundreds of thousands of households in Kyiv are without power after Russian strikes, as temperatures drop well below freezing  CNN",
    "published date": "Thu, 15 Jan 2026 03:35:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9rTDZOWm1hOVp5cXNUbHIzSTFicC1udHRzWmhxUUs5ZGdBd1NJSk92WkRYeWRIN25rTzZTMG54U0l4TEFMVkhOZ2tsZE9vZ1VSTkhnQ2lLUXpSQdIBX0FVX3lxTFBJejZtTmEwSVh0QUI3NFczS0RjY2Zmb0xMY3A4TW9zc1h1R1hiZTRpLXd3Y2RTWEZNLWtpV0dnaXNtWkM5NldObUZaUlFMTEJuZjZwQ2lVQ0tJUUQ0cWV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Peter Thiel makes his biggest donation in years to help defeat California’s billionaire wealth tax - Fortune",
    "description": "Peter Thiel makes his biggest donation in years to help defeat California’s billionaire wealth tax  FortuneLondon learned the hard way. Is California next?  Financial TimesGavin Newsom Vows to Stop Proposed Billionaire Tax in California  The New York TimesGavin Newsom comes out swinging against California billionaire tax  The GuardianThe Proposed California Wealth Tax Is Far Higher than 5 Percent  Tax Foundation",
    "published date": "Wed, 14 Jan 2026 17:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxQOEJTUGdxTTRSekNzQU9oRG9fTzFFcGg4aGZiWG1CVlZ6R1NCeUZud2dmc2FjVnAxUkh6WVlMY0VkcFZCakNveGVNYkpOSEd1WXI1RExTQ0I3N3ZiS3dJbUQyQ1d3bzdjYjdxc1NBd1dncmE4NFFMMW1BMGVaM0RydnpUVE55NU0zTG5zV1gxX19lTFpHM3pLOEN0dnhOUl92ZHFsWlh5S3VUd3pFRF8xOWFFQU5raTMzTEFyalI4MHBaUGppUW1PXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says - The New York Times",
    "description": "Boeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesNTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNA part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago  AP NewsNTSB says part on UPS jet that crashed was on Boeing’s radar  WAVE NewsBoeing knew of defect tied to fatal UPS plane crash in Louisville, NTSB finds  WDRB",
    "published date": "Thu, 15 Jan 2026 01:51:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9LOFNxc2QyLTMtbkZjMVpremhnYTFmSnNLeUZpbTlGdW5Wa2drZkhjRnY1Z0p2YzlMTExYeUtzUEx6d2dvVHRIVnVrUW9IUU83MWctMlpqWDc1QkJzTjlsaHNmcXgtSU8tci1URFczNTJpUzdS?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Goldman Sachs (GS) Is About to Report Q4 Earnings. Here Is What to Expect - TipRanks",
    "description": "Goldman Sachs (GS) Is About to Report Q4 Earnings. Here Is What to Expect  TipRanksGoldman Sachs is about to report fourth-quarter earnings — here's what the Street expects  CNBCWhat's Next: Goldman Sachs Gr's Earnings Preview  BenzingaShould You Buy, Hold or Sell Goldman Stock Ahead of Its Q4 Earnings?  The Globe and MailGoldman Sachs (GS) call put ratio calls to 1.3 put into quarter results  StreetInsider",
    "published date": "Thu, 15 Jan 2026 02:18:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQb19kaW5nMUN4SS1BdVNfajdKT2VNTEtvWG5VOUExcXk0bXVwc1ZCSzNiOUkzUG5hMkVoN0VGQllPZ1lRbnd6QThUOFJXUVBhNnZfcEtHZDJmcFBCZ1dBYUVuUDAxcHRhMmRmTXJ5aDNvTjV4XzBaWlBZaUl1cmxsS3dvcDV3WUVqU01fdVYzdlhGbUY5MzBpNnp4cUpMNk1FV1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "Tim Scott postpones Senate Banking crypto vote - Politico",
    "description": "Tim Scott postpones Senate Banking crypto vote  PoliticoUS Senate Banking delays crypto bill after Coinbase CEO opposition  ReutersCoinbase CEO Brian Armstrong Pulls Support for Crypto Market-Structure Bill  Bloomberg.comMyth vs. Fact: The CLARITY Act  Senate Committee on Banking, Housing, and Urban Affairs (.gov)Coinbase Pulls Support Night Before Senate Markup Of Market Structure  Forbes",
    "published date": "Thu, 15 Jan 2026 02:29:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNT1J2ZWh5ak5OSVJia09fc2IxMVczdVYzV01vVlZpaDZHbkNNSE5mV3U5UXpzNE5SLXdtQ0s2U3JxM2p0VktWakZfVy1GTnpOOUt2dFlmaW9yOFFmZnJwOUp2U2tKaDZxa2NlQm40OWE5V0J6THpuc203MUNTQ0lsNkU5LW9Gb2FKYm5FZmxkZzB1X2d1WXAtVGpxVUprX3BQZHBwX0daZHFBZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Musk and Hegseth vow to “make Star Trek real” but miss the show’s lessons - Ars Technica",
    "description": "Musk and Hegseth vow to “make Star Trek real” but miss the show’s lessons  Ars TechnicaHegseth’s vision is more Starship Troopers than Starfleet Academy  The Spectator‘Making Star Trek real’: Elon Musk reveals futuristic vision for SpaceX  The News InternationalElon Musk Wants To Make 'Star Trek' Real Without Everything That Makes 'Star Trek' Great  Jalopnik\"The Vulcan Salute\" — Elon Musk and U.S. War Secretary Hegseth Wants to Make Star Trek Real  Yahoo",
    "published date": "Wed, 14 Jan 2026 23:43:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPVmVMX1N4a1NIRUJ2VHExbU9FYV9rd3piYnNYZ3prWktFbXM3UmtUQmFKaFpaZmVkTFczTVlNR3VMNWhzcjVBeDU1QTF3d3lmc0RuVkEzVEUtTmFoUF9NSFhqTVNJUFA0VUItZ1NqOW9CRV96VnBLQVNsc0RwYnBUMkh5LU9JM1prb3RUU3J6cWxmXzZLNTF3d3FYZ1NERU9uSEswUHJqWUlia0ozcm80YlNNRC14U0R2TFdnSmYzazRhc2Q3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Most Downloaded PS5 Games of 2025 Revealed, as Xbox's Forza Horizon 5 Tops Ghost of Yotei - Push Square",
    "description": "Most Downloaded PS5 Games of 2025 Revealed, as Xbox's Forza Horizon 5 Tops Ghost of Yotei  Push SquarePS5 And PS4's Most-Downloaded Games Of 2025 Revealed, Including A Call Of Duty Surprise  GameSpotNBA 2K26 and FC 26 Top the PS5 PS Store Download Charts in 2025  VGChartzArc Raiders Tops The Charts While Battlefield 6 Drops In PlayStation's Top Games Of December 2025  Yahoo! TechPS Store December 2025 Download Chart Reveals Arc Raiders, EA Sports FC 26 On Top For PS5  PlayStation Universe",
    "published date": "Wed, 14 Jan 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxONWZaUlVEWjhDR00zX1F1NkwydjBBM2tEZFMwY2pYX2lMOVhRQzA0dnVrQXJEM2QtejFXamZBTjl3WUdvcEZLMlV4MFFfV1Z0RmE5WmVXVGRFelR3TW1YMER6ckVoTURMMXBsUVI0YjZSU3g2RFJ4QjdYemt1dFg5NzlDQTFrQTdneEZNbEMzZkpnMFVvQ1o4bFYtbk5WdG1SN0ZsdGFNV2pqSmlQOVIzbHVKSWJhclJ0eUtkY1pJNDdycWI5YkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pushsquare.com",
      "title": "Push Square"
    }
  },
  {
    "title": "I TRULY Was Not Prepared For How Hard I Cackled At These Random People Who Dropped The Funniest Replies Out Of Nowhere - BuzzFeed",
    "description": "I TRULY Was Not Prepared For How Hard I Cackled At These Random People Who Dropped The Funniest Replies Out Of Nowhere  BuzzFeed",
    "published date": "Wed, 14 Jan 2026 16:20:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9kcjUyYnFNTHRjRzF1WTVmSDdWT1RWTjlSYVU5ODJJODFQUUVBWm5aMS16ODFKaUJDNlJMczZaWVNTQUtuWi1EVlQ1b2daSm4wd043aWtkd2g1QTFxSVkyeGowR1FRX3Z0NFdLUFZ3OTF5Y283eWhkRU10TEtZN0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Here’s Why This Year’s CES Proved AI Has Changed Everything: A Look at the Biggest AI Announcements at CES 2026 - Wccftech",
    "description": "Here’s Why This Year’s CES Proved AI Has Changed Everything: A Look at the Biggest AI Announcements at CES 2026  WccftechNo Gimmicks: Check Out the Category-Defying Tech Highlights of CES 2026  MotorTrendThe five new gadgets I tried and loved at CES 2026 (that you can buy right now)  The GuardianWe tried CES 2026’s best and weirdest products, ask us anything!  The VergeTech We Found at CES That Could Change How We Move  Autoweek",
    "published date": "Tue, 13 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxON29WZFF4TWM5YmtzRkJGTjBjbmd6NGgyUTN1YWdUYW9MV3d5U3kyeG9UTEM4VXMtYVRfTDFLSS1Gc3E0bzAwckREZ1Q3WmxMZHh5TXVRcEFPckQ4ZW52bnhTNXZ6ZmdoY3paV2lUNzBleWt1X0dpZlYzZFJLMnAtWDBnNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wccftech.com",
      "title": "Wccftech"
    }
  },
  {
    "title": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office - The Hollywood Reporter",
    "description": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office  The Hollywood ReporterMichael Wood · At the Movies: ‘Marty Supreme’  London Review of BooksTimothée Chalamet’s ‘Marty Supreme’ Gets Streaming Date, Report Says  ForbesMarty Supreme and the cost of ‘dreaming big’  DazedHow to Serve Like Marty Supreme  The New Yorker",
    "published date": "Thu, 15 Jan 2026 00:01:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNVnJ3UEVhZmtvWVpUWTkwTkhWV2NfamRFMlNPZEpzdjZqY2llYjB0b19zLUoxRWhldGFkNk40SWM0UUR3UFJURXhmOEJmbjJWUmxrOEdXUVZ6bEdPaDFub0tUeXdLMm1QdFV0a0o5ZjQ3M1liNk5GSklxRDlqdXFMYnJpWEU0YXpnc2FseURQWldsaWRfMUJudlZmN2hMVllGSW16aXR6Zjc4emZMMGFxamtoTHVIMVQtZnlVSTY5ck00Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Evan Peters Says He Was “Shocked” Jessica Lange Is Returning to ‘American Horror Story’ - The Hollywood Reporter",
    "description": "Evan Peters Says He Was “Shocked” Jessica Lange Is Returning to ‘American Horror Story’  The Hollywood ReporterWhat Evan Peters Says Is the Most “Exciting” Part of Having Ariana Grande Join American Horror Story  E! NewsEvan Peters gives update on ‘American Horror Story' with Ariana Grande  NBC ConnecticutEvan Peters shares real reason what drew him back to ‘American Horror Story’  hungamaexpress.comAmerican Horror Story season 13: Evan Peters on Jessica Lange return  CarterMatt",
    "published date": "Wed, 14 Jan 2026 01:08:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQSWlzUHFPSGpwRU5NUklEdzVLemJXTWV3UEw3Yk5WM01wazFCMlN1eXY3N05rZ1FBRi0zdnhWeHgwWEtWV2J4ejlzQXktZkRHNFNuenRuclRvck9nN1FIaGxVbC1OVE4zRTF4S3gwcm5rbjcwX2RmYjcyTWd3NjZFbmVYSW5wZmFvZXlMWC1TLTVhMUJyRzc4bnRac1pLNWFHazdtWmlUczZzWEFrSW5TRGU3MUUwSVpGcnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "‘God of War’ Live-Action Series Casts Ryan Hurst as Kratos - Variety",
    "description": "‘God of War’ Live-Action Series Casts Ryan Hurst as Kratos  VarietyRyan Hurst Cast As Kratos In Prime Video’s ‘God of War’  DeadlineAmazon didn’t have to go far to find its live-action Kratos  The VergeThor Actor From God Of War Ragnarök Cast As Kratos In Live Action Series  Game InformerGod of War Show Finds Its Kratos in Ragnarok Alum Ryan Hurst  IGN",
    "published date": "Wed, 14 Jan 2026 20:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOekpQZnQyeGV4TVY1dGRKS251X3lISzdLaDl4ejYwelloSFBhOGd5QnptUW5DTFliOE1kRGJpcWlodHBFRzJISUtSa2pLSXlSWFJRT0pxbm1mMVZkaGlLN056TzhSdHQ1YkZVNjdWN3dqZEp3TnRXSkliSDRsRTdsSk1wWmx2TTFQMVlaUjI4Y1hCcmlvbmMzanBLeWF4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Golden Globes Hit 8.7 Million Viewers Amid NFL Competition - Variety",
    "description": "Golden Globes Hit 8.7 Million Viewers Amid NFL Competition  VarietyBest and Worst Moments From the 2026 Golden Globes  The New York TimesThe Golden Globes were calm, scripted and largely apolitical amid a world on fire  CNNAudience for Golden Globe Awards telecast drops 7% from last year  Los Angeles Times‘One Battle After Another’ and ‘Hamnet’ Take Best Picture Prizes at Golden Globes  Golden Globes",
    "published date": "Wed, 14 Jan 2026 02:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQMm1WaFR4WXJRdENHQXMxUkFxZmV6Z2JPY1daREJJOEhJRXI2M1VIVlVlSjRhT0NtRTdIWVpEYzVQclZkeVp5NExXbjZua3Awc3FrbW42TENibWE2eTVFQmdoOUVtbjhZRlczZDk3TkJSeGM4ejROTEVoSWhXMmtEWVhrYUFxNWxZRjhZUG5aX2NsZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Bulls 128-126 Jazz (Jan 14, 2026) Game Recap - ESPN",
    "description": "Bulls 128-126 Jazz (Jan 14, 2026) Game Recap  ESPNJazz's Sensabaugh nets NBA-high 21 in 1st qtr.  ESPNVucevic's layup helps Bulls overcome Sensabaugh, Jazz for 128-126 win  CBS NewsUtah Jazz player grades from a near miss out in Chicago  SLC DunkJazz's Brice Sensabaugh is 20th player in NBA history with impressive points record  Yahoo Sports",
    "published date": "Thu, 15 Jan 2026 03:56:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE5zckNhZVZkNmdDY3ZqeW5YeFFnRVJ4cUtDbnc2N1JPdTNkdUVsTHpfVUxFMnJRRmd3M3VDY3dLM2cxRjFOT0pXWm9SWkFtTThOd0ZQYmxIdVNQNTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Lucas: Stanford Rapid Reactions - University of North Carolina Athletics",
    "description": "Lucas: Stanford Rapid Reactions  University of North Carolina AthleticsStanford 95-90 North Carolina (Jan 14, 2026) Game Recap  ESPNChansky’s Notebook: On the Coast  Chapelboro.comWill UNC basketball be able to limit Ebuka Okorie? Prediction for Tar Heels vs Stanford  The Fayetteville ObserverStanford, Cal brace for visits from Duke, North Carolina and their blue-chip talent  San Francisco Chronicle",
    "published date": "Thu, 15 Jan 2026 04:38:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQaTFDMGxCZDlYTnp5QjJWTE1scWl4cUQxbGJWbThJTk1mMU9TemdEbl8yUzlNNm1naUFPS082eGs4WTlFVy1CNlVmRTlPR3NIR205RDQzQS1IM2wwbjVSWlpMR3paS0tkWGthc3k2WUFMWktTVGxSb1V6M0V6X2h4TVd3ZjdrUlhq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://goheels.com",
      "title": "University of North Carolina Athletics"
    }
  },
  {
    "title": "Ben Johnson says Bears need to step up their running attack - NBC Sports",
    "description": "Ben Johnson says Bears need to step up their running attack  NBC SportsBears vs. Rams: Looking back at 1985 Chicago Bears' victory over Los Angeles Rams on way to Super Bowl 40 years ago  ABC7 ChicagoBears vs Rams: Time, date, channel set for NFL playoff game at Soldier Field  NBC 5 ChicagoNFL divisional round confidence picks: Chicago can upset Los Angeles - The Athletic  The New York TimesBen Johnson: Bears run game has 'dipped a little bit'  Chicago Sun-Times",
    "published date": "Wed, 14 Jan 2026 21:30:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOeHFWY1ZkOTVYYnNnUXNZblhUS2VWakpmeXQwTHlwMktjb0JUUVh6MXVSamlySXdxY00wbWFRTjF3WlRpMmJOVWl3NTF0X2xJY1BNRE5xN3FPelp0cnhpM2ladWVVUFk4X0JBb1ViRG9nbUJSN1c5TnpwdWVlajZwSGFGd3Q3d0xQZ094djljTVp0ei1ZRTVLSHc0ODFtdldrVnJQMnFLRS12Um9tUEczWXRBY0l1WGc1OWd2NXJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Senegal 1-0 Egypt: Sadio Mane’s late winner sends Lions of Teranga back to AFCoN final - NBC Sports",
    "description": "Senegal 1-0 Egypt: Sadio Mane’s late winner sends Lions of Teranga back to AFCoN final  NBC SportsAfcon 2025: Sadio Mane and Senegal get the better of Mohamed Salah's Egypt again  BBCMohamed Salah exits AFCON with unfinished business  The New York TimesSenegal 1-0 Egypt (Jan 14, 2026) Game Analysis  ESPNSenegal 1-0 Egypt: Africa Cup of Nations semi-final – as it happened  The Guardian",
    "published date": "Thu, 15 Jan 2026 04:12:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxObUV4czdDcGFEcDR0TE1uNkdGZGViTFUyN3FwLUY5SWJua01CbGZfdE9NOHctUEwxa3JtbjQ0cXZsNi1BRXBUZ0lxNy13VXc2cTM1cUZLNjhubEFILXBqa24wbEozQXpyblJwc01mUDVoanlnQl93R3A3S3AxSXFId0xSSXViVHM4VHpDQXk2ZGJEN3VMcG1NT3ZIaUNFVEpBMndXcUVGeWlLdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "description": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch  Spaceflight NowSpaceX  SpaceXSpaceX launches Starlink 6-98 mission from Cape Canaveral, Florida  Florida TodayStarlink satellites lift off on SpaceX Falcon 9 from Cape Canaveral (video)  SpaceStarship launch infrastructure progress at Starbase/Cape ahead of 2026 Launches  NASASpaceFlight.com -",
    "published date": "Wed, 14 Jan 2026 20:27:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNalQ2VWJ5VEV3MzQxLUJOUUdBb2F3WTZLWTJzNUFLb0VMTmhCUkRKNHYyRmt4VTF6N2ZrT3ZJYTFsVVNXYWVtalR6c2RtdmZrc1JSdGZ2c1RFYTB1dTFyeUhsdS1KMlNtaF9YUEV6SXJzYVZRN3oyeG5XanBVWkVtTGRpeFNEeU5HbDBuMnAxOW9lYml2ZVk5S2hjRFltdl9EeW1HdnJMMnlRTHRBdXJWdjc3NVhoTENVcm0yMHQ1dUduU2tEZU9wR0FzeG16UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "From a new flagship space telescope to lunar exploration, global cooperation – and competition – will make 2026 an exciting year for space - The Conversation",
    "description": "From a new flagship space telescope to lunar exploration, global cooperation – and competition – will make 2026 an exciting year for space  The ConversationSpace operations will become more dynamic this year  SpaceNewsThis Week In Space podcast: Episode 192 — Space, 2026!  SpaceWhat will define 2026, according to leaders in space, healthcare, and AI  fastcompany.comOrbits Of Influence: Geopolitics, Technology, And The 2026 Space Wave – Analysis  Eurasia Review",
    "published date": "Wed, 14 Jan 2026 13:29:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPdE92eGZBMlRSNUhqR05QcWtGdUptUG13QWgzcExZNmdiRThENFF6bUZWZy1QelIyczFUSGw2MXF2LUs1QWhPaWRNX1AzNThqUnFQbG55N0lPSU9JMDhFS3NHYVBuc1JJZWVTczhibTExNnNtS25xMWx1d2FjcUg0dW9leHVnZEZobHNXcmtuMmlySDFyU3dWVFB1Z2M3UnVKSFZERy0wUkVGVDNVSHRhUDlXUlNDTmJNbk5RZDl1OEFqR3ZOQTVVdzlzQWZPcnlKVlpXb25xWWV2M1BGZFdoV0tVbUROdkl0azRWNFEyaXAzWFZZdE1oUEkxejE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "NASA Deploys Orbital Telescope Designed to Do Something Incredible - Futurism",
    "description": "NASA Deploys Orbital Telescope Designed to Do Something Incredible  FuturismNASA’s Pandora Small Satellite Launched  NASA (.gov)Twilight Mission  SpaceXSpaceX launches NASA's Pandora exoplanet mission, 3 dozen other satellites (video)  SpaceNASA’s Pandora telescope will study stars in detail to learn about the exoplanets orbiting them  The Conversation",
    "published date": "Tue, 13 Jan 2026 19:03:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5haG9vYlZyQU5tMVRSWDV3VVdkVThRZnBWblJ3QVN5c3ZNdU1XVU91ZVJJcEp0b3pKT1JkV2I5WlNvb0szVVB6RkJyQjZhLTh2SnBDTkp4X1VXN3Vzd0NLZW1hLU9iYlA3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://futurism.com",
      "title": "Futurism"
    }
  },
  {
    "title": "Enthusiasts used their home computers to search for ET—scientists are homing in on 100 signals they found - Phys.org",
    "description": "Enthusiasts used their home computers to search for ET—scientists are homing in on 100 signals they found  Phys.orgFor 21 years, enthusiasts used their home computers to search for ET. UC Berkeley scientists are homing in on 100 signals they found.  Berkeley News100 mystery sounds under review for signs of extraterrestrial life  Popular ScienceLargest crowd-sourced hunt for alien intelligence reveals 12 billion 'signals of interest'  Live ScienceAfter Arecibo’s collapse, scientists revisited 100 possible alien signals  Moneycontrol",
    "published date": "Tue, 13 Jan 2026 19:07:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9wQkpDRk5Uc1Uyb2JiMldjeExWMlh0R0NyYmpLNzFuOXhEb01uQ0t4aWhXc0dKVHpxNjczTE5ROTNNOG9PWExWOFhETWt1LWtJT1RRS0dONzVoZjU2eWNyZDNlQXd1THU4bmRONm8yOXpYbW8wX2Fkeg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "description": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined  Ars TechnicaMeasles cases soar in South Carolina, top 400  CIDRAPNearly 1,000 visited SC State Museum on day of possible exposure  FOX CarolinaMore than 100 new cases reported in S.C. measles outbreak  Live 5 NewsSouth Carolina schools face measles risk as vaccination rates drop to 20%, state epidemiologist warns  Reuters",
    "published date": "Wed, 14 Jan 2026 23:08:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdGpYdEFIa3FjazU5ZDZuRkNIYU1RbjZYWU54MmdQUjlkVnBCNkFFMHdQek9TekFORTNrZi1hSUpXUGJrV25ZaDFlWE9LWkM3SWY0OVZMb0tRUlFfVWNIX3kzb1gyNERUNkh5TGpWcmh5OU56ekhnbERiMExLazR5V0FfZk9QY0ZRaTRFc3pDTzJRSURYNEZZZnhuVDlQR1dhQU9fN2hjWVEyZVFLWjlKajVoOFFVdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "At least 171 measles cases confirmed in 9 states: CDC - ABC News",
    "description": "At least 171 measles cases confirmed in 9 states: CDC  ABC NewsHuntsville pediatrician speaks out as measles outbreak threatens US elimination status  WAAY 31 NewsMeasles outbreaks a concern  The Sylva HeraldMeasles cases rise as vaccination rates decline  EBONY MagazineBeneath the Surface: How to recognize and diagnose measles  Healio",
    "published date": "Thu, 15 Jan 2026 00:43:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNQ3gtTl9UMmdxSVpDUWY0M0NDcDNIYVp0T251bjBfM3FsN3VNLUtiUjRUdU5nWEY1dUdPY0oyNmlFYzVTWXQyWGVlZlZBTGxyM1hVR1k2MjEyMXREb25FVXhUSkpIaFVlUmFOVjlKSmc2R01QT2xIdmhIWlo5eG5GamtZejJkN0NfLUtSdENqZjFJT3fSAZgBQVVfeXFMTjJkd0pUVFFYbE1VTmlxUnVTOHpXU05rLXZSRFJtLXpSN1kwN0ZFc0xWSTdhMDFfcDllT2FTNmljeGoyaGM2NWpHNUZEa0x3eWVFWk5EQ3VJak4zeXNMeklqOEYwNFhZNm1HOUpBQzIyTFJ2M0hza1hNaU91dDdWREpUd0ZlM0xGRmFqdkoxcmRpbHRZcEdCX2E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Medical Groups Will Try to Block Childhood Vaccine Recommendations - The New York Times",
    "description": "Medical Groups Will Try to Block Childhood Vaccine Recommendations  The New York TimesHealth officials slash the number of vaccines recommended for all kids  NPRCDC Acts on Presidential Memorandum to Update Childhood Immunization Schedule  HHS.govRFK Jr.’s theories about vaccines are about to be tested  PoliticoNew CDC Guidance Could Revive a Rare but Deadly Disease  MedPage Today",
    "published date": "Tue, 13 Jan 2026 16:13:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcmQ0ZHdmdVlLOTBhTW1aTWJYR2dBdDh2VGt3d3Rob2Vnd2Zac0hjVTVfc3FiQnBhMTlzWFVqQTJKR3FHa2VxQ2xPY3pINkJ2a2s1Zzh1eTRWRkxvT2YtQlc1UkxlMUpMSl8tQjVHS1lpVU9qamZsSTFzLVQtcFVHck1pRkZ4QVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "description": "Patches of low vaccination in the US are becoming bigger, riskier holes  CNNVaccine exemptions for religious or personal beliefs are rising across the U.S., data shows  NBC NewsNonmedical Childhood Vaccination Exemptions Are Climbing  MedPage TodayMissing First MMR Vaccine Most Significant Predictor of Nonvaccination by Age 2 Years  Infectious Disease AdvisorRising Vaccine Refusals in US Children Increase Measles Risk  Букви",
    "published date": "Wed, 14 Jan 2026 17:33:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZVplRzZNMjRhQi12ZndfLWx3V001YlFnSWJjZWg5b1k2R1RRd0hJY2U3UHFTNk1iWmhLT19VS2RrNENkdC1MNzlyZHJiQVVYMUxnSmJ4M3BvUHdSUGd0WXlkRkRPQ3FEN3hvNkVYV1BrcGFidFhxRzRNd2w5dWJXMll6Tm1Tb1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  }
]