[
  {
    "title": "Appeals Court Lets Trump Revoke Deportation Protections for 60,000 More Migrants - The New York Times",
    "description": "Appeals Court Lets Trump Revoke Deportation Protections for 60,000 More Migrants  The New York TimesAppeals court backs Noem move to end TPS protections for Nepal, Honduras, Nicaragua  foxnews.comNinth Circuit backs Noem's removal of protected status for Nicaragua, Honduras, Nepal  Courthouse News9th Circuit allows Trump administration to end TPS protections for Honduras, Nicaragua, Nepal  San Francisco ChronicleUS appeals court lets Trump continue ending deportation protections  Reuters",
    "published date": "Tue, 10 Feb 2026 04:10:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQNHl2YXFHdFliQV9xS1VXUm5xZmxyVFpIR3RwR2ptT1BKRFdlQTRiRXltdGZneUtSalcwNC12Mjl6RlRMcVoxSlJIOV9rUXhHbGRHLXJOZEs1cmcybGRBMy02ZmMtNl9CVWdPUWw0cXpkR2g1U2FOZEotRGhTTW9GcVdnajRmMzJSeDE2UG1pa3Rwa3liQVpFa1dsWWhNa3I1Y3ctSm1ETGhFdkdxc0JWcXVGSTk1TVNlUjFHczZDekpXc1F2T2NIc1dTdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "House approves housing bill, setting stage for tough Senate negotiations - Politico",
    "description": "House approves housing bill, setting stage for tough Senate negotiations  PoliticoHousing affordability package set to advance in Congress amid home-cost concerns  CNBCHouse overwhelmingly passes sweeping bipartisan housing package  The HillComparing the ROAD to Housing Act and the Housing for the 21st Century Act  Bipartisan Policy CenterHouse passes bipartisan housing bill as Trump zeroes in on affordability crisis  foxnews.com",
    "published date": "Tue, 10 Feb 2026 00:20:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOam81Q1UyMmQ4akVSSEllWDJKSVFNcTBBSmlkRlVxdzhJUVpzZTVGVnVRTzVJdHdyMFd5MkNpRnh5bV9DR0tiVDV2NVN2Zi10aUhOUU03LTRJalRCQ3lIaW9JUElNVUpWajRocWg5bTl3VW5ORVdLSF9UOFlDVVVudjY4TzRfYzREWlU3RFR1MWZST29TMEJRZlVSNzVyOWYtVTVLWVRFNVRwWVBTQTAtaTZWNXdnWVF2VGM4aWhrWGRGcV93X0NaenBwalFFaFczOUZPNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House - ABC News",
    "description": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House  ABC NewsMd. Gov. Moore uninvited from White House bipartisan dinner: 'Blatant disrespect'  FOX 5 DCTrump to exclude Democratic governors from usually bipartisan White House meeting  YahooWhite House to host the nation’s governors, but only Republicans are invited  MS NOWWes Moore suggests race may be why he was not invited to gov dinner with Trump  Politico",
    "published date": "Mon, 09 Feb 2026 19:48:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOdlFUdTNqUm91MjBUTUlTSjZxWWQwaDhfQ3lfczFFc3NDMlNIMXFtelhFR1VndXE3VUFBZVBaTEMtWFRRaWVPQ1E1WGZfOXMxU0JlaC1saEtUSzAxX1duNmY5NUswcWtMT2RTM3gySWRPd0w0bEVVZU1fY19sal9jcnBJNjJ5MmFLdU13dUt0bUdGOTk4STctQVBKNUxwSzJwNXAxcVhhclNqZmhtRGpsb0k3UExwYkHSAbwBQVVfeXFMT1gtRjM2QjZXeTZaV1c4V0hEYmE4VDd4aUJwTXBKWnBVM3RldUJVTGZadVNMalZqNzl4N3dEZ2lBUzVvQ1JQNGdQSExHNF92dEVZaWx1YllfaV9mTldtNzhsQ3VQaUFEYk5OV2dlTjFNUXdUQlpBbFRIUUF3clcyREVWWTB0dzFlYmVvZGdNdjY3NThhTlNLVUlCcGR6VEVFWi1JM19Rb0t0czJVYzNfc2duREROQWxrclo4TUo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "SFUSD teachers are on strike. Schools closed for 50,000 kids - The San Francisco Standard",
    "description": "SFUSD teachers are on strike. Schools closed for 50,000 kids  The San Francisco StandardSan Francisco Unified schools closed as teachers begin 1st strike in 47 years over pay and health care  ABC7 San FranciscoThese are the ugly facts and truths that are being ignored in the battle over SFUSD  San Francisco ChronicleSan Francisco Teachers Begin Strike, Closing School for 50,000 Students  The New York TimesSF schools to close for second day as thousands strike at Civic Center  SFGATE",
    "published date": "Tue, 10 Feb 2026 00:16:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxObE1mSEhWZzBWQ25VZU0yVWlJazFDMUNmWmlnUkRHajNYcnZEejB4OEs0VlA1TEJZb3h2bVREc056SnI3X1FnLWxKMExIYjFucmREaXVTNGJRUlJQNUY0NG5wS1JsQk1CdWJLcF81VldHdzJ0OUI5cXl3Q0t3V2hKVzJHSzM1R1ZPR0x4eFFadTN3ektWSFZENEI0MmJRbTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sfstandard.com",
      "title": "The San Francisco Standard"
    }
  },
  {
    "title": "Here’s What a Warm Night Looks Like for Homeless New Yorkers - The New York Times",
    "description": "Here’s What a Warm Night Looks Like for Homeless New Yorkers  The New York TimesExtreme cold in New York City leaves 18 dead  BBCExtreme cold: Sanitation Dept. works to clear snow; Citi Bike stations blocked by ice; School delays due to subzero weather  ABC7 New YorkOutdoor death toll in New York City rises to 18 amid extreme cold  ny1.comAt least 18 people now dead as historic New York cold stretch nears end  The Guardian",
    "published date": "Mon, 09 Feb 2026 23:53:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNRXpIMlpxZ3JZOFlPUDNCcE1zZUhFa2RiaUh0aWZ0UWlkczZYam1jaGNSakhfVVJxLUlqdFhiZkxJN1d5TnNZeUlldDc0UzNseGxEenNPZjZsTnJfeld2QVU5enJXYTlqR2h1QnNqRDcxVnkwUUtzNkRQNmlPdUJJVjIzajM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests - The New York Times",
    "description": "Newly Unbound, Trump Weighs More Nuclear Arms and Underground Tests  The New York TimesThe world’s top nuclear powers have no arsenal limits, here are the countries with nukes  foxnews.comThe Real Reason Trump Wants to Let Our Nuclear Weapons Treaty With Russia Die  SlateNew START ends. But a one-year extension could bring many benefits  Bulletin of the Atomic ScientistsScoop: U.S. and Russia agree to observe New START nuclear pact after expiration  Axios",
    "published date": "Mon, 09 Feb 2026 23:46:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdkR5U1RKaERQUzc2bkFoRjZuY1NSS0xKVU1YblZjQ0dGcEFKY3lTeFVCV2tKeUhnemI0UmpIU2xYZFBxanZsNTcySzR3eVA3c0xjV05RdWVrb05jUVNRRlFFaHJEWnNONmttVWhoX2xOSGdjTFdOX3VKOFF6X0dzUmNWZGViX1prcGlFLUVVbGJBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm - AP News",
    "description": "Trump’s immigration crackdown is straining federal courts. Judges are raising the alarm  AP NewsJudges are regularly threatening contempt charges against the DOJ in immigration cases  cnn.comHow the Trump administration skirts — and defies — court rulings on ICE detentions  PoliticoImmigrants challenging their detention have hit a historic high. Here’s a look at the increase.  KSATMore Immigrants Are Challenging Their ICE Detention Than Ever Before  ProPublica",
    "published date": "Mon, 09 Feb 2026 18:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNWXdRQTdONzFxWVYwOGJuUlVEV1RiR0NDUzVTTnhVQUpVbHBRTU95QmtMYURWb1ZzZUU2bWQ4ajVJTW83SVo1Ty1Mc2xmc1B3LVBYb2x0RDBJb2VLUWFTa2J0bFo1Q3ZDZXZJSlNvbmVJcjd4NE40NWRKSFVKZTRhZjZjbjlZcHpBUm96alFMYjBCbUYya180VVpWNFk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Sheen beatification confirmed; date and place remain TBD - The Pillar",
    "description": "Sheen beatification confirmed; date and place remain TBD  The PillarU.S. Archbishop Fulton J. Sheen to Be Beatified, One Step Away From Sainthood  The New York TimesFulton Sheen: From popular TV, radio priest to saint?  NewsNationBREAKING: Venerable Fulton Sheen to be beatified  EWTN NewsFrom Emmy Awards to Exposing Communism: 11 Surprising Facts About Fulton Sheen  National Catholic Register",
    "published date": "Mon, 09 Feb 2026 18:11:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5jUnRtLW9mS1ZORjFYZnJRODdCSlp2RXhyd0ZQRDNlYjNTWW5SMFBWNzdQWWtncE5wU2FlZzFXUHJoTmVRR3dzWm52OGQ0N0Jnd1J5akxCWEhxN25UOXFFS0hBNTMyMEMwSnZ0ckMxSkxuLU5ITmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pillarcatholic.com",
      "title": "The Pillar"
    }
  },
  {
    "title": "Immigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say - cnn.com",
    "description": "Immigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say  cnn.comImmigration court puts an end to Rümeysa Öztürk’s removal proceedings, her lawyers say  The Boston GlobeUS judge blocks Trump administration’s effort to deport Rumeysa Ozturk  Al JazeeraJudge rejects Trump administration effort to deport pro-Palestinian Tufts student  The GuardianImmigration Court Drops Case Against Tufts Student Rumeysa Ozturk  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 03:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNV3R1UkFrWWhZZDhhUHhIY01FVzZyMjJoWmZvdGV0SmJ2dm9uc3RvTEZLempiOE56NFJLX3JLalpXZnRYd2JKS25xbHdHOHlqcFRJSkFNeVdqcVU4R2h4Q0FSZENOSm9Ua25QWl85QkVDSW4yNE9iQWxDMFdUSHBfNTN3Y3FvZ0tI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Air Canada suspends Cuba flights as island set to run out of jet fuel - Yahoo! Finance Canada",
    "description": "Air Canada suspends Cuba flights as island set to run out of jet fuel  Yahoo! Finance CanadaAir Canada Cancels Flights to Cuba as Cuba Runs Out of Jet Fuel  The New York TimesAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  cnn.comCuba says international airlines can no longer refuel there as Trump turns up the pressure  CNBCRussia warns Cuba fuel situation critical; Havana slams ‘cruel’ US tactics  Al Jazeera",
    "published date": "Mon, 09 Feb 2026 19:17:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNeVJ3aUFDM0QwOXJVdExQQjN6NzF1em1UTDE4N1EyVzkyVDJ6YzBrV2xZMnF0Rm8wN1N0aEQzZ2Q1LVlCZ0ZWaDJQMVM4cjc2bUxVc1phb3lnRWg3ZUl3Uk0zZ2pra2pHRGx6X21TWXRYV1FIZElPa093SFpMMXN0ZUtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.finance.yahoo.com",
      "title": "Yahoo! Finance Canada"
    }
  },
  {
    "title": "Thailand election: The result the polls never saw coming - BBC",
    "description": "Thailand election: The result the polls never saw coming  BBCConservatives Surge to Surprise Victory in Thai Elections  The Wall Street JournalBhumjaithai Party's election victory signals shift in Thailand's politics  ABC NewsThailand’s Conservative Party Claims Surprise Election Victory  The New York TimesThailand’s conservatives win a shock big victory  The Economist",
    "published date": "Mon, 09 Feb 2026 23:58:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5EUHRtT1N1RkdUUmtPNGtEOVZFUDZUdFNGem56VzZiUEZYd2x6SWEwdWJtYndCRVhDZlIxUUhzQ0tMX3FHU3lUeF80NlVTa1l1VkZ2dzRpY2Fodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "China to support 'reunification forces' in Taiwan, go after 'separatists' - Reuters",
    "description": "China to support 'reunification forces' in Taiwan, go after 'separatists'  ReutersIn Beijing, Taiwan's KMT echoes Xi Jinping's 'national rejuvenation' call  Nikkei AsiaTaiwan’s political friction is a boon for Beijing  The TimesMainland stresses advancing peaceful relations across Taiwan Strait  news.cgtn.comChina mulls action on Taiwan elections  Taipei Times",
    "published date": "Tue, 10 Feb 2026 05:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOaFdqMUthemN4QVRoT3I0Z3hXMDM2M0xFVXlpSlB2X0lhLUtJVzA5RS1LdDhsdmxuTHlRaWx4WkZnN2JlR2xINXQwcng5RkpMalh3WHYwcGpwbGxkQlBPMnBUVktWeVd4QkdYa0wtcjlXYTR5dWRxdUdSZGIzelNMcVd6ejBKTFBTYmU0cWxsMFBQbnZFS3Y3THMtd2FKampVTjlxN1puSWlvWUEteXJ5Ty1YSzJyQldiOTBkR1JGcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump Is a Global ‘Wrecking Ball,’ European Security Experts Say - The New York Times",
    "description": "Trump Is a Global ‘Wrecking Ball,’ European Security Experts Say  The New York TimesTrump's world order hangs over Europe on eve of key defence conference  BBCEurope’s ‘painful’ realisation it must be bolder with US set out in security report  The GuardianMSC braces for more of Trump's 'wrecking-ball politics'  DW.comTrump the ‘demolition’ man of world order, European security experts warn  cnn.com",
    "published date": "Tue, 10 Feb 2026 03:59:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQQnVOQ2VNSGw3Vk0wMGlsTmtPZlR4T0tQT0Y0X0FNUUdZOVEtWG1GUUkzREU3a0s1b3JrV2xST2VIQV9hYWpFdjRoUVQxNmk5Z2lfMzlPdXFxbm1WekxQd1R0cGc3SXlHUS1qN2t1bmpLSUNad2JMRmwxbldtS0lUVDY4Z3B0Y0l2emZ0WFUxX2FqS3hzMmNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump, Netanyahu to meet Wednesday in Washington - The Center Square",
    "description": "Trump, Netanyahu to meet Wednesday in Washington  The Center SquareIran warns of Israel’s ‘destructive’ influence on diplomacy as Netanyahu set to fly to US  The Times of IsraelNetanyahu to hold urgent meeting with Trump Wednesday amid Iran negotiations  AxiosIran Update, February 8, 2026  Institute for the Study of WarNetanyahu wants Trump to demand more from Iran. The leaders will meet this week  AP News",
    "published date": "Mon, 09 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQaElGdWw3OGtWNXl0R3dfLW1icTFLdXgyOEx4OFBWWUtCQ2N5dEV1OUJwYnhXc2U0aXlYaWdFbEtkdDlrRmt1SW5fQzBZZFNMb09wazdOc1BSd3BtV0x5UThTMy1OSEhSQXhPckJtZHh2dkszYTZKcVNWVjZrRGprcUl1bUs5Sk83VUVLcFVObUEwRlhi0gGaAUFVX3lxTE12aFNhMVlWVFAtOVBRU1BtWXVjUkJBYlZTdnlscHJDd0xlamhsMEg4eEhWaWU2QWlOUmZSbmduVmp1bUxzYnNVS1R2RFhoNWNmUHRPTkUwVjBXTENYa2x2YlNNMWRNa3ZsWmtGU1YycDhFUmpwS2lGQk9zaU1ZOTdvYTJncm1JRV9kVkVLWk41U0VhWGpwR3RYdnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecentersquare.com",
      "title": "The Center Square"
    }
  },
  {
    "title": "Memory Chip Squeeze Wreaks Havoc in Markets, With More to Come - bloomberg.com",
    "description": "Memory Chip Squeeze Wreaks Havoc in Markets, With More to Come  bloomberg.comMemory Chip Squeeze Widens Gap Between Market Winners and Losers  Yahoo FinanceTracking the RAM Fallout: Why 2026's Memory Crunch Will Make Laptops a Lot More Expensive  PCMagMemory investors have forgotten the last cycle  Financial TimesIt’s Been a Memorable Quarter for These AI Stocks  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 07:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOb1FIS29SY1ROeFU5eGR4T3BqT3Z2blJMSXBueWRXN2QzanBWZ0U1WDlQTnZNZkxJblVDellmY21LdUR3QVpqUW1iRFJ0U1lfdy1kajBHZVZXbVpreTZBRGItY1F5d01IWUliVGRCWVNoSVR1alZ3N3YyeHZnWlBPTGJXZGxxZ1RndDlQdE91Vnlja3lpT0hzOE5ULUlGdGp6WVd3V3RqUXFuQV91RjcwNGFn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "bloomberg.com"
    }
  },
  {
    "title": "Salesforce made a new round of job cuts. These teams were affected. - Business Insider",
    "description": "Salesforce made a new round of job cuts. These teams were affected.  Business InsiderSalesforce cuts fewer than 1,000 jobs, Business Insider reports  ReutersSalesforce quietly lays off employees in a new round of job cuts, impacted teams include Agentforce AI product that CEO Marc Benioff said: People don’t ...  Times of IndiaSalesforce (CRM) Stock; Up Modestly as Teams Shift Toward AI  CoinCentralSalesforce Cuts Fewer Than 1,000 Jobs In Targeted Workforce Realignment  BW People",
    "published date": "Tue, 10 Feb 2026 02:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNVEpQeTQtWUJ6M20yUDJBTnI1aDRVVUtjeERHTGZQREhVbTljdzBxcnZ1NDBUT0Z3R0pxaGZiSlFudF84blpsdmhsQkYxd0pCMjJmU09wOWxlSXd6VHF2SVdSeWF6Vk9Rc0VnXzNVbkJsVW5IUFpKQWRCTFRSRTFaV2dSSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Asian Stocks Set to Extend Rally to Another Record: Markets Wrap - bloomberg.com",
    "description": "Asian Stocks Set to Extend Rally to Another Record: Markets Wrap  bloomberg.comStocks rise as Nikkei sets record, dollar drops  ReutersJapan's Nikkei 225 closes at record high as Asian stock markets mostly rise  CNBCGlobal shares mostly rise, led by a post-election rally in Japan  AP NewsStock Market Today: Japanese Stocks Extend Post-Election Rally; Dow Futures Little Changed — Live Updates  The Wall Street Journal",
    "published date": "Tue, 10 Feb 2026 04:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQLVF3cHNBZnF5QTY4djRXR25NRXB3ME54eG01dUs4TmhGOG1GYXVfT2h5Q1BpUVRWdXdRV1BaMTlmVDQ2QU5fcFZJQ29INVhDdU9obmR3QzFiWEN5T2pmTnowX2MzeU1PVWF1bDN5cEF2VDY4QjJhUW4xV0Y5YUdKTnZ6MW5MYnpRenRUcXo5RGFVamhr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "bloomberg.com"
    }
  },
  {
    "title": "After The Washington Post - The American Prospect",
    "description": "After The Washington Post  The American ProspectHow Jeff Bezos Brought Down the Washington Post  The New YorkerWashington Post C.E.O. Will Lewis Steps Down After Stormy Tenure  The New York TimesHow Jeff Bezos ruined the Washington Post and why he should sell it  foxnews.comWashington Post cuts mark the death of sportswriting  Axios",
    "published date": "Fri, 06 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNWWlKSExwYV9Sbms4OFREcnpnNXduOVpSd0hjYnlXYUxuWlFzVGNTUWFETVhFeE0tZ2IxZnE2eDRWUXBHUzZic2JJVDR1UWkwUXVuS2ZZYlBmZUZWanQ2V25oM2k3UnFGTkZKRDlaN3BheWRRajBZWnN2bS1yS21rejdUWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://prospect.org",
      "title": "The American Prospect"
    }
  },
  {
    "title": "February Update 1.15.0 - ARC Raiders",
    "description": "February Update 1.15.0  ARC RaidersEmbark Studios Is Encouraging Cooperation in ARC Raiders With New Shared Watch Event  The OuterhavenThe Shared Watch event in ARC Raiders focuses on the robot menace and rewards friendship  ShacknewsArc Raiders goes full-friendly PvE tomorrow with new Shared Watch event: \"Team up with strangers, turn your barrels on the machines, and earn rewards\"  GamesRadar+Arc Raiders will bring back snow and frost - players don't understand why the developers removed Cold Snap  IXBT.games",
    "published date": "Tue, 10 Feb 2026 10:08:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE14T2Q5YmNsSjU3dHFSeXVmWHk2d091SVc1VmE3a2kzcTEzYnkzSl80QTIxQUM1dXptUEpyQUtzeTZJVnpxWWZJWHFDOTFVdkxnME03dVpYakRyQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arcraiders.com",
      "title": "ARC Raiders"
    }
  },
  {
    "title": "New video game sees Africans fantasise about taking back looted treasures - BBC",
    "description": "New video game sees Africans fantasise about taking back looted treasures  BBCRelooted is a history lesson in puzzle game form  PolygonVideo game Relooted tasks you with reclaiming African artifacts in museums  CBCRelooted: Heist as Puzzle, Puzzle as Montage  Xbox WireRelooted challenges who gets to own and tell African history  AV Club",
    "published date": "Tue, 10 Feb 2026 00:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA5aVZjOENCY2JsTjYwV2RzWUc1RC16bWlzT1BBYXBtc3JsTGg4dFk1QlIteGNnZHhTQnBmZGRyUzlZMTI4cThXRG5uQjZXNmI0MUZadVRjMVlKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Runna Pushed Some Runners Into Injuries. The Virtual-Coach App Is Now Easing Up. - The Wall Street Journal",
    "description": "Runna Pushed Some Runners Into Injuries. The Virtual-Coach App Is Now Easing Up.  The Wall Street JournalThe Role of AI in Fitness App Development in 2026  vocal.mediaWhat AI fitness apps can and can't do — for now  marketplace.orgAI-Powered Workout-Monitoring Systems  Trend HunterAI-Powered Fitness Coaches Are Replacing Personal Trainers  cvobserver.com",
    "published date": "Sun, 08 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBRSUZYRkJ4Q2ZMZGlpMWplXzhnRnlVM3EzMlNYSk5SR1FXY25DMG55c2hLYk1ob3ZmV0VpRWdaRG5MZkZwZ3huXzJlR2dJV3VNX1B1TlhjRUxOV3JLNjF4OFFlYUczTGFJXzBEcmY2Rllya180SXVtOVh4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Taking Inventory: Fishing Rod - Minecraft",
    "description": "Taking Inventory: Fishing Rod  Minecraft",
    "published date": "Mon, 09 Feb 2026 16:05:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE9mbldfai01RFdaUTlnQmNWZVR0a0w2aGhnNTZESFFTUS11MjVwaG5rTHF3Mkt0SGV5LVliZEV4R3hTVUxpMlJyUHVLLWVRVmpDa1dHT3lmdDlwX2dvYTgtSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.minecraft.net",
      "title": "Minecraft"
    }
  },
  {
    "title": "King 'ready to support' police as they assess Andrew claims over Epstein - BBC",
    "description": "King 'ready to support' police as they assess Andrew claims over Epstein  BBCKing Charles ‘ready to support’ police as they assess claim his brother, Andrew, shared confidential material with Epstein  cnn.comPrince William and Kate Middleton Are “Deeply Concerned” by the Latest Epstein Files Release  Vanity FairPrince and Princess of Wales ‘deeply concerned’ as Epstein files roil U.K.  The Washington PostBritish police 'assessing' claims former Prince Andrew shared sensitive reports with Epstein  NBC News",
    "published date": "Tue, 10 Feb 2026 06:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9hVExGdGFuQVZvVHJ2VmktVV9rT0dsc3c4RG5VV3c2c3FXSXR2OEJrcU82TnRsb1FUdC0tWnNic2pNVWl2eFVjSGVsYWQtUUFMdC15NVRKODdNUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Best and worst Super Bowl commercials of 2026 as rated by experts - cbsnews.com",
    "description": "Best and worst Super Bowl commercials of 2026 as rated by experts  cbsnews.comThe 2026 Super Bowl Ads, Ranked  The New York TimesSuper Bowl 2026 commercials: Athletes include Serena, more  ESPNWhat Were the Best Super Bowl Ads? These 3 Commercials Came Out on Top  TODAY.comThe most memorable 2026 Super Bowl commercials feature Ben Affleck, the cast of 'Jurassic Park,' Benson Boone backflips and more  Yahoo",
    "published date": "Mon, 09 Feb 2026 13:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA4UVJxVHFLc0tBMkV0TkQ4WGp5My1JUzJmc3pHampYVmNSb0lQT3l4aUJKNTI1SGlHR2RfRjJ5Y1hYVncwa3E0NlpIZFFLdEo4bWRXcmhLV2hvVi0tWmJ6QnctREljRjlrWGtZU0FOc0xFODlaYzJB0gF8QVVfeXFMTTBwZjJ6MHp1TlB5N2NvQ0xFM0tld2VST2x1LThBS0JmT09IaGo3c0xHR3NhdVl1cGFUSzBCbnNLWGtPVlpqUnZBMkJCSnFhS2c4SGlRcml5ZlhnaHBpTkRzSVFidDZITTdIcnoyX3dWb1BpX2QxbjBwZU5LcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "cbsnews.com"
    }
  },
  {
    "title": "Study claims the massive ocean on Jupiter's moon Europa is more likely 'dead' than teeming with life - Earth.com",
    "description": "Study claims the massive ocean on Jupiter's moon Europa is more likely 'dead' than teeming with life  Earth.comLife-friendly molecules are leaking out of Jupiter's giant moon Europa, Galileo images hint  Live ScienceEuropa’s Ice Shell May be Surprisingly Thick, Does it Affect the Odds of Alien Life?  Orbital TodayEuropa’s quiet seafloor  planetary.orgScientists detect ammonia on a Jupiter moon  The Tartan",
    "published date": "Mon, 09 Feb 2026 18:47:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOcWFzNlE1VDN5MG02empMMkFidEdVYjJtVjNmbkZOSDBkamZFWlhhT0IxdS1NOFM3SGpCZHEzb3Z0cDVWN0Z1TFFlcFNheXYtQjhhMnl5MUdrXzdGVmhaS2lDSzJaekN3Z3g5NDE0VmxFU2d6VngwNW5iRlJpNExNa2wwWW1wQUkzcWRzWkhNd1lTYmZiUVZhZ1pB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.earth.com",
      "title": "Earth.com"
    }
  },
  {
    "title": "Bonobos are capable of pretend play, just like human children - cnn.com",
    "description": "Bonobos are capable of pretend play, just like human children  cnn.comApes Can Pretend, an Ability Once Thought Unique to Humans, New Study Suggests  The Wall Street JournalA bonobo tea party: Study shows humans aren't the only species that can pretend  NBC NewsCan bonobos use their imagination?  National GeographicAt a ‘Tea Party’ With Scientists, This Ape Showed Some Imagination  The New York Times",
    "published date": "Mon, 09 Feb 2026 13:20:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBXOWhQaGExTXVRRlRLeUFXa1E0VF9qTk9IZ3FKYVhmRi1nSmhrWVp3MjlzY2plU2FxRGlWeU85TVJzOG1mMllHOUczbHI4ZzIzXzY2UzdRZS1QSDU0Z0I4cWg2X2o0RzcwYkpEVkFFZWZ0UDBTWE9XTzQxUDg5bkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "SpaceX resumes Falcon 9 launches after second-stage mishap - theregister.com",
    "description": "SpaceX resumes Falcon 9 launches after second-stage mishap  theregister.comSpaceX launches return to flight Falcon 9 mission following brief stand down  Spaceflight NowFollowing Brief Pause, Falcon Rocket Launches Resume at Vandenberg  NoozhawkFalcon 9 returns to flight after upper stage engine investigation  SpaceNewsIs there a rocket launch today? Here's the schedule at Vandenberg  Ventura County Star",
    "published date": "Mon, 09 Feb 2026 14:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE41aTd4bHgzRUJuVkNYeGVfdm1sZjhKOEx4RzMtV016STVKSUpRemZnTXgwWTBhdl96Q3J5Y2Z3U09FcDItLUFXQ3ZkUmFOTEY2LVlfWnV5cUNKeFljNHlpXzdJUEplV2hQQU54aWxpbzM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Venus may have an underground tunnel carved by volcano eruptions - Space",
    "description": "Venus may have an underground tunnel carved by volcano eruptions  SpaceRadar-based observation of a lava tube on Venus  NatureFirst evidence of a subsurface lava tube on Venus  Phys.orgScientists Intrigued by Possible Hollow Structures Under Surface of Venus  FuturismEvidence of volcanic activity on Venus confirmed for first time  ttownmedia.com",
    "published date": "Mon, 09 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQLVpxczF4UHM1VkQ4NWE0QUhWM25WcC1xRTF5dkMyNjgwdWo4S3ZWQkQtQjVwV1hNX1prUzhSUHNyd2kxZm83bVBSWFFYajJVc29lb3FxRjRMU3l2VGF5YTBhaGtsSzEzZG53OHpDWE9Vb09OelNCUnpHZ2lWUE0xZmhsNkdwa21JQkEtSEJFY1dxX1NWSnJhLUR5c3BUNWlFTVFVZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Oz Offers Forceful Call for Vaccination as Measles Becomes More Dire - The New York Times",
    "description": "Oz Offers Forceful Call for Vaccination as Measles Becomes More Dire  The New York Times'Take the vaccine, please,' a top US health official says in an appeal as measles cases rise  ABC NewsOz urges Americans to get measles vaccine amid outbreaks  The HillTranscript: Scott Gottlieb on \"Face the Nation with Margaret Brennan,\" Feb. 8, 2026  cbsnews.com‘Take the vaccine, please,’ Dr Oz urges amid rising measles cases in US  The Guardian",
    "published date": "Mon, 09 Feb 2026 20:31:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE0yWXlrQ0hxSE5wQzBkbF9iOEdyMmwtb2NPM01MaWwzcmdTUzFtYTZ4VXpqd2xWamJsMTh1TlNFdFVYN0RkY0gwbVJQLXpGOE92amU4UzFPWHhKdEpmeWRnMFA5RXd0cEcwUkFlM1YxdXZ6RnNOTDlMSVJRWkppUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What to Know About Measles as Cases Rise: Symptoms, Vaccine and More - The New York Times",
    "description": "What to Know About Measles as Cases Rise: Symptoms, Vaccine and More  The New York TimesMeasles Is Causing Brain Swelling in Children in South Carolina  WIREDUS experiencing largest measles outbreak since 2000 – 5 essential reads on the risks, what to do and what’s coming next  The ConversationWhat to know about South Carolina’s big measles outbreak and who is most at risk  PBSThe Only Thing That Will Turn Measles Back  The Atlantic",
    "published date": "Mon, 09 Feb 2026 20:32:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1uMVExQUx5OTZDOVFlYkpyYmp0Z0ItUlVxLXRBRl9LeVpweklQMV95clJQN001bkNZa0U4NXdjN1o1MV9wQ1BiN25TbFhrRUxHREl2UXdvQTJUV1lDOVVYTVgwTlZKc0tqa3FqVElqSkVQOGhJLWtuXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Common Sweetener May Damage Critical Brain Barrier, Risking Stroke - ScienceAlert",
    "description": "Common Sweetener May Damage Critical Brain Barrier, Risking Stroke  ScienceAlert",
    "published date": "Mon, 09 Feb 2026 22:03:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOa0R5QWtVRDNGVVpqVmVldkRpeEZ6NkM1NlFfQk9pYXJndGZKUEh3d2RJbko2aXViT0JEaUp5elhWYnhuWlFMdTNObng0N202ekZUU3JuSVlOLS15TTY4UkllTVV2a2oyNE1ZM2ZnZ19vaHZkLTVHbEVNUzc0R0NOV0JnU0RzWWpPTFYwYkUwM19HQm9MUmJ6WHpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencealert.com",
      "title": "ScienceAlert"
    }
  },
  {
    "title": "A new way to fight antibiotic resistance : Short Wave - NPR",
    "description": "A new way to fight antibiotic resistance : Short Wave  NPRA conjugal gene drive-like system efficiently suppresses antibiotic resistance in a bacterial population  NatureWhy certain antibiotics aren’t working for you  Rolling OutHow to rethink the fight against antimicrobial resistance  weforum.orgAntimicrobial Resistance  The Peter Doherty Institute for Infection and Immunity",
    "published date": "Mon, 09 Feb 2026 08:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOcGxEWkxWODRVNTBxX0dkZnRjZ01GeWszZDRkN2JMb1pTbUlhdHJjR1VfVWMyV2c2NXUxcERMM21KUGx0ZUJUU3JzdmVRY0pVLWFMWGhYaGNuZnM5ZGNBb3h0T1RpUk1TRklJa0hIMTN6ZTFsRklKVmJHZk9PVzhBQ3BkYmItNlJSRUNLYlYxN2NFVVZ3Z3ZfaEVKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  }
]