[
  {
    "title": "Was Renee Good Obligated to Comply With an ICE Agent’s Orders? - The New York Times",
    "description": "Was Renee Good Obligated to Comply With an ICE Agent’s Orders?  The New York TimesRecords: Medics found Renee Good had gunshot wounds to chest, forearm, and head  5 EYEWITNESS NEWSDo federal agents have 'absolute immunity?'  NPRQuestions, protests, pain follow after ICE agent kills a woman in Minneapolis  MPR NewsRenee Good had four gunshot wounds, fire department report reveals  Star Tribune",
    "published date": "Fri, 16 Jan 2026 03:35:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQVXo5b3hfU1J3azAxM1JTUXdQQld0aVNzd3dXUDR1YklZWVprY0xQNktZSWFHaEpNazZBblFVZUkydy02TU9pcTZ0Y281ODY0emU1NEIxS283S256SjVPcnlhZUxKa1puaWphQXl4UEtIelRXRHR3MXdTTU91MGkwZmdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "How Minneapolis became America's flashpoint for protests - Axios",
    "description": "How Minneapolis became America's flashpoint for protests  AxiosMinneapolis is becoming a critical testing ground for Trump’s strongman project  CNNEditorial | Minnesota is under siege. This cannot stand.  Star Tribune‘She was a mom’: Renée Good’s killing amplifies the stakes for parents  The Washington PostOne State, Two Very Different Views of Minneapolis  The New York Times",
    "published date": "Fri, 16 Jan 2026 02:13:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOLXVBa1ZBSi1IdXRmZ3RDeE1NS3dpMWdiZ0M2RS10N0hfRVFRdG5CVjNvNkV2enBZUkNtSjFIU1dhSUZhVHY5Vy0wV1ZqcXlmVGpqRlJ0RVJLY3lPNlpYXzVJNlM1Q1cxNU1ObFpmLUhWRXBFREtMSFZCampUaEZQNEJscmtiUzdyTGN2S0xMdm13dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Stand-alone Grok app still undresses women after X curtails access to tool - The Washington Post",
    "description": "Stand-alone Grok app still undresses women after X curtails access to tool  The Washington PostMother of Elon Musk’s son sues his xAI over AI-deepfake images  CNNMusk dealt blow over Grok deepfakes, but regulatory fight far from over  ReutersGrok blocked from undressing images with AI in places where it's illegal, X says  PBSApple, Google face pressure to remove X and Grok from their app stores  CBS News",
    "published date": "Fri, 16 Jan 2026 03:24:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNUTE3cVEyTk8zaVlUT2dYZ0djUVd1eTd2YnNDcEZXM1duMnl6am5YVVNOdUhQa21rNHdyalVDN0hZRkF1eGpYTzZBdXQ4MWdTc05TY24zV2pBNm5adnVFTWNESUJ3MzFUeS1MS0pDbHB4RnBaTUNzZjB1YlpqVTVSaVp2REtlM0o5eVpwQ05aMThkUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "US military seizes Venezuela oil tanker under Trump sanctions - The Guardian",
    "description": "US military seizes Venezuela oil tanker under Trump sanctions  The GuardianU.S. Forces Seize Sixth Oil Tanker Near Venezuela  The Wall Street JournalFootage shows US military seizing sixth oil tanker accused of defying sanctions  BBCUS seizes Venezuela-linked tanker ahead of Trump-Machado meeting  ReutersU.S. Forces Seize Sixth Oil Tanker Linked to Venezuela  The New York Times",
    "published date": "Fri, 16 Jan 2026 02:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPTzI4Qy1zSWU2amVTN0ZSaWRINWFpYmpmQ0dxTzljem9uVTQzNC05M1ZkZGJuQ19oREpSSXJJSWRpakpqbnpvMm9kNDNGeUtCZGJzZ0pVYzlDR0Y3c05WTUpoQkVndzc2YVVIN1NYcUZrSmNEN2I0bUZYTDRPc3F3VW5uMWZhcXdLM1pudQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Medical examiner believes death of man in ICE custody was homicide, recording says - The Washington Post",
    "description": "Medical examiner believes death of man in ICE custody was homicide, recording says  The Washington PostDeath of man at ICE camp could be investigated as homicide after examiner’s report  The GuardianReport: Death at Camp East Montana could be ruled a homicide  KTSM 9 NewsReport: Migrant's death at Fort Bliss detention center likely ruled homicide  KFOXMan in ICE Custody's Death Is Likely a Homicide by Agents: Report  People.com",
    "published date": "Fri, 16 Jan 2026 04:57:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNWlJYZl9vcHFBdW9FVC1WTXdURGExUTdTU3VCeHc5dVpuY0d6bXVnWkU3Z0VodGVBVUMyNFJjVmY0TktnLU8yZ09nUEs3QWJlQ1VsU052QzhJT3I3RUNDU3FPWVFOdlVmQ0J1Q0ZISzhRMC15UGliLXU3UDFnN0JsVExRSEVST0xRMUt3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "You just saved NASA's budget - The Planetary Society",
    "description": "You just saved NASA's budget  The Planetary SocietyTrump wants to slash funding for federal climate and weather research. Congress is about to tell him ‘No’  CNNCongress passes bill to fund U.S. science agencies, rebuffing Trump's requested cuts  NBC NewsCongress Is Spurning Many of Trump’s Proposed Spending Cuts  The New York TimesPro-science Republicans are fending-off cuts to funding  The Economist",
    "published date": "Thu, 15 Jan 2026 22:38:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFA4a2s4MEl2a0M3MEU2dGFxcUZHTEc4dXJocDhqMjIzY0hsUTN3VlltZUFRb2d3ZnhoTVFJWjVOTHlqNUxhbEdtdzJqZ1A1SU95eS1fSHBWdVdKcjZnaVdjX0lnMkNZT0dvcGoxZDJKTUoteFVUajhHbnRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.planetary.org",
      "title": "The Planetary Society"
    }
  },
  {
    "title": "Native Americans are being swept up by ICE in Minneapolis, tribes say - The Washington Post",
    "description": "Native Americans are being swept up by ICE in Minneapolis, tribes say  The Washington PostOglala Sioux Tribe says three tribal members arrested in Minneapolis are in ICE detention  CNNTribal leaders say ICE is detaining American Indians during immigration sweeps  Star TribuneMinneapolis Native community works to protect each other as ICE surges in Twin Cities  CBS NewsCalls to release Indigenous ICE detainees go unanswered  kare11.com",
    "published date": "Thu, 15 Jan 2026 21:29:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOMU1RaTBQc0ttLVM1Mi1kQWpZelM1Tng1Ul93em1NSzZ6RGN4U0o0anlna2FlQm8zdTBNRGsxWWwyY0toVzRCRHZXMXhad0hoLV8wb2FlUEItYWdMWUl6dXlFR3R3dzYzOEdCMWdQWnVJVzNfVFItaWdOelRSLWU2Y0I3dFRkLXFORnp3Rw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Push for greater ICE training grows on some Republicans - Politico",
    "description": "Push for greater ICE training grows on some Republicans  Politico‘I’m Embarrassed’: ICE Agents Speak About the Shooting in Minneapolis  Time MagazineAmid Protests, ICE Told Agents to Take ‘Decisive Action’ if Threatened  The New York Times“ICE Is OK with Renee Good’s Killing”: Journalist Ken Klippenstein on ICE Tactics & Recruitment  Democracy Now!In the immediate moments after a fatal ICE shooting, what does federal protocol require of agents?  Star Tribune",
    "published date": "Thu, 15 Jan 2026 23:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQTEs0ZVpEZlV5dEtRazgxeHlycGtCUjFGTlFTY1pqa2gyRDlOakt2SGppblBienNkeDRmMzFxc084UDRCRFZNTWl5b2ZLRXJjS1JpZURzb2g0UHpNRDJqZFlQWkcyTXlZSFU0X1lBNk8yaTBodTZ5VnFaOGs3cXh3dElzazhYZFZPYXU4UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "FBI: 1 arrested after protesters smash into unmarked federal vehicles allegedly containing federal documents - CBS News",
    "description": "FBI: 1 arrested after protesters smash into unmarked federal vehicles allegedly containing federal documents  CBS NewsFBI offering $100K reward in vandalism, theft after Wednesday night ICE shooting  FOX 9 Minneapolis-St. PaulAnti-ICE threat spray-painted on vehicle believed to be used by federal officers during Minneapolis unrest  Fox NewsFBI offering $100K reward to find items taken from federal vehicles after ICE shooting  Bring Me The NewsMinneapolis family says federal agents raided wrong apartment looking for items stolen from FBI vehicles  CBS News",
    "published date": "Fri, 16 Jan 2026 01:34:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxNRmdaY216NzdXUWNVNDlaLVM3YnJrd2lLZGFzWXFldlJ1R1llUW05YWxJdkttcl9RbXEyVERtbTFab3RFVGpLMmRLQ2Q4bUlVclNOZmx5RnpNTTI1dzZTVndCMHI1SUpCb2tZdkhCTVlJYUpTeFNuRTZ0anNiTmhFV3MwSTMxVU5OcTdkMWNtNVpYM1d0WTVBRzE5emQ5NUQ0TTZkR0RHa1lZRjItUmFDYms3ZzVBN1VkazQ2anNISDRUXzdkbHBsVmxDSDNBQXdORnZTcWhuQUFtUW5iUmZTTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Trump Was Told Attack on Iran Wouldn’t Guarantee Collapse of Regime - The Wall Street Journal",
    "description": "Trump Was Told Attack on Iran Wouldn’t Guarantee Collapse of Regime  The Wall Street JournalOn the verge of strikes in Iran, the US held off. What happens next is up to Trump  CNNTrump sees Iranian crackdown easing, Tehran denies man to be executed  ReutersTrump would want military action in Iran to be swift and decisive, sources say  NBC NewsTrump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops  The New York Times",
    "published date": "Thu, 15 Jan 2026 22:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxONlFzZlVTZE1MUWZTcTF0bDBQTU1UMXdPaHhCSTh3cmJTRThOdjBwZDhPZktKZVRtbGM1bFBOeG51MjV6U25lRzZxaE5fVG4yYUNBamRlM1pjQ2t3cGVETlBvUDVmaUZyaWFhZ0xoMEdiUDNTdzVFbVlPUjZHdE12aGhVcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Canada, China reach initial trade deal on electric vehicles, canola - Reuters",
    "description": "Canada, China reach initial trade deal on electric vehicles, canola  ReutersChinese leader Xi Jinping hails 'turnaround' in China-Canada ties as Mark Carney visits Beijing  BBCCanada’s leader patches things up with China as rift with Trump upends old certainties  CNNCanada Breaks With U.S. to Slash Tariffs on Some Chinese Electric Vehicles  The New York TimesDeveloping | Canada to remove 100% tariffs on Chinese EV imports: prime minister  South China Morning Post",
    "published date": "Fri, 16 Jan 2026 09:44:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUTlnV3kyNm5OUGFsRUpJckFhNEd1X25DaTBwM20yb0EwT05SNnRCNnctWDQyTzBfMFdxMU9lbXZ5ZHQ4X0hTa3k2R0dlVUJSOFFCdVZjRDktME9JT3hSME5La0F1VUVNTDMxemZtNHM1SzBGWkprM1hEZnVJZ3ZYbllQWEdDWEhyeUJCaXVaZHRIdlAtMEVzQUMxWnVnNFlCYndzTEl4eThLNVRiN2gyb0dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Time to dump Trump? Europeans whisper last-resort options to save Greenland - politico.eu",
    "description": "Time to dump Trump? Europeans whisper last-resort options to save Greenland  politico.euEurope has three options for defending Greenland  The EconomistEU's von der Leyen: Greenlanders can count on us  ReutersEU will maintain Arctic cooperation with US, von der Leyen says amid Greenland tensions  Euronews.comEurope must now tell Trump that enough is enough – and cut all ties with the US | Alexander Hurst  The Guardian",
    "published date": "Thu, 15 Jan 2026 20:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQdlNOVXJndzF0X0NwMURRZGhndzNNemR6dlJ2ejRXY0I1bDhYN0RqTXVFOV9nNWFTaDJCMHNLSHZtX0hkWExZa1MycllOSnQybDRoQ2xBYzRON0QzbGtBdXRVR3EwRF9SWV9Jczd6OFZJcHBsWmI0MnRMQndOZkRLMERNRnBndDhQMnBPQW1lSXpXTDF0TGJBUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Trump Moves to Make Tech Giants Pay for Surging Power Costs - Bloomberg.com",
    "description": "Trump Moves to Make Tech Giants Pay for Surging Power Costs  Bloomberg.comMicrosoft has a plan to stop AI data centers from hiking up your electricity bill  CNNGovernors head to White House on Friday to unveil deal to curb power prices, sources say  ReutersMicrosoft Pledges to Pay More for Electricity, Drawing Praise From Trump  The New York TimesHow the White House and governors want to fix AI-driven power shortages and price spikes  ABC News",
    "published date": "Fri, 16 Jan 2026 02:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTWYtTmp3V0hycWRjM0dzWVdTUEZIbU5sWk9pa3lySlA3UEFLT0I2Q0FZbno1ZzBwaURQRmREUnZxSlhXVkVtd09OSzlnNnp4T3NVcDYyZWRCbElwVnpHczZXME5SN19QVzB2NVRwcW1OWHVUR0FKa0pBZXpvc3JjRU1YVUNSYU1RdWE5WWlGa0N1aHNTaFE5RTJFZDNNaUNMdUFYZU91d1hGRzFwOFN3YkctWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Stock futures are rise after rally in banks and tech lifts major averages: Live updates - CNBC",
    "description": "Stock futures are rise after rally in banks and tech lifts major averages: Live updates  CNBCStock market today: Dow, S&P 500, Nasdaq rise as TSMC boosts AI hopes, bank stocks rally  Yahoo FinanceU.S. Futures Suggest Tech Rally Will Continue, Though Global Markets Falter  The Wall Street JournalMarkets News, Jan. 15, 2026: Stocks Rise to Snap 2-Day Skid; Chip, Bank Shares Lead Gains; Oil Price Drops as Trump Lowers Iran Tensions  InvestopediaWall Street ends higher; banks gain following results, chips rally with TSMC  Reuters",
    "published date": "Fri, 16 Jan 2026 09:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9pMDdPUGpGQThZN2Vpa3hzYUVDREZ1R01wa25KdnpGcU9OVXV6RGhjODgwUllURHV6eEhpRHpFVnNxY2pEVHp0UnBtZWM2UlR5TUhHZWtXUDB3RWM5QkVpRlBITnkxcU1WZFRRMk5zTkktajlNQ2M40gF8QVVfeXFMTU9Bb3p1dUhwZGhuR1FmaGJoSWxoenoxaE9DbGNTZTVYLW9GWGZGUWZFUXNtUUtrdjlmanN1X3FEb1RRZmRmdWVCenlTQ2laa2FUY0Zta2xmQlFpSDNQUTIwdE83Rm9USnBTbXBFTnlTc0tZV0EtTU5lUDMwSA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Asia shares rise on AI optimism, receding Fed cut bets lift dollar - Reuters",
    "description": "Asia shares rise on AI optimism, receding Fed cut bets lift dollar  ReutersView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 06:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNcDBMcUlEaGlXc0VOVkJZRDlPWURlZjBMdnd3aWhfOXZUbzVhdzdsYk5kTkR4Yk5sWmZKMUZXMmtEZEdxVjU2LTY5SmV2N1A2djVZN3RfSG1tNkRLbFhJaTRnZGJYZHpyT1JVX29hcjBtN1RkSldYTDNjTjZjblBCaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Ford’s New Bronco Promises Real Off-Road Chops Without the Raptor Price Tag - Gear Patrol",
    "description": "Ford’s New Bronco Promises Real Off-Road Chops Without the Raptor Price Tag  Gear PatrolBorn in the Desert, the Bronco RTR Is the Fun High-Speed Racer That Won’t Break the Bank  Ford From the RoadFord says Bronco RTR offers Raptor-like performance at lower price  Automotive NewsFord launches Bronco RTR, Carhartt collab ahead of Detroit Auto Show  MLive.comFord expands Bronco SUV performance lineup with 'more attainable' RTR model  CNBC",
    "published date": "Wed, 14 Jan 2026 22:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9selk5R2FscWVhUzdOQTZSSkRxVTRtZjVmSmxpa2tMREJsWWJYdnhEQUEtUDdxNjI4alhYRU9FZ0hnd3BwdG9MMUhJOUR0dTZpclRJSkhNMU9lWjRYVmd2ckZrNHNJOGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gearpatrol.com",
      "title": "Gear Patrol"
    }
  },
  {
    "title": "An earthquake on a chip: New tech could make smartphones smaller, faster - Tech Xplore",
    "description": "An earthquake on a chip: New tech could make smartphones smaller, faster  Tech XploreAn electrically injected solid-state surface acoustic wave phonon laser  Nature“The Waves From an Earthquake, Only On the Surface of a Small Chip”: This Vibrating Laser May Be the Future of Wireless Technology  The DebriefTiny ‘earthquake-on-a-chip’ phonon laser aims to shrink smartphone wireless hardware  Bez KabliThis chip can make future phones thinner and faster through tiny ‘earthquakes’  Digital Trends",
    "published date": "Wed, 14 Jan 2026 16:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPWDk1YUd5UUFheEJVZndLZVRiY3RsZ1hKdXY3UjYtVi1kZDNoaG95RnlGNGgzWkExTzMybFV2LXBkVTgzU2x2Y20wTDNoejRiZ3BTU25ZQ09SM2lkTWZNS0xhSVBYbUlaVnAtS3VWSjVxaldmWklUa3NRdTNWTjhZaWtRcWs3R3Zx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techxplore.com",
      "title": "Tech Xplore"
    }
  },
  {
    "title": "Google is exploring a much better way to build batteries into phones - Android Authority",
    "description": "Google is exploring a much better way to build batteries into phones  Android AuthorityProblem Solved? Leak says the Pixel 11 Pro Fold's battery repairability could step it up  Android CentralGoogle’s New Battery Patent Could Finally Make Pixel Repairs Less Painful  PhandroidThe Pixel 11 Pro Fold may support easier battery repairs  Android HeadlinesThis Pixel patent could make your phone repairs easier  Digital Trends",
    "published date": "Thu, 15 Jan 2026 06:56:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBSZWRDRnhpNXE1YWNvWFVBOG5mVV9vdTRhR21rWXVYOUczY2ZfakFTOGt0U09meGJ2NHhfSkxSVTROeFctUm1MTkRhTlFFeEpseDR3Vmx4Wm0wLW45TUlLdGo5TkRDTUlsMUVUT2JYV3M1NmpyMVptNWVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "Elden Ring: Nightreign Patch 1.03.2 Buffs All the Worst Nightfarers - IGN",
    "description": "Elden Ring: Nightreign Patch 1.03.2 Buffs All the Worst Nightfarers  IGNELDEN RING NIGHTREIGN – Hotfix Notes Version 1.03.1  Bandai Namco EntertainmentElden Ring: Nightreign Just Got Its First Big 2026 Update  OpenCriticElden Ring: Nightreign – review  Terminal LanceElden Ring Nightreign Rolls Out Major Balance Update, Buffing Its Weakest Classes  EGW.News",
    "published date": "Thu, 15 Jan 2026 17:49:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTjI1b2swdUNCcTZNbzctWVJDcnNsbTVRUFQ5bGhDbzZJSE1nSl92RGtialFoOVNqaFoyRjBiYkJOZTZRNkVISDdVY0tpUF96WnFyd21HeFAzeDVxLTdEZW9acmxoc05ablQ4RF80VkpSbjBQTms4OVZCSWttUVRfNXpocDdhOFd4V04yVmZ2eHFwd18tQ1FDQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "Casting is dead. Long live casting! - The Verge",
    "description": "Casting is dead. Long live casting!  The Verge",
    "published date": "Fri, 16 Jan 2026 04:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE16bERITGowZUIzbU9WU05yaXlaTXhVQlZSZzBEdjBWelhGNUFOeDRVMlhVLXFuZVNtbllkTDVRTDNEWTQ0b042T2JaODR3d1RIVlQzenh4MDFXSEl5OUllTFFkVXJNT3BHMWVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Hilary Duff drops her spicy new single 'Roommates' - Yahoo",
    "description": "Hilary Duff drops her spicy new single 'Roommates'  YahooHilary Duff’s New Single Is About ‘When Life Is Life-ing, Babe’  YahooUnbothered Hilary Duff is all smiles in first outing since Ashley Tisdale mom group drama  Page SixHilary Duff selling out in Las Vegas amid ‘Momgate’ drama  NewsNationHilary Duff releases new song 'Roommates' about 'when life is life-ing, babe'  ABC News",
    "published date": "Fri, 16 Jan 2026 00:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNcUN6STNiTkJEVHdldEZveTFQdjFrbnk0c3JNYmQyMWpfazNEdkJwX1BRbUNxQW80RGZiZDhpcEJLdHN5QWQybmZkeWlQWU9MbFBJZkxRUDFxTXd4Ymt2UXVJX1JLc1hwdDNVLXkybEFvVzRRRXhaemhOSGwwQ0JLazRfSGwtX1ZXbHREZFV6b3FOa0hxQlZVZ0ZIbEYxMWhqWXNOcElkOGVXUS0tTHBzSUJ5TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Kim Kardashian Shares Adorable Snaps With Chicago West On Daughter's 8th Birthday - TMZ",
    "description": "Kim Kardashian Shares Adorable Snaps With Chicago West On Daughter's 8th Birthday  TMZKim Kardashian Celebrates Daughter Chicago's 8th Birthday with Sweet Photos: 'Where Did the Time Go?'  People.comKris Jenner Marks Granddaughter’s Birthday With the Cutest Baby Photos  YahooKim Kardashian, Kris Jenner celebrate Chicago’s 8th birthday with loving posts  JangKris Jenner dubs Chicago West her 'sweet angel' as she turns eight  The News International",
    "published date": "Fri, 16 Jan 2026 01:50:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOV09mdlh5OEFQYjJyTE93dzRSaURMNGVMdzN5dGhiRTQ4dGdlc3pDdm5WNUlVSmxGTjRKcDFiczRKRmNCVjdRMWZjUjhEbUdrOUd1NTF5eWpKeC1QWlJCREFRMDR0MFd1emxrVnc3ZzVvQ05US0ctakRxMVJTbEx1Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tmz.com",
      "title": "TMZ"
    }
  },
  {
    "title": "What WWE star AJ Styles said during TNA Impact’s premiere on AMC - NoDQ.com",
    "description": "What WWE star AJ Styles said during TNA Impact’s premiere on AMC  NoDQ.comTNA Thursday Night iMPACT! on AMC Preview - January 15, 2026  TNA WrestlingPerez Hilton Teases A Lot Of Booze And Hostile Fans For TNA Impact Appearance  YahooTNA iMPACT Results, Winners, Live Grades, Reactions and Highlights From AMC Debut  Bleacher ReportTNA IMPACT TV RESULTS (1/15): Darrin’s report on AMC Debut, Kazarian vs. Santana, Iinspiration vs. Elegance Brand, Hardys & Elijah vs. Order 4  PWTorch",
    "published date": "Fri, 16 Jan 2026 02:19:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNbTVRYm9vbmVSWkRiN2YzVzRxeVQ1YlBkQmU5R3B3YTRhdTYyVk1CM3JISEpJbVFmVW0ydkx4eUxXc0NiNE9xRHNXTkg3dDBuSE1ET0ZrRmlfWUZmMU1NVm9NM21CZ1BjU2o3SVVNTGFSUTZFUkxwRWZBUDNDMmx6ejRWb20tb05QNmhIZHJ2dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nodq.com",
      "title": "NoDQ.com"
    }
  },
  {
    "title": "‘The Pitt’ Season 2 Premiere Hits 5.4 Million Viewers in Three Days, Up 200% From Last Year - Variety",
    "description": "‘The Pitt’ Season 2 Premiere Hits 5.4 Million Viewers in Three Days, Up 200% From Last Year  Variety‘The Pitt’ Season 2, Episode 2 Recap: Dirty Work  The New York Times‘The Pitt’ Season 2 Premiere Ratings Soar  The Hollywood ReporterColumn | TV’s most satisfying escape right now is watching ‘competency porn’  The Washington PostThe Pitt Season 2 Sneak Peek: See Dr. Robby's Chemistry With This New Nurse  E! News",
    "published date": "Thu, 15 Jan 2026 20:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPZkhlcGZISVZGeGhPNXkwUnBJRV8zU1NIT1dqeUlpUmlDeGJSWU9FLTFaM1QweG1hQzhfVS1wTFE0UkZfOWhXVzBTa2tVLVVFamR6bUF2X2Vyb3pSd1ZfV2ZlYzZ4dEVQX3NsZ1B0a0wzOWpMZ0NNMlI2U1VuX3BMMm01YmJxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Brian Baldinger on Harbaugh's future with Giants: 'I think he will put a good staff together' | 'The Insiders' - NFL.com",
    "description": "Brian Baldinger on Harbaugh's future with Giants: 'I think he will put a good staff together' | 'The Insiders'  NFL.comDivisional Round Injury Report | Texans at Patriots  Houston TexansWhat the Rams Benefited From This Season  Sports IllustratedWhy Rams' Harrison Mevis has the 'thiccer kicker' nickname  Yahoo SportsLos Angeles Chargers Sign 14 Players to Contracts  Chargers.com",
    "published date": "Fri, 16 Jan 2026 01:07:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcXJ4blpDUnFiWmRsWFVZN2pfSVZqc0ZoeTdtUzVTZW5LQ2hzMGtBTG5odW5hOTg2RzVWTHBWQXBmZ3J0eG1wY1NKSzFObjZBTHpkS2tUU0k4R1dBZmxrRlBQVUE3X29yYjJhU0M4djdNUTNZcHVYZWVRc1dIcWFZRDZteUNTYUVYZ09odGVhOFpvcENVUjEwN3FxUHRpQTktcEZOY1NUSTN2dENsd2hnR05NQi15QUNUNGhKRWhsQzgyRTBGTFI2Wi1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Kyle Shanahan on Brock Purdy’s 4-0 record at Seattle: “Brock doesn’t get rattled” - NBC Sports",
    "description": "Kyle Shanahan on Brock Purdy’s 4-0 record at Seattle: “Brock doesn’t get rattled”  NBC Sports49ers vs. Seahawks: Three must-know storylines for Saturday's Divisional Round game  NFL.comKendrick Bourne shares simple key to 49ers-Seahawks rubber match in NFL playoffs  NBC Sports Bay Area & CaliforniaHow ‘50 knives’ game prepared 49ers’ Brock Purdy for excruciating test in Seattle  San Francisco ChronicleSeahawks Reveal Uniform Combination For Divisional Round vs. 49ers  Seattle Seahawks",
    "published date": "Fri, 16 Jan 2026 04:30:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNMWFXQklUM2FRUmw0Q3JMbzctX09zdUlxVzhEcExTYjFmSVVOa1pya1lFREFOYUVZcExidGVhTlhzcWVjSkZrUllneVY0Z0lySmNwWFJCczVvWmZXM1JZb3VJc3NWeF9JZzNfMG4ybWJ3TjB3TDR5XzluVDlma3hNeTZralBIWW5WdUI2OUtVXzVodHZpeHFsTjVIM25acGVEWGh0aWwybGE5aUR4SFdKVkljWlV4Rmt6VHVKNDZ0aTZtYm90Q3ZqVkE1a29LU3dkZ25Ucw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Indiana begins effort to pass legislation to pay for new Bears stadium - NBC Sports",
    "description": "Indiana begins effort to pass legislation to pay for new Bears stadium  NBC SportsChicago Bears stadium news: Bears talk with Illinois lawmakers plans in Arlington Heights, Chicago; Indiana introduces new bill  ABC7 ChicagoIndiana lawmakers introduce bill to get Chicago Bears to move to Indiana  WSBTWhat has stalled Bears stadium deal? Report blames taxes and politics  Daily HeraldIndiana Senate introduces bill to pay for new Chicago Bears stadium  WGN-TV",
    "published date": "Fri, 16 Jan 2026 02:36:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOS2Vmc1U4eENBSzVFT3ZxU0hYQWJMeDRqdlF4dDRITGNHOHp5dHR0a1lvcGpIQ3lSZmFCdl9Uc1h1X0ZPbW5yUzRfNldlTEV4MTl4cmkwWmlkYnY1c0MxOC0wQ3dQS1FJbVo1NFFMVXNyeUFzLWhTeFkzVnViWktzVHg1YnRLU1FYdHgyUnpiNFlMMU13RmVJY0VFTzBFZV90YXlUdnZIZ0FKUUNhYUhHT09Dc0d1dFhqRG05eVlRN1FiMzV1dERPaE9nbHk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Red Bull expecting engine 'struggles' for first few months of F1 2026 - The Race",
    "description": "Red Bull expecting engine 'struggles' for first few months of F1 2026  The RaceFIRST LOOK: Red Bull unveil striking new livery for 2026 F1 season in Detroit  Formula 1Verstappen prepared for 'unknown' as Red Bull launch new car  ESPNRed Bull RB22: Throwback blue livery for Max Verstappen to drive in 2026 F1 season revealed at launch event in Detroit  Sky SportsRed Bull launch Ford Formula 1 engine partnership in Detroit  BBC",
    "published date": "Fri, 16 Jan 2026 04:23:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdXZoMFZfeGpjUjhfTUFoY2QzSnEyX09OanFpRmNQUUNPU0NkV01mMS1sUUN5c29mbGVSTEExQ3ZWaURkemNNby1UX0xSdUZwY19vOE0takMxc0tNVmd3MzBJU1QwLUhqcjJVS2NueE9EMTdpRGJOQWVaNVlRNEs3T2hhdVRtZUJqdmhEUW55NEgwS3BXMlZhQVNQc1I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.the-race.com",
      "title": "The Race"
    }
  },
  {
    "title": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail - BBC",
    "description": "The landscape beneath Antarctica's icy surface revealed in unprecedented detail  BBCView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 00:00:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5sX1h0dDBHWi1XQlNLUVNoU3lzaHNoSG41NVB0WjNSSHNFU3ZfbTY3MGdjQ0ZjSldiQ2hYVzdKaFBXamZWUER2NjkyTkd3MWdOWXduX3dkUU9pQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "What are 'dark' stars? Scientists think they could explain 3 big mysteries in the universe - Space",
    "description": "What are 'dark' stars? Scientists think they could explain 3 big mysteries in the universe  SpaceLittle red dots as young supermassive black holes in dense ionized cocoons  NatureScientists solve the universe’s mystery of little red dots: Black hole  Euronews.comBlack hole butterflies? James Webb telescope spots dozens of black hole 'cocoons' in early universe.  Live ScienceMysterious 'little red dots' in early universe likely gas-shrouded black holes  동아사이언스",
    "published date": "Thu, 15 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQekZHZ1h6N1lnTU5qOFROWXZDTTMxZkJFb0JueFpLN1J0WDlnWlE3cm1oekZhWTVaUFhkRUw0WGpDNVVPUUs5d1hUN1htSUtfSDA1aldJN2owRjZSaWlmZzV5djJncnNaS2ZMcTJnTUlxeFRXOGJZV2pOaDRQdHgyM3h6SEVHUlN2U0dlWlA0UzkwTUtOMFkzY2hFdHkwRmIzUUZSdGlmZFRfTGhCNGpIWUozNzRKcC1qVF9hWnpienhzZGlocXpEbUFkMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "description": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch  Spaceflight NowSpaceX  SpaceXStarship launch infrastructure progress at Starbase/Cape ahead of 2026 Launches  NASASpaceFlight.com -SpaceX launches 29 Starlink satellites into orbit from Florida (video)  SpaceSpaceX launches Starlink 6-98 mission from Cape Canaveral, Florida  Florida Today",
    "published date": "Wed, 14 Jan 2026 20:27:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNalQ2VWJ5VEV3MzQxLUJOUUdBb2F3WTZLWTJzNUFLb0VMTmhCUkRKNHYyRmt4VTF6N2ZrT3ZJYTFsVVNXYWVtalR6c2RtdmZrc1JSdGZ2c1RFYTB1dTFyeUhsdS1KMlNtaF9YUEV6SXJzYVZRN3oyeG5XanBVWkVtTGRpeFNEeU5HbDBuMnAxOW9lYml2ZVk5S2hjRFltdl9EeW1HdnJMMnlRTHRBdXJWdjc3NVhoTENVcm0yMHQ1dUduU2tEZU9wR0FzeG16UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "New DNA analysis reveals an ice age wolf’s last meal - CNN",
    "description": "New DNA analysis reveals an ice age wolf’s last meal  CNNResearchers recover a woolly rhino genome from inside a frozen wolf's stomach  National GeographicWhat a Wolf Pup’s Stomach Revealed About the Woolly Rhino’s Extinction  The New York TimesIn the stomach of a mummified wolf pup, scientists find DNA from a woolly rhinoceros  NBC NewsScientists Find Extinct Rhino DNA in Wolf Pup Mummy’s Stomach  Scientific American",
    "published date": "Thu, 15 Jan 2026 15:35:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNWJzcHgyTlBtcmN0N3R5aU04cFYxeWxLNVZ1TU03d040b0VNWFk5WUlJcDMzUVVyb25tT212NWstMUNMZjV1R0Nwdk4wYU1XeGdkUEFBRVZ6STM5MjRTZURwRzQ2RzQ4ZnNMNlNPSXRGQllURUpEeTZJRy1WT2J3TEtqM3YwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Flu cases surging in California as officials warn of powerful virus strain - Los Angeles Times",
    "description": "Flu cases surging in California as officials warn of powerful virus strain  Los Angeles Times'Super flu' confirmed in Calif. as hospitalizations hit season high  SFGATEWestern Pa. \"super flu\" cases spike  Axios‘Super flu' spreads in California: What to know about symptoms, vaccine  NBC Bay Area10 things to know about this year’s surprisingly fierce flu season  AAMC",
    "published date": "Thu, 15 Jan 2026 23:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTWdvNGg0bVhUeGRwUkYyT3Bhck1IQTVrZm5NbUdjYTlLS01GeGp3d2NjWEVvb2xlekhWaFZXYmFoalNqQUpBb2JGTm9YcXBCZVBfY3dqMmRnN2g2X0hqWENiTlQxN2lIWjJGVnJ0cWR2Q215bmdoWS1hRDdtQXdkbVAtVmZsOUJYdVVlRkZoQXNybldVbGxhTERUVmU4Yi1EMDRPSl8wMXJoN2lzX0dnQnlSbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Finally, Some Good News in the Fight Against Cancer - Gizmodo",
    "description": "Finally, Some Good News in the Fight Against Cancer  GizmodoA new milestone in the cancer fight: 7 in 10 patients now survive five-plus years  NBC NewsPress Releases  American Cancer Society Press RoomMore Americans are surviving cancer — even the deadliest ones  The Washington PostCancer survival rates soar nationwide, but L.A. doctors warn cultural and educational barriers leave some behind  Los Angeles Times",
    "published date": "Thu, 15 Jan 2026 20:45:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOC1YLWVOVHJjX2NfOGhKQWVaQTdwNDM0c09FaFBDV0JrN2FZanhvRktKV0h6WXNsQ3JvWjBKb1VZd3d5eTkxcWsyQ3gtRFBqWmFsWk1xWUNzemR2TE90RHhFX19OY3dUUmlLV19adGE1ZFppc09GbzlveXN0cFNzaFJ5Y19MaHdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "Thursday briefing: Is your body really full of microplastics? - The Guardian",
    "description": "Thursday briefing: Is your body really full of microplastics?  The Guardian‘A bombshell’: doubt cast on discovery of microplastics throughout human body  The GuardianWe have to stop freaking out about every new microplastics study  vox.comWorried about plastic in your brain? Scientists say otherwise  The TimesOur bodies may not be riddled with microplastics after all — scientists say research is ‘not biologically plausible’ and ‘a joke’  New York Post",
    "published date": "Thu, 15 Jan 2026 06:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQbVEyWEhNV05wOXdnWlExQWxVSWNZd3FBRzQ5WENxdjk4eGpqeXRyRFVSX0JDakg3ZlhNNWVZdzB4dnF2RnBWQ2d0OWhGeDZZVkZUSk5GR0MtSmpIeEpmdXhvc2ZtSGNieUY2MThGZ1ZPbDQ5ajJvRG8xZVpOTGdoTjZPaS1qdU53a1lqSjNZd1ZwVkxUTmdoQjhYNEhDUDdnbEtNVXh1Qmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "First child death reported from flu this season in Virginia - WTOP",
    "description": "First child death reported from flu this season in Virginia  WTOPYoung child dies of flu in Virginia, the first this flu season  NBC4 WashingtonNew Jersey Mom Whose 2-Year-Old Son Died of the Flu Recalls His Final Days: 'I Will Never Be the Same'  People.comVirginia reports first pediatric flu death of the season  WWBTNJ child flu death: Mom speaks out after 2-year-old son was sent home from Morristown Medical Center  ABC7 New York",
    "published date": "Thu, 15 Jan 2026 22:37:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNazdhSkxVZ3YxRmpWdFZfcmkxOURyMnlHNHJkYVhKcnNpMnB2TXpwc0JieVp0VUNPd1BqVkRRVnllVGhOSDlaNmdKY0FoMVNEM2dWZWNhdEJ3MjhMNXdIZEVhV2V2Y1N4R0ZtYU03UzgweWFvaXV5S2lrTXN6SWIyOGZOOFc4QWR1YURyU2lIWEhKMzVtaVRIcERR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "WTOP"
    }
  }
]