[
  {
    "title": "Poll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement - NPR",
    "description": "Poll: Two-thirds of Americans say ICE has 'gone too far' in immigration enforcement  NPR65% of Americans think ICE actions have gone too far, poll shows  USA TodayTrump’s deportation push is scrambling New York’s suburban politics  PoliticoICE gets even worse ratings in polling after Pretti's fatal shooting; majority calling for Noem's removal  ABC NewsThe Actions of ICE, February 2026  Marist Poll",
    "published date": "Thu, 05 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVVU4aGpoRmZtVi01MDdseFZ3MXYtQ19tUFVNbmZGSXNveEFrNDdsMllaUlNBcC1qWXNTZzF0MXdYS1JTSUl2QWlzc3RMTHp6eWE2WjQ1anhhS0xuY0d5alcxSHhiT0lkb09GdmVXdm43Z3BVWXBuWjE4ZE42cVMweFp3UHdvLUhYdFgzQjZsYmpLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Prosecutor Fired After Voicing Frustration With Immigration Caseload - The New York Times",
    "description": "Prosecutor Fired After Voicing Frustration With Immigration Caseload  The New York TimesSurge in Immigration Cases in Minnesota Pushes Prosecutors and Judges to Brink  The New York TimesTrump admin attorney leaves Minnesota after telling judge her job ‘sucks’ amid crush of immigration cases  CNN'This job sucks,' overwhelmed DHS lawyer says in court hearing over ICE's response to judicial orders  ABC News‘This job sucks’: Government lawyers, drowning in immigration cases, have had it  Politico",
    "published date": "Wed, 04 Feb 2026 17:40:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNYXpSMjVDb21nYWUyT044djVZOFZ5SlVLdUFISE1Ja2R5TmdaUDBWWTRRNWt2VUhjN0gzZ282X1l4MWd1NlRvYmZibmtyWEg2b20zNlR5NnBmVUxDeXRlS2dETjA2UF8wbVJjdGs3VWlHUmwzam42ZEEtQjJsLTFUVGo3LVB4NmxOLUl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPREpstein Built Deep Ties To Silicon Valley. But His Tech Investment Record Was Lackluster  ForbesJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  CNNLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC NewsTrump says America should move on from Epstein - it may not be that easy  BBC",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Brad Karp: Wall Street law firm boss resigns after emails to Epstein released - The Guardian",
    "description": "Brad Karp: Wall Street law firm boss resigns after emails to Epstein released  The GuardianPaul Weiss Chairman Brad Karp resigns after Jeffrey Epstein email disclosures  CNBCNYC la firm chairman resigns over Epstein files. What we know  Detroit Free Press‘Call Brad Karp’: Epstein’s Fondness for Lawyer Ends in Downfall  BloombergChairman of major law firm resigns after Epstein emails become public  CNN",
    "published date": "Thu, 05 Feb 2026 13:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOR3VGeFpiOS15Uk05T0JaWmFiOFlwWEdsVkpFUXNCSU1pOGlOYTgwMWR2Z1prTDRieWhXQXo2eWJFUDFSd3N2VlVkMlNfbkd4cmtoZTdlLW9GZnBydngybzd2cC1FOWhvWDBDczJDZndXS0RmcXZPWC1VanJMOEtYQzZ5dVEwODFnNGs0YXhOaWdUcnlFSmcteUlFcG1udzk2emc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "ICE can't make warrantless arrests in Oregon unless there's risk of escape, judge rules - NPR",
    "description": "ICE can't make warrantless arrests in Oregon unless there's risk of escape, judge rules  NPRFederal judge rules against DHS on warrantless immigration arrests in Oregon  Fox NewsOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesFederal constitutional violations threaten foundation of democracy itself, says Portland legal scholar  Oregon Public Broadcasting - OPB‘Defies human decency’: Oregon judge says ICE can’t make warrantless arrests unless there’s a flight risk  KOIN.com",
    "published date": "Thu, 05 Feb 2026 06:34:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQOXg4d1VfUW9XelFzYndBRW9MNHFoWm43WVh2LVNNdlVUcGpWTWRqZDZuZGVjeVIzQ0ZEbkxXMzVUZzZvVGN5am4zZkxPQnY2QW1lUUlBQW9CeFNZVVFRWDkzZlE5WHBHREtCNUs0ejBnT3ZSQklVWmZCZHdwVWFOak9lLUd6aTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report - ABC News",
    "description": "Housecleaner said multiple illnesses tied to Las Vegas house with possible bio lab: Police report  ABC NewsLas Vegas biolab: Answering some of the biggest questions still looming  KSNVFBI serves new search warrant on California ‘biological lab’ tied to Las Vegas raid  FOX5 VegasSuspected biolab discovered in Las Vegas home sparks federal investigation  CNNPotential Biological Lab Found In Las Vegas Garage, More than 1000 Samples Sent for Testing  People.com",
    "published date": "Thu, 05 Feb 2026 05:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQbGZSSFBTQktQSXBOMlRZalVvQnk4NzhNWkVhVEpPVUF0LXYyQ2o0SUZGTEIzcjRsS1YwLVhBTFVCOUpnbllaWHpsbUVUU3ZqUUZBQnBpa0tvbzIzelhZTUpXTWhUUUVZSUNmaTVGRUhqd25OLXAxZmo2aGlVcXZQcFg3cEZYZUExeTJjRmtHamMwUjhtVDN5R0NENkR1SmdHaWNV0gGoAUFVX3lxTE9mZ0hmV0E4TGtaaXZUaXpzM3JNYjF0QW1KTllYNmo4RzUzLW5rbHpfNzNfQ3RNcXlOMnVDMkZiSlhhLUF1X29BWmdvcnl0OUVUamJPSk5nSXJDNWJmTzFIbzEzNTRaV2VqZ1U1cExVR1I5TzM5emFPZkhrZFVOdWFYZnBvM2VVdDVCSjdJZURaUWNjQkpVSWlSY1ktUmxCTno0djdiSTNSNg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks - Axios",
    "description": "\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosGOP game-plans for a DHS shutdown, as skepticism grows over talks  The HillCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  PoliticoTrump Signs Bill to Reopen Government  The New York TimesPartial shutdown ended, as Trump signs package securing back pay for furloughed feds  Federal News Network",
    "published date": "Thu, 05 Feb 2026 12:26:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5Ga0oyRmVOUDV2ZlpSZkk3QlFzQzhQeVI3QXQxV1kzbUk2V1lLVDhfR2dfUlAycnRtdWhqYk82YnN5aTRuTUFPUHd2RDhyUzlROVZnT3lYd1Y5UzAwc090WllKUmY0TU1yTlZRYldnSTBRVEozV3plNWdQd3Nqems?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump Administration Live Updates: Democrats to Lay Out Demands For Restrictions on Immigration Agents - The New York Times",
    "description": "Trump Administration Live Updates: Democrats to Lay Out Demands For Restrictions on Immigration Agents  The New York TimesDemocrats lay out demands for DHS funding, urging GOP to \"get serious\" with both sides far apart  CBS NewsWhat Restrictions Are Democrats Demanding for Immigration Agents?  The New York TimesWhat to know about the congressional fight over ICE restrictions, and another possible government shutdown  ABC NewsDems outline 10 demands in letter to GOP leaders in ICE funding fight  Axios",
    "published date": "Thu, 05 Feb 2026 14:17:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE9Zb2RzNDdXNEZlM3lvcjVlek1uY2h2YWFMQVltbVBsX3RaaFhxUXhReG14OVp5VHYwT3JBWlo5SkFOdGVZWG5sbmJoR0lKNHlhLVowWU5kd1k5QUVpbkFQUzRCTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites - Politico",
    "description": "Steve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoSteve Bannon calls for immigration agents at polling sites during midterms  The GuardianBannon: ‘We‘re going to have ICE surround the polls’  The HillOne month into 2026 and Republicans are losing their minds  Democracy DocketSteve Bannon wants ICE to ‘surround the polls’ as Trump doubles down on seizing elections  The Independent",
    "published date": "Wed, 04 Feb 2026 21:03:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZWhqcktsdVQxQnh3TjUxemQ0TlNUaV9Sem5yMlpUVGFvYXdBOWtfM2g5Rm9LZW0tYWFEdlAtSEVoZXlHVGk5eHJFYWI0UGVuX1BPTU9GdFZrNDFGVWFTLUY3MkdmTFNodVZ5VUtpWkFsWk5pNk5iSmhDemNhaUp3N1RfQmx5Q0UyV29ydGhhaW1XeE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Spanberger takes further steps to remove Virginia from ICE operations - The Washington Post",
    "description": "Spanberger takes further steps to remove Virginia from ICE operations  The Washington PostGovernor Spanberger signs Executive Order and Directive, establishing principles for Virginia Law Enforcement  WSLSMS-13 Gang Member Who Confessed to 5 Murders Arrested Just Weeks Before Spanberger Ended ICE Cooperation  USCIS (.gov)Spanberger orders state law enforcement to exit federal immigration agreements  VPMVirginia’s New Governor Ends ICE Program. Local Contracts Remain, For Now.  boltsmag.org",
    "published date": "Thu, 05 Feb 2026 14:32:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNUJLTndRdUJMelBUY21pbVVubkV1QlJBWEZBUE9nMF9UcXF3MzQ3SkZXQUl0R21EeDhObk1kTWhycUNUN1lTaGx0eEt1ZXl1UERIZ18tS3M0X192aGxMSkVaaDdlWjBtd210OUlqVDNUcWJvTjV3YXcwaG5TeExFZ1NHV0VxTkRtSjQwZ1pUQUFNOUN3Zm1KOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Dutch Queen Joins the Military - The New York Times",
    "description": "Dutch Queen Joins the Military  The New York TimesDutch Queen Maxima joins army as a reservist, as \"safety can no longer be taken for granted\"  CBS NewsQueen Máxima to train as an armed forces reservist: Dutch media  DutchNews.nlQueen Máxima of the Netherlands follows Princess Amalia and joins the army as a reservist  HOLAQueen Máxima Enlists in Dutch Army Reserve  조선일보",
    "published date": "Wed, 04 Feb 2026 22:46:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPa0t4TllteHdWSHpCZGd2LVFleEZSaVZhUXRLV3h5MmJnci14QlktZ01xVWY4YkIwajdaM19fcmd6UWFpZ0RjYll5clR2c21nTEdNTUxIOVlIM2NHbkZUbTZCLXd3em13dGtWQml1WDV5YlhubldhUlVxejFXNEJROTZXY2VIUkVkMHlqbjRWOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Angelic face of Italian prime minister wiped from fresco - CNN",
    "description": "Angelic face of Italian prime minister wiped from fresco  CNNHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistMeloni’s face painted over at Rome basilica  politico.euChurch fresco resembling Italian PM has face scrubbed out after outrage  BBCChurch fresco angel that resembled Italian prime minister painted over to end controversy  EWTN News",
    "published date": "Thu, 05 Feb 2026 11:46:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA4eWdoSU9COUVPNmZyQ1ExdnhjSWo4a1k3MWFjUlJWandIQS1NbGc4OTg0RTF0ZHprRi00ZTd4Q1hMQU1aeFVlQ1pIN3VTeXFwdlE3a0xDbE9UZmZUdzFTSy1qY0tseWRZckVmYU5SRy15dkdGNjgxdGxNdk1pcXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Russia used Starlink in strike drones that reached Kyiv. SpaceX's response collapsed entire command systemic - Euromaidan Press",
    "description": "Russia used Starlink in strike drones that reached Kyiv. SpaceX's response collapsed entire command systemic  Euromaidan PressStarlink used by Russian forces deactivated on battlefield, Ukraine says  ReutersUkraine war: Elon Musk praised after restricting Russian Starlink use  BBCSpaceX counters Russia’s ‘unauthorized’ use of Starlink to guide drones in Ukraine  CNNMusk confirms SpaceX success in preventing Russian military from accessing stolen Starlink units  Fox Business",
    "published date": "Thu, 05 Feb 2026 13:39:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNYjltcmRxVEJnUnZLVkJ4YnFhNVJ1MHNfZE05QXZzemQ2TWJMbWJKYlFES0swRFdWNER1c2d5QmR1ZzJMeHQxYUcza3lQdkczUE9tU1FfU3NERHNGdjF6Vzd0a0VqbGJrVTJUWjh0ZFBHbEhpRDdYejJsMjZFNE95ejJSMnY1RzJuZ0xtT3huN2t6RVFOMEVQUWwzTXg0ZElaVkpyc2ttM3g3SkRIOWsweTMwVUFhaDRQRlowdzA4c093dEsxQnV5MGhfc1JuMzE2UkVwdE1zd2xsU3pH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://euromaidanpress.com",
      "title": "Euromaidan Press"
    }
  },
  {
    "title": "‘It’s Collective Punishment’: Iran Exacts Heavy Price on Protest Supporters - The New York Times",
    "description": "‘It’s Collective Punishment’: Iran Exacts Heavy Price on Protest Supporters  The New York TimesUS shoots down Iranian drone near aircraft carrier in Arabian Sea  France 24Iranian police detain four unspecified foreigners over unrest  ReutersJanuary Protests: Seven Citizens Arrested, Including a 16-Year-Old  HranaActivists say the number of people arrested in Iran over its crackdown on protests now tops 50,000  Traverse City Record-Eagle",
    "published date": "Thu, 05 Feb 2026 10:22:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPYjF2bEJNaVk0TWVET1MtQUM4ZzJCa0lVQlpUc0tkSXRsMm5ob3dmejhtRHhKWDhTejZNdmlTVVlrYmpIMFZ6eGxiNXdNaXNOajhZbDlTdjFjMU1OcEFURHQ3MGJ6T3B0Sk1VN0Z6WDlpd25jUjdZSU1mVjlNQ05aRUJzZE4wZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Layoffs in January were the highest to start a year since 2009, Challenger says - CNBC",
    "description": "Layoffs in January were the highest to start a year since 2009, Challenger says  CNBCChallenger Report: January Job Cuts Surge; Lowest January Hiring on Record  Challenger, Gray & Christmas, Inc.US Companies Announced Most Job Cuts for Any January Since 2009  BloombergCalifornia job losses slow in January as cuts surge nationwide  Los Angeles TimesSome big-name companies are laying off workers. Here's what it means  ABC News",
    "published date": "Thu, 05 Feb 2026 12:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPbTBqbzFpRzVNNVF5RE9jWktpalM4b0txbXR5dXktbW84TWRGcjJUbTVuc21jOVNEX1ZwRmoyRnJySXpRbkZ2WGtLa0l5d0JHMTNpTmpzWFl5RWVWNS1scmVIeDdCbzBGOEIxbkp6dGM3aWFFUjluRlRoNXdBV2l6cUJOM3o4WHhNaUsyS3BMalJtejFCT2YtMm42bDRtakRtcU15djhKTjlkVDAxc0xBMGl6YXZpNjNEMGdhNXR0Sy1EaV960gHKAUFVX3lxTE9tZXRkUWhIcll3MHBIdjgxZzRvSXU3ZUszMmpWS3dwaVZBUTBvUHRGU2pjVXk4NWlwUmdrT0F2b1BCVG5nOU1WWG1oLXZjQzc5M0xLR1AzVzAyR09xQnhiTVdyaDhwZi02eTc2XzBYX1JERnNSZi1JdVJmNXhjTDNHNTRmTkVETzZvSXlfSzY3blFhcURtX0hleDNsUXlmbkxWRjFDRlpxbU9mbVp0QWpwd0h4bnVBTVhHYl84b28wWEpaWndMenZ4bUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Peloton posts weak holiday quarter after splashy product overhaul fails to land - CNBC",
    "description": "Peloton posts weak holiday quarter after splashy product overhaul fails to land  CNBCPeloton Slashes Sales Outlook, Misses Estimates Despite Hardware Debut  BloombergPeloton is losing money again as subscriptions keep falling. The stock is tumbling.  MarketWatchPeloton (NASDAQ:PTON) Reports Sales Below Analyst Estimates In Q4 CY2025 Earnings, Stock Drops  Yahoo FinancePeloton Stock Plummets After Earnings. Members Continue to Flee.  Barron's",
    "published date": "Thu, 05 Feb 2026 12:10:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA4eTk5U0p3VklTX2RlazVzSXY1TE1oYVJ3elF4S2pGVV82NWpRTWp1X3htc3RxLXFXdC1YR0RpaTM2V2gtN2p0b3lYdXFkQmM4RktiaUF2T1FuRjVuMVVSMmdrNU9rRlFFbHo2aDNaR2RIWlVY0gF6QVVfeXFMTThWZVl1VldSM2FKUE5xX1NWQm1fVjI2WG9nMjlDQ3FqZVhSQS1vUTRqZHJ5c01zTTIxcEdoRFhuNEJzTTdpd1JZcTNOZHRqZ0ZBbEdFMXB6c3lCcEZNOElXRHZVZ3Z4RUFGN1NtSTdqbmVoSWpBOFl5emc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Where billionaires' investment firms placed their bets in January - CNBC",
    "description": "Where billionaires' investment firms placed their bets in January  CNBC",
    "published date": "Thu, 05 Feb 2026 12:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE42QWRCQUtRY0doZmw2MnFSMzM3TERvc0ZGMElaUk01MW40OVlSZlBhaUlpdjhIU1EzU0lqVG1FM2hJekhEdTNiV0JiQ2oxUV94bnZNZWFkMFlzMHJLcW4wNElCdDBVX3pkd0R5Um5uMjRucjJkWnBzY1NXSzk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Asian Stocks to Fall as Tech-Led Drop Gains Pace: Markets Wrap - Bloomberg",
    "description": "Asian Stocks to Fall as Tech-Led Drop Gains Pace: Markets Wrap  BloombergStock Market Today: Dow off 250 points, Nasdaq and S&P 500 down sharply as AI jitters weigh on tech sector after Alphabet results; Silver, gold fall and bitcoin sinks below $70,000.  MarketWatchStock Market Today: Dow Falls On Surprise Jobless Claims; Alphabet Shares Drop On Earnings Report (Live Coverage)  Investor's Business DailyThursday's Economic Calendar (SP500:)  Seeking AlphaStocks Edge Up As Jobs Data And Amazon Earnings Lead The Day  Finimize",
    "published date": "Thu, 05 Feb 2026 13:39:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSGxqX0xIajZLY282TFJ4NjJ1WnpocURQbXVNUVJ0dDJhU29pY2hLOV8yNENRcFpXZVNQd2JKd3hoandEWVF3bmEtUzc2OHkwSEtET196bmRIQmJYS0N3Z2hud2ZCMC1NcFRrWGkzeExDQXBRdVBUS0hiLVJQYkh0eWp3OU1WNnR2MWd0aFV1cE1senUtbnF6U2RkcmpmeDVfMlB2dndrWktvUHJRMFZmSjB3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg"
    }
  },
  {
    "title": "We Tested 35 Phones for the Best Battery Life. These 2 Brands Topped the Field - CNET",
    "description": "We Tested 35 Phones for the Best Battery Life. These 2 Brands Topped the Field  CNETiPhone 17 Pro Max has the best battery life of 35 smartphones tested  9to5MaciPhone 17 Pro Max vs. Android Battery Life: New Test Reveals Winner  MacRumorsApple’s Base iPhone 17 Lasts As Long As The OnePlus 15 And Its 7,300mAh Battery  WccftechFour months with the iPhone 17 Pro has changed the way I use my phone – the jury is still out whether that’s for the better or worse  TechRadar",
    "published date": "Wed, 04 Feb 2026 13:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ER0Q4QURsWjdyVGt1NE5CeklJUngxMDVOTmNHd0h2TVRwSHhJVW1zNGFLQl9fS1ZNRVhNZU05aWdFVnpzVndvNWNKYkx2cTc1Ry1QQldWT2pZd3RlOEo3R3ZrNmtPR0ZpQmlPaVN4OWdDb1JlM2JaaXBkUEY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnet.com",
      "title": "CNET"
    }
  },
  {
    "title": "Alexa+, Amazon’s AI assistant, is now available to everyone in the US - TechCrunch",
    "description": "Alexa+, Amazon’s AI assistant, is now available to everyone in the US  TechCrunchAmazon makes Alexa+ AI assistant available to everyone in the U.S. nearly a year after launch  CNBCChris Hemsworth, Elsa Pataky in Amazon's 2026 Super Bowl Ad: Watch (Exclusive)  People.comAmazon Launches AI-Enhanced Alexa for Prime Subscribers in US  BloombergIs your Alexa different? Recent upgrade brings new voices, features  USA Today",
    "published date": "Wed, 04 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPUW1USnItUjAtU2NnNklnSVFuVHdNMU9VNmJPNXZmMzhJdE1STlpzWlR4cHJ3ZFVHZXFNNGJlUWJYbDlyRlVNVjlRMjdpajh6bVRkZHRrV0JmSUlWSnVlRGk1d3Vzblc1Vmk3OE9VRFZkOERzaFBFMmZPaFhpcEsxRzNYS3pDRURLSmpCRm0zZDFBQnNQZElXSDZIc1JMdFVXSkZr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Pokémon to Celebrate 30 Years with Yearlong Campaign, Kicking Off with New Super Bowl LX Spot - Pokemon Press",
    "description": "Pokémon to Celebrate 30 Years with Yearlong Campaign, Kicking Off with New Super Bowl LX Spot  Pokemon PressShop the Pokémon Center 30th Collection  Pokemon.comPokémon To Celebrate 30th Anniversary With Super Bowl Commercial, Special Merch, TCG Collection, And More  Game InformerPokémon will debut a ‘special video’ during Super Bowl LX celebrating its 30th anniversary  Video Games ChroniclePokemon Center Stocks 30th Anniversary Collection With Pikachu Faces  Siliconera",
    "published date": "Wed, 04 Feb 2026 14:06:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1aeDhQSmlvbW45RzlfQmtjbG40WThWSjBmN2dwX2tndk5SS0d0VHpVbDJua0hqSTNZY1ROaVd6ZTA2Szk2aWFOaER3azRpN1VHczRzenFzZnNiTWRFMUVPTDBtUVR6SDRiY2pCRHhNb3hDUnBuQU5zXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://press.pokemon.com",
      "title": "Pokemon Press"
    }
  },
  {
    "title": "Nintendo Direct Partner Showcase Announced For Today, 5th February 2026 - Nintendo Life",
    "description": "Nintendo Direct Partner Showcase Announced For Today, 5th February 2026  Nintendo LifeNintendo Direct: Partner Showcase 2.5.2026  nintendo.comNintendo Direct February 2026: Everything we want to see  MashableNintendo Direct: Partner Showcase Announced For Tomorrow  Game InformerNintendo Direct Partner Showcase: Here’s where to watch today’s big presentation  Video Games Chronicle",
    "published date": "Thu, 05 Feb 2026 06:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOT1RFNmQxaklKbFlxbDBYY21Cb2hNel9ZTHB4SnlVUk5aelNfaHlITnV1UlFwYXZxamNwOGswSE1jVEZpbTRnR0dwQy1qRExYaXo4MXFYd0Rwb1dOM3RibGY0NDlwNmtMNDhDYmYxaHY4NXc5LW94dURLajZBUUxZaVl2aWcxWC1ibENGbDJDNWZ5TGZLOUxlR2N3Q3BWd0dLS2ZNTWUzbUMwNElkVl90WGtn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nintendolife.com",
      "title": "Nintendo Life"
    }
  },
  {
    "title": "David Ellison Warns of “Monopolistic” Netflix in Open Letter to U.K. Creatives - The Hollywood Reporter",
    "description": "David Ellison Warns of “Monopolistic” Netflix in Open Letter to U.K. Creatives  The Hollywood ReporterParamount’s David Ellison Vows Anti-Monopoly Approach in Warner Bros. Discovery Bid, Pledges 30 Films Annually in Open Letter to Creative Community  VarietyParamount CEO David Ellison Takes Dig At “Monopolistic” Netflix In Open Letter To UK Creatives About Warner Deal  DeadlineDavid Ellison has written to the UK creative community, committing to investment and theatrical windows as Paramount pursues Warner Bros. Discovery. Read more below.  FacebookParamount outlines plans for Warner Bros. cuts  Los Angeles Times",
    "published date": "Thu, 05 Feb 2026 11:43:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNR3p4V2ZySkZ2emNYSlBZSVcwVXdKM0pvYm9nX00xWXVGUF85QTU2YVU1M1JfQlNWMjdyMEFiQ3NRTU0zUDJuQW92MnRiOG1OX0ZCcG44M0FxQ1dFSmd5ZDNzZVNOM0dlMER3ZHp4akdrcG9YUDZTbE9haWpkNGtaOFVnN2hpZ3NsLUd3NUkydmxKUVBtRXNVMDZQaU9pUEhFNFlWWTRPdjNvaHBMMWVyZU9uYlg0VzJZOEdkMWhiWm1uejA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Sean Baker, Michelle Yeoh's New Film 'Sandiwara' to Premiere at Berlin - Variety",
    "description": "Sean Baker, Michelle Yeoh's New Film 'Sandiwara' to Premiere at Berlin  VarietySean Baker and Michelle Yeoh Team for New Project ‘Sandiwara’ From Fashion House Self-Portrait, Premiering at Berlin Film Festival  IMDbSean Baker and actress Michelle Yeoh team up for new film to be showcased at Berlinale  IANS LIVE",
    "published date": "Thu, 05 Feb 2026 11:00:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOYmYzVEkxNU8zcF9TdFpOcm5hSkxtTUtWLWVnV1I3UURmMlNUd3p2b0g1cmgwejBiRU1vYXNWazRiVldNRjRRV1pHTzF6d21YaWNPNjhDcXoyYVdPR0M5d1lvOU42TjNWQ0ZnT18tRS0wMDBJUmJQVGpCZ1U3V1NYX1piSVJZa3phN1JIakgtY2I4RlVoVkxfUTRDRl9ER3F0VFk4U0otSGM0cWhUZ2hrag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Jimmy Kimmel Hints ‘Melania’ Box Office Was a ‘Rigged Outcome’ - The New York Times",
    "description": "Jimmy Kimmel Hints ‘Melania’ Box Office Was a ‘Rigged Outcome’  The New York Times‘Melania’: Watching a First Lady Vanish in Plain Sight  The New York TimesThe Melania Trump Documentary Is a Disgrace  The AtlanticMelania review – Trump film is a gilded trash remake of The Zone of Interest  The GuardianMelania’s Movie Shows Signs of Bulk Buying to Boost Box Office: Guru  The Daily Beast",
    "published date": "Thu, 05 Feb 2026 10:44:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPYUtlLXBOeDJvQnNUMXR5X1ZlZktuTl8zNEk0NDBaeVA5RE4ydHpZdEZOczNNQ0hnLUpxbnVCbHktdlJPczdwNDR2TW1NMUhYRmExSGVudXptWG5ZZER6UmtBSHVkMG9oeHdHUFdiOGhicUpadDc3b2NQOXlTSExqLWJGVnJILTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "3 new Netflix exclusive movies and shows you need to stream this week (Feb. 4-10) - Tom's Guide",
    "description": "3 new Netflix exclusive movies and shows you need to stream this week (Feb. 4-10)  Tom's GuideThe Best Movies and TV Shows Coming to Netflix in February  The New York TimesHere’s what’s worth streaming in February 2026 on Netflix, Hulu, Peacock and more  MarketWatchNetflix is about to add one of the best TV shows of all time  The IndependentNew on Netflix, Prime Video, HBO Max, More in February 2026 — Full List of Movies and Shows  Us Weekly",
    "published date": "Wed, 04 Feb 2026 13:39:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOdzZfNVJoR09VSDJmQ2xlOEYwYllHek9LUEdZZ2F3Q3lhUmttQmpCU3dXWkZzQ0dIcnNtRHRETGdDRzAxV0NBdDNDNENIMWxxa0x5SnBUQWJwZHAtcVI2RFdBb1RkaWN2bER0M3dlWEJzQ1h5RDdqQlJQRFRrUzhVc3BxLTF5cmlRTDJDdHJCbG1tV3lQOFl3TUdnZloxc3hCMlhNRC1YSjJUcmxkVndIVWhYRDZkbGE3bGhLdWstRGZma2Vr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tomsguide.com",
      "title": "Tom's Guide"
    }
  },
  {
    "title": "Statement on postponement of Olympic women's ice hockey game between Finland and Canada - Milano Cortina 2026",
    "description": "Statement on postponement of Olympic women's ice hockey game between Finland and Canada  Milano Cortina 2026Finland women's hockey vs. Canada ppd. as virus depletes roster  ESPNFinland-Canada Olympic women’s hockey game postponed after norovirus breakout  The New York TimesFinland's Olympic women's ice hockey team postpones game as players deal with norovirus outbreak  Fox NewsCanada-Finland women's hockey game postponed after Finnish players fall ill with norovirus  CBC",
    "published date": "Thu, 05 Feb 2026 12:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNZzNkcGN5c0lfUG1CSXBnQ2drVjhYMEkzdk9Qci1haGpocVhMTUg3S2RjYVlOaVdzemg5dWl4cUVLQm1icTdlRjJPOHdQU19yVTQtd0NhLWpRS1dFMjlNRjZ0TEhMSDFRN3dyYlpzTzd3czhkVXB4alY0cGMwOElLVGx3TElGUHMzVE1ENXhGMkZxblNZNDRsam5Zc0VBQzJfZHAwelB3YzF4UFVXbGc1b2d6SklNSUtUZXRVdDVtQTVDYXFteUlpVDZ3V1A5OHFuR1p3aVpiVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.olympics.com",
      "title": "Milano Cortina 2026"
    }
  },
  {
    "title": "Live Heat deadline updates: Warriors out of Giannis Antetokounmpo sweepstakes - Miami Herald",
    "description": "Live Heat deadline updates: Warriors out of Giannis Antetokounmpo sweepstakes  Miami HeraldNBA trade deadline: Six Giannis offers -- which would Bucks pick?  ESPNWill Bucks trade Giannis Antetokounmpo before the deadline? Experts make final predictions  CBS SportsThe latest: Timberwolves in Giannis Antetokounmpo sweepstakes as trade deadline nears  Star TribuneWhat does Giannis Antetokounmpo want? He wants to retire with the Milwaukee Bucks  Milwaukee Journal Sentinel",
    "published date": "Wed, 04 Feb 2026 21:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BQXZWVHM4QTRLSlpOenlUd0hPWTNOUHNMaTRfVElNYUs4VW9ab1RBOWV1WEE3bkNvelFaYVh6UDFQVHdaOEFtRDVYSlhocDlNT2hXNFB3ZUhuVnpoZ3VxZVpicWphWXRhTWxVR3JFWVd4ajhyZjU1OGNHc9IBe0FVX3lxTFByYzUzNjE5aEtjVnV5OEdSUnpqQ0dQQkJtVlIyMlg3alJKQVh1WGp3cDNOS2xWS1FOZTczZWZzWkNHY1B0M3lNZ1JyOGdTSjMxNHhHdkhtM0NycmhleEg1S2pDQ09ZTFF1MTNmOEFoN3RpNnJlc2tPR0xJSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.miamiherald.com",
      "title": "Miami Herald"
    }
  },
  {
    "title": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade - Cleveland.com",
    "description": "‘Our ceiling is higher’: Donovan Mitchell opens up about James Harden-Darius Garland trade  Cleveland.comJames Harden-Darius Garland trade grades: What's next for Cavs, Clips?  ESPNClippers-Cavaliers trade grades: Who won the James Harden deal?  Yahoo SportsJames Harden Is Trapped in Groundhog Day—and the NBA Is, Too  The RingerJames Harden's early-exit legacy is more complicated than it appears  CBS Sports",
    "published date": "Thu, 05 Feb 2026 11:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOTGRSekUzWEtqOG9FaTFJZVpvbnV3QlE0cHN4Y3RIV3duNUhtbmtFdGpwdmpoclI2aDFYRFdkcmt5dzdvR3JrRkE5ODlWdkY2aXRaVVFkOU9rbi1OYkQxbTVnVUwzMkIzbVlxcVBkMk9qTzJGTHJMUzl2cE9KSnBJYUU3WFF5RVVnMnpzZ2w4djlIV183N2VvNHZSWUdDRDFyRW0xOW9vTElNNWp2cDJ1bVo3S0xFaDM3X1kwcWJQUGV4aVQ4bjhVUGZ3OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cleveland.com",
      "title": "Cleveland.com"
    }
  },
  {
    "title": "Ex-Celtics Coach ‘Embarrassed’ By Rockets’ Disastrous Loss To Boston - NESN",
    "description": "Ex-Celtics Coach ‘Embarrassed’ By Rockets’ Disastrous Loss To Boston  NESN10 Takeaways from the Hospital Celtics upset over Rockets  CelticsBlogCeltics two-way forward stands out in surprise start against Rockets  MassLiveHouston Rockets vs. Boston Celtics game preview  The Dream ShakeBSJ Game Report: Celtics 114, Rockets 93 - Boston wins big (and ugly)  Boston Sports Journal",
    "published date": "Thu, 05 Feb 2026 07:27:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPaEdOelp2a1N0YnAxY0tQd3FiWWlRb283NVN5eWpVVHN6SWMtc3dmaTJ6enVYWDMxdC1jZ1ViS2gtckY2bVM2ZVlDNVB5bDhvLW1iRUlEVkhsZW9mMkc0YWJNaDZlRjNLdFUyUVhZNER3LWk5YXB6dWtFdF9SVE5wczhNQWRUalVUMTI5Sjc0VWRQOWhwVlHSAZsBQVVfeXFMT2pkOU5VZkUxdU5nRFZUcGdUOEVQT3J2R2JsalRMcS1XSWI4dktCUmI3T0ZmdVZiblpMZTFMcjBqdF9PdzhwYjZEWXc5c0JoSVQ1WGo1RHpCYS1TV09TcmZzWDV5TTFabmxmTERuVU1DZ1R1S0JHSHZraF9NWkwzT3RNUTlZY3ctZjZ5TGppUnFSdzZvdzNpc1VTV2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nesn.com",
      "title": "NESN"
    }
  },
  {
    "title": "Transient histone deacetylase inhibition induces cellular memory of gene expression and 3D genome folding - Nature",
    "description": "Transient histone deacetylase inhibition induces cellular memory of gene expression and 3D genome folding  Nature",
    "published date": "Wed, 04 Feb 2026 11:13:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE5idDJqdzJGWVNTQl9RTzlWWlpTdEV4T3oybXNfQ3hBWU5qZmFuNTdxS09nWkxzMGhHMGU1d2ZPWmdXVjJramQtSjZkdWdNR1RZaV9XeHJ2QUlHVTNyR01J?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nature.com",
      "title": "Nature"
    }
  },
  {
    "title": "How to use the moon on Feb. 4 to plan your view of March's total lunar eclipse - Space",
    "description": "How to use the moon on Feb. 4 to plan your view of March's total lunar eclipse  SpaceThe US will see a rare 'blood moon' eclipse before sunrise this March: Where and when to look  Live ScienceToronto’s getting a ‘Blood Worm Moon’ total lunar eclipse this winter: Here’s how to spot it  Streets Of TorontoA blood moon is coming: 1 month until a total lunar eclipse takes to the skies over North America  Space",
    "published date": "Tue, 03 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPTmt4cG8yaW1tTGNWTktzM2xCUG5lUXlkaGxlXzZVaElEOUtQNHByTFhKbERTQWRkVS03bUVkQmM1WldqMl9CaTVtOG9RZE43Z2x2QWpTbmFJNGRXRWhxLXJPblZaZ2U2OHJBS2RVQVp2ZWV5MlI3VHZ6RnlVWG8xUXJjemZvLXlWOVIzVXMyaGFZV3d2cnltQ3JzZXpheHQ1VGRadHNRWTdFLTdqRkNpMkNidEVTb01ERzYzeGk1OUI2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Enormous Pair of Deep-Earth Hot ‘Blobs’ Shape Earth’s Magnetic Field, Scientists Say - Gizmodo",
    "description": "Enormous Pair of Deep-Earth Hot ‘Blobs’ Shape Earth’s Magnetic Field, Scientists Say  GizmodoMantle heterogeneity influenced Earth’s ancient magnetic field  NatureTwo huge hot blobs of rock influence Earth's magnetic field, study reveals  Phys.orgSomething Massive Deep Inside Earth Is Steering the Planet’s Magnetic Field  SciTechDailyHow giant ‘Blobs’ of rock have influenced Earth’s magnetic field for millions of years – new research  The Conversation",
    "published date": "Wed, 04 Feb 2026 18:05:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOczhJTDZmMndwM21aMlVuSVZkRXZwS2lGdUlOZGZhUWxkTEZWQTM0QTRRNDcxSTR1NEIyQTFQS09ERi1fX1BYZFZwXzRlUVh6U2NNMFFaQW9kMWE1OWp6UnNzOC1sOVloMUs2UG9VY05LY2hfUVNSODdGeFpzazcwZDFtTjdwX29fWlh4YUdaMzVyNXNhSFFUOTlUSllXM0pQODNHVXRfV1RvYWRQeTZSZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "A new comet was just discovered. Will it be visible in broad daylight? - The Conversation",
    "description": "A new comet was just discovered. Will it be visible in broad daylight?  The ConversationWill a bright comet adorn our early spring sky? Why astronomers are getting excited about Comet C/2026 A1 (MAPS)  SpaceNew Kreutz Comet C/2026 A1 May Dazzle  Sky & TelescopeAstronomers Are Watching This New 'Great Comet' That Could Light Up the Night Sky This April—Here’s How to See It  Travel + LeisureComet C/2026 A1, first discovered in 2026, will approach the Sun dangerously and could stage a historic spectacle  CPG Click Petróleo e Gás",
    "published date": "Thu, 05 Feb 2026 04:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOdDM0OGJxV29qbmF2ZjBGWmlrSUNsLWt1VzhBeDE1QUFtLVg1MFlpbUtxRk5lOGZucVRJOENEOW9VeTFIWkQzU2ZyaEc1Y1BPaHktTmJhcnRIY0JIWW8zMEdGMGJpV1JSSXN0TTFSMnl3aFRtRDhCVDVyUjNxNDJ6dGFSZXliVFhDdDZmOU5Uam9jVVFodG5GSmRaSGh1ZmNBVnBKdHdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "A newborn’s death likely linked to the mom drinking raw milk while pregnant - AP News",
    "description": "A newborn’s death likely linked to the mom drinking raw milk while pregnant  AP NewsNew Mexico newborn dies from Listeria infection after mother drank raw milk while pregnant: state officials  Fox NewsNew Mexico warns against consuming raw milk after newborn dies from listeria  NBC NewsNew Mexico warns raw milk linked to infant death, while FDA announces new testing of baby formula  CIDRAPHealth officials: New Mexico baby's listeria death tied to raw milk  Santa Fe New Mexican",
    "published date": "Thu, 05 Feb 2026 01:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPalJhLTFWT1FwQ2l3OU1fNVhLOC1PUnpTdTRwTTJzT3RHdFNhTXBfaVktNHdfOWdWN3FvSXFfaFJwMVV0Ym9PelJjN1ItVnBFdVhWLUxyWUNDVDZCeWhtRXpxTHBMVzhKT0NUNlZVMEhBZEM2a09XYTFzNEVmYkJhY2FEQkFVbFotWTJYT0dSVDJpNFN1M09oa0J2b0pJNDlxWHBLNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Measles case confirmed in Northern Virginia; find out where the exposure sites are believed to be - WUSA9",
    "description": "Measles case confirmed in Northern Virginia; find out where the exposure sites are believed to be  WUSA9Measles case reported in Northern Virginia adult. Check potential exposure sites and dates  NBC4 WashingtonMeasles exposure possible at stores, restaurants in Fairfax County, Virginia  WJLAPerson with measles traveled through Dulles airport, officials say  The Washington PostNorthern Virginian sick with measles, 5th case in just over a month  WRIC ABC 8News",
    "published date": "Thu, 05 Feb 2026 02:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxORmRYME5jdDBMNmZROXlKcWRmVUNZWmlXRUgzLTRaOURoOHJ6MjJjNWM3cnZWdkpDYkFzbkxvRmhfaGFCcUppWDNVcVctdFBjSExJeF80QktyUUYtZEJ3N3hoV2s5bmdZZENuWXl1S0Nwd0tsWF80XzZ4VjNMc1Q4WWJRYk8xVGlwY0wzSmhRbkFJd3VrdUJhWmFlQ2U3b2MzT2h5Tmlzd3VuTk1DMUp6WlYxQUYtdDB4R1FGbnpYaVVvUmtGaWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wusa9.com",
      "title": "WUSA9"
    }
  },
  {
    "title": "Calls to shut down Texas ICE facility for children grow amid measles outbreak - The Guardian",
    "description": "Calls to shut down Texas ICE facility for children grow amid measles outbreak  The GuardianMeasles Hits ICE Family Detention Center in Texas  The New York TimesMeasles reported at Texas ICE detention center where Liam Ramos was held  San Antonio Express-NewsICE halts \"all movement\" at Texas detention facility due to measles infections  CBS NewsColumbia Heights girl and her mom released from ICE detention after school district speaks out  MPR News",
    "published date": "Thu, 05 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQdDhWVVUzTWRoNi1iTTVLU01nNU11bm1zLWV0S2V5OE5ZcTJqNHgzdzlNMktZOG9TbGZNXzZEbi10NUZjV3BINEZBQUJNcHNaNkZ0Q0hyWHVraFl4RHRPdEdldGNJMUxfMms2RkdqMzBmWURPMS1YZFF1RlJrRldxekR1aTFmTXM1UmRIY3MzUWZFMVYtM1JXelZFSGU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Measles exposure in Milbank, Brookings - KELOLAND.com",
    "description": "Measles exposure in Milbank, Brookings  KELOLAND.comMeasles exposure; Wanted man found; Warm temps  YahooGrant Co. Man Visits Public Places While Infectious With Measles  yankton.netDepartment of Health warns of potential measles exposure at Brookings wrestling tournament  Madison Daily LeaderDepartment of Health warns of measles exposures in Milbank, Brookings  SDPB",
    "published date": "Wed, 04 Feb 2026 21:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPVDM1dHBfaHpfcGlLRUJoRDJsZ3llZ3F0S1VMaU5ObHBuMEVtUEluZWhYekI2WWRaYWpBd0x4Zm9YZjNoa0t4bjRMZDFUcExObHNQSDJXS29ic2gybGU0LW9XdnRYR2RyT2JzZkxmVnIzcXZMRjF0NXhIVE5wdTdweGtYVkg2d9IBiwFBVV95cUxPVHRtWlZOTmVEVXo4QWxFenRPc1NRWUdOODNnU3FVeHE5TFF1ZHlNLXVqLXJPZE5oU3VDc3NzdzJUM3pMTXNxWEwxWnlQQTdWWVhiSkE0b1ZPaTBuWVpaM0lOYzI5am4wNmlVa0h2WjBNQ05PdkVUSGxkVEJDNVNYeU9zMDQ1NDBpMkdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keloland.com",
      "title": "KELOLAND.com"
    }
  }
]