[
  {
    "title": "Trump floats new tariffs in push to acquire Greenland - CNBC",
    "description": "Trump floats new tariffs in push to acquire Greenland  CNBCTrump remains at odds with leaders from Denmark and Greenland as he eyes Arctic territory  CNNTrump threatens tariffs on countries opposing Greenland takeover plans  Fox BusinessTrump tariffs live updates: Trump floats tariff on countries that 'don't go along with' US acquisition of Greenland  Yahoo FinanceAmericans have been quietly plundering Greenland for over 100 years, since a Navy officer chipped fragments off the Cape York iron meteorite  Fortune",
    "published date": "Fri, 16 Jan 2026 15:52:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE9GUE9vcnBqcXFudmk0RWhvd29zMVFuWDBITHhKS1hVNDdiQ3FabWxQME5tT0w5dlZWUFVfOTllWjJrRUZQZmpmUVIxMlVkV05VNld1YjNkazJUQi1rNEdPZWVudWtMUC1vZUtFN9IBckFVX3lxTE4zMEYySmI4WmFNV2cybmxLdmlqVnJNblpTcTBSZVNnSWRlLWpUdVpNZXREa0hFYVB6SFlKdEhVSXNLRDJIWUs1aFpTVnRXYTE2M2J4ODFqYVVhRC1YTDZKLXp5cVpIX0NQQ3ljQlYxbjc2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities - CNN",
    "description": "CNN poll finds majority of Americans say Trump is focused on the wrong priorities  CNNTrump struggles to sell the ‘Don-roe Doctrine’  PoliticoAre Trump's supporters getting what they want from his second term? Here's what a new poll shows  AP NewsWhat is Trump's approval rating? 58% say Trump's first year is a failure  USA TodayDonald Trump Hit by Humiliating Poll Showing Just How Much He’s Failing  The Daily Beast",
    "published date": "Fri, 16 Jan 2026 10:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE41Ujd3MDF2WnQtdkIwa0FZU3VOcjlKUmZqejdMZkRFUk9USnRUa2VfMlBEUHhoNFVuNVJKR1FqYUU3N1BlekxTUHRZcEtubFlwVEtFMVNqWUltRUNmbGhjcmtkY0s5aWxGWDF2cEpFdWtMMVhHWXNiU2RoSkZXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "description": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes  BBCMother of Elon Musk’s son sues his xAI over AI-deepfake images  CNNMusk's xAI limits Grok's ability to create sexualized images of real people on X after backlash  CNBCAshley St. Clair, the mother of one of Elon Musk's children, sues xAI over Grok sexual images  NBC NewsX could face ban in UK over deepfakes, minister says  BBC",
    "published date": "Fri, 16 Jan 2026 13:56:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9zU0FGRF9XalVabl9QUVZqZVRidFZxTDBnenY1SXFMMGhjNVJ5aENRaFVGM3JaWW9iYU5rZ0k3RG4zdGVxcXRqc2oyYzd1eFRYUlk2cU42N3lKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump Cabinet secretaries conspired to violate Constitution, judge says - The Washington Post",
    "description": "Trump Cabinet secretaries conspired to violate Constitution, judge says  The Washington Post‘Unconstitutional conspiracy’: Judge slams Trump administration over targeted deportations  PoliticoJudge Proposes Restricting Deportation of Student Activists  The New York TimesJudge promises ‘crystal clear’ order protecting international students behind landmark free speech lawsuit  The Boston GlobeJudge to protect noncitizen academics involved in case from ‘authoritarian’ Trump  The Guardian",
    "published date": "Fri, 16 Jan 2026 05:57:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQZE9za1I2Y25VV2FNYjVhTVNHX18wZVMxRlpfQnJpaTVscWxDRlJ0TmtyV2F6VDhES1hFRlRpOU5ZcktMV3RPbjFYbTRqUUxTeEEycVp0THRIZnpYRkduUTVDS3VlR0ZmbWpiUkR0Q3hVUVFtcVpwVXNHQ25jX0ZjQnZmcWF3Z1h5SWVNRW8zZFI2Y1pZaVNmN3RKMEJ5QTJMZGdzTVRqSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Judge orders release of Liberian man arrested in Minneapolis by agents with a battering ram - NBC News",
    "description": "Judge orders release of Liberian man arrested in Minneapolis by agents with a battering ram  NBC NewsJudge says ICE illegally detained Minneapolis man, orders his release  5 EYEWITNESS NEWSLiberian immigrant re-arrested hours after ICE release in Minneapolis  FOX 9 Minneapolis-St. PaulMinnesota ICE surge: FBI announces arrest, offers reward after vehicle vandalism  MPR NewsA Liberian man released after his battering-ram arrest in Minneapolis is back in custody again  AP News",
    "published date": "Fri, 16 Jan 2026 15:49:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPZGhFbmdoN050QzMtcFlLcmJCMU1OZzVUTExfZmIwcGREdXgxMUJYdDlhNG1WemJJNm94ZWxtaDkzSXlib0s3WWx5WVdxNTNNT3BadnFWUkxxWWI3Yzh0ZTV2VDBWSk1FeGVVSnBSamtoUUZhaWZHeV8wWDhXbkdndy1EbEU4UXV4YncyU1ZDZzlDNlZhTnJtVFR6SzdfNndGd3RmVW5LbGY5TWEyWlRINHVnRzB1cGxteEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Trump struck deals with 16 drug companies. But they're still raising prices this year - NPR",
    "description": "Trump struck deals with 16 drug companies. But they're still raising prices this year  NPRUS pharma MFN and tariff dynamics: What EU and UK leaders need to know  pharmaphorumSecuring the Future of the U.S. Biopharmaceutical Industry: The Most-Favored-Nation Paradox  CSIS | Center for Strategic and International Studies2026 U.S. drug pricing outlook: ‘MFN’ is the future  BioCenturyThe Push for Lower US Drug Prices Uses Bad Logic  Bloomberg.com",
    "published date": "Fri, 16 Jan 2026 16:13:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOMHNxeFlMbmszZFNqc29NZmhWTGZjZDJrZ0JMX0haTkpiSjlhUUJSZWt1d0llRU9WX01rYmVGdW04MEJXX2tDNXVYdUNULVhSbjlUNzRNMkdya0FSOUVQY0hJZ3llYzV2U2tqeThVZGJWdXJGLWM1MEpibWZYZF9BeVNMYjRRX2tGSUo1UGh4SW4tQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Major winter storm moving, bringing strong wind gusts, snow to Plains and Northeast - ABC News",
    "description": "Major winter storm moving, bringing strong wind gusts, snow to Plains and Northeast  ABC News3 back-to-back storms forecast to bring snow and surges of cold air across the Midwest to the Northeast  YahooRelentless snow and frigid temperatures plague much of U.S. ahead of holiday weekend  NBC NewsClipper Storms Pepper the Great Lakes to New England  WeatherBugWinter Storm Warning As 24 Inches of Snow To Strike  Newsweek",
    "published date": "Fri, 16 Jan 2026 16:09:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOSFQxNEJ5U3g1U1N0cWJCYUpCNk9ZYzZIMG5aWnFUSm5fUXpWRDYzSUxteG5hQUNJY2tBRzNnTFppc09JZEZUOW44TXp2VFhqVjBnVjJyQlY2SGpDRmk3OXhnRWNiUjR3dWRFcVZ0MzBPX3hEQkdoOU1XNzFSb3ZfemRpUTRRSzZZNWc1VFpLb21VQTZGd3JncGJ3azlaQdIBowFBVV95cUxOVGlwVFlHbHNaMHlFT1NCQUhQZWswMkpRM0wzOHFQOVZyYkdzV2FFZEkwazA5SUZUNjZRU252OXMxcjRxUmU0YUlnYzdvakM4ckxvbmQtSGc5dkh2MWd5emUtU051RF9lc3RqaW0tQzMyb2Q2aWoxNmRuaDhWYlRBbFNoTGFpMnVGVy1LWEF4cVdrTUt3a2pWRFVxMjRMWGU4cGhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "‘Dumbest thing I’ve ever heard’: Republicans amp up their resistance to Trump’s Greenland push - Politico",
    "description": "‘Dumbest thing I’ve ever heard’: Republicans amp up their resistance to Trump’s Greenland push  PoliticoRep. Don Bacon would ‘lean’ toward impeaching Trump if U.S. invades Greenland  MS NOWBacon says he would ‘lean’ toward Trump impeachment if Greenland invaded: ‘Utter buffoonery’  The HillMcConnell Is GOP’s Voice in the Wilderness on Greenland  Bloomberg.comGrassley says Trump doesn't need to take Greenland to protect US  The Des Moines Register",
    "published date": "Fri, 16 Jan 2026 14:55:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxObWxiOWtKa1Z0eVk3TTlvYWlWWnBRN1FmaUx3UzJZNTJobFQ2eUNWd01ValNmU1JoN21meEVRcVIxV1J5UFR6NG5SZGRFUVhVZ2pIQm9WZUVqOTZtd25TSlpyZXhEZDdma2FPbTBwNUlfbWFueWVyTDNQcDFXUHR2S1ZCTXhFaXptbW1GckdQdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Medical examiner likely to classify death of ICE detainee as homicide, call says - The Washington Post",
    "description": "Medical examiner likely to classify death of ICE detainee as homicide, call says  The Washington PostReport: Migrant's death at Fort Bliss detention center likely ruled homicide  KFOXMan arrested in Rochester dies at ICE facility in Texas  13wham.comReport: Death at Camp East Montana could be ruled a homicide  KTSM 9 NewsDeath of man at ICE camp could be investigated as homicide after examiner’s report  The Guardian",
    "published date": "Fri, 16 Jan 2026 06:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNWlJYZl9vcHFBdW9FVC1WTXdURGExUTdTU3VCeHc5dVpuY0d6bXVnWkU3Z0VodGVBVUMyNFJjVmY0TktnLU8yZ09nUEs3QWJlQ1VsU052QzhJT3I3RUNDU3FPWVFOdlVmQ0J1Q0ZISzhRMC15UGliLXU3UDFnN0JsVExRSEVST0xRMUt3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Cumberland County DA cancels news conference on ICE activity after state court concern - Portland Press Herald - Maine Sunday Telegram",
    "description": "Cumberland County DA cancels news conference on ICE activity after state court concern  Portland Press Herald - Maine Sunday TelegramImmigrants prepare for their arrests and leave Lewiston ahead of ICE action  Bangor Daily NewsFeds won’t confirm whether ICE surge is coming to Maine  Portland Press Herald - Maine Sunday TelegramLegal advocates urge Mainers to know their rights amid rumors of increase in ICE operations  Maine PublicTrump targets Maine’s Somali population as federal officials consider new enforcement operation  MS NOW",
    "published date": "Fri, 16 Jan 2026 15:00:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOaERkdE8wSVJzdFJPaGFSMHRIYnBMM3lxVE9KSmU0bUlINVBtQ2hid2RRTkhFRFoxeThfVlRqQXRWMllraGx2MmtsN2hBbDlkS2lrTkQ2VlA3LTBwT2hFSk9RcERBckRYZzcxTVhvZ0JLVTZwSUxvSThOWUl5RWZaS3JIQU5UbEpFTkMwa1RrYTRNR0lESVktY1Z6WnBsVjdwLW11TWR5cjY3M3J0SGF6d2t6cERJOXlZcDRSdXZsWjg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pressherald.com",
      "title": "Portland Press Herald - Maine Sunday Telegram"
    }
  },
  {
    "title": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded - BBC",
    "description": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded  BBC‘Everyone is sick of this crap’: Jenrick defection deepens rightwing divide  The GuardianJenrick’s Tory constituents are following him to Reform  The TelegraphWhere Robert Jenrick’s defection to Reform UK leaves the Tories  The EconomistAdvantage Nigel Farage as the right realigns  The Times",
    "published date": "Fri, 16 Jan 2026 12:43:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBFSTBLZ0xhMXc3UkdpcEM5UGY3MHgyZ2s2RlZlV2Z5ZjVoeC16MEJkYksxNXBvN1cxd2QybWZyWU53OUdULUtpcVF1NVRELU1qUUh2UGxwelMyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘An attempt to break people’: Bucha holds out amid Russia’s weaponisation of winter - The Guardian",
    "description": "‘An attempt to break people’: Bucha holds out amid Russia’s weaponisation of winter  The GuardianRussia Knocks Out the Heat in Ukraine  The New York TimesUkraine scrambling for energy as Russian strikes hit infrastructure  Al JazeeraZelensky declares state of emergency in Ukraine's energy sector  BBCUkraine able to meet only 60% of electricity need after Russian attacks  Reuters",
    "published date": "Fri, 16 Jan 2026 13:18:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNZ1c5QzBPWDFjT09aeWpKcGFLd2l6d05aVUFmQ0o1OGlFVVJtSEUwTWowVmZ1WVdLS3VsT1pRNFAtLU1aQzZtNUlNQWNlQ19oZFVMYkVic0dSREhhaGw0bXYxRVhRV1JjRUhyMEM1S3p4UHJwTnFkcy1mOUpKRVpmVDZvcnBVa2JUa3g0QjdjZ1FvVWowVktJX1Fnd0lwa2d1VUZMOW1Qek9qS1ZuUlBlbWxVZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Live updates: Middle East allies urge Trump to hold off on Iran strikes, diplomat says - AP News",
    "description": "Live updates: Middle East allies urge Trump to hold off on Iran strikes, diplomat says  AP NewsTrump says Iran has ‘no plan for executions’ as US weighs military options against regime: Live updates  CNNIsrael and Arab Nations Ask Trump to Refrain From Attacking Iran  The New York TimesIran’s Gulf Rivals Warn U.S. Against Strike on Tehran  The Wall Street JournalGulf states and Turkey warned Trump strikes on Iran could lead to major conflict  The Guardian",
    "published date": "Fri, 16 Jan 2026 17:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE0wcHhuYmhGVnZIWnJyUXBhZVB1ZHNTLU5vNUlKQ2x3OUJuLUJjLWhrZkpVOU5nOTdLVUh5cS1PUXZDMVkweFdiRlVuZTlWNDlmOTRQVkd5LWR1LXd0c3hoZGJJQWFjdFpjN3Ew?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "How Venezuela Becomes a Quagmire - Foreign Affairs",
    "description": "How Venezuela Becomes a Quagmire  Foreign AffairsWithout democracy, Donald Trump’s Venezuelan oil quest will fail  The EconomistMARTIN GURRI: Let's look at all the global benefits Trump reaped by grabbing Maduro  Fox NewsWas Nicolas Maduro ‘flooding’ the US with fentanyl, as White House claims?  Al JazeeraOpinion | In Venezuela, Trump Has Put Himself in a Box  The New York Times",
    "published date": "Fri, 16 Jan 2026 05:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5sM0t3WGVRbzdDY25zUFpHUkNDSGFpZWRBbzFEaWFuSDQtUE5Nbm80cV9kTlRfNG4zVF91dzZydWJFaHZOYnFmNzl3d1owNVhrT1VXYlJxNnpidDhHTnF5WUZ0V3JwaHF0OHJWWVZmc3hjcjdxRlVDSGNhbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foreignaffairs.com",
      "title": "Foreign Affairs"
    }
  },
  {
    "title": "Trump to Announce 401(k) Home Investment Plan at Davos - Bloomberg.com",
    "description": "Trump to Announce 401(k) Home Investment Plan at Davos  Bloomberg.comDonald Trump to unveil home buying plan involving retirement funds  BBCWhite House Plan Would Let Americans Tap 401(k)s for Down Payments on Homes  The Wall Street JournalTrump's new affordability pitch: Unload your 401(k) on a home  qz.comHassett reveals Trump housing plan would let Americans tap 401(k)s for down payments  Fox Business",
    "published date": "Fri, 16 Jan 2026 13:53:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOdnpXbGdHQ1lnNUlTYXZzWFY4ZDFzRHNPUktQcklLQy1fcF9JSEczSzdTcWdJaWZPUjlMNDVKdzdROFBWMTZBSGJrTHY5azQ4N3VzVENjaFhfM2hGNkRjVm5yTmg1WVlUU0tLbW8wTkNBSk9LSEFFeGtjczJBZlR1VndaNEtyaEVDSnVZRGdrOUtQdkdNRF9sOVp5SnE2cGgzNXhuZWtCSjJseEY0ZUNEWGlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Trump's proposed ban on buying single-family homes introduces uncertainty for family offices - CNBC",
    "description": "Trump's proposed ban on buying single-family homes introduces uncertainty for family offices  CNBCView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 12:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBOUXlsMmpiOUhXNTVZN0JZbzlXY0c0MFNTWHlwUXdkVzZfMWxQbHUtTG9TZm45TVQ3b3VrTU9RUmNuaW1XbzN3RUh5T3BnV2RoMkFtMDV3cVlabmxpb0FOaDdnMnNXakZJcklpZEpCcGhaY1pIMUpZMGlwcTF4d9IBgwFBVV95cUxPeUsxNG1pZEp5dHZIbGxnQ1o3dUFpdV9WVEs4YmxjMUxnUzFDUHRia2hVT2pOOFFnT2VKeE50VEJ3R0N2aXRmODJKS1hVOEUtSmxzTU5ISVZoMkh4eU1KcGlwTVRBdXVCMUV5Y0VYbERpVTJaM0stTWNFTFhxZ0NjNjU3bw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "How to claim Verizon's $20 credit for Wednesday's service outage - Engadget",
    "description": "How to claim Verizon's $20 credit for Wednesday's service outage  EngadgetAn update on our network outage  VerizonIllinois Verizon customers eligible for $20 credit after outage. How to claim  YahooNo doctor’s appointments or Google Maps: Why Verizon’s massive outage was such a big deal  CNNVerizon’s Hourslong Wireless Outage Tied to Software Update  The Wall Street Journal",
    "published date": "Fri, 16 Jan 2026 15:32:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOWDVxZWxVeWFsZmd5U2FKQnVqdzA4QldfWjBEVE4zUzFqRDRwUmRwZlhaUVpzY0FOcnJiSVV6OTRLaG4xTmdBRFBNVXV6YXM3X1l0dmxYWC0xSW53bFdLR2dib0JiUkxiYTBoTHNhUTlveXhtV3JRWFRDd1dkcWpodV9QSEt6NmRVdWg3dWdva1NrX3lGeDBHMEVrUEZaZ0taU2YzX1JwT0d4UDR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.engadget.com",
      "title": "Engadget"
    }
  },
  {
    "title": "Hottest Credit Markets Since ‘07 Spur Warning on Complacency - Bloomberg.com",
    "description": "Hottest Credit Markets Since ‘07 Spur Warning on Complacency  Bloomberg.comCredit Spreads Hit 2007 Lows as Global Bond Issuance Surges  Yahoo FinanceMajor money managers issued a warning about investing in corporate debt  FinimizeThe credit market is experiencing its hottest surge since 19, with AI giants' debt issuance potentially triggering a storm of equity and bond pullbacks.  富途牛牛Global Corporate Bond Yield Spread Sinks to Lowest Level Since 2007  TradeAlgo",
    "published date": "Fri, 16 Jan 2026 12:03:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQVUlkbGdqVmJoc09Zd2dTLVBiOFVRZXlyclVPLVdGQlFTQUVLT2xVX0wwMGxEZktqVnh6NXo5TW5WZm9CNHFZcHFsRHpnOUpKNDdRMnQxNE9mSmpibktxTjlPbU5LYkprX0V2cWx6U3QxMFZ5RlBuRU4ycXdNNkQ0aUVPZ00wRFFCSWRNWlI3UXh2UnVQUllFWVZRajU5azVkdHVVNndKRU00cGFsMURBWUYtVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Apple's iPhone 18 Pro & iPhone Fold specs detailed in report - AppleInsider",
    "description": "Apple's iPhone 18 Pro & iPhone Fold specs detailed in report  AppleInsiderJeff Pu shares expected tech specs for the iPhone Fold  9to5MacExclusive: Is Apple Late To Foldable iPhones? Ming-Chi Kuo Says Cupertino Isn't At 'Disadvantage' As Samsung Sees Foldables Go Mainstream  Yahoo FinanceiPhone Fold and iPhone 18 Pro Models Set to Debut A20 Pro Chip  MacRumorsiPhone 18 Pro Leak Points to Under‑Screen Face ID, No More Dynamic Island  extremetech.com",
    "published date": "Fri, 16 Jan 2026 12:45:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNSVN3TjFkd2RNR0x5dWc2ZnFIR1BSWDl1X1JqTXRFUFJIclhyRWxWSkJPM3pqQVlDdnFPSXdsM2Vkblh2ZmdKRFItQ3FkUnh5VG1aUS1WX2ZMUWhnVVJGWDNIYkpGVUpqSHMzOW5OMVJIX0RIazhDY1FtSFRMMWhfU29uT2tKUF9MMXRSdmluVkx1a0hUYmdqWDNHaTY0LUlSUXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://appleinsider.com",
      "title": "AppleInsider"
    }
  },
  {
    "title": "Google is finally copying this Apple Watch feature for its Pixel Watch - Android Authority",
    "description": "Google is finally copying this Apple Watch feature for its Pixel Watch  Android AuthorityLeft your phone behind? Pixel Watch wants to save you from that  Android PoliceGoogle Pixel phones might soon notify you if you leave your Pixel Watch behind  TechRadarGoogle Introduces 'Left Behind' Feature for Pixel Watch Users  indianewsnetwork.comPixel watch may soon warn you if you leave it behind  The News International",
    "published date": "Fri, 16 Jan 2026 08:15:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPZEdwSUYyRGd6TXFCLTVnYkN6cU9CbUJRVUZDb1VzVEFUQmF3VUdTdjdXWDZwR2Y5UkhlX2xSc0VjQnFCLWVxd2ZkMFFJM1M1QzROaFQ1bkJrYWpQVzZjaXU5cE1EbnBOYVR0cm1tQlNZNGYzUXZfZ0pGZ2E3ZFdxbE1tXzI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "iPhone 17e to Gain Dynamic Island But Display Still Stuck at 60Hz - MacRumors",
    "description": "iPhone 17e to Gain Dynamic Island But Display Still Stuck at 60Hz  MacRumorsiPhone 17e Release Date Just Weeks Away But 1 Feature May Disappoint, Report Says  ForbesThere’s never been a worse time to buy an iPhone 16e  MacworldApple's iPhone 17e will get Dynamic Island, report claims  MashableiPhone 17e price in India, Dubai, USA, UK, release date, colour options, camera, specs, and more  MSN",
    "published date": "Thu, 15 Jan 2026 11:03:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5PS3ZxejlPdzRSRmVVU1hzMWo1S1dmRlRoLUVUbUdZZk9nTDhzM3hNdU1zeG1JY3BtTVlCenB4LU9iOXlNbzFPWi1Lc0RhdGFqdnJEdnBOVmtMcjlFMXZqZHlRSTdpT3VHVVpaZFNQZ0phR3JCcVd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "GIGABYTE is thinking about an AORUS handheld, but won’t copy rivals - VideoCardz.com",
    "description": "GIGABYTE is thinking about an AORUS handheld, but won’t copy rivals  VideoCardz.comGigabyte CEO Wants 'Differentiation' Before Committing to Gaming Handheld  TechPowerUpGigabyte says your handheld gaming PC won’t ship without a real twist  Digital TrendsGigabyte Won’t Build An AORUS Handheld Just For The Sake Of Making One  Lowyat.NETWill Gigabyte Make A Gaming Handheld? Here's What The CEO Had To Say  HotHardware",
    "published date": "Thu, 15 Jan 2026 16:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPTUY4WFlncGVLN3d0OTUyWTJvOGJxWlhRTTV6RWxHZW9yTVQzOTEyRUFRTnhOX1FuR3kwa0xJVDFjbWpwQmFRQkxaZUozdkpsMkswODZDc1ZHVVkxT1VKUWJpUHk1SjJPNlVsX05wTTNOYm5IajRNUDVTdmEwUU1HMVhSTk9ZUWVPc0NCWUc4UjJCRVMxdTIxRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://videocardz.com",
      "title": "VideoCardz.com"
    }
  },
  {
    "title": "Ted Sarandos: “I Don’t Know Why” Trump Shared Article Saying to “Stop” Netflix Deal for Warner Bros. - The Hollywood Reporter",
    "description": "Ted Sarandos: “I Don’t Know Why” Trump Shared Article Saying to “Stop” Netflix Deal for Warner Bros.  The Hollywood ReporterNetflix and Paramount deals are both wrong for Warner Bros Discovery – and democracy  The GuardianTrump Shares Post Accusing Netflix Of Being 'Woke' — Is President Signaling He Won't Support Warner Bros. Merger?  Yahoo FinanceTrump’s involvement in Warner deal follows past presidential moves (FTCWatch)  MLexTrump Indicates He’s Really Not Into Netflix Buying WB, Wants To Stop The Streamer’s So-Called “Cultural Takeover”  Deadline",
    "published date": "Fri, 16 Jan 2026 13:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNjJJaUdacmQzZ2lWVml2OW54bGUyb3A5X2YyRWVkZGlBUjNwVWJySHBmbDNKdFJPRHJrTjhrRHhmVmJlajdtSVNKWlRHeTZMaEo5aDRXSVl2aWNOVXFValRSdVZPRDNRNG1YcmZUM1ZXczl5cjVpR2FpeFplb1ZnRFZLckxuUy1DckQtYWhUZ29wUUItYU9vMEs0RG1YUWZIR0tETmVqRXI0UXJjUFVxYlhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "‘The Madison’ First Look: Taylor Sheridan’s ‘Yellowstone’ Spinoff With Michelle Pfeiffer and Kurt Russell Sets March Release Date - Variety",
    "description": "‘The Madison’ First Look: Taylor Sheridan’s ‘Yellowstone’ Spinoff With Michelle Pfeiffer and Kurt Russell Sets March Release Date  VarietyTaylor Sheridan's The Madison Sets Paramount+ Premiere: First Look At Kurt Russell, Michelle Pfeiffer, And Full Cast  YahooMichelle Pfeiffer Steps Into the ‘Yellowstone’-Verse as ‘The Madison’ Reveals Premiere Date, First Photos  The Hollywood ReporterThe Madison First Photos: See Michelle Pfeiffer and Kurt Russell in Taylor Sheridan's New Yellowstone Spinoff  People.comTaylor Sheridan's 'The Madison' Sets Release Date With Season 2 Coming  Deadline",
    "published date": "Fri, 16 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNWk5DZFM1RjNiczdiSTRWSWxYS0JnQjFiQlhDS1J0ZktoWGU2Q1BkMVJEeGY3dktteXZ5SWl0UU9xSkVsX01HU3RERW9vems4VW4yRmxVemtsczBGLXZfaHdtdlNSRlJtSldJRmdXRE9qSHNIWTdWeUFqY2xtdVFsMjRYYi0xMElZeTAtQzJGQW5SSDhfQlhNdVE0VXVZNE9PLUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Bad Bunny’s 'Ridiculous' Requirement For Super Bowl Halftime Show Has Fans In A Frenzy - Yahoo",
    "description": "Bad Bunny’s 'Ridiculous' Requirement For Super Bowl Halftime Show Has Fans In A Frenzy  YahooBad Bunny's Super Bowl halftime show: Get a 1st look in new trailer  ABC NewsBad Bunny Delivers Defiant Multi-Cultural Message in New Super Bowl Trailer: ‘The World Will Dance’  VarietyBad Bunny Goes Dancing in Apple Music Super Bowl LX Halftime Show Trailer Ahead of the Big Game  People.comFans are freaking out over the height requirement for Bad Bunny Super Bowl halftime show  San Francisco Chronicle",
    "published date": "Fri, 16 Jan 2026 00:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNbmwtOVM2MUZFQms4emVUUmNLN2xPbTBOQjF5dXVGbVV5OGdBREx6VEhSTUJqT2JpVTBtT1NRTWgtaVlxdFh0VGxHUGdDT1BhbDBZUVhCQXpyenVkeWYwNS1rYVlTdW1BNEdzMlFtRFhSc3Y4aW5SWlNwY09Gbm9UMmlHNlRXM3NDTjQ4bnFSWDVYb1NDSm1MbHNlZmJ4WEo3VUtzNGJxaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Box Office: ‘28 Years Later: Bone Temple’ Makes $2.1 Million in Previews - Variety",
    "description": "Box Office: ‘28 Years Later: Bone Temple’ Makes $2.1 Million in Previews  Variety‘28 Years Later: The Bone Temple’ Review: Sympathy for the Devil  The New York TimesAn Apocalypse Film That Will Prompt Wild Cheering  The AtlanticHow Jack O’Connell Became Hollywood’s Favorite Bad Guy  The Hollywood ReporterRalph Fiennes Continues to Battle Zombies in ’28 Years Later: The Bone Temple’  Yahoo",
    "published date": "Fri, 16 Jan 2026 16:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQZUJMQnI1Z0U1VmsxTFhLVlRhYjBMWmpBMEJ4SENlRUVPQlF6d2c5eTZuTmRHVE9Id2NtaWV4U1hqenFsQURWVWw2NDBPVDVIQkZMandMWTVyUWx4VjJvOF9VS2wzeVZEdUZkUW42V2o2djdzcWVqX2tBcVlLVldzOUdIMVRsYjdzQU00aG5lMllVM2xhWmZ4enlmYlUzV2Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Rams vs. Bears weather update: Snow, wind, cold in forecast for NFL divisional round - NBC Sports",
    "description": "Rams vs. Bears weather update: Snow, wind, cold in forecast for NFL divisional round  NBC SportsRams vs. Bears odds, picks, predictions: Best bets for NFL divisional round game  Yahoo SportsAre Rams walking into weather disaster vs Bears? What team is saying  USA TodayWhy the NFL chose NBC for Rams-Bears divisional-round game  Chicago Sun-TimesFans prepare to cheer on Bears at frigid Soldier Field for playoff matchup vs. Rams  CBS News",
    "published date": "Fri, 16 Jan 2026 14:58:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPSVVwQUZiV1h6Z3ZRWmQxQjBPUS1idk5uRzA3TXBnM05sNnFBTzhyeWlOam5iUVc5M1RJMUZnekZwZDRKNDcwaXN1eGt4d0xiS2ZVRHRPcXpLV2VScXVYWFFaaUZiemlrcWhlT3JIMEM5SHlmbDVkMlM1WW9zMWFYa3hKNG5mRzI2RVFmOHlRc0tYSG5lVTVlaXJfeVVhSWxteEVUalY0N0JxNnZNM2xkYzFFMmdTMmpPOWVQZ1g1Nk9OSElkUTcwcURrY0dvbFdkcmd2YzFoOXZrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "Ryan Garcia causes streamer to scream in pain, vomit after vicious body shot - MMA Fighting",
    "description": "Ryan Garcia causes streamer to scream in pain, vomit after vicious body shot  MMA Fighting",
    "published date": "Fri, 16 Jan 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNV1BOZGlVbUZXVzdLSUlzdWZKeC15dzhkZVBSUnVobTJKNXpKWmViR2FDTk9KRnVRZlNQUTU1OXFMSHo5bEZtUlhpcG5jQ3FWQnpFbHQ4bTNmRXlZcjhjRHVJTXZDOGdnc3o5V0FZUmZha2FsaER5VU1hNUYxX2JXSmxoNi1yZEw4UGxEUFlGSTY2NGIyRFFQRVZtNWxPUGNFXzVETjFianN3S3BabEFqX055c010NmZL?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "UFC heavyweight suspended 30 months for testosterone use, ‘attempt to deceive CSAD with a false explanation’ - MMA Fighting",
    "description": "UFC heavyweight suspended 30 months for testosterone use, ‘attempt to deceive CSAD with a false explanation’  MMA FightingStatement On Mohammed Usman  UFC.comUFC's Mohammed Usman gets 30-month ban for positive drug test  ESPNMidnight Mania! Usman Hit With Massive 30-Month Suspension  Yahoo SportsCSAD: UFC's Mohammed Usman admitted banned substance use, suspended  MMA Junkie",
    "published date": "Fri, 16 Jan 2026 13:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNVXBBeGVUcHBDOEVDU2dob0l1bEM1b0FRM0ZCVmFKbm12VUY4QVlYZVIwWDA2aEFGLXNPemw3VDc3WHhJWllrWWpIZ09aTk8wVEJ0U3phREJqMGFDbFE0b0ZaN05WY1FUNDNmMENPLXU1cXZmenlVWThvSnFXMzlmU1k4OWI4d2lYdzhzTnJvODVEY3hWTndxTWJxcVU2ZXFwcWhIS3hvRURuNnhhcS00cFVqalQ0T0NfcndfaUFhYi1STHhaZ1hnRmRUNkpFckl4X1F0Tm1meEpfRFc1Z1h3d0ZZdkdscTU1ZURHUk93Uks?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "4 questions that will be answered in the NFL playoffs’ divisional round - CNN",
    "description": "4 questions that will be answered in the NFL playoffs’ divisional round  CNNNFL divisional round: Biggest question facing the eight remaining playoff teams  CBS SportsNFL Power Rankings: Bills, Bears and 49ers among risers heading into Division Round of playoffs  NFL.comFinal Herd Hierarchy of the Season: Who's the Strongest Team Entering the Divisional Round  FOX SportsX Factors for Every Team Remaining in the NFL Playoffs  The Ringer",
    "published date": "Fri, 16 Jan 2026 11:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE82NTNqSnlybEdNWmlSUmJXc0diczNlZnRCbkdzaXIwZWVLU2dZaHFGMjRYU3JmZDlmd3BIT2pKbWhzVFBYOFhUZTVCekVNc1I3TXlYOVR2eWZ3NW1FSUpiVWx0bUNfMENsbC1GMTFZMjB2bmJj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "A ‘time capsule for cells’ stores the secret experiences of their past - Nature",
    "description": "A ‘time capsule for cells’ stores the secret experiences of their past  NatureScientists transform enigmatic cell structures into devices for recording RNA activity  Phys.orgEngineered organelles act as cellular 'time vaults' to record gene expression  동아사이언스",
    "published date": "Thu, 15 Jan 2026 19:42:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE8tRUdVbXdid2RYVkc3X2c2cEdUdG93V1lSZ25vRk4tSy0ycDBMZmhBUlJmbklkUG1Zczlya3lscHFyRkVEUW93MWp0Zlg4NE9oYnIzbG04ZmFpYWlZZXk4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nature.com",
      "title": "Nature"
    }
  },
  {
    "title": "NASA's powerful new Roman Space Telescope is complete — and will soon begin mission to find 100,000 alien worlds - Live Science",
    "description": "NASA's powerful new Roman Space Telescope is complete — and will soon begin mission to find 100,000 alien worlds  Live ScienceIntegrating The Nancy Grace Roman Space Telescope's Two Halves  NASA SVS (.gov)Roman Space Telescope on track for September launch  SpaceNewsRoman Space Telescope will provide unprecedented views of alien worlds  MSNNASA’s next space telescope reaches assembly milestone  Physics Today",
    "published date": "Thu, 15 Jan 2026 17:08:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxQOTNjRmJyVU82ZnppcmsybjJlclZLSkpqd3FQbi1rVDBWNEhhT3VOTHgzQlRfWjNVejh6MGZTamtBVHk2QzhtVXM0LVRPdU1xX2pONVBvWjZYNndseE9MRVJ3a25pQXFjQzZKSXROOWlUYUpnanByeXRiWmJ0S3JPemJ2ZVFQcHcxSFhWUkc4SmU2dTRaaHpaelhvMjRKUGtDT3dNWW01Zl9YMTQ3bDNNNC1ndXp5YmNab3FlNEZlZUdNWXhxWGZHa2d2a1FXdTJkQk5wM1BjaGdpdnhoTTFKWTdPOHFuYUpCaDlZZ1pVbS12X00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "New DNA analysis reveals an ice age wolf’s last meal - CNN",
    "description": "New DNA analysis reveals an ice age wolf’s last meal  CNNContents of a Wolf Pup’s Stomach From 14,400 Years Ago Are Teaching Researchers About the Lives of the Last Woolly Rhinos  Smithsonian MagazineResearchers recover a woolly rhino genome from inside a frozen wolf's stomach  National GeographicScientists Find Extinct Rhino DNA in Wolf Pup Mummy’s Stomach  Scientific AmericanWhat a Wolf Pup’s Stomach Revealed About the Woolly Rhino’s Extinction  The New York Times",
    "published date": "Thu, 15 Jan 2026 15:35:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNWJzcHgyTlBtcmN0N3R5aU04cFYxeWxLNVZ1TU03d040b0VNWFk5WUlJcDMzUVVyb25tT212NWstMUNMZjV1R0Nwdk4wYU1XeGdkUEFBRVZ6STM5MjRTZURwRzQ2RzQ4ZnNMNlNPSXRGQllURUpEeTZJRy1WT2J3TEtqM3YwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "After a month of no answer, NASA will try hailing its silent MAVEN Mars orbiter today - Space",
    "description": "After a month of no answer, NASA will try hailing its silent MAVEN Mars orbiter today  SpaceNASA attempts to restore contact with AWOL orbiter launched in Florida  YahooNASA Fears Mars Imager Probe MAVEN May Be Lost  PetaPixelNASA to Resume Search for Missing Mars Orbiter, But Prospects of Re-establishing Communication With It Seem Slim  Smithsonian MagazineNASA pessimistic about odds of recovering MAVEN  SpaceNews",
    "published date": "Fri, 16 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPYzZSakNvZ1VIeEZtRXpjNGNjZFo1YXdQWWdiWWRCN2ZCRnlUYWFBZWF1MTRtZTVaMnZkTFJ5djRQZlFSLV9QU2lLOXd2TjJSTDZQcHRNc2dTM1U1dVpYamtDb0djZDBuZVNqc3VtNG11VktCUzRBMk9Kd1pSdVdFWTN6SllpdnRrR0x1VjhiNjVXWjJiTHFVdXpWaWFWa0IwUHVVeWxpZG91Z093cnlmLU9ZOHhXUUlfVlQzeWVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "US mixed messaging on flu shots alarms experts: ‘Children should not be dying’ - The Guardian",
    "description": "US mixed messaging on flu shots alarms experts: ‘Children should not be dying’  The GuardianFlu Symptoms in Kids Can Turn Deadly Fast. The Flu Shot Is Still the Best Protection, Doctors Say  TODAY.comThe flu vaccine is working  statnews.comChristianaCare: flu vaccine can help against flu, and it's not too late to get it  Delaware Public MediaFlu cases surge; vaccine still has protective benefit  UW Medicine | Newsroom",
    "published date": "Fri, 16 Jan 2026 13:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQMzRrdTRROG5XVm4yTzd1dW9ocEhGOEpOQTczSVJMbUx6M2xrdUs5WF9sQ29hZjdhNjI5TU0waGJOLXZvM1VsRWNkZWU0dVZLT1hZM0ltc2pKMTFidXVFNmpFWnUtMnI0d0RsSzBTdmJzX0MzMWdVMWpkYS1IbTBfc0xrOTBGWnZZRjE3ajBwNzFNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "A 4-year-old died of flu complications. Her mother has a message for other parents - CNN",
    "description": "A 4-year-old died of flu complications. Her mother has a message for other parents  CNNView Full Coverage on Google News",
    "published date": "Fri, 16 Jan 2026 11:00:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5VWmVXRml1bHJjTHlnSWFSNEJqOEZHUlNLVVNWd3RpWURsRDRiYTNEOXRUXzlnWTlJVmhhMTc2b3o2dUl3UVFYNVFkbTRKa3ZObWlxbGtYOGtwdVEtT0lNR2RhQ2J4cjVWMGFDSGRvYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Flu cases surging in California as officials warn of powerful virus strain - Los Angeles Times",
    "description": "Flu cases surging in California as officials warn of powerful virus strain  Los Angeles TimesWhy it seems like everyone has the flu this year  Harvard GazetteFlu activity elevated across the US with at least 18 million cases: CDC  ABC NewsThere’s ‘super flu,’ COVID, RSV. Is it going around in SoCal?  USA TodayNew variant of the flu virus is driving surge of cases across the US and Canada  The Conversation",
    "published date": "Thu, 15 Jan 2026 23:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPTWdvNGg0bVhUeGRwUkYyT3Bhck1IQTVrZm5NbUdjYTlLS01GeGp3d2NjWEVvb2xlekhWaFZXYmFoalNqQUpBb2JGTm9YcXBCZVBfY3dqMmRnN2g2X0hqWENiTlQxN2lIWjJGVnJ0cWR2Q215bmdoWS1hRDdtQXdkbVAtVmZsOUJYdVVlRkZoQXNybldVbGxhTERUVmU4Yi1EMDRPSl8wMXJoN2lzX0dnQnlSbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "Finally, Some Good News in the Fight Against Cancer - Gizmodo",
    "description": "Finally, Some Good News in the Fight Against Cancer  GizmodoMore Americans are surviving cancer — even the deadliest ones  The Washington PostPress Releases  American Cancer Society Press RoomCancer survival rates soar nationwide, but L.A. doctors warn cultural and educational barriers leave some behind  Los Angeles TimesMore people are living 5 years after cancer diagnosis, new data shows  ABC News",
    "published date": "Thu, 15 Jan 2026 20:45:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOC1YLWVOVHJjX2NfOGhKQWVaQTdwNDM0c09FaFBDV0JrN2FZanhvRktKV0h6WXNsQ3JvWjBKb1VZd3d5eTkxcWsyQ3gtRFBqWmFsWk1xWUNzemR2TE90RHhFX19OY3dUUmlLV19adGE1ZFppc09GbzlveXN0cFNzaFJ5Y19MaHdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  }
]