[
  {
    "title": "Newsom to world leaders: 'Donald Trump is temporary' - Politico",
    "description": "Newsom to world leaders: 'Donald Trump is temporary'  PoliticoNewsom tells world leaders Trump’s retreat on the environment will mean economic harm  Los Angeles TimesAs Trump tests alliances, Democrats with 2028 ambitions offer reassurance at Munich conference  CNNAOC accuses Trump of trying to usher in ‘age of authoritarianism’ at Munich conference  The GuardianNewsom Takes His Anti-Trump Arguments to Europe During Munich Security Conference  U.S. News & World Report",
    "published date": "Fri, 13 Feb 2026 16:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOMlRYSEF1dkFMYm1XZ3VlMEpyQWE3WFRLblhhMEZrbHZOLXU5RUNXLXZmR0IwRTNMZFBEUS1MNkFJUTdJQUFfcjZ2OXVubjdMWDNEa19pTzNyeS1OcldMMWl3ZUtWcU5oVzBncWxzT3AxMWgzLXMtdmxPTXAyS0tFcktSLTdQVzAzdlVDQ0l2azI1cjFLSi1ILWdKU3JLelVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "The Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times",
    "description": "The Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesWhat will Epstein accountability look like?  CNNInside Jeffrey Epstein’s network  The EconomistEpstein files: A list of people facing consequences over the DOJ's release  Business InsiderOpinion | The Real Epstein ‘Ring’  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 14:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE4taWRfckxJZklhVlFpSzFsdTdYM3hoaWdzdEczTTZZdUJUMmVIODFOWnFTVmhzbjJrZDdLSnljcEhjZDQtTFVlTXM1Qzg2RkhFU0VycnEyNXZTU0hqb0VnU05ONWRCY0ROcEt2NUtJTUxvX0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE plans to spend $38.3 billion turning warehouses into detention centers - The Washington Post",
    "description": "ICE plans to spend $38.3 billion turning warehouses into detention centers  The Washington PostTop House Democrat says Republicans’ latest offer to fund DHS is ‘unserious’ as shutdown looms – live  The GuardianICE Plans $38 Billion Expansion of Immigration Detention Facilities  The Wall Street JournalICE reveals $38B plan for immigrant mega-jails  AxiosOpinion | ICE’s warehouse detention centers run up against NIMBYism  MS NOW",
    "published date": "Fri, 13 Feb 2026 20:18:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUFdJa2JLQ2pCdHM2Rkw5WWpIZmFVOGx6NERrY25fcF9NWG5SdTRLT2Y1QUNEREhNN3RkekJZQm5LeENERlM0b1FXOE1WaU5JVTBBZ3hYS3VWaGZWd3p4U19lSWc5SUZ6d1VRWjlOSGhFTHdLRFNlTkZYbTdIcWRURERyWjZIem5GT3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Feds investigating whether 2 ICE officers lied about the shooting of a Venezuelan man in Minneapolis - AP News",
    "description": "Feds investigating whether 2 ICE officers lied about the shooting of a Venezuelan man in Minneapolis  AP NewsAgents Suspended After Their Story of Shooting an Immigrant Falls Apart  The New York TimesDHS says immigration agents appear to have lied about shooting in Minnesota  NPRGovernment moves to dismiss charges against men in ICE-involved shooting, citing 'newly discovered evidence'  5 EYEWITNESS NEWSDHS says ICE agents suspended for ‘untruthful’ testimony in nonfatal Minneapolis shooting  Star Tribune",
    "published date": "Fri, 13 Feb 2026 19:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNOEtWQVNnTGFYWVpnSlNraWZrZW15LVBEY1ZmWlpXV0Z4T0MtTXB2X1U3dHBoS2xHUm9hVTJXd2VQSlNRV3k0UW1BYjloSmM4My0tU01PQ1J5ZFZWTDZ6Vm5FT1NxTWhMbmhhc192U3JoRUV5SGh0WHdQaEtVXzFYYURKTmZTeXdLX1dmSDFvTzM1MEhobFEzV2MwUXJZS0JyQjFObVQ3NDFHdWJ5YTNXYkU2QTFTSXFsZXZKcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law - NPR",
    "description": "A familiar move with a new twist: Trump tries to cut CDC funds he just signed into law  NPRFederal Judge Blocks Trump Plan to Cut $600 Million in Health Funds  The New York TimesCalifornia, other states sue over Trump administration’s latest cuts to HIV programs  Los Angeles TimesFour states sue Trump administration over cuts to public health funding  ReutersTrump's CDC is canceling $600M in HIV and STD funds to four Democrat-led states  Scripps News",
    "published date": "Fri, 13 Feb 2026 18:18:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQazdJaTROOTRYMThGdnp4NjJjQmZHWFR6bWRqSWp1eWVQQmwtUG1qc2ZxTHZlV0hnNm5Nb3kxbXZKbnh0cTl3dHJaR1h3VWNjZldQeDludGpSZGRaZElMUWFlM1N6b3Bka1RMTkNlNTduMGdxeVpMSFAtb1ZOVWJERXZmRVA3SzlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump repeals U.S. government’s power to regulate climate - The Washington Post",
    "description": "Trump repeals U.S. government’s power to regulate climate  The Washington PostTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesHow dangerous is Donald Trump’s “endangerment” decision?  The EconomistTrump administration moves to end \"universally hated\" start/stop feature for cars  CBS NewsHeadlines for February 13, 2026  Democracy Now!",
    "published date": "Fri, 13 Feb 2026 03:43:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPT0tIWHEyTHpLclhSbjJwLXNzWE5Ydlg4Z0tmNEhKSElRcmJ5bnE1VjVtWEdNSktvNFhJZGZXbnhuZmxmcjQyaGlUcWVQVGRVQmd2X1JsM2RVOTNmc0JFX19DUXNrSXdZRHZwaDNpOE8teW5PTlVJSnVQSVZmMGFkZURvTGpDQjBuVTFYWnRIMVBhTGhI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Au Pair Juliana Peres Magalhães Sentenced to 10 Years in Banfield Double Murder Case - The New York Times",
    "description": "Au Pair Juliana Peres Magalhães Sentenced to 10 Years in Banfield Double Murder Case  The New York TimesAu pair who plotted elaborate double murder with Brendan Banfield sentenced to maximum 10 years in prison  CNNAu pair sentenced to 10 years for her role in double killing  The Washington PostAu pair gets 10-year sentence for scheme to kill lover's wife and another man in Virginia  CBS NewsBrazilian au pair faces sentencing in scheme to kill lover’s wife and another man  AP News",
    "published date": "Fri, 13 Feb 2026 18:11:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNS3ZmOWNSbTU3bjZZSW5KRmtSV0JoQjlNdk8tTEtYWHlsRm9HSDR5aFlLczdWUE1qUm1WOHNWYjJQbm4yd3VoaG03SG40NWFQdE01M1BreFVTMWFNUEh0ZWJYRk0yOWFqUUZ2T1UyS05rMEYzMGFyY0IwU3lSTnpGaEdMNnduN0dQZGJ6ZXYwNXF0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress - Politico",
    "description": "Meet the YOLO Republicans: Lawmakers with nothing to lose are threatening Trump’s grip on Congress  PoliticoAfter letting Trump abuse it for a year, the legislative branch shows a little pride  CNNIllinois Republicans weigh fealty to Trump as president’s agenda faces backlash and shutdown threat  Chicago TribuneShifting Republican Support and Congressional Dynamics with Trump in 2026  БуквиDeep red Republican breaks with Trump as president's popularity plummets  Alternet",
    "published date": "Fri, 13 Feb 2026 16:44:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTVoxZjhUak52TTZtZFQ5c0s0b2tHRnRmYkpTdWVZZVRfcmNXY3c0czBSZG1sQjgtaTBtb1NiREFkX0VDYWxfTEdueUJZV01qUFlIUld4MXlwTUZLT2JHRi1wTGZOM2RWbGJ2V0UtaXFyMUNVV3BpYi1nOXZDdHZFWDI0UDZqZGVrXzctSmlhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Trump administration deported some migrants at a cost of $1 million each, Democratic report says - CNN",
    "description": "Trump administration deported some migrants at a cost of $1 million each, Democratic report says  CNNUS paid $32m to five countries to accept about 300 deportees, report shows  The GuardianU.S. spending millions to send migrants to third countries, report says  The Washington PostDemocrats say Trump's foreign deportation deals cost taxpayers millions  ReutersUS Spent $133,333 for Each Deportation to Third Party Countries  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 11:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNbEhzMFJ6T0EtdkxOTmM3ZFVXQWpITElxbXlVTkdHUGFkUUlodXU1dTRSLVMyeURCUkwzbDRfNS1ld1B0S1FfMEFLN2x6eUZ5Vllxc2hocnpRR0pLLWxranlIcE1hUUNqaUhDeFZEMnoyS3NaeFU0VWVVcUdUZ1Fkc1hNRHNIY0pzdWF2c05YYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "S.F. teachers strike is over as school district and union reach tentative agreement - San Francisco Chronicle",
    "description": "S.F. teachers strike is over as school district and union reach tentative agreement  San Francisco ChronicleSFUSD fumbled the teachers strike  Mission LocalSan Francisco teachers strike ends after reaching tentative deal  AxiosWhat SFUSD superintendent said about her pay amid teacher strike  KTVUSan Francisco Unified School District and union reach tentative $183 million deal to end historic teachers' strike  ABC7 San Francisco",
    "published date": "Fri, 13 Feb 2026 18:16:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZTZ6MHI5U2dfRHpQdS0yWGRxRk9vbnlESVgyQ0RDQWlXUG9nend5QnhnaXNSR0N1V2JPRGN5NmNHdmdjc1NPcmplZXRSZ1RpVUU4WjFsd0wwZVc5anlmbGZjMk1vZzVDMG1rcERuN3pkZm93RWNzTEhhekVvNldPRjhtZE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Spy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader - AP News",
    "description": "Spy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader  AP NewsCould this teenage girl be North Korea’s next leader?  CNNKim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says  BBCNorth Korea's Kim positioning daughter as successor, Seoul spy agency briefing says  ReutersKim close to naming teenage daughter as future North Korean leader, South believes  The Guardian",
    "published date": "Fri, 13 Feb 2026 16:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNbnJtY1lVN0h2RTJxaFRKZHVEdlBqNnVoNkRTd3dCTS1MMG1aS1h6dXlQQTJqM1RfczlyMHVvbHJ6dEFBSHVCX3hYaGFkbDZneWNrc09qcFhCRURvZXVLT29hTWFIem1UQlBEYjZyTEVWUXlnTHRsMVBlLUxpYXlTNWFNdTZsT1gwdHNBMHZHX005YVl2RTZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Former McKinsey partner to lead Australian opposition party - Financial Times",
    "description": "Former McKinsey partner to lead Australian opposition party  Financial TimesSussan Ley: Does Liberal Party drama show Australian politics still has a problem with women?  BBCGrattan on Friday: How did the Liberals’ first female leader find herself on the mat in under a year?  The ConversationTony Abbott issues Taylor a warning on what not to become  Australian Broadcasting CorporationAustralia's conservative opposition picks a new leader amid ratings slump  Reuters",
    "published date": "Fri, 13 Feb 2026 01:27:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zWkZqQ3ZxR0xLNlcyVGRXNlpYZ0thTWNiNzd1SFFON2JNcEZxNmdYQVlXSVRPRXFlVDJMckFaOXJrLUlRSnozc1R5dy03RXQ0TkFIVi16WDY3M0JSTThfUW9wRFhTZ0Uxem1ZU0VuY2Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Russia shrugs off Trump’s tariff threats on those who provide oil to Cuba - CNBC",
    "description": "Russia shrugs off Trump’s tariff threats on those who provide oil to Cuba  CNBCU.N. Condemns U.S. Measures Halting Oil Deliveries to Cuba  The New York TimesAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  CNNRussia has started an 'evacuation' of its citizens from Cuba amid the island's jet fuel crisis  Business InsiderRussia dismisses Trump tariff threats on Cuba: ‘We don’t have much trade’  The Hill",
    "published date": "Thu, 12 Feb 2026 11:16:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNSWZpQldSYm92blBkRkRCMktZcGcza0YzSWRHbE45Yk5xc1R4VDBSeGJTVHJNbEU0SHhKZm5oV3EzSnRzYVV0ei1DUko4OTBBUGJtUlk1TS05TG1oTE94Y3VrR3RzVUM2Z2hDQmRVTVpobUVtcGxiX01TWWFocFRxN1VvOEszSUXSAYwBQVVfeXFMUEFFc2s2Q0gzZk5UblVLYVRzM0ZjUjYwVXUtZ1FHVVNFSlZMMjRIZnFmazkwS2stQ3hfN21mcmIwZGZlNzR0R1E3Z3JFS3kxZ1NyWmhHYjlyRVI1MTNFUkZURnpIYTBjTnJvOUxDVWFGMjdJTDdrQVhldG1UdGFMRDVaaWFXV1N1NDdoMXE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Scientists have discovered one of elephants’ most sensitive secrets - The Washington Post",
    "description": "Scientists have discovered one of elephants’ most sensitive secrets  The Washington PostAn Elephant Is Blind Without Its Whiskers  The New York TimesStudy unlocks the secrets of the whiskers on an elephant's trunk  ReutersUnique structure of elephant whiskers give them built-in sensing \"intelligence\"  Ars TechnicaElephants are smart. So are their whiskers.  Popular Science",
    "published date": "Fri, 13 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBDeHNCVkQwNnA4NFVwZW1KaFdOX2JSSnVFMzF2RkpSZW5IR09idDFhREtxWFJKU1NreXZxZGFwdHo1OElVSWtuMG1EYzhvV1JNMHR0SE5PY2J6R0p2ZUdCbGYzelpFSXc0MUphVGNremNmUndSWUpZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates - CNBC",
    "description": "S&P 500 closes little changed after soft inflation report, index notches losing week: Live updates  CNBCU.S. Inflation Eased at Start of the Year  The New York TimesJanuary CPI breakdown: What the latest inflation report means for your wallet  Yahoo FinanceInflation measure falls to nearly five-year low as gas prices fall and housing costs cool  AP NewsJanuary inflation eased more than expected in promising sign for economy  The Washington Post",
    "published date": "Fri, 13 Feb 2026 21:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1rMzAwSXVIelF1VVJ2WU1YbzFiLWtfa0xMRDFVLTZpVE1WcGlrM3hPZnJScFV1b1A2WTNXX3JQeHFEcWRaTU5HdDlYMF83czJndGZqZUY0Y3piUTkzME5LaWFoVlFQQ0xCSXAyaGtlNUlMMU1JMTBJ0gF8QVVfeXFMUG1WcWJDeUpjZVd1ZDdzSWxFaEQ1VUlWX0NnWnFBZTQ1dFBmVlF1dWY1TzRjS2hUbjItWGxzWjFjczZ4QnU4RWVsQ2thWFMyZ0I4T2lfM0p0U3VaUFc4S0t5RXZVTTUyQS1sMzBQYWhOWlhWZ0lncmpnczY1Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Valentine’s Day sticker shock: Chocolate prices are spiking - CNN",
    "description": "Valentine’s Day sticker shock: Chocolate prices are spiking  CNNWhy your Valentine's chocolates are so expensive  AxiosCocoa crunch: Pittsburgh-area chocolatiers face Valentine’s Day amid cost crisis  90.5 WESAFalling cocoa prices won't necessarily mean cheaper Valentine's Day chocolates  Channel 3000Cocoa Traders Halt Ivorian Purchases as They Seek Lower Prices  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 10:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41QUZ5dnlocFl6MGlpeEVDV2JZTzNzd2N2dGZmWWtpbWN4SVFwR05HUlc1aTUzb2JCZlVWTGl5eTc2d3ozQmc2RGRkcXJCcnVMQnU1Rk1FanVSYUpXZDRsa0x0OG1GdzhLUi1nMVA2NV9US3kxS3kybmVKOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "OpenAI retired its most seductive chatbot – leaving users angry and grieving: ‘I can’t live like this’ - The Guardian",
    "description": "OpenAI retired its most seductive chatbot – leaving users angry and grieving: ‘I can’t live like this’  The GuardianOpenAI Is Nuking Its 4o Model. China’s ChatGPT Fans Aren’t OK  WIREDInside OpenAI’s Decision to Kill the AI Model That People Loved Too Much  The Wall Street JournalOpenAI is officially killing GPT-4o and users are freaking out (again)  Business InsiderOpenAI Retires Controversial 4o AI Model, Angering Loyal Users  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 16:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOa3o4Xzl3YnJmLTc2RFAxZGJkbEFBdW5MN0VCRW45NWdrMkpYd3c1VXBOYmlOYl9rM2cyWk1YNHlfY3RpY3hpQmh6QVI1b1BRZXhZU2hMcFVkSDNldzZxRGx2aEFWTS1ZUVY3U2ttODN6VG43MUR5T0RlMVo3NEh5aDl4Y2RnQ2ViRmQ1Y3NlZW80THNLb0JrTEQwWDN0NXRmd0EtOERR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry - The New York Times",
    "description": "Bessent Pushes Senate on Fed Confirmation Amid Backlash Over Criminal Inquiry  The New York TimesTillis suggests Warsh faces long Fed chair nomination process that could restrict his business life  CBS NewsFed chair drama: Tillis pours cold water on off-ramp for Powell criminal probe  CNBCTillis continues to hold Fed nominees despite latest offer from Treasury  The HillBessent Sees Senate Proceeding With Warsh Confirmation Hearing  Bloomberg.com",
    "published date": "Fri, 13 Feb 2026 14:34:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOc2FXUkxlZ3VrMFFmd09nV3huTUttOFRpZHBNMEw4Y1czcnh6VWFiY3pWRHpoeEMtV2Y2bUppUUcwaDlGT0FrbXhTYTBIREpuVlQ4VTJNY2NnNkpDV2cxSDIwUWttWS1ySUpUcXlwMkx3UEltQXIzOE81MF9YVnRXTmI2bS1LWk5jSmFYaDFuT0NlaUxCMVdqTlZORQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Google is now rolling out Android 17 Beta 1 for Pixel [U] - 9to5Google",
    "description": "Google is now rolling out Android 17 Beta 1 for Pixel [U]  9to5GoogleHere’s everything new in Android 17 Beta 1 [Gallery]  9to5GoogleGoogle Just Dropped An Update For Pixel Phones — And It’s A Surprise  ForbesGoogle releases the first beta of Android 17, adopts a continuous developer release plan  TechCrunchThe first Android 17 beta is now available on Pixel devices  Ars Technica",
    "published date": "Fri, 13 Feb 2026 19:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE16TC04NkdwanEzVDB0RGd2S1psYmhaZDg5ODlPTUVlOFZxajB6d1FvOUxGN1BvN2d6dllHdDAxRnE3WXpSMjBMY04zWWtSQkRpb2h4QjloQ3UxbzktUngyVTJmTmxSNWhZYlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "Here's the first glimpse of a One UI 9.0 Galaxy AI feature! - SamMobile",
    "description": "Here's the first glimpse of a One UI 9.0 Galaxy AI feature!  SamMobileGalaxy S26 Now Nudge Leak Reveals Travel Assist  findarticles.comOne UI 8.5 Leak Reveals Powerful Now Nudge Feature for Galaxy Devices  Android HeadlinesGalaxy S26's Now Nudge AI: Proactive Assistant Revealed  Gadget HacksOne UI 9 Leak Reveals ‘Now Nudge’: Samsung’s AI Assistant for the Galaxy S26  Nokiamob",
    "published date": "Fri, 13 Feb 2026 17:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5Ucm01c2w2a2lqX0lZUkJtcWFYSENVZFhBX3BQZzAzVU44NzZYMmViVTFpTHhQU25EbnQwbEtYbnRnM0hMRV9WWnNtQ2pMOXlEeTRvMVhCVlF0WmY2RUhKaV9wQjJrckgyaV9xVXA2b2NIdjlDWXI0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sammobile.com",
      "title": "SamMobile"
    }
  },
  {
    "title": "The Galaxy S26 Ultra Is Almost Here: Samsung Confirms Unpacked Date And Pre-Order Perks - Forbes",
    "description": "The Galaxy S26 Ultra Is Almost Here: Samsung Confirms Unpacked Date And Pre-Order Perks  Forbes[Video] Samsung Teases Galaxy Unpacked 2026 by Turning Global Landmarks Into a Sneak Peek of Effortless Photo Creation With Galaxy AI  samsung.comSamsung’s offering up to $900 of trade-in credit toward its new phones  The VergeSamsung Galaxy Unpacked 2026: Everything we're expecting from the S26 launch on February 25  EngadgetLeaked official renders reveal color options for Galaxy S26, S26 Plus, and S26 Ultra — but I’m holding out for more  Tom's Guide",
    "published date": "Fri, 13 Feb 2026 18:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPLTUzMXNGRWpnUGE2OGJ2eDk4UEsxeWtpblExTjVkejFrZTlwMm8wa1o0OVRyS096bkVDeVMtUVRIdXQybEE0TDVWUXJQTzcyQ3EyMmQwcG1VTllkTmhXbjJraDRZRl9MMDNSQlk5ZmVpZDB4cEI0ZFFBN2s0NmxLRVdsX09LTVJGNmRUVk9ndWp3bzNPWUd6M1FfNkdUVDFQOEYtcHVaUVA0aEpHZkJjM0dqTkxzQzMwdlM2YmFGV1JqZzg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "PlayStation UK gamers can lease a PS5 Digital Edition from £9.95 per month - VideoCardz.com",
    "description": "PlayStation UK gamers can lease a PS5 Digital Edition from £9.95 per month  VideoCardz.comPlayStation UK Now Offers PS5 Leasing Starting at £9.95 per Month  TechPowerUpSony launches a subscription service to lease PlayStation 5 consoles, but you can’t get one  Digital TrendsPS5 Drops £10 Console Offer, Perfect GTA 6 PC Delay Solution  GAMINGbiblePlayStation Has Launched A Way To Rent A PS5, And It’s Gross  Kotaku",
    "published date": "Fri, 13 Feb 2026 10:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNSnV0M3ZMdl9TMHhqZmFobF9ULUVkMW1Db3d2Zl9mbTUwa2x3Q1I1anZiM0JJbElSUUVETDNraDFJTDFkd0hXdmp3U2YzVzFTWkVnbTVLZ21yRFEyTm1wM0stVnVGbTdOamRkemtHX2p0ZGpJblVIbURLX0NmSVhDbXdLUng1czdFQThnd0FjOFVuSVJkcGluRDNCUWZnN01OZmlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://videocardz.com",
      "title": "VideoCardz.com"
    }
  },
  {
    "title": "‘Wuthering Heights’ Starts Valentine’s Day Weekend Affair With $3M Previews – Box Office - Deadline",
    "description": "‘Wuthering Heights’ Starts Valentine’s Day Weekend Affair With $3M Previews – Box Office  Deadline‘Wuthering Heights’ Review: Margot Robbie, Amok on the Moors  The New York TimesShould Jacob Elordi Play Heathcliff? Why the ‘Wuthering Heights’ Casting Is So Controversial, According to Literary Experts and More  Variety7 ‘Wuthering Heights’ movie changes that will surprise fans of the book  Los Angeles TimesA ‘Wuthering Heights’ adaptation as shallow as a puddle glittering in the sun  CNN",
    "published date": "Fri, 13 Feb 2026 16:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObHZoWW1uZGRobTBlUjg2M3d6ZUZHalhtZE1CQjZsSEU0VXF4QmdGckFteUtaeEFia09tVEl5di05SzJEVUUyY0JTbG5pTTE3YmJPZDQ5UlRSZFNUdGJrbGFsbWxIYkpxWnZUaHkxQm4yTzlnRnIzcXZrYnd3dFVEUnhaMkhEUVZ2RG9FUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Elisabeth Moss To Star In 'Conviction' Legal Drama Series For Hulu - Deadline",
    "description": "Elisabeth Moss To Star In 'Conviction' Legal Drama Series For Hulu  DeadlineHulu Greenlights Elisabeth Moss Legal Thriller Series ‘Conviction’  TheWrapElisabeth Moss Books Return to Hulu in ‘Conviction’ Legal Drama  The Hollywood ReporterElisabeth Moss to Star in Hulu Series Adaptation of Jack Jordan’s ‘Conviction’ From David Shore  VarietyElisabeth Moss to star in new Hulu legal drama 'Conviction'  Yahoo",
    "published date": "Fri, 13 Feb 2026 16:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNZE5KUVlzbXR6a2xZUzh2UHRMZXJ6UmU2VWQ1M3RLZW15OTBPZ0Q5dFZMZnREeGhKLVpTak5sajRCN1NqUWt5TGItbTV4OTk2ZTFhNkwycjFIaC0tRlBhc0w1clhkUC1hcnBELTNERU54cUhQRzBBVnlLQ0N5bDBXNzVKWS1td1ZRdGN6TDRpN0lyT01iak1UWlZUbGZ5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Republicans Have Moved Into a New, Even Dumber Phase of Bad Bunny Outrage - Rolling Stone",
    "description": "Republicans Have Moved Into a New, Even Dumber Phase of Bad Bunny Outrage  Rolling StoneSuper Bowl LX second most-watched all time with nearly 125M viewers  NFL.comSuper Bowl LX, Bad Bunny's halftime fall shy of ratings records  ESPNThe Story Behind Bad Bunny’s Zara Outfit at the 2026 Super Bowl—Including That “64” Jersey  VogueBad Bunny’s Super Bowl halftime show is being investigated: ‘Very disturbing’  NJ.com",
    "published date": "Thu, 12 Feb 2026 17:49:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOWGtkR2V0LTR6Yl9oMFd6U3BVbEMtTi1WemVzN29CYzcwNktNU19OS3dJVUM2aFNBSFFpV2lObkZHU2dkQlhnVmk5eVFjZGFNc25aLWd2Tl9veGhOdHo1NmhCRWtKOVdBakdSckRiRmp4TVBnRnVONE9GSjR0eUZRSTd2d3NJM1FHeWU0bVFGdWxQOGxpT2pjUnpGVUpibWdwY2JiTnd5bEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "‘Killing Satoshi’ Bitcoin Biopic Starring Pete Davidson and Casey Affleck Set to Use AI for Locations and to ‘Adjust’ Performances (EXCLUSIVE) - Variety",
    "description": "‘Killing Satoshi’ Bitcoin Biopic Starring Pete Davidson and Casey Affleck Set to Use AI for Locations and to ‘Adjust’ Performances (EXCLUSIVE)  VarietyBitcoin biopic starring Casey Affleck to use AI to generate locations and tweak performances  EngadgetDoug Liman’s ‘Killing Satoshi’ Will Shoot Entirely on AI-Generated Stages, No Locations  World of ReelNew Pete Davidson & Casey Affleck Movie Will Solely Use AI Backgrounds & ‘Reshoots’  ComingSoon.netEdge of Tomorrow Director's Pete Davidson Movie Faces Backlash Over AI Controversy  Comic Book Resources",
    "published date": "Fri, 13 Feb 2026 16:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPMGVOanN2VF96MERTVEY4VEttcmM1U2VxMllCY1g2SFo2WG9jbEUxSDNERTUzT0NsUEFqbUw3TUJTQ2lwOGFpVzZ1SjByakxXMFFYUXVXZkJJSnpUbVdOOTJLZl9Fb0hCVG9GandOMjN0aWpVSmdRNG9qWFI0bEVhZ1RyUlJSZ0NSS2h3WVZPcUota0pyU1FocnpSRUpfUF9RcjhPUjdNQlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Unpacking the ‘Sinister’ French Skating Duo Who Took Home Olympic Gold - thecut.com",
    "description": "Unpacking the ‘Sinister’ French Skating Duo Who Took Home Olympic Gold  thecut.comMadison Chock and Evan Bates respond to judging controversy following silver medal  Yahoo SportsDid Controversial Judging Cost U.S. Figure Skaters a Gold Medal?  The Wall Street JournalAmerican Olympic medalist speaks out against judges amid controversy in figure skating competition  Fox NewsMadison Chock says ice dance judges should \"be vetted and reviewed\" after France's controversial win at Winter Olympics  CBS News",
    "published date": "Fri, 13 Feb 2026 21:31:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQTUk4d19ndDZKTWg4YllHd0NBblZmRlFyaG1HTVBzSE5MY3k2dXJuYXFlREdhamtNTGdGT2RNWmZsa2RQazQ4TWdlQU1HMXpLM1R2LUoteW5oeTQ5YWFxOUtWdmFiVEltczJWeS1RaUw0ckMxcG14b2NlZ3JLYmkySW1qZEg4dl9zZ2dWUGtGdGc2OWVBcmhyRjlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thecut.com",
      "title": "thecut.com"
    }
  },
  {
    "title": "Antonelli and Mercedes top final day of first Bahrain test - Formula 1",
    "description": "Antonelli and Mercedes top final day of first Bahrain test  Formula 1F1 testing: Why Ferrari, Mercedes, McLaren and Red Bull are all claiming not be the fastest team after Bahrain test  Sky SportsF1 testing: Ferrari's Leclerc sets the pace in Bahrain on day 2  ESPNMax Verstappen calls new F1 cars 'no fun' as Leclerc leads day 2 of Bahrain test  Yahoo Sports10 things we learned from the first Bahrain F1 2026 test  The Race",
    "published date": "Fri, 13 Feb 2026 18:14:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOLXliM2tVdlR4Ukltd1ZNelJlUVc4VF9ObjItTHQzTENud3R3RmlHdy1MUkFTcUNkN3gzYWpzbXV0U0JfTUFDaTF3N0VwUWM1OEZMVEc2Vl9kTmJfS0p5UnFKWFlXYnNROFBoMTFZaThMYWNuWXNtYzdEa0pUb0Z6aDIzR2NIRTlZSGpQN2ZYXzBuTl9yMzVtRmcxRXJYRk9wYVRxU3laYXJjc3cyXzM1MnhENHJQRWdEai1rRHVfV3plSTFqX2VTNGpsempHM1QtZHZrUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record - AP News",
    "description": "Norway’s Klaebo makes history on skis, ties all-time Winter Olympics gold record  AP NewsNorwegian skier Klaebo ties record for golds in multiple Winter Olympics  ESPNJohannes Klæbo wins eighth gold, ties all-time Winter Olympics record after thrilling 10km free victory  The New York TimesHe’s the Michael Phelps of Winter. His Secret Weapon Is Summer in America.  The Wall Street JournalWinter Olympics 2026: Weston chases skeleton gold for GB, Heraskevych’s appeal rejected by Cas – live  The Guardian",
    "published date": "Fri, 13 Feb 2026 14:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNWGtTZnhSWnh6cHY4RkkzX1pSOEJYTHItamp2X3NkRWd5NnRvSmUwN19NNERfNWkxNVppSmxaMTJDdENaQ0NoTmxVZ1BZaU41a29KNllmTWZlUTJwbUV4RnN2ekI3eTBMdEFXdmh4VGZfMXBwVkxPN1FkRHhPOUYtbzJCZkpRR1I0QnRpRTlIVERJUDB4Y1pEUFY1S0F4TUdla3pqZkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "ACC finalizes which teams will play 8 league games from 2026-32 - On3",
    "description": "ACC finalizes which teams will play 8 league games from 2026-32  On3ACC finalizes teams playing eight league games from 2027-32, per report  FBSchedules.comThe ACC confirms 8 league games for football teams starting in 2026  Yahoo SportsACC kickoff dates for the 2026 college football season announced  Clemson WireACC may have solved Clemson football’s Power 4 scheduling overload. At least for a few years.  Post and Courier",
    "published date": "Fri, 13 Feb 2026 16:12:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPYVBhU0FVd3BqYXEzN09ycm9VUWt0b214Sy1odnEwcGd3S1ZZRDJ5YWtQa2hNbkRxYVlYdHZ0RldBNl81ckZpTmFjQ2NOT1JpU2R2NmdzdVJEQ1pzUVo1OFY0TnZiU3hKS3M0T2x2cUo5NEQ5NXM5aHNUcWpSRG9ZOGoyenhhWGtFNW0weFJITFRMenc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "NASA telescope spots the building blocks for life spewing out of comet 3I/ATLAS - Live Science",
    "description": "NASA telescope spots the building blocks for life spewing out of comet 3I/ATLAS  Live ScienceJupiter-bound spacecraft turns gaze on solar system trespasser  The TimesInterstellar comet 3I/ATLAS is spraying water across the solar system  ScienceDailyNASA's SPHEREx Mission Spots 3I/ATLAS's Bright Envelope  Universe TodayNASA space telescope sees interstellar visitor comet 3I/ATLAS flare up while exiting the solar system  Space",
    "published date": "Thu, 12 Feb 2026 22:07:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNWmpXRzdWM00xM3JSQzRFb0VLYzlUZkJLcWZhV0VaTXI5VkJGS3dqMGdPSE9UWXI0QlhWbW8tOVItUGpCN3YxMlo5bDlmV3c4S0xXaUZRNGhSVGVaVFJEWmludlNEbjItdURUR0xZcE14cjdnTGlyQUI3YTF4RkxpMldTUUJneG9tTjEtSm9EclNOU0haLUdkWV9ra2NtcnIzUmVkbmJrTk9icmpuWWlJdzJTR0NvbnNIY2kxUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test - Spaceflight Now",
    "description": "NASA loading liquid hydrogen aboard Artemis 2 rocket in unannounced test  Spaceflight NowWhy are the launch windows for NASA's Artemis 2 moon mission so short?  SpaceArtemis II speech calls moon 'our proving ground' for deep-space missions  Florida TodayNASA Conducts Repairs, Analysis Ahead of Next Artemis II Fueling Test  NASA (.gov)NASA is sending Artemis II to the moon. Here’s what to know  Houston Public Media",
    "published date": "Thu, 12 Feb 2026 15:34:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOcmFCcldVNDNLYng1RTNlOWFtU0hvTjlENS1vdkxiVDlRbXlJMUZObjBUN1lWUGJZRnk4aTYwUXdLalZYdGxOYnhpVVlwcnRScXJvbGJzRzhzWEFFa2VkSDJtb3RzZDNMZ056cDRqeWRyWi1NUlpkWEZvLUwydFZpb2cyV1hyckxpTzJsMU5RT1BUTTZkakZzcVdCbnR6QUJhZDV0elpHbDA5V3ZhNmtGMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "Saturn’s Rings Came From a Two-Moon Collision About 100 Million Years Ago, Study Says - Gizmodo",
    "description": "Saturn’s Rings Came From a Two-Moon Collision About 100 Million Years Ago, Study Says  GizmodoSaturn's moon Titan could have formed in a merger of two old moons  Phys.orgThe Cosmic Collision That Formed Saturn’s Rings  Nautilus | Science ConnectedSaturn’s Largest Moon Titan Might Have Been Forged in a Cosmic Collision  The Daily GalaxySaturn’s Ring System, Hyperion and Titan May Have Originated in Collision of Two Proto-Moons  Sci.News",
    "published date": "Thu, 12 Feb 2026 23:30:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNWFBiQ1RkYmZIRjN1TVF2eWNWX2Y3bWxrNnRwNzZSc1o2Mm9KYkxiS05ZSHJfU05Nbl9ZUUpZZUNic2xOWGR5M213c1k4cTZTTndYeHZsQkh2XzRWN2JKdnRfRTI5U3VuUGJqQl9VMi13bnB2NVRsaENrbExhYUxlRkUyNVpmbzdKMmVrdTFGQl9xa2hKS3cwTFc0bDdRUmFjLVlzUkFCcVZuVzhNWlJlZ2J6dnE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "NASA Selects Vast for Sixth Private Mission to Space Station - NASA (.gov)",
    "description": "NASA Selects Vast for Sixth Private Mission to Space Station  NASA (.gov)Vast wins ISS private astronaut mission  SpaceNewsVast Space signs order with NASA for private astronaut mission to Space Station  BusinessLineAxiom Space wins NASA contract for fifth private mission to ISS  InnovationMapNASA Awards Vast Private Mission To ISS  Aviation Week",
    "published date": "Thu, 12 Feb 2026 21:15:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQdmhCS3hCeDc0MGI2OHkzTUg4ejQwRUtQdDNnMzJyS0F1VzlTdlB6dXVCZ1RtUDZJODRpcTFub3FZTUJjdlpnRG1jVFU1OVdmUnoteHowTDJ0QjR3MTVoSmtORjRFN0V3MUt4Z3N5OTdqb3M1azlSVXJEZmFkbjRscmhLMzdTZWVnUm8wZ0xILVJBR0hLeVVIMGxrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "Measles cases at university in Florida soar to nearly 60 amid growing outbreaks nationwide - CBS News",
    "description": "Measles cases at university in Florida soar to nearly 60 amid growing outbreaks nationwide  CBS NewsStudents hit by measles outbreak at Florida university  USA Today57 cases of measles confirmed at Ave Maria University, 7 currently contagious  WINK NewsAve Maria University battles measles outbreak  National Catholic ReporterAve Maria University stops releasing measles data. Why it matters  Naples Daily News",
    "published date": "Fri, 13 Feb 2026 17:29:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPYVlSMndnTldyRVFRWU9qdW40QmVVbnlVWmIzNEQ0VlhkU1RaTmpDRUF5c3dvMjFzaHctQVZ6eVpDbWhNc2s3d1pzRUVTeElESXZheWZBZW1zdnFSRXJBT3YtN0lDRFFVUlJLdF8zODBRSTZyZGRvdDNQdFNJaThWcm9uNmxhUXh4cE5mU2xPTEF2dUlJZGd4RDY4OUlaWVhKZmZmcFNnamVuRFHSAbABQVVfeXFMTW8wZDNBUXBUdmktQkozdFdFZ1Q4MEZ2R1NPS2NVVVplX3RfRDdGOTktdDZhUHQ1QmFHRE1HLWxtWkdoZXNSeGZhc1lGMHlBdC1UcGRleWZ1TjJYTkpmRUxGeGhHRXN3bE9RQ2RGWUtsZzBJcXFBZy0xdUFtMUg1Vkpkcl95VERKaXloWmlOMmJMZmNIaXhkQXVCbWJhT19FVEdURHdPSHBqUE15dmlIZDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says - EatingWell",
    "description": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says  EatingWell2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf.  The New York TimesA cup (or 2 or 3) of coffee or tea a day helps keep dementia away  NBC NewsWhat to know about a new study on coffee, tea, caffeine and dementia risk  CBS News",
    "published date": "Fri, 13 Feb 2026 00:55:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1CcENJMXh2REwtb2JVY2NNOXlYNXA3UGZ6RFBjb29faXplRFV0ZUdUMzVBQjlUUzZTMzlrbElOeWxjcUxaNzhSU1htSFAwekszTVdaa3VVWEpROGp1bEkzV1hNbEQzMGpWNmh6cC13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eatingwell.com",
      "title": "EatingWell"
    }
  },
  {
    "title": "Measles is spreading in South Carolina. Could it make people vote for a pediatrician? - The 19th News",
    "description": "Measles is spreading in South Carolina. Could it make people vote for a pediatrician?  The 19th NewsDoctors bear the burden as ‘medical freedom’ fuels worst US measles outbreak in 30 years  Reuters13 new measles cases in South Carolina as Florida university outbreak grows  CIDRAPMeasles Cases in South Carolina Rise by 17 to 950, State Health Department Says  U.S. News & World ReportMeasles outbreak in South Carolina reaches 950 cases  WYFF News 4",
    "published date": "Thu, 12 Feb 2026 15:30:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQZUpNLU1FTzJCSTg5aGxudXhCTDZabFNJZG1tX2M2OTBmMHFOalFydUtLUVlWVkp6cHNCeDFxdS0wbW5pTG1mejRYTXpNU0pzTzhVamZrUUxFdll2aUJuems5bndNc3B0Q1A0dnhwNjh5SC0xdnlEMkhrOWRwY29VWDdyalJTVUdVUTdpWHJnNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "'You're not just recalling words, but an emotion': The lifelong benefits of making music - BBC",
    "description": "'You're not just recalling words, but an emotion': The lifelong benefits of making music  BBCWhat Happens in a Performer’s Brain While Playing Music?  The New York TimesDepartment of Music to welcome music and brain research scholar for two-day residency Feb. 19-20  Ashland UniversityThe psychology of love’s soundtrack.  Psychology Today‘Take on the world, all with the power of a song’  The Daily Beacon",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQzMyVzJSX29WNnZvM3o5RTU3N0hsdmh0MUF0dm1STmlKWGlUVk5zXzg4RGZmanJwUXh5N1JUOW1tdDlMUUtPaTNwVElqaEgzSlg3OXFRSnhrRVRObzZRMmJXMDVfd0pkUUp1MGhsbzlqX2M5aGU2aDVmQzFlb1VYa3k3NmwxOXEw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]