[
  {
    "title": "Senate leaders scramble to save bipartisan deal and avoid a partial shutdown - AP News",
    "description": "Senate leaders scramble to save bipartisan deal and avoid a partial shutdown  AP NewsDemocrats reach shutdown agreement with Trump and Tulsi Gabbard emerges from the sidelines: Morning Rundown  NBC NewsSenators look to resolve government funding holdup ahead of midnight deadline  CNNCapitol agenda: Senate shutdown deal hits a Lindsey Graham snag  PoliticoTrump says deal reached on stopgap spending bill for DHS, but weekend shutdown still possible  Federal News Network",
    "published date": "Fri, 30 Jan 2026 14:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxORHl0dDM3XzBoWHhLVjVtdEJBVUR5d2J2M0Ntc0NVb25jSE1GZllsZUJzTHBkZDVGY29vNnVfSDVRWlRQWGxaaGlWOUxHZE9EdDdxeUFac2lsclYwSW9UX3dRcHZzT2pjUERQaXR4RzVQanRPTGw5NjQwbGpMTFVLdEVKYnBybHQ0WEdoSFhvQVNfZnR0OE1tX0E0UUlvQ1RKT0QwbF9MNkNnbnBhNGxTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Justice Department is releasing millions of pages of documents in Epstein investigation - CNN",
    "description": "Justice Department is releasing millions of pages of documents in Epstein investigation  CNNAttorney general says justice department ‘did not protect’ Trump when reviewing Epstein files – as it happened  The GuardianDOJ releasing 3 million pages of Epstein files, 'didn't protect' Trump, deputy AG says  ABC NewsEpstein files live updates: Trump DOJ releases millions more pages of records  NBC NewsEpstein files latest: US justice department releasing more than three million pages  BBC",
    "published date": "Fri, 30 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5DSEtzNE9oZVJZZElUMV9KT2hLYkdDTlFyMnA5S19hYTdBSXItQ09fY0FPbWxlSlBFbHcxaVF2MDdZMXdkY000aWlBR3A4X1Rla1dudlc0X3E0dERaSno0aUJIVU5YQ3pyOG1YTGdCMmxjTlU1X0JqVHBMczFrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions - The Washington Post",
    "description": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington PostWhy is Tulsi Gabbard involved in seizing 2020 ballots? How election conspiracies could affect the midterms  CNNF.B.I. Search in Georgia Shows Trump’s Willingness to Pursue 2020 Grievances  The New York TimesTrump posts discredited conspiracy theories following seizure of 2020 ballots in Georgia  ABC NewsTulsi Gabbard under scrutiny for showing up at FBI raid of Georgia election hub  NBC News",
    "published date": "Fri, 30 Jan 2026 14:29:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQMEhwdDdXc0pvTmpIbVNDYlNhRXhERUFYZFpmdXlsV2duRW1UQkVwMlBzV2hPblhKLWlpTUJpeDA3V3h0WlRhM1hKOHVYY200dmhxVzRQVnF1MEFIRjlKWWFsU2ZXekJDaE4wUDFTb2NEcXI4aXpiR0VhRTBmQVFNc0NlWXZfandHelRyN29HV1o0UHJGb3BsaGFGZXZNZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "At least 85 deaths reported as bitter cold grips South in wake of winter storm - ABC News",
    "description": "At least 85 deaths reported as bitter cold grips South in wake of winter storm  ABC NewsWinter Storm Warning issued for multiple WNC counties starting Friday afternoon  WLOSMore than 70 dead amid massive winter storm as freezing temperatures remain  NBC NewsNew snow totals are in. See how much fell across New York  Democrat and ChronicleDamaged homes and snowy roadways as winter storm hits US  BBC",
    "published date": "Fri, 30 Jan 2026 13:59:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdzVpVjIxcFZfMHYyLVBlemYxR3RMaFJST2tfQzM4bHdNc01QSVJDaHdMamhQYmp4dFZ1a0FQd2dvZUdka1FzUUZubEdacTlXX3hhYy1TMy13RmpCRFBZc3A4UTNLTGhNNnVwWjExbFI5OE91NmIxekhPaldrbzdScXU2dFNKSzZhRURWSW1WSjExV25xUXk00gGcAUFVX3lxTE9xX3NWV0g4VmNOVVlVSnByYXNSbDJlZXFVNE1FMXN6S2ZDX0NRV2FOUG5sNXpybl90QnRsVl9Jdnc0UE42TEZ4T3lQQ1JGcWVHUUdaWUJGZUNKb1JFVm53ZXpra2pFZGpZRmFhRGRHTnBTa0RuLUpsaEtvTm8td0ZKQVE5NTBRSlRreDRHNnRVVUhlQVlkaTFOT210LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Ukraine sees quieter night as Trump says Putin will not attack its cities - BBC",
    "description": "Ukraine sees quieter night as Trump says Putin will not attack its cities  BBCTrump Says Putin Agreed to a Weeklong Pause in Attacks Amid Extreme Cold  The New York TimesConfusion in Kyiv and Moscow after Trump says Putin agreed to pause attacks for a week  NBC NewsZelenskyy cautious on Russian bombing pause during extreme cold weather  The GuardianRussia halts strikes on Kyiv until Sunday at Trump's request amid bitter cold  Reuters",
    "published date": "Fri, 30 Jan 2026 13:46:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1GZVB4bGtfRGZwZDVmSkxGU0Z0NW05Z3dJbUt2LUQwNGtVRUIwcFRwRGlEMjVuTVN6cHlHV2hkNU9hdzNXYVRTSVhNWWZjWUMtQ0lKMUx1Rktrdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Syrian government reaches deal with Kurdish forces - BBC",
    "description": "Syrian government reaches deal with Kurdish forces  BBCSyrian Government and Kurdish-Led Militia Seal a Deal to Merge Forces  The New York TimesSyrian government and Kurdish forces reach deal on permanent truce  The GuardianSyrian government, Kurds agree integration deal, US hails 'historic milestone'  ReutersKurdish-led SDF agrees integration with Syrian government forces  Al Jazeera",
    "published date": "Fri, 30 Jan 2026 12:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFAwWW1WcVg3Skp1aUJ6OU43VFlMSVBNQzY3M003alRVNlU1OGlzYVFaQjhpZURIUm5EaHZzR2pHbWVuTENKWE5QSnY3Q3JPSVB2LTlQOWdDc1dndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Anti-ICE protests to be held across US as organizers urge national strike - The Guardian",
    "description": "Anti-ICE protests to be held across US as organizers urge national strike  The GuardianNo work, no school, no shopping: Jan. 30 nationwide general strike to protest ICE gains celebrity endorsements  Business InsiderDetroit area businesses, schools join general strike against ICE  Detroit Free Press‘ICE Out’ strike and protests: what to know about demonstrations across the US  The GuardianProtesters call for nationwide strike against Trump’s immigration policies  AP News",
    "published date": "Fri, 30 Jan 2026 11:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9mVGZTRG1JRmtyRXkwckk0NTl4SXZGTGFnWnN2dmk3WFFzUWREUjFLSzI2RDItSUZaX04tdl9naDJLelNvbkF2elIxemtOdDl0SWRpcVI4ekJvOGFiTUxuUjN0N1cyaFpUQy1obHptUjY0al82NmRwWWY2NEdQOW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video - The New York Times",
    "description": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video  The New York TimesCalifornia Gov. Newsom files civil rights complaint against Dr. Oz  USA TodayNewsom fights back after Dr Oz accuses LA’s Armenians of healthcare fraud  The GuardianDr. Oz video alleging fraud in Van Nuys prompts response from Armenian community  NBC Los AngelesGov. Newsom reviewing Dr. Oz video that appears to target Van Nuys bakery; owner reports business drop  ABC7 Los Angeles",
    "published date": "Fri, 30 Jan 2026 02:12:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE00VHJ4NGNHeVZ2Ukd1YlpsaGdEM2pfY2dZZ2FCVllmSGljMWRLYllDcS1LOFVrZEh6NTVRSlRHWHpwUmJaMWc0WjVJTGRvZTNDeFVDM3lEZElhZEN2YW5LSUpIUzBEdVFSQmoxNmRjMW1tN1lKOWJB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "These 12 cities will be hit hard by a bomb cyclone this weekend - The Washington Post",
    "description": "These 12 cities will be hit hard by a bomb cyclone this weekend  The Washington PostMost snow in years, blizzard conditions possible in parts of Southeast from powerful bomb cyclone  CNNA bomb cyclone is forecast to hit the Southeast this weekend, with snow, wind and flooding. Here are the possible impacts and timing.  YahooWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelAnother major winter storm, with possible blizzard conditions, forecast for Southeast  NBC News",
    "published date": "Fri, 30 Jan 2026 18:08:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRjlZWGdBQXVDbVE2OWtoaGFHck9FR1B1Wi1MREdhV0c2OUVwVkJpVjNnOFJ2OGRJQWxwdDRwWFNpMW1XSTVKdHpsUGcxZUIteFRCVEY1eVhtbU1HWC1LR0JEczFyMVBxVGpmcjlpU0tZQ2JabVBBR19DOGxZcVJkaTJSWmp5Y2pWSEZhZVpxNzBkRWp4VDRJSlBndmk0REQzcXVubVlKNkdPVGdydDRz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump Immediately Blows Up His Border Czar’s Bid to Calm ICE Backlash - The Daily Beast",
    "description": "Trump Immediately Blows Up His Border Czar’s Bid to Calm ICE Backlash  The Daily BeastAgents in Minneapolis could be pulled back if local officials co-operate, border tsar says  BBCGreen Bay officials prepare for possibility of ICE activity following Alex Pretti’s death  WBAYBorder czar says he plans to \"draw down\" ICE and CBP operations in Minnesota  NPRGreg Bovino Loses His Job  The Atlantic",
    "published date": "Fri, 30 Jan 2026 11:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPNWpYZUhUOUlTaFlOeFZZbjhYZm5sVGtzdERjSlc0MGVGMURMdWlTVVJDOWpmeVNIZkFaTGJFaml4Zk5IcEZFQ09oTVZLQ0NFaEhDakVKdTJwSXh5b29NNWJQWVFFRl9wbzRnbmdVaEtraEhyYlM5Y0lCWEdReHRSWlc5RTVWUnFCa0RVN0drLTJNamhfUTdHREhEU3RYN05LNnBwbzAzeDRQX0F1aUFzdHdnMS1VdTN0NU1hYkVGVGtTamM3dzBNYmk1eURST01KYm1V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "description": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure  AP NewsIsrael announces plan to reopen Gaza’s Rafah crossing on Sunday  Al JazeeraIsrael Says It Will Reopen Gaza-Egypt Border, a Palestinian Lifeline, in Days  The New York TimesU.N. and aid groups push for phase-two of Israel-Hamas peace plan, opening of vital Rafah crossing  CBS NewsIsrael to reopen Rafah Crossing to civilians, coordinate with Egypt, EU, PA on security  The Jerusalem Post",
    "published date": "Fri, 30 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPQXUwMDlSQ01WSzZ0X0w3bVV6VFpqU0xVVVBiemRMSjJOYXB4bVRNRDdNQXlYWjh2NTdWTk5qMzAyZkxZeEdSd3NWal9ndXVUUFNiY0U1Qkg5a191dFdBdlZWY0w4dDR5b3FEQVl5MEtlUEowNmhKcTJBUk5uRzJ1TlE4QUU4Zmd3T1hRYk53aWZqRXVlanFILVpjZE1NSHBjYko3eGFoeGNQS3ZWY2VKTUxaR095YjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Shark kills 13-year-old boy at popular beach in Brazil: \"Ate almost his entire leg\" - CBS News",
    "description": "Shark kills 13-year-old boy at popular beach in Brazil: \"Ate almost his entire leg\"  CBS News13-Year-Old Boy Dies After Being Mauled by Shark at Popular Tourist Beach: 'Ate Almost His Entire Leg'  People.comBoy, 13, Dies After Being Attacked by Shark in Front of Friends  The Daily Beast13-year-old boy dies after shark attack in Brazil  Latest news from Azerbaijan",
    "published date": "Fri, 30 Jan 2026 12:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9CcXZ1QVdZdE4zZTFkNUFrRTZPdTF6VHhFdVNoU1VyMElsdzNfN0dVcUJxNEdTamJSZTd6aWQxcG8yM05SMXdmQXdOc1JpWEVUcVhnZ0Z4RVUzWF96by1BRnBFTzhpQ1hxUTNrSkMtNGN5MmlHeTJVWnhMM1TSAYIBQVVfeXFMT25CM1BTUXVOZ2NoVDQxM1pDVmlQSW00MjNCbE05VVJabGR4R2RlN1FEeTFnaGdXT2tNRVVQY1JqNkIzUmdtOTZJdTljQjJDemNqYmxMU2pkeDVQaUpHRGlRRWZsWEcteXJ5SjdhWUlTLUg5VThYMklpbzBoWHNRM3NJUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "MSF statement on sharing staff information and humanitarian operations in Palestine - MSF - Médecins Sans Frontières",
    "description": "MSF statement on sharing staff information and humanitarian operations in Palestine  MSF - Médecins Sans FrontièresMSF walks back plan to share Gaza staff details, saying Israel refused to provide safety assurances  The Times of IsraelOxfam refuses to provide Israel with details of Palestinian staff in Gaza  Al JazeeraMSF withholds staff lists from Israel due to security  The Jerusalem PostEU warns Israel’s suspension of 37 aid groups risks blocking life-saving aid  EUobserver",
    "published date": "Fri, 30 Jan 2026 11:57:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUVhYSHpmVEtkSGFhbWdLZ2pUa2VWVDZwRlQ1M2ZyOWJoeFBhMDJkWFlfY3ZON2VTci1Vb3ozaUhSTUJ2QVRxMWhiVTh3blk0T1lEdGludjZ4TGNGVldVaEJncm5aVXNOdThFSmlPdXVOM2pNSFdVTWtHYjBScW9JN2hjczNmaHdsR1BXZ0VPazBZOFFDSXFLaGxGZFdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.msf.org",
      "title": "MSF - Médecins Sans Frontières"
    }
  },
  {
    "title": "Iran warns of ‘hazardous consequences’ after EU designates Revolutionary Guard as a terrorist organization - CNN",
    "description": "Iran warns of ‘hazardous consequences’ after EU designates Revolutionary Guard as a terrorist organization  CNNEU adds Iran's Revolutionary Guards to 'terrorist list'  BBCHow Iran’s Revolutionary Guard became a powerful force within the country’s theocracy  AP NewsBritain to ban Iran’s Revolutionary Guards  The TimesIran: Council adopts new sanctions over serious human rights violations and Iran’s continued support to Russia’s war of aggression against Ukraine  consilium.europa.eu",
    "published date": "Thu, 29 Jan 2026 21:15:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOa0ZDX0Q5eE1FNzF6V0lubVAydjhWQS1OSGlGTnl5VkUzRkx6MTBsOGNVbmdVa1BsR1h6ZmI3cmZUUlJsSWJGVnpqV2RidFlOTFhwdDQ2SkVNamRZQ01fQ0c3aFY1NGN2OFFKd3FTWFczWHVMcDcySVNXc3RzX0s1VVR2bVZBWVc5S3VTNS1TS1Z6V1pUeWM3a0podFVGYmtwUmNUZ0txcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Exxon earnings beat estimates despite low oil prices - CNBC",
    "description": "Exxon earnings beat estimates despite low oil prices  CNBCExxon and Chevron Lift Oil Output, Blunting Crude Price Drop  BloombergExxon, Chevron Post Slimmest Annual Profits Since 2021  Yahoo FinanceExxon Earnings Beat Wall Street Expectations. Why The Stock Is Falling.  Barron'sExxonMobil Announces 2025 Results  Exxon Mobil Corporation",
    "published date": "Fri, 30 Jan 2026 11:37:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1XZVZpMXAwSHE5Sm1Yc0lyLVRZSkdobVB4ZHdlNVlGY1RfNldlM2RpZlV2eElZcGhEVTFOQXhMamY1WmJXU182anVQcGZaX0EwXy1yanY5Sk1vU3hoVENEem0tdlh4LWd6MC13TVFvZnVIQ1BEOFNB0gF8QVVfeXFMUEcyNWt3SVlJVGpkeE5nUENwWnJWbFlmOWlEMHhKWEltOHlqQ2oyWERZd0U0eERkY2FBTGhBWDM5elViUVRxS2xsZDVxT0tKWkdnVk9ldUZGRkdFdGhtckptVGp5R2huWV9UV2pQV1dnRUhEUV9VZlV6Y0VTTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Eli Lilly plans $3.5 billion manufacturing plant in Pennsylvania to make next-generation obesity injections - CNBC",
    "description": "Eli Lilly plans $3.5 billion manufacturing plant in Pennsylvania to make next-generation obesity injections  CNBCDrugmaker Eli Lilly announces new plant in Pennsylvania as part of broader domestic expansion  Yahoo FinanceLilly selects Pennsylvania as home for its newest injectable medicine and device manufacturing facility  Eli LillyEli Lilly to build $3.5B Lehigh Valley manufacturing plant, add 850 jobs  The Business JournalsTrump says Eli Lilly to build six US plants  Reuters",
    "published date": "Fri, 30 Jan 2026 16:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOalJYUVhQNXNpcXdpUndNMUtGNXlwYWx6eVRFVkZ1Y194UUxTNG9oZVJ5b1lCWk9ZbmtaZ0FvSFNXS08tOHRXdldJMGtvZXA1R3RvYWJ5bndSaG9kNENPdVJFOUxOVGVFeV85bDZvOG05M3A3QnZSUVB3X0hlUnUtRTItb3UwcFhjX0RBdldBRFVaZnZjdE1CYWtCTdIBoAFBVV95cUxOT0J3QVI4ZjFqdWpsak9XTFJGQjN0Vi0wSHVtYlFSQVliN1duamJTV2JSbk52LWtUbktzQmZtdkdzcG4wTHpvbXVVOEYtWEwtaFNwanBDcm1KYWo3Zzc3c2RER1FaMER5Yk5nbFd4bDVkN1VGcGwtanphaDcwV2xVMllGZ1dMVFBPYWJWM1h2STU1Y2tDemJsYlRyZ3dIN3cx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Washington Post Plans Cuts to Reshape Newsroom - The New York Times",
    "description": "Washington Post Plans Cuts to Reshape Newsroom  The New York Times'Washington Post' journalists plea to Bezos: Don't gut our newsroom  NPRWashington Post’s White House team urges Jeff Bezos to halt massive newsroom cuts  CNNInside the Washington Post’s Existential Meltdown  New York MagazineA terrible time for Bezos to gut The Washington Post  The Seattle Times",
    "published date": "Fri, 30 Jan 2026 00:20:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOeGpOMXNQb21zVGp6UjJOOXVJWFAtRTRFckt2ak11amdqNHNZUVFIWlNxQ3ZEa05nbW9DMGtvbG1MZmNsdXlYc3hlYmlhYnhyeElZcTNiSEZVVThJaUJyMjd4STZ0V2JOTzZCcWlvRFFxSkw1LWxNUm5ROExPZmM5aUdPbl9vUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Key promise of Trump's tariffs goes up in smoke - Daily Kos",
    "description": "Key promise of Trump's tariffs goes up in smoke  Daily KosTrade deficit soared 94% in November and was higher than a year ago, despite tariff efforts  CNBCU.S. Trade Deficit Bounces Back as Tariffs Cause Volatility  The New York TimesUS Trade Gap Widens From Smallest Since 2009 as Imports Rise  BloombergUS trade deficit widens sharply, reversing big pullback lauded by Trump  South China Morning Post",
    "published date": "Thu, 29 Jan 2026 18:00:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQMm1sYm96SVkzckl1NFJzNTh5YjBSbXlHMFhhdklkOUV2WnUzZkhZaUFIeU5YbTR2TUF3SjFaUUdINVBCcFluNHFsTTJkSjFoampGOTRSQ2Y2R19EdHdydFpRYm0xOUFTNEdkZ3YtSUxSUUxYVkh2X3dtWEI4bGZqYzE5S25vTDg0YksxVnhVLUFFYkdNMzdvTnVKWGZhRVRI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailykos.com",
      "title": "Daily Kos"
    }
  },
  {
    "title": "Samsung’s confusing Galaxy S26 pricing raises base model cost, but makes Ultra cheaper - 9to5Google",
    "description": "Samsung’s confusing Galaxy S26 pricing raises base model cost, but makes Ultra cheaper  9to5GoogleExclusive: Samsung Galaxy S26 Ultra Renders & Specs  Android HeadlinesSamsung Galaxy Unpacked 2026: Everything we think the company will unveil  EngadgetExclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26  SamMobileThe Galaxy S26 keeps leaking, but the Qi2 situation is still unclear  Android Central",
    "published date": "Thu, 29 Jan 2026 17:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMVZBR2pFSVRab3FpenpGekQzNVl5bmxXWnZ1QW5nb0p3SGNJS1YxN2N6c2R1SG5VWDg1V2dnN0Q2bjJqOXdpaXQtV3VZLXpyY1pUeEJ4TjJWQ1RCUWQxcE9pdXNXSEFyelI0aWlWaDc5aEQtMjNiM2FJMmdBWXFTc0ZuWkVmMHJ4VWN1ckhlSDhBWk8wMzN6MnZtZGdVRmlxYjJV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "Google adds Video Overviews to NotebookLM app on Android, iOS - 9to5Google",
    "description": "Google adds Video Overviews to NotebookLM app on Android, iOS  9to5GoogleGoogle's NotebookLM Transforms Document Analysis Into Video Content, Reshaping Enterprise Knowledge Management  WebProNewsGoogle Brings NotebookLM Video Overview To Android  findarticles.comNotebookLM's beloved video feature is now on Android  Android AuthorityGoogle adds Video Overviews to NotebookLM app on Android, iOS: Report  Business Standard",
    "published date": "Thu, 29 Jan 2026 22:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFA2R2tUMnVLYXFZWkllRHFCQ1FZUWhWWkRTRnhMYTRUbTRyS0RHVDFIRXRJYmQ5VzlrWlhid05CMXlWRmc4YTg0XzNSYl9RV3pkVmlfNkExeHNLQUdDbnVleTc3Zk9wbUlHa2M3R3hiczdKNUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "People complaining about Windows 11 hasn’t stopped it from hitting 1 billion users - Ars Technica",
    "description": "People complaining about Windows 11 hasn’t stopped it from hitting 1 billion users  Ars TechnicaWindows 11 has reached 1 billion users faster than Windows 10  The VergeSat Nad declares Windows 11 has a billion users – just don't bother asking for details  theregister.comWindows 11 has 1 billion users - and they're furious  ZDNETWindows 11 Reaches 1 Billion Users in 1,576 Days — Faster Than Windows 10  TechPowerUp",
    "published date": "Thu, 29 Jan 2026 22:46:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNdGlJOTJsSDc2TVFxV3NndGtGMTB1X0FITl9jRDJWcU8ycmJPSUtnUUtSMWFUb3VpZ0p6MkMxNHo3OTJlVXNQS25Hbk1OVnEwT3dfbWkyY3pGZWlQdFEtMXNBTzhCVi1NSjlXTUtITHQ3ZElhUng3bnlGV0JjUm1GbUIyLWM3MFNjUlBCc2Rwby16NS1ZQjlZWS03WTNFS0NMdGlKdXN5ZUZQM1FneG4zcmdybmk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "YouTube may be blocking background play on third-party browsers (Update: Google confirms) - Android Authority",
    "description": "YouTube may be blocking background play on third-party browsers (Update: Google confirms)  Android AuthorityYouTube background play not working on Samsung Internet for some  PiunikaWebPopular YouTube background playback workaround stops working  MashableYouTube blocks a popular background play workaround to make you subscribe for Premium  PhoneArenaBad News for YouTube Users: Google Closes Popular Loophole  nextpit.com",
    "published date": "Wed, 28 Jan 2026 22:43:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBfX1hwd0tPUG5LQUNXUXJoNW5Wam9BZWpJUmIweGpnLUhZWExjNjROZ0pKNXpWNGZiRzRSNmpJM2R6WTlDemNEa3dhdDM0aktqa05nX24wbnVib0xkVGpESGN1YnR0UGRIellxcmZzX19YeC13emFyZXdyMmo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "See Paul Mescal, Barry Keoghan, and More in First Look at Sam Mendes’ Beatles Biopics - Pitchfork",
    "description": "See Paul Mescal, Barry Keoghan, and More in First Look at Sam Mendes’ Beatles Biopics  Pitchfork‘The Beatles’ First Look: Paul Mescal Is Paul McCartney, Barry Keoghan Is Ringo Starr and More in Four-Movie Event  VarietyFirst stills from Sam Mendes’ four-part Beatles film released in Liverpool  The GuardianFirst look at all 4 Beatles movies – See the photos of Paul, John, Ringo, George  USA TodayFirst glimpse of Beatles films given by hidden postcard trail  BBC",
    "published date": "Fri, 30 Jan 2026 15:24:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPUlBhM2xIMWw1eERBRVhrYlFRemRCdW1uc1ljd0xXTmdDWjYtbG40aGhfRmFnZU5RN01nci1wenYzTi16aGhrVG5uc29RUmRYVkFMYkZYWXJ2d1ZHaFFOOExIZE5ua25lcUVWS0VUUkt3czNRc1VZd0xLbnRkM05iLVJxT1FGMExIMTI5YTlSckNuTHFha3pTZ1JvU1J1cHdkX2FFWlpGNV9TeU1jM1U4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pitchfork.com",
      "title": "Pitchfork"
    }
  },
  {
    "title": "Kylie Kelce Has Surprising Response to Question About Travis Kelce and Taylor Swift's Wedding Plans - Yahoo News Canada",
    "description": "Kylie Kelce Has Surprising Response to Question About Travis Kelce and Taylor Swift's Wedding Plans  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 16:05:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNbUdkZnNQdEZpeW45bGQwaVkwRG9laUZsWFhyLWFqTGVsU29RVEJCYl96WXNUNEhTaHFIQlBSVUhZZG9yajVyQ2lqeFVZR1llazNIOFZuN1JsbEVnUVJ1VEdxbzlKN3NBb3E3dWxfMUtwQm5xTFhqX0ZGZl9CeVBzQ3RaODlxQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "The Sundance Film Festival’s big moments and breakout movies - AP News",
    "description": "The Sundance Film Festival’s big moments and breakout movies  AP NewsA Farewell to the Sundance Film Festival—and Park City  Vanity FairThe Last Sundance in Park City Ends on an Aptly Misty Moment  The New York TimesSundance 2026 Review Roundup: The Best Films We Saw This Year, Ranked  Consequence of SoundLights Out, Park City: Sundance 2026 Photo Gallery  Vulture",
    "published date": "Fri, 30 Jan 2026 17:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPQlFxYmMtOW5UZGFKUmU0V3VTWG5MSDdNcldmb29CRmdVSmFHdkl4VjVwTU5MWFRfdVJYLUtoQ1pJLXppWUNBOGFmWWhYT3YzRC1qTHhPZkNZRGFBek5XUG5mN2ZEVGx2MXZXSWRaUnR5QXdDMGY4dUwybmxTbGZrbmRoanM1ZEczNWQ5YXFKT1ZWM3ZJWXNvV1VYcWh2eTV6UDNpZzlwdVRPZWNIZlVhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Red Hot Chili Peppers Documentary Set at Netflix (EXCLUSIVE) - Variety",
    "description": "Red Hot Chili Peppers Documentary Set at Netflix (EXCLUSIVE)  VarietyStream it away: New Red Hot Chili Peppers doc to premiere on Netflix  YahooRed Hot Chili Peppers Documentary Coming to Netflix  PitchforkNetflix’s ‘The Rise of the Red Hot Chili Peppers’ Documentary To Chronicle Early Years With Late Guitarist Hillel Slovak  Billboard‘The Rise of the Red Hot Chili Peppers’ Documentary Sets March 2026 Netflix Premiere  What's on Netflix",
    "published date": "Fri, 30 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQNjhKQmhDdGEzYUxJMVFqa3VvNjVpMkxaT0JXQmVka25jcGlVS2E0X1M1WjZadHV6RURzVXdZSUdtWjBfNXVJRUZUenJaRkxEX1dSSG13Um1mWVhhcVJnZmN3LTdncHdFcmVmV2xCSURLOXhVdmgzQjdoR2NoQk9zd1RRcXV3eXlFLTR6ODFmXzZBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Djokovic shocks Sinner in late-night thriller to reach Australian Open final - The Guardian",
    "description": "Djokovic shocks Sinner in late-night thriller to reach Australian Open final  The GuardianNovak Djokovic wins 5-set semifinal thriller over Jannik Sinner  ESPNNovak Djokovic reaches Australian Open final after stunning win over Jannik Sinner in historic title pursuit  Fox NewsCarlos Alcaraz and Novak Djokovic make Australian Open final after epic pair of semifinals  CNN2026 Australian Open men's semifinal picks, best bets, odds: Expert backing Sinner with tennis predictions  CBS Sports",
    "published date": "Fri, 30 Jan 2026 18:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNc1hNdkg0bHdsY3p2anRNTUJuckZBUld6ZlNfVS0wTTV1SzBnaXctZE9rVTJuU3BOT193Nkt1OXRPMnlLOGtKT3BhZUtScEdOT2Z1bEZoT19ZaGJ2cXNKeHEzdGNRN2I5dUxweHhETFI3NzRQRERoZHZIMXZha3FhRFVyMUhQX3ZWb3RGT3l1OEpxekpCbzFKQ2NqN1NUMVJxbEpHd3pnbVM1MUJjWmdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Cooper Flagg sets NBA record for most points scored by a teenager - NBC News",
    "description": "Cooper Flagg sets NBA record for most points scored by a teenager  NBC NewsKnueppel, Hornets overcome Flagg, Mavs in rookie showdown  ESPNMavericks teenager Flagg breaks 46-year NBA record  BBCHow many points did Cooper Flagg score tonight? Mavericks rookie breaks records  USA TodayStats Rundown: 3 numbers to know from the Mavericks loss to the Hornets  Mavs Moneyball",
    "published date": "Fri, 30 Jan 2026 13:31:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPbXBiZ3NVQnhOeFJXbzRISDNyWEM5VlRvQ2luYzd0SlZ3N093aVE5b3JkTFBkdFlDWVlON3k0NkVTVlAycFozM3hETDY1cm5SdmtVMzZhV3B5c3hEU0wzRkNxWjhxVHVoN095b05vXzkydWZEOGRGLVhibl9LNVU5cnJRWk1FeEFlTWJmX3dn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Vikings fire general manager Kwesi Adofo-Mensah after disappointing season: Source - The New York Times",
    "description": "Vikings fire general manager Kwesi Adofo-Mensah after disappointing season: Source  The New York TimesVikings fire GM Kwesi Adofo-Mensah after 4 seasons  ESPNMinnesota Vikings Bold Move Sends Shockwaves Through NFL  Yahoo SportsMinnesota Vikings fire GM Kwesi Adofo-Mensah, reports say  CBS NewsVikings Announce Personnel Change: Kwesi Adofo-Mensah  Minnesota Vikings",
    "published date": "Fri, 30 Jan 2026 17:47:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOblZ4MHMteXZRb1R2WmVwQzR4MlM1NWRZS1FFMmhLUXdGQWFxNFNycTViM2tnMklzNmFnZmRlTjR1UTV0ZjhKMjVKTnlvc2l1TGo3T3NwMGFPUU1oMUNQQlFob190MVE3TmJIdHA5cHhYYkxiaUVfUjRSVlJoeGV0bUYwMDRMT2pJX2Y1TEFkeXo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Picking the Most Logical Destinations for Five Major MLB Trade Candidates - Sports Illustrated",
    "description": "Picking the Most Logical Destinations for Five Major MLB Trade Candidates  Sports IllustratedBold predictions for rest of 2026 MLB offseason  ESPNSeven big names who could be traded before MLB Opening Day - The Athletic  The New York TimesDesperation trade offers for Jarren Duran, Nico Hoerner and more as spring training looms  FanSidedMajor League Baseball: Free Agency & Trade Tracker  thewilkesbeacon.com",
    "published date": "Fri, 30 Jan 2026 12:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5tU3ZCMVkyVzFtX0hvNnlZc3Y5RHVHQU54VzBlVU1ieHBMSXlISUtmWWVDSWo0WndUeWFaUG03NnhWV2tEeXpxNENSd1FKVDJXZi1PckpaSmJ3NmVVS3pxaDVTdkhwa0hma3piQzNjcm9Ha2VHeXMySnVBTzUzRU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Watch awkward Chinese humanoid robot lay it all down on the dance floor - Live Science",
    "description": "Watch awkward Chinese humanoid robot lay it all down on the dance floor  Live Science",
    "published date": "Fri, 30 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxPdkxxdXBPUFBtb3RDR1g2WUVVSDV2ZUVxZzd4M19nOFM5UVRWdEthSS1jdC1ZS3lOTTZKZEVUUzNBYWxIWUJqME1oZVMycG4zRFBZODFackFSMWlZV2ZqcGZHTkN3c2pablpWdE1paF9acHo4X3V0OW1WYll3dWxUaEJUckhPVFM0Q0g5UGFkVE9jNDNPSmhxWDd2a05ZaVRMZ1NWRGt0akZhaGRJX2ZIM0xTTXNKM3I5SHIweDh1TjU2aVBJYkFCRC14ZlN4cVItU0xr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "description": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow'  Space3,000 light-year-long jet offers new clues to first black hole ever imaged  Scientific AmericanProbing the jet base of M87's supermassive black hole  Phys.orgEvent Horizon Telescope probes source of 3,000-light-year-long black hole jet  EarthSkyM87: Astronomers Trace 3,000-Light-Year 'Cosmic Blowtorch' To Its Source | WATCH  Republic World",
    "published date": "Thu, 29 Jan 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxObEpLTjdzVFd0QVhhV1pHTi1GTlFjTGdHN1ZxdGRIaWFPOHV5MTdMZE0ybXVBRGtuYzc4U1NPZV82cGhROTcyVUEzRUJmRDJncC1obkEtRjlzOThaUy1MSnhQVDRjQ3FlMnJwcV94Wks2STJReTFHYjBrU3c0WXNLMUdQMEFydEdMdWprdFFQdm03WDlVMTl3UWpMaDFYUnBvV1liXzhFa2I3V2lqZ1JIRWhCRElsTzlaX2UtMTNJY0pXa1Y2RXV2cFBiLWltYnhZVk9jZ1R4Q1lDNUpnUl95ZmJmaFhfa0pZMWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms - Live Science",
    "description": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms  Live ScienceView Full Coverage on Google News",
    "published date": "Thu, 29 Jan 2026 16:04:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTXdiTjVhQUlmaE1NZ1VtWF9hLTF4Ti1VU3ctNWZrWFJUcW85dlB2emZzRnJtM3hFTGI0WkxmcFE2UnBmZm15ZUMxcFJoZGxSUFpUOWhhSkJNc2VVa1NlYUZ4b185STl1ZW1fTzVINHNOWVYtQ0wwSTJaMDhlZXNUX0daODNMRDF4XzBpZk95b3ZLdDVybDFSeWVLX3AxOTZfNmdDV2RueVRULXM5TXFSWVFFc0lXdUhJUU9tc19WdWU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Astronomers uncover hundreds of new 'anomalies' in Hubble telescope archives - Live Science",
    "description": "Astronomers uncover hundreds of new 'anomalies' in Hubble telescope archives  Live ScienceAstrophysical Anomalies from Hubble’s Archive  NASA Science (.gov)1400 quirky objects found in Hubble's archive  European Space AgencyAstronomers Detect Hundreds of Cosmic Anomalies With New AI Tool  ScienceAlertAI reveals 800 never-before-seen ‘cosmic anomalies’ in old Hubble images  Scientific American",
    "published date": "Thu, 29 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPWTlwUHY2Rk9ENEZIUWkyNlFpMXVMOVVmeVFuQ0FzaGdpbmI4Mi1JQjdFWXVteXgzeFhyZHJ6T0JXUkdoWlNiZGxOTEYxUmJxbkxRY1ptaUFnRzVPUUJrSVVtU0hIeUFqbXNaU0R5OGZZYUlySzVsdk42TW1rS284aFRjRkdaYjI4dllTZ1FvcFBKRmdQejRwLUdSMDFTSEVKZE1rYzA1ejBkbEtyQjEtdENpT190Z3dDYUFCUXRFNGdkOF9vTVJBN2ppSWd1UkstaGt5YVZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Staying up late is linked to poorer heart health. Here’s what night owls need to know - CNN",
    "description": "Staying up late is linked to poorer heart health. Here’s what night owls need to know  CNNLike staying up late? You may be putting yourself at risk of heart problems  Scientific AmericanSleep timing could directly impact chances of heart attack or stroke, study suggests  Fox NewsPeople who naturally stay up late may have worse heart health than early risers  NBC News'Night owl' lifestyle may bring higher risk of heart disease: Study  ABC News",
    "published date": "Thu, 29 Jan 2026 19:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOdXFZWVdlaVZvYmlvMmFDc0xwbXNZd19iVkNmTWZhU2hfR1JXXzJGUzB5UHhSQ1NPLU81R3RMV1ZNY09FZVVRRWpXZlF3QWJCWEVKNHBoa3QzYU80VTZLc081MkRQSTlrdHFPX1l2Tkh0UEtaTUJUTGRkTnpVQ191c3IwaE1Cdzg1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Guest column | A self-collected test allowed me to finally get cervical cancer screening - The Washington Post",
    "description": "Guest column | A self-collected test allowed me to finally get cervical cancer screening  The Washington PostUniversal self-collection of cervical samples may hike HPV screening rates  CIDRAPCervical cancer screening updates are a major step forward in saving lives  Baylor College of Medicine Blog Network -Dr Neff on the Accuracy and Feasibility of Self-Collected HPV Testing in Cervical Cancer  OncLiveUMMC research helps reshape national HPV screening guidelines  WAPT",
    "published date": "Thu, 29 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQamc0SXZiV3ZEdzBvWGZqQVJ4U0ladGZkOUYwUktEOXFHa3gxZ0hCUjAzQjVaYUxJZmdoWHlWS05wUkI5M2xPUGk4S0xXVS03R0t4bjk4NXZiNlFrZzJ0WnZsNlBZOHRoT3MxLTMtOEppSEZGamFxSGhwQngyT0JpeHpVZXNnYkNPMFQzT19GRWQxem5OYTdz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Parents Navigate a Fracturing Vaccine Landscape - The New York Times",
    "description": "Parents Navigate a Fracturing Vaccine Landscape  The New York TimesUS vaccine recommendations used to be based in science. Now it’s all vibes  C&ENTrump and RFK Jr. may usher in a blue tsunami  The Wilson TimesNegligence: The potential consequences of the anti-vaccine activism in the U.S.  Новости GxPSharp rise reported in nonmedical vaccine exemptions  Contemporary Pediatrics",
    "published date": "Thu, 29 Jan 2026 16:57:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzVzdSLUJSUlZrNl9PUjEwTzdaMjN4Uzl5aHRLbDIzcGd6ZE1ZNjBCOGRQWVAyelhLcC1fZE1lTW9zcEF0RG8tY0FsbEs1YXB0ZkJoekNuT1RaT2hlYVhIQXF4ZmFWX3VUelFLMmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "2 Dead From Meningococcal Disease In Chicago As 7 Cases Reported This Month - Block Club Chicago",
    "description": "2 Dead From Meningococcal Disease In Chicago As 7 Cases Reported This Month  Block Club ChicagoAnother Invasive Meningococcal Disease Outbreak in Chicago  Vax-Before-TravelChicago officials report a cluster of Invasive Meningococcal Disease  Outbreak News TodayChicago health officials report 7 cases, 2 deaths from meningitis outbreak in January  CBS News",
    "published date": "Thu, 29 Jan 2026 19:47:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxORHRQTUNPb080WHphX2VYUXc2UnlnMVNqMmtPRkJxRWllQUpoZFhKZTdvMGZBTHRIT2RFSzAzdWgtY1pnV2VKbi1WVG04OU1QWlg5NDNQQ01nX0w4QjhYdm1HWnBBdXUxenNOcTVZZktYdUR6R3FnOTJ1TndvNWJSM0JWaVFaZ3hRRnZ2THM4M0Q0bm9ITDFoR2M1WVdQdnl6UEx4ZERtTXNMSWQ2YjY2RzkwZEprTTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://blockclubchicago.org",
      "title": "Block Club Chicago"
    }
  }
]