[
  {
    "title": "Rising crime, inequality and disenchantment: What’s at stake in Costa Rica’s elections - CNN",
    "description": "Rising crime, inequality and disenchantment: What’s at stake in Costa Rica’s elections  CNNCosta Rica heads to polls amid fears of authoritarian turn  The GuardianRight-Wing Populist Holds Commanding Lead Ahead of Costa Rica’s Election  The New York TimesCosta Ricans vote as right-wing populists aim to extend mandate  ReutersA vote for continuity? What to know for Costa Rica’s presidential election  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 17:01:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5fOFNRRC1JX1g0d1FzN3NaVFZZZ1lWQXpyclB6TUVGc2U1Y1VJQ01iaXIwajZPakpGZFZmeFJPNFZIcDdZeE9TbHJCZkVjOVNVXzBwX0F3VXBxT0RFT2hRY0p3R1JHMUZuYkVTaFNJRlpiSmJYYlpzYVdmZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Two CBP Agents Identified in Alex Pretti Shooting - ProPublica",
    "description": "Two CBP Agents Identified in Alex Pretti Shooting  ProPublicaSenate Democrats and Republicans call for investigation into killing of Alex Pretti  NPRAlex Pretti shooting: Federal officers who fired shots identified in records: report  FOX 9 Minneapolis-St. PaulHe Witnessed an Earlier Shooting. Feds Arrested Him at the Scene of Alex Pretti’s Killing.  The InterceptTwo federal agents reportedly identified in fatal shooting of Alex Pretti  The Guardian",
    "published date": "Sun, 01 Feb 2026 21:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNMUlHWWtHZkdBWFJidHU0TlhEcGNSX25OUG03blVlQzJ6ZWhoeVEwWFd4ZUhxQmhiWmp1cjF1LVB4OThIc1Q0U1NYLXVERDdlVnpPbGlUbUZkd29KOWY0d01kUnR4VzYxT09QbkdFblRWN0pkbklCY1lKcXd4SDl4eDE1V3NxeTBMT2NNajAxbW50ai11Ykt4ZTV0aW51VnBuWkxzeFluRHJ1Tmw0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.propublica.org",
      "title": "ProPublica"
    }
  },
  {
    "title": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says - Politico",
    "description": "Don Lemon’s arrest balances freedom of religion vs. freedom of the press, Todd Blanche says  PoliticoDon Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest  NPRDon Lemon quotes the Bible in response to arrest for Minnesota church storming  Fox NewsArrests of journalists fuel backlash as anti-ICE protests spread from Minneapolis  PBSDon Lemon skips Grammys coverage after arrest  USA Today",
    "published date": "Sun, 01 Feb 2026 19:08:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQZjlWY20yN1Z3TzRseXdlaUZXdEs3cE1WYmsxblhPRUxXWGs0NWtlVTQyZXhzQmdHdGtsODg0NElzLUxGR0dQMGpCZEtFV1lDRktvbmp1OFM2R1NjcFZjUmwySFNjNF9HZXR4VjAzajV1TmdWUV9EbU1scFgtWUt3akllcnRhVUs3bkNnbWNfNUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Did it snow in Tampa Bay last night? Some flurries reported - Tampa Bay Times",
    "description": "Did it snow in Tampa Bay last night? Some flurries reported  Tampa Bay TimesBomb cyclone drops historic amounts of snow on Southeast as snowflakes fly in Florida freeze  CNNBomb cyclone brings freezing temperatures and snow to millions in US  The GuardianIguanas fall from trees in Florida as icy weather bites southern US  YahooBomb cyclone brings bitter cold and snow to the Southeast  NPR",
    "published date": "Sun, 01 Feb 2026 15:30:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQN3pHN1hSblM1VDFYYjZYVjBJaTRsNGV0NlVtZ0d0cHpYekJJd0lNQWMyZ1Z4LTBrUUgzRkxWQzN1ZV8tZkxqcXd4Z2JJRUZndUVjYW9jUDBzYklDaGo2ZFV6LXZCWF96QTNScXJ4X183SG5RdkxvREdUWkF6bDlTVFI1SFRpc2kwcm1TOTl1MjQzYXhCQlMxUzA0ZE9UOG9P?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tampabay.com",
      "title": "Tampa Bay Times"
    }
  },
  {
    "title": "Can Tom Homan De-escalate ICE Tensions in Minnesota? - The New York Times",
    "description": "Can Tom Homan De-escalate ICE Tensions in Minnesota?  The New York TimesTrump signals retreat on immigration even as he doubles down  MS NOW‘Trust Has Been Breached’  The AtlanticAgents in Minneapolis could be pulled back if local officials co-operate, border tsar says  BBCWhite House banks on Homan to help avert shutdown  Politico",
    "published date": "Sun, 01 Feb 2026 19:11:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQZ0N2XzhVdGhwcXQyUmxGaGdzb2RJR2RTQm5vaTdIYlVFUkMzN2hmZjFhQW8ycHZYZXpwc1pMWlprdkViRGs1dlBOQ3RHdHc0a1VZU1hiUnhVWVhhYjZaU1kxako3eklUR2NLalRhc0lfNkxIYTRhQXNUTUhqS2FPeA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Nearly 60 vehicles collide on both sides of Calif. state highway - SFGATE",
    "description": "Nearly 60 vehicles collide on both sides of Calif. state highway  SFGATE59-vehicle pile up in foggy conditions closed major California highway for hours  CBS News10 Injured in 59-Vehicle Pileup on Fog-Shrouded California Highway, Police Say  The New York TimesDense fog causes pileup on California highway involving at least 50 cars  ABC NewsVideo captures chaos inside 59-vehicle pileup on Highway 99 in Tulare County  ABC30 Fresno",
    "published date": "Sun, 01 Feb 2026 16:37:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOR1c4RUdieVNqVnlMX1pCZ3B3M2x3ZDRGX1VrZjU1aFNmZC1LUjlud0g0VS1aS092eXF6S1I5MWpaUVlwa1dDWHFxSDJZN1JMbFdJbV9Wb0hXQ1diUEJwMXp2MTNuRm5lcDNuVGpTemZUWFRTVzJKcHZjR0dSSENCcUFxVDhoMkVLR09TdFdzQ015VmZKREpnNWhmXzItQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfgate.com",
      "title": "SFGATE"
    }
  },
  {
    "title": "5-year-old Liam Conejo Ramos and father return to Minnesota from ICE facility in Texas - AP News",
    "description": "5-year-old Liam Conejo Ramos and father return to Minnesota from ICE facility in Texas  AP NewsBoy, 5, and father detained by ICE return to Minnesota after release  BBCAfter Liam Ramos' release, Democrats turn focus to the rest of the kids detained by ICE  AxiosJudge Orders Release of 5-Year-Old Detained by Immigration Agents in Minnesota  The New York TimesFive-year-old Liam Ramos and his father released from Texas detention center  The Guardian",
    "published date": "Sun, 01 Feb 2026 22:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPMnpId0tOeDQ0d1JlZUlYTTk1WDZaNGxQTTJQSTRLMFZrdzFVUldHbjlpWkFaZHJiQWUwdHZWb3JxWExuSDVQUHpDVnljNWcyUzlkcERFbmgzR2RDU0hhejh6Q0ZEb3RLRWMzanhRT09MWEdSSTFoUTlEOW4zdmxzNDNnNlItc3A1NU9JMzU2cmhFRlEtNEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina - The Washington Post",
    "description": "‘Historic storm’ delivers biggest snowfall in decades for North Carolina  The Washington PostHow much snow has fallen in North Carolina? Check live updating totals here  WXIIAt least 2 dead in North Carolina as storm brings heavy snow to South  USA TodayWhere does this weekend's snowstorm rank among Charlotte's biggest winter events in history?  WCNCSnow accumulation higher along coast and central NC than in Triangle - bitter cold coming Sunday night  WUNC News",
    "published date": "Mon, 02 Feb 2026 01:05:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxONzB4OGpTcmlyOElUZnh6MElLZ3ktckQ2N1pTck1mSmdRRWtoMEJLMU9aZVVydks0OTRyX3E5MmpLdk9mVk9ZUkpjaWZvLXZGb1VpSWRwOTVoTVdpeWVISzRUNEk2Zm9wX09MUVQxOWtwdWV1bTBfWmxuS1hRbmdiVzliYzRCc29nWXQxSHdPdDZXUGdnUElMTFQ4U0VmbUJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties - The New York Times",
    "description": "Starmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties  The New York TimesLatest Epstein file photos appear to show former Prince Andrew on floor with female  CNN‘The Duke’ and ‘The Invisible Man’: key revelations of latest Epstein files release  The GuardianSecond Epstein victim claims she was sent to UK for sex with Andrew, lawyer says  BBCEpstein files lead to resignation in Slovakia and calls in Britain for former prince to cooperate  AP News",
    "published date": "Mon, 02 Feb 2026 00:01:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNSlA1TlpPTmdwWXJqLTRxRDFZbk9HVjlPWEx6WVliRTlVMEVIbTdRQy1oV0tzaHp3amk0SWFNNnljY2pOT0hsTU8yVnlRN2lWd1A2Q2F4WlFNMzVmVDJndWRjUDYxWmRrMnBmejlpMzNVMzJxTXBzVWpxRWFubEx0bFNaWS15cVFwNE1BZE43MlRSems3eWhteGVGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Federal Courts Undercut Trump’s Mass Deportation Campaign - The New York Times",
    "description": "Federal Courts Undercut Trump’s Mass Deportation Campaign  The New York TimesMinnesota AG Keith Ellison vows to continue legal battle after judge denies request to stop Operation Metro Surge  CBS NewsJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoMore anti-ICE protests underway nationwide after judge declines to immediately halt Operation Metro Surge in Minnesota  CNNJudge says she won't halt the immigration enforcement surge as a lawsuit proceeds  NPR",
    "published date": "Sun, 01 Feb 2026 18:11:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX1BHVTBjSkllOWppNTJlLW9BSHZ0ZE4wUFZSbEdvbjdXa1Z6X1ZTV1VlUGQwTElmb2d5clgzOVM1WmhRUXVfb1JpOVhQYVVfcVpBQVVhelBtR3VLWUcyZ3B3Rjg4MGdKMy1qbWJTVW5JdnFmTkRrX1JvclM1MjFYOU03RHRIR3dlLTR2WnI2Z0kxeURvbEo1dXdNZFY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Czechs rally to support president in his growing rift with government - Reuters",
    "description": "Czechs rally to support president in his growing rift with government  ReutersView Full Coverage on Google News",
    "published date": "Sun, 01 Feb 2026 17:31:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOcXpyTEFKUzVaa1V1TlRXRU9DU3VoQi1yZUhkTWJpY1h5VDJkcUY2eUxySnNvZHVIcThDZlIwRTFINkZLaUVaXzFrRWRFaFlIeWJIUzZRM194eFpDbmJKUFplSmJJQlE0M3dTT3Nld3E3dU0zSGpIVmlLNjZhbEt6eXpqdmJPWGtfRHFneWFOR1N4UE9tcWlpRDZPd2tMT2xxd0dJRE9Dc2E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Israel to ban MSF from working in Gaza over refusal to provide staff list - BBC",
    "description": "Israel to ban MSF from working in Gaza over refusal to provide staff list  BBCIsrael says it will ban MSF from operating in Gaza  Al JazeeraDoctors Without Borders To Exit Gaza After Refusing To Provide Employee Lists  i24NEWSDoctors Without Borders says Israeli ban ‘pretext’ to block aid to Gaza  The Times of IsraelMSF statement on sharing staff information and humanitarian operations in Palestine  MSF - Médecins Sans Frontières",
    "published date": "Sun, 01 Feb 2026 13:20:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBYOGlXdE1yaVVMbDJYbm9mU091NDd5QVRwN1NWcFh2MUNud1hhYUJUa241ZnRvMGxuUENycXFFSzk1dWZ4NjhwcFpOUXJoWFJ2Q1JZTXhEeDBqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Starmer hopes his China trip will begin the thaw after recent ice age - The Guardian",
    "description": "Starmer hopes his China trip will begin the thaw after recent ice age  The GuardianIn a Bid to Kick-Start Growth, Britain Turns to China  The New York TimesStarmer says UK ‘can’t stick its head in the sand’ over China after Trump issues warning  AP NewsVisit by Britain's Starmer shows drawbacks of 'China pivot' in countering Trump  ReutersStarmer’s China trip thaws relations with Beijing but spurs criticism at home  Financial Times",
    "published date": "Sat, 31 Jan 2026 06:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQeXJVSEdJTGFDQjZjLUhIRjlHazVnVllZcW1UUll1QVZaNldDWndCMkRtS0RtSUdOWEdOeUxybXVEUm5zaU1OLWVXZ3gxeE9rZXJ5SGJMSkFkdVlpMElNVFpuYVN5dGxQRjRzUDduYzNCYzhfOC1aY0d4bWw5NzNOdEVqMEMwb2RaczhFVGowYUpudGlNRHZzWHFEamJUSzE0UVVqOUdPNFJFTFhweVFoQThxb1k0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "'Normal life has disappeared': Russia's energy offensive plunges Ukraine into dark and bitter cold - ABC News",
    "description": "'Normal life has disappeared': Russia's energy offensive plunges Ukraine into dark and bitter cold  ABC NewsRussian Offensive Campaign Assessment, January 31, 2026  Institute for the Study of WarUkraine and Moldova hit by blackouts from grid malfunction before power restored  ReutersThis Morning, a Technical Incident Occurred on the Energy Grid; Stabilization and Restoration of Services for the Population Are Now Ongoing – Address by the President — Official website of the President of Ukraine  Офіційне інтернет-представництво Президента УкраїниPower Restored In Moldova After Ukraine Grid Failure Triggered Blackout  Radio Free Europe/Radio Liberty",
    "published date": "Sun, 01 Feb 2026 11:08:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNRVRzMnBLTnB0RDU0WVE1d3FScVpYRDdaWFdSbU5BSUVob3Q2R1lLNGk1cVdya1BsZThON0RjT1JILXFWdEVuQlpWZ0ZUMFJaWnZMQU1mNjdYNF8yXzVrQTZLekZfMG9OWi1qQnU0UnA3OXJkaGRyWWdCTXNreWppbVZ3WTZvZkVGWDBnOHg1dlVUVnQwSkFudXJRZllILUt5OUJjTUVQclZaR1hBZXF1RG9QTXNTM2RoUFVybNIBwgFBVV95cUxPc19iaWV3SVpQSUVjNmFuZ3djQnA2REFNS01SZ1BlaFJJM0FPYmM1cnRtTGdzZF9DejFmdlVKd2RtdnAyY19GU0pMWnlwblJfNXJkYWRObEhDdTVvTjhUNVhQQ0NvOHpKYlJnaF94ekl3TTR3a1FCdk1raTJ5YnplOXZ3SmZWb0lGVWtGRW5TTXpiMzdadnVqZGpra1h6WDBuZlY2QnFtU1FEb1VwdnNPMDQtMFBVLVV1Mi1zMDhaRkFZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Top energy expert puts odds of U.S. attack on Iran at 75% — 'this one is real' - Fortune",
    "description": "Top energy expert puts odds of U.S. attack on Iran at 75% — 'this one is real'  FortuneOil hovers near six-month high as investors track U.S.-Iran tensions  CNBCHedge Funds Rush Into Bullish Oil Bets Amid Iran Risk, US Freeze  Bloomberg.comOil Futures Extend Gains on U.S.-Iran Tensions  The Wall Street JournalOil needs an Iran supply shock, not tough talk, to break out of range  Reuters",
    "published date": "Sun, 01 Feb 2026 21:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxObm52ZUxUOEJjeVNSNTdWZENYQjBELTNRVVZ2cWZFc3g4dHI5Wm40Mk5DVF9BbzZoNkVuXzE4QVpXOGhaRHg0dlVRNlJMbEJUX0tHVjN1WkdBOGl6MjExd2xjZlJLcDE3Q3lwV2xHTDJ6ZW1faGthcU9HdnloMjJFWERMX2NJWnVpZEkyTldXUlluQ3hkaWtVUUx6X2Q4OFh2cmQtMG5pbThFUlZYTkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Target’s New C.E.O. Faces Hometown Crisis as He Begins Turnaround Effort - The New York Times",
    "description": "Target’s New C.E.O. Faces Hometown Crisis as He Begins Turnaround Effort  The New York TimesTarget's new CEO is thrown into crisis mode on day one  Business InsiderTarget's incoming CEO addresses 'Minneapolis violence' in memo to employees  Bring Me The NewsTarget's incoming CEO calls Minneapolis violence 'incredibly painful,' does not mention Trump or shootings by federal agents  CNBCTarget’s incoming CEO calls Minnesota violence ‘incredibly painful’  WKZO",
    "published date": "Sun, 01 Feb 2026 20:13:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1OZW9MeGJuM2pFUUtkRnJrY2tqdkx0ODlCZDFDdDV2bUQ0VUs3M25ucTg2Q2xxSG1rcGwtZjlyemQzZmttVDNYcUdNX0tvdnpRWWZWVzVFUUJRQmVESS1lQS1vUDJCMmRyc2x2N2poV3RvWEh5eWE2a0Fndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Japan markets on edge over looser fiscal policy, ex-currency diplomat Watanabe says - Reuters",
    "description": "Japan markets on edge over looser fiscal policy, ex-currency diplomat Watanabe says  ReutersJapanese Bond Selloff: We See Risk of Future Fiscal Constraint but Limited Impact on Equities  MorningstarJapan’s aging crisis shows how dementia threatens economies and household wealth. The US is not immune  Yahoo FinanceThe fate of Japan’s $6trn foreign portfolio rattles global markets  The EconomistThis 'mutually assured destruction' threat helps prevent Japan from triggering a debt crisis for now  Fortune",
    "published date": "Sun, 01 Feb 2026 04:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPNmp2M1laSzBFOS1CSnZYMUNqZ0FnZUNGcUJQX0xPUktncWgyeGw5akNLN2ZCYWFwTHAwNnJZWHhieTBBa2hUVWNTVE8tUkdnWGlfWlB4VVFNWXdIOWc3WTdlUDhpNFpEMVdlZGpJY0VmQXY0Ukx1ZnF1OVJreXRKWGI0S0R5a0JNZE1TNlRPRWJsWnNZbjBrNWxLYWRGLTg0eXNSSEcxd25zc1I0eXNIT2c5QlIySVJ3UWZOdGZsN0FNNWhGbFhxeXlWV00tWFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "‘We’re not in a bubble yet’ because only 3 out of 4 conditions are met, top economist says. Cue the OpenAI IPO - Fortune",
    "description": "‘We’re not in a bubble yet’ because only 3 out of 4 conditions are met, top economist says. Cue the OpenAI IPO  FortuneBefore Betting On Bubble Burst, Let’s Check Its Existence First (DJI)  Seeking AlphaJeremy Grantham On AI, Valuations, And The Anatomy Of A Market Bubble  The Acquirer's MultipleHow concerned should investors be about a stock market bubble?  The HeraldOpenAI IPO Approaches; Top Economist Explains Why a Bubble Isn’t Here Yet  FilmoGaz",
    "published date": "Sun, 01 Feb 2026 13:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbTZuNGtyRjZCYjVwaS1pQXQ5TkZsZTNnMVNubEJFVlBZNXlJLXMxV01GMUFGa09TSGRVRlNDYS13am5pYXBzQzQ0NXJKUkE4b0NlU1AxdHRGT3ZKRkY0V2hsUVlQWmI0Y21tZlhWQ0FtODNscGh1VE1pbUtnMF9hcGRlRWNHSk84NWZmNmw2dWw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Report: Apple ‘exploring’ clamshell foldable iPhone as potential follow-up model - 9to5Mac",
    "description": "Report: Apple ‘exploring’ clamshell foldable iPhone as potential follow-up model  9to5MaciPhone Fold rumors: Everything we know so far, including the leaked design  EngadgetUpcoming iPhone: A \"Flip\" Phone With a Square Foldable Design, Details Leaked  The Mac ObserverApple is Exploring an 'iPhone Flip'  MacRumorsThe foldable iPhone will make sure future Galaxy phones have massive batteries  PhoneArena",
    "published date": "Sun, 01 Feb 2026 17:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQaTE1NWwwUU41Zkl1RkFwRElkWS1iM3ZjNGN1Nzd2ZUhpVjFrOGpfWUdjbmtvUUwwcUliVnZWNl9DeHRLYWpob3VEMG5BeTZWNDFVRmJkVm1HdTNTNHRmVEwteWJMN1JMY2pEWWtCaW5ORW1XSlpoTHV3Zzh0UjJMWElBZC0xZDN4R0oyX3VKaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Top 8 Players and Decks of Pro Tour Lorwyn Eclipsed - MAGIC PLAY",
    "description": "Top 8 Players and Decks of Pro Tour Lorwyn Eclipsed  MAGIC PLAYThen and Now, Part 1  Magic: The GatheringMTG Lorwyn Eclipsed’s Blight Curse Commander Deck review: a deadly brew  ScreenHub AustraliaPro Tour Lorwyn Eclipsed Standard Metagame Breakdown  MAGIC PLAYThe 5 Best Blue Cards in Magic: The Gathering Lorwyn Eclipsed  Beckett",
    "published date": "Sun, 01 Feb 2026 05:59:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBsalY2Z1k0bmhvR1lxbkFKNVZFdEpQaGtwdUxFY1Jja0hlR010VkJydWdaZVZxYmZCV2FSaGJ4RkNZN294TTJEdFNhNC16SHN1dDZaSVFtd1JPOUNidk5mdEswQTJJNGU3THVGTWotVmEzbzM1c2FYT0JrQTJzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://magic.gg",
      "title": "MAGIC PLAY"
    }
  },
  {
    "title": "Cloud storage payment scam floods inboxes with fake renewals - BleepingComputer",
    "description": "Cloud storage payment scam floods inboxes with fake renewals  BleepingComputer",
    "published date": "Sat, 31 Jan 2026 16:21:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNRGh5OEEzUWtQRnBXbE92Ry1NX2hFclRuN0Q5M1JncDJGaUNlRjI5d3RZekRtR2YwV2d5bHlLNGdER3NqcU1vbGRNM0xtQ2g5NjBKWGl0cGx0dVBhZjVUdkdGR3kzaHQtREV3UFVFNlFmTWxRQW5fTDFUYnY0bFphdjNyUllJa0RLRW9qQVNyUVZBbDVVVEFBM1M0VmJCbFl0TDRtWHRLREFybnJT0gGyAUFVX3lxTE1aS3ExNmJYQjQ3ZFRWWmQ1czFQZmw2a3B3RUF4cEJjcEMxb3YxZjk4VWhGTmJmSlFDUTh0VGtkVEpnREpfaXNCbGZqQmJlNTVhYUdMd1E1MnU0c3FJMmpGNjlTN2RhcHhIXzdMUTVhclNoMXBoQ0NGQVMza2l6cWU4MkpFR2lWc0JlbnBOSXljV2R1WEpjc0hTMW83WjQzWENmTFpsalRUMEJaODI0ZVJPVFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bleepingcomputer.com",
      "title": "BleepingComputer"
    }
  },
  {
    "title": "12 Cool New Gadgets to Keep on Your Radar - Gear Patrol",
    "description": "12 Cool New Gadgets to Keep on Your Radar  Gear Patrol",
    "published date": "Sun, 01 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4xUmUxYU0tM25tQUZHbnl0N2oyckh3cVZURUpvM1J4RUg4Tngwa0g0U1RJeS0wYmFYZkhJWjlpX3dsVlJpdVBwWjFhczI5b2p0RmV5M1Z0MndqM01mdkZHTVZKUFQxdS1hZHdYR3JHMzJjX2gw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gearpatrol.com",
      "title": "Gear Patrol"
    }
  },
  {
    "title": "Trump plans to close Kennedy Center for about two years, starting in July - The Washington Post",
    "description": "Trump plans to close Kennedy Center for about two years, starting in July  The Washington PostTrump says \"broken\" Kennedy Center will shut for 2-year renovations  AxiosTrump says Kennedy Center will close in July for two-year renovation  CNNKennedy Center to cease entertainment operations for two years, Trump says  ReutersTrump says Kennedy Center will close for two years for renovations  NBC News",
    "published date": "Mon, 02 Feb 2026 01:28:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTXh3OEVfYTdUdEN2QWpqWlZoNTlZYWdId0NsdFRNNkdRaUJQNlRoNXYxRDY3SlZyQzhtd2RDV3pvblVfZ1k3OFNDRWRFbnYwUWZGLTZQUk56cFJfcnJOQXdzcGlRWUlLMlZLbV8wWUtCVTdLYXFzUUVneWxZRXZYT0dzMHBKWHhERG95dlRHMkNJbjJF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Armani, Annie Hall, and a Lot of Vintage: An Exclusive First Look at The Devil Wears Prada 2 - Vogue",
    "description": "Armani, Annie Hall, and a Lot of Vintage: An Exclusive First Look at The Devil Wears Prada 2  VogueNew ‘Devil Wears Prada 2’ Trailer Sees Anne Hathaway, Emily Blunt Catch Up 20 Years Later  The Hollywood ReporterEmily Blunt Shades Anne Hathaway's Eyebrows in New Devil Wears Prada 2 Trailer with Meryl Streep  People.com‘The Devil Wears Prada 2’ Trailer Sees Andy Step In As Runway’s Newest Features Editor — Much To Emily’s Chagrin  Deadline‘The Devil Wears Prada 2’ Trailer: Anne Hathaway, Meryl Streep and Emily Blunt Return in High-Fashion Sequel  Yahoo",
    "published date": "Sun, 01 Feb 2026 16:59:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE82RTlEaEpLdmxZUXRGSHJzVm5PbE9xY1hwM0FDelVTbUFYNV84OGNZT1hLXzdvYVhpMXozZm9IWnJBdnUxdFluQzh5YnBvdnB2WXVRd0xyRW9GQjV6QkRISFdCQVZiVXhoLWtJWllHY0tXdmF2MXBuRXB4NE15QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vogue.com",
      "title": "Vogue"
    }
  },
  {
    "title": "WWE turns back to Roman Reigns when it needs him most at Royal Rumble that left plenty of intrigue - New York Post",
    "description": "WWE turns back to Roman Reigns when it needs him most at Royal Rumble that left plenty of intrigue  New York PostFull Royal Rumble results  WWERoyal Rumble results: AJ Styles retires, Roman Reigns, Liv Morgan win  Asbury Park PressWWE Royal Rumble 2026 results, grades, analysis: Roman Reigns, Liv Morgan headed to WrestleMania 42  Yahoo SportsWWE’s Royal Rumble: Where To Watch, Start Time, Card, ESPN/Netflix/Peacock/ Streaming Info  Decider",
    "published date": "Sun, 01 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQUUZEMl91SGNkaDJjTUNTcWVpM0xVZElhYzdsMHllUktobTh2QnFzZGF5SFpZUVFfVjZmZVNvOTFZNGJmR2lybXBxeTQ4TzNEQU8ycFpGbE9qbUpIa0hTTUlhLXhsdkFwV09mZ21ndGZ1dVVPaVpHYWxGUUtfRnYwQXF0S2VGVUxseDlWUzBiOVVLempSZ3NmRTNvLVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "We’ll have to wait on Liv Morgan WrestleMania decision after Royal Rumble win - Cageside Seats",
    "description": "We’ll have to wait on Liv Morgan WrestleMania decision after Royal Rumble win  Cageside SeatsRoyal Rumble takeaways: Who will Roman Reigns face at WrestleMania?  ESPNComplete Royal Rumble 2026 results  WWERoman Reigns, Liv Morgan win Royal Rumble matches, earn title shots at WrestleMania 42  Fox NewsElmwood Park's Liv Morgan wins WWE's 2026 women's Royal Rumble  Bergen Record",
    "published date": "Sun, 01 Feb 2026 02:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNNWV2bWQxNDFyRl9seGxURWtUOUdialByTUhNVVV2VF9sTlhKNE5WM2h3Z0p3WmRFSUc2cnc4OHdhc25uQkJxOGhfZHY1ekxfd3RBOHFwVXdhNzlWLVhIcUdfLVBrSU1mU291Y1o4VUlpV1ZVUi00SHczY1VqTVJYTnRSNlZUWEVQRWg2V014VDFISlpx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cagesideseats.com",
      "title": "Cageside Seats"
    }
  },
  {
    "title": "Los Angeles Lakers Announce Bad News For Bronny James Before Knicks Game - PFSN",
    "description": "Los Angeles Lakers Announce Bad News For Bronny James Before Knicks Game  PFSN3 things to know about NBC's Sunday Night Basketball doubleheader  NBALakers guard Bronny James reportedly ruled out of Sunday's game with Knicks due to left leg soreness  Yahoo SportsJosh Hart, Mike Brown reflect on their LeBron James connection before his possible Garden finale  New York PostHow to buy New York Knicks vs. Los Angeles Lakers NBA tickets  USA Today",
    "published date": "Sun, 01 Feb 2026 19:45:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxORHhmNTBSZzhJREtOMUJMaXF5NmVENnl1aXJMMW05NEEzUS1GdGQ4VkRWNk9GQmxiTEI0b3lNdWk2eG9XVWRaY0UydnBBTE5ZWVJPeW5yVWd5ZlZqa0dQQnkzMXJ4dm0wYmVxMHVYOVNSOW8zT0xlWV9MSUlnNzdmd1o5NDJRaUZBY1otOVB0TXpJdnZOZnFqbFV6Ykpwdm9qS0xkVVpQNmdrM1VoUTNjT0ZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.profootballnetwork.com",
      "title": "PFSN"
    }
  },
  {
    "title": "It’s time to get rid of the Pro Bowl Games - NBC Sports",
    "description": "It’s time to get rid of the Pro Bowl Games  NBC SportsHow to watch the 2026 NFL Pro Bowl: Schedule, rosters, watch info and more  NBC Bay AreaWhat time is the Pro Bowl? NFL schedule this week, Super Bowl date  Milwaukee Journal SentinelHow the NFL built a huge flag football field in the middle of downtown SF  SFGATEChristian McCaffrey, Jonathan Taylor headline 2026 Pro Bowl Games rosters  The New York Times",
    "published date": "Sun, 01 Feb 2026 11:24:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQMGEtTXZkNzRlS3FxVV9sUUZZWlJQRkJRV0tWODJsQVhKM1dXYU5wVkE1UnktTWstTGd2SEliSGJ6ZXA4a0VGZnM3S080aEhGbWlDQnkxQVk0N05hMm1OVWdPeXVYc041TjQ1OUotQVlEbzR2MWwwcGVrbWtaTldkOFZhUGJLdEV1SFh6QkhDNTV4cHlaT0hEUWhobWdMb3p4RW1Bc3JB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcsports.com",
      "title": "NBC Sports"
    }
  },
  {
    "title": "'Complacent and lost control' - Man City's second-half problem - BBC",
    "description": "'Complacent and lost control' - Man City's second-half problem  BBCMan City blow lead at Tottenham: Premier League title worries for City, less pressure on Frank  ESPNTottenham 2 Man City 2: How good was Solanke’s scorpion kick? What does this mean for Frank and the title race?  The New York TimesMan City and Villa slip up in title race, Man Utd win again  ReutersTottenham 2-2 Man City: Premier League – as it happened  The Guardian",
    "published date": "Sun, 01 Feb 2026 23:25:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5zeGZUOFFya3psUWcwdUp6c09pU0NEWUpnUmxFS2RpUzZndzlGX1N0ZWkzcTdmWnZBbDJySEhHMWpTamNHQ1pmMkplYTZmelRhTUthMmd2VzNSQ1BQMlBFYnNzTjBEX28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Bruins, Lightning arrive at Stadium Series dressed as colonial patriots, Buccaneers - NHL.com",
    "description": "Bruins, Lightning arrive at Stadium Series dressed as colonial patriots, Buccaneers  NHL.comBruins and Lightning excited for colder-than-expected Stadium Series in Tampa  ESPNFans enjoy pregame festivities at 2026 Stadium Series in Tampa  NHL.comThe reviews are in on the Stadium Series ice, and not all are raves  Tampa Bay TimesTampa Bay Lightning practice inside Raymond James Stadium ahead of Stadium Series  FOX 13 Tampa Bay",
    "published date": "Sun, 01 Feb 2026 22:03:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPSnVUb19DeklkcXA1ZnZ4NjV4VjRleVBIWk41TXd5elpad2NacUZreTlQNjJPclRjeGZuTU93OS1KOGtYNzJtSUhzMXo0N1FGQ0hXeGcxMi0xVTIwX0RJVW03LVg4RDBUUVc3Z1RLcF91SWtLdkE5OGRURnFIdEpnbWw1enhXMkduWFFjNTMzLUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test - Space",
    "description": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test  SpaceCountdown Begins for Artemis II Wet Dress Rehearsal  NASA (.gov)What to know about Artemis II's 'wet dress rehearsal'  NPRFlorida cold blast impacts NASA's Artemis II, SpaceX Crew-12 launch dates  Florida TodayMeet the 4 Artemis II astronauts who are getting ready for a flight to the far side of the moon  CBS News",
    "published date": "Sun, 01 Feb 2026 14:17:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPUi1lVDYwVld4anBFakVyajJ0SVZZb0tkRFNmWVJQT1J2UFFRaXFqOEZvcUZZbF84QTk4c0Y3SVFva1RBMXlPVHNOdzU3U3REd21peFlWdjBSTElhbzhMQkZsT3R4N2M5d1U2dWo3MGtZb0ItN2ZhbFZEYTdXSHdnRWY1UFNmem02SG1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Eyes to the Skies for February: Rocket launch, winter constellations, eclipse and more - WTOP",
    "description": "Eyes to the Skies for February: Rocket launch, winter constellations, eclipse and more  WTOPFebruary stargazing: A planet parade comes to town  Popular Science9 night sky events to see in February, from a ring-of-fire eclipse to a snow moon  National GeographicThis Week's Sky at a Glance, January 30 – February 8  Sky & TelescopeYour February guide to stargazing in NYC  WNYC",
    "published date": "Sun, 01 Feb 2026 12:34:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNVWRoU0V1SWZ1TnBFdlNrLW9fSjB3Rk1oc3E5d0pGeDJmeUZYOFlYUTZ1SXB5S0syTVVwOWVXTFZhMVVlamdvSF9MWnU2VzJaZDBxV1FSRUpkaHVYTEItQUVkaHpwU2czaGhwY2pQNHhtUjdJcV91VkRmM3ZtSUhmeTZsYUh2a1JnVnNJUHRXeFhfejhIVEVvVEFlcEdpdTNpRGpQRkFzWUJWTkxCdWhDSzM3aG1sN1dsblZkVlRHcjVET28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "WTOP"
    }
  },
  {
    "title": "NASA taps Claude to conjure Mars rover's travel plan - theregister.com",
    "description": "NASA taps Claude to conjure Mars rover's travel plan  theregister.comClaude on Mars  AnthropicNASA’s Perseverance Rover Completes First AI-Planned Drive on Mars  NASA Jet Propulsion Laboratory (JPL) (.gov)NASA used Claude to plot a route for its Perseverance rover on Mars  EngadgetMeet Vandi Verma: Indian-origin NASA scientist behind the first-ever AI-planned rover drive on Mars  Times of India",
    "published date": "Sat, 31 Jan 2026 13:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5RVW0xeTluMmxUTXBENnpuTDZQRVpQOWFVOUVFRFdPUDdBTDRNM1RfMWFaVDcxRVNDaVhLaEhqU1JIcDV2eTh4Rl9hTWpuX19ETlJkb0ptOFhFVEJzdEFuYWRMNm9rZ2pTRmFSMTB6Ni00NW1oaGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "We asked retired astronauts about their favorite space movies, and this is what they shared with us - CNN",
    "description": "We asked retired astronauts about their favorite space movies, and this is what they shared with us  CNN",
    "published date": "Sun, 01 Feb 2026 13:00:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdWZvdFpFWkxjTVF6THpOaDRZSWhWcS00bml5ODQ1NlhmbnpFZXQwamJhdFd5cDNESWYyME45YnAtRGJvSkotckdPOTltLURhT0l2eGtEV2xfVHJtV2JyTGNoWVVxTWRtUXdsSXQ2QnBVVmxHUGtJMEdDY3YxTmdFbE1hWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Orange County confirms second measles case in traveler who visited Disneyland, California Adventure - CBS News",
    "description": "Orange County confirms second measles case in traveler who visited Disneyland, California Adventure  CBS NewsMeasles cases grow  LAistPublic Health Department confirms first two 2026 measles cases in Los Angeles County  Los Angeles TimesOC reports new measles case involving toddler  NBC Los AngelesSecond measles case in Los Angeles County this year confirmed in international traveler  ABC7 Los Angeles",
    "published date": "Sun, 01 Feb 2026 01:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNZW5sVnpTYkFwemFPX3VrQXBlUU4yR3dvQnd5RXg3MGZOVW1hZjRKQnQxUHMxekxac3JxSjZBWkZlYWZhNk5vMV9IbTl2M29RbGZnQUF2U0ZsWUJlWDlJY2JoalBQN1VneXhBMjBfX3k2UnVuUnZ2SUZhQWJMSWx4c1V2cWlqb2VaUUpWdnpZVndFUXVkaXlVUUlXckZFeWt1VkR1RzRoVmFZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "What South Carolina’s soaring measles outbreak means for the rest of the U.S. - The Washington Post",
    "description": "What South Carolina’s soaring measles outbreak means for the rest of the U.S.  The Washington PostSouth Carolina measles outbreak is largest in US since measles was declared eliminated  CNNUS measles cases soar to 588 so far this year as South Carolina confirms 58 new infections  CIDRAPHHS Wasn’t Worried About South Carolina’s Measles Outbreak. It’s Now Enormous.  Mother JonesIn this US county, measles starts to feel like next pandemic  BBC",
    "published date": "Sat, 31 Jan 2026 18:00:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFAwN05nbzNTb3M1Q1k3ZGZRWnFyd3RPU3F1eHhXOGc1OWVvOTYzb1JWaEplX3Z5N0ltTEV2Wk1PSm90RGNzbGVaR0RRTEE5bTFidVFPZ3ViU0NsVXNuLV9xLVc2amlOZUxvcnBxeU5BTkM4Z3VaakNSeVh3WmQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Are protein bars good for you? We asked nutritionists - The Guardian",
    "description": "Are protein bars good for you? We asked nutritionists  The Guardian",
    "published date": "Sun, 01 Feb 2026 17:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQbUczRnVLdkxwb1hObHpSZTVQYVJQX2xBdEc5cVFYUHpuVTRwNVVreWlqQmIyRWMzbThRcVVUN21FeVd4ZTBrdXcyejhfMVoyOExYTFBZZ2ZfbzBGelBzM25aQk1IenV6YnJCY1g0ZUM2TWtSemJ1WGt1WFlHbkpzYXJ5cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Source: Measles outbreak reported at ICE’s Dilley family detention facility - San Antonio Current",
    "description": "Source: Measles outbreak reported at ICE’s Dilley family detention facility  San Antonio CurrentICE halts \"all movement\" at Texas detention facility due to measles infections  CBS NewsCase of measles confirmed in Arizona ICE facility  CNNMeasles outbreak at Texas immigration detention facility confirmed by DHS officials  WOAIMeasles cases confirmed among immigration detainees in Arizona  USA Today",
    "published date": "Sun, 01 Feb 2026 22:41:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOOE12aXdtSlhzQUw4eTQtSHpTOHB3YkxnUFR5RUdlNmFoMHprN21zNFAyb09WenlZaUlZY1psSFlTRmUwZ3lHVmwxU2lBMFk5MWpsUDNhUUNrSmVvX05GZ0ltQmplYWxYc18zM19KdkFFYVltbUVHVWRFQXVVTkpTdzhPMFVXcHFOaGlzbVlzWWRlMGNPYzhzSFVDbEs2bXFSWnFDUXhsZTBIMS1xSG5OSTV6dDVnS2t4cDktTHBwbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sacurrent.com",
      "title": "San Antonio Current"
    }
  }
]