[
  {
    "title": "Trump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops - The New York Times",
    "description": "Trump Says Iran Is Stopping Its Killings of Protesters as U.S. Moves Troops  The New York TimesTrump says Iran has called off execution of protesters amid fears for the fate of Erfan Soltani  CNNTrump said to want an attack on Iran ‘to be definitive’ and not trigger sustained war  The Times of IsraelIran protests: Trump says he's been told the 'killing' has stopped, executions won't occur  ABC NewsTrump says Iran has stopped killings as U.S. weighs military options  The Washington Post",
    "published date": "Thu, 15 Jan 2026 02:05:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1xQ0o2cW01NEpORDBiVTdudFdWRXYtWFl0M3BnVFFZQjFsdnpNZEpWaktyc012UFNrVTBVYXpDZEVDRFZhODc3ckUtV1Q3cVh0Q0NrYnFUQ2FDLVNEMklqNkw5dE1fSloyemtJek42dHp5LWd3bUNOZHlB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Reports: Shooting involving federal law enforcement in north Minneapolis - kare11.com",
    "description": "Reports: Shooting involving federal law enforcement in north Minneapolis  kare11.comPerson shot by federal law enforcement officer in Minneapolis after resisting arrest and ‘violent assault,’ DHS says  CNNMinneapolis ICE shooting live updates: Report of shooting involving federal agents  ABC NewsFederal Agent Shoots Immigrant in Minneapolis, Homeland Security Says  The New York TimesICE agent shoots Venezuelan national in Minneapolis after shovel attack during ambush: DHS  Fox News",
    "published date": "Thu, 15 Jan 2026 01:59:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxPQS02djh4WTBCVjFUWEFNd0NQbEJkaWxtd1M5R3dxWGxCbXZhZkRrUGxCNzBLT3Z6ZXVCYWhLU0Y5STdjM0pXV3FpcGpYeHdsT2JuaHRYdkVkY0VwZDJuOV9HUFpueVhJRmt4YVhLb0JNZFpWUVZKWThJdE9RVHhLOWRnc0s0TGNLMk9HWnN2V3pPdUcwaGc3NWQxUTFwd0kwTVB4Nnh5SE9ZUy1tYW1FNU5ZX3psUTZkSEhMVXNYcHV3SXlkblEyOTE1azRBcmFBMzJ2MnVTZ2s4TDMxbEJRNUVCMHJiSklXT1BodzVHMThIQTZqTFlWaTQ4bmpvOE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kare11.com",
      "title": "kare11.com"
    }
  },
  {
    "title": "Federal Judges Uphold California’s New Congressional Maps - The New York Times",
    "description": "Federal Judges Uphold California’s New Congressional Maps  The New York TimesIn a win for Democrats, court allows California's redistricting plan to proceed  NPRDivided panel cites Supreme Court backing of Texas’ map to uphold California’s  MS NOWProp 50: appeals court rejects Republican bid to block California maps  The GuardianFederal judges allow California to use new Democrat-friendly map ahead of 2026 election  CNN",
    "published date": "Thu, 15 Jan 2026 00:56:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNRWZfY01iUXFURWJ6MlRjazBvVjd4d3lmbFJoQURPQnEwTWdUczVaZEJlUkF0UkgwS3FFNmhUMzkxcWxscTM2SENTOHZXNXpCUHdwU2p1Y09KZFdEWUlzWkE2c0NzT1UxTjZTSVl2RjMzQmFHVEV6bk5jZUNNa3luQjdNdjdtSjRaeXBmYTV4N1E1bzB3aUJXQkNOOFNpSE00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe - The New York Times",
    "description": "U.S. Races to Sell Venezuelan Oil, Transforming Ties With Former Foe  The New York TimesTrump moves to block courts from seizing Venezuelan oil revenue in US accounts  ReutersWhat US oil CEOs know about Venezuela that Trump doesn’t  The HillThe oil CEO who stood up to Trump is a follower of the disciplined ‘Exxon way’ and has a history of blunt statements  FortuneExclusive / US gets first $500 million Venezuelan oil deal, holding some proceeds in Qatar  Semafor",
    "published date": "Wed, 14 Jan 2026 22:02:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOSFJTZnZNWXdONjc5azcyaWRfZVdlTDhVMlNFQ3E5dzA0czhOb2FMVkxjWHBwN25ZeXF6ZTZvUGN3MVEzZERnX05Sa3dYRFpzUVEybUdjbzlIMjFxLWxhRmEycU1VamVHYnhwSGMyeEsyWk96bzdTaDBrUjcyeldtUXp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Judge skeptical on ICE agents wearing masks in case that could have national implications - Los Angeles Times",
    "description": "Judge skeptical on ICE agents wearing masks in case that could have national implications  Los Angeles TimesDepartment of Justice asks judge to pause California's mask ban on federal officers  ABC7 Los AngelesLA County’s mask ordinance is now in effect, but who’s enforcing it against ICE?  LA Public PressAfter 20 Years, Raymond Avenue Power Line Project Moves Forward With Final Public Meeting After two decades of planning, budget allocations, and delays, a $36 million project to bury two miles of overhead power lines along Raymond Avenue is set to beg  FacebookKPCC-FM | Justin Levitt Provides Legal Commentary on ICE Activity in California  Loyola Marymount University",
    "published date": "Thu, 15 Jan 2026 01:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOd1RIRmNQcHYzank4S1pyVnpScnZlM0x0NHFwM3NOWlV4NWxTanhtbWtCLTNoSEl0S0dDNXl5VWhTYmlBRUV1UGMwQ240WTVhX3d0aE1KUHFOQ01BM0J1ZkhHYzJaaXdxaG44dGRReGpKNHVaaDhhdmR4bjVVY21YRXBPY3BJWlNuUDhwR0RvNmYxaXZraTlnSEJrWDBDWUZyV1J6aUthNTd6U0t5M1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.latimes.com",
      "title": "Los Angeles Times"
    }
  },
  {
    "title": "How do some Trump voters feel about US strikes in Venezuela, or possible action in Iran, Greenland? - ABC News",
    "description": "How do some Trump voters feel about US strikes in Venezuela, or possible action in Iran, Greenland?  ABC NewsNew poll reveals majority of voters oppose US strike on Iran, say Trump has gone too far abroad  PoliticoRepublicans, Democrats say no to US military strike against Iran as Trump mulls action: poll  Fox News7 in 10 say US should not take military action over deadly Iran protest crackdown: Survey  The Hill70% of voters oppose U.S. military involvement in Iran, Quinnipiac Poll shows  CT Insider",
    "published date": "Wed, 14 Jan 2026 23:28:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNTWxLYmtybWpUYlNCRmFJektqV3I0R196UzI0WWVuNlo0X0RhV1MyZGpVUlNfaGhnU2R6TTd4VnNLX1ZwNU5pV0lyUjdESDNnMlhXYnhBTk1HV3FCQkI4bGwxV2xNcUVxZTFsalZJelVZS0I5NU1mRmFBZlg4T0N0SVpncVJJS3hMTVZobzQwUXhvMU5qX3R5bElkM0hBTWNrNlc00gGoAUFVX3lxTE9vT2E4NHhycjJVQkNsbGZ4ek5IZFkwNkI4YVczRWZUNjJGaEJMTkJhM05uM1ppYzR1YTNLZ1d6TlhESVM3VmpIeXo3SFRNUF83Z0Z1WmxmTU9DT1dsNjZYNEJNY3VaMURHMEd3UTVraTVlTDE0X19OWFBiZFdfNDFxMmdBcnJwbERJYmxfeHg4NDM0YWRiZFczWjhUa0ZLczZiNVNLQURhXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting - The New York Times",
    "description": "Lawyers for Renee Good’s Family Plan to Investigate Minnesota ICE Shooting  The New York TimesMinnesota and Illinois invoke the 10th Amendment in lawsuits to block federal agents in their cities. Here’s why that matters  CNNWalz calls on Minnesotans to record ICE, protest peacefully  MPR NewsGov. Walz to speak about federal law enforcement presence in the state  5 EYEWITNESS NEWSGovernor Walz addresses Minnesota amid ICE crackdown  FOX 9 Minneapolis-St. Paul",
    "published date": "Thu, 15 Jan 2026 01:22:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBMRWVnc0NHM2tQRjNldXZtUmxzQVkxakh0VFRNZEJXY1JTM0NiUUg2MExJeVVWUGVYUTlVZHJXODE4aVUzcnZ2U0J0Wmo4WkRITERQSFJUZl9GUnRjMDUtS2dwOE0tSEFBMTI4Z2ZWWmhGQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoThe House Republican Majority Is Down to Almost Nothing  The New York TimesWith a tiny majority, House GOP leaders tell members to show up unless it's 'life or death'  NBC NewsWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWNo-shows and holdouts define Johnson’s shaky majority  Roll Call",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Videos show security forces firing into crowds in at least six cities across Iran - The Washington Post",
    "description": "Videos show security forces firing into crowds in at least six cities across Iran  The Washington PostIran signals plans for fast trials and executions while promising retaliation against US, Israel  AP NewsOpinion | Iran’s Murderous Regime Is Irredeemable  The New York TimesIran signals it will hold fast trials and executions for protesters  PBSLive updates: Iran warns it’s ‘prepared’ for war as protests continue  CNN",
    "published date": "Thu, 15 Jan 2026 02:56:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPcDM5cHZYRnRZVG9qMDROT1JzS2IzellYUEZiUWFWdExudXQ2bGdscEJ6WlFUTEFTeFF5ODJqaUFZRWNnRkFVbHlab2hvSHZ0T3hucWczODBIN0wwdHlqZkVjQlM0V3RYYzVRTEV4ZlRrZ2hfU3E4MVprS2FtVXgxTThMcVk5RFh6c3dUbnZLS2FyN1dfLW1yeVJRV2UtbzJT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Mark Carney Heads to Beijing to Discuss Canada-China Relations as U.S. Outlook Darkens - The New York Times",
    "description": "Mark Carney Heads to Beijing to Discuss Canada-China Relations as U.S. Outlook Darkens  The New York TimesCanada’s Mark Carney seeks reset on pivotal trip to China  Al JazeeraChina urges Canada to break from US influence as Carney visits Beijing  AP NewsEvery country for itself: The chilling message in Mark Carney’s Taiwan snub  Toronto StarChina's 2025 Canadian import slump to remind visiting Carney of economic stakes  Reuters",
    "published date": "Wed, 14 Jan 2026 15:35:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYlA2aXVjRXhILThjZlZGNFdWbTBDY3dLc2ZGMzhTamFVWVA0VUdibUZ5RXBqeDNTZy1LUjc4VmhodFZNeHFNUi1yX3VZSWJvd1ByR0FPNVFaamRxOW1jRFBwbWtfYWdTR3ZiWjBmN25kWlZYRXJRV0xqbUlwRkYyc3JCUktFLWEtMDFJY1h1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Twenty one English councils ask for election delays - BBC",
    "description": "Twenty one English councils ask for election delays  BBCPublic don’t want ‘zombie’ council elections, minister says  The Times'People who believe in democracy don't cancel or postpone elections' | ITV News  ITVXThurrock Council Labour leaders say capacity to deliver LGR will be diminished if elections are held - Reform UK says they are 'scared' of a defeat in the poll  Thurrock Nub NewsEssex County Council will not be calling for the postponement of elections  Essex County Council",
    "published date": "Thu, 15 Jan 2026 01:32:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9MMTZfbjZ4VDViYUJYR05VZGZRNVQ3c3gwNFRzOFlSc2ZxTzhydEJQYXdDN2txcEVrcnl0ampDX2oycXdhTnVRYmFNaFlpNTVISmVjeWwzeThTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Zelensky declares state of emergency in Ukraine’s energy sector as crisis worsens - The Kyiv Independent",
    "description": "Zelensky declares state of emergency in Ukraine’s energy sector as crisis worsens  The Kyiv IndependentZelensky declares state of emergency in Ukraine's energy sector  BBCUkraine war briefing: Zelenskyy declares energy emergency as cities shiver  The GuardianUkraine's Zelenskiy to declare energy emergency to tackle aftermath of Russian attacks  ReutersRussia hits Ukrainian energy facilities as winter takes hold  Financial Times",
    "published date": "Wed, 14 Jan 2026 18:17:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOZWpYWXdGRWRQeW11bTdqUGltTXpKbkwyN2RJZmdLTklGUndOR1ZWWlFYU2xqbmplMWp0dUNWRnI2eGhLdlloN3RzTGhXNHc4a2twblM2SDBCUlcxVS02bDU4OHRJcFNrejdzcUpVaXBnLWNwVjhQaG11OXZzZmJzYXc1OVBJbkxfY20wQTV0MW01Z095Y2l5alhkWHNTS00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Why Greenland Matters for a Warming World - The New York Times",
    "description": "Why Greenland Matters for a Warming World  The New York Times‘Completely bonkers’: Trump’s Greenland mining dreams collide with reality  CNNEurope neglected Greenland’s mineral wealth. It may regret it.  politico.euGreenland’s Billionaire Investors: Bezos, Gates, Altman And More Followed Trump’s Lead  ForbesTech investors assess minerals mining as U.S. takeover talk on Greenland grows, CEO tells CNBC  CNBC",
    "published date": "Wed, 14 Jan 2026 15:16:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1XSlhvWFVVMEFza2NvdUk1ZGktWTRfM2VqdHg3NndkcHNmNE1oVFdzTWRLbnhXYTNkOXczd3BNbk5fa2pKbEdDV0pRbE5RSXBIbGJVdGdSNTJzTjB6ZlZ4N05xNkwzX1lJU1JBTFFZTnJBZWRsUnkwV1N3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "NTSB investigators pinpoint failed aircraft part from UPS crash last year - CNN",
    "description": "NTSB investigators pinpoint failed aircraft part from UPS crash last year  CNNBoeing Knew About Flaws in UPS Plane That Crashed in Louisville, N.T.S.B. Says  The New York TimesBoeing knew of defect tied to fatal UPS plane crash in Louisville, NTSB finds  WDRBIn UPS crash, NTSB probing MD-11 engine mount issue first identified by Boeing in 2011  The Air CurrentBoeing 2011 Warning May Offer Clues Into 2025 UPS Jet Crash  Bloomberg.com",
    "published date": "Wed, 14 Jan 2026 20:53:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOUDFxd0xqSjhfeDVCTnkyRWJJSXMwZjFBRThuSDRxakhDU20tbDl2RWlMMVgtQkpiald4ZGNreGw1V1hGRklkMlMzNHBpdlVheDZGUWdGWVl3YnIwd2hqaG1ZcVJUWnBuVUIxOFRwS2paUlJFdTM1Q1VWb28ydVRQNlFXcU1XYzgzZlFkM2laVmVQc1IzS2p2V0ZXLVcwVXRTWmhGejJOMEctd0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Stellantis CEO: 2026 is the ‘year of execution’ as Wall Street awaits turnaround strategy - CNBC",
    "description": "Stellantis CEO: 2026 is the ‘year of execution’ as Wall Street awaits turnaround strategy  CNBCEverything you need to know about the 2026 Detroit Auto Show  WXYZ Channel 7Detroit Auto Show returns to January with expanded experience at Huntington Place  ClickOnDetroit | WDIV Local 4Detroit Auto Show preview: Trump, Big 3 take center stage  Yahoo FinanceThe Detroit Auto Show returns this week — Here’s everything you need to know  WILX",
    "published date": "Wed, 14 Jan 2026 20:44:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5HUjVFSzBEQUI3a1FnT2RJT2RqQmIzR0lVUjFIV2JsR0NHRm9ScXBhd2ZhNUNHME9mZkRMNXRDcUlHNzZMRGR3SGk2eUFCYUYwYm1zNlNXVU5GNDRWeEFibUdBMHRoM3lKWVhhd3M2Z2t0YW03WXfSAXtBVV95cUxPZDRpY0M3S2F4Y3R0NWJSc2liZ2FEM0dEWDZ6REZNOWxIMDZuc3NfS3Qyb0IxdEh2U25sT0NwUjRmZjV0NzdnZEo0MGdZcDRIY2JrQjQzY2JXUUlQZ0xPOHdsTER6T3FTZXdtenozMTRiV2FwTGp0Q2xlQ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "3 ways to invest in what could become a $200 billion market for humanoid robots - MarketWatch",
    "description": "3 ways to invest in what could become a $200 billion market for humanoid robots  MarketWatchBarclays’ shiftless robot report  Financial TimesHumanoid robots slowly stepping onto jobsites  Canadian Occupational SafetyChina races ahead in AI robotics while SEA plays catch-up  Tech in AsiaAgiBot gains lead in world humanoid robot uptrend  China Daily - Global Edition",
    "published date": "Wed, 14 Jan 2026 20:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOWWlMZ0YtVkktQndhczNCUXVSa0M5TXF5ZGVOTi1ZTU9uOUJMLWJYVVFCcThpY1JJdzhmQWVLQnJVMlIzWVJmSVlEQW1HbzFPOF9TNlBwRUhXSE5nUXNLN0lZdkpXcUo4cmp0RXd3M0c4QlJrbXlscGdUQ1g0QmJFUVZNTU5HcF9fWUc1Tk5PVlFIV3FEcnBLcnhaYW5GYVRtMVU4bjcxeDlzLXhxM3VSZnZhdUZfek1ORDNWVGNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "Scott delays Senate Banking crypto vote - Politico",
    "description": "Scott delays Senate Banking crypto vote  PoliticoMyth vs. Fact: The CLARITY Act  Senate Committee on Banking, Housing, and Urban Affairs (.gov)US senators introduce long-awaited bill to define crypto market rules  ReutersSenate Committee Delays Crypto Market-Structure Markup  Bloomberg.comSenators pitch more than 75 amendments for crypto bill, including on yield, DeFi sections  CoinDesk",
    "published date": "Thu, 15 Jan 2026 02:29:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNT1J2ZWh5ak5OSVJia09fc2IxMVczdVYzV01vVlZpaDZHbkNNSE5mV3U5UXpzNE5SLXdtQ0s2U3JxM2p0VktWakZfVy1GTnpOOUt2dFlmaW9yOFFmZnJwOUp2U2tKaDZxa2NlQm40OWE5V0J6THpuc203MUNTQ0lsNkU5LW9Gb2FKYm5FZmxkZzB1X2d1WXAtVGpxVUprX3BQZHBwX0daZHFBZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Most Downloaded PS5 Games of 2025 Revealed, as Xbox's Forza Horizon 5 Tops Ghost of Yotei - Push Square",
    "description": "Most Downloaded PS5 Games of 2025 Revealed, as Xbox's Forza Horizon 5 Tops Ghost of Yotei  Push SquarePS5 And PS4's Most-Downloaded Games Of 2025 Revealed, Including A Call Of Duty Surprise  GameSpotNBA 2K26 and FC 26 Top the PS5 PS Store Download Charts in 2025  VGChartzArc Raiders Tops The Charts While Battlefield 6 Drops In PlayStation's Top Games Of December 2025  Yahoo! TechPS Store December 2025 Download Chart Reveals Arc Raiders, EA Sports FC 26 On Top For PS5  PlayStation Universe",
    "published date": "Wed, 14 Jan 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxONWZaUlVEWjhDR00zX1F1NkwydjBBM2tEZFMwY2pYX2lMOVhRQzA0dnVrQXJEM2QtejFXamZBTjl3WUdvcEZLMlV4MFFfV1Z0RmE5WmVXVGRFelR3TW1YMER6ckVoTURMMXBsUVI0YjZSU3g2RFJ4QjdYemt1dFg5NzlDQTFrQTdneEZNbEMzZkpnMFVvQ1o4bFYtbk5WdG1SN0ZsdGFNV2pqSmlQOVIzbHVKSWJhclJ0eUtkY1pJNDdycWI5YkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pushsquare.com",
      "title": "Push Square"
    }
  },
  {
    "title": "Musk and Hegseth vow to “make Star Trek real” but miss the show’s lessons - Ars Technica",
    "description": "Musk and Hegseth vow to “make Star Trek real” but miss the show’s lessons  Ars Technica\"The Vulcan Salute\" — Elon Musk and U.S. War Secretary Hegseth Wants to Make Star Trek Real  YahooHegseth’s vision is more Starship Troopers than Starfleet Academy  The SpectatorElon Musk Wants To Make 'Star Trek' Real Without Everything That Makes 'Star Trek' Great  Jalopnik‘Making Star Trek real’: Elon Musk reveals futuristic vision for SpaceX  The News International",
    "published date": "Wed, 14 Jan 2026 23:43:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPVmVMX1N4a1NIRUJ2VHExbU9FYV9rd3piYnNYZ3prWktFbXM3UmtUQmFKaFpaZmVkTFczTVlNR3VMNWhzcjVBeDU1QTF3d3lmc0RuVkEzVEUtTmFoUF9NSFhqTVNJUFA0VUItZ1NqOW9CRV96VnBLQVNsc0RwYnBUMkh5LU9JM1prb3RUU3J6cWxmXzZLNTF3d3FYZ1NERU9uSEswUHJqWUlia0ozcm80YlNNRC14U0R2TFdnSmYzazRhc2Q3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "I TRULY Was Not Prepared For How Hard I Cackled At These Random People Who Dropped The Funniest Replies Out Of Nowhere - BuzzFeed",
    "description": "I TRULY Was Not Prepared For How Hard I Cackled At These Random People Who Dropped The Funniest Replies Out Of Nowhere  BuzzFeed",
    "published date": "Wed, 14 Jan 2026 16:20:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9kcjUyYnFNTHRjRzF1WTVmSDdWT1RWTjlSYVU5ODJJODFQUUVBWm5aMS16ODFKaUJDNlJMczZaWVNTQUtuWi1EVlQ1b2daSm4wd043aWtkd2g1QTFxSVkyeGowR1FRX3Z0NFdLUFZ3OTF5Y283eWhkRU10TEtZN0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "PlayStation Plus Extra/Premium Games For January 2026 Revealed - GameSpot",
    "description": "PlayStation Plus Extra/Premium Games For January 2026 Revealed  GameSpotPS Plus Game Catalog additions for January include Resident Evil Village and Like a Dragon: Infinite Wealth  EngadgetPlayStation Plus January 2026 Game Line-up Leaked, Includes Resident Evil Village  IGNPlayStation Plus subscribers can play the weirdest Resident Evil and more this month  PolygonA number of January’s major PlayStation Plus Game Catalog titles have been leaked  Video Games Chronicle",
    "published date": "Wed, 14 Jan 2026 17:17:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQX05TRk9INnpzdmM0Yl8yRzdRR1NUNDZaenY0VnBmNDRoMXZvUUtTUGtxUWdUUUlvZUZZWm5uckhZQVRCRmdCU1dKd2FEV0xLQzlEQjB0X2g2X0VOV3pyd0phUHdQY3BqZTVUOHNVRWJjYThSNVFzRFBINU1NbDNZVU9Xb1l5Sm5sdDMxSUFnUDU2U0VfWjV5bzhJMjBtdnYzeXhjWThobmZrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gamespot.com",
      "title": "GameSpot"
    }
  },
  {
    "title": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office - The Hollywood Reporter",
    "description": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office  The Hollywood ReporterMichael Wood · At the Movies: ‘Marty Supreme’  London Review of BooksTimothée Chalamet’s ‘Marty Supreme’ Gets Streaming Date, Report Says  ForbesHow to Serve Like Marty Supreme  The New YorkerTimothée Chalamet is mesmerizing in the unsettling 'Marty Supreme'  The Edwardsville Intelligencer",
    "published date": "Thu, 15 Jan 2026 01:18:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNVnJ3UEVhZmtvWVpUWTkwTkhWV2NfamRFMlNPZEpzdjZqY2llYjB0b19zLUoxRWhldGFkNk40SWM0UUR3UFJURXhmOEJmbjJWUmxrOEdXUVZ6bEdPaDFub0tUeXdLMm1QdFV0a0o5ZjQ3M1liNk5GSklxRDlqdXFMYnJpWEU0YXpnc2FseURQWldsaWRfMUJudlZmN2hMVllGSW16aXR6Zjc4emZMMGFxamtoTHVIMVQtZnlVSTY5ck00Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Bruno Mars Adds 30+ New Dates to ‘The Romantic Tour’ - Variety",
    "description": "Bruno Mars Adds 30+ New Dates to ‘The Romantic Tour’  VarietyBruno Mars  SoFi StadiumBruno Mars 2026 tour tickets are flying, get yours before they’re gone  USA TodayBruno Mars tour 2026: How to get tickets for 'The Romantic Tour,' presale times, prices and more  YahooBruno Mars Fans Call-Out Egregious $2,400 Tickets on ‘The Romantic Tour’  TicketNews",
    "published date": "Thu, 15 Jan 2026 01:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxONzRTSW5MdWdVX0JvYS1DTmJyOUVEbmE2dGZpcEFmazVWQm4wWXZuUU0wenNTUGQtQW9xcEZWQ2lvcFV1MjdtSGphU2I4V1hEd2lsMXQtUnBoNThjREp2ZHpxeGhueVdqemRlNUhpRUFBb01HN29sQ0NraHZwZnhpNVdXX0piajl3Yi1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Jonathan Bailey & Ariana Grande Confirmed For ‘Sunday In The Park With George’ - Deadline",
    "description": "Jonathan Bailey & Ariana Grande Confirmed For ‘Sunday In The Park With George’  DeadlineJonathan Bailey and Ariana Grande to Star in Sunday in the Park With George in London  TheaterManiaAriana Grande will reunite with ‘Wicked’ costar Jonathan Bailey for ‘Sunday in the Park with George’  CNNWicked's Ariana Grande and Jonathan Bailey set for theatre reunion  BBCAriana Grande and Jonathan Bailey Reunite for Return to the Stage in Sunday in the Park with George Revival  People.com",
    "published date": "Wed, 14 Jan 2026 17:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNYzJla2xsYjV4VnN0T25NaXhjeWljZnNBYVNXQkk1dF84SUVvOWRDU0d3VVUtaVZ0QTl4anl3VmpfSG55Z0JoU0tHM1lDcEREX1hJOW81TUJqaGhxVDhFYXdjWDFIM2VYTVdKdk12c0RtMnNHd21jUVFzUFpqZmsxNjZkd3llaE5lVC15RmpiZWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Golden Globes Hit 8.7 Million Viewers Amid NFL Competition - Variety",
    "description": "Golden Globes Hit 8.7 Million Viewers Amid NFL Competition  VarietyBest and Worst Moments From the 2026 Golden Globes  The New York TimesThe Golden Globes were calm, scripted and largely apolitical amid a world on fire  CNNAudience for Golden Globe Awards telecast drops 7% from last year  Los Angeles Times2026 Golden Globes full coverage: List of winners as 'One Battle After Another' and 'Hamnet' take home top film nods; 'Adolescence' recognized for TV with 4 wins  Yahoo",
    "published date": "Wed, 14 Jan 2026 02:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQMm1WaFR4WXJRdENHQXMxUkFxZmV6Z2JPY1daREJJOEhJRXI2M1VIVlVlSjRhT0NtRTdIWVpEYzVQclZkeVp5NExXbjZua3Awc3FrbW42TENibWE2eTVFQmdoOUVtbjhZRlczZDk3TkJSeGM4ejROTEVoSWhXMmtEWVhrYUFxNWxZRjhZUG5aX2NsZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Red Sox To Sign Ranger Suárez - MLB Trade Rumors",
    "description": "Red Sox To Sign Ranger Suárez  MLB Trade RumorsSource: LHP Suarez, BoSox agree to 5-year deal  ESPNWith Suárez off the board, let's break down the remaining FA starters  MLB.comRed Sox's signing of Ranger Suárez adds a co-ace behind Garrett Crochet, marks a bold first move post-Bregman  Yahoo SportsRanger Suárez reportedly inks five-year deal with Red Sox  NBC Sports Philadelphia",
    "published date": "Wed, 14 Jan 2026 22:17:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9tODAwTnZnR0Fncklwa2JTRGp0WXlmQVJBTUpCYVBqOVlhT2ZkVDVXV09tT0YzZmRzc2NIbmQ3OE1RbzIxTXhMMmRwSU9WTXpEWjZta1pUaEk4RkY3TEZ0UmJ1ZjdYR19DSkdLV0FKVUtUc0JVMFY2SGZtekpDdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "KSR GAMEDAY: New-look Kentucky heads to Baton Rouge for LSU showdown - On3",
    "description": "KSR GAMEDAY: New-look Kentucky heads to Baton Rouge for LSU showdown  On3Kentucky 75-74 LSU (Jan 14, 2026) Game Recap  ESPNMoreno’s Game Winner Lifts Cats Past Tigers  UK AthleticsLSU basketball loses a fourth straight SEC game after Kentucky hits winner at buzzer  NOLA.comKSR Rapidly Reacts to Malachi Moreno's game-winner at LSU  On3",
    "published date": "Wed, 14 Jan 2026 14:06:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOZ0ZWMU1UVmRQQWV1TFJOaHkyQkR2R3JpbU04SGkzbURNeGpLdVE1NkNBeEpYeGl1Y1cyZ1RYNjZwTVdOVmZUM2JfLTJ4VnFrNlBNNWYtMktqZkpOeUVuWFdjdmI5MnhaSkFRV042d3UxRWVsRVZJY2tId2VlaTY1cEpYdmpad205S1NsVFloMG9SVTdnZ3BaaGJ4NHFNYUFXakp6Rk9jQlJLSFhVRnA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "Here's latest on Seahawks injuries as they prepare for playoff game - The Seattle Times",
    "description": "Here's latest on Seahawks injuries as they prepare for playoff game  The Seattle TimesShanahan Addresses Warner, Kittle and Short-Week Prep Ahead of Divisional Round in Seattle  49ers.com2025 NFL playoffs, odds, betting: San Francisco 49ers are biggest playoff underdogs in over 40 years against Seahawks  Yahoo SportsHow the 49ers’ approach will change for another short-week game vs. the Seahawks  The New York TimesSeahawks vs. 49ers: How To Watch, Listen And Follow The Divisional Game  Seattle Seahawks",
    "published date": "Thu, 15 Jan 2026 01:11:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOLUhETGNENXdzRUhXVWdnclFjZy1lSTVjS3dRZTl4bllENF9nNE1jdnZnNEwzSjdOYWdFdnVERzUxREM4QzJUbVQzRnRTOURINS1SV2lITVAtSGdQaFRfVTZfY3JOUXZYWDJ3NFJDVnZSYmVXbW9Jb0JaQk5hUDNoLUJNT196LVdwX2ZZQW5veWdhd21rM0JYOEhWeW9qV1VUcjlIRnlURndIWUt6V2N2TlJIcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Report: Harrison-Nunes UFC 324 title clash ppd. - ESPN",
    "description": "Report: Harrison-Nunes UFC 324 title clash ppd.  ESPNUFC 324 fight card: Kayla Harrison vs. Amanda Nunes postponed due to injury  CBS Sports'Biggest women's MMA fight ever' is postponed: Harrison has surgery to repair herniated discs in her neck  Eagle-TribuneFive Amanda Nunes Fights To Watch Before UFC 324  UFC.comKayla Harrison off UFC 324 due to neck injury, Amanda Nunes fight postponed  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORUQ2RGRENC02cHVVazAyNnM3Vm5LcC1LR2ZvX3RxTWs4NDBDeHZuQjlMY0FidjlOZVNKV3c5VjJSajdrTF9DbHVXSXRPTFNsM2hmWlJjdU1RX3R4ODBhWHBWaWxqUnAzUnU0WUNicUV4czVQTURpTU9TNk51QVdtNXdBUExLb0dPNEg3aE00WjYtYnNNbk9qWUlwYmh5dDd0dnR0STF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Crew-11 astronauts undock in 1st-ever medical evacuation from the International Space Station (video) - Space",
    "description": "Crew-11 astronauts undock in 1st-ever medical evacuation from the International Space Station (video)  SpaceNASA Begins Astronaut Space Station Medical Evacuation: What to Know  The New York Times4 astronauts depart ISS, leaving behind just 3 crewmates to staff the orbiting lab  CNNDenmark's & Greenland's Foreign Ministers Hold News Conference  C-SPANNASA to Provide Live Coverage of Crew-11 Return, Splashdown  NASA (.gov)",
    "published date": "Wed, 14 Jan 2026 22:57:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxPb1FIc1h2WVNjUURXMlBoQXFIS1d6ZmM4anFkdXNKQV9rOE9HNzcyYTY1aEtLU3RnaFN0SnI4Q2hpTmgzU1hOOEtSR1RIamR0bm8wdDBNNEVWTnBQV04wSUVtdklpemZ4VEUtMjlyRHI0VTlrN05kSW1uRnQwLVo2UEdiVWIyX0tMRjVZR2t0dVB0M1EtSkxxUnd0dXgxQld0REtGOUdtU1YtUzFyeHdfLXBKTXQtR3ZHY2xIOXI5U3U3M1BuRkdUQjVqUm5JMTU1ZnBEbUNvXzg5bEh2dU84ZkQzUjJRb1VpMlZKb0VNTmI2dFN5a2JBUnJyYkRrWFRKRk1J?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "In the stomach of a mummified wolf pup, scientists find DNA from a woolly rhinoceros - NBC News",
    "description": "In the stomach of a mummified wolf pup, scientists find DNA from a woolly rhinoceros  NBC NewsWhat a Wolf Pup’s Stomach Revealed About the Woolly Rhino’s Extinction  The New York TimesResearchers recover a woolly rhino genome from inside a frozen wolf's stomach  National GeographicWolf’s dinner preserved in Siberia for 14,400 years sheds light on woolly rhino  The GuardianScientists Find Extinct Rhino DNA in Wolf Pup Mummy’s Stomach  Scientific American",
    "published date": "Wed, 14 Jan 2026 20:36:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQOXFkeHA0ODU4cG9YendQYmJDNEtCU1NvZVI5bkczRDhodnMtbUtzOTVEZjZZaVVHanM1Z0RjbFR0NUZkV0p6MmdVNFZGM20xbDBNRU5GX2dZb051bHd5R1NCMmd4ZTVDemFvYkJ0UUxvbFJsYW1LSmNkSVlYTF94eWJlN2JiUzN5MFEtcEpzY3lUa0dwY1FPOVptelhibGo2Vmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Coverage, Briefing Set for NASA’s Artemis II Moon Rocket Roll to Pad - NASA (.gov)",
    "description": "Coverage, Briefing Set for NASA’s Artemis II Moon Rocket Roll to Pad  NASA (.gov)When does the Nasa Moon mission launch and who are the Artemis II crew?  BBC5 Ways NASA’s Artemis 2 Mission Will Make Spaceflight History  GizmodoNASA's towering SLS moon rocket could be rolled out soon in Florida  Florida TodayNASA returns humans to deep space after over 50 years with February Artemis II Moon mission  Fox News",
    "published date": "Wed, 14 Jan 2026 22:27:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQb3JxUWR0UTUyaTVyNVZ5QXZHV1FoT3RnZ2RwWjREM2dETzVMV1ZXLVN1Wm5WRnNJcmVNQUVwM3llQlpZT2x1YVZRRVhBUXdYQzFjWWtGQ19MbWgtQ29XeFlPOS1IclhrQlptVDFDbzhBcVJxUGNGb1JFaFpsSm9VODdqMDZoOUkwbGZFd2Q0c2xEeFNLZGdpUENXR2Ewbnk0bEg4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "description": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch  Spaceflight NowSpaceX launches Starlink 6-98 mission from Cape Canaveral, Florida  Florida TodayStarlink satellites lift off on SpaceX Falcon 9 from Cape Canaveral (video)  SpaceStarship launch infrastructure progress at Starbase/Cape ahead of 2026 Launches  NASASpaceFlight.com -SpaceX  SpaceX",
    "published date": "Wed, 14 Jan 2026 20:27:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNalQ2VWJ5VEV3MzQxLUJOUUdBb2F3WTZLWTJzNUFLb0VMTmhCUkRKNHYyRmt4VTF6N2ZrT3ZJYTFsVVNXYWVtalR6c2RtdmZrc1JSdGZ2c1RFYTB1dTFyeUhsdS1KMlNtaF9YUEV6SXJzYVZRN3oyeG5XanBVWkVtTGRpeFNEeU5HbDBuMnAxOW9lYml2ZVk5S2hjRFltdl9EeW1HdnJMMnlRTHRBdXJWdjc3NVhoTENVcm0yMHQ1dUduU2tEZU9wR0FzeG16UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined - Ars Technica",
    "description": "SC measles outbreak has gone berserk: 124 cases since Friday, 409 quarantined  Ars TechnicaNearly 1,000 visited SC State Museum on day of possible exposure  FOX CarolinaSouth Carolina reports 124 new measles cases as outbreak grows  ABC NewsSouth Carolina schools face measles risk as vaccination rates drop to 20%, state epidemiologist warns  ReutersPossible measles exposure reported in Columbia amid SC outbreak  WIS News 10",
    "published date": "Wed, 14 Jan 2026 23:08:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdGpYdEFIa3FjazU5ZDZuRkNIYU1RbjZYWU54MmdQUjlkVnBCNkFFMHdQek9TekFORTNrZi1hSUpXUGJrV25ZaDFlWE9LWkM3SWY0OVZMb0tRUlFfVWNIX3kzb1gyNERUNkh5TGpWcmh5OU56ekhnbERiMExLazR5V0FfZk9QY0ZRaTRFc3pDTzJRSURYNEZZZnhuVDlQR1dhQU9fN2hjWVEyZVFLWjlKajVoOFFVdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "At least 171 measles cases confirmed in 9 states: CDC - ABC News",
    "description": "At least 171 measles cases confirmed in 9 states: CDC  ABC NewsHuntsville pediatrician speaks out as measles outbreak threatens US elimination status  WAAY 31 News4 Your Health: Surge in measles cases poses risk  KVOAMeasles outbreaks a concern  The Sylva HeraldBeneath the Surface: How to recognize and diagnose measles  Healio",
    "published date": "Thu, 15 Jan 2026 00:43:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNQ3gtTl9UMmdxSVpDUWY0M0NDcDNIYVp0T251bjBfM3FsN3VNLUtiUjRUdU5nWEY1dUdPY0oyNmlFYzVTWXQyWGVlZlZBTGxyM1hVR1k2MjEyMXREb25FVXhUSkpIaFVlUmFOVjlKSmc2R01QT2xIdmhIWlo5eG5GamtZejJkN0NfLUtSdENqZjFJT3fSAZgBQVVfeXFMTjJkd0pUVFFYbE1VTmlxUnVTOHpXU05rLXZSRFJtLXpSN1kwN0ZFc0xWSTdhMDFfcDllT2FTNmljeGoyaGM2NWpHNUZEa0x3eWVFWk5EQ3VJak4zeXNMeklqOEYwNFhZNm1HOUpBQzIyTFJ2M0hza1hNaU91dDdWREpUd0ZlM0xGRmFqdkoxcmRpbHRZcEdCX2E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Medical Groups Will Try to Block Childhood Vaccine Recommendations - The New York Times",
    "description": "Medical Groups Will Try to Block Childhood Vaccine Recommendations  The New York TimesFlu shot recommendation for kids dropped just as the illness rages  NPRCDC Acts on Presidential Memorandum to Update Childhood Immunization Schedule  HHS.govWhy CDC’s Vaccine Rollback Comes at the Worst Possible Time  Scientific AmericanNew CDC Guidance Could Revive a Rare but Deadly Disease  MedPage Today",
    "published date": "Tue, 13 Jan 2026 16:13:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcmQ0ZHdmdVlLOTBhTW1aTWJYR2dBdDh2VGt3d3Rob2Vnd2Zac0hjVTVfc3FiQnBhMTlzWFVqQTJKR3FHa2VxQ2xPY3pINkJ2a2s1Zzh1eTRWRkxvT2YtQlc1UkxlMUpMSl8tQjVHS1lpVU9qamZsSTFzLVQtcFVHck1pRkZ4QVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "description": "Patches of low vaccination in the US are becoming bigger, riskier holes  CNNVaccine exemptions for religious or personal beliefs are rising across the U.S., data shows  NBC NewsNonmedical Childhood Vaccination Exemptions Are Climbing  MedPage TodayEarly Vaccine Delays Raise Risk of Missed MMR Dose  European Medical JournalRising Vaccine Refusals in US Children Increase Measles Risk  Букви",
    "published date": "Wed, 14 Jan 2026 17:33:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZVplRzZNMjRhQi12ZndfLWx3V001YlFnSWJjZWg5b1k2R1RRd0hJY2U3UHFTNk1iWmhLT19VS2RrNENkdC1MNzlyZHJiQVVYMUxnSmJ4M3BvUHdSUGd0WXlkRkRPQ3FEN3hvNkVYV1BrcGFidFhxRzRNd2w5dWJXMll6Tm1Tb1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  }
]