[
  {
    "title": "Where snow could be measured in inches — or feet — in the East this weekend - The Washington Post",
    "description": "Where snow could be measured in inches — or feet — in the East this weekend  The Washington PostNew forecast shows 5-12 inches of snow expected for NYC area as part of weekend nor-easter  NBC New YorkIt’s T-48 hours until a potentially blockbuster Northeast snow storm, and forecast models couldn’t be farther apart  CNNNYC, NJ forecasts now warn up to 10 inches of snow expected for Sunday storm  GothamistSnow foolin': Weekend nor'easter to menace East Coast  USA Today",
    "published date": "Sat, 21 Feb 2026 05:57:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQMjBGaEtaYi1QeU9HX1l3WVRYYlg5dkhzczk1bWtUMDVKNVRyU0FxRDRWejYwNDlBbno1YUhhZ0FNbXY0eHl0bGc2UkNGaDZWWEUybF9ZbjJLNjJScUlueVZLMTB5dVJDaGI4SzM4ZjZ2LXh0OGRKLXFWcTJ0dGxTTFpyTUNVU2E4ai0wUE9sMjdfdWFuRG1CNWE1Y0Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show - CBS News",
    "description": "Potential blizzard in Boston could drop a foot of snow or more Monday, weather forecast maps show  CBS NewsStorm maps show where rain, sleet, and snow will hit Friday  The Boston GlobeNor'easter to likely hit Massachusetts with 'blizzard-like' conditions: Which spots will be hardest hit?  Boston HeraldHigh potential for impactful nor’easter Sunday night, Monday  WHDHStorm Team 10 Weather Alert: Icy mess impacts the region Friday  WJAR",
    "published date": "Fri, 20 Feb 2026 22:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5OWS1UODVzTWFvbmJ0MjFtSGh3QUdNQWNtZkg4NXVlOEJjUUFrMGNYa2x3bWtjWXE3OThpYmFpMnZKZ1JDR0tBSTFoWFFBbkx3QjJNUW85cjRnb3FGWFdXZHdpMlg2Wk1OZ0REREN6M2hEUThiUTNDaVV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Speaker denies request for Rev. Jesse Jackson to lie in honor at Capitol, citing precedent - Associated Press News",
    "description": "Speaker denies request for Rev. Jesse Jackson to lie in honor at Capitol, citing precedent  Associated Press NewsHouse Speaker Johnson rejects request for Jesse Jackson to lie in honor at Capitol  CNNMemorial services for Rev. Jesse Jackson expanded to include South Carolina and Washington, DC  Associated Press NewsJesse Jackson, Charismatic Champion of Civil Rights, Dies at 84  The New York TimesThe Day Jesse Jackson Made Me Cry  The Atlantic",
    "published date": "Fri, 20 Feb 2026 23:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxON1pfN25SSFg5UWNqX3MwTTlnR3lrMmMxOUVjUEpWeGRmQlk2bXBjWFpsQ3VYWXVhXzFYbFpTMEhhbndzWEtoLVhTdUF4LTFtUXdnV0gzaDl2VlBORFFySnpCc0Z5b3JVcU5JNnIyUlZCNEdNTjdIV0ZETnVWazdtYUhBd1g1QlVnTTdNZnEyS2djTWVrMU81dlVXcUJoQlBoemhVNXFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates - 6abc Philadelphia",
    "description": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates  6abc PhiladelphiaPhiladelphia snow forecast: Winter storm watch issued, measurable snow expected Sunday  FOX 29 PhiladelphiaNor'easter to bring snow to Philly region Sunday into Monday  NBC10 PhiladelphiaStorm expected to bring snow starting Sunday for the Philadelphia region, but impact still unclear  WHYYLATEST TOTALS: Weekend storm bringing snow to the Susquehanna Valley  WGAL",
    "published date": "Sat, 21 Feb 2026 05:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQUElVNjVlMkhac1M1RlRuVmRXTy1hZUpYelJBbmkwRlN3YmxlUGRmcXB3dlR5eFFmVkZEaGZFMmZmT0FkRm5hMXFpaW8wX3B5c0xnWFpUdzYxajAxQncwbkw3WmwyRkZEbUtKVGN2MXRHRm5OdVNuWFRrTEtGdnpQU0Mxc0dfZUhTeVlLaThKb1hxOXZqekU1dXh4RENWeWFWLWZNWmZNajdLM3duNXl0Wg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://6abc.com",
      "title": "6abc Philadelphia"
    }
  },
  {
    "title": "Trump adminstration rolls back mercury rules for coal-fired power plants - The Allegheny Front",
    "description": "Trump adminstration rolls back mercury rules for coal-fired power plants  The Allegheny FrontTrump’s EPA to roll back rule limiting hazardous mercury from coal plants  The GuardianEPA rollbacks on pollution limits could drive up health care costs, advocates warn  PBSTrump administration eases limits on coal plant emissions of mercury and other toxins  NBC NewsE.P.A. Weakens Limits on Mercury From Coal Plants  The New York Times",
    "published date": "Fri, 20 Feb 2026 22:07:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPYnhoeWM5RjBNQi1aOHp4R182MlFPZHUySkZyd1NZRVkwbDhRX0JzaVcyR01EN2JnblNaNks3MjNDRkRXSTNDNmRwaTFEYVVXZlRPWDJWclpnaWRrUVEwWmJVcG5vS0pGbm9QY0RKamd5NTc2YTNRVnhkTS1vVnNqT1VmUlVDR3JhMVk4RTlDWEM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.alleghenyfront.org",
      "title": "The Allegheny Front"
    }
  },
  {
    "title": "US citizen shot and killed by federal immigration agent last year, new records show - The Guardian",
    "description": "US citizen shot and killed by federal immigration agent last year, new records show  The GuardianRuben Ray Martinez Was Killed in an Undisclosed ICE Shooting in March, His Family Says  The New York TimesTexas man was fatally shot by a federal immigration agent last year during a stop, new records show  YahooTexan shot dead by ICE agent months before killings in Minneapolis, records show  The Texas TribuneSan Antonio man shot, killed by HSI agents last March, report shows; Rep. Castro calls for accountability  KSAT",
    "published date": "Sat, 21 Feb 2026 01:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQd1MzTDlpVDlvUE5nREppWmNtS3U3ckFTcjdKRFlCTjlRUHc0UXdBV3JwSGZGZ0gxMVRxSnFLRi00QmM3U0dsbERmZGhBeXd4S3h6NXpiTUJEdDBzNEVvVWgxRGVDWmtHNW50T2RkRmVMZ24wRjk5MzdpbDVIaTZMSlZELWs3dEF5Sms3eXBfU3V0a3RTTGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect - Associated Press News",
    "description": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect  Associated Press NewsView Full Coverage on Google News",
    "published date": "Sat, 21 Feb 2026 04:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOUHNPTFpLUTc1eFlWWUh0NUl1aGtiMGVWLWlzbGcyU19mMUR1UGZlQ3NoMVh4VDlsV1RRY2V3R08ydGp1RXdNWHREMTMtVDIydEgzRlhURDFNYXJvM3c1NWwzMExYajBWVkZwRXJ6ZTQ1X3BJOWJjQ1A2bGR4QzhFM3F0ZWU2WWNvalh2eFdtaTl1bDFkTUJQQ3hWY0hoWmVGdFFSS1dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Trump says he is considering limited military strike on Iran - BBC",
    "description": "Trump says he is considering limited military strike on Iran  BBCDozens of U.S. Planes Are at Jordan Base, Satellite Images and Flight Data Show  The New York TimesA US War With Iran Is Close. But What's the Goal?  Bloomberg.comA look at the military hardware the US has positioned for potential war with Iran  CNNCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI News",
    "published date": "Fri, 20 Feb 2026 22:38:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1PeXhTN2xIRjlVbDd1WHFjNWJSU0hncjNmYzJJdFViTmlLSW13MTJfR1dMdS1KV3pXUmtRdTNOa3ZBb2RyTEVwWVVRWWhaNktaN1VuVUVXTVNDUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death? - The Guardian",
    "description": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death?  The GuardianFormer South Korean President Yoon Suk Yeol handed life sentence for leading insurrection  CNNAn Enemy’s Fall Frees Up South Korea’s Leader. Now Comes the Tough Part.  The New York TimesSouth Korea’s ex-President Yoon gets life in prison for insurrection  Al JazeeraSouth Korea's ex-President Yoon apologizes after life sentence over martial law  NBC News",
    "published date": "Sat, 21 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNYUFLMVdVVDFpU2dnQl9hUzVwQTZyb3J1MUhQNXRhcTUtQ2tyM3JSeEJiZ0psZ0ZST3djRE0tM0RfV0lYT3BWUngyYmFhQzVoRW56a2hjaVVEbGZFNFNIekdUaW15ZnhuOUJYWTRnR1BKc1hRQlByRFdrYk0zY0lmSDRPckpRaHlfVVZ5bHowcEFCR2pndEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "description": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey  USA TodayAbandoned baby monkey finds comfort in stuffed orangutan, charming zoo visitors  ReutersMeet Punch: The abandoned monkey taking the internet by storm  Euronews.comBaby macaque becomes a viral symbol of hope  YahooA Lonely Baby Monkey Wins Hearts, and Even a Few Friends  The New York Times",
    "published date": "Fri, 20 Feb 2026 20:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPWnJyNTRCYmhDTmJjNE1nLWQ4QUwtSTk2YW54dllMZzZJMmNOWHk5WEJVSWxXcFFSOVZNWlZab0NJcVgyX3huQjRRWDhkLXE4dGdLY1VPVlhBZXR5eHpFamdsRE9uMDlBb3ZnVFdhUFF6YWNsc3J6Q1V1b01FLXBmRGVPNU9kbW8xZjJjT094MXdBLS05VUdYVDVRa1N3M3lYRkxXRS1uMndiZjVlYnRldFlrbVhvZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "Palestinian-American Teenager Killed in West Bank Is Laid to Rest - The New York Times",
    "description": "Palestinian-American Teenager Killed in West Bank Is Laid to Rest  The New York TimesIsraeli settlers kill 19-year-old Palestinian American, officials and witnesses say  The GuardianFamily of Palestinian-American man killed in West Bank demand accountability  BBCNews Wrap: Palestinian-American killed by settlers in occupied West Bank, officials say  PBSIsraeli settler killed Palestinian-American teen in the West Bank, local health ministry says  Reuters",
    "published date": "Sat, 21 Feb 2026 03:48:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPQzdsUmdjN2lpT0p6YTRiVjl3bTRabWtXU29sQS1KVzg3UEk5RGg2Tk1Kb1pzZThwbDVISXNfRWszcXBqN212c284V2tnOENkTzYya3NfNk9hUTVpeERRdkNZdnNsWTBYV0Q1TkRZVlVtZ2VDOVBuOEdpNG9sWTFCTDZsVXZkdWwxUGZtbDVJaF80bHlUdzQ1UXBNNmRNaUo3SzdYWEZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US envoy Mike Huckabee says it would be ‘fine’ if Israel took all Middle East land - The Guardian",
    "description": "US envoy Mike Huckabee says it would be ‘fine’ if Israel took all Middle East land  The GuardianTucker Carlson, Mike Huckabee debate Israel’s right to land in Middle East  The Washington PostUS ambassador Huckabee says Israel has right to take over ‘all' of Middle East  Middle East EyeIt would be ‘fine’ if Israel took over entire West Asia region, says U.S. Envoy Mike Huckabee  The HinduUS envoy suggests it would be ‘fine’ if Israel expands across Middle East  Al Jazeera",
    "published date": "Fri, 20 Feb 2026 22:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbWlSaEVMNU9fQ0pSeFdsTGVBYllRTHlyNFB3OU16NmtsTV9xOVM4clJ1Z0hTLTlKUDdTaVduczRpOUlGR0F4akxDa3dpOFhqaWxSeTB1d3JCNE5EYjllV1NscThyNTBOTUFWRjQ3Q3NkWFVPZy1YaDNZWmw3SkRiNHpXZXh3UGVUdUlwODZCTW5wMmxOWm1NeWFXbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Mark Zuckerberg’s entourage threatened with contempt for wearing Meta AI glasses into a no-recording courtroom - Yahoo",
    "description": "Mark Zuckerberg’s entourage threatened with contempt for wearing Meta AI glasses into a no-recording courtroom  YahooMark Zuckerberg said he reached out to Apple CEO Tim Cook to discuss 'wellbeing of teens and kids'  CNBCOpinion | Mark Zuckerberg faces the jury — but not the facts  The Washington PostUnder oath, Meta's Zuckerberg showed why Big Tech can't police itself  Fox NewsJudge scolds Mark Zuckerberg's team for wearing Meta glasses to social media trial  CBS News",
    "published date": "Fri, 20 Feb 2026 17:27:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOWElpY2N2eGo5Q1ZyUG52c0NmYUVQUTMwR3FJenBzVkNHMXdPQjgwdG51LVo0YWdEQnVtZWF1Tzktb2FqX3JFeEpOVl9sSWd6RkN3NXhQRVkzeEdDcG9vNGRaQ1ZoUGhpczR0c1dLS25tV2tGNWZrVUFTeFlYTE5YUmthb25tSVItLVRoX0dYaG1jbU92ZEltYlFHV2E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "A.I. Isn’t Coming for Every White-Collar Job. At Least Not Yet. - The New York Times",
    "description": "A.I. Isn’t Coming for Every White-Collar Job. At Least Not Yet.  The New York TimesWhat AI Means for Software Builders—and Software Business Models  The InformationWhy AI Is Actually a Hiring Engine for Developers  HackerNoonGen AI for Software Developers, Building Real Productivity in Modern Coding  The Hans IndiaWebinar: Cutting through the AI noise: A leader’s guide to engineering-grade intelligence  Automotive Powertrain Technology International",
    "published date": "Fri, 20 Feb 2026 10:01:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5CUFpIVzhkWHFXVVJDRGhaWVlUTU0zaHBsbHIyRHpXUnZIT0hoUWhqNzR5dTVBUUZpbmpPVzY0cktGUGIyMnpVeDd0SFRMMHV1bldKdlJpZ2U2WU5NNEJqM0UyQW5ibmRveHc0ZWZ5dHNnbzRjazg1VFVUc1FIbGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Joly’s Recalls 80% Vinegar Due to Risk of Serious Injury or Death from Poisoning and Chemical Burns; Violates FHSA Labeling Requirements - CPSC.gov",
    "description": "Joly’s Recalls 80% Vinegar Due to Risk of Serious Injury or Death from Poisoning and Chemical Burns; Violates FHSA Labeling Requirements  CPSC.govVinegar sold on Amazon recalled. See product carrying poisoning risk.  USA TodayVinegar recalled over risk of poisoning and chemical burns: CPSC  FOX 8 NewsJoly’s 80% Vinegar Recalled For Hazardous Substance Violation  Food Poisoning BulletinConsumer product safety recall roundup for Feb. 19, 2026  ConsumerAffairs",
    "published date": "Thu, 19 Feb 2026 14:05:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxQdVp6c1d1YlJ4QXQxVVRORmVpck5MZEFkREtWVEhuNkI1LTk3YWNqemY4TFlzNjhCNnQ3LS1RVHYzUGtqVTJucGsyWVpTb0JoVlhFc1JXZlpuN21iQV9jYmZydkFleHhvb3pITnBlelpPYjd3bjhyeVJmUHdpQ3VjWXBoVW5zcXZnc01KRlhSTm9GMzlIbkZoUXhJRGdVaGRpUGpwSXhFaGZVT3VDbWpzYzRjdzY1cVdkNHlsZnNvVlg5M2p0TzhBMENvRzhWVlFQWkhPdl9pRTJFWDBESjdSOUNGWDVza3JCQlZDVWk0T3k5U1ZfS3EtYUcyYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cpsc.gov",
      "title": "CPSC.gov"
    }
  },
  {
    "title": "Author and philanthropist Anna Murdoch-Mann dies at 81 - New York Post",
    "description": "Author and philanthropist Anna Murdoch-Mann dies at 81  New York PostTactical, influential and mad about Rupert: Anna Murdoch-Mann remembered after her death aged 81  The GuardianAnna De Peyster Dies: Second Wife Of Rupert Murdoch And Former News Corp Board Member Was 81  DeadlineTributes flow after Murdoch death  dailytelegraph.com.auAnna Murdoch-Mann, mother of News Corp heir, dies aged 81  BBC",
    "published date": "Fri, 20 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPT09RbWVyXzVTbHhPbkhTcTZGZlZ1eU5aaVlEZ09tTHV2Uk4yR0J4My0yc0s3MGJ5SmhOQlpWSFBYYkVpN0lmMHc3bEIySnpQRXh5RFJINDZWZ0VkVWh2bnliOEtsNDlHeVNaei14NUpqbDJOYmdkdGUxZVp5aGVMVlZXOWJDeHg5WGZNUVFPYVNISzVYWkpsakJiblk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Jony Ive's First OpenAI Device Will Be Smart Speaker With Camera, 2027 Launch Planned - MacRumors",
    "description": "Jony Ive's First OpenAI Device Will Be Smart Speaker With Camera, 2027 Launch Planned  MacRumorsOpenAI Plans to Price Smart Speaker at $200 to $300, as AI Device Team Takes Shape  The InformationOpenAI may sell a smart speaker with facial recognition camera  MashableOpenAI’s Hardware Device Just Leaked, and You Will Cringe  FuturismOpenAI developing AI devices including smart speaker, The Information reports  Reuters",
    "published date": "Fri, 20 Feb 2026 20:08:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE85dXVra3hRbTlhZE82bUNMcTZRc0VDcVRhdndOdFVraGNSWm5odG1ITkpaWXhRaU5UZ1VyUl93Z1otOHliQ25LREZTd1VWWmJMaGVlcUd3aG1MbGdNOGdpQnN2N1lPSGt6TDd0dmNCTF8xWkk5Nk9hN0lrS08?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "Valve should release its new Steam Controller early while we're waiting for the Steam Machine and Frame - PC Guide",
    "description": "Valve should release its new Steam Controller early while we're waiting for the Steam Machine and Frame  PC GuideHear me out: I’d rent Valve’s Steam Machine  PCWorldDon't buy a Steam Machine even if your PC is half-a-decade old  XDAValve Steam Machine Plans : Focus on Performance, Not Price  Geeky GadgetsSteam Machine vs. PS5: Is Valve's new console a serious alternative?  PlayFront",
    "published date": "Thu, 19 Feb 2026 17:26:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQVEp6T2dKdUlWUnVmd3I2VW5WeVZqM3dacFlKQmNja3dpMV83cFY1WjFYUnlQQjA2c2pQdmdDYW5Wc2N3RXoyeGxjOEdLZEFIMkdNWU1Za3d4T1g2NDdtcnFsLXUzQjBXVWpxNnVMa3hKM2NSUlZyQzJwcmtvTU11Ty1NR2VncWZwNS1mSGVrdWVGV081VFduZnRha181OUEyQTQxaGRZbHBuQUJnVXRsdW8tTFdYejhMOFlLeGRjQzlKbHA1MHVib0tsZXA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pcguide.com",
      "title": "PC Guide"
    }
  },
  {
    "title": "Ubisoft CEO Explains Three-Year Plan to Revamp Game Publisher Through New ‘Creative House’ Strategy, More Than $200 Million in Cost Reductions (EXCLUSIVE) - Variety",
    "description": "Ubisoft CEO Explains Three-Year Plan to Revamp Game Publisher Through New ‘Creative House’ Strategy, More Than $200 Million in Cost Reductions (EXCLUSIVE)  VarietyUbisoft confirms two Far Cry and Assassin's Creed single-player and multiplayer games in development  Instant Gaming NewsUbisoft Going Through Restructure, Cancellations & Layoffs — CEO Lays Out Their Plan  Comics Gaming MagazineUbisoft confirms a lot of new Far Cry and Assassin's Creed games are in development  EurogamerUbisoft CEO Tries To Justify Mass Layoffs  GameSpot",
    "published date": "Fri, 20 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPa0ZXR2k3Q2V5SDBQLV8xQ1RPNUstc01DdWtyNUo1S21OVVFwTDNiR1BGaU1xRzZhdzhVRlhwSzVtaWxDRHNURVZxWk1MYzE1T3BwLTVyVlZrc3pnMkRoV09JS3BzQzl5UEFOTXFQdEM1VHhIMGx2dFRELXF3TUh2UkwtWlljcWRmTlBoRlhaYmE0WWpmT0MxUHVVU2hyNG9JSUZ3elRNdm5UMVBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Why There's Simply No Need For A Password Manager Anymore - bgr.com",
    "description": "Why There's Simply No Need For A Password Manager Anymore  bgr.comYour password manager isn’t enough. Use this safer 3-step setup instead  How-To GeekYour password manager has features you're probably not using  MakeUseOf",
    "published date": "Sat, 21 Feb 2026 01:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBFMGgwN1BEWmlBNndPT1FyUnd3VGNjNk05WTM2dFJPTWQybEFfdndJVTNuZjNvSXNTY19YUllmdnRhdkVSWXRXVnhOdXdRSDlkdFFqN2lHdlgtQWZ5TkZIdzlDMGRNUEdIclFMMVk2c2VaR2tZX2o3R3JhRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bgr.com",
      "title": "bgr.com"
    }
  },
  {
    "title": "WWE SmackDown Spoiler Lineup for February 20, 2026: Full Match Card and Backstage Notes Revealed - Ringside News",
    "description": "WWE SmackDown Spoiler Lineup for February 20, 2026: Full Match Card and Backstage Notes Revealed  Ringside NewsSmackDown results, Feb. 20, 2026: Randy Orton falls to Aleister Black after being blindsided by Drew McIntyre  WWEHow to watch Smackdown live. what channel is WWE Smackdown on?  Asbury Park PressWWE SmackDown Results, Winners, Live Grades, Reactions, Highlights From Feb. 20  Bleacher ReportSmackDown Preview, Feb 20: IYO SKY vs. Giulia Added  Diva Dirt",
    "published date": "Fri, 20 Feb 2026 23:44:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPZEpMUTVvSUFDWVUzZDVEQktXWU9yLVg1ZzdESV95OTlGcnRkX1VJZXRKdlZqbF9VcTRSZWs2RzRERUhFZUVZZnhrMFlhanBwb3hfWldyZmx1UkNBSm9yazVSZlJNNENiUEpsSzZqVFY4cUdGMGhvWlpDTGNRZnpPajZVa3VxWktYSjdUclcyZ0ZmN1ZKSFpRd1JWTFM2Q2NEeVRnU3NiNXg2MXdpOUl5SkgwckYwOFdzQkZLajBUQTVFZ9IBwgFBVV95cUxPZEpMUTVvSUFDWVUzZDVEQktXWU9yLVg1ZzdESV95OTlGcnRkX1VJZXRKdlZqbF9VcTRSZWs2RzRERUhFZUVZZnhrMFlhanBwb3hfWldyZmx1UkNBSm9yazVSZlJNNENiUEpsSzZqVFY4cUdGMGhvWlpDTGNRZnpPajZVa3VxWktYSjdUclcyZ0ZmN1ZKSFpRd1JWTFM2Q2NEeVRnU3NiNXg2MXdpOUl5SkgwckYwOFdzQkZLajBUQTVFZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringsidenews.com",
      "title": "Ringside News"
    }
  },
  {
    "title": "Hilary Duff Calls Relationship With Haylie the ‘Most Lonely Part’ of Her Life - Vulture",
    "description": "Hilary Duff Calls Relationship With Haylie the ‘Most Lonely Part’ of Her Life  VultureUntangling Hilary Duff and Haylie Duff's Fractured Relationship  E! NewsTearful Hilary Duff Says 'Most Lonely Part of My Existence' Is Not Having Sister Haylie in Her Life 'at the Moment'  People.comHilary Duff Is Ready for Her Pop Return  Rolling StoneHilary Duff confirms estrangement from sister Haylie  The Seattle Times",
    "published date": "Fri, 20 Feb 2026 18:37:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE03VWRnZDJsV0pzZ1hFSDB0eUNBWDkyOFFLVVpudkhrMGhxVi03ckg1Yko4eGF1MVlhWFlDelhpOGVkODI5M01tc081QkpwRVpzTWQzR2xCM0FLTGFna1VrS3RpZmdsUEhybkl5eGJocEE5a0x5NFFv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vulture.com",
      "title": "Vulture"
    }
  },
  {
    "title": "‘Scrubs’ Sets Return Of Neil Flynn & Christa Miller; Rachel Bilson Among 3 To Guest Star - Deadline",
    "description": "‘Scrubs’ Sets Return Of Neil Flynn & Christa Miller; Rachel Bilson Among 3 To Guest Star  DeadlineThe Scrubs Cast Can’t Stop Making Each Other Laugh  Rotten Tomatoes: MoviesScrubs: the cast’s chemistry is still so sparky it totally carries this zinger-packed comeback  The GuardianScrubs Season 10, Episodes 1-4 Review  IGN‘Scrubs’ Season 10 review: Zach Braff’s reboot is dead on arrival  The Seattle Times",
    "published date": "Fri, 20 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPRnVaQzBfdjVzUW8wTXotcDZvdFd1U2FoWEwwRTIwWUN0bUc3ZmVkd09Gb2hvbGs5X1JtMnU5Si1IcG9RNkVJOENUdXdMNDAxbDRXZVVOazJNdlM3ZmdjaWpaaF9hNjdmM1FQTHFfbWlLMUliMGY2R2xYZk5GYjFzU0t3cmZKanpqLWYxazJ0UUc3cEp4dnZiSGh0TmhoOC13Z2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "‘Landman’s Billy Bob Thornton Tells Great Robert Duvall Stories & Divulges The Deep Dark Secret He Never Told His Mentor - Deadline",
    "description": "‘Landman’s Billy Bob Thornton Tells Great Robert Duvall Stories & Divulges The Deep Dark Secret He Never Told His Mentor  DeadlineRobert Duvall, a Chameleon of an Actor Onscreen and Onstage, Dies at 95  The New York TimesRobert Duvall Dies at 95: Oscar-Winning Actor and US Army Veteran  Military.comA Surfer Examines Robert Duvall’s Most Famous Line Ever, In One of His Most Iconic Roles  The InertiaDavid Mamet: Robert Duvall Was the Best Actor of His Generation  thefp.com",
    "published date": "Thu, 19 Feb 2026 23:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPUlVGMjZIMVJLWjBJMEkwd1hIal9YbkF3bzYxT0VXTGxpZjhwOFJ0endUV2xsRUVKTkJJVVhWX011TlVQSEJjbU5kX1Jyb2VTTGhBQWFLVEpGeGt1ZUlDd2FVY2xyMUhnWDAwcHBFeU9FX3h1b0NzRVNzQzZkTi1Gb2c3b0F1TXNwdFRUcS1VcjItRWYwVGdQTU95TlZ4dDFw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson - NFL.com",
    "description": "Gennaro Filice 2026 NFL mock draft 1.0: Jeremiyah Love cracks top five; Chiefs take WR Jordyn Tyson  NFL.comFornelli's 2026 NFL mock draft 1.0: Two first-round QBs, surprise WR1 headline class light on elite talent  CBS SportsNFL Draft: 2026 NFL Draft Two-Round Mock  RotoWire2026 NFL Draft big board: As combine starts, a look at top 30 players list that will surely evolve from college season's midway point  Yahoo SportsMock Draft Tracker 2.0: Combine coming up  Giants.com",
    "published date": "Fri, 20 Feb 2026 15:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOYmVobGtIVEpnX04wZWtZeTRKMUk3SkM5SVQzcGd6VXc4clV6dU51dmgwa1RBVkFBZkVfWnozdEVEMl9HYnYtMVhBRUVmZTEwYnRQSmgtZmFaWHQ4MFMzd09VbXh6dGJfeFNzdlB4QWMyRzBLbUowdHRnTXU0NHBCM3RtTDBJemFEOGoxR3JkYy1WYVZJdHAxSExZRnk3SWdzTk5jYmpHa1ZBbGNqNFZxRTVrNnd1T1NiYVI2UFFNdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nfl.com",
      "title": "NFL.com"
    }
  },
  {
    "title": "Nuggets play Trail Blazers on back-to-back - NBA",
    "description": "Nuggets play Trail Blazers on back-to-back  NBANuggets 157-103 Trail Blazers (Feb 20, 2026) Game Recap  ESPNBlazers and Nuggets Play Record-Breaking Game in Portland  Blazer's EdgeDenver Nuggets set records, torch Trail Blazers in their return from All-Star break  OregonLive.comPreview: Denver Nuggets try to dust off tough loss and get back at it against the Portland Trail Blazers  Denver Stiffs",
    "published date": "Fri, 20 Feb 2026 21:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOUm1sR3FhSkpqTWVPZFo1WDNnVzg3Y2dqZVJROVhUeW9Uc3NSUThlRDZoYVBjQmhhOEtOa085STFRNXFidXdwUnFjeTJ6eG8xQi1USXg2R2xVR0k5TEhLa2h0YTVCc056NkpfblRZSm9hTjBHaGloeUdnLVE4cElLOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nba.com",
      "title": "NBA"
    }
  },
  {
    "title": "LaMelo Ball’s car accident video deserved an answer, but Hornets star wouldn’t give one - SB Nation",
    "description": "LaMelo Ball’s car accident video deserved an answer, but Hornets star wouldn’t give one  SB NationHornets' LaMelo Ball feels 'blessed' he wasn't hurt in car crash  ESPNNBA star LaMelo Ball storms out of press conference when questioned about recent car crash  Fox NewsDurant drills Hornets on night that LaMelo Ball answers questions about his wreck  Charlotte ObserverHornets' LaMelo Ball available to play one day after car accident that totaled his vehicle in Charlotte  CBS Sports",
    "published date": "Fri, 20 Feb 2026 15:54:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPM3V6NmIya1RKUmF3djVPU0hraEtsNEVyai1DQmtBOE1tRlBSQk1QblRIVmRlYlp3YWxDZnQxV3N1MllNRjFZNVBYU3VobWpJZlozMGctSDlSY25saHUyZmVqWHM2ZkJPOHpjbFhpNGV3aHd0V1ZqUTZ4ZVNUVWdLOFhrT3JPSHdJVml0WkNuRzRTNWhiTEFv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sbnation.com",
      "title": "SB Nation"
    }
  },
  {
    "title": "Germany's Nolte, Buckwitz lead USA's Humphries at two-woman bobsled midpoint - NBC Olympics",
    "description": "Germany's Nolte, Buckwitz lead USA's Humphries at two-woman bobsled midpoint  NBC OlympicsWinter Olympics 2026: Laura Nolte and Deborah Levi soar to top of two-woman bobsleigh standings after first two heats  Milano Cortina 2026American team that includes Hempfield grad Jasmine Jones sitting in third at midpoint of bobsled race  Pittsburgh Post-GazetteNotre Dame alum Jadin O’Brien in 12th after two heats of women’s bobsled  WNDUBobsled: First heat is complete  The New York Times",
    "published date": "Fri, 20 Feb 2026 20:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNeVJBQnUycnFOVGFZMW5MSm5pSmszZ0FoTm1VMDVSRXdPYVFmclk5UkdsNnl5SFgwdU9JcU81UmItaHhkU0xZUWhFYUw4T0VWUEpNN3NaRWdFLWtKRkhJR29WNmY1SC1oWWV4Nnpuc3h0cDFTWmZFOFo4NXlwSlBVVTM5bEJfS3g5OFVKZzJSVVh1SUpPMDV3ZVo4NTl4WjVOOGxHR3F3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcolympics.com",
      "title": "NBC Olympics"
    }
  },
  {
    "title": "A Galaxy Composed Almost Entirely of Dark Matter Has Been Confirmed - WIRED",
    "description": "A Galaxy Composed Almost Entirely of Dark Matter Has Been Confirmed  WIREDHubble telescope discovers rare galaxy that is 99% dark matter  SpaceAstronomers Say They've Found Their Strongest Dark Galaxy Candidate Yet  ScienceAlertNASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter  ScienceDailyDark galaxy CDG-2 near Perseus Cluster (annotated compass image)  ESA/Hubble",
    "published date": "Fri, 20 Feb 2026 23:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQSk9xaTFRUWpkajBWSWxMWGh0RmlBNk9DU1BiSUhyWmZoeGxZMm0tbXRmbkdLVFN2TWJ6X29rcnoyRnA5Vk1fak1ZUGwyQWV6Wi1EUUhLRnBGUFJSdk9lSDlpSnFUOFRDdkF3Rjl5cGJTMm5LQkxmbTBPaHhkQTEyZWhWcktkNGloTHp1UXN5NHpncHFHenpLY2M3UnI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Rocket Report: Chinese launch firm raises big money; Falcon 9 back to the Bahamas - Ars Technica",
    "description": "Rocket Report: Chinese launch firm raises big money; Falcon 9 back to the Bahamas  Ars TechnicaLive coverage: Falcon 9 to launch 25 Starlink satellites after weather delays  Spaceflight NowSpaceX planning early-morning launch from Vandenberg Space Force Base  KSBY NewsSpaceX launches Starlink 10-36 mission from Cape Canaveral in Florida  Florida TodaySpaceX lands Falcon 9 rocket in The Bahamas for 2nd time ever (video)  Space",
    "published date": "Fri, 20 Feb 2026 12:00:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNTmVhaFppMHpVSzdubWM4TS1ZaHQyb0h4NkdDTmFxa05JdWdmTFk1dmRCeFZESDZJSWRJR3hYSDZmNDZRVkhHVXJUSFktdGtJazRRbUVZQkhzTlZtUk92dkxhdVJheVBSVDV2RVFhcUpPeHV6Vy1iaDF5UDBvNzhQZW1RS2w2QkRfeEEwc3hLRzBpRkJhS1ZzRC1XNWhGZ2xraUx4Sk1CNWs3ejB3cklQbHpZNkFfZkx0TFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Science fiction blinded us to the perils of settling Mars - Big Think",
    "description": "Science fiction blinded us to the perils of settling Mars  Big ThinkOpinion | The flaw that could prevent humans from becoming deep-space explorers  The Washington PostWhat Growing Up On Mars Would Do to the Human Body  Literary HubEffects of living in space (Feb. 19, 2026)  Houston Public MediaHow living on Mars will change humans, and more…  CBC",
    "published date": "Thu, 19 Feb 2026 15:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFBtb3BUZ3BMR0JNWE9YQjJmWERKblViZ05TWE9ZUW12aURQSVZ5M0dDU1Z2TlVSTXBWVjVTYVdrNWkwOWU2ZGRHdkREX04zTEZEYnRuX29MODVSZ3Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bigthink.com",
      "title": "Big Think"
    }
  },
  {
    "title": "Euro boffins track lithium plume from Falcon 9 burn-up - theregister.com",
    "description": "Euro boffins track lithium plume from Falcon 9 burn-up  theregister.comSpaceX rocket fireball linked to plume of polluting lithium  BBCStudy: Frequent rocket re-entries might harm atmosphere  upi.comRocket re-entry pollution measured in atmosphere for first time  Phys.orgStudy Confirms: Reentering SpaceX Rockets Are Peppering the Upper Atmosphere With Metal Pollution  Gizmodo",
    "published date": "Fri, 20 Feb 2026 19:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNd2l2NUlGWHYzTzg3MG9oWHNVMnRRdVRKeWV5QmdpRGhfbnZXQWNDOWFVVDhCQWRoSVNSMktQbVdiQkgxZDdSRVY5eGdJYUxfd1gxMzdBdF9KdkxCMklUOE9KSUF2cm11OGRHN18taUxpV2dXMWROYUJ5SEhSVFR1TXE4WlU2dmlQQ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Reports of dead geese lead to park closure in Northampton Co. - WFMZ.com",
    "description": "Reports of dead geese lead to park closure in Northampton Co.  WFMZ.comAvian flu continues spread in Pennsylvania egg, turkey facilities  CIDRAPNorthampton County park closed after ‘numerous’ reports of dead geese in borough  The Morning CallBird flu concerns prompt closures, remapping routines in Northampton Borough  WFMZ.comJulie Grant | The Allegheny Front  WVIA Public Media",
    "published date": "Fri, 20 Feb 2026 04:37:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgJBVV95cUxPNjhDS0RFOURGTDI0dzJFR2JlXzBMR2JnaE5XTjVSSEQxTy1qU2xDZGVNWmp2bkYwR0RfQlFsd2Z6WUNaeW5ETkNQSExHYnhjcElPZGNreHhzSFlTcXNSa1pMdC1KRkY1em8xaExCODRqWmhzUTNadXBMeGU0YWNmXzBlcFZnNndpQWVzdF93RGN3dURFTWV6Mzh5UzhzbTBJcGEyUzRUMDFQWllNNHFUZ3NJeVk1X0VqcklsYk41REhSelJqcm9NNmY1ak5PVnJjTjM0alVEUldHakluaGxxc3loZE5MSlgtSjdqUlQwSUNJS2RiUms1akZnQW9xeVdhSUI1MDJ4b1FqVHFDS3pWam5ROEk5cVgydEZwSUFJN2xCN1NZQlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wfmz.com",
      "title": "WFMZ.com"
    }
  },
  {
    "title": "Multiple people at state wrestling tournament diagnosed with measles as it spreads in Utah - KSL.com",
    "description": "Multiple people at state wrestling tournament diagnosed with measles as it spreads in Utah  KSL.comIf you’re feeling sick, it could be measles, Salt Lake County health officials warn  The Salt Lake TribuneMeasles infection confirmed at Highland High School  KSL NewsRadioRising measles cases reported in Salt Lake airport, Utah hospitals  AxiosBox Elder School District confirms measles case  ABC4 Utah",
    "published date": "Fri, 20 Feb 2026 20:55:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQcDQzRlhMNko4LWxWVkh5MFlzOWZVS0JER0hVcElQd2IyamJJZ1p5eE1BRjZ3VkZRLWpIVllMV0VVZ1FidkxJNlA5TUxHVmtFVUpFbDJBeXFpTUpSZTFNV3lVV3lMTUowbllRaGlSR2N3N2hqb1VWVm9NcWxpU0tpdm4zQ0pzZFh5WFRoZGw5Um1LNU9vVlNySkpDaHVXRG8xVzg0elc3SlQwUkpQWDhiLXdZUVkxcmdiQXZ4TDhBQjhHNGJQWnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ksl.com",
      "title": "KSL.com"
    }
  },
  {
    "title": "People are using Ozempic to drink less. We already have FDA-approved drugs for that. - Business Insider",
    "description": "People are using Ozempic to drink less. We already have FDA-approved drugs for that.  Business InsiderThe Evidence on Ozempic to Treat Addiction  The New Yorker‘I feel reborn’: How GLP-1 drugs are transforming the lives of people struggling with addiction  The Boston GlobeGLP-1 medications targeting the brain or gut may improve treatment of addictions.  Psychology TodayWhat GLP-1s Know About Addiction  WNYC",
    "published date": "Thu, 19 Feb 2026 09:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNaEFZS3ktYUlfWVFzU3ltQmcwbGRQSi1BcTVud1NMQW9INU5FRzZTM3RpRTRYcEpwOGpjLXBUNWZMS3JuYU9NRHRFNXdkdFg1QmtrYkY4Y05TczNkUlYwaldWck02WFQ4TkhrY2VtZUsyaFplOFBXZy1tTGtOVXdWQlZfVVpiN1RDSHZwX1NQM3J3MlJubV9WTUt1bjBDNmZhaGlqcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "VDH reports two more measles cases with exposure sites in Manassas, Gainesville and Alexandria - InsideNoVa.com",
    "description": "VDH reports two more measles cases with exposure sites in Manassas, Gainesville and Alexandria  InsideNoVa.comHarris Teeter, Target among Northern Virginia measles infections sites for 2 new confirmed cases  WUSA9Officials: 9 stores, restaurants, churches around Manassas are possible measles exposure sites  Prince William Times2 more people have measles in Northern Virginia. Check these sites and dates  NBC4 Washington2 measles cases confirmed in northern Virginia; VDH lists possible exposure sites  FOX 5 DC",
    "published date": "Fri, 20 Feb 2026 00:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAJBVV95cUxPcDBRZUdoM2ZwcmVwejAwU2JBc1FIWGNBZHZSbFRGbE9DMEZ1VWNzRXVqR3hldk5VdTJsQ0tmSHJYcVpzVjhzeXptdkdnSTY1Y3lfM0luZno5OENFUnFhbXB2ZVhwMTcwdEs0b19NYkViWTUzSzMweVBhS2xoUHlqbWYtd0NhLVRwRzlpbUVZRnExdVBHZmM5Wk8yTHhXM3pCUkI4WjJDM25XbVNjTi1NV2FRSFkyWXpmWDFsanpfRjRIWGpTbVo2VHN0NTNrUk50djJRemptYlprd0Y4UnZnbUx3X0dFMF9KLXZUQ05naWJrSmJrWGtoUzFHUEdaRVE3eGxOck1vako2ckZt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.insidenova.com",
      "title": "InsideNoVa.com"
    }
  }
]