[
  {
    "title": "Anti-ICE protests to be held across US as organizers urge national strike - The Guardian",
    "description": "Anti-ICE protests to be held across US as organizers urge national strike  The Guardian‘ICE Out’ strike and protests: what to know about demonstrations across the US  The GuardianSeveral San Antonio businesses expected to close on Friday due to nationwide strike  KSATProtesters call for nationwide strike against Trump’s immigration policies  AP News'What else can we do?' Boyle Heights to participate in Jan. 30 strike  USA Today",
    "published date": "Fri, 30 Jan 2026 11:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9mVGZTRG1JRmtyRXkwckk0NTl4SXZGTGFnWnN2dmk3WFFzUWREUjFLSzI2RDItSUZaX04tdl9naDJLelNvbkF2elIxemtOdDl0SWRpcVI4ekJvOGFiTUxuUjN0N1cyaFpUQy1obHptUjY0al82NmRwWWY2NEdQOW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions - The Washington Post",
    "description": "Tulsi Gabbard’s appearance at Fulton County FBI raid raises questions  The Washington PostJustice Department defends Tulsi Gabbard’s presence at Atlanta election search  PoliticoTrump posts discredited conspiracy theories following seizure of 2020 ballots in Georgia  ABC NewsWhy is Tulsi Gabbard involved in seizing 2020 ballots? How election conspiracies could affect the midterms  CNNTulsi Gabbard’s role in the FBI’s Fulton County raid goes from bad to worse  MS NOW",
    "published date": "Fri, 30 Jan 2026 12:31:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQMEhwdDdXc0pvTmpIbVNDYlNhRXhERUFYZFpmdXlsV2duRW1UQkVwMlBzV2hPblhKLWlpTUJpeDA3V3h0WlRhM1hKOHVYY200dmhxVzRQVnF1MEFIRjlKWWFsU2ZXekJDaE4wUDFTb2NEcXI4aXpiR0VhRTBmQVFNc0NlWXZfandHelRyN29HV1o0UHJGb3BsaGFGZXZNZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Live updates: Nor'easter 'bomb cyclone' to blast Carolinas with heavy snow and coastal flooding - FOX Weather",
    "description": "Live updates: Nor'easter 'bomb cyclone' to blast Carolinas with heavy snow and coastal flooding  FOX WeatherMost snow in years, blizzard conditions possible in parts of Southeast from powerful bomb cyclone  CNNA 'bomb cyclone' and 'nor'easter' are in the forecast for parts of the East Coast this weekend. What are they, exactly?  YahooWinter Storm To Blanket Southeast With Snow; Blizzard Conditions Possible In Coastal Virginia, North Carolina  The Weather ChannelBomb cyclone forecast for Massachusetts: Cape Cod could face blizzard-like conditions  Boston Herald",
    "published date": "Fri, 30 Jan 2026 10:40:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOVU1EZ1RPNTJaWkpqZ0ZodjJMTkozdnRTc20xNmc3T3VXSUVyczhTeHAxYVdsMkFnMC1PRnZ4elowM2xGSW5ael9qakFPeDhjSm1wWDdCZ01zUzBLQm1fMXpwZUdXSEJLRmhKbUxYUVNhSzYzSUMyZ1ZyY0FEVVhMekhLSTJuR1F5c3pqcnpxZVlPNkZSaHpGSGVYdzdrb2dYS1BuUXlVYjh3NmV5RVozRWdOWGhzQ1djWVZPSGY1d1NiVWZDU2V2U9IBzgFBVV95cUxNWGlUV2dNTlpQbXZ6RnBDM0piMThvZ21HZERPVlhJSVgyUXd6VGtsVUQ1eUcza1czVGZjZGFpdFF6NVRwbjBaQ2drVFRFbXdFaHRrdXozbFhxQXppYnliY3NIZGdoWHdJdEU1MHNINDc3NS1jdWh6U1NJZjI0R3U2YjFaVnlQTXR5aHd0UWlYa29FbE5GMEVjWGl6X3c1TFc3aXJhcnRLeGttNEhTUzV5T1RYSjhhN05kbVptdlBVZV9ZQi1JOUEwMk5SN0pkUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxweather.com",
      "title": "FOX Weather"
    }
  },
  {
    "title": "Treasury Sanctions Iranian Regime Officials for Violent Repression and Corruption - U.S. Department of the Treasury (.gov)",
    "description": "Treasury Sanctions Iranian Regime Officials for Violent Repression and Corruption  U.S. Department of the Treasury (.gov)US imposes sanctions on Iran's interior minister, businessman  ReutersUS escalates sanctions on Iranian officials as Trump considers military options  Fox NewsJeffrey Sachs: Engineering Iran’s Unrest  consortiumnews.comIran-US news highlights: US imposes fresh sanctions targeting Iran over crackdown on protesters  Hindustan Times",
    "published date": "Fri, 30 Jan 2026 14:43:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1CWHg0X0pUaW5lN1d2SnBCQ2h1QXVpNWtLbjJ5MFhDbUNLT2RreGlYbFkyME5LSEViOUhtNFVscjI4ZFgyNGtSOVM0U2FWeFlSTUh0VFR3WXgta2VvYWJ1ajRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://home.treasury.gov",
      "title": "U.S. Department of the Treasury (.gov)"
    }
  },
  {
    "title": "Syrian government reaches deal with Kurdish forces - BBC",
    "description": "Syrian government reaches deal with Kurdish forces  BBCSyrian government and Kurdish forces reach deal on permanent truce  The GuardianSyrian government, Kurds agree integration deal, US hails 'historic milestone'  ReutersKurdish-led SDF agrees integration with Syrian government forces  Al JazeeraSyrian Government and Kurdish-Led Militia Seal a Deal to Merge Forces  The New York Times",
    "published date": "Fri, 30 Jan 2026 12:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFAwWW1WcVg3Skp1aUJ6OU43VFlMSVBNQzY3M003alRVNlU1OGlzYVFaQjhpZURIUm5EaHZzR2pHbWVuTENKWE5QSnY3Q3JPSVB2LTlQOWdDc1dndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Car Hits High School Student in Nebraska During an Anti-ICE Protest - The New York Times",
    "description": "Car Hits High School Student in Nebraska During an Anti-ICE Protest  The New York TimesFremont student hit in apparent hit-and-run during student-led ICE demonstration  Nebraska Public MediaPolice say they’ve identified the juvenile driver involved in Fremont student protest pedestrian crash  WOWTBystanders describe moment girl was hit by car as driver's sister says he didn't mean any harm  KETVFremont Police: Young driver found who hit protester with SUV flying Trump flag  Nebraska Examiner",
    "published date": "Fri, 30 Jan 2026 17:26:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPUWhCN20tZ2NGeFVaT2NxYXNaUkJheUxBVmxCbHJJa014Q1QyRkI4THhtZHo4TGZfQ0Y0QTc2N2hyNTN2UWFraVF1UHQ2ZGE1MTh1dEowQlM3NWxoZnlXa2Y0RVBobHBmdGtlZXFHRkVSSTlrbG4xZjJ6amt2Vi00S2pOY2hQVDRDMWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Epstein Files Live Updates: Millions of Pages of Documents Released - The New York Times",
    "description": "Epstein Files Live Updates: Millions of Pages of Documents Released  The New York TimesJustice Department is releasing millions of pages of documents in Epstein investigation  CNNThe DOJ says it's releasing 3 million new Epstein files — but withholding another 200,000 pages  Business InsiderEpstein files updates: Democrats skeptical of DoJ’s claim that all Epstein files have been released  The GuardianEpstein files live updates: Trump DOJ releases several million more pages of records  NBC News",
    "published date": "Fri, 30 Jan 2026 20:13:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9MUWJDYjBTTmhlV0dqQWpUNmZIVzNLQnRJQUNTLTA1WExYams4Uzdlcy1HM3VNWWItZ0tlX19FTE5BZEUxeE9UNGpka3dsN3JjOFRmU0NRTmkySURldTlpSGkyR2hzZFV0OUlBbUJxcERudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "CELEBRATING AMERICAN GREATNESS WITH AMERICAN MOTOR RACING - The White House (.gov)",
    "description": "CELEBRATING AMERICAN GREATNESS WITH AMERICAN MOTOR RACING  The White House (.gov)D.C. mayor is game for Trump's IndyCar city street race this summer  AxiosFreedom 250 Grand Prix of Washington, D.C. Coming in August  INDYCAR.comTrump announces August auto race in downtown Washington  PoliticoTrump orders up IndyCar race on the streets of Washington for 'America250 Grand Prix'  NBC News",
    "published date": "Fri, 30 Jan 2026 17:35:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOVkNjNFRHQW1QbUdRZnlZU2xOckNPM0ZReEU5bUNnbjJyMnFwdGdPWHpMWkE3TXEwZDhpREVUVFJxbFplNjFUUTgzSFltMHpUVVRFSEZjTzRQSTVlNVRxZVJLR1pqLWVuWkhyVmRqUTJLcktKXzNZNTBhVzFqbVZObnNpcHhzeHA4ODNxZXM0RG95QTlzRXhSeHQ2U1VmTGl5MGgweTQ5NzhaQzBYM0p6NXp4YkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Why Iran's response to a US attack could be different this time - BBC",
    "description": "Why Iran's response to a US attack could be different this time  BBCMaps: Where the U.S. Is Building Up Military Force Near Iran  The New York TimesTrump weighs imminent Iran strikes, but what’s the mission?  The Washington PostIran puts ‘fingers on trigger’ as US armada arrives in Middle East  Military TimesHegseth says Department of War 'will be prepared to deliver' whatever Trump wants following Iran warning  Fox News",
    "published date": "Fri, 30 Jan 2026 11:04:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9leXBPcXl5UlNrbndVZGI4UURKT0trajBiaFFNUXEydzRNeEpJVnd6RWZHbjhjQUhUd3pjVUY3NVlzWDJqT3J4LTVMNXBQeERrd3BPaTZONmxCQdIBX0FVX3lxTE9MZDI5RER1ZFZsTkRoTUFhZFJkMElFellJVmxJUDhtZjdUdXgtaDRtMk9IQ3R2aV9fX3N0SWduMlpSY0VUaUZ1Z1l6TVNlTUQtTEVLQ2hXaWNWS192dENz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "FBI now leading investigation into fatal shooting of Alex Pretti - CBS News",
    "description": "FBI now leading investigation into fatal shooting of Alex Pretti  CBS NewsJustice Dept. Conducting Inquiry Into ICE Killing of Alex Pretti: Minnesota Live Updates  The New York TimesUS DoJ opens federal civil rights investigation into killing of Alex Pretti  The GuardianJustice Department opens civil rights investigation into Pretti shooting  The Washington PostLive updates: DOJ opens a federal civil rights probe into Alex Pretti’s death in Minneapolis  AP News",
    "published date": "Fri, 30 Jan 2026 17:52:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5hUlhFM1hYeW5OcDJkRVpNWUdFNldXV2Q5SVVXZEJnZFdHRkhROFFCNzdtZmMzTGx4b1RBUWV2aEtscUZjWFpMUzFveWMxZVNRTXp2anhWR0hianVpdDVVTUdFZGJha1Y5ZTY3RUdzLXVSYXlhRU9R0gF8QVVfeXFMTTcwNEUzT3EtR1FFVE5PZHpIR00zSDREel9wLW5mZmVYWnBPX0ZJNUM5WjhmWDkxSGZCQ2V5eTR6ci1BWmMzVC1hNE5NQlFxbl9fY3c0VVRpRXJsbXBXVEE0SlUxaVhLSGNNWlQ1aDVtcndqclp1MEE4N0FJNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure - AP News",
    "description": "Israel reopening Gaza’s border crossing with Egypt on Sunday after long closure  AP NewsIsrael announces plan to reopen Gaza’s Rafah crossing on Sunday  Al JazeeraIsrael set to reopen Gaza’s Rafah border crossing with Egypt for first time since May 2024  Fox NewsU.N. and aid groups push for phase-two of Israel-Hamas peace plan, opening of vital Rafah crossing  CBS NewsGaza’s Rafah crossing with Egypt to reopen on Sunday, Israel says  Reuters",
    "published date": "Fri, 30 Jan 2026 17:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPQXUwMDlSQ01WSzZ0X0w3bVV6VFpqU0xVVVBiemRMSjJOYXB4bVRNRDdNQXlYWjh2NTdWTk5qMzAyZkxZeEdSd3NWal9ndXVUUFNiY0U1Qkg5a191dFdBdlZWY0w4dDR5b3FEQVl5MEtlUEowNmhKcTJBUk5uRzJ1TlE4QUU4Zmd3T1hRYk53aWZqRXVlanFILVpjZE1NSHBjYko3eGFoeGNQS3ZWY2VKTUxaR095YjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "MSF statement on sharing staff information and humanitarian operations in Palestine - MSF - Médecins Sans Frontières",
    "description": "MSF statement on sharing staff information and humanitarian operations in Palestine  MSF - Médecins Sans FrontièresMSF says it will not hand over staff details to Israeli authorities  Al JazeeraMSF walks back plan to share Gaza staff details, saying Israel refused to provide safety assurances  The Times of IsraelMSF withholds staff lists from Israel due to security  The Jerusalem PostEU warns Israel’s suspension of 37 aid groups risks blocking life-saving aid  EUobserver",
    "published date": "Fri, 30 Jan 2026 11:57:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUVhYSHpmVEtkSGFhbWdLZ2pUa2VWVDZwRlQ1M2ZyOWJoeFBhMDJkWFlfY3ZON2VTci1Vb3ozaUhSTUJ2QVRxMWhiVTh3blk0T1lEdGludjZ4TGNGVldVaEJncm5aVXNOdThFSmlPdXVOM2pNSFdVTWtHYjBScW9JN2hjczNmaHdsR1BXZ0VPazBZOFFDSXFLaGxGZFdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.msf.org",
      "title": "MSF - Médecins Sans Frontières"
    }
  },
  {
    "title": "Suspected jihadists attack airport near Niger's capital - BBC",
    "description": "Suspected jihadists attack airport near Niger's capital  BBCIslamic State claims attack on international airport and airbase in Niger  The GuardianISIL claims responsibility for Niger airport attack  Al JazeeraGunfire and explosions heard near airport in Niger’s capital, residents say  France 24Islamic State claims deadly attack on airport in Niger capital  Reuters",
    "published date": "Fri, 30 Jan 2026 17:25:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5IaEJMLTJPVXk5M0lWV0E1THdIVEt5YzBjbVRGNmFlMmstclBSaW5zdW0zRWlvMnZSY3VRWF9zRXdCWWdZREZVNkhnbjZ0aWdJRlNmM3BOUWVOUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran warns of ‘hazardous consequences’ after EU designates Revolutionary Guard as a terrorist organization - CNN",
    "description": "Iran warns of ‘hazardous consequences’ after EU designates Revolutionary Guard as a terrorist organization  CNNEU adds Iran's Revolutionary Guards to 'terrorist list'  BBCHow Iran’s Revolutionary Guard became a powerful force within the country’s theocracy  AP NewsBritain to ban Iran’s Revolutionary Guards  The TimesIran: Council adopts new sanctions over serious human rights violations and Iran’s continued support to Russia’s war of aggression against Ukraine  consilium.europa.eu",
    "published date": "Thu, 29 Jan 2026 21:15:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOa0ZDX0Q5eE1FNzF6V0lubVAydjhWQS1OSGlGTnl5VkUzRkx6MTBsOGNVbmdVa1BsR1h6ZmI3cmZUUlJsSWJGVnpqV2RidFlOTFhwdDQ2SkVNamRZQ01fQ0c3aFY1NGN2OFFKd3FTWFczWHVMcDcySVNXc3RzX0s1VVR2bVZBWVc5S3VTNS1TS1Z6V1pUeWM3a0podFVGYmtwUmNUZ0txcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Three reasons for the record rise in gold prices, and one why they are falling - BBC",
    "description": "Three reasons for the record rise in gold prices, and one why they are falling  BBCHere’s How Gold Hits $8,000, According to J.P. Morgan  Barron'sMining stocks have been on a tear, with gold passing $5,000. Analysts are split on what's next  CNBCGold and Silver Have Been Flying. Here’s Why and What to Watch  Bloomberg.comCurrent price of gold as of January 29, 2026  Fortune",
    "published date": "Fri, 30 Jan 2026 19:11:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE13NlgxX0U0NUc3QWx6UTUxeXREa05tR3dQRDkzbFRZeXNNaUdqRE9vYTFOMFlmc09kbkVZc25Oalp1UmZzaWNDWnZIdllNVHdHZEY5T1NUWERJQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Exclusive | The GameStop CEO Has an Audacious Plan to Clinch His $35 Billion Payday - The Wall Street Journal",
    "description": "Exclusive | The GameStop CEO Has an Audacious Plan to Clinch His $35 Billion Payday  The Wall Street JournalGameStop's Ryan Cohen eyes 'very big' consumer megadeal that could increase company's value tenfold  CNBC‘Big Short’ Investor Michael Burry Says He's Betting on This OG Meme Stock  Yahoo FinanceGameStop wants to conduct 'major acquisition' of a public company  GamesIndustry.bizGameStop Stock Rises After CEO Doubles Down on Acquisition Plans  Barron's",
    "published date": "Fri, 30 Jan 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE53WDhYZDV2azR5RDdlbVJUNEIwRnZEZHNLS0hvRDdLdHF1dnZsdDB1aExTdC1SZGdVZm10c2Myel90QjgwcFVDVHRFUExYcFZWX2ZTTGVRbnZBa1psRmR1bDc0VklDS3hDVUF3R0JLYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Fed Chair Powell sends frustrating message on future interest-rate cuts - thestreet.com",
    "description": "Fed Chair Powell sends frustrating message on future interest-rate cuts  thestreet.comFed holds interest rates steady for first time since July  CNNFederal Reserve holds interest rates steady as a defiant Jerome Powell resists White House pressure  NBC NewsInvestors bet on later Fed cuts to support markets after pause  ReutersFed, Signaling Little Urgency, Prepares to Pause on Rate Cuts  The New York Times",
    "published date": "Thu, 29 Jan 2026 13:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPekNOMWd3NFpyVWkyM3lJQ29VZ3ZuUkhRcVBfUVlJMXUzUlNzX2xDRVpZendTd2gzaHd0QWxqcUUtUWdrSGwxRzNSdGgwVDF0ZHdUVXZ6UUtleUh5eUhkMi1ZbGNwT3ltYlgzaXFIY2VMRV92M1EtalVyanQ1MHRyTnFVZ2dPLXg4SWphS09Da2J5V25UVngwc3NuRU9scUxBYm5V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestreet.com",
      "title": "thestreet.com"
    }
  },
  {
    "title": "Trump thinks a weaker dollar is great for America. Is he right? - NPR",
    "description": "Trump thinks a weaker dollar is great for America. Is he right?  NPRWhat the Slide in the Dollar Means for Trade, Travel and Investment - WSJ  The Wall Street JournalOur currency, your problem  ReutersJust how debased is the dollar?  The EconomistWhy the US dollar hit a four-year low and could fall further  BBC",
    "published date": "Fri, 30 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBDQndEN2s0V3o4dUwzOUM2aHcwOGU1WTQxMVd0VkxKZVMwNDFXamp2ZVB6UTEtREFrRmotXzc0aWd0Mm9sT21PUnpuLUdLYmVEYUZLTmhfVEE4NVBPc0lvOHdNV3o5UXpxcUFnYVk3RVVidzMwdEtoV1pwQXp3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Galaxy S26 series specs, official-looking images leak ahead of February 25 launch [Gallery] - 9to5Google",
    "description": "Galaxy S26 series specs, official-looking images leak ahead of February 25 launch [Gallery]  9to5GoogleExclusive: Samsung Galaxy S26 Ultra Renders & Specs  Android HeadlinesSamsung’s Galaxy S26 lineup might look familiar.  The VergeSamsung Galaxy Unpacked 2026: Everything we think the company will unveil  EngadgetExclusive: First look at Samsung’s 25W wireless charger, possibly for Galaxy S26  SamMobile",
    "published date": "Fri, 30 Jan 2026 16:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOTkdIZzBhZkNQQ2FIR0VxYnNKUGhHUEs2TXJtRUVlUnZNNEJ5aHQ5OXp5RnN5S01FZ3l1ZHowYzdScWtIU01seXptOHhkRFZPX19iQzlHNmlVWlJjN253ZXExTHE5bzQ2QjVCQ29FNzJxUmlKaVdjTmFURW0yUVl2VzdoaGsxRlFUOEE4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "New Nintendo Direct Rumors Point To An Incoming Flood Of Switch 2 Ports - Kotaku",
    "description": "New Nintendo Direct Rumors Point To An Incoming Flood Of Switch 2 Ports  KotakuA Nintendo Direct is reportedly coming next week, dedicated to Partner games  Video Games ChronicleRumors Are Swirling of a Big Nintendo Direct in February  IGNNintendo Direct Partner Event Coming Up Next Week, Report Says  GameSpotNintendo Switch 2 – The DIS  The DIS",
    "published date": "Fri, 30 Jan 2026 14:23:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1jcWc4V25KTmEzTGVPbC0wd1JzQnFMUkpzbjNmYWY2YzRzdmRDaUFwbjFpSzUxcFRMaml4SzMzWjUyS1ZUV1FqQ3FfbWctd21sRnBVUk9kUGxxRG50ZmpucGw5NkJYYjZ4SzBjZXhUd282VzVvUFFDaXJ1MGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kotaku.com",
      "title": "Kotaku"
    }
  },
  {
    "title": "Google adds Video Overviews to NotebookLM app on Android, iOS - 9to5Google",
    "description": "Google adds Video Overviews to NotebookLM app on Android, iOS  9to5GoogleGoogle's NotebookLM Transforms Document Analysis Into Video Content, Reshaping Enterprise Knowledge Management  WebProNewsGoogle Brings NotebookLM Video Overview To Android  findarticles.comNotebookLM's beloved video feature is now on Android  Android AuthorityGoogle adds Video Overviews to NotebookLM app on Android, iOS: Report  Business Standard",
    "published date": "Thu, 29 Jan 2026 22:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFA2R2tUMnVLYXFZWkllRHFCQ1FZUWhWWkRTRnhMYTRUbTRyS0RHVDFIRXRJYmQ5VzlrWlhid05CMXlWRmc4YTg0XzNSYl9RV3pkVmlfNkExeHNLQUdDbnVleTc3Zk9wbUlHa2M3R3hiczdKNUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "We finally heard from Trump Mobile… and they immediately ghosted us - The Verge",
    "description": "We finally heard from Trump Mobile… and they immediately ghosted us  The VergeBlingy Trump Mobile boasting golden MAGA wallpaper finally about to go on sale  The SunWhen will Trump Mobile T1 launch? March promised, price set at $499  Geo NewsTrump Mobile touts an 'Ultra' version of the phone you still don't have yet  Android AuthorityWhat Happened to the Trump T1 Mobile Phone?  whopam.com",
    "published date": "Fri, 30 Jan 2026 19:06:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQSHFZZnVuWTFvZ1VFZVBOLXd1aWhhb2pWSDFBa24tT1c0cDktcjZna1FJUU1kdUxSbWZLMnRDNnBUZW5NaEVEVDl0cTM5bTgwSHZMNmI2bWw5NG0tV3E5Vm5QaTZIWGpFUmVBT05sSTJPVE1CdEVMdzZPdDBtd3BFSnN6TjM2SzQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "See Paul Mescal, Barry Keoghan, and More in First Look at Sam Mendes’ Beatles Biopics - Pitchfork",
    "description": "See Paul Mescal, Barry Keoghan, and More in First Look at Sam Mendes’ Beatles Biopics  Pitchfork‘The Beatles’ First Look: Paul Mescal Is Paul McCartney, Barry Keoghan Is Ringo Starr and More in Four-Movie Event  VarietyPictured: Paul Mescal as McCartney in new Beatles film  YahooFirst stills from Sam Mendes’ four-part Beatles film released in Liverpool  The Guardian‘The Beatles — A Four-Film Cinematic Event’ Unveils First Close-Up Photos Of Fab Four  Deadline",
    "published date": "Fri, 30 Jan 2026 15:24:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPUlBhM2xIMWw1eERBRVhrYlFRemRCdW1uc1ljd0xXTmdDWjYtbG40aGhfRmFnZU5RN01nci1wenYzTi16aGhrVG5uc29RUmRYVkFMYkZYWXJ2d1ZHaFFOOExIZE5ua25lcUVWS0VUUkt3czNRc1VZd0xLbnRkM05iLVJxT1FGMExIMTI5YTlSckNuTHFha3pTZ1JvU1J1cHdkX2FFWlpGNV9TeU1jM1U4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pitchfork.com",
      "title": "Pitchfork"
    }
  },
  {
    "title": "Melania Trump's self-titled documentary released in theaters today - Yahoo",
    "description": "Melania Trump's self-titled documentary released in theaters today  YahooJimmy Kimmel Teases ‘Melania’  The New York TimesThe Melania Trump Documentary Is a Disgrace  The AtlanticMelania review – Trump film is a gilded trash remake of The Zone of Interest  The GuardianAt the ‘Melania’ premiere, the first lady takes center stage  The Washington Post",
    "published date": "Fri, 30 Jan 2026 17:04:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNS01mMWNwS2JsNVZZMm01NHlsUzV4RXF2YVRKUndFcVBoZlp6YUNqWTBsUEtKOWljSHo2aGFQN05pSlpmUEtyX3dEczR4LTNqMjZzZUNzR2NORVpFclRZTDlLZlVKUVRiU0U5LVIyWkg1N1JQbkhjMjlUckUyMFo3TXZreml2QTc4WjFhWWFsYk0yVnlWN0tUOHhuLWdlXzBhaUMtNlN5X2ZsYTFkcER1alBnVGJrM0Z0aDF3NjJJa2k5ak92d3cyMENfcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "The Sundance Film Festival’s big moments and breakout movies - AP News",
    "description": "The Sundance Film Festival’s big moments and breakout movies  AP NewsThe Last Sundance in Park City Ends on an Aptly Misty Moment  The New York TimesA Farewell to the Sundance Film Festival—and Park City  Vanity FairSundance 2026 Review Roundup: The Best Films We Saw This Year, Ranked  Consequence of SoundLights Out, Park City: Sundance 2026 Photo Gallery  Vulture",
    "published date": "Fri, 30 Jan 2026 17:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPQlFxYmMtOW5UZGFKUmU0V3VTWG5MSDdNcldmb29CRmdVSmFHdkl4VjVwTU5MWFRfdVJYLUtoQ1pJLXppWUNBOGFmWWhYT3YzRC1qTHhPZkNZRGFBek5XUG5mN2ZEVGx2MXZXSWRaUnR5QXdDMGY4dUwybmxTbGZrbmRoanM1ZEczNWQ5YXFKT1ZWM3ZJWXNvV1VYcWh2eTV6UDNpZzlwdVRPZWNIZlVhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "WWE SmackDown SPOILERS from Saudi Arabia - Cageside Seats",
    "description": "WWE SmackDown SPOILERS from Saudi Arabia  Cageside SeatsSmackDown results, Jan. 23, 2026: Randy Orton delivers epic RKOs to Trick Williams and Sami Zayn  WWESmackDown Sees Nearly 20% Drop in Viewers  Slam WrestlingHow to watch WWE Friday Night SmackDown (1/30/26) for free  NJ.comWWE SmackDown Preview (1/30/26): Start Time, Match Card, How to Watch & Live Stream  Sports Illustrated",
    "published date": "Fri, 30 Jan 2026 16:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNXzZzYUpxby1uaXZ3TTVpVHlsd01nMHlpTktCS1lkTi1TYVVDVG9QcHd6QTRLYmp3YmZzU1RpMC1Ib3dpZ01hUTl5SFoxalNwRlZkZVVjVGc5YXoySnh2M3BHTHI0b0wyMHFmUWRYQ0FpbXF6N3ZrT0RUcjNFVU5CbnVmeHJJZ3R0bFJzUmN5Mkt3RFA1WERQRzhFeEtTbVY1UzFieHp1SDh2aEJXeFQxXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cagesideseats.com",
      "title": "Cageside Seats"
    }
  },
  {
    "title": "Russell Wilson ‘made the right decision’: Malcolm Butler on that fateful pick - The Seattle Times",
    "description": "Russell Wilson ‘made the right decision’: Malcolm Butler on that fateful pick  The Seattle TimesSuper Bowl 2026 Props Guide: Patriots vs. Seahawks odds, picks, trends and everything to know before you bet  CBS SportsSuper Bowl LX anytime TDs: Who has the best chances of getting in the end zone  ESPNSuper Bowl LX Betting Report: 'The Public Isn’t Buying the Patriots'  FOX SportsSeahawks vs Patriots Predictions, Picks & Best Bets for the Super Bowl  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTEc2MHJvcFA3azVSUGNSa0k1czhSVmhpWEFsVkJCZW1BN2hlU29LbTZtLV9NNHVna0Nmb1Ftb0dzMjNWTzhXSnhXdEp0VTBwbjFpZ1BXcGZ6YXh5Y0tMVFBMWTJEbW9kVHRSZnh4bG9tWENjQU5uY1FJTWdLNGQ4amtqUThTOXJIX1pLeWZjcnNFcGFlZzgtaGR1M2lqQXlWTU1BQzAtc1E3ZHRZZWwzMHJoblRNZmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Champions League draw: Real Madrid to face Benfica, Newcastle to face Qarabag - BBC",
    "description": "Champions League draw: Real Madrid to face Benfica, Newcastle to face Qarabag  BBCChampions League playoff picks: Real Madrid, PSG to advance  ESPNChampions League play-off draw analysed: Benfica v Real Madrid again and a French first  The New York TimesChampions League play-offs set: What they mean for Bayern and the last 16  Yahoo Sports2025–26 Champions League Knockout Playoff Draw: Full List of Matches  Sports Illustrated",
    "published date": "Fri, 30 Jan 2026 11:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5SZGlSQ2o3UHhuOXRwVTBRRVlDYm1nTE9VVjF4Um1TakVaU3NOTkF4MzJpVUpmRlNrSVBuZEpnUnFHdnZRQk85X0R0RTY3bXhaTnYzcm93dVg3ZDNvaU1ELV9QV3o3a3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "description": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow'  Space3,000-light-year-long jet offers new clues to first black hole ever imaged  Scientific AmericanProbing the jet base of M87's supermassive black hole  Phys.orgEvent Horizon Telescope probes source of 3,000-light-year-long black hole jet  EarthSkyM87: Astronomers Trace 3,000-Light-Year 'Cosmic Blowtorch' To Its Source | WATCH  Republic World",
    "published date": "Thu, 29 Jan 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxObEpLTjdzVFd0QVhhV1pHTi1GTlFjTGdHN1ZxdGRIaWFPOHV5MTdMZE0ybXVBRGtuYzc4U1NPZV82cGhROTcyVUEzRUJmRDJncC1obkEtRjlzOThaUy1MSnhQVDRjQ3FlMnJwcV94Wks2STJReTFHYjBrU3c0WXNLMUdQMEFydEdMdWprdFFQdm03WDlVMTl3UWpMaDFYUnBvV1liXzhFa2I3V2lqZ1JIRWhCRElsTzlaX2UtMTNJY0pXa1Y2RXV2cFBiLWltYnhZVk9jZ1R4Q1lDNUpnUl95ZmJmaFhfa0pZMWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Comet C/2025 K1 (ATLAS) crumbles apart in stunning new telescope images - Space",
    "description": "Comet C/2025 K1 (ATLAS) crumbles apart in stunning new telescope images  SpaceView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOcVRIUDVGV0J0YkROdmlhdFd1RUdmUDlyMGNDeF9GV2NlUk4xMTcxQXRsOF82UUJmWEVQZXhLaUowT1UweFI5R1F5VDZoZlFsTFpVakhtSkV0Q1h6eWIzTlFLSUtSdXBNNVI5UkhPQmI3RHpYclhiU0dpUi1TR1Voa3pJMUJQTWNFZnVfOV9CTnRiM2lmQkFZN2JPWWlRSTk3MkVhY2NvSFRsM1M3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms - Live Science",
    "description": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms  Live ScienceView Full Coverage on Google News",
    "published date": "Thu, 29 Jan 2026 16:04:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTXdiTjVhQUlmaE1NZ1VtWF9hLTF4Ti1VU3ctNWZrWFJUcW85dlB2emZzRnJtM3hFTGI0WkxmcFE2UnBmZm15ZUMxcFJoZGxSUFpUOWhhSkJNc2VVa1NlYUZ4b185STl1ZW1fTzVINHNOWVYtQ0wwSTJaMDhlZXNUX0daODNMRDF4XzBpZk95b3ZLdDVybDFSeWVLX3AxOTZfNmdDV2RueVRULXM5TXFSWVFFc0lXdUhJUU9tc19WdWU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet - The Daily Galaxy",
    "description": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet  The Daily GalaxyCuriosity Lights Up ‘Nevado Sajama’ at Night  NASA Science (.gov)NASA’s Curiosity Rover Lights Up Mars for Very Rare Night Photo  PetaPixelNASA rover just sent one of the most beautiful images ever taken of Mars  Futura, Le média qui explore le mondeNASA’s Curiosity Rover Captures Serene Mount Sharp Horizon After 14 Years on Mars  WebProNews",
    "published date": "Thu, 29 Jan 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPT0d5U2R5NzZ0eG56Ml8zWTRybGpKQmlPUVZpWGE5RzAyWGJpUjd5aUdzb0I2aGxOY2lTMVZRbkxnbjJncGpSY1lYVi1tUXVkVEFBWWlpRmFGM2plQ21zV2RRVVJIR2dHMGFxajBTSFE3SmQ1TlZlZ21aaTVRMmRNQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailygalaxy.com",
      "title": "The Daily Galaxy"
    }
  },
  {
    "title": "Staying up late is linked to poorer heart health. Here’s what night owls need to know - CNN",
    "description": "Staying up late is linked to poorer heart health. Here’s what night owls need to know  CNNPeople who naturally stay up late may have worse heart health than early risers  NBC News'Night owl' lifestyle may bring higher risk of heart disease: Study  ABC NewsLike staying up late? You may be putting yourself at risk of heart problems  Scientific AmericanAre you a night owl? New study links late nights to heart disease  Euronews.com",
    "published date": "Thu, 29 Jan 2026 19:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOdXFZWVdlaVZvYmlvMmFDc0xwbXNZd19iVkNmTWZhU2hfR1JXXzJGUzB5UHhSQ1NPLU81R3RMV1ZNY09FZVVRRWpXZlF3QWJCWEVKNHBoa3QzYU80VTZLc081MkRQSTlrdHFPX1l2Tkh0UEtaTUJUTGRkTnpVQ191c3IwaE1Cdzg1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Small risk of severe acute pancreatitis with weight-loss jabs, UK regulator warns - The Guardian",
    "description": "Small risk of severe acute pancreatitis with weight-loss jabs, UK regulator warns  The GuardianCould weight-loss jabs be behind rising gallbladder removals?  BBCWeight-loss jabs can cause deadly pancreas illness, regulator warns  The TelegraphWeight-loss drugs linked to risk of pancreatitis, UK regulator warns  Financial TimesMHRA Warns of Rare Severe Pancreatitis With GLP-1 Drugs  Medscape",
    "published date": "Thu, 29 Jan 2026 23:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNLWh6VVcxbkQySUFlU2xSM3VaeTdLLWdkV3FJenB2R01meTlIc1VCNS14RW9jNGVtcDJZMVhGN0pJRFZuZGstTWVoSnQyNmdkdXE2b1VXWG01d0MyMUFfOHBBUkpjRWkzXy1zNElqeUs1T3dIR2ZOb0dvdjQ0S2ZUempLejJpRjhVV25KNVNpREhPMXRQTWp1QWZwVW80QzV0d0QyalNDSDNhdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Guest column | A self-collected test allowed me to finally get cervical cancer screening - The Washington Post",
    "description": "Guest column | A self-collected test allowed me to finally get cervical cancer screening  The Washington PostUniversal self-collection of cervical samples may hike HPV screening rates  CIDRAPCervical cancer screening updates are a major step forward in saving lives  Baylor College of Medicine Blog Network -Dr Neff on the Accuracy and Feasibility of Self-Collected HPV Testing in Cervical Cancer  OncLiveUMMC research helps reshape national HPV screening guidelines  WAPT",
    "published date": "Thu, 29 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQamc0SXZiV3ZEdzBvWGZqQVJ4U0ladGZkOUYwUktEOXFHa3gxZ0hCUjAzQjVaYUxJZmdoWHlWS05wUkI5M2xPUGk4S0xXVS03R0t4bjk4NXZiNlFrZzJ0WnZsNlBZOHRoT3MxLTMtOEppSEZGamFxSGhwQngyT0JpeHpVZXNnYkNPMFQzT19GRWQxem5OYTdz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Scientists Link These Popular Sweeteners to Cognitive Decline - Prevention",
    "description": "Scientists Link These Popular Sweeteners to Cognitive Decline  Prevention",
    "published date": "Fri, 30 Jan 2026 12:56:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPMEU3UHFvSVlPSWo5SnhsU2pXeU9vZGNnYkk2akdMbVd1RVlGTTNkOXNGeFNGQ1NYTi0tNW5qcXhDVDRDalZXcjQyck5BS2s2emN3SjZhVW8yU3RKZlQzTGxxUW1taENTRmZHM3dDVkhTNGFRbllpaEd1M0RKSWxqUE1NUTVfNUMxQmFIT29YUTZ3M21nUFN5MFB3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.prevention.com",
      "title": "Prevention"
    }
  }
]