[
  {
    "title": "Trump Erased the Endangerment Finding. Here Come the Lawsuits. - The New York Times",
    "description": "Trump Erased the Endangerment Finding. Here Come the Lawsuits.  The New York TimesReversing the endangerment finding, Trump’s EPA puts polluters over people  The HillEPA boss offers forceful defense for scrapping landmark Obama climate policy  PoliticoTrump emission rules cut 'universally hated' start-stop feature in cars  USA TodayHow dangerous is Donald Trump’s “endangerment” decision?  The Economist",
    "published date": "Sat, 14 Feb 2026 18:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVkxLSDRUUnB5VmVCZm5sQWU4NEg0NWNzemhTOHFYa1NQMjR3ZHVoNXFnWTVJX2xYenBTdTJqZmtKaFZ1X2xYRjd2SjRhNlhxUm52YkNic2hPMWgzOFBGZGwzTDBmMjd1c2hIVjI2bXA3bmE5UnRVRC1TMVZVUkl6Rmw3amhsOWFrRDNoaFJDd1pfczQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "New careers, relocations and medical problems: How ex-federal workers’ lives have been upended since DOGE - CNN",
    "description": "New careers, relocations and medical problems: How ex-federal workers’ lives have been upended since DOGE  CNNFormer feds turn to tailored job search resources to continue service-oriented work  Government ExecutiveFormer federal workers follow their 'calling' to state and city jobs  USA TodayFormer federal workers are taking up local government jobs  Inquirer.comOne year after DOGE cuts, former federal workers find new roles  CNBC",
    "published date": "Sat, 14 Feb 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA2b1ZldWRadFBRZ3NYVzlKY1lVelc0VFc1ZXVTeXVFaDFIZm9pbUtpQXo3cFR4T1UtU2ZxSGtJRG9QT0NVcDBfbWxSN1pMd0JDaEdPTlFfbFN6eWVERm1kbUtVLXN3MXhxUmgtRS1UU3dFekU4SkNhSTI3M3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Dr. Oz pushes AI avatars as a fix for rural health care. Not so fast, critics say - NPR",
    "description": "Dr. Oz pushes AI avatars as a fix for rural health care. Not so fast, critics say  NPRView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSmMyczZRU1V3YmN0TGx0ZHpZRmxqZ1RoWGJiRGR2bUxic2NZRkM3RkZMeWFKd19HTkpmRC1fUXAzS1NjRHZ6ak5EeFRDWlhXVV9IQzZ6VlpMN1BWamY5MkZFR25xcW9vbDU3dDYwS3FKVXpQVU5qbjFGNk5oc0FIQm9IVmVpS2JHM2RPeExHbjd5MHpj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Why The SAVE America Act Could Create New Obstacles For Millions Of Voters - Forbes",
    "description": "Why The SAVE America Act Could Create New Obstacles For Millions Of Voters  ForbesCollins boosts Republican voter ID effort, but won’t scrap filibuster  Fox NewsHouse passes SAVE America Act, sending Trump-backed election bill to the Senate  NBC NewsFederal Power Grab On Voting Still Flunks Basic Civics Test  Cato Institute‘A massive burden on American eligible voters’: State election chiefs oppose GOP voter suppression bills  Democracy Docket",
    "published date": "Fri, 13 Feb 2026 19:31:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPVE1yVDFhLVlnbHVuT1hCYkxrb1UtVEVSWTlNQ01fMlhxckFaMlFmTnFmRUpjM0hLN20xb0ExTWpEUURzQUlUdXBhdm1mOWNBbDhFTlcyY1U3cWY4Q2pocy1XcEo2S3lWNXZaa0pIdzVCMHYzLS03RS1tekNZRExmQXo0bDFUMXIwRzBoY293NDNLWUI3TmQwa0FUQkFkOWFuVW04N1NxTU1VRkxRQ09OaWMwaEZ4eFpiQ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "description": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest.  The Washington PostDon Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon pleads not guilty to federal charges stemming from church protest  CNNDon Lemon Hires Federal Prosecutor Who Quit Over Immigration Crackdown  The New York TimesDon Lemon, Nekima Levy Armstrong plead not guilty in church protest  Star Tribune",
    "published date": "Sat, 14 Feb 2026 17:32:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTGlxaTVmZGNfZ1lOUlZqRUdNVWZhUnQyZkV1dWpOMFM0V2tsSTZOcUdjMmItUTd4MDBRMWZxZ0x2TFJRUlJMZGx1UVRPeTRhbXVPa1VPUWJZYUNWRUVFS2k2NXhJY1RRZXVZbG9waElyZlZkODZGa0FpUEhiakItLXFna1o4ZnZFQ0I0MGhwZGhiQlJjeXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "US launches airstrikes on dozens of Islamic State targets in Syria - The Guardian",
    "description": "US launches airstrikes on dozens of Islamic State targets in Syria  The GuardianU.S. strikes 30 ISIS targets in Syria as it continues \"relentless military pressure\" on terrorist network  CBS NewsU.S. Forces Continue Strikes on ISIS Targets in Syria > U.S. Central Command > Press Release View  centcom.milUS Airstrikes in Syria Target Dozens More Islamic State Sites  Bloomberg.comUS military reports a series of airstrikes against Islamic State targets in Syria  NPR",
    "published date": "Sat, 14 Feb 2026 15:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPZk9yNVpUUnlUbGxUZTF6S1B2dEl2NUxmaHM0cmFqS1MzUXFUcDBXMnBIZEtBcXNid2Y1by1peHVrWTBtdDhHcEVuQzZpWmNKbWFvLXk0V09URU5LOHhFckQwekxTRWpkcml3OTBZVVJkTDJoZURUNFh1Qmt2dC0ySnNvQ2NzZkI5MDBkT0JxNEc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Far right renews demand for Epstein answers after Bondi hearing - Axios",
    "description": "Far right renews demand for Epstein answers after Bondi hearing  AxiosOpinion | Bondi’s Incompetence Is the Latest Insult for Epstein’s Victims  The New York TimesOpinion | Warning: Listening to Pam Bondi is harmful to your brain  The Washington PostPam Bondi’s Contempt for Congress  The New YorkerBondi faces MAGA media backlash after hearing on Epstein  The Hill",
    "published date": "Sat, 14 Feb 2026 16:44:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNYy1sTkZ3czZvNFVPSnBKUTJoUU5LY1AwN3UySTRueVlXTkUtUXg4TUpUVmM2SXVfSVlTckJaOGFWWU5WRXpfa3diTkVUS2JuT0kzMFNpLWhVTlE4VzFIUk14QUtmajN0dzFhRGRIemQ5RC1qZERwS0JxLWJid0Q0U2NyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Saturday's threat of severe weather increases for Houston, Weather Impact Alert issued - KHOU",
    "description": "Saturday's threat of severe weather increases for Houston, Weather Impact Alert issued  KHOUFirst Alert Weather Day: Showers and thunderstorms possible on Valentine’s Day  KLTV.comHouston weather: Severe storm impacts for Valentine's Day, timeline  FOX 26 HoustonGov. Abbott activates state emergency resources ahead of severe storms  Click2HoustonDallas Weather: Severe storms possible on Valentine’s Day  FOX 4 News Dallas-Fort Worth",
    "published date": "Sat, 14 Feb 2026 09:19:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQQVQ1OHdkTFd4V3cxN0V0UzJ1SFBiaklMRWludHRZT1hQMlRadVh4ZzBqazQyeHdJYmRuNXZTT19tU3pFSWg1UEMzRmo0SGJmUE10bU1tdHdOamM5U2ItclB6OGZTUDFLaFgzV1dTcEFybDM3SWVadDZrUkNNM3lLMXZnOTFLRUltSV92MFBxWEc3TEdZZ0FhVW0zZUJYVFBvS0x3dzVqZFM4S0Zjdi0tMUZyT194Y3lwTVl6cDJ0aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.khou.com",
      "title": "KHOU"
    }
  },
  {
    "title": "Inside the Debacle That Led to the Closure of El Paso’s Airspace - The New York Times - The New York Times",
    "description": "Inside the Debacle That Led to the Closure of El Paso’s Airspace - The New York Times  The New York TimesLaser weapon that shut down El Paso's skies was LOCUST system  AxiosTrump on El Paso flight restriction: 'People learn' after cartel drone scare  El Paso TimesConfusion over laser system led to El Paso airspace closure, officials say  The Washington PostWhy is the U.S. government exploring using high-energy lasers near the southern border?  CBS News",
    "published date": "Sat, 14 Feb 2026 10:02:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOUlhkS3ZHTFJnZU9NRDZPeE5RTXp3TGlMY1M0NlFLUTFPX3Q2LTQ0aGV6YVlTMlM1R0F2bEthTWVBOGNIWGdQVldvd0wxOXFUN3VabnZ1ZmRJb0duQ3Q5aVgtUF9pLW9sSTJ2UUxhMnZwczVyOHhjTjM3TjRJUjEzdV9rNlVlUHZoWUlTRF9BaHkxNVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times - The New York Times",
    "description": "‘Tax the Rich’ Rally Is Expected to Draw a Big Crowd. But Not Mamdani. - The New York Times  The New York TimesHochul’s no-tax-hike stance gets an unexpected boost from Mamdani  PoliticoMamdani Expects Wall Street Taxes Will Ease NYC Budget Crisis by $5 Billion  The Wall Street Journal\"Honeymoon is over\" Zohran Mamdani grilled by lawmakers as he proposes to \"tax the rich\"  WRGBTa-da! NYC budget gap is now down to $7 billion, Mamdani says  City & State New York",
    "published date": "Fri, 13 Feb 2026 08:00:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQX2d2YUNvbFFZdmpsZVlFbTJiMDJ5R0VoMkItLU5LdjBzRG1VMUFkZkJhclpGeVRrRTgyb1NMRWpDa0JtanIwcXVSN1R0bHZzeDh2Um5qcThLQWtmVEdMSE8td1NhNnNJNkh0cXU4YjhqaC1EV3RxbE0zWGYwaFppcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Can Bangladesh's new leader bring change after election landslide? - BBC",
    "description": "Can Bangladesh's new leader bring change after election landslide?  BBCCan Bangladesh’s old guard build a new democracy?  The Economist'Interest of our people come first': What BNP chief Tarique Rahman said on Bangladesh's foreign policy on India  Times of India‘Bangladesh will be better’: BNP victory puts nation at crossroads  Al JazeeraAfter Gen Z uprising, Bangladesh vote shows limits of youth power  Reuters",
    "published date": "Sat, 14 Feb 2026 00:03:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9CMHFaTlU3NXZZQ21VRm4zWkFrNlA4WGZaNFZYdDRNbUhSdTdFX3NIMVRQRjJFaTE2S2phUWxZOGJzX3c2dnVmVmpZVGRfRG01Z2I4em5VWjRZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Sydney police to be investigated by watchdog after anti-Herzog protest violence - BBC",
    "description": "Sydney police to be investigated by watchdog after anti-Herzog protest violence  BBCAustralia police defend actions after violence at protest over Israeli president visit  BBCClosed-door apologies are not enough for a community confronted by images of worshippers being seized by NSW police | Aftab Malik  The GuardianWhy Isaac Herzog's visit was important for Australia's Jews  The Jerusalem PostIsraeli President’s Visit to Australia Splits the Country  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 05:09:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5OXzFkVTl1S1RlU3h2RXdMTENxMXFlMVhHMS1PRVlOclFLSmV2SHRqcTBfVlJ4RU1lZUs5d3VRZThaVlhkLTdvYzVVZjZweWV4aU5LZWFWTnRCdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel - CNBC",
    "description": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel  CNBCLife in Cuba Is Grinding to a Halt Under U.S. Oil Blockade  The Wall Street JournalRussia has started an 'evacuation' of its citizens from Cuba amid the island's jet fuel crisis  Business InsiderAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  CNNU.N. Condemns U.S. Measures Halting Oil Deliveries to Cuba  The New York Times",
    "published date": "Sat, 14 Feb 2026 06:58:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBaRmQtYlFFa1JBUV8ycHlrdk9FODB2blQ0MlljTnFFX3hQMFFrU0dlWkROVW1OUlNaSHpTaU9hZ1lCQ1VYcEZEV2k5ZmlnTzZaa1FCTGxuMEk2eE93aUktS1NVcFh3N1BqUTJmRG04S01Tb05BNU9pbtIBfkFVX3lxTE1WV2JzUXBQcVRzaGdEZ0UzSjZzSkVmNlRHVDRwNEoyNTd2NHNiWTNkRVZoWHN1TFozVzBiSUw2OVkyLW5PNXF0T2kxLURIcDFacmFMU2FYVW5BX0pWVW1SN3UxeW1uZzBST1hPUUMxZGI5Um0wVGgyaWNpRnU0QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times - The New York Times",
    "description": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times  The New York TimesGisèle Pelicot felt overwhelmed and honoured by letter from Queen Camilla  BBCGisèle Pelicot plans to meet ex-husband in prison for answers on other allegations  The GuardianGisèle Pelicot recounts her ex-husband's \"unthinkable\" crimes in first U.S. TV interview since mass rape trial  CBS NewsGisèle Pelicot Recounts Moment Police Officer Told Her About Husband's Crimes  People.com",
    "published date": "Fri, 13 Feb 2026 17:41:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYlJBV1dLeE9waDBORk5TNzJkM0RRRl9IdVJ2WXpUNjR0RUY1QXdMRUZDQlQxdHpIbklxbjJQLTF5SnVJaVk4Y2VsbzJmVi1UNWdjM1RaUEpVWXQtRnVPcjNfTE9xdURLQjJ5Zk1FSXhZZzUzWW1CN2RTQlRDM0piNi1adjRFWXZqem5NRWFZYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Presidents' Day sales 2026: The best tech deals to shop this weekend from Apple, Sony, Anker and others - Engadget",
    "description": "Presidents' Day sales 2026: The best tech deals to shop this weekend from Apple, Sony, Anker and others  EngadgetAmazon's Presidents Day Sale Has Kate Spade, Lego, and More for Up to 80% Off — the 100 Best Deals Start at $5  People.comShopping This Weekend? These Are the Best Presidents Day Deals We’ve Seen So Far, Starting at $6  TODAY.comBest Presidents' Day Amazon deals 2026: Apple, Lego, Roborock  MashablePresidents' Day sales 2026 are live: The best deals we're shopping now from Amazon, Best Buy, REI, Apple and more at up to 75% off  Yahoo",
    "published date": "Sat, 14 Feb 2026 14:41:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOMUY1YXJGLVpfXzlOSHhJMmRqV05EY2VPb1d2SlFNVDdzR1RqNWcydEtsck5YenNHaTBVQXlOcEo5cUpWclI2Q19wN3JJWDM2UUo3WVNmZllZOXlnR09DWkxOMjVfcWl5QzdCa3VYcTRlcjdfWG5RMlBMNHZ3RGRMalpsTm5xOE8yZ09wVmFqTUE3emN0VWpRZ29XWVgwTDFNZEFCSXcxdXh0djZ4MjFjVVg1RDhjYTV0c1M1TkFZbkZSMVRfYWtyUnI0N3FkUU9pWWw1dHdGRVZmeFJYd1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.engadget.com",
      "title": "Engadget"
    }
  },
  {
    "title": "The Goldilocks economy, if you don't look too close - Axios",
    "description": "The Goldilocks economy, if you don't look too close  AxiosU.S. economy suddenly seems on track for fabled soft landing: 2% inflation without a recession  MarketWatchThe ‘one-legged stools’ holding up a fragile economy  The Washington PostWhat Redefined U.S. Economic Resilience in Just One Quarter  Fortune HeraldFinancial expert weighs economy outlook, cautious investors and cryptocurrency's latest  WJLA",
    "published date": "Sat, 14 Feb 2026 15:04:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9HcHZ6a3FlNWlQdUJILUdZeHJ1NEgyWlRZOEJLd2dlcVVidUxjaWc0ekZGUlFaRGJVaHktUWFKWWNfX012WHh6YWgyX01WWHNjRGtPTWVOUmNMVEhMVTNiX09Ob3FSUEVOb3BjNVEwdTE4aHVMdW00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Ford CEO, Trump Officials Discussed China-US Carmaking JVs - Yahoo Finance",
    "description": "Ford CEO, Trump Officials Discussed China-US Carmaking JVs  Yahoo FinanceView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 02:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxORGVRX3pmOWhjcExGVUZCSDRIdUk4ZXV1NE1FRkdzX3RBekZ5T0tUMkRoakgzSjBNbjhPV1RPdkdlRzFCTW5ZVUtHSVlzWmZfU3M2dUtab0lXeXFITVRreFQxakhDcHFDM0tHNzIzb2ZoZmV2TVB6anE5UFIzeVFVV18ycDNXZ28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://finance.yahoo.com",
      "title": "Yahoo Finance"
    }
  },
  {
    "title": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations - The Guardian",
    "description": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations  The GuardianElon Musk's xAI faces threat of NAACP lawsuit over air pollution from Mississippi data center  CNBCNAACP threatens to sue Musk’s xAI over Mississippi gas turbines powering data center  The HillGroups threaten suit over xAI turbines in Whitehaven  WREG.comPublic hearing set for xAI turbines in Southaven. Here's what to know  The Commercial Appeal",
    "published date": "Sat, 14 Feb 2026 00:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOTUF1NVUzOEFOUVhETUlhZjd2OFFwRkM3ZjFadG9QNzJFYzlLaTZBS0VvQTU1ck03bWM3cm85S1B1Z2hxOThXc2FVUFh6SWtpUFRsb3dTMlgwTHJMMkRrV1B0Uy1ObFBzZVRzV1p5NGlRQmNYcGlZWVNadHd0V1F1MXRnYnlrLWtrdVAyc3dwVjFxR09nT3pEZHhUaVJZOTQxYTk1cHl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "What it’s like to go on a date with an AI in NYC - CNN",
    "description": "What it’s like to go on a date with an AI in NYC  CNNMy Dinner Date With A.I.  The New York TimesThey have AI boyfriends, girlfriends. Here's how they're celebrating Valentine's Day.  USA TodayMocktails, potato balls, and 10 bots: My cringe Valentine's date at the AI companion wine bar.  Business InsiderInside the New York City Date Night for AI Lovers  WIRED",
    "published date": "Sat, 14 Feb 2026 12:46:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNMFBwVnlaV0VBWnhYbElQaXpiNlA4WGp1b1hOWVpDYms2S195YnlERERzUkE0RGFieHpoOTRNbGZxc2lzUmkyMGdkUWVpNXFRenV1dXFLNlh3bXltWkd0TEpfcnpyUERmRzBnNFU2d09PVGthZU5MMUhlUXl1OEhqUThJS0pSa0ZVSnY2MWFHRG00ZW9EVEVCSF9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Full Pixel 10a specs leak with new Gorilla Glass – how it compares to Pixel 9a - 9to5Google",
    "description": "Full Pixel 10a specs leak with new Gorilla Glass – how it compares to Pixel 9a  9to5GoogleGoogle Pixel 10a Tipped For Unexpected Upgrade In New Leak  ForbesLeaked Pixel 10a photos show it might have an iPhone 17 Pro moment  PhoneArenaYup, Pixel 10a Has the Good Colors  Droid LifeGoogle Pixel 9a price drop delivers massive Amazon savings ahead of Pixel 10a launch  Pune Mirror",
    "published date": "Fri, 13 Feb 2026 14:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE10Z2VPVmZWS2hZMjZVcGhlWEY1ZHVabzNKZklxYTdJdDhBaXpNR1BuVUtxMEhhc1lTZ0RIcTZmOFdqa1VneDYydjhRZlRCMklxU24xejZhTE9YeWVZSElTa3YzV2piSmxXZWs0MGFPNm9UZ2psalA4RjlwUHR4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "The biggest gaming series are going indie. Could it save the games industry? - Polygon",
    "description": "The biggest gaming series are going indie. Could it save the games industry?  PolygonRelooted, Reanimal and other new indie games worth checking out  EngadgetIndie Developers Transform God of War and Silent Hill in Major Revamps  FilmoGaz",
    "published date": "Fri, 13 Feb 2026 18:00:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBsWm15c0RVWG1CS1JSdmZiUUZKU2RiaGFWTEJNUXFDcmRYNnRIRlk0d1ZtWFNaNDFka2RzZDl3cmlERUFmWjJVTGkwT3hFV0RNRWhLSTB1aV81RTU3Vy1uZ0kxeU9zTVpJS1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.polygon.com",
      "title": "Polygon"
    }
  },
  {
    "title": "ChatGPT promised to help her find her soulmate. Then it betrayed her - NPR",
    "description": "ChatGPT promised to help her find her soulmate. Then it betrayed her  NPRChurches Confront The Spiritual And Emotional Risks Of Chatbot Attachments  Religion UnpluggedFeeling lonely this Valentine’s? Psychologists urge against confiding in AI  Straight Arrow News - SAN“ChatGPT took over my life”: the shocking confession behind AI addiction  Talk AndroidAI as a Confidant: Between Salvation and the Abyss 🤖💔  vocal.media",
    "published date": "Sat, 14 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFV1TUFOVkYzVnhNVmFhLUQxZzFtdUZTRFhRZ3Q5ZVRmdWZ3Ylp1Z3pFTnFRVkNKMmktQjNZM2JGU3RkMmhLbURHRFB0SERReC1aelhUaHZBT29qLWJLZUd6UzRQUVpiZG52UEhmWHpTa2JlaVlqWGJVV1BCV0tnd2VObDlacjlSak81ZDZsU1AtSWtKblNXTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "‘Wuthering Heights’ Smooching $80M Opening Around The World – Box Office Update - Deadline",
    "description": "‘Wuthering Heights’ Smooching $80M Opening Around The World – Box Office Update  DeadlineJacob Elordi, Heathcliff and the Controversy Over ‘Wuthering Heights’ - The New York Times  The New York TimesWuthering Heights’ most shocking scene could have been so much worse  The Telegraph'Wuthering Heights' ending makes major change from Emily Brontë's book  USA Today'Wuthering Heights' celebrates mad, passionate excess — but lacks real feeling  NPR",
    "published date": "Sat, 14 Feb 2026 16:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObHZoWW1uZGRobTBlUjg2M3d6ZUZHalhtZE1CQjZsSEU0VXF4QmdGckFteUtaeEFia09tVEl5di05SzJEVUUyY0JTbG5pTTE3YmJPZDQ5UlRSZFNUdGJrbGFsbWxIYkpxWnZUaHkxQm4yTzlnRnIzcXZrYnd3dFVEUnhaMkhEUVZ2RG9FUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’ - Variety",
    "description": "Rupert Grint on the Rise of Fascism: ‘Obviously, I’m Against It’  VarietyView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 16:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQYk5MTDNDdUNlcGY4R05XNm5wYmxLWVRKOGhwT0kyR1d3NkNHSmFEMXhtV3RrYTZ2V09zUUJ5dHFVTlhkOVFXVlhkY3ZWdzBDa2VUWEllTjM5MUV4QzBJUHlHMjI1M3dnam5OelhhbEZjQWtXT3BUYjFhX3dOWkRGRXd0amxrVklfUFJRekZudmxNNTI0Q0xNLUtWWFRpUmRlSmw0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "Wiz Khalifa Painfully Announces That His Father Has Passed Away - HotNewHipHop",
    "description": "Wiz Khalifa Painfully Announces That His Father Has Passed Away  HotNewHipHopWiz Khalifa Shares Emotional Tribute After the Death of His Father  YahooWiz Khalifa's Father Dead at 63  TMZWiz Khalifa Announces His Father Has Died  ComplexWiz Khalifa confirms dad's death in heartbreaking tribute  Jang",
    "published date": "Fri, 13 Feb 2026 22:27:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPYlhjbjJROE1aY3ctWUlKdFh2c2xfZEl0Z2RZR0kzdjZFM1g4RzRBM3hEMFg5V2c4UERTVGwybGZwclotNm5ya2dsYjAxMjBINlY2eVdtN0VJVnlSNUJNY3lVaXRwbm1jM0RLQkRISUZ0c1ZIc0ZVdC1RUGpLa00wdndvQjlwSU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hotnewhiphop.com",
      "title": "HotNewHipHop"
    }
  },
  {
    "title": "Beyoncé Debuts Dramatic Hair Transformation With Her Shortest Cut in Years in Surprise Super Bowl Photos - instyle.com",
    "description": "Beyoncé Debuts Dramatic Hair Transformation With Her Shortest Cut in Years in Surprise Super Bowl Photos  instyle.comBeyoncé Unveils Blonde Bob Transformation, Her Shortest Look in Years  E! NewsBeyoncé Debuts a Stunning New Bob With a Body-Hugging Ensemble  ELLEBeyoncé Brings Back the Bob (and Stirrups) at the 2026 Super Bowl  W MagazineBeyoncé’s Latest Act? A Blonde Bob  essence.com",
    "published date": "Fri, 13 Feb 2026 15:48:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQdFNkT2t1UG9pWXZra2RIN1VrSXp5QzFNLXhhU3Q1ZHBiaExzNEh2VlFzYkRyQ25uSHR2c3dpd3JlaE02cUZ4bDJzUVRsbjZZZWFXRS1KRURCb0YtcUhScUdQTF9YWU5xNk1DNXl4RDd3Rk5weEE4N19yNnplb2pXY0pmVzg4cG54?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.instyle.com",
      "title": "instyle.com"
    }
  },
  {
    "title": "Canada and Sweden's curling teams swear at each other after a cheating accusation - NBC News",
    "description": "Canada and Sweden's curling teams swear at each other after a cheating accusation  NBC NewsCheating claims, curse words fly in Olympic curling controversy  ESPNCanadian curler at Olympics insists he's no cheat, accuses Swedish team of 'premeditated' attack  ABC7 Los AngelesCursing and cheating accusations: The feisty curling saga that’s heating up at the Winter Olympics  CNNRule violations clarification following men’s session four in Cortina  World Curling",
    "published date": "Sat, 14 Feb 2026 18:17:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQa29YZkNsZ1FpMHlyeWY1dGREelg2LTNTd1JxVndHektKekR3QVZYcGg0U1J4RGZQN2ZqVURTdWNkdzlQN0FWaER3X0FzUXlHMThuWWI1b2lxbHpZME1McTRHN2M2OWowUmVkZ2loUWI0Q1g5bFc5LXlqM2R6R0U5STFqWlFwaXE1VjMwbGp5WlNRZ0ktLXl2ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "2026 NFL Mock Draft 2.0: Jets pass on QB - New York Post",
    "description": "2026 NFL Mock Draft 2.0: Jets pass on QB  New York Post2026 NFL mock draft: Yates' first-round pick predictions  ESPNMock Draft 2.0: A Mendoza-Raiders Marriage, the Jets’ Edge, and More Round 1 Predictions  The McShay Report2026 NFL mock draft: Projecting all 32 first-round picks after Seahawks' Super Bowl win  CBS SportsDan Parr 2026 NFL mock draft 1.0: Jets trade back into Round 1 for QB; Commanders go RB  NFL.com",
    "published date": "Sat, 14 Feb 2026 15:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNT0F0SWpxd041Rm03UWRBZEpjamQ1aXRnVEYtOTh0X1J6Qm13U3Z6NUdPQTVtbi1sbzVuUjVXYWZKU2NpQ3dSVnBNNWZydGIxQk1ETE5jN25KSTM3d2dyNkZmZVhFZ0oyU0pVdElBZ1JqUHpYMFFsRGNXbnNzS3RXUHEwVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’ - MMA Fighting",
    "description": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’  MMA FightingPic! Charles Oliveira looks incredibly ripped for ‘BMF’ title fight | UFC 326  Yahoo SportsCharles Oliveira's 'hunger' questioned ahead of UFC 326 fight against motivated Max Holloway  Bloody ElbowDoctors Said Charles Oliveira Couldn't Play Soccer, Now He's Fighting For BMF At UFC 326  MMANews.comMax Holloway heaps praise on Charles Oliveria ahead of UFC 326 clash  Sherdog",
    "published date": "Sat, 14 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNVklYaXdFX2w4N2JWOERud2V3NnYtcVRVazRwR3B3SDdnYTdUeW9oeUFmaW5QSDNnTkhBWWpHa19pNDFZZkhVQVh0d1huaWd2WTFEOFRLTF9qRlRZckhjajloNFUyMmExWE9wOTc2UHdKZkkwZXdTal9QZW85NzN3ZEpOcE5QcUxhUkRJOS1nel9ISDRmQ3ZuY1E1LV83TG1PTDhHQVpvcnR5UWJObnhRUmwwVnNLVkZEbWNOSTl4SEtiY2xnVi04blMyUGk0WVRlLXNHakZJQm1sTmZRVW52TFNCQVRFUng1TDI3TVhjc3JEWFEx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "College Basketball Picks Today: Greg Peterson Best Bets for Saturday, February 14 - VSiN",
    "description": "College Basketball Picks Today: Greg Peterson Best Bets for Saturday, February 14  VSiNCollege basketball picks: Predictions for Duke vs. Clemson, Kentucky vs. Florida, more top 25 games Saturday  CBS SportsCollege Basketball Betting Picks Today: Best Bets for Saturday, February 14, 2026  RotoWireDuke-Clemson, Kansas-Iowa State lead college basketball games this weekend  USA TodayCollege Basketball Picks: The Undervalued Team to Bet & More Saturday NCAAB Best Bets  Action Network",
    "published date": "Sat, 14 Feb 2026 04:35:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQMVdGSWFtRDcyNmN4eU9Fd2tkcmVRVDgzNHpGV1FrZ3gzWVdDXzJadHFlTnJRVEFKaTFmeFJxd0Y4RHVrMUFrd0VTLUc0d2kxS3M2VnlYRU9xNGlfYU9vck1ONEs5SXl3NWVKaWdVMksxb3lNWG05MVVSS0g1STN6djM2VWhVNVJXeVR6eDBERnBFVHdTaEMxejFwZGViYVI3T29UZTBSSXQtT28tUVAtR1hSUzg1TG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vsin.com",
      "title": "VSiN"
    }
  },
  {
    "title": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts - Space",
    "description": "SpaceX Crew-12 mission latest news: It's docking day for Dragon astronauts  SpaceNASA’s SpaceX Crew-12 Launches to International Space Station  NASA (.gov)SpaceX and NASA launch astronauts to relieve bare-bones crew at ISS  CNNPHOTOS: Crew-12 launch lights up morning sky over the First Coast  firstcoastnews.com‘Very lucky day’: NASA, SpaceX ace astronaut launch to the space station on Friday the 13th  Spaceflight Now",
    "published date": "Sat, 14 Feb 2026 20:05:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdGdReVYta0tjRjExS2RkYWZsb1Yyb1Z3ZzMzcUxqNWhsWTdNY21qVUFrX0dzRmFSMUdkUXlIdmNIeFlwSE9TZ1RURkVXdHlocU5XMmtSem9mSjdneUtqMW1hanZrajE3ME5QMC1yRVpIdE4zM1ROZl9OMjdqMTU0eGJlUVBWWkNjem83OUVtYzZFQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Astronomers watch a massive star collapse into a black hole without a supernova - ScienceDaily",
    "description": "Astronomers watch a massive star collapse into a black hole without a supernova  ScienceDailyAstronomers witness vanishing star collapse into a black hole in Andromeda galaxy  SpaceAstronomers observe a star that quietly transformed into a black hole  ReutersScientists Intrigued as Prominent Star Suddenly Winks Out of Existence  FuturismHow did an entire star vanish in the galaxy next door? A black hole may be to blame  Scientific American",
    "published date": "Sat, 14 Feb 2026 05:44:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBxSjFkMjBIVGlkQnhDOElaaG9GaVJZZUUtMmlKZm5xdW5HQ0tiTFlzWVZfci01V3M2NjlDSWkydHM2czl1N1RYX1BPWjVjMkVBdG9XU3c1aVNqU0ZWTWhTcXhMcDhzbE1jcmNoR1U3MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencedaily.com",
      "title": "ScienceDaily"
    }
  },
  {
    "title": "NASA Selects Vast for Sixth Private Mission to Space Station - NASA (.gov)",
    "description": "NASA Selects Vast for Sixth Private Mission to Space Station  NASA (.gov)Vast wins ISS private astronaut mission  SpaceNewsSpacecraft company in Mojave wins invitation to International Space Station  Bakersfield.comAxiom Space wins NASA contract for fifth private mission, lands $350M in financing  InnovationMapNASA Awards Vast Private Mission To ISS  Aviation Week",
    "published date": "Thu, 12 Feb 2026 21:15:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQdmhCS3hCeDc0MGI2OHkzTUg4ejQwRUtQdDNnMzJyS0F1VzlTdlB6dXVCZ1RtUDZJODRpcTFub3FZTUJjdlpnRG1jVFU1OVdmUnoteHowTDJ0QjR3MTVoSmtORjRFN0V3MUt4Z3N5OTdqb3M1azlSVXJEZmFkbjRscmhLMzdTZWVnUm8wZ0xILVJBR0hLeVVIMGxrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "Scientists have discovered one of elephants’ most sensitive secrets - The Washington Post",
    "description": "Scientists have discovered one of elephants’ most sensitive secrets  The Washington PostAn Elephant Is Blind Without Its Whiskers - The New York Times  The New York TimesAn Elephant's Trunk Is Covered in Whiskers—and They're Unlike Those on Any Other Animal, a New Study Suggests  Smithsonian MagazineElephant trunk whiskers exhibit material intelligence, revealing the secret behind an amazing sense of touch  Phys.orgHow the elephant got its stiff whiskers  Scientific American",
    "published date": "Fri, 13 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBDeHNCVkQwNnA4NFVwZW1KaFdOX2JSSnVFMzF2RkpSZW5IR09idDFhREtxWFJKU1NreXZxZGFwdHo1OElVSWtuMG1EYzhvV1JNMHR0SE5PY2J6R0p2ZUdCbGYzelpFSXc0MUphVGNremNmUndSWUpZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says - EatingWell",
    "description": "Coffee or Tea? One May Be Better at Preventing Dementia, New Study Says  EatingWell2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf. - The New York Times  The New York TimesDrinking 2-3 cups of coffee a day tied to lower dementia risk  Harvard GazetteWhat to know about a new study on coffee, tea, caffeine and dementia risk  CBS News",
    "published date": "Fri, 13 Feb 2026 00:55:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1CcENJMXh2REwtb2JVY2NNOXlYNXA3UGZ6RFBjb29faXplRFV0ZUdUMzVBQjlUUzZTMzlrbElOeWxjcUxaNzhSU1htSFAwekszTVdaa3VVWEpROGp1bEkzV1hNbEQzMGpWNmh6cC13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eatingwell.com",
      "title": "EatingWell"
    }
  },
  {
    "title": "Mehmet Oz's vaccine call is 'too little, too late' - DW.com",
    "description": "Mehmet Oz's vaccine call is 'too little, too late'  DW.comOz Offers Forceful Call for Vaccination as Measles Becomes More Dire  The New York TimesMeasles cases in US top 900 as CDC confirms infections in 24 states  KOMOIs measles rising in your state? See case map, weekly outbreak numbers  USA TodaySix measles cases confirmed in Lancaster County | New report  WGAL",
    "published date": "Sat, 14 Feb 2026 11:05:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPQlZsWktPa0o4TGgzTkVTRkdIeUZKbFp3U1pyZ1RQTDAwWWFENTdHOHRhMDhVUjVwQnFHMUdsaFVUUkJqRkk2OGJCN0JIMnp5VHYwNHZTNXFjWUNEaDV1TDZjaS1YbHBWU1REVU1Sc005bXBoYXlFWHQwZ0RXTFRHNTRHakttanNzSGJQU1otX1lMSlBEcmJWQjNkVGlTLVE3MkROa2dNTnMzRkowcTdmNURBMFhDYjFTQUYyT25wS2hlTjZM0gHEAUFVX3lxTFBHZVowQTVzQ0tONjlNdnp0OEVzUFNWdl9DX01ZXzZRVXVjb0lNQjJLMzY2V19Ic0NMYnlhX0VhcDJwdFFjQWVHVEVHbVhZOXlLcWQ4MW1fSGNiS09jQ0d0Z29YZWhuWkRQY0NyWkJ6NHQ3MGZybTFMd0JtZlRoOS0wY25pMVpuV29iQlBjUmxuZVZEdnhQR09PTklfUUhjWTFzM3RCX3RYLU0zazBZTHhMVzdxZU9jYzV6clNOY1BlUFhkeVI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Measles Outbreak Hits Ave Maria University in Florida - The New York Times - The New York Times",
    "description": "Measles Outbreak Hits Ave Maria University in Florida - The New York Times  The New York TimesAve Maria University battles measles outbreak  National Catholic ReporterStudents hit by measles outbreak at Florida university  USA TodayMedical professionals provide overnight testing for measles outbreak  WINK NewsFlorida health department's updated measles numbers shy of Ave Maria report  WUSF",
    "published date": "Fri, 13 Feb 2026 23:26:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNdmE3ZC1keXZvaUplWWR6cEpDUW9FVF91cUdwQW5jOHkzY19BT19JdkNxNXhPSmg0aE0ySjRtbWVFT0NfRHZpTlFBVk1fZ0xfcEd4VmVsMVQtQW9EaTZ5NFNBRG5PbWV2MkVqOFZ0bUJzbjFBVl9nWFJkc2QzMHlXYjF0NTY1SXFI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "5 ways losing love affects you and what an expert says you can do to start feeling better - CNN",
    "description": "5 ways losing love affects you and what an expert says you can do to start feeling better  CNNCan you die from a broken heart? Louisville doctor explains the warning signs  WDRBDoctors warn of ‘broken heart syndrome’ spike around Valentine’s Day  WWLPHeartache isn’t just emotional  The Desert ReviewOrlando health cardiologist explains realities of 'broken heart syndrome'  WESH",
    "published date": "Sat, 14 Feb 2026 15:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFAwa2hOX0wteDNOeVFDdXh4VkpIajhGM2Y4VHZkd1Z0eHpnN2xIWGdzc080LVpsQzR5czJHSTdGUE5salJ0Q3piQjl3eldVSGJaU2E0TWVTTmNQX1RNalVlMmlQNmRwZTBmS2lBa3d0ZmRDV3c0QWdpRVVLU1VCdmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  }
]