[
  {
    "title": "What We Know About the El Paso Airspace Shutdown - The New York Times",
    "description": "What We Know About the El Paso Airspace Shutdown  The New York TimesBorder Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser  The New York TimesFAA lifts El Paso airspace closure after cartel drone breach, federal officials say  KFOXEl Paso airport grounding was in response to testing of U.S. military technology, sources say  NBC NewsCruz calls for classified briefing after Texas airspace closure  Politico",
    "published date": "Thu, 12 Feb 2026 06:21:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPYnNoRkgtZ3MtREg1OFVtQmpiSXhUajQ3UnE4SFZZRWQ0eWZwLU0yLTNrVUw0UzkyMzJ3SjhuUWN0SE85dEJYYlI0STJaNUxHWnpUTFlqLXRodER6QmljY2hrNzk3cnIzWGlkNnlZSVh3QnhtMmhZMXVHUjJLYWxwUmR3d1FXdjRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "A privacy breach at the IRS: Taxpayer data wrongly shared with DHS, court filing says - AP News",
    "description": "A privacy breach at the IRS: Taxpayer data wrongly shared with DHS, court filing says  AP NewsIRS improperly disclosed confidential immigrant tax data to DHS  The Washington PostIRS improperly disclosed immigrant tax data to DHS: Report  The HillIRS erroneously shared confidential immigrant taxpayer data with DHS: court filing  Fox NewsIRS improperly disclosed confidential immigrant tax data to DHS, Washington Post says  Reuters",
    "published date": "Wed, 11 Feb 2026 23:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNOGM0MnQ0enpLSlhITGZ6MVNqSzdRWGJBaUVHdER0ZGN0bkF1MWNkbXFjXy1pTmRjR3hEei16cGZDdkhpVlE2WG0zLU1OZHFSdTEzUHRKX1d5dDY5a1lfcHdIdmI2aUdPN3BDNlBvVEN3SVpDZHBWamZXWUxaQV9XWFFkUWJUVG9rSG9fVHVWVlh4WV8y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now - Axios",
    "description": "Trump to Netanyahu: U.S. prefers deal with Iran to war, for now  AxiosTrump says no 'definitive' agreement with Netanyahu, US talks with Iran to continue  ReutersIran’s Larijani accuses Israel of trying to sabotage US negotiations  Al JazeeraIran’s Missile Program Tops Israel’s Concerns as Netanyahu Meets Trump  The New York TimesLive updates: Trump meets with Netanyahu to discuss Iran relations as uproar grows over Epstein files | CNN Politics  CNN",
    "published date": "Thu, 12 Feb 2026 03:34:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA0QUd3U3ZWUi1wNmRKeXNoVWVDaExGTmlZQkRVcV9COTBWbEczOHBqRHdOak5icDhpVEJlLWFTNG1nUWFWMzJ4cFI3NTl2QmV2YU5TVGZId3pKeDloaGJnREo5YnlKdXJKc0txZ2l3T3dfenpXLTRNeU1aT2dmWUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Governors association says all members now invited to White House meeting as Trump defends exclusion of Moore and Polis - CNN",
    "description": "Governors association says all members now invited to White House meeting as Trump defends exclusion of Moore and Polis  CNNTrump says governors from both parties are invited to White House events, except 2 Democrats  CBS NewsTrump says all Democratic governors except Wes Moore and Jared Polis are invited to White House meeting  NBC NewsTrump Says He Will Now Invite Democrats to Governors’ Meeting  The New York TimesDemocratic governors pledge to boycott White House events after a Trump snub  Politico",
    "published date": "Thu, 12 Feb 2026 01:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNcS1iUWNWT21ya2xwemFnUzZMdmRJOHNaeVhPeTJ0Wk9CeXktOVNyTmk4aEF4U1hzakpZZVRHV0EwcG9wc0xmbDFURk80S0tMMEphbTlOLU9GOTNQRk5GQjAzVHFIb2VxXzFiTEdhM01zT2RpZllPSy01aFE4b2xNSzdkWFpZSFFIZzJNWUZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "S.F. teachers strike: Schools closed again Thursday as talks continue - San Francisco Chronicle",
    "description": "S.F. teachers strike: Schools closed again Thursday as talks continue  San Francisco ChronicleS.F. teachers strike: Schools to close for 4th day, negotiations slow  Mission LocalHow long could the San Francisco Unified School District teachers' strike actually last?  ABC7 San FranciscoThe SFUSD Teachers Strike Goes On. Here’s What It’ll Take to End It  KQEDSan Francisco parents hold virtual roundtable to talk about ongoing teachers' strike  CBS News",
    "published date": "Thu, 12 Feb 2026 02:18:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBlNU5NaFBvaFhibnR0NVJNMDJ1bTVUQjh2WTBFS0tKRVF6cnhCNVNRWllvcWEwY0M0d1hyZG1LR3JjaHV6QWc3RFZ2dXB5YXVYWVpITXgzbnh6R2xFVGhTbk5FUWNqbWhZT3NHdHNleGo1b1NQVzVKNnJTUjZpUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "US Energy Secretary Chris Wright visits Venezuela to assess oil industry overhaul - AP News",
    "description": "US Energy Secretary Chris Wright visits Venezuela to assess oil industry overhaul  AP NewsTrump administration moves closer to opening Venezuela to more US oil producers  PoliticoUS Energy Secretary Chris Wright touts oil production on Venezuela visit  Al JazeeraVenezuelan oil output could return to pre-blockade level by mid-2026, EIA says  ReutersTreasury Allows U.S. Companies to Provide Supplies to Venezuela for Oil Production  The Wall Street Journal",
    "published date": "Thu, 12 Feb 2026 03:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOZ2VUMmpKY0NUYVVkLXBpUHM0OVYxRUZwZHlGNEFaVGxpSGhGZVJTMzlDMTVlNjBDYV9lTzRtQnBWREJJc2FQVDFVR2lTN1UwYTZLVE5FU21KcktRRHdjM2FwcXBwMXgtekh4YWtwRXM0UjVWOE9hN1ZNSHU0akxWanRTY19oSEpndzRObXU0cVltNFFfeC1YeTdfUkxGS05EYUhZdQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "These monks' walk for peace captivated Americans. It ends this week - NPR",
    "description": "These monks' walk for peace captivated Americans. It ends this week  NPRMonks bring balm for America’s wounds as Washington cheers peace odyssey  The GuardianWatch: Monks finish 'Walk for Peace' in Washington DC  BBC‘We show respect': Police officer goes viral for greeting monks with a bow  NBC4 WashingtonAnnapolis To Host Walk for Peace Monks On February 12  Eye On Annapolis",
    "published date": "Wed, 11 Feb 2026 22:13:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQX0MxaWRHTEd1MU41al9kSExpZkNDUEF1TGtPOUo0ZTlMemtXZDlmMWxPRDBEWk1tR1hkcVJnN1RQQWkxSVp6d3gzRTUtaGlDQ3FWVzhSNmtUV0FKaVFOZTBQNjl2S0JvUlZPZjdjbmFVRTZZZTBnbDU4V3ZCR1czeDRYazY2R2pJX2JER1FzdFVqVDhhZmZHV3h2YnVtZGZWeGo0VnN4V2txdGNsSUExa1c4cHVOd2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump orders Pentagon to buy coal power as the polluting fuel struggles to survive - The Washington Post",
    "description": "Trump orders Pentagon to buy coal power as the polluting fuel struggles to survive  The Washington PostTrump orders Pentagon to buy electricity from coal plants  AxiosTrump Orders Dept. of Defense to Buy Electricity From Coal Sources  The New York TimesPresident Trump Receives \"Undisputed Champion of Coal\" Award  C-SPANTrump orders Pentagon to buy power from coal plants  CNBC",
    "published date": "Thu, 12 Feb 2026 07:14:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNbTVGY3BUdU83cndPdnNsdUl2aFBFNDVIa2lwMExZbUQ2bnhMMDFTcW0wcV9NckYzdjU2MDA1ZmhJaWVrRVlTcGFVeWZjNFN3Sl84QVNSb1h0cGpIRzVaWVVfVmQycXl4bUplZkM4N3ZBa0lkbkpGNmhCVE5ldFh5OTBzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Russia sends 'hundreds' of missiles, drones at Ukraine - Reuters",
    "description": "Russia sends 'hundreds' of missiles, drones at Ukraine  ReutersRussia-Ukraine war: List of key events, day 1,449  Al JazeeraRussia’s Lightning Attack Drone Looks Like Trash, But It’s Deadly  Popular MechanicsUkrainian air defences intercept 15 Russian Iskander missiles and almost 200 drones, 13 hits recorded  YahooKyiv’s Left Bank targeted in Russian missile-drone attack, two civilians injured  Ukrinform",
    "published date": "Thu, 12 Feb 2026 01:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNN1V5V0Y0R3BaSVBtaXNxOHJOekpNLUZFZko1ZDk4SG00ekZKWjVyTkkzS280MEpIWGhQWXRZNmxjWmRuV1pYNi1LbVZzZFFhVUtTY19tU05mQlBVUXl6ZkJ0cElGUHd2ZTBuMXFtN3FlVmV6N0hkWFNMYUxKeGhtQTdOSVYwTE83ek1nMFhEVTQ5UFRWT1RJV29XbDRSYjg4cEd4UHNKTTJzc1o2dDBCRDJZMnl4a252VG9wNjlMNlg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "WhatsApp says Russia tried to fully block service to push state app - Reuters",
    "description": "WhatsApp says Russia tried to fully block service to push state app  ReutersRussia moves to block WhatsApp in messaging app crackdown  BBCRussia attempts to block WhatsApp in major crackdown  The IndependentRussia attempted to ‘fully block’ WhatsApp, Meta-owned company says  The GuardianRussian soldiers rage against Putin’s Telegram ban  The Telegraph",
    "published date": "Thu, 12 Feb 2026 00:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPY1B6d01VMFYwVE85b001TTZXOU9Lb0VDYjYzTkI3NWN1QVlKdEVzWWUzb1ZwRFl6Y2tOV2wtLTJ6ci1NMHNiX1Nld1h6Z0Iyd2ZnNlZuS2dPMXdDM2NXTHlPYkc0Z0pFYUNveXFtb2t4TGp4RVBEbmwzbWhRaUdyaGJaOWxwUnNtcmlzYmNRUVZSQ3RvZGt0LVBTRnJRRXpWSU1aODBCbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "NATO deploys to Greenland to keep Trump onside - politico.eu",
    "description": "NATO deploys to Greenland to keep Trump onside  politico.euNATO launches Arctic Sentry military effort in seeking to move on from Greenland dispute  NBC NewsUK will bolster troops in Norway to counter Russian threat  BBCNATO begins 'Arctic Sentry' mission to secure region  dw.comNATO Is Expected to Step Up Arctic Security. Here’s Why.  The New York Times",
    "published date": "Thu, 12 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPbm9tM3ItbnJka0tGOUh4aDV4QVFobE5HSTV0anp1d1dFV3FyR1c0dTRMUWpEbEg2RGY3UWtuYV9aZFZvRk5RVWhhSnFaRU44WFN2X1BlU1NCdDNHSXRkSmtQLTZMWTlTOVQxYzM3Wi1DSXFfd2pPWk5FejZnZC02RmtJTHJ1WmhSd3U5bW83ZGZoYTJpYWpuMnd2ZU5UVXV0bHlrbGZuTlJoaGs3ZUV6c0RKTmlPNXFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Argentine workers clash with police as senators debate labor reform, in photos - Yahoo",
    "description": "Argentine workers clash with police as senators debate labor reform, in photos  YahooArgentina’s Senate backs President Milei’s contentious labor overhaul after protests  AP NewsProtesters clash with police over bid to restrict Argentina’s labour rights  Al JazeeraArgentina Senators Pass Milei’s Labor Reform in Key First Step  BloombergMilei's labor reform drive sets up clash with Argentina unions  Reuters",
    "published date": "Thu, 12 Feb 2026 01:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxONDF2S2hDZ05OUzFzdzJYNmFEUTFraThKUVlkMGVzM0trX2F0WHdVN0lReTJZZm81Tmt3SG41SEtrbTJPM2k4SU1VSGtYOFFaRFVzQzlaVVJxaGt0c0k3OFVNUTZWaHVxRjJjNWxEVnBZME5jSWVtdndhWnVfLWpBbjJQQlYyQnZmS1dBak5tVVJTUjB3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Instagram Chief Says Social Media Is Not ‘Clinically Addictive’ in Landmark Trial - The New York Times",
    "description": "Instagram Chief Says Social Media Is Not ‘Clinically Addictive’ in Landmark Trial  The New York TimesInstagram chief denies social media can be ‘clinically addictive’ in landmark case  CNNInstagram boss: 16 hours of daily use is 'problematic,' not addiction  BBCStanford psychiatrist testifies in California trial that social media platforms are designed to be addictive  Fox BusinessInstagram chief defends youth mental health decisions at trial  Reuters",
    "published date": "Wed, 11 Feb 2026 20:23:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOczdhVTlBTFBpT2l3TXBuVHJHRzhnY2tJSmxaUmpQeVFVT25nUm1mWHZSbUh5aXFDM3B0MlZtRWN4M1dEYl9oVzd4c1NDTzJUeGE0M3VWVldHY2JqZUdRVUQzZG0wQlVTMEMxbC1wQ2R2bVJERkU1SXFmci02LW9KV0c5dnJxN1JLUjh5c3VnU3Z6YnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Job Growth Was Overstated, New Data Shows - The New York Times",
    "description": "Job Growth Was Overstated, New Data Shows  The New York TimesU.S. added 130,000 jobs in January, but labor market growth stalled in 2025  NBC NewsA million US jobs disappeared overnight. What happened?  The Boston GlobeRevised economic numbers inject uncertainty into jobs market  PBSNew report shows 2025 was even worse for U.S. job market than we thought  MS NOW",
    "published date": "Wed, 11 Feb 2026 19:03:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNV2Q5ZGlZRVMzN29ZZFNqYWtTSU1GcWxQVTB1TjhDVFpqYTNBUjA5M0RGUF95Rlk3TWM0VUFQbEVsc3l3bXVkMkNUSzRPZjhiN0NOT3ViQVU3dXFkaDZtazFTV1o3NFZxbTRUVThEUDNPdy1sdWVYSzBDLXJwTnpQemFVTGE1UWJUdkZfZ3hCQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Washington Post editor acknowledges ‘genuine trauma’ over mass layoffs - The Guardian",
    "description": "Washington Post editor acknowledges ‘genuine trauma’ over mass layoffs  The GuardianThe End of Books Coverage at the Washington Post  The New YorkerThe Murder of The Washington Post  The AtlanticDarkness descends with Washington Post mass layoffs  The HillThe 51st is expanding  The 51st",
    "published date": "Wed, 11 Feb 2026 22:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQUGhYd1l1ZnItaUJMWXYwRnZqb2kwMjhMNXJWbUYwYmhHNkg1bmxDWGNUUTNZM1dnSWdnWUNoemYtT0JmcVhycTVfQUZHSmY3SWd2SnZRUkpFaWZaUmstRDJBWDd0NnRtRFhRd2dHeEsyMjdKdW00dTUxdVlUQmxBZE1VaTB1TU1u?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Hims is in the crosshairs. Is a crackdown coming for compounding? - statnews.com",
    "description": "Hims is in the crosshairs. Is a crackdown coming for compounding?  statnews.comNovo Nordisk sues Hims & Hers over copycat versions of Wegovy drugs; Hims stock falls 18%  CNBCHims retreats from weight loss pill launch as Novo, FDA pressure mounts  Fierce PharmaNovo Nordisk opens new front with patent suit over Hims’ Wegovy copies  ReutersHIMS Dips 55.8% in 3 Months: Should You Still Hold the Stock or Sell?  Yahoo Finance",
    "published date": "Wed, 11 Feb 2026 09:37:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPWlVnaHZZRzNDUVhOYWVUSVdtUGVlTWNPd2ZJQ1Riem0tMEdPem9raU9tanZJR1U1WlNRUVI5eGxmNFBQbEdtdUE5X0JicHBsTzJFQzVkaVNFZHZEdkwtUnBCSDFQamg1Y3VtZzlyLTZmQndaQW5HMWxvOFU3alN0bFNSOEpUQmpfYUZabUdKM3JJNkE2Uk94dDR0SkxqRjBNYXZ5ZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statnews.com",
      "title": "statnews.com"
    }
  },
  {
    "title": "Here's when the Samsung Galaxy Z TriFold may be back in stock - GSMArena.com news - GSMArena.com",
    "description": "Here's when the Samsung Galaxy Z TriFold may be back in stock - GSMArena.com news  GSMArena.comSamsung will restock the Galaxy Z TriFold in the US later this month  9to5GoogleSamsung’s $2,899 tri-fold phone is coming back to the US this month  PhandroidSamsung brings Galaxy Z TriFold to Japan showrooms  Sammy FansHow many software updates will the Samsung Galaxy Z TriFold receive?  Android Central",
    "published date": "Wed, 11 Feb 2026 20:37:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQc0hqZEl2RWh5bldBdkNuNTk1cUhBaHlDWjQ5VW15WktKLXFUVHZhSEJPY01DLXk5bmlxWm02THlMalRYemw5NFZqWVNLZjVDc283cUNmUHBaVjFlb1R4N05WaVVaUnlXcWNRdVU4OTAyeVZ4MW9jTkM0UVZzcS02ZEdCVXRtLVpJbkV1ZTY5ZTM2bkNXMmZwM2NoUGh1dDBlYUHSAZ4BQVVfeXFMT3c2Skxnb1dUczBrVGxZRHhyaFJEWWRLTGo5RGlJZUlSS09QZEE0bnZjSW1VS2c5ZjFOb2dxTXhKdW52YW5iYnFqcFlZRnJsYjdadzNsOTd3S2hrazRoM1J0UkhCbXd3WjA5Q2V2dWVEZ2E5QkhJQ0dFWUhyRzRRa18wR0JEZnNrOHZwWDBuSnlKNERPUUR2MzhxTmZZbUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gsmarena.com",
      "title": "GSMArena.com"
    }
  },
  {
    "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users - TechCrunch",
    "description": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users  TechCrunchFebruary 2026 Patch Tuesday includes six actively exploited zero-days  MalwarebytesMicrosoft Patches 59 Vulnerabilities Including Six Actively Exploited Zero-Days  The Hacker NewsMicrosoft Confirms Windows Is Under Attack — Update Now  ForbesThe February 2026 Security Update Review  Zero Day Initiative",
    "published date": "Wed, 11 Feb 2026 20:46:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOeWlNdWZERjhzWFV3NHI0Z005MWVZRHRPVUdJYmpQQmhYVEY4ak1OaWhwWUE5S1M5dUQ1aXJ3eVFESUdPWEsyTnZmRl9mcWpSTS1YWVkyUHljd0wxOWtrREFlZjlWNmxJX1p4NjlMM1UtT2NvTVhSVEdTOGg2ZzlYdVM3RVA1Y2RpTXNHT0tuVWw0clNKbTRQSjByUlBQam52NUcybFdUck1iT0pGZS1EenhwM2I4djZfSjQ2YlFzdmdsZkpENFpJSGRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Rules of mysterious ancient board game decoded by AI, scientists say - CBS News",
    "description": "Rules of mysterious ancient board game decoded by AI, scientists say  CBS NewsRules of mysterious ancient Roman board game decoded by AI  Scientific AmericanLudus Coriovalli: using artificial intelligence-driven simulations to identify rules for an ancient board game  Cambridge University Press & AssessmentA Roman-Era Stone Baffled Experts. AI May Have Solved The Mystery.  ScienceAlertAI simulations reveal a Roman era board game in the Netherlands, pushing Europe’s blocking games back centuries  Archaeology News Online Magazine",
    "published date": "Wed, 11 Feb 2026 19:49:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOXzVMTU9XSEZ2WXVqRXo5NEFScjA2RFA3TWJybk42VnZodjFMU1FJVXJ4V1hpSVNCdWh1djVwLTNOSjVscWs1eGlXajdROVpPYnhNVFBGaGVIamJVd2VVYWR6NjlFT0pFdWtqU3g5Unp5LVZMcmxrSEJjTFZnUXEtNHlscmxTb3g1ZkRBaG9wR2bSAZYBQVVfeXFMTVc2a0xNQS1UNTJac2diQ3ZwTUVQM3dfQWIyY2FzOFFxSldCYkRiNzB3Y1YzNlo1YVVqY2xKQTF5NEZXMVlfemVtVkZlMW9PYk9wWE03OHY3VEZZXzMzMVZER3U1UWExSU1CR0dhV19scHM5T2hla1Z0aFpKR1oydGdNcS1lREdKdV9oQjJ0Ujh2RndpYTZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Get the Excellent Sonos Arc Soundbar with Dolby Atmos for Half the Price of an Arc Ultra - IGN",
    "description": "Get the Excellent Sonos Arc Soundbar with Dolby Atmos for Half the Price of an Arc Ultra  IGNSonos Goes Hard on Soundbars Following Its Headphone Deals as the Beam (Gen 2) Crashes to a Record Low  KotakuRare Sonos Arc Ultra soundbar deal drops price by $200 in Amazon offer  PC GuideThe easiest TV audio upgrade is still a Sonos soundbar, and the Beam Gen 2 is 26% off  Digital TrendsSensational Sonos Beam Gen 2 deal slashes 26% off the MSRP but is only available for a limited time  PC Guide",
    "published date": "Wed, 11 Feb 2026 16:45:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQZzdVSEJNeVRTdGdJemQ1RDJzeDNGZ01Fb2hUQUNQdUUzQkYzR0RUbXliV2xCOC1MOWlUT2tlM0ZBdHBqdGRlX1E1N2F2NVNHMF9LMzBCLWRGcFBfb0QwOENJNWxyV1FfZk5GXzc0cmxFaF9HUHFqVUZhcEVvWEJRSXBpOXQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ign.com",
      "title": "IGN"
    }
  },
  {
    "title": "James Van Der Beek, ‘Dawson’s Creek’ Actor, Dies at 48 After Cancer Battle - The New York Times",
    "description": "James Van Der Beek, ‘Dawson’s Creek’ Actor, Dies at 48 After Cancer Battle  The New York TimesJames Van Der Beek's wife launches GoFundMe to help with 'financial strain' following the 'Dawson's Creek' star's death  YahooJames Van Der Beek death latest: Dawson’s Creek co-stars pay tribute to beloved actor after death at 48  The IndependentJames Van Der Beek, ‘Dawson’s Creek’ and ‘Varsity Blues’ star, dead at 48  Fox NewsHow Heartbreak Led James Van Der Beek and Wife Kimberly to Move Kids to Austin, Texas  People.com",
    "published date": "Thu, 12 Feb 2026 07:00:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQNllnWmYtcWZzV2M0SW1SdTZkVVM3aU11VXNFbWF5UkhzRmRER0xfNC1JcTcxOWJ0NEk4RHprUldLSnVxQl92OEZFaUVGaXR4V0ltMFJRTlNGZ1M3NzZONVFlUDczR2xNZU5GZ3R2eVFuaFEtb3ZUSGVzRkZhYmc4R2V0S3UzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "HGTV Cancels 'Rehab Addict' After Star Nicole Curtis Used Racial Slur While Filming Series; Removes Show From HBO Max & Discovery+ - Deadline",
    "description": "HGTV Cancels 'Rehab Addict' After Star Nicole Curtis Used Racial Slur While Filming Series; Removes Show From HBO Max & Discovery+  DeadlineNicole Curtis Apologizes For Using N-Word, Reacts to HGTV Cancelation  TMZPopular HGTV Show Canceled After Host Used Racial Slur  Yahoo'Rehab Addict' Canceled After Nicole Curtis Used Racial Slur While Filming  People.comRead what Curtis has to say about the remark  The Detroit News",
    "published date": "Thu, 12 Feb 2026 01:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPUDE2QlRVcjBySmtCdE5KRzZRUlBsU2ZuaHdFTmhzV3BmeEU1UFN6RlI4V3k3UENRX2p3cjM2QUtnQU5zaS1mVlNoZUttRExOU1Bkd2w0ZFVFZ3JQRTVhUmYxclNlSEotc2FLLVc5LTZzcFNkVUw0d3pJU2dWMmVzYk1KR00xb1dwZ284Qmlod1NiWjJQaFJJbkVlU3BOYkpMRFg2Skx1c1NXUjBXZncyVFZTdTZyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Ja Rule, 50 Cent feud erupts in pillow fight on flight from SFO after Super Bowl LX - San Francisco Chronicle",
    "description": "Ja Rule, 50 Cent feud erupts in pillow fight on flight from SFO after Super Bowl LX  San Francisco ChroniclePillow fight! Ja Rule and Tony Yayo take their beef to new heights during clash on airplane  Los Angeles TimesJa Rule Gets Into Heated Argument With Tony Yayo on Plane, Video Shows  TMZJa Rule Filmed Getting into Shouting Match on Delta Flight That Ends with Him Throwing a Pillow  People.comJa Rule caught on camera getting into heated argument on plane, says he 'popped on these punks'  Yahoo",
    "published date": "Wed, 11 Feb 2026 18:30:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOd3l2Y0UzMlRSbzEyQkd6aXd5c2lNeFB1R000STJ0S3pDdmV5Z1JhYUZKNUx6TC16ZGUxclIyd0R1WHQyVFdrNWpDV0dYVkFyVmhrOFNqU0JONDZGZ3lKMDB2X3hsLXFid216RVY1ME5ld2E5OXJSRzF0SVBTSTltY3BMVDhfU2tJXzZHc3lNdDhZdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Kid Rock Says His Halftime Performance Was “Pre-Recorded but Performed Live” — But That's Not Enough to End the Backlash - Yahoo",
    "description": "Kid Rock Says His Halftime Performance Was “Pre-Recorded but Performed Live” — But That's Not Enough to End the Backlash  YahooHere's what happened at Kid Rock's alternative halftime show  NPRKid Rock fires back at 'haters and fake news' over lip-sync claims from Turning Point halftime performance  Fox NewsAs Bad Bunny Slayed the Super Bowl, Turning Point USA Staged Its Own Weird Little Event  Vanity FairKid Rock Wasn't Lip-Syncing at Turning Point USA Halftime Show as He Says Technical Difficulties at Fault  People.com",
    "published date": "Wed, 11 Feb 2026 18:11:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQSlU1aExOU05tYWpPUjNYRVJlRU1QLWdJRHNaMllmRWw1V05NUTg5aUR2Z0VQemxZYlptMzNnNlBJZ3VRdDRyTm5ER2tUelBNQ3FhWFdIS3RTMTRtVjNaMkRaLVpSQWZCYkQwZlhQQk5qUEhxS09VZW42NThXODVrWTZSVDZ2X2VCM2w4RFUxbHl6cmRQT2xQc2NmNUo1dEdXWFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Norris heads Verstappen and Leclerc on first day in Bahrain - Formula 1",
    "description": "Norris heads Verstappen and Leclerc on first day in Bahrain  Formula 1View Full Coverage on Google News",
    "published date": "Wed, 11 Feb 2026 22:22:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPR2VLS09ocGFfOEJsNFlfUWNoY0NINkt1N3MwdnpQY1pGaHpzNDhYLVZyNEg1cTR3Nk53c2w0dGNUMVR2cXcwRm5oQ2ItejZDOXlrYmdWa0Vmc0FxQzExcDBsMDVIcjNBU3BwWFYzc1prcWhKamY2Tm0temFhdzlZdWJOaG9Lb0tuVlptVjMxVnFRUUlTR0NRVXpXWS0tUy1QN0FRMk5LemdPR0dPN3FjV285c2duTWNkaXRxYzZnV1luRFJMb3NjYm9CZEpLaFIwa0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.formula1.com",
      "title": "Formula 1"
    }
  },
  {
    "title": "‘He’s got that farmer’s strength.’ Ben Ogden, and a silver medal long in the making. - The Washington Post",
    "description": "‘He’s got that farmer’s strength.’ Ben Ogden, and a silver medal long in the making.  The Washington PostIn the Winter Olympic medal count, tiny Vermont is right up there with Canada  The New York TimesVermont’s Ben Ogden follows in his inspiration’s footsteps with first US men’s cross-country skiing medal in 50 years  The Boston Globe‘My needles are waiting’: USA’s Ben Ogden credits knitting habit after cross-country silver  The Guardian5 things to know about former NCAA champion Ben Ogden, who ended Team USA’s 50-year medal XC skiing drought  NCAA.org",
    "published date": "Thu, 12 Feb 2026 05:21:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUjdyZlR4NmFxemE3Y1FNbWgwcmRxdE10Q3U4ZHRSZ2t0TkNkUFVFd29McDNQN25XaDNhRnFJWU9KTUJMdEpyQ2t0WFBxQVNqRmF1T283eUJ1VEwzWjBTSHI4U0RvM2ljRWJwb3JGZ1U2NFdNSmV1RWRGQlM0LXVMNXdfT3p4MkVURTgxVm5rSE5Ya28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Will incoming owner move Trail Blazers out of Portland? Oregon’s governor has thoughts - OregonLive.com",
    "description": "Will incoming owner move Trail Blazers out of Portland? Oregon’s governor has thoughts  OregonLive.comOregon lawmakers hear arguments over plan for state role in Moda Center ownership  KATUInside Portland’s $1.7B climate fund, which is being floated to help fix the Moda Center  Oregon Public Broadcasting - OPBOregon Senate president introduces bill to set framework for Moda Center renovation  KPTVPortland worries Dundon could move Trail Blazers without stadium deal  WRAL",
    "published date": "Wed, 11 Feb 2026 22:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPTU14UFJSTzk3dzFQVEhTUV9MQXJUOXpXY1hJMUZkR3JOUGsxSnBjdE81UlhNT2ZUOUhJNDc1allucUJ5eFY5ci1wRHg3dTUycmFUS2FtaGpaVFktSnRRek5BTHJWX3ZqenRRWU44UDg3d2Zra2kzYnlTck9JRUp3RUdXdlo4Znl0Nmdxb3NONks3QUg0M3FmejlETlZEc3hHQkxlMF9ybWcya1M4bjFCU3R6QzQ0eDR5Mk9MR2NuVVdtWFlldWRjR9IB3AFBVV95cUxQaGhqcUo3bFlmWTBYS1NZeWE1WUZKb0FxRDNmY1MteVVPQUw0X1J3bndCVTQ5ajVaS040QzVQcUo4S1VBTFZhbzhpWVdNZFpJRkFsdGdfVGtoYlNtNDlBd2JkM2FYa0tQVEQ1MW1RMllFZE8wNFpXMVVXQnE2QVlfeUpjQ0ExaGhZb2dDWUd3OUlXVzI1bVlwYngxejVGbFZrSWd0bnB4b3pEWlFXa3F2ZV9OSVpWZUpxNHhxME16YW1oNmsxWVRMYWxDNGZ0VEhiY2NQWnlDNzR3dmo2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "Albert Breer’s Mailbag: How the Bills Can Help Josh Allen in Free Agency - Sports Illustrated",
    "description": "Albert Breer’s Mailbag: How the Bills Can Help Josh Allen in Free Agency  Sports IllustratedEagles Predicted to Trade A.J. Brown to Bills, Boosting Super Bowl Hopes  Yahoo SportsBills could look to a familiar face to help fix one of the biggest issues moving forward, but it could divide the fan base  A to Z SportsNFL Analyst Calls For Bills to Make a Splash in Free Agency, Sign Mike Evans  Heavy SportsNFL analyst believes this AFC East team should call Eagles about A.J. Brown  Eagles Wire",
    "published date": "Wed, 11 Feb 2026 19:27:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPNlJrd2pnRGRvS0dPc0hsdENiT3g4dTFtdS0yQjROblpSenhQMlA0eXotbEtzTlkyZ2tySHJQLUxZcHRmTDFRSUFRMWIzZW9NYWJjT0FkNmxjVWtaR1NVRVJreUltNEJMRjJrRm9IdkVFUUMtbkE4LV95OTMtRTJscFVPMmpXdGFvUGl1ZFN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Radio signal discovered at the center of our galaxy could put Einstein's relativity to the test - Live Science",
    "description": "Radio signal discovered at the center of our galaxy could put Einstein's relativity to the test  Live ScienceResearchers Announce Discovery of a Possible Pulsar in the Milky Way’s Center  Columbia UniversityA Pulsar Might Orbit The Milky Way's Sagittarius A*, In Incredible Test For Einstein’s Relativity  IFLSciencePulsar at the center of the Milky Way will enable unprecedented testing of the theory of relativity  Universe Space TechThe Search for Alien Tech Reveals a Pulsar at the Heart of the Galaxy—And It Could Help Test Einstein’s Theory of Gravity  The Debrief",
    "published date": "Wed, 11 Feb 2026 22:04:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQeDlHZkxtVGhDOFd4WVdpTEFubkJqaUZhY1FkYjE4eGt6cER5TmpHUFlTZkYzMFllb2ZrejdJelNwVlIzVEJLSHRSSDZWOXpuV2xNcVI3Wk9YTWhZNjAtVWJlbDJSS3dfb2xIUE9EUnZsZklQS04zYkxxNXBjR2dnbVZaWm5DTkhQbHRodk1fUktXbWgxUmFCVWhucm56VVlsX0doaC1taWQ1enhiYjRMemtaY1pHLXRBSXF1d0VrRDJBWDB1UkNBSjFRdE9fUGFvdDlKYg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "This Comet Stopped Spinning. Then It Started Rotating Backward. - The New York Times",
    "description": "This Comet Stopped Spinning. Then It Started Rotating Backward.  The New York Times",
    "published date": "Thu, 12 Feb 2026 02:19:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE16eDNDcFY3N0pDRnVpWS1nSC1JamFGdDFkeUNTS0ZxTE1EU0FSak9OY3FZdGxXSDU1V3o5c0ZMalRlOUZyZ0pFQlEtSnFnZnZZSjZnSjVSSVp1M1hJQ3NOYVdCWEtiWEdYdDlFWTBMeWlmRUdVSWRVVHpRS2Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Lost Soviet Luna 9 Moon Lander May Have Been Found - The New York Times",
    "description": "Lost Soviet Luna 9 Moon Lander May Have Been Found  The New York TimesAI Helps Pinpoint the Moon’s First Soft Landing  SETI InstituteA long-lost Soviet spacecraft: AI could finally solve the mystery of Luna 9's landing site  Phys.orgNASA's Lunar Orbiter May Have Spotted Long-Lost Luna 9 Spacecraft, 60 Years After It Vanished  IFLScienceForget Waldo. Where’s Luna 9?  Hackaday",
    "published date": "Wed, 11 Feb 2026 14:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9rdjZrNDR2TXNxQ1o4WjExaDMwQXhrb2p1XzhhWnBWSHBqNVBXaEtoRDFGaXE2dGVkT2JEcnk3YjNVbFI0Y2RyN0VBTS01bi02Tld2bkRQNnRKWDBqT0N5SUNwMjNCN1ZJSF9idnAtQTUxb1FQNnhuODZiZWlTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "NASA's Artemis II Keeps Leaking Liquid Hydrogen, And It's Starting To Cause Problems - bgr.com",
    "description": "NASA's Artemis II Keeps Leaking Liquid Hydrogen, And It's Starting To Cause Problems  bgr.comNASA Conducts Repairs, Analysis Ahead of Next Artemis II Fueling Test  NASA (.gov)Artemis 2 rocket chills with the 'Snow Moon' photo of the day for Feb. 11, 2026  SpaceNASA's Artemis 2 launch date in flux amid delays. Here's what to know  USA TodayHave you got what it takes to go to the Moon?  BBC",
    "published date": "Tue, 10 Feb 2026 21:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPZ3hpbzBsd3FaOExOOTdZTVR5c1JiM1ZCc1FIakhSQ0l0Z29zckttT3JNN0lVdEpFdUl6RkVWQlJtTnhKaW1QUXB6ejcycHhvV1lKUVkzc2NNYnAyekxsUEVMbEI5cnJ1ZVgxdTJIWkF5X0hmZER2ZHhCMjdyMU5EeExsS2l0cGE4RlVsQnE0OGRGcDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bgr.com",
      "title": "bgr.com"
    }
  },
  {
    "title": "Reading and writing can lower dementia risk by almost 40%, study finds - The Guardian",
    "description": "Reading and writing can lower dementia risk by almost 40%, study finds  The GuardianBrain train game may help protect against dementia for up to 20 years  NBC NewsBrain game may reduce risk of Alzheimer’s and other dementias  CNNCognitive Speed Training Linked to Lower Dementia Incidence Up To 20 Years Later  Johns Hopkins MedicineOnly certain types of brain-training exercises reduce dementia risk, large trial reveals  Live Science",
    "published date": "Wed, 11 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOSERFUlhTSGtZc2dIWTk4aFRBNS0zWTdXT1N4bWJKZF9RZUZLb2pLVmRRQVZkeVJnblQxN2dRNExYeFZzYTVEWTNrZGRrZDY1U3ZheHhidzhlWjdVSFlVa0x1OEVGYmxscWFDM3dqdEsxQ1hxaDBheTFXaWQ1NjhaSUtCdGJOeWlzbmlKMm5vVUR2ZVNmQ2RGNEFsWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Top US medical body to review vaccine effectiveness as government ‘abdicates’ responsibility - The Guardian",
    "description": "Top US medical body to review vaccine effectiveness as government ‘abdicates’ responsibility  The GuardianAMA, Vaccine Integrity Project launch vaccine review for next respiratory season  American Medical AssociationTIME100 Health: Michael Osterholm  Time MagazineAMA joins effort to launch vaccine science review amid CDC turmoil  The Washington PostU of M nets partnership with influential doctors association on vaccine guidance  Star Tribune",
    "published date": "Wed, 11 Feb 2026 22:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOOXlHbjhuQzBpX3BJaW1nbXlpd1o5cnJ1cEFOSThZWS1BeDRvY1pJeGpTSVdfaUMyeklKRVZjZGVudHM3azZtckxDaFFQM3NadVFlUzVLdUVQaS1DTDFzQWFVcnRZMUxTcnYxZmZ0akxGbFg0R0JMUTVTcTRjeE9fRk1RRzRSZVpPNHBWUEVqYjZ1OVZj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "South Carolina sees dip in daily measles cases but too early to call slowdown, health official says - Yahoo",
    "description": "South Carolina sees dip in daily measles cases but too early to call slowdown, health official says  Yahoo13 new measles cases in South Carolina as Florida university outbreak grows  CIDRAPDemocratic state senator proposes ending religious exemptions for measles vaccine in SC  WCIVOfficials confirm 13 new measles cases in Upstate outbreak, exposures at two schools  FOX CarolinaBerkeley County schools on alert as measles cases surge in SC  The Daniel Island News",
    "published date": "Wed, 11 Feb 2026 18:30:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQZWlTMWt5anJXY0E2VGpPVzJhVDRoZzFiTkRrQlMtUmYwano4b0lBMm10dTE5dF9WVnVnLWRLS2lPLUJjQTE5cDZwaGh5SmJHVk05X1ZEZzZacG5BNnduMXFwWVBsQ2pDdHZsSXl2VDlkN19ScURtRnZSMWJVY1hTd0s3YTF0NFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious - WINK News",
    "description": "57 cases of measles confirmed at Ave Maria University, 7 currently contagious  WINK NewsCampus measles outbreak grows in Florida  CIDRAPMeasles Cases Spread on College Campuses  Inside Higher EdCity of Jacksonville confirms 5th measles case in Duval County in 2026  News4JAXMeasles is spreading across Florida. The state's updates lag more than a week  WUSF",
    "published date": "Thu, 12 Feb 2026 06:41:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPS0ZMdHI4RjFiR0hSUFJMNG5VaFoxRXZTSTMxM1JRR2FiUHdiOGVuRy1pVWEwSzRBbkpUZlFncUFYQ3ZTSGMwWVdibTBLclpXbDNoRzI2YWtld1o5MUNFSkgwdXd6aFlWMGZwaTdPb1ZyYlNIS3FMdmVaSlJjWW1IR2RXQ1hvMlNZVmNhYy1MSXloT3pTdC1Rc2ZETDZxUGtYMTlWc3FTeWNQRWZkZlUzLUhnRE5KZ0xwSWh2NmhRcGJWRXFUWEVIeGFLVF95MUk2UUM0SEY4ZHEzRzYtTkFBTUNNN1FWMENoZm15RThERVcwd29XSkc4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.winknews.com",
      "title": "WINK News"
    }
  }
]