[
  {
    "title": "Trump says Putin will not attack Ukraine cities during cold week - BBC",
    "description": "Trump says Putin will not attack Ukraine cities during cold week  BBCRussia-Ukraine: Zelenskiy Says He’ll Accept Energy Strikes Truce If Putin Will  BloombergUkraine welcomes Trump’s claimed pause in Russian attacks, but Moscow silent  CNNUkraine's Zelenskiy expects implementation of agreement not to fire on Kyiv  ReutersUkraine war briefing: Zelenskyy and Merz welcome Trump truce claim and condemn Russia attacks  The Guardian",
    "published date": "Thu, 29 Jan 2026 21:21:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1GZVB4bGtfRGZwZDVmSkxGU0Z0NW05Z3dJbUt2LUQwNGtVRUIwcFRwRGlEMjVuTVN6cHlHV2hkNU9hdzNXYVRTSVhNWWZjWUMtQ0lKMUx1Rktrdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video - The New York Times",
    "description": "Newsom Files Civil Rights Complaint Against Dr. Oz Over Fraud Video  The New York TimesDr. Oz video alleging fraud in Van Nuys prompts response from Armenian community  nbclosangeles.comDr. Oz travels to L.A. seeking fraud. Newsom says his findings are ‘baseless and racist allegations’  latimes.comNewsom, Dr. Oz feud intensifies over Armenian 'mafia' hospice fraud claims in Los Angeles  foxla.comNewsom files civil rights complaint accusing Dr. Oz of targeting Armenian Americans  CBS News",
    "published date": "Fri, 30 Jan 2026 02:12:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE00VHJ4NGNHeVZ2Ukd1YlpsaGdEM2pfY2dZZ2FCVllmSGljMWRLYllDcS1LOFVrZEh6NTVRSlRHWHpwUmJaMWc0WjVJTGRvZTNDeFVDM3lEZElhZEN2YW5LSUpIUzBEdVFSQmoxNmRjMW1tN1lKOWJB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Massachusetts on \"razor's edge\" with weekend storm. Maps show best chance for snow, high winds. - CBS News",
    "description": "Massachusetts on \"razor's edge\" with weekend storm. Maps show best chance for snow, high winds.  CBS NewsExtreme cold followed by more weekend snow for parts of Mass.  wcvb.comMAP: Final snow totals, jackpot towns from this week's record-setting winter storm  nbcboston.comWill Mass. get snow on Sunday? Depends on track of intense storm developing offshore  wbur.orgWinter storm watch affecting 3 Massachusetts counties Sunday and Monday – gusts could peak at 55 mph  masslive.com",
    "published date": "Thu, 29 Jan 2026 22:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNREs1Vkt2ZnZGRTJfdTVtZWJ6ajhpRnlsVUpmaGtZVEJmcGZ6SVkwLWNBYldFazdQTkZienVoWm5IMl9mVVdFcVpmbHNCODgzS1RlcGNITGF5ZUxfTWFPRy1LdzhzQUZRbkk0MnhVejRqZEpodE9hTHVMbTR0MHdQWUpGZVB2XzViVGNINTR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Man who squirted apple cider vinegar on Omar is charged with assaulting and intimidating her - AP News",
    "description": "Man who squirted apple cider vinegar on Omar is charged with assaulting and intimidating her  AP NewsOmar says Trump's 'hateful rhetoric' causes threats against her to 'skyrocket'  ABC NewsMan Accused of Squirting Ilhan Omar With Vinegar Is Charged With Assault  The New York TimesTrump, 79, Called Out for ‘Dementia’ After Shocking Smear  The Daily BeastFBI leading investigation after Rep. Ilhan Omar sprayed with substance at Minneapolis town hall  kstp.com",
    "published date": "Thu, 29 Jan 2026 22:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxORVJ4RmJ5T1lVSjZyTkR6NkVOa1pweGUyYU9UektqZkphODFCdHNyZXpuUkRZNEQyRWI2b3VseDR0c243ellzMkowRFl5STdmRkFnd0RJLVpuWmQ1eHhWSk5FcmFmX0RfVXJvOHY5UXFPNjI3eEM0ZC02T1M0ZExJTzctaENTTnRpVTRITmU1TlFlekxjQkdkMGNJMms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Husband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’ - The New York Times",
    "description": "Husband Denies Plot in Double Murder Trial, Calling Accusations ‘Crazy’  The New York TimesHusband in au pair affair testifies on killings of wife, another man. ‘I did not want to shoot him.’  AP NewsClosing arguments Friday in Brendan Banfield trial after he testifies he saw his wife stabbed before shooting attacker  CNNIn 'au pair' double murder trial, Brendan Banfield testifies he confronted stranger fatally stabbing his wife  NBC NewsRecap: In salacious testimony, Banfield details the morning of the killings  nbcwashington.com",
    "published date": "Fri, 30 Jan 2026 02:45:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeU9hY2RCWmNzVmVmQlBFN0RjUnBDcWl5RndFaGk3WnNscmMwc05KUlBSemUycVRkalRIYmRPc0tNUHFNaEJycDdIbmliQ2hSYjBxemN4WHhJN0JyemR2bnZpWW5RY21GSjZKelNYeHdBV1l2T0FQNTFPZzg2OE50cWk4MXJhZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody - mprnews.org",
    "description": "‘I don’t have words’: 2 more kids from Liam Ramos’ Columbia Heights school taken into ICE custody  mprnews.org5-year-old boy taken by ICE in Minneapolis area being held with father at Texas facility  CNNProtesters gather outside Texas facility where detained child Liam Ramos is held  BBCUS congressman meets five-year-old Liam Ramos and his father at ICE detention center – as it happened  The Guardian2 protesters arrested, hit by tear gas near Dilley family detention facility  ksat.com",
    "published date": "Fri, 30 Jan 2026 02:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOdWNaVnpXdVBxTnZybWZvNUg1aEZpV1NqX2hfY2pJVXVQZUZyQVpPaEo1YjM4N1JDOFlqWmNRNmFLa1IxOUNvWmdWOW42b2hhNHlaOVZ4SlZKVnc2cTlLdUxScXNtU0ptWF9BbnR1NXpTdXE5Ni1UalZKUVRHU3JuOV9jd3d3VS1hY0hQbFNKN2RpSWFXOWdlaHhqUHAwS1RTa2k1V2RXcFdybTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mprnews.org",
      "title": "mprnews.org"
    }
  },
  {
    "title": "Melania Cops Ultimate Snub by Trump Family on Her Big Night - The Daily Beast",
    "description": "Melania Cops Ultimate Snub by Trump Family on Her Big Night  The Daily BeastInside the premiere of Melania Trump’s not-documentary documentary  CNNTrump family absent from Melania documentary premiere  The IndependentTrump and First Lady Attend Premiere of ‘Melania’ at Kennedy Center  The New York Times‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling Stone",
    "published date": "Fri, 30 Jan 2026 00:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQQ2Jya3pWT05jMVJHWWZnSDhyQ3VsMk1YRV9sN05VZzNVQVh1VWJQOXFVVEJNaVh2enhwNlNpUGo5TURYaVZZb0hKZFoyT205OHNkNGVDb2piX1d4NXYyRTJYd0JacVRtc0hpa2tUbWZoNS01WHRaUUx3V2lidTFNb2RFZlZxODdScjJmZU1jajlPR0FCMmxCUERUQjBLY3pXN1pqdWxn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Can Silicon Valley make a governor? Matt Mahan is betting yes - Politico",
    "description": "Can Silicon Valley make a governor? Matt Mahan is betting yes  PoliticoSan Jose Mayor Matt Mahan Will Run for California Governor in 2026  The New York TimesSan Jose mayor jumps into governor’s race  sanjosespotlight.comAs Filing Deadline Nears, California Gubernatorial Race Remains Wide Open  Cook Political ReportSan Jose Mayor Matt Mahan running for California governor, entering crowded race  ktvu.com",
    "published date": "Fri, 30 Jan 2026 00:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOTkkwNU5DTmJnaG1jUWx1ak01SVd4RmpFQ1VodThCY2lRYkZnUVp2MkM1emtMMW92cFpac2s3NVA4RGRKTFJ4YkRXVVZQSTZEQzhOYXBYN2hyZVpNVlpjLWJCME40Tm1JVDZDei1LWWV2SjUtQjB0bVhHTVJNM1U1YTVWbVhRdkYxeDg3Z0Y3ZkdvbzBwNDlXXzRkODZodllFQk1kMXJtWEExNmJhYVhN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Noem says her response to Pretti shooting may have been wrong - Politico",
    "description": "Noem says her response to Pretti shooting may have been wrong  PoliticoWhy Democrats won't rush to force Noem impeachment vote  AxiosHow much trouble is Kristi Noem in?  vox.comTrump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting  The New York TimesSen. Jacky Rosen: It's time for my colleagues in the House to impeach Kristi Noem  MS NOW",
    "published date": "Fri, 30 Jan 2026 03:59:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5iUlcyQnl2SW02MkZKN3Z1clhOSGFGQkdydlgwNjc0QkFFM2ZJVFlJVmhwb1lQRWtRa2x3OWtWMjhnT0JaLV9ZazZrYmlOVUgxNkJkYTVMZ2NweTZyQTMzYTJnRTJxaW9uY3I1YVJOc2o0dU5OZERtSU5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Thailand's reformist Natthaphong is frontrunner ahead of February vote, polls show - Reuters",
    "description": "Thailand's reformist Natthaphong is frontrunner ahead of February vote, polls show  ReutersThailand’s Opposition Party Widens Lead Ahead of Tight Election Race  BloombergThailand's largest opposition widens lead over Anutin's party: poll  Nikkei AsiaPeople’s Party maintains commanding lead in national poll  bangkokpost.comThe Roots of the People’s Party’s Pragmatism  fulcrum.sg",
    "published date": "Fri, 30 Jan 2026 02:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNZU1HOFIyem84TFM0V1dOWW9wcDF0NkJCdjNFVW1UbG0zTUo1NHhwcFQ1TlBxT2luTzJ1OFU3YXR6RFN5Vl91enVoWC1QQlRYRnVRc0ZUSDRIdXNGM25ydmVBN3N1SlVCU2VEemwtUEVWQ0E1OUQtdkdQNmdlX0NkTHdtSFBURXpvcFY0T0s3ZUpqUV9kc3N2clg4dzFVNVY0cTJTVnJmVVVGajJLTGFCXy1NNjYta0FIT2hDd2lyQ09JX0tlTkhzamZmdDk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "The meaning of Xi’s military purge - Financial Times",
    "description": "The meaning of Xi’s military purge  Financial TimesExclusive | China’s Top General Accused of Giving Nuclear Secrets to U.S. - WSJ  The Wall Street JournalXi Jinping’s purge should worry the world  The EconomistThe Unsettling Implications of Xi’s Military Purge  Foreign AffairsWhy Xi Jinping Has Purged His Top Military Leaders  Bloomberg",
    "published date": "Fri, 30 Jan 2026 05:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE84VTZmY2xUMk5IZjlIaC1OUXdXUjNWRHFTejR5VHVJcHd1cVhDWDh3bDVPZXpucXRyMHFsQ2FIRUF6b1VwdGVRYVhXUEhLdDNrbXBZeTZURzFTY09PU3RjRFlsT1lNaC1EZk1DWk1tZFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "LDP on track to win standalone majority in general election - The Japan Times",
    "description": "LDP on track to win standalone majority in general election  The Japan TimesTokyo hopes voters will hand PM Takaichi new clout to counter China  ReutersJapan’s Sanae Takaichi is proving a surprisingly popular prime minister  The Washington PostTakaichi’s great election gamble  Financial TimesEarly Polls Show Japan’s Takaichi on Track to Expand Majority  Bloomberg",
    "published date": "Thu, 29 Jan 2026 05:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQUm5pNmdDVGpOanpVM2JxRGcwNkJ0VU85aDFXTnlIOS1CWVVuaS1NNnpuQkZfbDZ3cDVaUU9IMXk2OW1lTnpNbG5GS2FkQ1NrUV9hTjZjaXdsNklwR1NkYlVNcklMQ0lDLXJLX3N4cnhkY2UxYXFPR2VLcE1oTm1KYkp4dTNkb2I2ZlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.japantimes.co.jp",
      "title": "The Japan Times"
    }
  },
  {
    "title": "Something very unexpected is happening to Norway’s polar bears - vox.com",
    "description": "Something very unexpected is happening to Norway’s polar bears  vox.comBody condition among Svalbard Polar bears Ursus maritimus during a period of rapid loss of sea ice | Scientific Reports  NatureThis polar bear population is thriving despite some of the most drastic sea ice loss in the Arctic  ABC NewsPolar bears on Norwegian islands fatter and healthier despite ice loss, scientists say  BBCSvalbard Polar Bears Are Getting Fatter (for Now), Study Finds  The New York Times",
    "published date": "Thu, 29 Jan 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNY1JBX0F5bVZUM2JfcmR3dzVsZERWWEVqdzEzLVZtLW9hWnRBY3dGY0NjajBycXZocUgwY1VGelV1NXBTeThUWEtQeTZ3MFBFM1lKWGJTYVVnY0w3S01fRXdrUGVscS1ZTl9XcGJiM3VVTWRHeldfYklpdG9QcldaMlRNbU4xWnY1eFFfc1RHNEtyUVpWSVlKTmt6eVFsX19HaERObQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "Landmark crypto bill clears Senate hurdle but Democrats withhold support over lack of 'gryfto' rules to prevent Trump family conflicts of interest - Fortune",
    "description": "Landmark crypto bill clears Senate hurdle but Democrats withhold support over lack of 'gryfto' rules to prevent Trump family conflicts of interest  FortuneSenate Ag advances crypto bill along party lines  PoliticoSenate panel passes crypto CFTC regulation bill  CNBCSenate Ag Committee Releases Updated Crypto Market Structure Legislative Text  Davis Wright TremaineCrypto bill advances in US Senate but faces obstacles  Reuters",
    "published date": "Thu, 29 Jan 2026 21:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOWjN4Ymp4a1l0ZlA5OUJPZnlpTEE4QjBLNlNwUWQ5elZBenJTdVU2MDVsYjRtSExQR0ZZZUUwejVfWjRmQ3pUVjR2RHpaVzlSd0tick9qRDNiNGdIcWhRNVNyQmZwWDhubFU0dWVIWW9PZUxYekUzb3E4dVQ3MGpKUmZTTjVITndhUE1DeFo2VnB3SFk2enVMa19Mb0dRMmdTWU1LbWdoNmNKTW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Washington Post Plans Cuts to Reshape Newsroom - The New York Times",
    "description": "Washington Post Plans Cuts to Reshape Newsroom  The New York TimesWashington Post’s White House team urges Jeff Bezos to halt massive newsroom cuts  CNNThe Post's Audience of One  status.newsInside the Washington Post’s Existential Meltdown  New York Magazine‘No one knows anything’: Washington Post staffers fear major cuts  The Guardian",
    "published date": "Fri, 30 Jan 2026 00:54:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOeGpOMXNQb21zVGp6UjJOOXVJWFAtRTRFckt2ak11amdqNHNZUVFIWlNxQ3ZEa05nbW9DMGtvbG1MZmNsdXlYc3hlYmlhYnhyeElZcTNiSEZVVThJaUJyMjd4STZ0V2JOTzZCcWlvRFFxSkw1LWxNUm5ROExPZmM5aUdPbl9vUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Southern District of New York | First Brands Executives Charged With Multibillion-Dollar Fraud - Department of Justice (.gov)",
    "description": "Southern District of New York | First Brands Executives Charged With Multibillion-Dollar Fraud  Department of Justice (.gov)First Brands founder Patrick James and brother Edward indicted on fraud charges  CBS NewsFounder of First Brands, Whose Bankruptcy Spooked Wall St., Is Indicted on Fraud Charges  The New York TimesFirst Brands executives from Northeast Ohio charged in alleged multibillion-dollar fraud scheme  wkyc.comEagle Machining executives arrested on fraud charges, days after Fayette facility closure  13abc.com",
    "published date": "Thu, 29 Jan 2026 16:53:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOR0s0Y3NNU1hENFY0ZUtuOWR5cXM4OVdINGJ0dFhpT3dDNm12ZkhqUVJPSTEwSjZ4ak9LTGNMd0dLWWs1UlJMc2FvRm5QRk55SF9XejF2SVdMR2QxSmEyMTRHRDI1TjRPN3NCNVZZR1VoVXc5dkRtZnd6c3RkQVdINUxZSWN1bGdRdUMtbVJpOG80Y21UMzgxclN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.justice.gov",
      "title": "Department of Justice (.gov)"
    }
  },
  {
    "title": "Ex-Google Engineer Convicted of Stealing A.I. Secrets for Start-Up in China - The New York Times",
    "description": "Ex-Google Engineer Convicted of Stealing A.I. Secrets for Start-Up in China  The New York TimesEx-Google engineer convicted of stealing AI secrets for Chinese companies  ReutersEx-Google engineer found guilty of stealing AI secrets for Chinese companies  Fox BusinessEx-Google engineer convicted of espionage, stealing AI tech  kron4.comJury finds ex-Google engineer guilty of stealing AI trade secrets for Chinese companies  Courthouse News",
    "published date": "Thu, 29 Jan 2026 23:25:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNOG9icWQycXFLaW4tbVN5eFJQNkcyU0E4R0s1cFZZMjVpYXBObGlPSW5BN3N1aGkybnp3bW5YbnljQ3VlenZQVWdzM3loSjNPZGMzdXZ3TGx5WXBNTzVrNThNVnh4ZTlLQnpidmdHOWtZRVdmNE41OHZjU0x6MkVtVnprZkpZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Galaxy Buds 4 and Buds 4 Pro leak brings good news for potential buyers - SamMobile",
    "description": "Galaxy Buds 4 and Buds 4 Pro leak brings good news for potential buyers  SamMobileSamsung's Buds 4 Pro look set to steal the best part of the AirPods Pro 3's launch: no price inflation  TechRadarGalaxy Buds 4 price leak could be a good sign for the US  Android AuthoritySamsung accidentally confirms new wireless earbuds are coming  PhoneArenaSamsung Galaxy Buds4 and Buds4 Pro prices leak - GSMArena.com news  GSMArena.com",
    "published date": "Thu, 29 Jan 2026 05:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE8tVE15dXc3WVhFWW53WjhrMTV5NU9OVXdnOEtjMUEzZXRlak5kYS1ZRG1ROGlXUkZFaHNvbGVJOXFXMUhZXzBpeDlWTUpSZ3ZEb1BuU01sSFFBclZOOTdmSzNuUE1yYVdsTE4wR1UyS0c0Y3N6dXlTdWxn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sammobile.com",
      "title": "SamMobile"
    }
  },
  {
    "title": "An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account - WIRED",
    "description": "An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account  WIREDWhen Children's Conversations Become Data: The Grok AI Toy Breach That Exposed 50,000 Private Chats  WebProNewsSecurity Researcher Finds Exposed Admin Panel For AI Toy  The Cyber ExpressAI toy company exposed over 50,000 chat logs of kids  NewsBytesAI Toy Bondu Exposed 50,000 Child Chat Logs to Anyone  The Tech Buzz",
    "published date": "Thu, 29 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxONVpZMGQ2VUR3bk9YZEhtczdTTmRGNnZaMUN3X2ZuM0VoUHFhcUV4SHdqT1pjTG10UTg4RFdFYTctRVMxZ2tUbDE2SFZSU3dIdTVNZl9heE0zdVFteG04S2VlcEpDMjdKdnplRFNCb3Zwa19IenNka1ZrYldsak1DQS00Mk5sNDdvbzVISlcxWklJRF8wcElybTR1VnJZMjBSc0dGRzZvd1ltSEVPano0RA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Cairn and Peak Capture the Thrill of Climbing Mountains - The New York Times",
    "description": "Cairn and Peak Capture the Thrill of Climbing Mountains  The New York TimesCairn review – obsession, suffering and awe in a climbing game that hits exhausting new heights  The GuardianA Soulslike where survival is everything and a mountain is the boss  PolygonTime to climb a weird mountain in Cairn, the windy backpacking odyssey from the creators of Haven and Furi  Rock Paper ShotgunCairn Review - The Price Of Persistence  Game Informer",
    "published date": "Thu, 29 Jan 2026 10:01:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeE5WaUlDUmV4Q0dVS3N5WGFkQ0Y2ZkNFcFgwTzdWX0VNOGhoX010TmQ2OENFQ183OTFQTmp3emYzYnNMbkVkTGMwTmU3TmJvWFFvM3hURFYtaGlhUHlyYUhEYU9ZanF3OWczQTB5YTBtUUtPa0VDSVFCYVN2S1dPQUVYTDluTHVf?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Your Halo Story | Halo - Official Site (en) - Halo Waypoint",
    "description": "Your Halo Story | Halo - Official Site (en)  Halo WaypointHalo Studios Details ’25 Years of Halo’ Celebrations  XboxEraHalo Silver Anniversary Content Creator Guide Released  filmogaz.comCelebrating 25 Years of Halo | Halo - Official Site (en)  Halo WaypointHalo x MOPOP Supper Fan Club | Halo - Official Site (en)  Halo Waypoint",
    "published date": "Fri, 30 Jan 2026 00:35:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE9wS1p5SS1LLUtIdHRuSUFsNVVqVFB6OXY5SXVzNDlXN2JHZmg0WFNBTFE3S0o5cXlUeG5jMGhxVGRHdXU3VGctX2xVUjUtTERiTHA1dlZSUXU1dzJGWlhISDREcUp0Wm9weGNkcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.halowaypoint.com",
      "title": "Halo Waypoint"
    }
  },
  {
    "title": "'The PItt' Season 2: How Tracy Ifeachor's Character Is Written Out - Deadline",
    "description": "'The PItt' Season 2: How Tracy Ifeachor's Character Is Written Out  Deadline'The Pitt': What happened to Dr. Collins?  Mashable‘The Pitt’ Season 2, Episode 4 Ending Explained: Here's What Actually Happened to Dr. Collins  People.com'The Pitt' Season 2 episodes, schedule, how to watch  USA TodayCan a Doctor Date a Patient? An ER Doctor Reacts to 'The Pitt''s Flirty Season 2 Episode 4 Moment.  Yahoo",
    "published date": "Fri, 30 Jan 2026 03:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNV1dDWmlyNWxZVnFMRWsyVWEzRjF2QWo3RERINTJtRHVyNG15dkQzOUYzZUdnbW5IZ2FjSjNYZHhjaTVGR2tFNFh2SzQ4eWJ2elM3LXVnZ1J3THdiSm5CTWxoNVEtbDUyYUhsN1hfaHpwWnBSR0JGTnB3ZmpyOElxdHE2Qm5BM0otMEpPcnRpU1pwdWdLdzVpdEhTRUlRN0I3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke - TMZ",
    "description": "'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke  TMZQuinton Aaron on life support; 'Blind Side' actor 'opened' eyes, wife says  USA Today'Blind Side' Actor Quinton Aaron Hospitalized After Falling At Home  TMZ'The Blind Side' Star Quinton Aaron Suffered Spinal Stroke and Is Now 'Alert, Aware and Recovering'  Rolling Stone‘Blind Side’ star Quinton Aaron on life support after severe blood infection, wife says he's 'a fighter'  Fox News",
    "published date": "Fri, 30 Jan 2026 00:55:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1XRHVncGpxckhyZHlRd042d1F2QTU0d0UzejhacVRoV2ctZHFleFRXMDk4cXM0MHVpY25kdTZfVjQ2aUxWaFl1MXBLMC0tQmZqQk5fSnBZTml3NkdUM3BseXl6WWtJT1phSlNZcUVZc2Z2R0N1V1pF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tmz.com",
      "title": "TMZ"
    }
  },
  {
    "title": "Shirley Raines, 58, Who Gave L.A.’s Homeless Food and Makeovers, Dies - The New York Times",
    "description": "Shirley Raines, 58, Who Gave L.A.’s Homeless Food and Makeovers, Dies  The New York TimesSocial media star Shirley Raines dies after years helping homeless in LA  The GuardianMs. Shirley Raines, Beauty 2 The Streetz founder who cared for the homeless on Skid Row and in Nevada, dies at 58  abc7.comShirley Raines, homeless advocate on Skid Row and nonprofit founder, dies at 58  latimes.comShirley Raines, who fed and cared for the homeless of Skid Row, dies at 58  The Washington Post",
    "published date": "Fri, 30 Jan 2026 03:14:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4b2UyYWpYdWNlQVNUZGNhY2EzWVNIb3p4Nk80N2JqNDhoZHEtQ3dVZnI2bmRYQnJpbVpSeWZTLV9WQlpJcTg0R3lJcGpldlRBVWhxRGVFd3U1bFpWVXZUWTdCdHNjMmFXS3pyTWVVWTZqcmo1SjhmRDVsNEd3MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘Everyone Is So Jaded About Everything’ - Vulture",
    "description": "‘Everyone Is So Jaded About Everything’  VultureBad Bunny vs. Kendrick Lamar vs. Lady Gaga! Who Should Win at the Grammys.  The New York TimesGonna be golden? Who will – and should – win the big awards at the 2026 Grammys  The GuardianWhat to expect from the 2026 Grammy Awards  latimes.comGrammys 2026: How to watch and everything to know  ABC News",
    "published date": "Thu, 29 Jan 2026 18:00:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE11WkQzSFlmckQzYV9lUXR3OFdBLUNvbDBYN1NVQ3JNaVRSMzlMaXlCbktOYlFLdzNBZmNkQmZON1Rrb05fUEwxNUh3Ynd4aC1Ec3VwYUlIVkd2Yng4Vld2czBNUmxSMVROOEVoUzZDSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vulture.com",
      "title": "Vulture"
    }
  },
  {
    "title": "After Charles Tillman transformed football, he joined the FBI. Then the immigration raids started - The New York Times",
    "description": "After Charles Tillman transformed football, he joined the FBI. Then the immigration raids started  The New York TimesFrom The Athletic: After retiring from the NFL, Charles Tillman, known for his signature “Peanut Punch,” worked as an FBI agent. He loved his coworkers and found honor, integrity, and nobility in their service. Then the immigration raids started. https://nyti.ms/4b  facebook.comFrom The Athletic: After retiring from the NFL, Charles Tillman, known for his signature “Peanut Punch,” worked as an FBI agent. He loved his coworkers and found honor, integrity, and nobility in their service. Then the immigration raids started. https://nyti.ms/3  facebook.com",
    "published date": "Thu, 29 Jan 2026 21:15:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPTjBfanRRNmlZNE9Cal9JSzcyVkFhTDBzV3B2Z2F3dzBqLS1yWFFRLTlnTG1YdXM4Uk1QdV9FcHJsV0dvZkoxZkd6V0FxWlZRZC1Md2hKOWhBSFl5M3JFLUkybWN5QXdaQk1XR1BiR3NwSFVkV1hzMWJXZVk3MXBXT3U4NDI3SzluaVFOS080TXBLYUZf?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "LIV and let die: Reed’s return to PGA fold shows why Saudi golf experiment is doomed | Ewan Murray - The Guardian",
    "description": "LIV and let die: Reed’s return to PGA fold shows why Saudi golf experiment is doomed | Ewan Murray  The GuardianPGA Tour sends clear message with Patrick Reed’s return  Golf ChannelStatement from LIV Golf on Patrick Reed  LIV GolfPatrick Reed’s bombshell LIV departure: How, why and what’s next?  GOLF.comPatrick Reed announces plan to return to PGA TOUR, eyes status for 2027 season  PGA Tour",
    "published date": "Fri, 30 Jan 2026 00:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQVUdYMmpCSC1fWjdRRDE3TUxPZ3JjcVc3RmNqYzU2aUEyTVlsVVMwa1Z2Z2xzN0FnSkFIajMtQUJuRGNRdS1RaUVqLUh4dlpwcm9BZGtGREROa2dOYlZERkk0NF9ITmUyc1gzVlk3eDltQ0pCQmpLWHZ3aVAwZWd3clQyLWV3OGdZM1hEbWZwTVpZQjRCeVgtOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Josh Allen on crutches: What we know about the Buffalo Bills QB’s broken foot and surgery - syracuse.com",
    "description": "Josh Allen on crutches: What we know about the Buffalo Bills QB’s broken foot and surgery  syracuse.comBills' Josh Allen expects to be ready for OTAs after foot surgery  ESPNJosh Allen injury: Bills QB reveals he played end of regular season, playoffs with broken foot  CBS SportsBills QB Josh Allen reveals broken bone in right foot that required surgery - The Athletic  The New York TimesBills QB Josh Allen will be ready for offseason program after surgery on broken bone in right foot  NFL.com",
    "published date": "Thu, 29 Jan 2026 22:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQNEtXV3NUTVZEc1JDTFJ3UnNWMExORXprbEo4R0RwZ2RCalUxX0V0c2poNUVick9wWEZWT3NJYjdCX2o3VzFqbjdfT3VaY0ZBU3BXdUxWWXlzZUNlaVo0dTFoUTNwOTBSSWlNQzcwLU1jZ1ZRcThfTldMTm8yZE10WWFhR3B4WDNSR2ZFdmpLOGRURV9qN1BjdkU3WHRxanpXNmRaSWRkdWlyREVQaHY4ZVZPWVM2MTVoTVVtbloyM2dIb0pMNmhWbmZvc3pxcFdxT2ZnTWFR0gHqAUFVX3lxTFB5TWNfMF9LVXFKZVJZQ2FvOEFOQzI2a09JTXJsaTF0ekt6ajF1WV9lQTVJa2FOT2ZKbFZCbFEyclZaMEV2WC01Ukc3RjhTT0FERkh5eUJYSHNtaE45YnBXdDRFOUVjWVZET0xFM0pMQ2ZKSlNjMHhWbG1acnR4dUliczJOZVR3YWVYZ1ljSGRGQmVaY193dUl1aGJIc3lVaGxjTXRVVmJaVF9YM2c1ai1OMXozVGJabzBvZFNFOFY4WnlYQlo1T3JoOGtTX3h5UlNXaDJGZUJ5MTh0WUNhNktzeExpMlFMWUJOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.syracuse.com",
      "title": "syracuse.com"
    }
  },
  {
    "title": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate - MMA Fighting",
    "description": "Video: Khamzat Chimaev confronts fighter after near brawl with teammate  MMA FightingUFC Champ Khamzat Chimaev Narrowly Escapes Brawl After Confronting MMA Fighter in Oman  EssentiallySportsChimaev Breaks Up Heated Brawl  Yardbarker",
    "published date": "Thu, 29 Jan 2026 19:00:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOaW5ubmVEM3F6RXFUNUkyT25sWF82VWxGZnpSRUxYb1J0NTB3VFJiYTl1V0VKRDBCeWc4TzBfQmhrdUZBVWdDdW90OW1yemNSRk5aa2VfSFhFYjdabGl5dHpRRFBZTVFnU29tdVl5dFhweFMwejNHU0Z4UDNzUzV0RF9ISGU5dDlGeXhmZ1pudTl6VjlmMm84eUJKSEZtZTMwVzdYV3pDYUJhZ2lzX3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "430,000-year-old tool found in Greece - boingboing.net",
    "description": "430,000-year-old tool found in Greece  boingboing.net430,000-Year-Old Wooden Tools Are the Oldest Ever Found  The New York TimesThis ancient stick may be the world’s oldest handheld wooden tool  Science NewsArchaeologists Unearthed a 430,000-Year-Old Stick. After Careful Analysis, They Say It Could Be the Oldest Wooden Tool Ever Discovered  Smithsonian MagazineNews - 430,000-Year-Old Wooden Tools Found in Greece  Archaeology Magazine",
    "published date": "Wed, 28 Jan 2026 17:12:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxORnlkWWV5bndGRG5YcGhySHM3TW9DcHNienFzUTI1X3B2T2JITVBEOXR3RWJlSnpzSl95OXlYaWNtSnpWUWxLSE50NE9DUldaYU1mNkdUbUZCTUszZjNkZnFuZ0E0MjE4aHRqN0NPS0F1eUtUaGhrRkV6djBPQ095NdIBhgFBVV95cUxQeWpXOE1lREtZS1FhVWxNMjNETDRzSUp2em1EWVByMzItdW1LYUx3NjBReEhRaXpwYWtfd2VYd21JeFpwNERVb2tFZzdrbFVPTF9VRXdYN3I4cXNZQmJrUU1xd1RYN3hLMDBtZ280S0RhUHdYRDBGRmRJd3h5UThTVk9TTGtVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://boingboing.net",
      "title": "boingboing.net"
    }
  },
  {
    "title": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow' - Space",
    "description": "Astronomers watch 1st black hole ever imaged launch a 3,000‑light‑year‑long cosmic jet from its glowing 'shadow'  SpaceProbing the jet base of M87's supermassive black hole  Phys.orgImagery of M87's black hole shows polarity flip - ESO explains  MSNRevolutionary imaging of black hole aims to prove they are not ‘evil vacuum cleaners’  InklNew Event Horizon Telescope Results Trace M87 Jet Back to Its Black Hole | Newswise  Newswise",
    "published date": "Thu, 29 Jan 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxObEpLTjdzVFd0QVhhV1pHTi1GTlFjTGdHN1ZxdGRIaWFPOHV5MTdMZE0ybXVBRGtuYzc4U1NPZV82cGhROTcyVUEzRUJmRDJncC1obkEtRjlzOThaUy1MSnhQVDRjQ3FlMnJwcV94Wks2STJReTFHYjBrU3c0WXNLMUdQMEFydEdMdWprdFFQdm03WDlVMTl3UWpMaDFYUnBvV1liXzhFa2I3V2lqZ1JIRWhCRElsTzlaX2UtMTNJY0pXa1Y2RXV2cFBiLWltYnhZVk9jZ1R4Q1lDNUpnUl95ZmJmaFhfa0pZMWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "The infant universe's 'primordial soup' was actually soupy, study finds - Phys.org",
    "description": "The infant universe's 'primordial soup' was actually soupy, study finds  Phys.orgStudy: The infant universe’s “primordial soup” was actually soupy  MIT PhysicsQuark wakes reveal early universe plasma flowed like a liquid  Space DailyFirst Direct Evidence Suggests the Universe’s Primordial Soup Behaved Like a Liquid  Discover MagazineCERN Experiments Confirm Early Universe Behaved Like a Near-Perfect Fluid  Gadgets 360",
    "published date": "Wed, 28 Jan 2026 14:40:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA0Tkw4eVc2NkQ2RksxaTlhNEl0ME94WnhWMTdxX3BqY0w2aFZMdmxjOEZ5QXhIQm45R0hhYmxtaDhPZ0h2b21ZeXlSamZNVk1ZREFZbVhScHB1cGFTWHdPLU1nUmF5TGxlSlFOR01qZUJmMFRROVZZWTVBNm8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet - The Daily Galaxy",
    "description": "Curiosity Just Lit Up Mars At Night And Revealed A Never-Before-Seen Side Of The Red Planet  The Daily GalaxyCuriosity Lights Up ‘Nevado Sajama’ at Night  NASA Science (.gov)NASA rover just sent one of the most beautiful images ever taken of Mars  Futura, Le média qui explore le mondeNASA’s Curiosity Rover Captures Serene Mount Sharp Horizon After 14 Years on Mars  WebProNewsMars has never looked so serene in this gorgeous image from a NASA rover  Digital Trends",
    "published date": "Thu, 29 Jan 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPT0d5U2R5NzZ0eG56Ml8zWTRybGpKQmlPUVZpWGE5RzAyWGJpUjd5aUdzb0I2aGxOY2lTMVZRbkxnbjJncGpSY1lYVi1tUXVkVEFBWWlpRmFGM2plQ21zV2RRVVJIR2dHMGFxajBTSFE3SmQ1TlZlZ21aaTVRMmRNQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailygalaxy.com",
      "title": "The Daily Galaxy"
    }
  },
  {
    "title": "Let’s Be Honest About Public Health Guidance - The Dispatch",
    "description": "Let’s Be Honest About Public Health Guidance  The DispatchDefying CDC, Pediatricians Recommend All Kids Get Vaccinations Against 18 Diseases - WSJ  The Wall Street JournalWith new vaccine schedule secured, RFK Jr. allies head to statehouses  statnews.comAmerican Academy of Pediatrics departs from CDC with childhood vaccine revisions  The HillDoctors break with CDC on vaccine guidance for children  NBC News",
    "published date": "Wed, 28 Jan 2026 18:33:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNelhyaG83elJOM3FDNVluQ09pR2pHR3dlejNCbU9rZUEwUTQ0ckNHTzZYSU9qd2l1a2xMNm9SazhzMTUyWk1ycmxlZW1tRFFGWU1MSnduTVR6cHpEMzMyMjA0dVJZa0R1cHpRVmhaRGtQLWEwU0R6ZzVMSkQwOHFKd284bGQzMkROQkdDX013?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thedispatch.com",
      "title": "The Dispatch"
    }
  },
  {
    "title": "S.F. private school cancels in-person classes amid active tuberculosis cases - sfchronicle.com",
    "description": "S.F. private school cancels in-person classes amid active tuberculosis cases  sfchronicle.comTB outbreak at San Francisco high school leads to remote, hybrid learning options  ktvu.comCatholic high school in SF cancels in-person classes due to tuberculosis outbreak  kron4.comClasses canceled at Riordan High in S.F. amid tuberculosis outbreak  missionlocal.orgOfficials confirm tuberculosis outbreak at SF private school  sfgate.com",
    "published date": "Fri, 30 Jan 2026 02:05:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVS1WUTZ5dnU0ckNGS2F1NjhkZEl2M0d4U0M5ejBsOUhSN0FRRXNxWWZ0cXVqLVNac010ZE9jaUk3VGJMdk1CRm1sN0RNeUZpQ1hTcXg0WjVKaEJfdlVUMnVLOFlYZ3BfMGVKZnFhVDBqcFBZS1R6QktlUXlYUnhIVkhTcklrZHljeU5JbkV2c0paemZMY3NRbVRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "sfchronicle.com"
    }
  },
  {
    "title": "Parents Navigate a Fracturing Vaccine Landscape - The New York Times",
    "description": "Parents Navigate a Fracturing Vaccine Landscape  The New York TimesUS vaccine recommendations used to be based in science. Now it’s all vibes  C&ENTrump and RFK Jr. may usher in a blue tsunami  wilsontimes.comNegligence: The potential consequences of the anti-vaccine activism in the U.S.  Новости GxPSharp rise reported in nonmedical vaccine exemptions  Contemporary Pediatrics",
    "published date": "Thu, 29 Jan 2026 15:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzVzdSLUJSUlZrNl9PUjEwTzdaMjN4Uzl5aHRLbDIzcGd6ZE1ZNjBCOGRQWVAyelhLcC1fZE1lTW9zcEF0RG8tY0FsbEs1YXB0ZkJoekNuT1RaT2hlYVhIQXF4ZmFWX3VUelFLMmhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Guest column | A self-collected test allowed me to finally get cervical cancer screening - The Washington Post",
    "description": "Guest column | A self-collected test allowed me to finally get cervical cancer screening  The Washington PostUniversal self-collection of cervical samples may hike HPV screening rates  CIDRAPUMMC research helps reshape national HPV screening guidelines  wapt.comOp-ed from Assistant Minister White – How a self collect swab changed the way I think about cervical screening  Australian Government Department of Health, Disability and AgeingDr Neff on the Accuracy and Feasibility of Self-Collected HPV Testing in Cervical Cancer  OncLive",
    "published date": "Thu, 29 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQamc0SXZiV3ZEdzBvWGZqQVJ4U0ladGZkOUYwUktEOXFHa3gxZ0hCUjAzQjVaYUxJZmdoWHlWS05wUkI5M2xPUGk4S0xXVS03R0t4bjk4NXZiNlFrZzJ0WnZsNlBZOHRoT3MxLTMtOEppSEZGamFxSGhwQngyT0JpeHpVZXNnYkNPMFQzT19GRWQxem5OYTdz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  }
]