[
  {
    "title": "Border Patrol Commander Greg Bovino returning to position in El Centro: Sources - ABC News",
    "description": "Border Patrol Commander Greg Bovino returning to position in El Centro: Sources  ABC NewsGreg Bovino Loses His Job  The AtlanticWhite House slides into damage control over Minneapolis ICE operation  USA TodayBorder patrol commander to leave Minneapolis after Alex Pretti shooting  The GuardianLive updates on Minnesota: Trump-Noem meeting, Bovino leaving Minneapolis, acting ICE director ordered to court  CNN",
    "published date": "Tue, 27 Jan 2026 19:48:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPQjdFeHNoTEVvblRRby04MTVWY09RbmtCSjUtWHdBSy1WX2VDM21lOGtVNVRyS3BqX2tCejFPazdpTzFtdDF5S3VzbFhPWXRfcDJOQ1pGbl8yM1JRd2VIcTU0QXBwMmVnWHBzaDAwZ2pJSm9raDlVY19GRURvNFMzUTJ0eHZXbFBmS185R042MkdvM3lxbFpUaGRuRVEzeTNzZ2Z6X2VXb0t3elpt0gGyAUFVX3lxTE8xN1lNVEUybGtYcmFIQkJKNzZfMXdzY1J5T2FjUWZVemJxY29CZWNLYTlEd21XaTJLdU5CRGxPTkk1YnVQczR3QU9MLS1hNVU4YmxwbzdycmtwRmZWV0NMOWVLRzVLZS1EWF9QdFJmMjNLREVaLUdWWU5pU0ZpTkRRWUx1LVg1dGhNWThHT2hfa3QzQjZSNldYWHhfaW8xZi1nWTRZQlZPZTQyQWR2T0V5MlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "The 48 Hours That Convinced Trump to Change Course in Minnesota - WSJ - The Wall Street Journal",
    "description": "The 48 Hours That Convinced Trump to Change Course in Minnesota - WSJ  The Wall Street JournalTrump’s deportation forces finally went too far  vox.comWhat the Administration Is Signaling to Federal Agents After Minnesota  The AtlanticICE and America’s flailing autocrat  Financial TimesMajor editorial boards denounce Trump’s Minnesota crackdown as a ‘moral and political failure,’ ‘perversion of justice’  Politico",
    "published date": "Tue, 27 Jan 2026 14:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ0thRjNocXNWRXR3UWJINWM1Ni1uSzVjX3JxYld6U3duNkVJZHZLcmZhdXlVOGxsbDViT3RwVHhxaW4zQjJZTUJWZjJYYlY2VGlJMVE5R3RmVFI3RFR4ZUFiekNHUHVRN3MzWFM1cU9CZXZsZzNVZGlORUlKREdNczJaSm03SDdzODQ1b01pdTdHLXFMdXZsNFBTeWRlamFtQ0p6ZVJNdXloNXB0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Families of two men killed in Trump’s military boat strikes sue US government - The Guardian",
    "description": "Families of two men killed in Trump’s military boat strikes sue US government  The GuardianFirst wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of Trinidadian men killed in US strike sue Trump admin  Fox NewsFamilies of two Caribbean men killed in boat strikes sue Trump administration  PoliticoBurnley v. U.S.: Demanding Accountability on Caribbean Boat Strikes  American Civil Liberties Union",
    "published date": "Tue, 27 Jan 2026 18:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxON2p2MUJkb1h5b2RyakN1bEwzMnl3Q0NiRVBlRWk4LUdxSWtlc1FxYTY3WWhnQ0RpTW02LWdqcDRtR09mSEJpTjZ5T3lQNW1EcERJWWtDOG5OMHhELWhNcDhTWkNkVXhqOERvR0l3ZUlVWF8ya2F5U0M1a0d3VXpoREQ5Z0Ywa3U2SU1v?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "After rocky start, Bari Weiss plans cuts, adds commentators at CBS News - NPR",
    "description": "After rocky start, Bari Weiss plans cuts, adds commentators at CBS News  NPRCBS News names 19 new contributors  CBS NewsSharyn Alfonsi, Scott Pelley's jobs are on the line after pushing back against Bari Weiss' CBS News shakeups: sources  New York PostBari Weiss adds new podcasters and writers as CBS contributors  AxiosInside Bari Weiss’s Hostile Takeover of CBS News  The New Yorker",
    "published date": "Tue, 27 Jan 2026 18:31:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPclpVT1BmZXlqNjhjNHhyVXFweWRNdlhabGJvaHZXbUZLMUFleTZsc1Nja1JFajZKTVA4X3BRVzd3Y1ZKM2o0OXR6UFVwOW81b3dVSnJyRVBPSmF6THFPbTh5NEFrMk11aGdNRUgxM251NkRuZkxBNTZnSTRJOUNMbFR1Q1hfMXBZM3RGOTZQVU1jNXcxeEVpMl9MZGZlNVI0R1V1dnNsRGdybjNaVnlwc1VQS2Q3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Could another storm hit the East Coast soon? Here are the possibilities. - The Washington Post",
    "description": "Could another storm hit the East Coast soon? Here are the possibilities.  The Washington PostForecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios  CNNPossible Nor’easter could bring heavy snow and strong winds to the east coast this weekend  kare11.comAnother potential weekend snowstorm looms for NY, NJ: Early thoughts, forecast  fox5ny.comEverything to know about the possibility of a massive nor'easter this weekend  nbcboston.com",
    "published date": "Tue, 27 Jan 2026 19:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZkpsQUs4UjBQbFZNYm9iUzZ1d1lZSnMyQWtZUEVnYTU5clloLUJuRlZ6QXQ0bFZiOWZFM0ZYRGs5aFlRMWt1aVUtcG5QNExURF8wUk1DbkIyNmFkek9Pd01TOUdtbkM2YThCOUJvMm9IVXJiVXRvTlFJTnU1b2E0VUU0WG55T0pWZkQ3cFVCWHlXcXkzYkJBZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Population Growth Slows Due to Decline in Net International Migration - Census.gov",
    "description": "Population Growth Slows Due to Decline in Net International Migration  Census.govU.S. Population Growth Slows Sharply as Immigration Numbers Plunge  The New York TimesThe states growing – and shrinking – the fastest, according to Census estimates  The HillTrump's immigration crackdown led to drop in US growth rate last year as population hit 342 million  YahooNew Population Estimates Show Historic Decline in Net International Migration  Census.gov",
    "published date": "Tue, 27 Jan 2026 05:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZy03eFNEX1NoQjBOLVpSbEZBVlQ4Y1pJY09hQnN5YXFLaDU3ajNpZVN1UWdIRDZ6RzVJeWVWT3hWMGdiZ3RFamk2NC1RVE1SN3hwbWZLNWdWVXR4cHVTaDZFMWV1NjJHTlhMYlJldWRaYUNWTzZRX1hNLU1fR21hWlgwUENEUHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.census.gov",
      "title": "Census.gov"
    }
  },
  {
    "title": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next - The New York Times",
    "description": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York TimesAmerica has reached a tipping point on fascism – and on opposition to it | Robert Reich  The GuardianAlex Pretti is the latest victim in the Trump administration’s drive for dominance  inquirer.comTrump’s enforcers have unleashed a fascist fairytale on America  The IndependentNear site of Alex Pretti’s killing, a Whittier church opens its doors  mprnews.org",
    "published date": "Tue, 27 Jan 2026 16:46:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQeGgzbUxpbzk4NElBX2FCVWhTaFV6ZkFYVV93cGRZU2ZCTmNiOEZ4aFU4alZ2bVRkaklKU0xFOU50OWJ1RVFnb2tPcDNHV1R0Z2gyM1pqS2lESWNqVE1nTDZRVnZHOWx0QXdvNHB4TmVDX2lPYzRuNVBEN2d3QlMxdVVLR0dGaktYZXBpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US to send ICE agents to Winter Olympics, prompting Italian anger - BBC",
    "description": "US to send ICE agents to Winter Olympics, prompting Italian anger  BBCICE Agents Will Join Olympics Delegation in Italy. Many Italians are Angry.  The New York TimesICE’s Role at Winter Olympics Draws Ire From Italian Leaders  Time MagazineReports: ICE agents to have security role at Milan Olympics  ESPN‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics  The Guardian",
    "published date": "Tue, 27 Jan 2026 19:13:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBocVZNMHJXR1BjNzl6dlljT09OXzFmeG1zZHJDM2R5OVNiUVVvdFBZOVRGYmxGbm9YTEUyQ01oRkhjUXNULVpMT1VndFNheUxYcC1fTDNQODAtdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Carney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos - AP News",
    "description": "Carney rolls his eyes at US Treasury secretary, telling Trump he meant what he said at Davos  AP NewsOpinion | The Most Important Foreign Policy Speech in Years  The New York TimesCarney denies walking back Davos speech in phone call with Trump  BBCMaybe the United States Can Be One of Mark Carney’s “Middle Powers”  The New YorkerThe 'middle powers' are having a moment, but can they stand up to Trump?  CNBC",
    "published date": "Tue, 27 Jan 2026 16:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNd1dEN1N2SFJ2d0NUbUhnYng1VHpFQVlMY0JydV9DRy02MXZPRGtONnBVNHJ5ZzNYUTcxb2RCMUdXN29hb2Q2TzE0Z0JTYnpuam40dElocTdpMlZlcHJsM1pIVFNUUWNxTkVqMTVVbFpqX3dPOGh0c2RBSkZiOV9qZDZELXFoaXBueTl3MVpxWHU2QnQ3M0xiY2gxWEhjYndMdWRUM3lnM2ZoaFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Board of Peace Set to Hand Trump Sweeping Powers Over Gaza - The New York Times",
    "description": "Board of Peace Set to Hand Trump Sweeping Powers Over Gaza  The New York TimesTrump’s Board of Peace Cracks the BRICS Wall  Foreign PolicyTrump’s ‘Board of Peace’ puts rights abusers in charge of global order  Al JazeeraTrump’s Board of Peace and the Limits of Reconstruction  The DispatchOpinion | Trump’s Board of Peace is already floundering  The Washington Post",
    "published date": "Tue, 27 Jan 2026 18:03:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQeG9RZEdEREtENnd1bGdjMTZ6dy1PRzZKZ21RMUxXTjlrUk9tRXF6dHFuZDYzRmtqaDllbDB6NnVsamlaaTJBSFlNVjNQbVpvS0k4U0NVZHpZVjVvVHpQVXYxMndhcTFSRk0tRWxWaEp6OTg1ZmVvc25OZ3l1NlNsbWF4dmVFc01md3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Terror infiltration in south Israel was false alarm - jpost.com",
    "description": "Terror infiltration in south Israel was false alarm  jpost.comSeveral suspects believed to have infiltrated into Israel from Jordan, says IDF  timesofisrael.comSuspected Jordan border infiltration triggers alert in southern Israel; security threat ruled out  ynetnews.comIDF tests readiness for Houthi infiltration via Jordan under manpower limits  YahooIsrael holds drills in case of 'Houthi infiltration via Jordan'  The New Arab",
    "published date": "Tue, 27 Jan 2026 19:40:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9SXzVvWHBGbjdrYXFDUzdYQWU2NW5YeWRaMzJxS3o0aXVwMkFsS0gzenZiQ21ZUHdhUlVHLWhuYjlLRnk0RjdTVHZhRy13SkRRN3lNWEQ5ZHd2a1hUVklYQkV1dGYxb3FBMDdZYVpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "jpost.com"
    }
  },
  {
    "title": "As Trump shuffles global order, U.K. prime minister heads to Beijing - The Washington Post",
    "description": "As Trump shuffles global order, U.K. prime minister heads to Beijing  The Washington PostUK Seeks Trade With China Without Triggering Trump’s Fury  The New York TimesUK's Starmer heads to China seeking a thaw in relations but risking a rift with Trump  ABC NewsFor Britain, China remains a ‘threat’ – but one worth doing business with  CNNStarmer Says UK Won’t Be Forced to Choose Between US, China  Bloomberg.com",
    "published date": "Tue, 27 Jan 2026 19:29:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQYVdRdkQzSXFRYU1LMGpGcDVaRnlnRE5OeXZHOUlJRUxDRmt5dVdWemdKeXNGdzlYLTMyQjZIMV9RSjhNQWhNcUxlSVA1aDBrc1VnYVhOUXlmOTg0NlJkSGk0ZmMzRWlZcmpXZHpnYmUyU3VhUlNyR01HUDlid3VPaTBlTDJKbmxXalNITGZfa1dEQkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Amazon to Shut Down All Amazon Go and Amazon Fresh Stores - The Wall Street Journal",
    "description": "Amazon to Shut Down All Amazon Go and Amazon Fresh Stores  The Wall Street JournalPardon the Disruption: What’s Amazon’s future running grocery stores?  Grocery DiveAmazon is closing its Fresh and Go locations  CNNAmazon converting some Fresh supermarkets, Go stores to Whole Foods locations  CNBCAmazon doubles down on online grocery delivery and Whole Foods Market expansion to reach more customers  aboutamazon.com",
    "published date": "Tue, 27 Jan 2026 18:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNTXNGZ09rRXl3bmh4czYtaDFvcXhCWGxnNk9kOF9tbkVpNVVTT2Z5dWtTaEZvM1JCRTdXRXNxYlZOVmZKQVR4ZHBPd2UxRHRhazBOam5ZLV9hbVFrbVBRaGpjN2RVaG5pUTVFR3pKU0k3UmhLOEQxdFBYcXB2XzhhVng4S29kenFvcUoxWU1WVUtqMGJVTE4yYl9nTWpxUUNlSGdOMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "S&P 500 rises to record high, led by gains in tech: Live updates - CNBC",
    "description": "S&P 500 rises to record high, led by gains in tech: Live updates  CNBCStock market today: S&P 500, Nasdaq rise as tech leads, UnitedHealth weighs on Dow amid earnings flood  Yahoo FinanceS&P 500 hits record high as corporate earnings roll in; Medicare rates hit insurers  ReutersDow Jones Futures: AMD, Astera, Oklo, Rocket Lab, Tesla Sell Off; Fed Meeting Next  Investor's Business DailyMarkets Brief: What to Watch in Big Tech Earnings, Plus the Fed Meeting  Morningstar",
    "published date": "Tue, 27 Jan 2026 19:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ybTlXVGZPWXRhUHVWZ0RaRGV4YU43Q0steWxpUkNJb0pESHNZVlZnQ3k4QWt4Y0dra2hPODRGTXQzWjBYMDhsWDR0aGZ2Y19RTFZZT29uWU56enVNS0NWTlVUNlpjcDgzWXRELTVHcnVtUm9pTFhV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Farewell Tri-Jet: UPS Is Retiring Its Iconic MD-11 Fleet - Simple Flying",
    "description": "Farewell Tri-Jet: UPS Is Retiring Its Iconic MD-11 Fleet  Simple FlyingUPS permanently retires MD-11 planes from fleet following Louisville crash  courier-journal.comUPS fully retires its fleet of MD-11s after deadly Louisville plane crash  wlky.comUPS announces it has retired fleet of MD-11s, the plane involved in deadly crash  wave3.comUPS won’t resurrect MD-11 fleet after deadly crash, takes $137M charge  FreightWaves",
    "published date": "Tue, 27 Jan 2026 15:47:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBkckRxc2RDcWNiSmkwRllaeHZVb0daVzZRN01jZHZINHNBbV9KM3Y4dVpLcXdfWUg5aUw2cGFNZjZqbWVKV3pqR0FpZE1WbGl2MUlsWGxFVGFOeGd4ZWVCbFhWMGl0U0lHanBNbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://simpleflying.com",
      "title": "Simple Flying"
    }
  },
  {
    "title": "The Fed has four new voters this year. They may complicate Trump’s push for lower rates - CNN",
    "description": "The Fed has four new voters this year. They may complicate Trump’s push for lower rates  CNNWall Street’s Rick Rieder may be gaining ground in Trump’s hunt for a new Fed chair  CNNBlackRock's Rieder takes the lead in race for Trump's Fed chair pick  AxiosBlackRock's Rieder is frontrunner for Powell replacement. Here's what it means for crypto  CoinDeskRieder odds rising for Fed chair after Trump calls BlackRock executive 'very impressive'  CNBC",
    "published date": "Tue, 27 Jan 2026 12:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQcFhnWWdrWWxzTVZacXVwYzRKVlh6RElRVmlBaUI1ZkgtN2xFWHhaVU5HMnRkNjhzd1E3ODNNcHFjamVrZTh2T2ExLW5UZDF0SnRCR1gxMkpSdkt5MmNtMDlxQTBDdmFvQjYyNWt6bW5fVEVHcVB3aldnbW1LZHBhdUZ0U2Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "iOS 26.2.1: Apple Suddenly Releases Surprise iPhone Update With Key Features And Fixes - Forbes",
    "description": "iOS 26.2.1: Apple Suddenly Releases Surprise iPhone Update With Key Features And Fixes  ForbesApple introduces new AirTag with expanded connectivity range and improved findability  AppleApple just improved AirTags. Why I'm sticking with the old version.  Business InsiderApple doesn’t want AirTag 2 tracking pets. Why not?  MacworldApple just revealed the AirTag 2, and its new features sound fantastic  CNN",
    "published date": "Tue, 27 Jan 2026 11:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQeE5SWVVva3pPOVl6OU9FOHpYdndvc0JrVm9FX24wMUI4ZVd3bksxQkFqdkdFOUJjZDhUclFicmpaTTRDWEVhalpOMWZhQWVlSElvdlMwTlRpNHJsYWpYN0FHN2poeFRleHlvTHltbzkycWMwQzVsbFdTU2hLMjR0S3gxNkRRRnRzQ0xXeXF5dTJWOXdQQndwR3JMX3VUc3BmQzBPZFFmTlJ4WTJiTFI3QmhqNjQwSzA2T1JiTW1lVHJRR25q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Galaxy Book 6 Pro and Book 6 Ultra have been launched - SamMobile",
    "description": "Galaxy Book 6 Pro and Book 6 Ultra have been launched  SamMobileI've used a lot of Samsung laptops. This one stands out  PCWorldGalaxy Book 6 lineup set for a South Korean release  PhoneArena[Video] Galaxy Book6 Ultra Delivers Powerful Performance in a Slim Design  Samsung Mobile PressChipflation Drives PC Price Surge, Ramtech Trend Emerges  조선일보",
    "published date": "Mon, 26 Jan 2026 04:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOWkJiSG1Pc2cwSW9oRTk5SlZhc3pQZktRelU0NTU5YWhQRm52TC15UGdmZkpBTHpGcE1oMGtjcXd5SE03N0U2QnMzVGhlUS11TkZSQTJwckZldkhsOFJYMDJtVUE2Q1FyVjVXUFNHM1R2QlRaelBPckllU1NyRHhwdDV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sammobile.com",
      "title": "SamMobile"
    }
  },
  {
    "title": "Why There's Simply No Need For An iPad Anymore - bgr.com",
    "description": "Why There's Simply No Need For An iPad Anymore  bgr.com",
    "published date": "Tue, 27 Jan 2026 17:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE12REZWMWV5TzAyQXVzZ2NJMXpfdTFUUGlvREpwamtXWjhNcUxjZ2Ric3ItaC0zTUN0S2xKanBmOGVwTG05V3dzUlA3YW0wS0RSZjNJR3V1N2xBeVVidGZCZlRGSmUwcXoyQjRV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bgr.com",
      "title": "bgr.com"
    }
  },
  {
    "title": "Google could bring a taste of Apple’s Liquid Glass to Android 17 - Android Authority",
    "description": "Google could bring a taste of Apple’s Liquid Glass to Android 17  Android AuthorityGoogle adding blur to Android 17’s system UI on Pixel  9to5GoogleAndroid 17 Might Copy the Worst Thing About iOS 26  GizmodoOne UI 9 could bring glassy visual effects to Galaxy phones and tablets  SamMobileAndroid 17 might make you think that you need stronger glasses  PhoneArena",
    "published date": "Mon, 26 Jan 2026 10:39:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPcEZ5em9MMTRKVGZiTHY5UlNUNXJxMTU0bDdYLXA2cm45NEJjRWowdlFOcDEwbTg0N3pUMkpudjRZNE52M3RycHg1V2M5RXJKZU9yWU1UaDU1WU1zaWN6WDJQeHFxQkJOY0xKZTBsRHVIUERQOExYd1JiMm5xZTNDdkd2UzRvaEgxWDVj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "BAFTA Nominations: ‘One Battle After Another’ and ‘Sinners’ Face Off - The New York Times",
    "description": "BAFTA Nominations: ‘One Battle After Another’ and ‘Sinners’ Face Off  The New York TimesOne Battle After Another leads Bafta nominations  BBC2026 BAFTA Film Awards Nominations: Full List of Nominees  Rotten TomatoesEthan Hawke, Jesse Plemons and more: These are the Texas ties in 2026 BAFTA nominations  YahooBAFTA Nominations Snubs and Surprises: ‘Wicked: For Good’ Shut Out of Main Categories, Paul Mescal and Chase Infiniti Make the Cut After Oscar Misses  Variety",
    "published date": "Tue, 27 Jan 2026 13:21:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOZENyLVNaTDRUNTJ2VVpiREdrX3lKQTJITl8xYkllcDVYc1MyRlJ2cEVRYzFVOFF4MkkxSEkxeTJkMmdmWG0tYVhWMXg0SnpnMzFJdmZqdWRJTFFWcTNtY01NcXEtTEJrQ1VVWDVQLVhMWE8xQlFJQWo3enBOS2psSV9IUVVpeFpKeGdneXZlQm94TWdXV0tBcjEtNXFoQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Philip Glass pulls world premiere from Kennedy Center - The Washington Post",
    "description": "Philip Glass pulls world premiere from Kennedy Center  The Washington PostPhilip Glass Withdraws From Kennedy Center, as Its Symphony Vows to Play On  The New York TimesPhilip Glass withdraws his ‘Lincoln’ symphony from the Kennedy Center, citing conflicting values  CNNHere's who's canceled their Kennedy Center performances since Trump took over  NPRPhilip Glass cancels Kennedy Center symphony premiere in protest of Trump’s leadership  AP News",
    "published date": "Tue, 27 Jan 2026 19:26:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPT1RGZ2F6VFJQcDdueVEwWmV5NjNPb1VVa1d3X0EycFR2dXhJVjh2SDQ4c2R1UjFaZHlsWWdHTUNaS1BDTnlzOEw1OWV3M3VUV2ktaXVTSzBtWTFSMkZZaTBzWmlOb1FpRDdCVmxKRW1POGtSMFBlN3VDYlRBVkFpZFV6V2ItS2FNUFBaaXFKOGVkUjNmbXJORE9rTVU0UWJONTlsMnJkcm9zUEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Kendall Jenner Takes Jabs at Her NBA Ex-Boyfriends in Super Bowl Ad — and Reveals the Sport She's Targeting Next - People.com",
    "description": "Kendall Jenner Takes Jabs at Her NBA Ex-Boyfriends in Super Bowl Ad — and Reveals the Sport She's Targeting Next  People.comKendall Jenner Trolls Exes, Pokes Fun at Kardashian Curse in Super Bowl Ad  E! NewsFanatics Sportsbook bets on Kendall Jenner in its Super Bowl debut—inside the approach  Ad AgeKendall Jenner Hopes to Bet on Right Guys in Fanatics’ 1st Super Bowl Ad  YahooKendall Jenner Jokes About \"Basketball Boyfriends\" While Rocking a High-Cut Swimsuit and Cutout Dress  instyle.com",
    "published date": "Tue, 27 Jan 2026 16:24:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOa3AtSlhBRzlQQkNtWThZTVNDN0gwWFNRUDFmYVZaOV83emRkcnZMMFRyS19LemhLcW5mYUxYbXlaSFR3ZFZyTUphd0xiZjRXMWxXZmdNNXp3Z0VXbEZ2b1VBRUFzWjdqOGxNLXlzSzhSU2NrN2ZfSi1rQlJWbW1GZEc5cThJV0VSRU5qMkcxNGp4U2s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://people.com",
      "title": "People.com"
    }
  },
  {
    "title": "‘Maybe We Don’t Belong Together’: Harry Styles Fans Call-Out ‘Insane’ Ticket Prices - TicketNews",
    "description": "‘Maybe We Don’t Belong Together’: Harry Styles Fans Call-Out ‘Insane’ Ticket Prices  TicketNewsHarry Styles supporting small music venues with tour donation  BBCHarry Styles is playing six huge shows at London’s Wembley Stadium this summer – and tickets go on sale this week  Time Out WorldwideHarry Styles 2026 tour presale: How to get tickets to the ‘Together, Together’ global residency  YahooHarry Styles Fans in Uproar Over “Gross” Tour Ticket Costs: “A Shock to the System”  hollywoodreporter.com",
    "published date": "Mon, 26 Jan 2026 21:23:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOQ1BGX3g5bGpCUTd4d3lIMF9nTmNkaHYxeVI1MExpUEsyaE9YOWx6MW1ZUXdwdExodGlNbjloemw0QldHbFk1Y1d5cTZjMlk3dTF2aFBfdmtqS01VMXpXVThSclVBWEswVjRValI5aEpoVWFjN0o3dEQyNWVka2lmYU8tYU5ZT1ZBc1kwalV2SXJORnBndl81NjRmOW5RcTI0TFMxbEZJSTlTTTZFZmVlc1BmMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ticketnews.com",
      "title": "TicketNews"
    }
  },
  {
    "title": "NBA mock draft 2026: Lottery simulation delivers young star to big winner - SB Nation",
    "description": "NBA mock draft 2026: Lottery simulation delivers young star to big winner  SB NationThe Bounce: Cameron Boozer vs. AJ Dybantsa for the No. 1 pick in the NBA Draft?  The New York TimesDraymond Green breaks down why the 2026 NBA Draft class might be the best in league history: \"It's going to be hard to get it wrong\"  Yahoo SportsJanuary 2026 Scouting Roundtable  No Ceilings | SubstackThe Race for No. 1 — Part III  NBA Big Board | Rafael Barlowe",
    "published date": "Tue, 27 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPR0stVlZIMlpCc3BuU2NOelBISkJ5NDZjZ2JFMU1CaHUyendGU00wUlluaFhSVXhxZC1nOF9RUkJvbHdKYmdvbmFiVFU0bmR2ODRsRnFwTHhPemVhR1ZUQTlJdFhHVWlBbnRyS0UyS28yazlfYWRHcmNzTzJoWTg5dFZsVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sbnation.com",
      "title": "SB Nation"
    }
  },
  {
    "title": "'It cost me the fight'... Diego Lopes knows why he lost to Alexander Volkanovski ahead of UFC 325 - Bloody Elbow",
    "description": "'It cost me the fight'... Diego Lopes knows why he lost to Alexander Volkanovski ahead of UFC 325  Bloody ElbowUFC 325 fight card: Five biggest storylines to watch in Australia  CBS SportsDiego Lopes responds to critics of UFC 325 title shot  Yahoo SportsUFC 325 odds, picks: Seasoned MMA analyst reveals selections for Volkanovski vs. Lopes and other matchups on January 31  SportsLineShillan & Duffy: UFC 325 Preview  Sherdog",
    "published date": "Mon, 26 Jan 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNMkVPODhkZEFjdF9EekNPbGcyUXgxaF9oY2o2TnI2SU51NlZubndiZE1JSkpUNFozcEZMc2pJS3ZWQ0tmU1BaWEdzd3k4QjYtd19WRWxRZ3JsdkR2N29VTDNVMGQzT3BMSHFYVm5RX0VlUUtGRkZHSFlZbF82TEJYNW9TR05DeWpSOXEwMnBWOFJhd3piZ3k5cVhpcHRrak9UMGRHU1F4MWxGa0Vab1Zua0VjMXFqZTJaWF9aUTFxSjJxRW96c1E4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bloodyelbow.com",
      "title": "Bloody Elbow"
    }
  },
  {
    "title": "Yankees Claim Dom Hamel; Designate Marco Luciano, Jayvien Sandridge For Assignment - MLB Trade Rumors",
    "description": "Yankees Claim Dom Hamel; Designate Marco Luciano, Jayvien Sandridge For Assignment  MLB Trade RumorsYanks add former Mets prospect to pitching mix with waiver claim  MLB.comYankees' Jayvien Sandridge: Scrubbed from 40-man roster  CBS SportsYankees claim RHP Dom Hamel off waivers from Rangers  Yahoo SportsYankees add former top pitching NY Mets prospect with 1 MLB game of experience  Rising Apple",
    "published date": "Tue, 27 Jan 2026 19:13:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPTFJ4clJXeVlUZ0NBQTdHNGtsNGN2U3ZEOHk5MjNuTG12dDZSdTllOERqV0RHR0ZqaGk2OExhUlQtSXhTRHV6cjdJcEZqRVVlZzNkY2JDQzhOTm9tRXFRMzhXdklwcXB4OFdueDJhSk9NNk9RTXl2SkwzOFY0dmg0VzBrUWRCcVRLbTExdEh1NGh2WFhIQmpuVlFvN3YzakFsWUx2OHVaUnpiSk03TmRsM2dTX1prbHJXYWpUZmJlQTh6dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Sri Lanka vs England: Joe Root and Harry Brook centuries take tourists to ODI series win - BBC",
    "description": "Sri Lanka vs England: Joe Root and Harry Brook centuries take tourists to ODI series win  BBCHarry Brook’s brutal century sets up England for ODI series win in Sri Lanka  The GuardianBrook slams 'worst pitch' as England prevail in spin-heavy contest  ESPNcricinfoSri Lanka vs England LIVE: Third ODI, Colombo - cricket score & updates  BBCHow England held on to secure series win in Sri Lanka  Sky Sports",
    "published date": "Tue, 27 Jan 2026 16:31:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9NTzQyU28yTVg3ZHRUQ1FUU3E2UXhiY3VCVjk3UTlNN3ZoWGhGbnJsMXNNU2VERmZtTFFXNm9vUVd3WUJJeVp1SW54YUhCMWYxTUFINEhScHVaamhsSlFvTUlxV0ZWUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Live coverage: SpaceX to launch GPS 3 satellite following switch from ULA Vulcan rocket - Spaceflight Now",
    "description": "Live coverage: SpaceX to launch GPS 3 satellite following switch from ULA Vulcan rocket  Spaceflight NowSpaceX set to launch cutting-edge GPS satellite Tuesday from Florida  YahooWatch SpaceX launch advanced GPS satellite for US Space Force on Jan. 27 after delay  SpaceLaunch Roundup: GPS, Starlink, Electron launches scheduled for last week of January  NASASpaceFlight.com -Scrub! Poor weather postpones Monday night SpaceX launch from Cape Canaveral  floridatoday.com",
    "published date": "Mon, 26 Jan 2026 16:42:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPTE9wOU9kMlJzZ2IxcFhrRUFNOWoxc0ZCTDRJLVhwWmFhdmZkUW9zOElDQ0VZX00yN2ZFZTBLN2F6c1AxTzU4a0R2bndJRDEyaExJSkVmZG9Pb2xyVlRQaThYNUtTM210TDJtdWVVSE9hOEVCR0ZuY01OY2txcWRLTDNYMXhQWk1JYm15YWVWZXFUQm1peEZ5dkxMNkhhVTJOc3NqS1pvUU5LV29KbjNNYXcxSHp6MmdnaU4tanR0RW42d0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "Scientists launch AI DinoTracker app that identifies dinosaur footprints - The Guardian",
    "description": "Scientists launch AI DinoTracker app that identifies dinosaur footprints  The GuardianBirds could be 60 million years older than thought  The TelegraphAI Is Solving a Dinosaur Mystery That Stumped Scientists for Decades  SciTechDailyAI sheds light on mysterious dinosaur footprints  Phys.orgIdentifying dinosaurs from their footprints is difficult – but AI can help  The Conversation",
    "published date": "Mon, 26 Jan 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQUVBFcnZJUWl6NzdKalJFanBzT1VBRjlEaENoUnBWN2MxQmxYMUlNT0dOVkF5RlUwSFNCTXpOTnVYalBCOTVkNzFlenJPTzR5ZGxlbXB3dF8zZi1nVmRVUUJBd3pFYmpSeXVqNnA3d2ZsbjBMN1ZSa0FaRlBtVlBySzRNa0ZBTjhKcGRqQkM1RzdRWTRLdGFYVW84SzJCMXYwMkxkRmtSNnV6T1dNNV9pQ2xQWVRNT1NacXM3UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "A New Way to Flirt: Dazzle Potential Mates With Patterns Invisible to Humans - The New York Times",
    "description": "A New Way to Flirt: Dazzle Potential Mates With Patterns Invisible to Humans  The New York Times",
    "published date": "Mon, 26 Jan 2026 20:00:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYWFPV2xmQUdlOEgzTFd4bVpkR1NNLWxQRUV4UWpTQWNpaGhva3Z1OVE5TEVJVDZzNXU0amJpNnYtY25YTXpSZFJMNzVyMGlpdHF6eG9ScjVfQU1kTGJQZE41dmFYRThOS2ZxeUxDR0pGV0NmYkh4ZVVCejV5M0VOdklKaTNKVkVnT0lmVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Scientists Finally Figured Out How Much Groundwater There Is Under the US and It Is Enough to Fill the Great Lakes 13 Times Over - ZME Science",
    "description": "Scientists Finally Figured Out How Much Groundwater There Is Under the US and It Is Enough to Fill the Great Lakes 13 Times Over  ZME Science",
    "published date": "Mon, 26 Jan 2026 19:19:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9Ia0UxdE45QVZnVU5hcGljWk5FZTR6QWRCandpd1FQYllrdFVtS3Q4YWlmdTYzYnZwR1VkeUxPNWFOa2E2MGxvSTBuN0MwTXUwUFBWcFREZ1laUzlKc2FGbFgxOW1BWlRDRVNKWmxvOGtLUVBoQnRUTHVUTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.zmescience.com",
      "title": "ZME Science"
    }
  },
  {
    "title": "Trump policies at odds with emerging understanding of COVID's long-term harm - CBS News",
    "description": "Trump policies at odds with emerging understanding of COVID's long-term harm  CBS NewsFrom scarred lungs to diabetes: How COVID may stick with people long-term | SciShow News  MSNTrump policies at odds with emerging understanding of COVID-19's long-term harm  newsandtribune.com",
    "published date": "Tue, 27 Jan 2026 10:00:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9oTHdCME5YWDY0dWZ4eGpFbEZfejZKdUZIRXJoeGtJRzNDRTVhTGhNbWlaTWRHLU9xeUU3RW9PdXV6ZEFBWWZXcTJHY0ZnN2VUblM2NHV4TWFTbFJBT2lvSjZaUU1NNjV2ZlBWZ2Q3eDJkbHhE0gF6QVVfeXFMT29QMG5Lc190N0xXZk9vU3NBSThGdnpBbFZCVTgwcXFRYlNnU3BuY1FRUnoyWktOeGY3dV9VY004TjlmRjR3YTYtVE01cUNqWXl4NzhqMEZMQTVNOWVudVZ4M2NBMUFIVm9LZ2RrdjFnMkZjU0JINU82VVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Menopause linked to Alzheimer's-like brain changes - BBC",
    "description": "Menopause linked to Alzheimer's-like brain changes  BBCEmotional and cognitive effects of menopause and hormone replacement therapy | Psychological Medicine  Cambridge University Press & AssessmentGrey matter loss during menopause may raise dementia risk  The TimesMenopause linked to changes in brain’s gray matter, new study shows  Scientific AmericanMenopause linked to loss of grey matter in the brain, poorer mental health and sleep disturbance  cam.ac.uk",
    "published date": "Tue, 27 Jan 2026 00:04:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE14eERsaTEwUkVxcFh0Ni1VNU5JbHUzQ0dxQXpQNVhvMnJfSW8zTTZGMmhIbU1NbkVHbXhiVVlRQk5GTmFoTXNidkNDSllrb3JQZUVMXzJaT0Q1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "South Carolina measles outbreak is largest in US since measles was declared eliminated - CNN",
    "description": "South Carolina measles outbreak is largest in US since measles was declared eliminated  CNNTracking measles outbreaks and cases in the US  wisn.comAs U.S. is poised to lose measles-free status, RFK Jr.'s new CDC deputy downplays its significance  CBS NewsOfficials report increase in SC measles cases  abcnews4.comSouth Carolina Is America’s New Measles Norm  The Atlantic",
    "published date": "Tue, 27 Jan 2026 18:37:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQa1dfWWFpWTBWU0JycVZlX2ZZSzY2ZTlLYl94LWZXNHFnS0Q1Q21SLVJfTzBUVGFTaDBMOVVDckZJa3ZsYm5SV0k4eGVVMGdOeDRLcWUyakFDS0RyY2ZHaVdfOGhTNkxQdmFqemZfMmpiN19kSXg5NHozSWF0ejVRcDFSSWtvSzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Exclusive: In major test for longevity field, FDA greenlights study on a 'near total reset' of cells - Endpoints News",
    "description": "Exclusive: In major test for longevity field, FDA greenlights study on a 'near total reset' of cells  Endpoints NewsScientists May Have Found a Blueprint to Revive Old Cells  ScienceAlertThe first human test of a rejuvenation method will begin “shortly”  MIT Technology ReviewCan aging be treated at the cellular level?  Penn TodayIT PAYS TO KNOW: Can We Slow the Aging Process?  rafu.com",
    "published date": "Tue, 27 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNa3ZOa1VvMWwzc2hPZHV0VkZBRnM5aFowZ2JHSW9USUFQV1BPX0tvVHlxZGw3U2FheC1fMnZKdTFLX2EyUnBGTHZzV1pWSGx6R1Eyd1g4eEFPVnI3S0dmZmdkbHdWRkRNTzhPVXNjbFZTMEV0MTJTOWdNUEVvaGJRNk9JeDNhSlNJaEY5OTR2bVBjNVd0bmFkRzBibw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://endpoints.news",
      "title": "Endpoints News"
    }
  }
]