[
  {
    "title": "Federal Judges Uphold California’s New Congressional Maps - The New York Times",
    "description": "Federal Judges Uphold California’s New Congressional Maps  The New York TimesIn a win for Democrats, court allows California's redistricting plan to proceed  NPRProp 50: appeals court rejects Republican bid to block California maps  The GuardianFederal judges allow California to use new Democrat-friendly map ahead of 2026 election  CNNJudges reject GOP bid to block California’s Democratic-favored congressional map  The Hill",
    "published date": "Wed, 14 Jan 2026 21:26:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNRWZfY01iUXFURWJ6MlRjazBvVjd4d3lmbFJoQURPQnEwTWdUczVaZEJlUkF0UkgwS3FFNmhUMzkxcWxscTM2SENTOHZXNXpCUHdwU2p1Y09KZFdEWUlzWkE2c0NzT1UxTjZTSVl2RjMzQmFHVEV6bk5jZUNNa3luQjdNdjdtSjRaeXBmYTV4N1E1bzB3aUJXQkNOOFNpSE00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Democratic lawmakers file articles of impeachment against Kristi Noem - The Guardian",
    "description": "Democratic lawmakers file articles of impeachment against Kristi Noem  The Guardian\"Performative bullsh*t\": Some Democrats fume as Kristi Noem impeachment gains steam  AxiosRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT MirrorDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOWNoem job approval slips to 36 percent: Survey  The Hill",
    "published date": "Wed, 14 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNHNuSEtZZWpSR1VxT2tNLWRuOGlfd19rejZOeU5UN25QYUdwTDlGVkFYekpEY05ZWVJORk8wSFlXd0Z1V1ktckkyVmxrbUFhbUU1aGp3MU1DWmZCQ3Z2eTBHdXdfOVNmczVUVjcyZ0xfSXRGRjhwd04xMVhUU2dJLUo3QmZ2NzdlMEY0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "F.B.I. Searches Home of Washington Post Journalist in a Leak Investigation - The New York Times",
    "description": "F.B.I. Searches Home of Washington Post Journalist in a Leak Investigation  The New York TimesFBI executes search warrant at Washington Post reporter’s home  The Washington PostFBI raids home of Washington Post reporter in ‘highly unusual and aggressive’ move  The GuardianNothing Is Secure  Columbia Journalism ReviewUS defence contractor arrested on charges of leaking classified material  Financial Times",
    "published date": "Wed, 14 Jan 2026 21:21:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOQ0J2SWdYVmJBMVJ3c29XalplRFFlTFAwalkzcTdnd3NtLUVLNzE5ckFQS0NRbHQtUWFFRElBUnJzZDgya0VyWjRsdllPN25RVkllc3k0c2FPay10YW54cURpek93c0tVOTEyUzA1WUdCR0ZDc3VJSEhoWmRwMjVrMWcxd1dETWIxZWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted? - The New York Times",
    "description": "Can the ICE Agent Who Shot Renee Good in Minneapolis Be Prosecuted?  The New York TimesNew documents shed light on Renee Good’s ties to ICE monitoring efforts in Minneapolis  CNNBlakeman’s ICE thaw  PoliticoAnti-ICE protests continue with demonstrations at Graduate hotel, Whipple Federal Building  5 EYEWITNESS NEWSHow the feud between Trump and Minnesota is impacting the probe into the ICE shooting  NPR",
    "published date": "Wed, 14 Jan 2026 21:30:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOR0VEVE9mRHpWaFdCcEFnQWtfcjZkU19Xck91eTRXU25VakpFRXNoMElDdGhtRFFZOTA5SkkwV3RLZG1jZW5rZ0NBaGZ0VnpyUGJPSDVFWGNkV2JadlFYNlExQkxLRTFuNGlzNU9IcVh6WWlOVVhhNVdMbkZLRXlsaVNBM0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Half of Americans think ICE is making cities less safe, poll finds – live - The Guardian",
    "description": "Half of Americans think ICE is making cities less safe, poll finds – live  The Guardian5 takeaways from new polls of the Minneapolis ICE shooting  CNNMajority Of Voters Think Fatal Shooting Of Minneapolis Woman By ICE Agent Was Not Justified, Quinnipiac University National Poll Finds; 57% Of Voters Disapprove Of The Way ICE Is Enforcing Immigration Laws  Quinnipiac University PollNEW POLL: Criminal Charges for Trump ICE Agent Who Killed Renee Good Favored — By Whopping 23-Point Spread  YahooMore Americans view the ICE shooting in Minnesota as unjustified than say it is justified  YouGov",
    "published date": "Wed, 14 Jan 2026 20:11:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOcDVjZEFhQXRnSHpLcmZjRUVaSXp0V2xLaFU2WU9UamNoMmZMdVhjOGVPV19YcEl6YjVqeHRDS0lBYTdLaHlvRVRwV21UMlZCdkJORlVscXgxbUo0bUlaRS04N2diWlI3WEVmWk84ZmZjdXVUaFZXbmw5RWtDQm9MLWp2TkxhQnRlRkhtNE5tMHBVVDJJbU9mXzFDQlQ3aWVSZlQyTjBtOHVfX1FUdU5nNDE0QUVkU0hhcGN4MHRsa3pBSENuakJjQ1lUYS00R0RaS0JBQXRRWlIxelE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US announces start of phase two of Trump's Gaza peace plan - BBC",
    "description": "US announces start of phase two of Trump's Gaza peace plan  BBCUS announces start of second phase of Gaza ceasefire  The GuardianWatch live: Trump makes announcement on Gaza  The HillPhase two of Gaza peace plan will be complicated, protracted and unpredictable  Sky NewsTony Blair poised for role in Gaza governance  politico.eu",
    "published date": "Wed, 14 Jan 2026 18:37:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1fUnNNNmlKR290ZFhVS1lXSFl5NHFVdzlVdlh5Mk1uemVPNmlUOWluaHk4dU1CZmJhaWVYOVJ5TWFSckFGeHVPUFRubWVWNVFNZGd5WERHT3h0QdIBX0FVX3lxTE1ZdHpfdHIxTkhKMGRYQUh1WWYxSHJfZi15aDZVT1AxdGxhV1phSEVtbU1MaVkySk50S2tKZVc5QUI5bkc2VlhQVmx2UEtRaFRITXJQeGF4eXRzQ1g5djNF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Embarrassing floor meltdown has House Republicans questioning their leaders - Politico",
    "description": "Embarrassing floor meltdown has House Republicans questioning their leaders  PoliticoWhy the House GOP leaders’ failure to pass one of their own bills matters  MS NOWU.S. House defeats bill that would have excluded certain overtime training  Brooklyn EagleHouse rejects attempt to enact PRO Act, then dumps GOP anti-worker bills  People's WorldGOP Spikes Legislation Widening Tipped Worker Wage Loophole (3)  Bloomberg Law News",
    "published date": "Wed, 14 Jan 2026 22:57:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPVTZqMU1JQXVKVnFqcUJvVk9UUEVLZ1FtRjI2WTI1YWU0b0FDMXpRMjRFZWhSX1ZTS1VhWUp4OUw2MXFDUTB5M2dsTmRhZW1kRHZtNUhyaXRoUXREa0pWQmd6NWZXSkVMaG9Scmx5NFllVVZhSVR6eHVtRmxSNmRFMmxDRXhDdEhQdXZJcnhRUWFIRmhEejZBSXBoYnp0cHpTVG95WUN2Mnh5TkVHX2g1ZFdxNGVmU1dFT0hUR3RRc2hhWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "House passes 2 more funding bills — with 4 more to go - Politico",
    "description": "House passes 2 more funding bills — with 4 more to go  PoliticoDHS at center of progressive revolt as House advances $80B spending package  Fox NewsReport Video Issues  C-SPANHouse passes two-bill package to fund Treasury, State departments  The HillHouse takes up next funding package ahead of shutdown deadline  CBS News",
    "published date": "Wed, 14 Jan 2026 22:42:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNRkliem5US1JFTG1tTmNtdXJVeHl1TUZETWZJV1VuajNka2JZd1BQS0tlUGJxRnMxWm5sSVVCMzhXckJpMVY4Y1JTbl85ZW1sTmlfd2YtVHdKUWN4MHJwNEp5UzJfRGo2eDJ5STZyZU81eHc3b05zOENRaFV2bzJici1nQ21NMW84am94RHZ6dlJBSVlMMUZRN01qb2F3RlhrMXg5Q0pabS1QR3hCekloclFzRFhkbFpxdW15aE5YZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’ - The Guardian",
    "description": "Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’  The GuardianYou’ve Heard About Who ICE Is Recruiting. The Truth Is Far Worse. I’m the Proof.  SlateJournalist Tests ICE Recruitment; Surprised to Find Herself Hired with No Background Check  Democracy Now!The Clown Car Needs More Clowns: ICE Desperate For New Recruits  Racket MNAnti-Trump journalist claims ICE offered her a job after six-minute interview and ‘sloppy’ vetting  The Independent",
    "published date": "Wed, 14 Jan 2026 21:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQUjdqSWpldWxCLXJQblVfQkpQZC1heWtjRlpBcGJXeGVGOG9Vb0o2LUthcnh1bkVCOU4xVG5idTZNV0NxVldBZTZZY2dwZGxpMmJ3OXZhSFlYUkVKb09lZWd6TWZqZmJoVnUxYWhQM1RhSHZfakxkMWJWeHFoRzdOT1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Mark Carney Heads to Beijing to Discuss Canada-China Relations as U.S. Outlook Darkens - The New York Times",
    "description": "Mark Carney Heads to Beijing to Discuss Canada-China Relations as U.S. Outlook Darkens  The New York TimesChina's 2025 Canadian import slump to remind visiting Carney of economic stakes  ReutersChina urges Canada to break from US influence as Carney visits Beijing  AP NewsChina to Offer Canola Relief for Easing EV Curbs During Carney Visit  Bloomberg.comCanada’s Mark Carney faces delicate balancing act in China visit  BBC",
    "published date": "Wed, 14 Jan 2026 15:35:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYlA2aXVjRXhILThjZlZGNFdWbTBDY3dLc2ZGMzhTamFVWVA0VUdibUZ5RXBqeDNTZy1LUjc4VmhodFZNeHFNUi1yX3VZSWJvd1ByR0FPNVFaamRxOW1jRFBwbWtfYWdTR3ZiWjBmN25kWlZYRXJRV0xqbUlwRkYyc3JCUktFLWEtMDFJY1h1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Why Greenland Matters for a Warming World - The New York Times",
    "description": "Why Greenland Matters for a Warming World  The New York Times‘Completely bonkers’: Trump’s Greenland mining dreams collide with reality  CNNGreenland’s Billionaire Investors: Bezos, Gates, Altman And More Followed Trump’s Lead  ForbesTech investors assess minerals mining as U.S. takeover talk on Greenland grows, CEO tells CNBC  CNBCEurope neglected Greenland’s mineral wealth. It may regret it.  politico.eu",
    "published date": "Wed, 14 Jan 2026 15:16:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1XSlhvWFVVMEFza2NvdUk1ZGktWTRfM2VqdHg3NndkcHNmNE1oVFdzTWRLbnhXYTNkOXczd3BNbk5fa2pKbEdDV0pRbE5RSXBIbGJVdGdSNTJzTjB6ZlZ4N05xNkwzX1lJU1JBTFFZTnJBZWRsUnkwV1N3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US will suspend immigrant visa processing from 75 countries over public assistance concerns - AP News",
    "description": "US will suspend immigrant visa processing from 75 countries over public assistance concerns  AP NewsUS suspending immigrant visa processing for 75 countries  CNNTracking Trump: Trump pauses visas for 75 nations; FBI searches a Post reporter’s home; Vance meets with Greenland leader; and more  The Washington PostUS freezes all visa processing for 75 countries, including Somalia, Russia, Iran  Fox NewsA Guide to the Countries on Trump’s Travel Ban List  Council on Foreign Relations",
    "published date": "Wed, 14 Jan 2026 21:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVHNpZjljY3NwV2hBekJra083SEtDaFZ6c0NxdmFORFdKRkdQV05KWVVFT0tKeHpnVi1FSWtMUlJicTNlQm5qcW5iODhFa09LbEl4YXhQeWNEdkJTRlQ3cFUtOHdGcVUzdy1PSzFwWEkyQXVqeTN4QnkySU1SLU5SNmR3VUg3Sy00M0lJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Iran’s opposition is battling to oust regime but hobbled by divisions - The Washington Post",
    "description": "Iran’s opposition is battling to oust regime but hobbled by divisions  The Washington PostJeremy Bowen: Authoritarian regimes die gradually then suddenly, but Iran is not there yet  BBCIf Iran's government now has an 'expiration date,' what next?  NPRThe Islamic Republic Will Not Last  The Atlantic‘The Ayatollah Has No Clothes’: What Iran's Historic Protests Mean For The Future Of The Regime  Forbes",
    "published date": "Wed, 14 Jan 2026 18:00:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPTEFhMDhlb2JuUVdsdGlheU9wcWIyeTJaNU1JNmczTTZVVU81cXphTWxZOWNLZVpFYjNjX2JycFBVTDllQ20tSmpUOU1CQmVOZFVMRUR0LXFKWjFsNDdkaEFXazFlb0RIRVN0VV91UFozc0pfYmR0TGRmVUNJVWZLQXRKQnh1Y2U0aF9Nb2ZTdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "S&P 500 books back-to-back losses as tech sells off, Bank of America slides after earnings: Live updates - CNBC",
    "description": "S&P 500 books back-to-back losses as tech sells off, Bank of America slides after earnings: Live updates  CNBCStock market today: Dow, S&P 500, Nasdaq retreat as tech leads market lower, banks slide after earnings  Yahoo FinanceStock Movers: Bank of America, Citigroup  Bloomberg.comStock Market Today: S&P 500 Slips After Bank Earnings; Gold, Silver Hit Records — Live Updates  The Wall Street JournalWall Street ends lower, led by drop in Nasdaq, with tech, banks falling  Reuters",
    "published date": "Wed, 14 Jan 2026 21:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE00Rk52cFUxbFF1THA4d3VTb2xRVGN0OU81LXBlZUR6ci1CcnN3NHFDd2F4bTRvVFNUTlV6Q3RHYlVmb19WSkdJSVZwZE9FSlItaXlHWmJjblk0VFFvbmxuRUpoRmtKcE9vd0JuTG4tQXJQUjNRRDlF0gF8QVVfeXFMTlRocVBRN1lCVDdhV3NUVW5VV3ZnNFFsMTlEenZ6UURxSlhKTnQyQklWbW1aOUxpTTFiS01OMDhJUU1QUWhDTnBONWwzU3hQanhwYWx1TWNYQ3cwWG4zUE9fclVpUXhRYmN2MEplMkFaaktSNnY3RDRtbGJFYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump’s Credit Card Threat Casts Shadow Over Wall Street’s Profit Parade - Bloomberg.com",
    "description": "Trump’s Credit Card Threat Casts Shadow Over Wall Street’s Profit Parade  Bloomberg.comDo markets price a Trump risk premium?  Robin J Brooks | SubstackWall Street gets hit with Trump's \"flood the zone\" policy fire hose  Axios'Going to be wild': Investors brace themselves for 'market-moving' chaos from Trump  AlterNetWhen 'TACO' becomes 'Big MAC,' how does Wall Street seek a safe haven amid policy 'chaos' on the eve of midterm elections?  富途牛牛",
    "published date": "Wed, 14 Jan 2026 17:41:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPS0RQMWt1MVQ2TTJzOUVWQkRLQ0FzZWhVQUlVSUVTYXJqUThmaEQxTG13bUpmZGFOaEhXR3hHMGY0WHBKUUwzTGJWcXRKc1lxVGZHVkozZDdsSi1CZ3ktZDg4SF9Na3JKZGxhU3JVOGRxSi1TTkM1YW1fNjc5THgxYlNCUHhIWC1PcVp6WjNfcjhNTzZCOWNNRUFBOGxSMHc5WHJBZmczVTBINi1qWXZvaG9Icw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "3 ways to invest in what could become a $200 billion market for humanoid robots - MarketWatch",
    "description": "3 ways to invest in what could become a $200 billion market for humanoid robots  MarketWatchBarclays’ shiftless robot report  Financial TimesBarclays Research Finds Humanoid Robotics On Track to Become a $200 Billion Market by 2035  Yahoo FinanceGefährliche Überproduktion: China flutet den Markt mit Robotern – Wiederholt sich das Photovoltaik-Szenario?  Xpert.Digital - Konrad WolfensteinGlobal Humanoid Robot Installations Reach 16,000 Units in 2025 as Mass Production Picks Pace  Counterpoint Technology Market Research",
    "published date": "Wed, 14 Jan 2026 20:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOWWlMZ0YtVkktQndhczNCUXVSa0M5TXF5ZGVOTi1ZTU9uOUJMLWJYVVFCcThpY1JJdzhmQWVLQnJVMlIzWVJmSVlEQW1HbzFPOF9TNlBwRUhXSE5nUXNLN0lZdkpXcUo4cmp0RXd3M0c4QlJrbXlscGdUQ1g0QmJFUVZNTU5HcF9fWUc1Tk5PVlFIV3FEcnBLcnhaYW5GYVRtMVU4bjcxeDlzLXhxM3VSZnZhdUZfek1ORDNWVGNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.marketwatch.com",
      "title": "MarketWatch"
    }
  },
  {
    "title": "WFC Earnings: Wells Fargo Stock Slips as Q4 Results Disappoint Investors - TipRanks",
    "description": "WFC Earnings: Wells Fargo Stock Slips as Q4 Results Disappoint Investors  TipRanksWells Fargo Shares Fall Most in Six Months After Profit Miss  Yahoo FinanceWells Fargo Stock Slides After Income Misses Forecasts  The Wall Street JournalWells Fargo Reports Fourth Quarter 2025 Financial Results  wellsfargo.comWells Fargo’s profits hit by severance costs as bank lays off 5,600 workers  New York Post",
    "published date": "Wed, 14 Jan 2026 14:23:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNaEFMYUJQX1F5UHVxWU5FM0JOaGNmM005Q1ZOX0c5dnFPWWF1WDZYRFNfX1U0Z0tRR3JvSTFJTGhZa19hT0R0eWRnenJCR1NxTUdCbmlqT1FZS3J3V2pUcW51TnRuZjVwTmhNdTNPVzB0U09PUVRmMUFYOE9mVEN6YlJSaFpGSkV6VkFqVDlHQmx6cEsxbjdON1hMUUxUdXVMM01z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tipranks.com",
      "title": "TipRanks"
    }
  },
  {
    "title": "New Pixel 10a leak reveals price, exact launch date - Android Authority",
    "description": "New Pixel 10a leak reveals price, exact launch date  Android AuthorityGoogle Could Revive Last Year's Bright Pink Color for the Pixel 10a  CNETPixel 10a Hitting Online Retailers With February Launch Date  Droid LifeGoogle Pixel 10a vs Samsung Galaxy S25 FE: Battle for the affordable flagship crown  PhoneArenaGoogle Pixel 10a release timeline leaks along with colors and storage options - GSMArena.com news  GSMArena.com",
    "published date": "Wed, 14 Jan 2026 06:50:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPOFFLVF9sSHhsaTRpaGo5WEJJWDFDMFJhMlVzN3h0UXNsdm5WdFhiUU9LdDBMRkZuSXdlczgza0N4eDgwdlYxaXZUSGUwaXJ0WlZzcnBKNDdEU2IwMktCMjZzZ19IWF9GOXJVdlJ5TWktT2lJSzg2RXhwRERVTzhuN25ra1k3czE4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "This new Google Photos feature could be great for your phone battery (APK teardown) - Android Authority",
    "description": "This new Google Photos feature could be great for your phone battery (APK teardown)  Android AuthorityGoogle Photos may finally let you choose when your pictures are backed up  Android AuthorityGoogle Photos backups may soon play nice with your phone's battery  Android PoliceA new backup scheduling feature has been spotted in Google Photos — but it's not live yet  TechRadarGoogle Photos could let you set backup times with a new Backup schedule option  Mint",
    "published date": "Wed, 14 Jan 2026 07:12:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPeTVSSWpqXzJ6d3N6UTZORF9GYV9nU0ZzRnUxcnRqYnA3cm50WkJKWno4ajVGek1XXzR3TEpWTG5XalM3WUw2SUg2MDJONzEyNzhtWm1UNlhOTlNXUEtqZGJacEVtSGFTYVA5VURHbUVvNERudmgyb05MVjJEWVNtNzZkNk4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.androidauthority.com",
      "title": "Android Authority"
    }
  },
  {
    "title": "Signal’s founder says ChatGPT can’t promise real privacy — so he built something that does - TechRadar",
    "description": "Signal’s founder says ChatGPT can’t promise real privacy — so he built something that does  TechRadarSignal creator Moxie Marlinspike wants to do for AI what he did for messaging  Ars TechnicaSignal’s Founder Turns His Attention to AI’s Privacy Problem  GizmodoConfer is a new AI chatbot with Signal-level privacy  Trusted ReviewsSignal Creator's New AI Assistant Won’t Read Your Chats—Not Even the Admins Can  Android Headlines",
    "published date": "Wed, 14 Jan 2026 11:05:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOOGtNcjdGTDNNeHFWejVOR0tNZ0tDTXhXN1YtYS0xeDRURFJwRzk0RUVWWDE1VWtWejV5NlpFYkl4dnZpZGhJaFcxaWpSa0RFb1lIWWxycmcwWVo5SndUVTFZQjFyOVROSTBrUlM1bDQybmJJQ2VzbFB0VVlBbWlIR3pWemhhR05rSlRXMWZwa1hYZEU1OW5SNkxpakNua2R3Zkx2YWxidjZ3S0dWZDQwUE9hY1lxU0J3MHhOT0pQQW1HUFgwX2lzX3A5cjVqb1Q2b3VibA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.techradar.com",
      "title": "TechRadar"
    }
  },
  {
    "title": "The Coolest Gaming Tech Unveiled at CES 2026 - hypebeast.com",
    "description": "The Coolest Gaming Tech Unveiled at CES 2026  hypebeast.comXbox is cooked. Why your next gaming console will be a PC  PCWorldWe've got enough premium handhelds — focus on the weird and affordable  Windows CentralWatch Live: Our Experts Dish on Tech Trends That Will Define 2026 for Gamers  PCMag UK10 of the Best Gaming Handhelds For Bringing PC Gaming On The Go  Gadget Review",
    "published date": "Tue, 13 Jan 2026 18:28:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9TTTl6c2FtclJvSmoyOV8zY18yNWt5WXpqS1ZwbjV1LUtXTGg3OGJ5akFuMmZnSmwtZEdxbEtRMjVpUlVNeFhSZnliQ2tXZUdWYUJndndFeWNFcmdza0I2cVNsamhjX1Vpakd0cE9oTVFqakxW?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://hypebeast.com",
      "title": "hypebeast.com"
    }
  },
  {
    "title": "'Diff'rent Strokes' Actor Todd Bridges Splits From Wife, Headed for Divorce - TMZ",
    "description": "'Diff'rent Strokes' Actor Todd Bridges Splits From Wife, Headed for Divorce  TMZ",
    "published date": "Wed, 14 Jan 2026 22:36:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFA5bmhEUlFtRXM4VlYzdll5dWVEOXBPWWVheW85VEtsQ2NRWDVfX1RGVUZtYkRZbE5uSXFEckZTYmRDX0gyV09ZOUdjRDBQcFhjWmU3ZlRCRzF3Rjl0c05BdGY2cDZua2RfSEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tmz.com",
      "title": "TMZ"
    }
  },
  {
    "title": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office - The Hollywood Reporter",
    "description": "A Marketing Wonder: Timothée Chalamet’s ‘Marty Supreme’ Passes Up ‘One Battle After Another’ at U.S. Box Office  The Hollywood ReporterTimothée Chalamet brings a lot to the table in 'Marty Supreme'  NPRWhat’s to like? Why you can hate Timothée Chalamet’s character and still love Marty Supreme  The GuardianTimothée Chalamet’s ‘Marty Supreme’ Gets Streaming Date, Report Says  ForbesHow to Serve Like Marty Supreme  The New Yorker",
    "published date": "Wed, 14 Jan 2026 19:01:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNVnJ3UEVhZmtvWVpUWTkwTkhWV2NfamRFMlNPZEpzdjZqY2llYjB0b19zLUoxRWhldGFkNk40SWM0UUR3UFJURXhmOEJmbjJWUmxrOEdXUVZ6bEdPaDFub0tUeXdLMm1QdFV0a0o5ZjQ3M1liNk5GSklxRDlqdXFMYnJpWEU0YXpnc2FseURQWldsaWRfMUJudlZmN2hMVllGSW16aXR6Zjc4emZMMGFxamtoTHVIMVQtZnlVSTY5ck00Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Scott Adams’ Life and Death Is a Cautionary Tale for the MAGA Age - Slate",
    "description": "Scott Adams’ Life and Death Is a Cautionary Tale for the MAGA Age  SlateOpinion | Scott Adams and Cancer Progress  The Wall Street JournalScott Adams, ‘Dilbert’ creator who poked fun at bad bosses, dies at 68  The Washington PostScott Adams, Dilbert creator, dead at 68  Ars Technica'Dilbert' Creator Scott Adams May Only Have Days Left to Live Amid Cancer Battle  TMZ",
    "published date": "Wed, 14 Jan 2026 16:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPNXhYOGdQUnFNU1R1RVFoLWhnMDdHajZZV0hfWjdwZHdNelBUNlR6THJiVjlFVi0ydDd1SUJUT1FscnY5N0c2dGtPSU4zdExiVDZnQ01oVG9DNUFsOGU5VUJNT3c2aXQzSUpOc0Zsd2ozaFRJSlEwTEdPRWJLcE80Y2N3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://slate.com",
      "title": "Slate"
    }
  },
  {
    "title": "Ryan Hurst Cast As Kratos In Prime Video’s ‘God of War’ - Deadline",
    "description": "Ryan Hurst Cast As Kratos In Prime Video’s ‘God of War’  DeadlineAmazon didn’t have to go far to find its live-action Kratos  The VergeGod of War Show Finds Its Kratos in Ragnarok Alum Ryan Hurst  IGNPrime Video's God Of War Series Has Found Its Kratos, And Video Game Fans Will Know Him Well  Yahoo‘God of War’ Live-Action Series Casts Ryan Hurst as Kratos  Variety",
    "published date": "Wed, 14 Jan 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNENyNERUTjRJdjJjSWVPNGRJcmFKdVRmY1c2Nkc0REdGSVp5Sk51LTlSR2xkUy1IblhCNjJFQ1FPSnJpelBDamNLRWJ5R0ZUZGZxUVZaUjRZTl8yMzBUdHF2SVprVjc3QkdsVW1UazhCZExJSmNteXlLTS1Va1RESWxlU0RPSVVRR1prUXg5UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Miami bidding to be 3rd largest underdog to win title in BCS or College Football Playoff era - On3",
    "description": "Miami bidding to be 3rd largest underdog to win title in BCS or College Football Playoff era  On3CFP National Championship first look: Previewing Miami-Indiana  ESPNMiami vs. Indiana prediction, odds, pick for CFP National Championship Game  Yahoo SportsWhat you need to know before trying to park for the Canes National Championship game  NBC 6 South FloridaIU football watch parties for public filling up fast  Indianapolis Business Journal",
    "published date": "Wed, 14 Jan 2026 16:00:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNUVpBeE9TcnJBLVpveFI3NlREQWZyY0luQlpTWjZWUWtfMUNUUWtzLW84bTVuclVoTWo3dUlQOWV1c0FDb3h5dlFkSWZQYU5LbzM4ZXJnOFFJSUlxNjdYMkJCaGVKdGg2TVRhVVpKa0FlR0REZ1hzS0wyY1VQeVlhYzl3S3F1LTRfaTFfSHEtM0FKR2Q2TndOZDZTc21pNHYwTjNndzJVdGdOZl9Tal9hdWROUnRSVFpyVEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.on3.com",
      "title": "On3"
    }
  },
  {
    "title": "Report: Harrison-Nunes UFC 324 title clash ppd. - ESPN",
    "description": "Report: Harrison-Nunes UFC 324 title clash ppd.  ESPN'Biggest women's MMA fight ever' is postponed: Harrison has surgery to repair herniated discs in her neck  Eagle-TribuneFive Amanda Nunes Fights To Watch Before UFC 324  UFC.comUFC 324 fight card: Kayla Harrison vs. Amanda Nunes postponed due to injury  CBS SportsKayla Harrison off UFC 324 due to neck injury, Amanda Nunes fight postponed  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORUQ2RGRENC02cHVVazAyNnM3Vm5LcC1LR2ZvX3RxTWs4NDBDeHZuQjlMY0FidjlOZVNKV3c5VjJSajdrTF9DbHVXSXRPTFNsM2hmWlJjdU1RX3R4ODBhWHBWaWxqUnAzUnU0WUNicUV4czVQTURpTU9TNk51QVdtNXdBUExLb0dPNEg3aE00WjYtYnNNbk9qWUlwYmh5dDd0dnR0STF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Red Sox To Sign Ranger Suárez - MLB Trade Rumors",
    "description": "Red Sox To Sign Ranger Suárez  MLB Trade RumorsSource: LHP Suarez, BoSox agree to 5-year deal  ESPNWhy Red Sox are forfeiting two draft picks (not just one) by signing Ranger Suárez  MassLiveRed Sox pull off big pivot with 5-year deal for Ranger Suárez (source)  MLB.comRanger Suárez reportedly inks five-year deal with Red Sox  NBC Sports Philadelphia",
    "published date": "Wed, 14 Jan 2026 22:17:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9tODAwTnZnR0Fncklwa2JTRGp0WXlmQVJBTUpCYVBqOVlhT2ZkVDVXV09tT0YzZmRzc2NIbmQ3OE1RbzIxTXhMMmRwSU9WTXpEWjZta1pUaEk4RkY3TEZ0UmJ1ZjdYR19DSkdLV0FKVUtUc0JVMFY2SGZtekpDdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "NFF Announces All-Star 2026 College Football Hall of Fame Class - National Football Foundation",
    "description": "NFF Announces All-Star 2026 College Football Hall of Fame Class  National Football FoundationIngram, Suh, Donald to enter College Football HOF  ESPNJerry Azumah and Olin Kreutz are College Football Hall of Famers  AxiosGary Patterson Named to College Football Hall of Fame Class of 2026  TCU AthleticsNdamukong Suh Gets His Due: He’s a College Football Hall-of-Famer  Sports Illustrated",
    "published date": "Wed, 14 Jan 2026 19:23:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPQkVENVB0cHZWZEpheWRUTXJhVUpuWFplYXFQTHY0ZUdrekVaYllNSmkteVhocVlFT3ZUTE5sTmxXNDgwTXNJdzdRdGVDalNGM0FrZzZBaUJGTTZXbUljendVZGNFeERORDV1OE5jQXhjRWxkb2J1UHFHYmxQbmRtM0Z4TnFDazZEbEc0R3FWQlpJcWNKOE10dW1sOEpQd2VkM184MEtuaXpvZE5lX0FIdzJ4Wlc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://footballfoundation.org",
      "title": "National Football Foundation"
    }
  },
  {
    "title": "ISS astronaut medical evacuation latest news: Crew-11 astronauts now returning to Earth - Space",
    "description": "ISS astronaut medical evacuation latest news: Crew-11 astronauts now returning to Earth  Space4 astronauts depart ISS, leaving behind just 3 crewmates to staff the orbiting lab  CNNNASA to Provide Live Coverage of Crew-11 Return, Splashdown  NASA (.gov)NASA to Begin Space Station Medical Evacuation: Video and What to Know  The New York TimesCrew-11 to undock from ISS with astronaut who suffered medical issue  Spectrum News 13",
    "published date": "Wed, 14 Jan 2026 22:40:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxORVN3TUt6TVJjZVBic3JkUU1FUWsyN0NwQWRaUHNRT1pvclpRM3lsMjF4QzlOY2plZ0M2Q0R0cEFubHdJQlFPRUJvRm1lLW9mTFEwaXJtUEZZODhuZHh6NnVXZlYwVkxLV1ItamVDTWVTU2ZRRmlpRzJpTmhLQU1OWTNfMmdOdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch - Spaceflight Now",
    "description": "SpaceX breaks pad turnaround record at Cape Canaveral with midday Starlink launch  Spaceflight NowSpaceX rocket launch from Florida this week. Here's where, when to watch  Florida TodayStarlink satellites lift off on SpaceX Falcon 9 from Cape Canaveral (video)  SpaceSpaceX  SpaceXSpaceX rocket launching from Cape Canaveral  WESH",
    "published date": "Wed, 14 Jan 2026 20:27:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNalQ2VWJ5VEV3MzQxLUJOUUdBb2F3WTZLWTJzNUFLb0VMTmhCUkRKNHYyRmt4VTF6N2ZrT3ZJYTFsVVNXYWVtalR6c2RtdmZrc1JSdGZ2c1RFYTB1dTFyeUhsdS1KMlNtaF9YUEV6SXJzYVZRN3oyeG5XanBVWkVtTGRpeFNEeU5HbDBuMnAxOW9lYml2ZVk5S2hjRFltdl9EeW1HdnJMMnlRTHRBdXJWdjc3NVhoTENVcm0yMHQ1dUduU2tEZU9wR0FzeG16UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "When does the Nasa Moon mission launch and who are the Artemis II crew? - BBC",
    "description": "When does the Nasa Moon mission launch and who are the Artemis II crew?  BBCCoverage, Briefing Set for NASA’s Artemis II Moon Rocket Roll to Pad  NASA (.gov)5 Ways NASA’s Artemis 2 Mission Will Make Spaceflight History  GizmodoNASA's towering SLS moon rocket could be rolled out soon in Florida  Florida TodayNASA returns humans to deep space after over 50 years with February Artemis II Moon mission  Fox News",
    "published date": "Wed, 14 Jan 2026 10:13:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA4d3Z4Ty02UWNzRUZPUmJyTmlOc05VOTI0NS1BMk5QTGw1SkFYRjBVUGEtMG5MbnJQQkdHTnpUU25CMlJqMjhMOEFFVWRwMmpnazQ5UTJ3aUZkQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Mega-iceberg A23a, formerly the world's largest, turns into bright 'blue mush' as it finally dies after 40 years at sea - Live Science",
    "description": "Mega-iceberg A23a, formerly the world's largest, turns into bright 'blue mush' as it finally dies after 40 years at sea  Live ScienceWhy is this infamous iceberg turning blue?  Popular ScienceMeltwater Turns Iceberg A-23A Blue  NASA Science (.gov)40-Year-Old Iceberg Turns Vivid Blue as It Approaches Total Disintegration  ScienceAlertMassive iconic iceberg turns blue and is \"on the verge of complete disintegration,\" NASA says  CBS News",
    "published date": "Tue, 13 Jan 2026 17:35:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNUHZvSlAxSUQ1Qk1sdkJ5QmtuYVg0VEJLaVNNLVM4LUNpXzduR1VGd0tqdjNvbnlYQkExSGt0b1ZQamlaUFRYVXVxVzdRd1JoMGpQek9UcGpienBxeGFrUGNFbnNqUDhta3E0bm9tQVZRS044YlZsUmZmNE1MaG9RXy1qMk15R2pyOE01dnU5dy0yVUxBN05nVllZZG03bEhvREx2WHdQWExOSVhhQVZuc3pMVUZlRkFKdVI1bTBxUWlObUxiamdFOWxocUJCell3eGFoMnNvM2o2ZDQtLXQwRzMxV0cwa2gzWm9PQzkwTWFGUkZ0aHl4NHNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Massive brain study reveals why memory loss can suddenly speed up with age - ScienceDaily",
    "description": "Massive brain study reveals why memory loss can suddenly speed up with age  ScienceDailyHow Structural Brain Changes Are Tied to Memory Decline  Technology NetworksMega-Analysis Shows Why Memory Declines With Age  ScienceBlog.comThe Sad Reason It’s Getting Harder & Harder To Remember Simple Things, According To Psychology  YourTangoMemory loss can suddenly speed up with age: Study  lokmattimes.com",
    "published date": "Wed, 14 Jan 2026 14:56:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE0zVk5WUUIxZlNZY1R4VGJrbHE3aTRRZkg4dHR1MlI4TEtweVR2QWtkNENpQTBpRjNWSmVnUG1INkZ0RUk5UkJMaUNQbVBxbU1fYThkVWFsUlRkeUY5dG5UdmNraFI2NVEzT1ctLTVUNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencedaily.com",
      "title": "ScienceDaily"
    }
  },
  {
    "title": "Medical Groups Will Try to Block Childhood Vaccine Recommendations - The New York Times",
    "description": "Medical Groups Will Try to Block Childhood Vaccine Recommendations  The New York TimesHealth officials slash the number of vaccines recommended for all kids  NPRCDC Acts on Presidential Memorandum to Update Childhood Immunization Schedule  HHS.govRFK Jr.’s theories about vaccines are about to be tested  PoliticoNew CDC Guidance Could Revive a Rare but Deadly Disease  MedPage Today",
    "published date": "Tue, 13 Jan 2026 16:13:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcmQ0ZHdmdVlLOTBhTW1aTWJYR2dBdDh2VGt3d3Rob2Vnd2Zac0hjVTVfc3FiQnBhMTlzWFVqQTJKR3FHa2VxQ2xPY3pINkJ2a2s1Zzh1eTRWRkxvT2YtQlc1UkxlMUpMSl8tQjVHS1lpVU9qamZsSTFzLVQtcFVHck1pRkZ4QVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "description": "Patches of low vaccination in the US are becoming bigger, riskier holes  CNNNonmedical Childhood Vaccination Exemptions Are Climbing  MedPage TodayEarly Vaccine Delays Raise Risk of Missed MMR Dose  European Medical JournalRising Vaccine Refusals in US Children Increase Measles Risk  БуквиTruveta Study Links Early Childhood Vaccine Delays to Lower Measles Immunization, Highlighting Strength of Its Health Data Platform  TipRanks",
    "published date": "Wed, 14 Jan 2026 17:33:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZVplRzZNMjRhQi12ZndfLWx3V001YlFnSWJjZWg5b1k2R1RRd0hJY2U3UHFTNk1iWmhLT19VS2RrNENkdC1MNzlyZHJiQVVYMUxnSmJ4M3BvUHdSUGd0WXlkRkRPQ3FEN3hvNkVYV1BrcGFidFhxRzRNd2w5dWJXMll6Tm1Tb1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "The 5 Deadliest Heart Conditions in America Today — and Their Biggest Risk Factors - Money Talks News",
    "description": "The 5 Deadliest Heart Conditions in America Today — and Their Biggest Risk Factors  Money Talks NewsResearch in Brief: BIDMC Investigators Lead Inaugural Report on State of US Cardiovascular Health  Beth Israel Deaconess Medical CenterCardiovascular health in the United States: Exploring the good, the bad and the ugly  Cardiovascular BusinessACC report highlights progress, regression of CVD, risk factors in US  HealioHometown Health: Cardiovascular health, kids and social media, medication for dementia patients  WDBJ7",
    "published date": "Wed, 14 Jan 2026 12:45:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxORmd1S2Ftam5tdi0xTDU2UFlVbzVoTGExa2Rha2NiR0pKYlFid0RYZWQ4bTF1dW90dW9GVHB1NHhLUTZXSVkzN1ZNNUpDcmM5R3hBc1cwRlBmb1dtMkZkQUltWUVYVHd2dExGS242QkhOaFREeVM3amFqY3R4TlR1UjN4bkk0Ry1aTThZMDhGWTF3U1Zqaks3ektzX05jb1pzSU9VeldzZ1FYQ21xRk9STHJ2OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.moneytalksnews.com",
      "title": "Money Talks News"
    }
  }
]