[
  {
    "title": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms - The Guardian",
    "description": "Democrats’ 10 demands to ‘rein in’ ICE – the full list of proposed reforms  The Guardian'An impossibility': Negotiations to reform ICE sputter as shutdown looms for DHS  NBC NewsOdds for Homeland Security funding lapse rise  The HillSenators Clash Over Immigration Enforcement, Risking a D.H.S. Shutdown  The New York TimesWhat Democrats are demanding in exchange for funding ICE  The Washington Post",
    "published date": "Thu, 05 Feb 2026 20:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPelU5dmotUnI5TVFOY0FiNEhtOFNQYUFvbW1YYVVCNEJ2X3lvTmwwTDJ4UVM1OGRJQW85eHNac1pXVzBlTVVLbERiMlN2ZVB1TmgzRXoyU2tlbjQzRlhNN2VQallXUWdON1gtbnB3Ykh1RmtNdVdmUmlRc2ptay1DQ1N4MlJrVkdJWUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Iran Is at Work on Missile and Nuclear Sites, Satellite Images Show - The New York Times",
    "description": "Iran Is at Work on Missile and Nuclear Sites, Satellite Images Show  The New York TimesOpinion | The Nuclear Threat After Tehran Falls  The Wall Street JournalSatellite images reveal activity at Iran nuclear sites bombed by US, Israel  foxnews.com‘Deeply ideological’: the rationale behind Iran’s insistence on uranium enrichment  The GuardianNew Activity at the Esfahan Nuclear Complex | ISIS Reports  Institute For Science And International Security",
    "published date": "Fri, 06 Feb 2026 10:40:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUEZ4dkVSM05WTUpkeTNfVDJxTmRON19FRDVEb0g4MTM4eVhFa25vVEdxdndHZ2I4b1pIWGdicm9PY0pTWl9BNlJrMFAxYlJtNXJseGloaXZ0MmJObWl2X0wtQzI3Q0JhNGd5OWh3dTNBdjRlTmdTTjVMYzJXNlE2NG9vRi1VN1YwdnVMYzdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Minneapolis now has daily deportation flights. One man has been documenting them - NPR",
    "description": "Minneapolis now has daily deportation flights. One man has been documenting them  NPRView Full Coverage on Google News",
    "published date": "Fri, 06 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORnQ0dlRucEtmQ0Q5clJRTmhNTTdiRmFIMkY2Z1plT21meFFjSGdPcFA2Rzk5N0RyS2VBZzFIUlcwU1VqOFUzdDVOVnlvQlF0SFpnaE1ESlVFWVlGNkFBUVV2QUFHbDFiWDVrVkVITVlHaGE4aGdsQjhCLVZlbEd1VEREblVtd2ozaTFYUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Justice Department released 3 million pages of Epstein files. What did we learn? - NPR",
    "description": "Justice Department released 3 million pages of Epstein files. What did we learn?  NPRJustice Department under scrutiny for revealing victim info and concealing possible enablers in Epstein files  cnn.comTrump says America should move on from Epstein - it may not be that easy  BBCFiles Reveal Epstein’s Money Mingled with Silicon Valley’s Tech Start-Ups  The New York TimesLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 21:14:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOWVlITUQtbzdZYTBJbjY1VTM5TzdKbzNCT3ZwcmR3eFBBdV9VWDdDVHlqZjhHWEU5RmloNHJnbEJaVG15WW0zTHVGOGItaGVxLXpLamNjMzczUFE5Y2U0MEdmakZZVDdOQlBzUFdDallDYWJnVHJKRmcwNk91UmxiRlgxXzdwVW9sZm5VQXJFbXl1VGd0QUtNekRBMUx3NU5wc2lJMnhCY1ptSWR3QnhfWGJHV05GNnVDcDRrUDF4bUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms - The New York Times",
    "description": "Virginia Democrats Propose New Congressional Maps Ahead of Midterms  The New York TimesVirginia Democrats show map to counter Trump redistricting but its future is unclear  NPRVirginia Democratic leaders announce 10–1 Congressional redistricting agreement  13newsnow.comVirginia Democrats release long-awaited 10–1 congressional map  Virginia MercuryVirginia Supreme Court will hear redistricting challenge  Politico",
    "published date": "Fri, 06 Feb 2026 02:56:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNF9WcUh4NVNuaEF1Y0Fib1R4aTVjel90S0Z4WHJmLTU4R3A4bHprVGhoOTVZZmowbjZwMlJMOXRMNy1QRXdXdzRBVEN4QnJ5eGo3LWFtLVFuNnllX3hXUWk0SmllbjEzOVVBOExSME8xa21MSWEtb0daZ3I5cnVrV1FMZXVaenpsa3czekt5YjJhZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change - The New York Times",
    "description": "Hundreds of Agents Left Minnesota, but Residents Are Seeing Little Change  The New York TimesTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsWhat to Know About Minnesota’s Immigration Policies Amid Federal Crackdown  The New York TimesIn rare move, this northern Minnesota county is working with the feds to make arrests amid ICE surge  Star TribuneTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The Guardian",
    "published date": "Fri, 06 Feb 2026 01:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13RVQtNmJxMVNtbjQ1SE9ZY1FHV3lMMml6VGFDR3JuaVRzMmNMU2ZZd3RxRTdBdFpCM0hlUE5LMjZkVFpLWHFCbmZLaFBBWGJfZTQyTWpZSFY5MjdQZ0I3am5qZVh1Nm9TS2NDV0RPZ185UHpzam1faFB1c3lINWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US strikes another boat in the eastern Pacific, killing 2 - cnn.com",
    "description": "US strikes another boat in the eastern Pacific, killing 2  cnn.comU.S. strikes another alleged drug boat, killing 2 'narco-terrorists'  NBC NewsUS military kills two people in latest attack on vessel in the Pacific  Al JazeeraUS military says two killed in strike on alleged drug boat  BBCHegseth says US strikes force some cartel leaders to halt drug operations  foxnews.com",
    "published date": "Fri, 06 Feb 2026 02:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9QMlQ0Wkl6b3JYaWRRU2M0SlF2dHV4eUtMbGpQUjkxeG05U1M4bkQxemVWS01QM0ZEYlJ2LWNxcDhoOEdPa0ljR2dlbmEtMHFtUEJ2eXhQbHU4QVk0bjg3ZWZHdEYtQUhzRmVMcE5oNHdCUHZFNm8ybnN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Japan’s Takaichi eyes decisive mandate as polls point to snap election landslide - CNBC",
    "description": "Japan’s Takaichi eyes decisive mandate as polls point to snap election landslide  CNBCTrump endorses Japan's Takaichi ahead of snap election  BBC‘Sana-mania’ grips Japan as ultra-conservative Takaichi expected to secure election landslide  The GuardianJapan’s conservative leader bets big on Takaichi mania with snap election. Will her gamble pay off?  cnn.comJapan’s election: why investors are worried  The Economist",
    "published date": "Fri, 06 Feb 2026 06:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPQU96bmlGTjAtNlE0amxidmF6c2E1MnFTR2V6NkROcS1YMGtrWVd6S2dvQXNxSDFKN2JsRjQ5WE5ObXZBaWpzMDVnc19sOGxFTGt3YUx1TVZoSkJQeDV0NjVsYldjM2o5TXJoV1hTVHFiQ2VEajhZdEhUYW5wTEZONVgyYjg1ZWRnQkVGbmZIZUhDNUZ1WmJldjR6WDhlMExFQjdaaERvMmhwTGw1SWF0R1l3Mm_SAboBQVVfeXFMTkRPMmpRYTkwS3BxQ0V1cmRlRE5GbVNlQzB5bXBFd2J5YlhSUmRFMXBBRXF3NldNY3dGV193MEVYSFJkS1h3WXJDdFlvWE1NWFgyZXY5cWpHYlhlTHN1YWlNRG9qMVNuMWR1blJwMlJYY0VqeHpvTzdDeURrZG9TbGduRkNyRDZhR3lSQm1ZUm1jdERvREFvVG9CbDhicnlWang5bVNabC1scU03X2dxTjZSdV9ZaFd0bjBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "At least 31 killed in Islamabad mosque explosion, say authorities - cnn.com",
    "description": "At least 31 killed in Islamabad mosque explosion, say authorities  cnn.comA bombing at a Shiite mosque on Islamabad's outskirts kills at least 31 and wounds scores  NBC NewsBombing at Shiite mosque in Islamabad kills dozens and wounds many more  YahooVideo shows aftermath of Pakistan mosque blast that reportedly killed 31  BBCExplosion rocks mosque in Pakistan’s Islamabad  Al Jazeera",
    "published date": "Fri, 06 Feb 2026 10:11:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1kdi1OakdYTFBDcUIzOFR5V0ZnQlJrLVNaSW1XT3NIM3lKRnFOb05UOUZCTUZxV2hLY21FcXNoUHBvS0dvaXQ5bG9LdHZQbTZ2cy11eWV1SElOY0hDck5pRmpTTFBOcXFOT1h0Mko2VmUzNHpDM1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Russian General Is Shot in Moscow - The New York Times",
    "description": "Russian General Is Shot in Moscow  The New York TimesRussian general shot several times in Moscow  BBCRussia’s foreign minister claims Ukraine to blame for attempted assassination of top general – Europe live  The GuardianSenior Russian general shot in Moscow  NBC NewsSenior Russian officer shot in Moscow in apparent assassination attempt  Al Jazeera",
    "published date": "Fri, 06 Feb 2026 11:21:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRVBpMGVfb05Ya3FJajRqYWpmNGV1VG9LRGRBZVphR2FqVW9jV3FBeEU0OEgzbXJaSi1TeTNMTEJuMXJ5cjYtbEZLaFgydU9VVFFETE80YWs3d0pZMXZkOFptM090Nnc5SncybHo4LXNkS3dkSTFlQVV3V05nSDdNeUY2SV9JSXhKTF92aTdMZ2thSVI3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Women, Children, and Medical Workers Among Over 20 Palestinians Killed in Surge of Israeli Attacks Across Gaza - Drop Site News",
    "description": "Women, Children, and Medical Workers Among Over 20 Palestinians Killed in Surge of Israeli Attacks Across Gaza  Drop Site NewsIsrael kills two in northern Gaza as Rafah crossing sees little movement  Al JazeeraVerifying Gaza footage after 20 reported killed in Israeli strikes  BBCDaily Briefing Feb. 4 – Hamas, far from disarming, attacks IDF in Gaza  The Times of IsraelThe Gaza ceasefire began months ago. Here’s why the fighting persists  AP News",
    "published date": "Wed, 04 Feb 2026 20:25:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQenBrT3V2ZTdKMG0weV9UelZBNjN3eVZGdVB6eldreHoyNm1MVmJCZmxRTC15OGxXa3ZvYjJsUkFzTmp0Wlg2d3RPRGtUTjRqaUttcmpiVUctUWhfZTdnbzd3RDVKS29aNU5jcG9KQ0hlV1VhQ3pCUmlmdmJJdkpoOTNRTFFaNGMwSUpXalpOTmZ5d0x5NVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dropsitenews.com",
      "title": "Drop Site News"
    }
  },
  {
    "title": "Uber Found Liable in Rape by Driver, Setting Stage for Thousands of Cases - The New York Times",
    "description": "Uber Found Liable in Rape by Driver, Setting Stage for Thousands of Cases  The New York TimesUber ordered to pay $8.5 million in trial over driver sex assault claims  ReutersFederal jury orders Uber to pay $8.5 million in sexual assault case  AZ FamilyUber Loses First Passenger Sex Assault Trial in Federal Court  bloomberg.comUber found liable for sexual assault by driver and ordered to pay victim $8.5m  The Guardian",
    "published date": "Fri, 06 Feb 2026 03:01:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9yeVo0LTA4MzBObGd2bHBGUXM5QVI5NGVYd0JYVEdtZTJNTGg4YnU4X1l0MWswUmp3c2p4Xy1EQWxSS2pTU3VJOFR4TjJpdFFzYk10SFhFTjBsOUQ5Q0tPNFZKWWpsci1BWWhiaGVCcUZJZXgxVFJtcEU4ZVhsdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Toyota Names Kenta Kon C.E.O. as Automaker Faces Tariffs and Increasing Competition - The New York Times",
    "description": "Toyota Names Kenta Kon C.E.O. as Automaker Faces Tariffs and Increasing Competition  The New York TimesToyota promotes finance chief Kenta Kon as CEO in second leadership change in 3 years  CNBCToyota names former secretary of chairman Toyoda as next CEO  ReutersToyota promotes finance chief Kenta Kon to CEO; Koji Sato becomes vice chairman  Automotive NewsToyota Motor Appoints CFO Kenta Kon as New CEO  bloomberg.com",
    "published date": "Fri, 06 Feb 2026 10:23:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE52NWhyU3VEVUZCb19QTDJnNjJzd1JJWndzX3praEZ1WkdkeW13Nk5fa3JqQlY4TDZMWEx4c0NDdkpjWWI3cHlrelpWQjF3V0REcElIdE44eDFBVFB3Z2NpOEY1bGZoUGVVQUVkczZUeGYwTzVUUVlPeQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Alphabet Just Delivered Great News for Nvidia Stock Investors - The Motley Fool",
    "description": "Alphabet Just Delivered Great News for Nvidia Stock Investors  The Motley FoolAlphabet shares close flat after earnings beat. Here's what's happening  CNBCGoogle Leans Hard Into Its AI-Winner Status  The Wall Street JournalAlphabet Beats Earnings Expectations As Annual Revenue Tops $400 Billion For First Time  ForbesGoogle Shows the AI Trade Isn’t Dying, Just Changing. How to Play It and 5 Other Things to Know Today.  Barron's",
    "published date": "Fri, 06 Feb 2026 03:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOVGpvVWp1Z0hnMzhnTVBfMWZZNXc2amU4NVd0Zk5aMHpuNk9ycHYtcW53MExBTWJWa1B6LVFBbzZ6YlQxRWtoNVRNRHZQSjNMc01tYkMxZTFGeW9EYkdGRGE5Q1VjMng1ZEpsc0N0SnhrNFBEaWNoXzluYXlxYi1YWmJiazJaekNOanJrMHpzWkgtNFBVTmJ0Sg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.fool.com",
      "title": "The Motley Fool"
    }
  },
  {
    "title": "Silver Is Too Rich for World's Largest Jeweler - Newser",
    "description": "Silver Is Too Rich for World's Largest Jeweler  NewserAs Silver Prices Soar, Pandora Switches to Platinum  The New York TimesWorld's largest jeweler jumps as CEO says firm wants to pivot from silver  CNBCAs silver prices soar, jeweler Pandora turns to platinum  cbsnews.comPandora’s New CEO Turns to Platinum Jewelry to Offset Silver Volatility  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 14:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPYkg0SlVYR0t1c2JLUGdOV1c2SlpqWXdiODNLYzRtOF9VUFg4WFFvLTVQTzB3Wkc0a05vRzVTRko4dG53UVBfbVNzVm94ZHFTTWpfOWlna3E3NmV6djZmUlRhOTI5RTloWkI5WmNENzNHTVA3RVlKOGdXcFFIZ2ZkNVJKNXhkaDd2VVplTEsyMUt2T2RuczRGdmZxdTc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.newser.com",
      "title": "Newser"
    }
  },
  {
    "title": "Samsung killed Galaxy S26 upgrades to avoid a price hike – leaks say it didn’t work - 9to5Google",
    "description": "Samsung killed Galaxy S26 upgrades to avoid a price hike – leaks say it didn’t work  9to5GoogleSamsung Galaxy S26 Ultra: New Leak Delivers Disappointing News  ForbesHey Samsung, you better have something special for the Galaxy S26 launch as TechRadar readers aren’t hyped  TechRadarIs Samsung about to ruin the Galaxy S26's big reveal? Place your bets now  Android PoliceYour clearest look at the Galaxy S26 Ultra is here  SamMobile",
    "published date": "Thu, 05 Feb 2026 20:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5SWmQ1M2RhdWwtYmhXUHh3aHdfcGRuUEFBWW5UVHk2UUVpM29sc2ZjTFdicjNxM2NJbDJfZ0dlMnU3QUZpelNXVy1aSzhzajdNZFlyUFlzN1BZeHQ0N0ZmUTZpMUZ1UDJnTVZGQUxCQ1pTaW1DTXNucFkwNjZvZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5google.com",
      "title": "9to5Google"
    }
  },
  {
    "title": "Failure to Alert Judge to Press Law for Reporter Search Draws Ethical Scrutiny - The New York Times",
    "description": "Failure to Alert Judge to Press Law for Reporter Search Draws Ethical Scrutiny  The New York TimesFBI Couldn’t Get into WaPo Reporter’s iPhone Because It Had Lockdown Mode Enabled  404 MediaiPhone Lockdown Mode will protect your data, even from the FBI  AppleInsiderU.S. Failed to Alert Judge to Press Law in Application to Search Reporter’s Home  The New York TimesiPhone Lockdown Mode Gains New Attention  findarticles.com",
    "published date": "Fri, 06 Feb 2026 00:09:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQTTRYMHFpdEplZm1Jb3RKQnpndFQwZVVHTHNPaFRXQ3lnekxnX1dLbVo3M0dCbWpwOHpHcnVCcHdULWp5WTVfRGNZeWFQU3V0d25ZM1NCM2lzMGx4T0VWN0FnYV9fWFFKdWRqNW9faFZQUFNIWWtHb19lLUEtZ3ZPUWJtSUJrUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "What to Expect From the iPhone 18 Pro After the Latest Rumor Reversal - MacRumors",
    "description": "What to Expect From the iPhone 18 Pro After the Latest Rumor Reversal  MacRumorsApple iPhone 18 Pro Design Changes Take Shape In New Leak  ForbesiPhone 18 Pro Max Battery Sizes For eSIM And non-eSIM Versions Shared By Tipster Will Make You Instantly Regret Your iPhone 17 Pro Max Purchase  WccftechiPhone 18 Pro Max, 18 Pro leaks: Battery, camera, design, launch, price and other details  India TodayiPhone 18 Pro vs iPhone Fold: These camera features are rumored  9to5Mac",
    "published date": "Thu, 05 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1RNDE4WEZxbmFVbWVxZk1PZ3dSYWp0c1JJTm5XOXpSZk82N0NNQ29IS3pGNThIVktnQ2RmeFIyYzR4cGhQR2x0NnVsT1oyUThMRGljX1BSQWtlLTQ2TElESUZORk5ydFdHNU1fdnhiNm5rVkxoM2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "System76's COSMIC Desktop Planning Vulkan Renderer, Improved Gaming Experience - Phoronix",
    "description": "System76's COSMIC Desktop Planning Vulkan Renderer, Improved Gaming Experience  PhoronixCOSMIC Epoch 2 and 3 Roadmap  System76 BlogKeeping an eye on your laptop battery on COSMIC Desktop just got a ton easier  XDACOSMIC Desktop 1.0.4 is out with an improved greeter, better performance in Files, and more  NeowinSystem76 Releases COSMIC 1.0.5 with New Option to Show Battery Percentage  9to5Linux",
    "published date": "Thu, 05 Feb 2026 01:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBkNXpCUUFSWF9Ub3hYUDBxM1BoZkI4MGlYM1lZRWt2V3ZWNmZLQ2NnZmx4SHJ4NWh1Nkl1ZllPQ1VmaVh6Q2FJUWpRZlNDbTl2T01DRXFDSkZIZEVtdmluZ2U2NDZJV1BpRllncg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.phoronix.com",
      "title": "Phoronix"
    }
  },
  {
    "title": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History - Rolling Stone",
    "description": "‘Melania’ Attains Biggest Critic-Audience Disparity in Rotten Tomatoes History  Rolling StoneJimmy Kimmel Hints ‘Melania’ Box Office Was a ‘Rigged Outcome’  The New York TimesWhy Melania's hit documentary terrifies critics who desperately wanted her to fail  foxnews.comThe Melania Trump Documentary Is a Disgrace  The AtlanticMelania review – Trump film is a gilded trash remake of The Zone of Interest  The Guardian",
    "published date": "Thu, 05 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQMXRuVWI1V2g1TEVUeFFoUVlfb20yVmdWYTlxZ0lsTHQxTWhpMUVTclgtUGlucGxaRjAwSHByYWRJeDc5ZkxsQjZPdHktOHVfdVdHQTNEbmRpZWMyaTJaZ25TQTV2anM3ejFKeVNHT0ZqQVhYLXJyTHlRM2Qzd0NsS2lWM19QaFBjMENGSWpRejFwbTNqTmYwR1hKSEZDY1ZrR1B1YUpfVDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years - Variety",
    "description": "‘Moulin Rouge! The Musical’ to Close on Broadway After Seven Years  VarietyMoulin Rouge! The Musical Will Close on Broadway This Summer  Playbill‘Moulin Rouge!’ Musical Will End Its Broadway Run This Summer  The New York TimesMoulin Rouge! The Musical to End Broadway Run  TheaterMania‘Moulin Rouge!’ Musical To End Seven-Year Broadway Run This July  Deadline",
    "published date": "Thu, 05 Feb 2026 22:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxON2Y4alY3WWV3T1RISkNZQTdtaXNwSkhtLVFHV2ZpVEhtMFM0bjdPVnZ4SUd2WGhXSndDOTFZLUFXck5nMmZ0SjdhUjZTXzYyMDl0a1JncFZ5RGdWaVVmS0p3WDBYM09OdzJTUlZuYjNCaVBURXF1RGJZS3hxYlcweUgxUTVWVno0dEs0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://variety.com",
      "title": "Variety"
    }
  },
  {
    "title": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This. - The New York Times",
    "description": "The Louvre Thieves Dropped This Priceless Crown. Now It Looks Like This.  The New York TimesLouvre Museum crown left crushed but 'intact' after raid  BBCLouvre releases photos of mangled crown left behind by heist thieves  cnn.comLouvre Begins Restoration of Historic Crown Damaged During Heist  Artnet NewsLouvre to restore deformed Napoleonic crown after brazen heist  USA Today",
    "published date": "Thu, 05 Feb 2026 17:28:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPQXhsOXpwbjRjTC13R01vTFpZckFYLUk0R0pCNzBIbTNMaE9lN3lhRWk0R0otNno3YjBBVUh4ZzRUUnVoU1NzWlQ2bUZjX0w3VUdlTHpVd3g3UHVIN0FBMmN5NW1GU0pIWWZJWnJRRzU2Szk2N2RMVTI0Y0lIVUhUWEZHMENrZmZ6cXRxS2ptQzBlNkVvSUNVTkd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Where are all the protest songs? - NPR",
    "description": "Where are all the protest songs?  NPRRicky Martin issues public statement to Bad Bunny after Grammys: 'I know how heavy it is'  Entertainment WeeklyBad Bunny Isn’t Toning It Down, and MAGA Is Fuming  The Wall Street JournalHere Are 20 Other Grammy Album of the Year Firsts That Preceded Bad Bunny’s Historic Win  BillboardBad Bunny's Historic Grammy Awards Win Brings in Flood of Streams Ahead of Super Bowl Performance  Rolling Stone",
    "published date": "Thu, 05 Feb 2026 16:18:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5mQ05UYjhNMmo2Q0t5SmxOMmNwVjhXU0REUzIycHk1VFc3Q1NHYm1QSG5aWkRxTGJuSU1zZ1JXYTdKM1ljb0l5NE1QakRhZEtQWVhEUWFGbmFMWTRmblBYQWZaTndxbW9yVFItNXJPcmNaeDFtWW4wSG1Pdzg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump's geopolitical tensions spill into the Winter Olympics - Politico",
    "description": "Trump's geopolitical tensions spill into the Winter Olympics  PoliticoFrom the Olympic Village to Little League fields, sports still hold America together  foxnews.comOpinion | At These Olympic Games, Which America Are We Cheering For?  The New York TimesAnti-ICE backlash and Vance’s presence fail to chill enthusiasm as USA get Winter Olympics underway  The IndependentU.S. steps onto Olympic stage at a time when its image and role in the world spark growing concern  NPR",
    "published date": "Thu, 05 Feb 2026 21:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQcFVSY0N2THBWZ3c3TVBmT3NHRnlRNjJBM09FR2x1SWthc1Aydzl6S2l2b1BQMVB4SU9WQ21uMHZWYUtLWWZfb3Bub0VFemZXaTNYZGRCMnI1N3daWWxnVXVPSEtCcUlaWURjR0FIZWlwUlIwSjE5Rm1CRnpuN0FhYTJ5aXlQNHNNT2V3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "Seahawks ‘loose and focused’ as they complete off-field Super Bowl duties - The Seattle Times",
    "description": "Seahawks ‘loose and focused’ as they complete off-field Super Bowl duties  The Seattle TimesHow did Seattle limit 49ers to 9 points in 8 quarters? Seahawks defenders explain  San Francisco ChronicleAlbert Breer: Seahawks Are ‘Loose and Focused’ and Ready to Roll Against Patriots  Sports IllustratedSeahawks Showing That Super Bowl Week Is 'The Ultimate Place For Being Loose And Focused'  Seattle SeahawksTaking a closer look at the Seahawks — the Kyle Shanahan offense and the Ravens defense  The Boston Globe",
    "published date": "Fri, 06 Feb 2026 00:38:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxORmtjcTBXdDJDR0t0TFEtbWZINlZtRHhIRGdHZkhfb2JvS0d6WFBJM1dTNG5rT0hIdWJIZVhiYmI2Z2FncEZOMmFvem40LWU5TVVEMUZFNlhnWEdlZk9LWGtxamRJMnR0RFpDT2lXc21VR1JJU25QY3RrS1FuWW5rWnUxV2draU5NOEFGeUVTMTNMY1ZZY2JRamFfZ1FnMzRTZW5PVkFFaGJ4YmhjNmRDcEkxQWQwdXRP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Penguins Grades: The Rookies, the Refs, and Overcoming Real Issues - Pittsburgh Hockey Now",
    "description": "Penguins Grades: The Rookies, the Refs, and Overcoming Real Issues  Pittsburgh Hockey NowHayes scores twice in NHL debut, Penguins defeat Sabres  NHL.comPens Points: Rookies shine in Buffalo  Yahoo SportsSabres going into the Olympic Break with three losses in four games.  AudacyPenguins assign forwards Avery Hayes, Rutger McGroarty to Wilkes-Barre/Scranton  TribLIVE.com",
    "published date": "Fri, 06 Feb 2026 05:48:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOUk9oY1Q1T01nbFNTQmhXTjlUTmp0Vk5JbVdGei1QWUFSME9EV3ZiTUFzYlpEVDBCTkc5Rlctelp2R295TFZGQUh3UEtnSEZ5OVpWOTVyQmZYV3hlaVVLYlNJNkRiazdjTHoyUGFSOFNmbFA3V3oweGd0d3hWc00wSUtqZkdpN0xvUWROZDZpdDRLUU9GMUFRN0U2bjZwLXpEdnp4ZENtLTQyRlh5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://pittsburghhockeynow.com",
      "title": "Pittsburgh Hockey Now"
    }
  },
  {
    "title": "Winter Olympics 2026: Today’s schedule, results, medal counts and news - New York Post",
    "description": "Winter Olympics 2026: Today’s schedule, results, medal counts and news  New York PostMilan Winter Olympics Opening Ceremony: What Time to Watch, How to Watch, and More  The New York TimesWinter Olympics 2026: Dates, schedule, venue, tickets and how to watch  NJ.com2026 Women's Olympic Insider | Scamurra Scores Twice To Lift U.S. Over Czechia  USA Hockey teamThe Winter Olympics opening ceremony is here and how ICE agents are scanning people's faces: Morning Rundown  NBC News",
    "published date": "Thu, 05 Feb 2026 12:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPVThZQk56MnZLLW5lRDdGenUzWnFjNXlKVW5iQ0RlLTNlS2xqS1FicHZLSDREV0d4RHgzRTltWGxPQnVYX3RqUm56MEtpajZxODVTZTdWYzFZUWZKMFRheUI2YXpNcU1MRTJSY1hrbE5TRU5xdm9JTS1YaWZRczhveXhFbWlEcTNZZ2ZQNzVZVEpIenVCdHNjYnI2TEJielV6aGloa2xhaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Dark matter, not a black hole, could power Milky Way's heart - Phys.org",
    "description": "Dark matter, not a black hole, could power Milky Way's heart  Phys.orgSupermassive new theory on what lies at the heart of our galaxy  The Times'Dark matter, not a black hole, could power Milky Way's heart'  The Royal Astronomical SocietyMilky Way’s ‘Central Black Hole’ is Compact Object Composed of Fermionic Dark Matter, Study Says  Sci.NewsEvery major galaxy is speeding away from us, except one — and we finally know why  Live Science",
    "published date": "Thu, 05 Feb 2026 16:23:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBhYXpyWXNHenhMVW5OQXlydmlXN3Z0UWF4amhseEw0MjJ6TmVpX2FUSV9KM19ZSDBjRWQwVk9XMXdaS3hzRW81ZDY2ak9KS3dZb2RyTW00X1ZBZ2hXV2RHcDFtajN4SG1Nb3QtZzV1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Did astronomers see a black hole explode: An 'impossible' particle that hit Earth in 2023 may tell us - Space",
    "description": "Did astronomers see a black hole explode: An 'impossible' particle that hit Earth in 2023 may tell us  SpaceDid we just see a black hole explode? Physicists think so—and it could explain (almost) everything  Phys.orgIs There A Link Between Primordial Black Holes, Neutrinos, and Dark Matter?  Universe Today'Impossible' Particle That Crashed into Earth With 100,000 Times the Energy of the LHC May Actually Be from an Exploding Black Hole  ZME ScienceUltra-High-Energy Neutrino May Signal First Glimpse of Primordial Black Hole Explosion  Sci.News",
    "published date": "Thu, 05 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPYk9iR1FyQzhNcVVBSExsV19HYmpoTzJuek80eklObElKMGdGMUlYNmQxOHc3VE5TM2d0MHdfamNPeDgwX2Jnd3hmRXZ4aGZCbnVvb2ZZMnZkZEI5UkZvRjVER2sxNzU4R0V3WFNvM2hSMU03ZWdlRWlYRWdvQ2dTdERaQUZMc0ZQTDlGeXBOY0hGc3F3YVhRa3lieWFvRFRGRTQ4a0VxM0MwcVZBTWV3SlFGVTVIMmVhTGFDX1ZhcFlzTGZYSEp0Wi10THBIZ2tZZU1FaVhSR3UwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo",
    "description": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans  GizmodoResearchers face serious obstacles to measuring Antarctica’s fastest-melting glacier  PBSDeep Inside an Antarctic Glacier, a Mission Collapses at Its Final Step  The New York TimesThe ‘Doomsday Glacier’ Could Flood the Earth. Can a 50-Mile Wall Stop It?  The Atlantic‘Doomsday Glacier’ is melting faster than we thought. Can a 150-metre wall stop it flooding Earth?  Euronews.com",
    "published date": "Thu, 05 Feb 2026 18:05:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPdWV3VF95VDRKYjM1TnowMUczOGZrVHFCVHJTNUdZdFBZNEM3LXBNNVNyWjF0YzhYNnhRTktVcVB5eDN2WER3cWdlY0ZYaHZ4UmNLLXBMcXZFOXVBX3ZvNXRDUmFsQ1FhdVh4TlVma2JzNVBSTk5jWk82TVllY3l6WHFOblp0SzBDcTdaMVluY0ZYaTFCY0RmMGl1SUhUczJPeHdUZDZ1WXF0T1Zkako4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity - NASA (.gov)",
    "description": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity  NASA (.gov)View Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 18:38:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQZ0dnN2tIS05uT1oxM28yLXY5ZG5BUEo2SnIzTWFCZXBwaU1RbGcyRnY0dHBmVlEtNm1teFZsSVV5MEc3a3dLaXRPajB4NEtJV09pUXFCeDAwd3FwSmxFMjdHQ0pKaVpSczVTblhMOEtkN2VhLXNWMHh4NGVrenEwX0VxTWl1YkhpTl9PcXU0NlB3MVV0aUcxbnphSmhZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "Statins don’t cause most of the side effects on package warnings, study finds - statnews.com",
    "description": "Statins don’t cause most of the side effects on package warnings, study finds  statnews.comMost statin side-effects not caused by the drugs, study finds  The GuardianReviled on Social Media, Statins Shows Few Side Effects in Study  bloomberg.comStatin pills much safer than advertised, major review finds  BBCStatins don't cause most of the side effects listed on their labels  New Scientist",
    "published date": "Thu, 05 Feb 2026 23:34:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOQzFEVlliSVplckZJQmhYOGx3Y1laTFg3ald4V1kxbUs3MkRISjVxOUtZUEpHM3ByRVNwSHpILXpNUG8wazVHcWE0aWlDSi1lMVQyRXRiazhCUXFTMFdVeXFfd21VUzRzZjctMVZHc2RXeGFxMFpnMjlRb0dWclBrUHZ3RHBHcVlCRE1YWW81SHduaGp3dVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.statnews.com",
      "title": "statnews.com"
    }
  },
  {
    "title": "Measles exposure in Milbank, Brookings - KELOLAND.com",
    "description": "Measles exposure in Milbank, Brookings  KELOLAND.comGrant Co. Man Visits Public Places While Infectious With Measles  yankton.netDepartment of Health warns of potential measles exposure at Brookings wrestling tournament  Madison Daily LeaderControlling the spread of measles: Health experts explain when to test  Dakota News Now",
    "published date": "Wed, 04 Feb 2026 21:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPVDM1dHBfaHpfcGlLRUJoRDJsZ3llZ3F0S1VMaU5ObHBuMEVtUEluZWhYekI2WWRaYWpBd0x4Zm9YZjNoa0t4bjRMZDFUcExObHNQSDJXS29ic2gybGU0LW9XdnRYR2RyT2JzZkxmVnIzcXZMRjF0NXhIVE5wdTdweGtYVkg2d9IBiwFBVV95cUxPVHRtWlZOTmVEVXo4QWxFenRPc1NRWUdOODNnU3FVeHE5TFF1ZHlNLXVqLXJPZE5oU3VDc3NzdzJUM3pMTXNxWEwxWnlQQTdWWVhiSkE0b1ZPaTBuWVpaM0lOYzI5am4wNmlVa0h2WjBNQ05PdkVUSGxkVEJDNVNYeU9zMDQ1NDBpMkdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keloland.com",
      "title": "KELOLAND.com"
    }
  },
  {
    "title": "WDH reports flu-related death of Fremont County child - County 10",
    "description": "WDH reports flu-related death of Fremont County child  County 10First pediatric flu death of the season reported in NE  KHGIWyoming child dies due to influenza  Oil City NewsAROUND WYOMING: Flu Fatality, Pipeline Completion and Great Gray Owls!  Your Wyoming LinkDouglas County sees continued high flu activity as Nebraska health officials confirm pediactric death  WOWT",
    "published date": "Thu, 05 Feb 2026 18:37:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPRmhaWk1tZHh2elU0cWRfbVF5aFV0Skt3Q3dDSllGU1d5MmYtaE9uQnk5anVzMzdjYkVNWjFmbmpiUGg1dTFqUnRtcnlQbE1LZXdsbWROdGdPMS1mOGZIdDlkQ2RkQmVOZ3k5NE1jV2t1MkpaMWFwcWZ4RmR6S0VnaA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://county10.com",
      "title": "County 10"
    }
  },
  {
    "title": "Calls to shut down Texas ICE facility for children grow amid measles outbreak - The Guardian",
    "description": "Calls to shut down Texas ICE facility for children grow amid measles outbreak  The GuardianMeasles Hits ICE Family Detention Center in Texas  The New York TimesMeasles reported at Texas ICE detention center where Liam Ramos was held  San Antonio Express-NewsICE halts \"all movement\" at Texas detention facility due to measles infections  cbsnews.comMeasles in an ICE facility is a public health failure  statnews.com",
    "published date": "Thu, 05 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQdDhWVVUzTWRoNi1iTTVLU01nNU11bm1zLWV0S2V5OE5ZcTJqNHgzdzlNMktZOG9TbGZNXzZEbi10NUZjV3BINEZBQUJNcHNaNkZ0Q0hyWHVraFl4RHRPdEdldGNJMUxfMms2RkdqMzBmWURPMS1YZFF1RlJrRldxekR1aTFmTXM1UmRIY3MzUWZFMVYtM1JXelZFSGU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  }
]