[
  {
    "title": "China’s Xi Presses Trump on Taiwan in Phone Call - The New York Times",
    "description": "China’s Xi Presses Trump on Taiwan in Phone Call  The New York TimesChina's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade  CNBCTrump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relations  ReutersDonald Trump and Xi Jinping discuss Ukraine and trade ahead of US state visit to Beijing  Financial TimesUS must be prudent when supplying arms to Taiwan, Xi tells Trump  BBC",
    "published date": "Thu, 05 Feb 2026 02:51:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE80Q2JJYzJsRzJXVk12UERpdzBrRWZSNVA5N3N2SHNEVFNxZnJfVFNmeDFRUkFMUl9QMVNVdlh5ZzdKOE05dUtMR3JhN09ScWZwdi1CQjVQMXBIMVRjYlUxWlc5T19wMnJPejU2QU9KSWxnZUI4WHlocnlRdXg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Democrats plan DHS funding offer as Thune floats long-term punt - Politico",
    "description": "Democrats plan DHS funding offer as Thune floats long-term punt  PoliticoProspects for ICE deal sour on Capitol Hill as shutdown deadline nears for critical agency  CNNIn Spending Talks, Senators Clash Over Immigration Crackdown  The New York TimesTalks in Congress to overhaul ICE are already breaking down  MS NOWOpinion | This good compromise would rein in ICE without undermining its core job  The Washington Post",
    "published date": "Wed, 04 Feb 2026 18:30:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNdjhUYlpsOHB4eEdEOEZuTXk5UGFtT0NKMU9oX25yUWhnNnc2Rzh4TjVCQ2NIcUJTTkxwcjN5eU9CWWFGZUVhRHZjRGVLZlR1WFRmN2QycHlTcDFOUVYzZ2xSUkZDcDNkRk1OVVN4Y2FtWnQzNnc1cFA1bEVSQVVIWXlBUUZ1R2ZxNFZ6SkxxZHJia3haN0FYZExR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "After crushing protests, Iran's supreme leader now tries to avert a U.S. attack - PBS",
    "description": "After crushing protests, Iran's supreme leader now tries to avert a U.S. attack  PBSOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBCAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsSatellite imagery shows where the U.S. military is positioned near Iran  The Washington PostDonald Trump wants to end America’s half-century conflict with Iran  The Economist",
    "published date": "Wed, 04 Feb 2026 21:32:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQVE5OQVJ0TmhQOUNYdlpXWGpXRGYwVThhTUlqM3VJckZGY3dGNFdqckNLbUxMSi11N21NY3FKYUlnTVFtOWptNGExcEZHcU42REtjRmVxd280d1hQLWxBZG13SnJBWFhydVlSN2Qxd1RMN0ZYMTNrdlN2QXA3VG1SRF9hQXF2TGZWVmxwU2xhejh6M2l2WXJoaFdJWEZ2SnZGWGs5R0t6SU5aR1hVUGlsZdIBtgFBVV95cUxNZXlmTG9yZVJXRW5neHN0VzhNUHhwUmhxa0xnWWE2aENhYTBnZm92WG1ONDZJd3NPellPTnJhcGZCT2hWWVpBU0ZpUWUxYlplZjAtYU5PQUw5ZGpQNGZNdTRicUJ1dVM4b0EydGlib3dYcUZzZzZGR0J6LWlTeFBvOFB2SXFSZTJGNV91ZTU4OVBqaWdzeF9tM0lyRXpLa3A4UVpZdHVuOF9Janc2WWgtaXFzX2xOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto Rico - CNN",
    "description": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto Rico  CNNExclusive: US spy chief's office investigated voting machines in Puerto Rico  ReutersTulsi Gabbard reportedly oversaw probe of Puerto Rico voting machines last year – as it happened  The GuardianTulsi Gabbard reportedly oversaw probe of Puerto Rico voting machines last year – US politics live  The GuardianWill Maduro bear false witness to prop up Trump's 2020 election fantasy  Daily Kos",
    "published date": "Thu, 05 Feb 2026 04:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOc05kRzJieWlWeC1ZZS1sSkF0cGwxY1loUE5sU3o0UnZCUXhvQWRybTZMSzctNnhuckhBVHVCZmVmNWg5RVhTQXJ4NzBtdG1sZnlQaVZuSHdjb0NnNGktMWJwUGlEV1JVSXlCT3NrS1ltOHJZcHQybDBNaEw1QWdrYVJ4VjgtOHZ3ZjVWYTE3LWFOcFVfUWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm - The New York Times",
    "description": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  CNNSenate GOP Leader John Thune says he disagrees with Trump that Congress should 'nationalize' elections  NBC NewsTrump doubles down on suggesting federal government 'get involved' in state elections  ABC NewsTrump's 2020 grievances fuel election power grabs  Axios",
    "published date": "Wed, 04 Feb 2026 21:02:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOakM4RDB5eU1VUzc2NUpSQW9RMTJpaEx2R3BhWUtCTlhtd3NRVFZjVzFKdWJ1eGNLMXMybktzVFVYSlhHa2FUTkZ5M0xCb2dSelQwenl1dmJNdDB1elJPNkxtWlJSLURhdFV0Q2hySkpiM191aW1POEJ3YXJ1WFhLbjBjUDdicTJaT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost. - The New York Times",
    "description": "Trump Says His Unpredictable Style Gives Him Leverage. But It Has a Cost.  The New York TimesTrump-style unpredictability isn’t just political theatre – it’s a regulatory problem for your brain  The ConversationTrumps Brain Sparks Debate Over Cognitive Aging and Health Information Marketing  ACCESS NewswireTrump biographer says 'anxiety' about midterms is driving most of his decisions  Alternet'Unreliable' Trump is 'starting to wear' on his allies — who are now turning away: report  rawstory.com",
    "published date": "Wed, 04 Feb 2026 23:36:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPYUxYZlgyc1h4cWM0SlZZTzhJcXJxSXQ2RTZwdTRYcHNobjlyOHZwa3pEVjh0STlwbzFvUGcwYl84RHNaWkFCNmM5RHpkWmZRSkgweE9LY3FsTXZGSmVVb2t4TUxtWVYyNWR3aEVDYmVVMWtSWXdsaGZqRlNKbUp3WTRablhHZVJfamc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Border czar Tom Homan says 700 ICE and CBP officers are leaving Minneapolis - The Washington Post",
    "description": "Border czar Tom Homan says 700 ICE and CBP officers are leaving Minneapolis  The Washington PostTrump touts 'softer touch' on immigration as federal force is reduced in Minnesota  BBC‘Nothing has really substantially changed’: Homan’s efforts leave Democrats unimpressed  PoliticoTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsMinnesota sheriffs group, border czar Tom Homan negotiating blueprint for federal drawdown  Star Tribune",
    "published date": "Thu, 05 Feb 2026 06:37:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOMjVBV3ZYLXNzSWhodFVqQXdkNVQ1NEtRUDJnVWdCNFhWeFZMOWQ0X2lZeVhkVWwyWEVUMkRLSlNGVVFqNXZZOXY4bVYza0JqZm5TQ2h2Y2JTLVl2YjBTbEg0c19jMVVVMWhQNjlPM1FOcFNibUdjSExfRFZsaG1lbUtkZ0xNZ1Vfb0JuSmEyS1NCamhJWnA5cVJBbENRcFFZRDlr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Steve Bannon calls for immigration agents at polling sites during midterms - The Guardian",
    "description": "Steve Bannon calls for immigration agents at polling sites during midterms  The GuardianSteve Bannon calls for Trump to deploy ICE and military troops to polling sites  PoliticoSteve Bannon says ICE will ‘surround the polls’ as Trump doubles down on taking over elections  Democracy DocketSteve Bannon Proposes Using ICE in Elections  NewsweekBannon: ‘We‘re going to have ICE surround the polls’  The Hill",
    "published date": "Wed, 04 Feb 2026 18:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSnd5eG1SZ1RycTZmS0wzbHlFTG53LW45cGtDbW93RU8tNHpZQU1oTDdEeERnSTVZN3g3UEo0TWtYZG5rZHp0RDdXRm5OMHRmazgyTlZOVlliWXEzSmotX3ItbzAzVV9ZV1FTYmdScFc3Z0VGeGRTUWd3cDFFQXdEcW1TOU9ESE5aQWJhUVkwY0UwWjFnRnhSNXllVW5fbEVmZVlyNlBraTFTSkFZOTNZNU5WNXI4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Texas A&M professor files suit after firing over gender identity lesson - Politico",
    "description": "Texas A&M professor files suit after firing over gender identity lesson  PoliticoFired after gender identity lesson, professor sues Texas A&M, arguing her free speech rights were violated  Houston Public MediaTexas A&M professor files lawsuit after firing over gender identity lesson  ABC NewsTexas A&M Lecturer Who Was Fired Over Gender Lesson Sues University  The New York TimesProfessor fired after viral video sues Texas A&M System for wrongful termination  KBTX News 3",
    "published date": "Thu, 05 Feb 2026 02:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOODA3c0ZBSGc0a3dLQkpLTTJTZ3c5SUlockRxYW5EVXBvVXV3dEk1dWZtSzFTMlU1UDF2QUkwM3NzdmxiTERNWTNtMi1Hb3ZnZzdBWFNHblZWeXVMNUcxaVFJUEg1TlRRLXJyaFRySTZERGxRd09DRThJRkRkdHVXUW9HNmpROTJVM1A1X0ZpRF9UNUJiZGs3S0FTUXVZaUtGb1VFdU4xUVpQcHN4OUM0TnpLQ1gyRTZkTEVfRmd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent - The New York Times",
    "description": "In Forcing the Clintons to Testify on Epstein, Comer Sets a New Precedent  The New York TimesClintons reach deal with House Republicans to testify, likely avoiding contempt charges  PoliticoAfter Republicans push Clintons to testify on Epstein, Democrats warn they'll haul in Trump  NBC NewsClintons agree to testify on Epstein. Here's what the files say  AxiosWhy the Clintons reluctantly reversed course on contempt strategy  The Hill",
    "published date": "Wed, 04 Feb 2026 21:23:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU2h2dDUwNk9TbHNIblNvaU5lTDZkR28wQU85NTNNUXNfMHJzczZhX2RjeGEzdXNTLWFqZ2RjbklfMlhWalpRSDVZSlJWTEROdU00VGUzTzFWWFFudWwyTTQyNC1mSTZyYnVTQkJoR05FMnVZZXlMSjFXcHV6OEpCMldwNXhJVk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Russian Comedian Accused of Making a Joke About Veterans Gets Prison Time - The New York Times",
    "description": "Russian Comedian Accused of Making a Joke About Veterans Gets Prison Time  The New York TimesStand-up comedian gets nearly 6 years in Russian prison over joke about war veteran  CBS NewsRussia jails stand-up comic Artemy Ostani over war joke  Al JazeeraRussian comedian jailed for nearly six years over war veteran joke  ReutersMoscow Court Jails Stand-Up Comedian Nearly 6 Years for Alleged Joke About War Veterans  The Moscow Times",
    "published date": "Wed, 04 Feb 2026 20:25:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOWXMwT2tjNzZ5NWpyQU1wQk55a21DRHJoM0JDZmNHbGJ5dG5FdUR1RUNmbjJEWi0tUFQzVUVSS2xSd0Z5YnVCN0NjY1A5M3NuRFlKUUM1ckt6Q3puRzdkcUpHZ3hWT1RwRFRTcTd6d3puTTRTOWIyLW82SXdNdHlpeW9ULTBBWXNmMkF0cmdNOWNvVlZt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gazans returning through Rafah crossing describe checks by Palestinian militia - BBC",
    "description": "Gazans returning through Rafah crossing describe checks by Palestinian militia  BBCReturn through Rafah: Palestinian women recount Israeli interrogation  Al JazeeraPalestinians Return to Gaza for First Time in Nearly Two Years  The New York TimesGaza-Egypt border reopens nearly two years after Israel closed it, official says  CNNPalestinians in Egypt torn on returning to battle-scarred Gaza with ‘no future’  The Times of Israel",
    "published date": "Tue, 03 Feb 2026 18:31:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBDanlNV29iTlVhVElSNWYzYmxhUTFhY2ZCN2dNTHYtQjg5NzQwUEtOallaSjE5X0dsblJJOFh0Q24wRTNSalBLdkJFRGQ3NmN0VE9iaXVhR2JGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump-led abuses amid ‘democratic recession’ put human rights in peril, HRW report says - The Guardian",
    "description": "Trump-led abuses amid ‘democratic recession’ put human rights in peril, HRW report says  The GuardianTrump has attacked pillars of democracy, says Human Rights Watch  Reuters'Global human rights system is in peril,' says HRW  DW.comHuman Rights Watch warns US heading to 'authoritarianism'  Le Monde.frGlobal system of human rights in ‘peril’, warns HRW in its annual report  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 10:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOcnRqNTFnN2pENUc5M0VUSDZGZDg2YXRLSXlxLS15MzR2d0RIRkxtcWozWG1IWER0ODVTS0pMelc0ZjZNamJkM2hZcTdGeTA2N3NJVEdRMHhoZ2VoeWg1STl5TEdFaXZINERuU1hwekhSUzJtb2VWekp0RWpjLVVHUnAtSmNXa2FibXR4SDdsTzJ6WW1sSDdXamk5NllqNC1tNFJ2ZmdzZjlQbTNsSnljV1FIeDZkekFKU2gyN1Zod28yMnVy?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "'We Don't Need Herzog': Calls Mount for Australia to Cancel Israeli President's Visit - Haaretz",
    "description": "'We Don't Need Herzog': Calls Mount for Australia to Cancel Israeli President's Visit  HaaretzFederal politics live: Pauline Hanson resumes Senate seat after seven-day suspension  Australian Broadcasting CorporationIsaac Herzog is accused of inciting genocide in Gaza. He shouldn’t be welcomed to Australia | Chris Sidoti  The GuardianAustralia; HRF, Jewish Council & ANIC File against Herzog  THE HIND RAJAB FOUNDATIONAustralia Dodges Call For Arrest Of Visiting Israel President  Barron's",
    "published date": "Tue, 03 Feb 2026 13:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwJBVV95cUxOVHNaRFRFMElydXdqY2d1dmVodlY1aDVkNW1DMGdiaHplU1NxX2dxblZkWjVDMklJaUR0eUxaSlVEMnF3aldBaml5YzVyU0NxRkJQSHVtR0dJV3k5Tnc2dHd1Y3hTMG1IUTFtLTgycy1LQ0F1RjFsUTd4Z09JSTZrd0NIa0NhdFg2MUZHMzNCWW14cUVqbGJUa2NjaHJyem9wZmFBdnBIcERMZGRJVFFWbHJQTGRKZXo1NTE3aUpVVzhsQzIwbDBaUnA5VE5UQWhUYWNhSG5ra3Y5ZWptT0J5LVZEU0hudHhJRnVaOTc4NEtyQVhwRWZkUVZMUlRNUVBVMFdaLUxpdGZOaUpXZy05WFFkaXMtTVJMbjgwRHFxVC0wVE5rakxj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.haaretz.com",
      "title": "Haaretz"
    }
  },
  {
    "title": "Asian Stocks to Fall as Tech-Led Drop Gains Pace: Markets Wrap - Bloomberg.com",
    "description": "Asian Stocks to Fall as Tech-Led Drop Gains Pace: Markets Wrap  Bloomberg.comAsia shares extend global tech rout, silver tumbles again  ReutersAsian shares drop after Wall Street retreats thanks to sinking tech stocks  Yahoo FinanceGold extends gains, breaking past $5,000; Asia stocks trade mostly higher, breaking ranks with Wall Street  CNBCAsia stocks retreat from record levels amid AI disruption worries; KOSPI slips ~4%  Investing.com",
    "published date": "Thu, 05 Feb 2026 05:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSGxqX0xIajZLY282TFJ4NjJ1WnpocURQbXVNUVJ0dDJhU29pY2hLOV8yNENRcFpXZVNQd2JKd3hoandEWVF3bmEtUzc2OHkwSEtET196bmRIQmJYS0N3Z2hud2ZCMC1NcFRrWGkzeExDQXBRdVBUS0hiLVJQYkh0eWp3OU1WNnR2MWd0aFV1cE1senUtbnF6U2RkcmpmeDVfMlB2dndrWktvUHJRMFZmSjB3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "E.l.f. Beauty posts earnings beat, raises full-year guidance - CNBC",
    "description": "E.l.f. Beauty posts earnings beat, raises full-year guidance  CNBCElf Beauty lifts annual forecasts as affordable products drive demand  Yahoo Financee.l.f. Beauty crushes FQ3 expectations, bets big on FY26 with raised outlook (ELF:NYSE)  Seeking AlphaE.l.f. Beauty’s upbeat forecast shows cosmetics demand and Hailey Bieber’s ‘clean’ look are still going strong  MarketWatchWhy e.l.f. Beauty Stock Jumped 12% in January  Nasdaq",
    "published date": "Wed, 04 Feb 2026 21:50:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9QRmVVTjRZM2U2RFhUaG1tMGpHNVpxYUxmaTdtVEduUnNLV3Zmb0JuZWV4akYxRWpJZVdCTW5MRkpVd1RTQXo5WlVaVDNIVnczaExKU0dQZk5GREFocHpTaHRreUx0LXlLbzdZ0gFwQVVfeXFMT0RUTHJsd3ZLZFUzbVJBR3NjVzFoYzVHVDVGWTJHMnl6ZzhKS1JKVURfRm9adGo2NnprZ2FzMzhrOTlYakJOSkhQazVzMzZuVTc1bEhnNjFDRmtHM1l3ckJkOHMzVHdMTXlQdmtSWU0zQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Bank of England expected to hold interest rates - BBC",
    "description": "Bank of England expected to hold interest rates  BBCBank of England set to hold rates pending clearer picture on inflation  ReutersHere’s what to expect from today’s Bank of England announcement  mpamag.comBank of England set to hold interest rates at 3.75% but cuts loom  Yahoo Finance UKBank of England set to hold rates as global volatility muddies the waters  politico.eu",
    "published date": "Thu, 05 Feb 2026 00:02:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5rY0VFbi1rYmRERl9McVVkamhaOWR1dlV5WTJpUXBJb2llNF9MTEI3VnIyOVBXYTl2eUFBWlk2b214b2R4TEUzYUFnVDIyVXBCcVh5elZJd21pUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Stock Market Today: Nasdaq Declines; AMD Sinks After Earnings - The Wall Street Journal",
    "description": "Stock Market Today: Nasdaq Declines; AMD Sinks After Earnings  The Wall Street JournalStock market today: S&P 500, Nasdaq fall for 2nd day as tech slides on AI worries with Google earnings ahead  Yahoo FinanceMorning Bid: Skittish investors haunted by tech sell-off  ReutersDow Jones Futures Fall; Google Beats Views, Huge AI Spending Stuns  Investor's Business DailyIt’s not just a tech sell-off  Financial Times",
    "published date": "Thu, 05 Feb 2026 03:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPWnpSNURLWnptT0oxZkJKNUQ2TU8zejRxaURabmFzZFpUbGI1djZQNVlxRVoyV0paOXNQQTg3VlE2bnhUc19yNkFjS3RfS2xiTG5zR0l2ZHpIQzRRYUltR3BtUUZJVDBJa1Rpb21ENk5kUVh2cGxSSEFta0hiR1JVaHItU1NKaWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "iPhone 17 Pro Max has the best battery life of 35 smartphones tested - 9to5Mac",
    "description": "iPhone 17 Pro Max has the best battery life of 35 smartphones tested  9to5MacWe Tested 35 Phones for the Best Battery Life. These 2 Brands Topped the Field  CNETApple’s Base iPhone 17 Lasts As Long As The OnePlus 15 And Its 7,300mAh Battery  WccftechBest smartphones with long battery life: Samsung Galaxy M35, Realme 16 Pro Plus, OnePlus 15R and more  Times of IndiaSmartphones with the Biggest Battery in the Philippines under Php 20k: Built for the Daily Hustle  Pinoy Metro Geek",
    "published date": "Wed, 04 Feb 2026 14:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOUkpJaTVnTUE1dzBhUzJ2dTlxY3RLVGZ3ekNOdXM0OG9peFQ0ak1WSDhZTHdIQlU1aUc2a1R5a25mcjdXbEQtZVA1dmZTelYteWY0YWl6RmxkNS1qQjJXYzltVTBfZW9tVm9ER0NZUGlDdlptbHVQM0x6QUdMTFZNTC1sbFREYUdyOFJXX0ZIN0VDZHZPUnc1bXJZeEZJQ2h3Nnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Meet Gizmo: A TikTok for interactive, vibe-coded mini apps - TechCrunch",
    "description": "Meet Gizmo: A TikTok for interactive, vibe-coded mini apps  TechCrunchGizmo hits 600K installs with AI-powered mini-app feed  The Tech BuzzGizmo App Revolutionizes Digital Play With AI-Powered Vibe Coding Platform  Bitcoin worldGizmo Debuts TikTok-Style Interactive Mini Apps  findarticles.comIntroducing Gizmo: TikTok’s New Hub for Interactive Vibe-Coded Mini Apps  FilmoGaz",
    "published date": "Wed, 04 Feb 2026 21:45:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQZzRoZFRFdTc4WnZqZGhyLW4yYm9TdldJV3ROWjBmeml1b2pJQmNPRmR1b1UxWXFkaS1ialNuOTdfTVhLVjVtWW9hSHBENFRyR2VZcFB0aFpObmRTaGNRN2h1QXlkREJOZXZjRTlTLW9DRnpzQkVMNXNzekt2aUIxUjdENHNuSmVuMzNraVEtSFBma1dSNWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://techcrunch.com",
      "title": "TechCrunch"
    }
  },
  {
    "title": "Microsoft releases urgent Office patch. Russian-state hackers pounce. - Ars Technica",
    "description": "Microsoft releases urgent Office patch. Russian-state hackers pounce.  Ars TechnicaAPT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks  The Hacker NewsRussia-linked APT28 attackers already abusing new Microsoft Office zero-day  theregister.comMicrosoft Rushes Emergency Patch for Office Zero-Day  Dark ReadingRussian Hackers Weaponize Microsoft Office Bug in Just 3 Days  Dark Reading",
    "published date": "Wed, 04 Feb 2026 23:08:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNeUc5dVk2eTI0eWVNWExhMkVsdUJyUEZDQy1STC1Sa0RuVERmZUJJSFBYazN2NXF1RG1pVlFXcEYzcVJtYnR1d1NPRGpndVZtNmJLWmlWUVFDOWZGbW9scGZrdWFVaGpQYjhadWhTY2p5VGxBNFhRTl9HZWVoZjBLNUdpLVlrTEJ3QTRULUxxVDhUMlpwMXFnWGcwVkcxSnhhZ251LVRsT1Zrc1ZtZUZoelJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Pokémon to Celebrate 30 Years with Yearlong Campaign, Kicking Off with New Super Bowl LX Spot - Pokemon Press",
    "description": "Pokémon to Celebrate 30 Years with Yearlong Campaign, Kicking Off with New Super Bowl LX Spot  Pokemon PressShop the Pokémon Center 30th Collection  Pokemon.comPokémon To Celebrate 30th Anniversary With Super Bowl Commercial, Special Merch, TCG Collection, And More  Game InformerPokémon will debut a ‘special video’ during Super Bowl LX celebrating its 30th anniversary  Video Games ChronicleA Pokémon 30th Anniversary Commercial Is Forcing Me To Care About The Super Bowl  Kotaku",
    "published date": "Wed, 04 Feb 2026 14:06:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1aeDhQSmlvbW45RzlfQmtjbG40WThWSjBmN2dwX2tndk5SS0d0VHpVbDJua0hqSTNZY1ROaVd6ZTA2Szk2aWFOaER3azRpN1VHczRzenFzZnNiTWRFMUVPTDBtUVR6SDRiY2pCRHhNb3hDUnBuQU5zXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://press.pokemon.com",
      "title": "Pokemon Press"
    }
  },
  {
    "title": "Ted Cruz Wants Ted Sarandos to Answer for Billie Eilish’s “Stolen Land” Grammys Speech, for Some Reason - The Hollywood Reporter",
    "description": "Ted Cruz Wants Ted Sarandos to Answer for Billie Eilish’s “Stolen Land” Grammys Speech, for Some Reason  The Hollywood ReporterTed Cruz Derailed An Antitrust Hearing With One Very Bizarre Question  BuzzFeedTed Cruz questions Netflix and Warner Bros. execs in Senate: 'Are we right now on stolen land'  TRT WorldA Recent Antitrust Hearing Took A Hard \"Right\" Turn When Ted Cruz Asked This \"Liberal\" Question, And Ya'll, I'm So Tired  YahooTed Cruz Links Grammy Politics To 'Corrupt' Streaming Mergers  International Business Times UK",
    "published date": "Wed, 04 Feb 2026 19:29:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPUnMweE56dDlKeW9nbXE1bURLUXB2S29lZ2oyTkF6RTl3WThBejdIdTR5eWpKZ2pGRmxUODNFVFQxd0QxelZ4OGV3QlcwTkx5NTJDZU1adnROU2xTNlQ0SXhQLUtVcktoM3Zta085SnhpQUI3OUNBSjNwSGVhQlVrWHlJYUpCa1JPX21LRThRT2R1Q2dhTUxTaWRZSlVBT0UtOTk5bmswcWFCSHVUSmlr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "'Love Story' team says Kennedy show criticism 'made us work harder' - USA Today",
    "description": "'Love Story' team says Kennedy show criticism 'made us work harder'  USA TodayJohn F. Kennedy Jr. and Carolyn Bessette-Kennedy Are Embraced at ‘Love Story’ Premiere  The New York TimesCelebrity Photos Updated Daily: Paul Anthony Kelly, Sarah Pidgeon, Margot Robbie and More  People.com'Love Story' Premiere Brings Carolyn Bessette and JFK Jr. Back to The Pool  Vanity Fair‘Love Story: John F. Kennedy Jr. & Carolyn Bessette’ Premiere Style: Naomi Watts, Sarah Pidgeon and More  WWD",
    "published date": "Wed, 04 Feb 2026 21:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQeGJVSkUtcExobllqQlFpYXVqVG1iTENpa1NZaWVydHNwS2U2Tk9VWnpfLWwwamYwM3ZZb1otQklIamxiX1dMdHEwb1AwbUt5SnFDN0duNUFOeWxCU3VrNVViUEFjc0x4eWlLcDJQZ1FQdGtTOFI3Q0NtVmdZU1pDQl9PZ2RqZWNYXzlVUDlOd3VLZ013OVVfeDNEeGdjRXFRSzhNTWpIUGlOOU5ENXpsa1A5Uk5qWUI2VzcweDZsMkdiemt4UGFHVm1ZdWp1eXRqOGN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "‘The Muppet Show’ refuses to modernize in its triumphant revival - The Washington Post",
    "description": "‘The Muppet Show’ refuses to modernize in its triumphant revival  The Washington PostReview: This is Your Grandparents’ ‘Muppet Show,’ Fortunately  The New York TimesThe Muppet Show's revival with guest Sabrina Carpenter is joyful, say critics  BBCThe Muppets are my rabbi, and they should be yours  The ForwardA new generation revives 'The Muppet Show' and it's as delightful as ever  NPR",
    "published date": "Wed, 04 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQZFdOVEtsVjlmOTM1ZlNnWFUtTHFQcUdVQ2N1UHFQaV9BajJ1MzJPZFEzdzJadWY3NWZKWjVZTGhXcnZOcm44d0VleGhiMWNDNXpoUXh3LWdicjdDdjVpZmFiamNjU3NmNlN6ZjZnNHN1TjExSzFOZjZLU0hyZmNRUGRDM0FiQkN4TnFRZmQtWGZjTy1mY1N5ZzlsVDE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Tony Khan announces new matches, segment for AEW Dynamite - F4W/WON",
    "description": "Tony Khan announces new matches, segment for AEW Dynamite  F4W/WONAEW Dynamite Preview: February 4, 2026 – Brody King vs. MJF in AEW World Title Eliminator, Omega vs. Andrade, More  AEWAEW Dynamite Results, Winners, Live Grades, Reaction and Highlights From Feb. 4  Bleacher ReportAEW Dynamite results, live discussion (Feb. 4, 2026): Kenny Omega vs. Andrade  Cageside SeatsBabes Of Wrath Eliminator Match, Death Riders Trios Bout, More Set For 2/4 AEW Dynamite  Fightful",
    "published date": "Wed, 04 Feb 2026 22:28:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPYi1GTnFLWk0yVndYWE1ZLVl3Qmw0LXlta25ob3JxNVc5TlQ1OERvd1RYRFN6V0hOZ2p6NjhYNE9hc1RzTGF2b3hpZ2VZaWNDSDdsN09Ybm83UDhWWnRzSkNJMWhCeHlPalJEMjQ4czliRGRTY0czZmg4azE3QnFFdVh3T2R6OVhnNmV2dVNDUEg3b3hBaE9V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.f4wonline.com",
      "title": "F4W/WON"
    }
  },
  {
    "title": "Tigers, Framber Valdez Agree To Three-Year Deal - MLB Trade Rumors",
    "description": "Tigers, Framber Valdez Agree To Three-Year Deal  MLB Trade RumorsSources: LHP Framber Valdez, Tigers reach 3-year, $115M deal  ESPNFramber Valdez signing with Tigers: Top free-agent pitcher finally lands three-year contract, per report  CBS SportsHere's how O's should pivot after Valdez picks Tigers  MLB.comTarik Skubal’s message to Framber Valdez after signing with Tigers  Detroit Free Press",
    "published date": "Thu, 05 Feb 2026 04:23:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNSi1kOFVqeUlORktOWkVOSDc2OFJzWmhmb3psSWRVYmhsZ3d4TjJoZzVWczVHeWJWLVpXeFRZaHJFMnV1bWxoYVB3cktWNnYwdXJIQVhXRlc2ZzRJLTVsRVJyd2RDc2t2NEVwM2RINU1VVS04ZTBET01RMUFQNTh4cjFXUTJ4aXZuRUMzRjExUHdDVjJq?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Five minutes into 2026 Winter Olympics’ first event, the lights went out on curling - The New York Times",
    "description": "Five minutes into 2026 Winter Olympics’ first event, the lights went out on curling  The New York TimesCurling 2026  Google DoodlesWinter Olympics 2026: First event interrupted by power outage after 5 minutes  Yahoo SportsOlympic curling competition, luge training briefly delayed  ESPN2026 Winter Olympics: Curling kicks off ahead of the opening ceremony  NBC News",
    "published date": "Wed, 04 Feb 2026 21:54:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPdVQ5NVA1TG5mNXdDamFtNG9zaFpFYng3Rm9RaUtqbWYxazJaSFFRYVVfdTNReDB4MTFRel9xSVl4N3lnbFB1NE41RW55R2ZUejhwWmROaV9SRzFXQTdrUk5rbWllMkU5UjNfLUVJWHB3SDJNYjVkOTNZaHJ0Q096UWVmZmdQX2xvSkk3NmZIb0l1M01xa0RiNjA1Z2RYNUd0NktTRzVn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Ryan Preece wins Cook Out Clash at Bowman Gray amid winter weather - NASCAR.com",
    "description": "Ryan Preece wins Cook Out Clash at Bowman Gray amid winter weather  NASCAR.comSnowed Out: NASCAR Clash Postponed to Wednesday  FOX SportsCook Out Clash may have rainy conditions  WXIIRyan Preece overcomes sleet, cautions to win The Clash at Bowman Gray  ESPNNASCAR Clash starting lineup: Kyle Larson, William Byron to line up 1-2 after qualifying at Bowman Gray  Hendrick Motorsports",
    "published date": "Thu, 05 Feb 2026 05:27:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdUdleW1pS0Z3WldaSVZBY0sydW1qNTBwbGhaOURldWgwclYwQmtxdThpMnp6aXEtQ2VKSmtVWGpBUkpDSjBfZmtOeEFaLXVSUFlOd3NEWmM1M3laRkhYckJHbFBlVTFBN0pBdkpfZldVWlpBUXBLUWh1bFlyZnJtbTA1RXlzTmpmRzBpeHJtdk5DMXFDYUYtemtwLXpzNW9aZ2fSAacBQVVfeXFMTnhuYndvd1Y0UGRGTy1CQW5zZEs5alFaaUk5M1VnQnZtMXlTNW1ZM3VnU05CLXdHeWFHRDV3UnVzLXJKRW5aREJlY3Jsa1d4aWVjdVhJekwzRm45Um5uVjdJRmJZenFYcUIycUtMYW1jMkljTTh4djFSSjVBTjNYTi1mNGdiUjVxVUQwX3Z2SEJCb3BQU0VUZW5aY3J4SGpqZUlLNW9BM3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nascar.com",
      "title": "NASCAR.com"
    }
  },
  {
    "title": "Tom Brady’s Old Teammates Called Him Out for Not Siding With Patriots in Super Bowl - Sports Illustrated",
    "description": "Tom Brady’s Old Teammates Called Him Out for Not Siding With Patriots in Super Bowl  Sports IllustratedTom Brady not pulling for Patriots in Super Bowl LX: 'I don't have a dog in the fight'  NFL.comVince Wilfork Criticizes Tom Brady for Patriots Super Bowl Take  Yahoo SportsTom Brady won’t back Patriots over Seahawks in Super Bowl: ‘May the best team win’  The New York TimesRob Gronkowski responds to Tom Brady not having rooting interest in Super Bowl 60  MassLive.com",
    "published date": "Thu, 05 Feb 2026 00:47:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQb1VxVnQyemJ2T1NJMmtrc1ZsNllUVUFrdlpLZ1E1TDFBUktvOTQ5TjA3MTRIZDFCVEwyWHdZWXo5TUhxMmNQV0lxR05CejZxcWJwTFVUZG4yUFRZMEM5V1B0RlRTdm42MXZaMnZ5cmpwUGxJQU55TGhZY2dISG54ck1BRHJ1c3pVS044TXlldndHNlZwSHdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Sun releases 4 strong solar flares: What to expect - ABC News",
    "description": "Sun releases 4 strong solar flares: What to expect  ABC NewsAnother STRONG X1.5 Flare from Solar Region 4366  Space Weather Prediction Center (.gov)Sun unleashes one of its most powerful solar flares to date  The Boston GlobeSun unleashes colossal X4.2 solar flare, knocking out radio signals across Africa and Europe (video)  SpaceAurora chances increase this week as Sun emits another strong flare  BBC Sky at Night Magazine",
    "published date": "Tue, 03 Feb 2026 20:02:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOeVByekNJUG4zSW1SRXMtTnMtVVp2My04WTR2cVJQWlVxcGtnWmJfSTFDY1M5dDhCSGNvWDVVbXFYMzk4ZFlqNkdPaXZHb0RwTll3RmR1RTFSbWxxM1N6Q0dhb0ljSEhYam9ob2hVZWxjcEhvVGU3TXRObkQxNWpBdFZrQzBuYWE2RWU2bnB1c9IBlAFBVV95cUxQazhFX0ZfVDc4T04yc2lPSURwVVluZ3VlUVFJb2xDVlBTSmNOdVRMUjY4WWtKZWl1SzVweW9xWXU4RVFjRlE1dGxzQTF4U3pFcGV4UUwyZGZkNUQzTlp3WWlxbzMxaU9qaWlNMW9hUFExT191RExXdk8zVnFpZDlBZndBSE9nMTFwdnRWUGozekk0UnJv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Glimpsing the quantum vacuum: Particle spin correlations offer insight into how visible matter emerges from 'nothing' - Phys.org",
    "description": "Glimpsing the quantum vacuum: Particle spin correlations offer insight into how visible matter emerges from 'nothing'  Phys.orgMeasuring spin correlation between quarks during QCD confinement  NaturePhysicists Get a Peek at How Matter Is Born From ‘Nothing’  NewsweekPhysicists trace particles back to the quantum vacuum  Scientific American",
    "published date": "Wed, 04 Feb 2026 22:01:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQSWxLZjVmdlFXaWlGRFFDcERJT1VtZHNBc1lZYmY0U1l0eGttWjRPZlJPSFdaN3NFam1jQTBFczF2VElzNkY3RU9tX1prY1VwT0ZWZUhNLWc0WTJJV1hNeU51dHh2NEhkdGF0cXFRMUpfckNKbUlIOXBTZWhqZHBmTWJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Scientists just mapped the hidden structure holding the Universe together - ScienceDaily",
    "description": "Scientists just mapped the hidden structure holding the Universe together  ScienceDailyAn ultra-high-resolution map of (dark) matter  NatureWebb Telescope Maps the Invisible ‘Skeleton’ Holding Our Universe Together  YahooMysterious dark matter seen in new high-resolution map of distant galaxies  CBS NewsScientists assemble the most detailed map of dark matter ever  National Geographic",
    "published date": "Tue, 03 Feb 2026 08:49:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1fMUJkTEstY1NBNmlCR3RhUjNIUE1LS3h4X2I0X3p3Mk00RFcwZGp2am5BNzZmTWFPTVRKRmdSVlprTU9FYlZid21SN185RkkyRUUzOUxHOUVERlBsLVA1SEhJMUtxVENPeVlaUlp4OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencedaily.com",
      "title": "ScienceDaily"
    }
  },
  {
    "title": "NASA's Perseverance Mars rover completes its 1st drive planned by AI - Space",
    "description": "NASA's Perseverance Mars rover completes its 1st drive planned by AI  SpaceClaude AI Powers First AI-Planned Mars Rover Drive  AnthropicNASA’s Perseverance Rover Completes First AI-Planned Drive on Mars  NASA (.gov)All About Vandi Verma, Indian-Origin Scientist Behind Mars Rover's AI-Powered Drive  NDTVNASA used Claude to plot a route for its Perseverance rover on Mars  Engadget",
    "published date": "Tue, 03 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOVWIyYkZxeVg4Nm9BVF9LdU16RGlYQ1J5NVJMbkFLYnNabW5FNnhHZmpoVG1LOHNnRzFsbUFxS2FNaTY4OGRGS3pCel9UR2VGV1RQU2ZFeFFPWkpMQTYtcnA2TUl4ZnN1dl91dTB3LWZtdUhtU2JIVllkcE1MU2NETzJ1N2tlRFRWZzB2TnBNRUtOb0RLN25fTFF2UzBWQlNnVUFvNUNxSWowM3hEbk1xeVk4TkxWZ3JtTUQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Most Preventable Cancers Are Linked to Just Two Lifestyle Habits - ScienceAlert",
    "description": "Most Preventable Cancers Are Linked to Just Two Lifestyle Habits  ScienceAlertGlobal and regional cancer burden attributable to modifiable risk factors to inform prevention  NatureNearly 40% of cancer cases are likely preventable, study says  Euronews.comMore than a third of cancers arise from preventable risks  The EconomistFour in ten cancer cases could be prevented globally  World Health Organization (WHO)",
    "published date": "Thu, 05 Feb 2026 01:44:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNcVI0OTgzazZtMWFmVEZzQXlWb2o5U1ZYZmpJbjQ1cmZzTWtFWTZEVzd4QnZxdzlTWTVzOXNtSVJQWDVwd1VJeEdkbjdNZV9KRms2SUhNYUpMd1Bza3RDN2d0TE1ycUZYYWVFM09VcS14NElNRy1icEZDeHVqVkJTRHRXb29PWDRuSlBUTEhmZkdDVHc5WjlGTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencealert.com",
      "title": "ScienceAlert"
    }
  },
  {
    "title": "The Silent Signs Of Heart Disease All Women Need To Know About - MindBodyGreen",
    "description": "The Silent Signs Of Heart Disease All Women Need To Know About  MindBodyGreenOhio mother of 3 who survived 2 heart attacks: ‘Get checked’  FOX 8 NewsHeart disease remains the top threat many women never see coming  ABC NewsAmerican Heart Association to host Kern 'Go Red for Women' luncheon on Feb. 6  KBAKPalm Beach County hospital leader spearheads local women’s heart health movement  Florida Hospital News and Healthcare Report",
    "published date": "Wed, 04 Feb 2026 10:25:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxONVh0ZnNOYkZHMmxaN2FUb2JlLW9BQTdZVkRXRmxfdDJjUWoyNzRibno5MURUemQ5bExZQlhpZTBZdUhvcWdHLXdrQ2FwT0RCTWhYSmcxUDFaV1dJTmpIclBKRC1BRW1BUkRBM090LWhZcE5yRGRnWDk5NHY2aTJ0dTFWUFlDWjVuUTlWZ0JneEZJT0JQVDltVw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mindbodygreen.com",
      "title": "MindBodyGreen"
    }
  },
  {
    "title": "Opinion | RFK Jr.’s attacks on vaccines just hit a wall of pediatricians - The Washington Post",
    "description": "Opinion | RFK Jr.’s attacks on vaccines just hit a wall of pediatricians  The Washington PostTrump administration cuts recommended vaccines, threatens public health  the Southerner OnlineUI community reacts to change in vaccination recommendations  The Daily IowanHow will CDC vaccine schedule changes affect CT residents?  The Bristol EditionNew Mexico Department of Health experts discuss child vaccination guidelines amid federal changes  Santa Fe New Mexican",
    "published date": "Tue, 03 Feb 2026 20:49:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbnkxcWVzYmEwVHAyWHdpWHc3V3F3ZV8wOWtBZ052OWZoa19ud2tKNjFtRTlKWExWTW9melNnbnFlQ28xX1hvQy0walNHY1RzZ3JlNDltS1BGOVJHeHRNb1EyRDdkNk5qdGJTYVRocEc1Ym1CRTV5Z0V1VXU4X2Z1Qm9rdUNmcEVIZ0hIRDA2bEM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Measles exposure in Milbank, Brookings - KELOLAND.com",
    "description": "Measles exposure in Milbank, Brookings  KELOLAND.comDepartment of Health confirms 5 cases of measles in Milbank  Dakota News NowGrant County man visits public places in Brookings, Milbank while infectious with measles  South Dakota SearchlightDepartment of Health warns of potential measles exposure at Brookings wrestling tournament  Madison Daily LeaderGrant Co. Man Visits Public Places While Infectious With Measles  yankton.net",
    "published date": "Wed, 04 Feb 2026 21:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPVDM1dHBfaHpfcGlLRUJoRDJsZ3llZ3F0S1VMaU5ObHBuMEVtUEluZWhYekI2WWRaYWpBd0x4Zm9YZjNoa0t4bjRMZDFUcExObHNQSDJXS29ic2gybGU0LW9XdnRYR2RyT2JzZkxmVnIzcXZMRjF0NXhIVE5wdTdweGtYVkg2d9IBiwFBVV95cUxPVHRtWlZOTmVEVXo4QWxFenRPc1NRWUdOODNnU3FVeHE5TFF1ZHlNLXVqLXJPZE5oU3VDc3NzdzJUM3pMTXNxWEwxWnlQQTdWWVhiSkE0b1ZPaTBuWVpaM0lOYzI5am4wNmlVa0h2WjBNQ05PdkVUSGxkVEJDNVNYeU9zMDQ1NDBpMkdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.keloland.com",
      "title": "KELOLAND.com"
    }
  }
]