[
  {
    "title": "Epstein files end business, political careers across globe - Axios",
    "description": "Epstein files end business, political careers across globe  AxiosEpstein files fallout: The high-profile people burned by past dealings with a predator  CNBCTamara Keith and Amy Walter on the public's response to the Epstein files  PBSBondi criticised after saying all Epstein files have been released  BBCOpinion | Ro Khanna Is Shaken by What He’s Learned From the Epstein Files  The New York Times",
    "published date": "Tue, 17 Feb 2026 07:05:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE4tdW1xWUl4R040WGxNOFM3ZXltV0JtN2tvZThPS1dEdEN1YTBIWFdoMURoMEU5TEx3QXFGc2NBdjhuZ0piWU9sMEIwVHU1em5UWGZ3bHZobUlVUFRMR0F4UG11NHdfS3lpeE8zc1A3eV8tVEEybWZyOGxzeGZPWTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks - AP News",
    "description": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks  AP NewsU.S. and Iran Gear Up for Nuclear Talks Amid Rising Tensions  The New York TimesNuclear talks hinge on US avoiding unrealistic demands, Iranian official says  The Times of IsraelThe patience and the poker face: Iran’s wily diplomat set to face the US in nuclear talks  The GuardianUS-Iran talks live: Second round of nuclear negotiations begin in Geneva  Al Jazeera",
    "published date": "Tue, 17 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdU9KcTluVUp5cU54V2FibWZEd0dBTkJpMVhhSXFUbnh2ZDlOLXUwTFlFZmx6T0JSeC1RN2Z1SVRwMlc3R3RCWXRDR2tUUmhndG9WX3RPcENwT2N2OUk0WWpoRmF2QmF4cGJGd1ctVFE0M3RjdGloZ0pGV0s2V1hmc002OVJNTVB5dWlXLXJOeGZSZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "American surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica - CNN",
    "description": "American surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica  CNN‘You left waves’: Shock over apparent slaying of ex-Santa Cruz surfing great in Costa Rica  San Francisco ChronicleAmerican Hotel Owner Slain in in Costa Rica Robbery  The Tico TimesElon Musk's Social Media Site Tanks as X Goes Down for Thousands  The Daily BeastSanta Cruz native and son of well-known surfing family Kurt Van Dyke reportedly killed in Costa Rica  Santa Cruz Sentinel",
    "published date": "Tue, 17 Feb 2026 06:04:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNN2NybTBZQlNQbG1iSm1lZVVRWHNGRWM1TXdPd1BqMUExTFRkc2ZTWXp1RVJzMHE1VDUzenJma2dJM0s0MWV3WjhGTUw1T1hsaDJxVXl0ZnB5cVdnWUUzU19XdVFaZXpQRUQyc3diQVUwX1VtZHlqUGlpamVncDlFdnpMOUFuSWVxZlVwaHdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "George W. Bush praises ‘giving up power willingly’ this Presidents Day - NJ.com",
    "description": "George W. Bush praises ‘giving up power willingly’ this Presidents Day  NJ.comFrom One President to Another, a Love Letter With an Edge  The New York TimesGeorge W. Bush is on Substack. Here's what he said about another George  USA TodayGeorge W. Bush’s essay on humility offers a timely critique  The Globe and MailGeorge W. Bush: What I Learned from George Washington  The Free Press",
    "published date": "Mon, 16 Feb 2026 18:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOS3RGeW1vcWJiSW5yc1BuU2p4RHcyam9hUHRMa25fZnJtYUQ4Sm5OSWUtTzVzRlRNVk5ZT3JHSWsyR0laUlY2QnJMVnRtVjk4SG90em12c3F3SXpjc3FkS2U1UEZXdXNwdG9NbTM4dWkzNGc1VnBjakI4bWYySG1tQnhlU2drNnRycjV6N1B0UlZoQ0I0NTBkMElBSDVJSGNERWJjNXVqNWNXVmRj0gHAAUFVX3lxTE9ZZkg4WEpkb3dLeTdUdTAxUVA4RHV3MkVxdWU0Ulo2T1l1bHR2elJUaEVPMGxldHhjRWdrTFB3eF9oQUwzczVFZGkyNkZxSlY1WUhnRzJ6aDFRTUJBbzNrT052a1VmZmpjYnlzQUtJbEtqTzYteFNQUWVBbTQyLTRVeFJNVU44Ml91ejY3SGdRRWhGU0NBem1lV3R2QjgtenVFUUxueTFiY3phSThhUUt2amxfQnBsTTBTcWFPenpuSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nj.com",
      "title": "NJ.com"
    }
  },
  {
    "title": "Lunar New Year 2026 live: Year of the Fire Horse - BBC",
    "description": "Lunar New Year 2026 live: Year of the Fire Horse  BBCChinese zodiac predictions: What’s in store for 2026 as we enter the Year of the Fire Horse  CNNLunar New Year: Global celebrations welcome Year of the Fire Horse  Al JazeeraHappy Year of the Horse! Let’s trot out some fun horse science  Scientific AmericanDon’t cut your hair and no sweeping – how to boost your luck in the lunar new year  The Independent",
    "published date": "Tue, 17 Feb 2026 03:50:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE55SHAxR1VqbjFUcHVza3VhOUxoVWRELUZ4VHcweWh1TERTSEVnN2dzX1p0WkMySGdKOUVlNndPMkZCMjh1b05oalRNNGJIN25vRWc2VQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Australia refuses to repatriate ISIS-linked citizens in Syria as escape attempt fails - CNN",
    "description": "Australia refuses to repatriate ISIS-linked citizens in Syria as escape attempt fails  CNNAustralia rules out helping families of Islamic State militants leave Syrian camp  NBC NewsAustralians with alleged IS ties are turned back after departing Syrian camp for repatriation  AP NewsAustralian IS families in Syria camp turned back after leaving for home  BBCAustralia won't repatriate 34 women and children from Syria  NPR",
    "published date": "Tue, 17 Feb 2026 04:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPSGFsaFVZNnZnemZvUFU5NXYwUGZ3Ml9kTlNqS0N6cUFxckw4LTlIMUE2dVNIcjhVaHdmVmxyWlU1S2dZZTA5RU9ZTFB0bHhLYWNtZlRBbHQ3c2RvNXFKN2UtOGZOUS1nQlJRVDR0VW5PSlgwV2ppV0JlcndfR3hSYjlMMHFFZnF1cTFIdXhkTjNHMncx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Nancy Guthrie disappearance: Savannah Guthrie says 'we still believe' as FBI investigates DNA - Fox News",
    "description": "Nancy Guthrie disappearance: Savannah Guthrie says 'we still believe' as FBI investigates DNA  Fox NewsLive updates: Nancy Guthrie’s family members aren’t suspects, sheriff says, as FBI continues to analyze glove DNA  CNNFBI: DNA recovered from glove found near Guthrie home that appears to match glove worn by suspect  AP NewsGuthrie family not suspects in Arizona kidnapping, sheriff says  KSL NewsClues in Nancy Guthrie case include video, backpack, possible DNA. Here's what we know about the evidence so far.  CBS News",
    "published date": "Tue, 17 Feb 2026 07:39:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUVVaVk5nMF9zNUZzQXZENFpiVmVsWUFnRUVUbFV5aTdvQThoMHoyNU52Y2pTWlFaVmd0UmR5cG9PZkE0WE5zWk1JX0pMc0RKSlRWUFlibkMtZzZRTExFUXZrUHU1U2s4ZWFUZG8yc0k0LWw3czJpSmd5Z2xOeVlMRVR3WlJaSmswYnhIamlsenViNmPSAZgBQVVfeXFMTmNIUHdya0tqWnJYR0xya3RUMmc4bmVCNXlaUVZUSF82emkyS1RybzhrOTU0amJicC1BVVBMTzhsRWJYS3VjZEVlUjdYTnA2ZUV6QUdzMkgxSFdSX1JHcmpVdFBkb2tuWDdnNlUwMmRfU3BiSnl5emlsdFZyR0s5b29UVWIwZEJpVzFOYVVhMF9JVzNjMW5yZTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foxnews.com",
      "title": "Fox News"
    }
  },
  {
    "title": "FBI won’t share Alex Pretti shooting evidence, Minnesota authorities say - The Guardian",
    "description": "FBI won’t share Alex Pretti shooting evidence, Minnesota authorities say  The GuardianFBI won't co-operate on Alex Pretti investigation, state officials say  BBCFBI won’t provide Minnesota investigators with evidence in Alex Pretti killing, state says  Minnesota ReformerFBI will not provide the BCA access to evidence gathered from Pretti shooting, BCA says  MPR NewsHopes that the FBI would share evidence in Alex Pretti’s killing with state investigators have shattered  CNN",
    "published date": "Mon, 16 Feb 2026 20:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNSmRhZ1laWkhTSHB6OFlHMGU0QVk2MkhRSGJIRUJiMnlab3NrcUgyZUI0emc4RjZucTlVNGdIeFQyLVBER2RSUTdISXpVS0hIZFBWR1AtVEdPbmFhbDZXZ3IzMGRyWnpFSmxxR1drVVBtU3ZaX0lnY1RFQU10YnZQQVFlTUN1WkRtLUtRTkd5eDlwRk5QUm1VY2h3VzJvUXFPTFVOeFFrRnQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "The U.S. ready to make up, Europe ready to break up in Munich - NPR",
    "description": "The U.S. ready to make up, Europe ready to break up in Munich  NPRMarco Rubio Doesn’t Get It  The AtlanticSome European policymakers welcome U.S. Secretary of State Rubio's warm words, others remain cautious  CNBCWarmer words but relations remain frosty between the U.S. and its old friends in Europe  NBC NewsThree American Speeches at Munich, and Plenty of Confusion  The New York Times",
    "published date": "Mon, 16 Feb 2026 19:49:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5seVFLZE9pRjJNWGNEVldfOWhoVkt5Qnh6WjhLZXVIUExzZnBIM0JMXzQyUlU5MkdaVzBwcHZhX1pycnU4VHU5eWFuVVVHdmpFcXpGc0N3ZmJOZFNFcHdpNTFaQlZuNmdOZi1nUEl5RW42ZFo3SFc5LURaOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "US increases military pressure on Iran ahead of high-stakes talks - CNN",
    "description": "US increases military pressure on Iran ahead of high-stakes talks  CNNTrump says Iran \"doesn't want the consequences\" of not making a nuclear deal with the U.S.  AxiosU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesTrump says he will be involved indirectly in Iran talks  ReutersU.S. military preparing for potentially weeks-long Iran operations: Reuters  CNBC",
    "published date": "Mon, 16 Feb 2026 20:46:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBSWHlaM1ZRVFYtRDVQNEEwbk9LOU44aXZqbVU4dFpfb05YWko0TmljUGdJVDd0X1RDWTd4blhUTFV2T0FHeDJsRUtCVXBRbHMydDlKMkl2TUpiVEpMVEliamIxcVN2dTZENW5xSGx4Ml9JUlJxQjVJejBrVWRmZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "U.S. Ally Humiliates Trump by Degrading Him on Presidents Day - The Daily Beast",
    "description": "U.S. Ally Humiliates Trump by Degrading Him on Presidents Day  The Daily BeastGermany news: Crowds throng streets for Carnival parades  DW.comPantless Trump with tattoos featured on German carnival floats  The IndependentDonald Trump And Epstein Get The Carnival Treatment In Germany. And It’s Brutal.  YahooGerman carnival revellers take swipes at Putin, Trump, Epstein  communitynewspapergroup.com",
    "published date": "Tue, 17 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUk9PQnM4c1BXUXU3bUdwUTV1b19mMWZ5c3dXbFJPZHpacTVtRFlCZ29tRFFObmR6U3RVTjB6VlBFbFQxV2xoUFJmV2x6UklLZHY1amxQVEROQkZ2cko4Z2pqOEFHRXFOT1hjVDU0dlpXOEhmOTJqdG8zaFZTLTY0UV8tbnIxMms5Q1NmZ2R1TkxZb0Qx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Brazil Carnival street party do’s and don’ts: A survival kit from veterans to beginners - AP News",
    "description": "Brazil Carnival street party do’s and don’ts: A survival kit from veterans to beginners  AP NewsHuge floats, wild costumes and nonstop street parties: Brazil Carnival in photos  AP NewsBrazil’s biggest celebration transforms Rio into a sea of color  USA TodayLet the revelry begin: Rio mayor hands city’s key to King Momo as Carnival kicks off  QFM96Carnival 2026 samba queens set Rio ablaze in jaw-dropping costumes: PHOTOS  New York Post",
    "published date": "Sun, 15 Feb 2026 19:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNRGJNSnZEeDg5cU5YcWxKVDhkb1JEU1g0OUQtLXlCcmRiNkhRSnFLVHQtX2txa1RvUnNfLW83MW5JWnFwU0dKMHhGMXp4YUdFQTRUTlZfZkNNb1h5YTZibDlud0tUbE1YOE5EcjZMeTgxTDBLZ1I5Q1NYanViSEt5MWFqNjUtT0RpNV9RSFByOElWSWNoVlZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Was Navalny poisoning by frog toxin meant to send a message? - The Guardian",
    "description": "Was Navalny poisoning by frog toxin meant to send a message?  The GuardianWhat is the dart frog toxin allegedly used to kill Alexei Navalny?  BBCRussia accused of killing Navalny with dart frog toxin. What we know about the rare poison  AxiosPolice filmed everyone. Nobody hid. At Alexey Navalny’s grave, on the second anniversary of his death, his mother stood in the freezing cold and listened.  Meduza — НовостиKremlin rejects claim it poisoned Navalny with dart frog toxin, widow says truth is out  Reuters",
    "published date": "Mon, 16 Feb 2026 17:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNMWZSY3g2Y0JObDlZOU5XazlZMEEySzJoREZuSGh2SjZvN2NSZHdTNjRuQ0xQRkVCa0VpSk0wczhsUFZPSTU1TXJVOUFPV1VfTkZYVWYzXzBDZHR4ZzJOaGNWbFU2SEx3LXgyV1lwUEJaUkNqeHpycE9zRE05Y0FRektvaGNiRWM2amwzYnNLYm92TG93a0lxSDdZQ1ZObEc3eDdmaGdERFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Eleven killed in Israeli strikes on Gaza, rescuers say - BBC",
    "description": "Eleven killed in Israeli strikes on Gaza, rescuers say  BBCIsraeli airstrikes kill 11 in Gaza, Palestinians say; Israel says Hamas violated truce  ReutersIsrael kills 11 in Gaza as Trump announces $5bn pledge from Board of Peace  Al JazeeraIsraeli airstrikes kill 9 in Gaza, including tent camp, Palestinian officials say  NBC NewsAt least 12 Palestinians killed and several hurt in Israeli airstrikes on Gaza  The Guardian",
    "published date": "Sun, 15 Feb 2026 18:42:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9SOHZUQmJnNmVoMHphR2VfVHRVU0xpZmx4R0dqWjNkSDVTTmEydUdqU0RZUXBEUjlUWENMWlZNSm8yYW9vQU1BdXVxX0F2TVpqM3VmTlZEdFNaQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Tom Pritzker, Hyatt Heir, Steps Down as Executive Chairman Over Links to Epstein - The New York Times",
    "description": "Tom Pritzker, Hyatt Heir, Steps Down as Executive Chairman Over Links to Epstein  The New York TimesHyatt executive chairman steps down over Epstein ties  CNNHyatt chair Thomas Pritzker steps down over Epstein links  The GuardianHyatt Hotels chairman steps down over Jeffrey Epstein ties  BBCThomas Pritzker, Named in Epstein Files, Retires as Hyatt Executive Chairman  The Wall Street Journal",
    "published date": "Tue, 17 Feb 2026 06:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQTTlSemZ2c1MyaWxjTWYwV21nQ2xsYUsyclpjR0JIZ0NISHhVTUdMaDNNNWs0TUlZb1dNclkwNjVDTHJBemplclJsSkdSZ2MxeXczbmxqc05HcUtkaTZjRElkYm9jY0pGYTB3OXprbGhWR2RNaGZtTGVmZmlwSm5mbkpZNFM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Exclusive | Activist Elliott Builds Big Stake in Norwegian Cruise Line - The Wall Street Journal",
    "description": "Exclusive | Activist Elliott Builds Big Stake in Norwegian Cruise Line  The Wall Street JournalNorwegian Cruise Line stock is rising. A big activist reportedly has taken a stake.  MarketWatchElliott builds over 10% stake in Norwegian Cruise Line- WSJ  Investing.comActivist Elliott builds over 10% stake in Norwegian Cruise Line, WSJ reports  ReutersThis Cruise Stock Is Jumping In Overnight Trading - What Is The Activist Investor Play Here?  Stocktwits",
    "published date": "Tue, 17 Feb 2026 02:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOMEhzUkNkWkpHUFdVZEFqVVA3UGlVOHdfSHRFUlRKdDAyTEM2dUxPOHY5blZxOE9HWEZ0X1lNZ3hDVldOMGpmLUxSLTZwbndWcm9aQUJVNlVtS3dEQS1tSkRiUXJ5TTUyQkNxQ0w2aHhsck5XNV9BbkphUjI2c1JsQjZaSmp1QWFORFhERi1LY0x3blVyR2k5MnVsQl8wZHY2Y3pTag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "SpaceX to Compete in Pentagon Contest for Autonomous Drone Tech - Bloomberg.com",
    "description": "SpaceX to Compete in Pentagon Contest for Autonomous Drone Tech  Bloomberg.comMusk in secret Pentagon race to develop killer AI drone swarms  AFRSpaceX Enters Pentagon’s Contest to Build Voice-Controlled Military Drone Swarms  TipRanksSpaceX to compete in Pentagon contest for autonomous drone tech, Bloomberg News reports  ReutersThe AI War Machine: OpenAI, Drone Swarms, and the New Defense Software Era  CTOL Digital Solutions",
    "published date": "Mon, 16 Feb 2026 18:24:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQRzRJZzJDcUhIVnhsS0FMTHd3Rzg1N0lhbkR6eW5fMHhJeWR5UUlXTnVMS1BuU1E5blJSTUVycUJHUXYtWjM1aE5VQWJsbVRCRGNOS2taVzlzeVp2WUZBdEJXa0U1YUVrdVJ2Q2tzMnZKa3FUMEMwd3BUMGxhVzUzalJUVlZlTWMwbTJjT1UwQkcyVUVrUThZd2ZhU0IwbzlESmpHVHRYdnRlVE1ZWUYtREJMcVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Travel has gotten too expensive. Here’s what to do about it - The Seattle Times",
    "description": "Travel has gotten too expensive. Here’s what to do about it  The Seattle TimesTravel is getting too expensive. Americans are hitting a breaking point.  USA TodayReport shows Las Vegas as top 3 city with increasing family vacation costs  NewsNationTravel Inflation: Where Family Vacation Costs Have Risen the Most  fox41yakima.comSticker Shock on the Strip as Vegas Family Getaways Get Priced Out  Hoodline",
    "published date": "Mon, 16 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNY1M5X3RxQXl4TnR5dFZ4bmQ3U2EwMUZTalVwTGk4dE94NU9ZUkdBdjBVLUtPV2ZyT2J6cXBmcUZ1dW05aGhXYVVZLXQxUkNXLWYwSGVJMW5TaHQ5dlhabEdieEp0Z0tXeklnelRBRENlY2VRRDZzY0ZoTll4Vlowd0JLWkU1ZzNRLVJ3dlBGTnFEa25TRjU0RXdoWk90Mm95?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.seattletimes.com",
      "title": "The Seattle Times"
    }
  },
  {
    "title": "Here's another look at the Galaxy Buds4 and Buds4 Pro ahead of launch next week - GSMArena.com news - GSMArena.com",
    "description": "Here's another look at the Galaxy Buds4 and Buds4 Pro ahead of launch next week - GSMArena.com news  GSMArena.comMore leaked Galaxy Buds 4 images show Samsung is going back to basics  9to5GoogleSamsung clears space for Unpacked with a Galaxy device vanishing act  Android AuthoritySamsung just erased the Galaxy Buds 3 from the USA ahead of Unpacked  SamMobileGalaxy Buds 4 Pro Retail Listing Shows Images and Features  SammyGuru",
    "published date": "Mon, 16 Feb 2026 22:44:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOOGhjN0ZMbkFjd2RjT1M0dk5EalhfRVpOLWF6S3F0TXFEYmdhNVFWYkNEYWIyTGpnQmJXSGdodFVDc3dtdjQ4cy1aZmoxd1c0SzFrSTl2MlgtSm9kYjNVSFdhYktvM0YxWFY2RXc5bzJmdXVDOFdxSWU1SHpVX0NSdGdZR3I1ZWt3bTZyWm8wNFZCazR6UHpfQlhCdjl6YXNWbllNcThLN0ZNX3hacDd2dXE1ZHQ1Q1g1UWfSAbYBQVVfeXFMT3daQ0liUkw0cldkZ0FXNXFMa0xDaHVrY2ZTYXc3aXNVaHVfQzRYc0tuNGlod0VLNGpQWkRoS3hhd3d0SDJGQnpGNUxKWmF2d1lqdGNiY1FyWEpHM0R5NWpRaGFGRHNLaGlOTnc0a1VZSm5TQTlVWGdmOHNtaEVsak5pQmYwejk0SG9JZXpCQkdhLVFid0NXbWszb3J2bmU3LUdWSmNvZmY3dmdiWG5LbTJ4RHRjREE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gsmarena.com",
      "title": "GSMArena.com"
    }
  },
  {
    "title": "Google fixes exploited Chrome CSS zero-day - theregister.com",
    "description": "Google fixes exploited Chrome CSS zero-day  theregister.comNew Chrome Zero-Day (CVE-2026-2441) Under Active Attack — Patch Released  The Hacker NewsGoogle Patches First Actively Exploited Chrome Zero-Day of 2026  SecurityWeekGoogle patches first Chrome zero-day exploited in attacks this year  BleepingComputerGovernment Issues High-Severity Alert For Google Chrome Users  NDTV",
    "published date": "Mon, 16 Feb 2026 12:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE56RE1GOUF3dGtJNWhRLWcxaDZFQk53RXZIbmpXTVhJYWVoaTZBWmhhM3lnNTk2OWVON3l4ZVZuUjdVYWNzMWJqdHdibWpZWVM4MXh3eTVvaVdSdVkxeW16alNBR21CZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theregister.com",
      "title": "theregister.com"
    }
  },
  {
    "title": "Unity says its AI tech will soon eliminate the need for coding - Game Developer",
    "description": "Unity says its AI tech will soon eliminate the need for coding  Game DeveloperEngine Maker Unity Focusing on “AI-Driven Authoring” to Allow Devs to “Prompt Full Casual Games Into Existence”  WccftechAI will boost games not break them, says ‘Clash of Clans’ maker  Financial TimesGame Makers Turn to AI to Cut Costs and Boost Productivity  KoreabizwireWhen AI Starts Building the Game  The Motley Fool",
    "published date": "Mon, 16 Feb 2026 17:14:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPZzVlajNEX3JnUHlHS0dpaVFBYm95SlA2cnpVTU0yRWdNaVBZUDFPa3dhdFFtUVNhSVZOLV9kVlM0WjJOeHV3WS0xWkdocUNndjhpTzZNcUQ2OFk4UmtHYjYwUm5LZDJaai0tYmVqVThZekM5R2hkNEhXVmxSYTFzRzJPR1p0T1o2bmRvVHBicGt2aF9pUlY4b1pLbjBHN183anlTSEcyQjVTLXA1Q2lHTHpreGpTcU94Vk9PbjhMVEljOUl6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gamedeveloper.com",
      "title": "Game Developer"
    }
  },
  {
    "title": "Assassin's Creed Shadows winter roadmap includes community parkour and Switch 2 Claws of Awaji release date - Eurogamer",
    "description": "Assassin's Creed Shadows winter roadmap includes community parkour and Switch 2 Claws of Awaji release date  EurogamerAC Shadows Title Update 1.1.8 - Release Notes  UbisoftAssassin's Creed Shadows Roadmap Includes Major Update, A Parkour Challenge, And Switch 2 DLC  GameSpotAssassin’s Creed Shadows – Claws of Awaji DLC shares Nintendo Switch 2 release date  Nintendo EverythingAlmost a Year On, Assassin's Creed Shadows Post-Launch Support Continues With the Addition of a Jump Button  IGN",
    "published date": "Mon, 16 Feb 2026 16:57:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNVWtMeWFyRkdlQ0l4cXViWnhtQkxHd0NzMzIzMzhWRkVQaUZLQWRBalZ5OXVEaVdJZWNMSG83ODAxR091V0VJRWMyZVBpQmFuNFhLejVaRTVzUzc2VmpTZFA3b09TZEhlX2pCRFdXS2ZNRm9pMUZERlNHanFyZkpvMk9LeF80eldyT1dKX3FPaUNTNXgwZjhxcHRZSVZyOWxkZnVfeElMaVBBU3pVa2VIZG1tbWxUV3BPNmJ5aS1XTncwd01KbWxOdHVmOWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "Los Angeles Mayor Says Chairman of 2028 Olympics Should Resign - The New York Times",
    "description": "Los Angeles Mayor Says Chairman of 2028 Olympics Should Resign  The New York TimesL.A. Mayor Bass says LA28 head Wasserman should step down - Los Angeles Times  Los Angeles TimesLA28 chair Casey Wasserman to sell talent agency amid Epstein fallout  KTLAExclusive | Casey Wasserman Is Putting His Talent Agency Up for Sale After Epstein Fallout  The Wall Street JournalThe ‘Epstein Fallout’ Is Spiraling Out of Control  The Free Press",
    "published date": "Tue, 17 Feb 2026 04:34:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMGM4blY2emR1UHc1QVZidjZxdkFaUFdYQ05yZ1lJNUJvMUJ6ODBjVjZwQVlpYlZwb1NzdWs5Z2l4MHFnN3hWNWV4VFJ0OWhUa20wZGxrSE5xYUkwSm9wMUxYVndnbWJmS0xfbkRtb2ZndkNKSkhxRGxybUQ0VTFrNHlMU1M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Shia LaBeouf’s Mardi Gras Bar Crawl: “He’s Terrorizing the City” - The Hollywood Reporter",
    "description": "Shia LaBeouf’s Mardi Gras Bar Crawl: “He’s Terrorizing the City”  The Hollywood ReporterView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 03:07:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPeHVCU0NiRjFNazFXSWpZT1E1NHh0OHpzS3VoRVZQOXpWcEwtQXNoSzJzeFN0dzU0ajNOVWU0RmF3WnJ0TnFmczRlQm5OZVg3ZzIyaE1LMGNkRmY0VmRhX1BXb2FPSTZVRmx2NlB5V1IyRm41c3E1VnFxSFI0TEkyaEJRYlBpdDZ0QjZJUXlFX0lFLXdoZERDZks2WGx6Q210VTJUSWtwaUg2YnRtQnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "ByteDance's Seedance 2.0 AI video generator sparks Hollywood outcry after viral clip - TechSpot",
    "description": "ByteDance's Seedance 2.0 AI video generator sparks Hollywood outcry after viral clip  TechSpotWhy an A.I. Video of Tom Cruise Battling Brad Pitt Spooked Hollywood  The New York TimesByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlash  CNBCScoop: Disney sends cease and desist letter to ByteDance over Seedance 2.0  AxiosTikTok’s Chinese Parent Has an App to Replace Hollywood  The Wall Street Journal",
    "published date": "Mon, 16 Feb 2026 12:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNWHU2d2ltcjFLVG9lNTdSdVhuNWRWbWMtRGlaZUlucmR1SVNSZmV6dllkeFZ4S1p0QnN4YTdBSW56UVlFTHMzRXRzaE9FejA2ZktCd3E1YkQ1YmE5Vm14Z2pXRVVoLTZHcm9wMWRMQkxEcEZMSmNLT2lKclBiN1AwU0VidGl3eTBZOWRmSkVzWnV1MmY0RngwSDJ6ckYxLW9r?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.techspot.com",
      "title": "TechSpot"
    }
  },
  {
    "title": "James Van Der Beek's friend slams critics of family's GoFundMe: 'You have no idea what they endured' - Entertainment Weekly",
    "description": "James Van Der Beek's friend slams critics of family's GoFundMe: 'You have no idea what they endured'  Entertainment WeeklyHe was once a teen 'superstar'. Why did James Van Der Beek need help to pay his medical bills?  BBCEXCLUSIVE: James Van Der Beek Bought Family's Rented Texas Ranch for $4.8 Million Just 1 Month Before His Death  Realtor.comJames Van Der Beek GoFundMe draws 50K donations after CT actor’s death  CT InsiderJames Van Der Beek Faced Massive Tax Debt Years Before His Death  TMZ",
    "published date": "Tue, 17 Feb 2026 01:40:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPUTlEQVdXb1g2Z0p2Q2p3RHhXNC1WdkN2ZHF3WGdtRDBfOWNVOXlyYmJhMkN1V3Y0c296OFUtWmZnZGlaR1l2U3dXMlZGbnBSdXdtME1tckdXRUkyWHl4VTNXUDFVdFU5ejR2NXdWNWRJOTVxZVRrT2UtdkFoTzJrR3luY3ZLeUxtdHRYdS10SXExXzdOaGpVVw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Olympic skier throws poles, heads for woods after skiing out with gold in reach - The New York Times",
    "description": "Olympic skier throws poles, heads for woods after skiing out with gold in reach  The New York TimesWinter Olympics 2026: Norway's Atle Lie McGrath throws poles, lays down in snow after surprising DNF in slalom  Yahoo SportsInto the woods: McGrath’s solitary walk captures weight of Olympic heartache  ReutersWinter Olympics briefing: Swiss stranglehold on skiing shows no sign of loosening  The GuardianTop moments from men's Olympic slalom Run 1 in Bormio  NBC Olympics",
    "published date": "Mon, 16 Feb 2026 23:32:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPQ2RNamxUS0VuaE1wWEFtNjV3RkFIZTBNZHotb0ZFRDN0RG5QRnd2cTlnZTA2M0R1MTdTaDVieWJtdGJmVzVGLVBSTVdLTXZpWnR2MFdPY01IOEszX0k3ajFYeG9TaDdMeEZHSXdrQ1FkNEQ3N3dXY2ZlREZrWThjZ2hieTFxSEtXVHNTb2dlWFZDNWxmTmxIVEFQa09BQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trying to tame the Olympic controversy, World Curling sent in the umps. Then it sent them away - AP News",
    "description": "Trying to tame the Olympic controversy, World Curling sent in the umps. Then it sent them away  AP News'A sad day' - Canada rocked by curling cheating row at Winter Games  BBCA curling scandal rocks Olympic ice  NPROlympic curling controversy explained: Sweden accuses Canada of cheating  USA TodayAs Olympic curling surveillance grows, Britain faces infraction  ESPN",
    "published date": "Mon, 16 Feb 2026 18:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMkh2OHdhb0dSVmxUTUtKSjQwUTQ3aTltSVB2WjhZczVWQ1BYSU5SSjZIWHZVX29mSWc1OUt2N1BvYXhHakZrRkpvRVVLM2c5Z3VSSllRNlVEd1Jnc2lob3JENGZaRHNEN3Z6Y1h0bDh6Szg5VTQ0WHJMWjBwcFZ0WnRscnA3S0haT3JXUU95V1dwM2Z6Q1VYVUZzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "French hockey player who fought Tom Wilson suspended - ESPN",
    "description": "French hockey player who fought Tom Wilson suspended  ESPNWilson has been 'outstanding' on, off ice at Olympics for Team Canada  NHL.com‘That’s hockey’: Canada’s Wilson shuns Olympic tradition and brawls during win over France  The GuardianFrance suspends Pierre Crinon after Olympic hockey fight vs. Canada  NBC OlympicsNo fighting at the Olympics? Canada’s Tom Wilson doesn’t care - The Athletic  The New York Times",
    "published date": "Mon, 16 Feb 2026 21:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSm5Ncm5HSmhCS0JORWtpdkFMWWItWjlTQk1HSGpWaFBPVGhoN256TWVlN0JQaDVfRnJNLVpFZXMwTUJsZFFFeDlqbUVsN3lqQVpCNnZfM3JTNFQ4TnhtN25vaThLR3FMN1BoMVFOSnJ1T0swd2hnbEpqc2JYN0JONWVaMkxTdVRWSDEtMm43OC1rQWJFSUd0Y1lGVmNvWms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Cowboys bet everything on Lions' blueprint in bold 7-round mock draft - The Landry Hat",
    "description": "Cowboys bet everything on Lions' blueprint in bold 7-round mock draft  The Landry Hat2026 NFL mock draft: Cowboys go all-in on defense with top-10 trade as Jets, Steelers pass on QBs  CBS Sports2026 NFL mock draft tracker: 40 mocks, 21 prospects for Dallas Cowboys  Blogging The BoysCowboys’ 2026 NFL Mock Draft roundup post-Super Bowl as draft season ramps up  ClutchPointsNew Cowboys 2026 Mock Draft Adds Much-Needed Versatility, Rangy Defenders  Sports Illustrated",
    "published date": "Mon, 16 Feb 2026 14:05:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNVHE1UHdfUG9YLVlXX2tkY1NidFRCejRWUWpHaDdHNURXbHlMdDdhS0I1VVAtT1ZzV0RoMnZHNGNSd2owMTdseVJzejFibTRkRlozd3NmN2RkZHYteDFZeVYxTEpoR0ZnQl8xNElNS2pqeHFvWURpQ3J2Q0RFV1dwZGVhbWM5OUdTSC0xYzdVOUZVOGkxWjRkMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thelandryhat.com",
      "title": "The Landry Hat"
    }
  },
  {
    "title": "This Bonobo Just Did Something Scientists Thought Only Humans Could Do - SciTechDaily",
    "description": "This Bonobo Just Did Something Scientists Thought Only Humans Could Do  SciTechDailyWhy scientists played make-believe with an ape : Short Wave  NPRNot just humans, apes can imagine, pretend and mentally track things that aren’t real, study finds  Times of IndiaWhat A Tea Party With A Bonobo Taught Us About Imagination  Science FridayA Simple Tea Party Might Change What We Know About Primate Intelligence  Gold Central Victoria",
    "published date": "Sun, 15 Feb 2026 20:12:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQQzN4ZnMtUnl3NXFNbllsSDBERnFsaV8yV0ZtNlUxV1l0RmlxSnF4UnJmV1R6T3JOdDJZNjlXdVUyTTVrZkk1Yzg3dE9ZbS0xWE1McFU3OW9EUTgxMDFEcHdxem5GREc4RnpFSGk0eFZ1S1JPamFzWW5ndk0wVW9lM2ZSaHN6OGZtUXU5MnhHbXhrZjZ2NHNwdWo4Uzg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://scitechdaily.com",
      "title": "SciTechDaily"
    }
  },
  {
    "title": "How one genome creates two distinct fungal bodies - Phys.org",
    "description": "How one genome creates two distinct fungal bodies  Phys.org",
    "published date": "Mon, 16 Feb 2026 20:00:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4xTkFCQVUwalVDOXhERVdGQU1iOGFyZGs1ZE1mcXBjWTYzdzg2c2ZZVDg3UENObFNWNGJPNzN1WWRJdnJHam1BVlRyYThkRUQxY3lfM1RxMm8zOUtLbjdGMjRnSGp3dS1mZG1UTl9jUE9YZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "ISS Welcomes Four New Astronauts, Strengthening Crew for Key Scientific Missions - The Daily Galaxy",
    "description": "ISS Welcomes Four New Astronauts, Strengthening Crew for Key Scientific Missions  The Daily GalaxyFour people on NASA'S Crew-12 arrive at the International Space Station  NPRSpaceX Crew-12 Docks to Station Beginning Long-Duration Mission  NASA (.gov)Replacement crew docks at space station, boosts crew back to seven  Spaceflight NowCrew headed by Jewish American Jessica Meir arrives at International Space Station  The Times of Israel",
    "published date": "Mon, 16 Feb 2026 18:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5KTWxTZThleUpNLURBdnowUC1CMXI1ZWdjSjZfRGhBVDVVYXJsT3JDV1plV2tjaVY3ekQwY2Z4a2NRS0gtTnE4eHc2bG9kcHV3QlRZQmViQXFpWjBrbWItVXkxbE5zWlQ4UERKZFI5VHZIVmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailygalaxy.com",
      "title": "The Daily Galaxy"
    }
  },
  {
    "title": "SpaceX Hits New Milestone with Starlink Launch Amid Weather Warnings - The Daily Galaxy",
    "description": "SpaceX Hits New Milestone with Starlink Launch Amid Weather Warnings  The Daily GalaxySpaceX launches Starlink 6-103 mission from Cape Canaveral, Florida  Florida TodayDouble delivery: SpaceX sends Starlink satellites into orbit on launches from California and Florida  SpaceLaunch Preview: Firefly to launch Alpha, SpaceX to launch three Starlink missions  NASASpaceFlight.com -SpaceX launches predawn Starlink mission on President’s Day  Spaceflight Now",
    "published date": "Mon, 16 Feb 2026 17:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9xQW4xcmhDSmNyT0RFX2NMWUpuZEt1Wk91ZDFfbE4xM3RFazlCU21mVnEwSXltUzMwQUhXaGtRdUhUdFRLU09xcHp5U1drOXRhSkFBZTVlSUdxX0FkM2tZOTRvZFN0U1czRXNEemZNUmZoXzNhR1l5aUdjTC0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailygalaxy.com",
      "title": "The Daily Galaxy"
    }
  },
  {
    "title": "Adult with measles possibly exposed others in Fairfax County - WTOP",
    "description": "Adult with measles possibly exposed others in Fairfax County  WTOPMeasles patient went to 3 places in Lorton. Check times and locations  NBC4 WashingtonVirginia measles cases this year already surpass 2025 total, VDH data shows  WVIRAnother measles case in Northern Virginia; potential exposure at THIS Giant grocery store  WJLAVDH confirms 8th measles case of 2026, surpassing 2025 total  WWBT",
    "published date": "Mon, 16 Feb 2026 23:30:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPYXVnSWZLTmZwNkVKM3N1X3VYMk5xS1hWNjVQa3JuQlUtQUMwbVEzaUdtTzd5WldtVV84cnRJTVVDUE1wZExmMGFiQkpkWkNDSzFLYlNJaDRwOWdDenJReWN1azB5c0hTU3V4TVlZcU0wbk00a0lJeXdjdmd1bHFEb0ptMldiYldSNWhNQmhzRWpOTE5QalE5UU1xYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "WTOP"
    }
  },
  {
    "title": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "description": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health  AOL.comView Full Coverage on Google News",
    "published date": "Sun, 15 Feb 2026 10:08:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNMks5Y1g3X09jLU95dnJLcW1SREFvREtCbjBYTXZBeVV4UHdwaXkwZXNrMW1adjFCZGlXUVRlZlp5OU9sQk8xb0h2NHRNLU9ydW9FbTY4T1dWbFdRbVRqT0ZsNmdxdVV3cjRfV1NQN3N0VGlwbEpUZjV5Q0EteWVHVkNDU2pLRUhoUm5UT01Tbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aol.com",
      "title": "AOL.com"
    }
  },
  {
    "title": "Brain game may reduce risk of Alzheimer’s and other dementias - WMUR",
    "description": "Brain game may reduce risk of Alzheimer’s and other dementias  WMURJust 5 weeks of brain training may protect against dementia for 20 years  ScienceDailyAlzheimer's Risk Cut by Nearly 40% for People Who Did This One Thing  People.comConfessions of a brain-training dropout  The Boston GlobeThis Simple Brain Exercise May Protect Against Dementia for 20 Years  SciTechDaily",
    "published date": "Sun, 15 Feb 2026 22:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdldEYjZxM3lmdGJvOWdhcUhqNExDWml0Q05qb0JJWHJScU1QWU5qRGJKQ0FrUXl6RUJWeTZxaDc2bTZNWXFWd1NwcVZqY1ZFd2NvRV9heUFlc1Bvd2htUEM3Wk9PNVh1MndsTXA0QUVFLUVxekZ6WkRkYk5ZQnlWU1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wmur.com",
      "title": "WMUR"
    }
  },
  {
    "title": "Warning Stroke: What It Is And Symptoms To Look For - HuffPost",
    "description": "Warning Stroke: What It Is And Symptoms To Look For  HuffPostMEDICAL MONDAY: Knowing stoke signs & symptoms can save a life  WJHGWarning sign that suggests you are going to have stroke within 90 days  LADbibleSponsored Content: Signs and Symptoms of a Heart Attack or Stroke  WJHLRecognizing the signs of stroke and getting prompt treatment  South Carolina Public Radio",
    "published date": "Sun, 15 Feb 2026 12:00:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPR3MxTlVfbm1yYUlOMHZJSTlyUUdaSFRZeWNxaWR3dzB4UVJMRHdpR1ZzSHJienlrcmRRT1BlNTRmbTZIQzlxWGRaWkNPRHFEMW90RmFVaXk5TTlVTllnVDVnaDRlQnBpT2gxLUZsOWc2NEhrd1ctQlZBaUE5M3FXT0thQnBaemcyTzBWbNIBkgFBVV95cUxOcXJrbGluTDBvUWdqbUNaOGhvZ0F4YVN2akdxZnZLcE5icklpcm1rUFF3TVFqcm52dzRoZ19PQjhOVi1BZnBuZ3g0M1B4SDBQR0NWYzFITmFZVC1mWDlWNl9QZVMxVDExRlQxOHg0VlB2X0x0OW5IZUVwQ2RQN3Bad18wY0dLNk5GN3UzY0dvWk1UUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  }
]