[
  {
    "title": "Minneapolis Live Updates: Trump Pulls Bovino Out of Minnesota as Judge Orders ICE Chief to Appear in Court - The New York Times",
    "description": "Minneapolis Live Updates: Trump Pulls Bovino Out of Minnesota as Judge Orders ICE Chief to Appear in Court  The New York TimesTrump shakes up Minneapolis immigration operation as White House seeks damage control  ReutersLive updates: Top Border Patrol official set to leave Minneapolis as Trump sends border czar to state  CNNUS immigration chief Gregory Bovino set to leave Minneapolis after deadly shooting  BBCBorder Patrol boss Bovino out of Minnesota after Alex Pretti killing  MS NOW",
    "published date": "Tue, 27 Jan 2026 18:25:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNTW9VaGc3dE83QnlGTnpkbHg5T2VyT2k2aGVfenZCQk1xMjQ4andxYTIwYVkwSDNESFpha3h1TFpOSUNfUzZfSW5jeko4STBucUxCOTVzMDRZUy1VelotXy1tc3ZHR0l1QlZpQ3E2eVBfQVNHRlAxLXVPUTc5M2JBQVhERQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "First wrongful death lawsuit filed against Trump administration over drug boat strikes - NBC News",
    "description": "First wrongful death lawsuit filed against Trump administration over drug boat strikes  NBC NewsFamilies of two men killed in Trump’s military boat strikes sue US government  The GuardianTrinidadian Families File Wrongful Death Lawsuit Over Boat Strike by U.S. Military  The New York TimesFamily of Boat Strike Victims Sue U.S. for “Manifestly Unlawful” Killings  The InterceptTrump administration sued over 2 deaths in boat strike off Venezuela's coast  Reuters",
    "published date": "Tue, 27 Jan 2026 17:00:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNQ1hELWhUMTltWS1ueE1QUXNaM0R1TFpMcEtPQ0ozLWZRSTU0dXNpVGh1emt4MGJWT3kxZjM1UndLV0xpUnMtazdNd3JoZWVmN281LXZKdmJyZkJHNFpPZHAwNmdzdDRHNTdONjVIMXFmVTNwZU9XdF9JbXNlVHFxSjdmelMwOVZsWUpJNXlxQ2RmbUUzNE5wY1JkZFBNTUVxSDF4QmdKQjFHQTFZQkNpWEFSQUlpSHJiTnhNemFMeDctQk1y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Could another storm hit the East Coast soon? Here are the possibilities. - The Washington Post",
    "description": "Could another storm hit the East Coast soon? Here are the possibilities.  The Washington PostLive updates: Millions digging out, thousands without power as next winter storm threat looms  FOX WeatherAnother potential weekend snowstorm looms for NY, NJ: Early thoughts, forecast  fox5ny.comForecast models are predicting a bomb cyclone off the East Coast this weekend. Here are the scenarios  CNNWeekend nor’easter could bring another shot of stormy weather for snow-weary New England. Here’s what we know.  The Boston Globe",
    "published date": "Tue, 27 Jan 2026 18:16:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQZkpsQUs4UjBQbFZNYm9iUzZ1d1lZSnMyQWtZUEVnYTU5clloLUJuRlZ6QXQ0bFZiOWZFM0ZYRGs5aFlRMWt1aVUtcG5QNExURF8wUk1DbkIyNmFkek9Pd01TOUdtbkM2YThCOUJvMm9IVXJiVXRvTlFJTnU1b2E0VUU0WG55T0pWZkQ3cFVCWHlXcXkzYkJBZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Florida Republican Vern Buchanan won’t seek reelection - Politico",
    "description": "Florida Republican Vern Buchanan won’t seek reelection  PoliticoFlorida GOP Rep Vern Buchanan to retire, adding to wave of House exits  Fox NewsVern Buchanan to retire from Congress after 20 years of distinguished service  floridapolitics.com'Pass the torch': Southwest Florida's longest serving GOP Rep. Vern Buchanan to step down  komonews.comHouse Republican Vern Buchanan to Retire — Latest Domino to Fall in Capitol Hill GOP Exodus  Yahoo",
    "published date": "Tue, 27 Jan 2026 15:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNbzBpTFhxaVJTQTgxZFB0eDI5LVZtNzQ0aDVnT2hUcFlYbmFqazlqRHlITkFYRGxDZXgxYWItQUtHYUpSX0YyajRCRWhuTi1tVjZzeGR5Q1NNMG4yLW1aeENmNzNabF9OT3FGVk8zaE9UQ1lMQnpvS3gwa1Q0dG9sWUItZWE1ZWdKckVuN1Q2eGtyc1dvaW5tTVlZZVpSVWJw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "After rocky start, Bari Weiss to cut staff, add commentators at CBS News - NPR",
    "description": "After rocky start, Bari Weiss to cut staff, add commentators at CBS News  NPRBari Weiss adds new podcasters and writers as CBS contributors  AxiosCBS News names 19 new contributors  CBS News’60 Minutes’ Shakeup: Scott Pelley & Sharyn Alfonsi Reportedly at Risk of Getting Axed  YahooCBS's Bari Weiss adds 18 commentators, to lean on streaming-oriented strategy in newsroom revamp  Reuters",
    "published date": "Tue, 27 Jan 2026 12:52:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPclpVT1BmZXlqNjhjNHhyVXFweWRNdlhabGJvaHZXbUZLMUFleTZsc1Nja1JFajZKTVA4X3BRVzd3Y1ZKM2o0OXR6UFVwOW81b3dVSnJyRVBPSmF6THFPbTh5NEFrMk11aGdNRUgxM251NkRuZkxBNTZnSTRJOUNMbFR1Q1hfMXBZM3RGOTZQVU1jNXcxeEVpMl9MZGZlNVI0R1V1dnNsRGdybjNaVnlwc1VQS2Q3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Trump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting - The New York Times",
    "description": "Trump Holds 2-Hour Meeting With Noem Amid Backlash to Minneapolis Shooting  The New York TimesLive updates: Donald Trump says Kristi Noem will not step down amid mounting resignation calls  The HillICE Barbie and Alleged Lover’s Emergency Trump Meeting Revealed  YahooTrump on Noem: Doing ‘very good job,’ won’t step down amid Minnesota shift  fox9.comNoem in the hot seat after Minneapolis shooting  Politico",
    "published date": "Tue, 27 Jan 2026 14:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQXzljdXlkTjliUGJkel9PMTBYZGdMZmx1bWNjemtMY0tmc0k0Y3huaHZKM3NfVkRpWUpKUjVJaVhESXZOdjdqb2F2bWtCUUQzdmZZNnJ0Y3UtM096YmxZM282WDZjS2Q1dTFGazdjMk9ua2RYVVZSajYtV2EwU3JLUjlyNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers - The New York Times",
    "description": "Brothers Charged With Sex Trafficking Wage Campaign to Shame Accusers  The New York TimesAlexander bros: Another NY jury will soon weigh the fate of men accused of using their celebrity and money to assault women  CNNFederal sex trafficking trial begins for luxury real estate brokers and their brother  NBC NewsWealthy Florida brothers face trial over alleged decades of sexual abuse  The GuardianAlexander brothers had sex trafficking playbook, prosecutor tells jury  Reuters",
    "published date": "Tue, 27 Jan 2026 08:00:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNnVzRjZCR0xCNmtRb3pBd2VZNjZLeG1wWllXRHBYdFBEak5EODZTTEpwdEJ1SDF5ajZ6ZnkyLXhHYlc5aFMyaTRsa01yQkh5aXVJRklnTThXT3ptYlV4WW15VlpSQjRGUUxmY2ZnZVVPQjRpTi0wXzV3aElndWJOblpDa09JSGdnYkZVNFprek03dTBINndvNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next - The New York Times",
    "description": "After Alex Pretti’s Killing, A Divided America Wonders What’s Next  The New York TimesAmerica has reached a tipping point on fascism – and on opposition to it | Robert Reich  The GuardianAlex Pretti is the latest victim in the Trump administration’s drive for dominance  inquirer.comNear site of Alex Pretti’s killing, a Whittier church opens its doors  mprnews.orgTrump’s enforcers have unleashed a fascist fairytale on America  The Independent",
    "published date": "Tue, 27 Jan 2026 10:04:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQeGgzbUxpbzk4NElBX2FCVWhTaFV6ZkFYVV93cGRZU2ZCTmNiOEZ4aFU4alZ2bVRkaklKU0xFOU50OWJ1RVFnb2tPcDNHV1R0Z2gyM1pqS2lESWNqVE1nTDZRVnZHOWx0QXdvNHB4TmVDX2lPYzRuNVBEN2d3QlMxdVVLR0dGaktYZXBpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Trump raises US tariffs on South Korea imports to 25% - BBC",
    "description": "Trump raises US tariffs on South Korea imports to 25%  BBCTrump says he’s raising tariffs on South Korea because it’s ‘not living up’ to trade agreement  CNNTrump Threat on South Korea Jolts Trade Partners Who Thought They Had Deals  The Wall Street JournalSouth Korea scrambles to pass U.S. investment bill after Trump threatens higher tariffs  CNBCTrump Vows Higher Tariffs for South Korea Months After Trade Deal  The New York Times",
    "published date": "Tue, 27 Jan 2026 09:56:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE81UXpNM1dyWDFMc202dHlFcHp3NFRkb1JBRHNiSWwwaTdtRUhSS012aHZKbWF1SDg3UTdXUnpDRVhsNEJZVTVXU2ltQWRTMnZGT0c0MEFvSEs2Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "How Trump’s Threats to Greenland Made Him a Liability for Europe’s Far Right - The New York Times",
    "description": "How Trump’s Threats to Greenland Made Him a Liability for Europe’s Far Right  The New York Times'The damage has been done': As Trump claims victory on Greenland, Europe loses trust  NBC NewsThe Stillbirth of the Nationalist International  The American ProspectThe week that transformed Europe’s relationship with the US  CNNNews Analysis: A playbook emerges to counter Trump as ‘middle powers’ unite  latimes.com",
    "published date": "Tue, 27 Jan 2026 10:02:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQcWVlVDllRHhFeVdtbWUzN29OXzFUVWwzbVd5Q1VQZHJNcWJCSTVkTTh6THFZVTh2MWp2dU53THk2Mm5kZC1hNHpFVEFKMHhaWlBWcEFnbFU3UklQb3JET2RDcjJrZTNJMVg5S3pmX2lEa1NHNGRWQm5QS182dDBsWVZkTU01MEFicjNBckluQU5sREtXdWlyaVFVNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "World pauses to commemorate International Holocaust Remembrance Day - AP News",
    "description": "World pauses to commemorate International Holocaust Remembrance Day  AP NewsThe Shoah is already here  JNS.org‘We must stand up for our shared humanity - each and every day’: UN human rights chief  UN News25 years of International Holocaust Remembrance Day: Never Forget  Vatican NewsUN chief honors Holocaust victims at General Assembly remembrance  timesofisrael.com",
    "published date": "Tue, 27 Jan 2026 17:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQdzdraUtuaVduMll4ZUZmWGFDTkJGblNJaUlMWVZyNGdTcmU4eFc2TzFZa2RuMG1qSDJON2FmUW9YUFlNeWJtUk4wNjdDTm9wN19URHhEcFdRa1lTOHQtcXV4YzJTOXNhX3Bwd3YzV0lQS1BSTXE4bVdkOW5ScXNGMnRicVZFaWtabE9FSm9SWGkxRmY2alF4R0JZVlVXVlNsbERMVzVpdFphUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "In China, AI is no longer optional for some kids. It’s part of the curriculum - NPR",
    "description": "In China, AI is no longer optional for some kids. It’s part of the curriculum  NPR",
    "published date": "Tue, 27 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1yVE1KR2Jxa2gyX09MTzVjZ3RaYm5xVnpSVFcya25XVm1LaGg0cVVXWjE0YnR5OGtPUHA3Tml4c2xVaUdyb3Y2dW5iR0p0blBTZ2NBOXN5REwzNW5WRFhLMGxtNGRtRHFCamNJaVJtazc4RjZ3d1otMXZrU0o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "As Trump shuffles global order, U.K. prime minister heads to Beijing - The Washington Post",
    "description": "As Trump shuffles global order, U.K. prime minister heads to Beijing  The Washington PostUK Seeks Trade With China Without Triggering Trump’s Fury  The New York TimesHelen Chandler-Wilde: Has Starmer Found a UK-China Solution?  Bloomberg.comInside Keir Starmer’s massive China reset  politico.euFor Britain, China remains a ‘threat’ – but one worth doing business with  CNN",
    "published date": "Tue, 27 Jan 2026 17:59:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQYVdRdkQzSXFRYU1LMGpGcDVaRnlnRE5OeXZHOUlJRUxDRmt5dVdWemdKeXNGdzlYLTMyQjZIMV9RSjhNQWhNcUxlSVA1aDBrc1VnYVhOUXlmOTg0NlJkSGk0ZmMzRWlZcmpXZHpnYmUyU3VhUlNyR01HUDlid3VPaTBlTDJKbmxXalNITGZfa1dEQkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Boeing Earnings Trounce Expectations. The Stock Finally Turns Higher. - Barron's",
    "description": "Boeing Earnings Trounce Expectations. The Stock Finally Turns Higher.  Barron'sBoeing just turned a rare profit. Its problems may be coming to an end  CNNBoeing’s Stepped-Up Plane Deliveries Lift Sales  The Wall Street JournalBoeing Cash, Sales Rise After Most Jet Deliveries Since 2018  Bloomberg.comBoeing's quarterly sales jump 57% as CEO says there's 'a lot to be optimistic about'  CNBC",
    "published date": "Tue, 27 Jan 2026 17:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE0tNnJhMHlsOG1NSFk0U0U3WFMzbW56Mk16RjVWaTJ2X3V4dVFhTDQydlM2d01RNGFuSFJLQXhiYjRXOUwzS0VxXzQ2ckNRd25fVGt0VHpzdVB0eWhIMENjZ2o1NEJkT0dDZWhVRmNRWE9EUFVvZFptOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.barrons.com",
      "title": "Barron's"
    }
  },
  {
    "title": "TikTok settles just before social media addiction trial to begin - BBC",
    "description": "TikTok settles just before social media addiction trial to begin  BBCTikTok agrees to settle as social media addiction trial involving Meta, YouTube moves forward  CNBCSocial media's mental health reckoning  AxiosSocial Media Giants Face Landmark Legal Tests on Child Safety  The New York TimesParents say teens are addicted to social media. Now, a jury will decide.  The Washington Post",
    "published date": "Tue, 27 Jan 2026 17:31:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Fek9uRnNPUmI2OGtPOGU3b3QtWVRYTUFaRVBmc2IyNHMxUkZUQTNuUVE3LWFiNlduSHc0aXQyZzBUVXdtRXZTN3JYMGFweEJEV0dDSWk1TEJUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "TikTok Star Khaby Lame Sells His Core Company In Deal Worth $975 Million - Forbes",
    "description": "TikTok Star Khaby Lame Sells His Core Company In Deal Worth $975 Million  ForbesTikTok Star Khaby Lame Signs $975 Million Deal to Monetize Global Fan Base  Bloomberg.comWorld’s biggest TikToker from Senegal sells company in $900m deal  Business Insider AfricaTikTok Creator Khaby Lame Makes $975 Million Deal For His Brand  hollywoodreporter.comTikTok star Khaby Lame sells company for $900m, pulling off one of the biggest creator monetisation deals yet  Images Dawn",
    "published date": "Tue, 27 Jan 2026 14:16:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPbGVCRFc0ZWVSaEZZd1gzaEE2Z3c5ZEl4SGp1OVFaNUFkTll2SUZPaUJEdU14dFJnMmpoX21YYjVPUkQxTUhQT040YVVINjVRUVBfUzhuNDFJZklNbHA0S2VraHRJYWJ3U0JxRVFNZ2xwR0EyQVpHNnFSRFFtWmk4YUFwcnVkU2tSVmZtRVk1eWpVWGQ1SWE2Ym45aXVwWnBZZlZnRHhaWjN2UnRGUEF6S09vSlpBQkJqTUM4VkE3eDViN1pOam9V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Prediction Markets Are Betting On A Grim Future - Defector",
    "description": "Prediction Markets Are Betting On A Grim Future  DefectorBetting on Prediction Markets Is Their Job. They Make Millions.  The New York TimesHow hedge funds are tapping prediction markets and their data for an edge  Business InsiderThe uses and abuses of prediction markets  Financial TimesGen Z Is Betting Big on Prediction Markets—Literally  Yahoo Finance",
    "published date": "Tue, 27 Jan 2026 16:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBuX1ZHaXVDX29BNjdaWUlZQmI3VEtlMGdLVWtJX1J5amU0OG15Sm0wQ0hrdzNXeEM2Q1E2NFlIcGFvTlotWUd5d1BJM2xuYUNZcTBVNFE4cmJPMkVSX2l6S1JrQmgyTzBWZ0d0Vzk0aTdkRjlxUDF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://defector.com",
      "title": "Defector"
    }
  },
  {
    "title": "Apple patches ancient iOS versions to keep iMessage, FaceTime, other services working - Ars Technica",
    "description": "Apple patches ancient iOS versions to keep iMessage, FaceTime, other services working  Ars TechnicaiPhone 5s Gets New Software Update 13 Years After Launch  MacRumorsApple Just Released Urgent Updates For 2 Billion iPhones  ForbesApple’s Update Galore: iPhone 5s Gets An Update 13 Years After Launch, iOS 26.2.1 And watchOS 26.2.1 Bring Compatibility With The New AirTag, Third Developer Beta For iOS 26.3 And More Go Live  WccftechApple updates iOS 12 to extend iMessage and FaceTime support on older devices  9to5Mac",
    "published date": "Tue, 27 Jan 2026 15:49:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxObEZLRUNsazBHMnFpbWZqUUNiQzdzcDRjbTUxY3RQSEVCZGQxOXVOdExJSXYwZFVPa1ZuT05hMTRTaUpwRVdFeFBxODJVQUd0a3FVQVZsLWlCQ3ZzcUpoc2ZBQUE3VjZkSUdRT1ViRDlPaGVwaHVoN2hMOWJ2b2x3VWJwTVJUSkxrRkhlQVFpWXFkWEgtVE4td0lzeFNHcm5fbHMzTXozbV9FcW1tWTJadUtYSGdrM2VxWEJOMUpYYUhEdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "iOS 26.3 will add three new ways to customize your iPhone - 9to5Mac",
    "description": "iOS 26.3 will add three new ways to customize your iPhone  9to5MacApple Seeds Third Betas of iOS 26.3 and iPadOS 26.3 to Developers  MacRumorsApple C-series modem enables new privacy-focused limit precise location feature  AppleInsiderApple’s Next Upgrade Makes iPhone More Like Google’s Pixel  ForbesWhat’s up with… Apple, Aglocell, RAN sector  telecomtv.com",
    "published date": "Tue, 27 Jan 2026 15:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNR1pjMVlxX1M0UFBiQnllS3BoUVppRTBoQ1VldWUtVlhnRm9VN01la0RMVXc0NHZzczA1LTBiME1vQTRobzYzeU5mWDNLWTBreHVJd0RLT3ZHb1VHQ1BTY3JmaTBIVVZFWUZIRWNJaVpnb2wySy1oWEJmRlA2bHFPYzZBLVpoYk80Qmc0R3FHSHctOU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "Galaxy Book 6 Pro and Book 6 Ultra have been launched - SamMobile",
    "description": "Galaxy Book 6 Pro and Book 6 Ultra have been launched  SamMobileI've used a lot of Samsung laptops. This one stands out  PCWorldGalaxy Book 6 lineup set for a South Korean release  PhoneArena[Video] Galaxy Book6 Ultra Delivers Powerful Performance in a Slim Design  Samsung Mobile PressChipflation Drives PC Price Surge, Ramtech Trend Emerges  조선일보",
    "published date": "Mon, 26 Jan 2026 04:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOWkJiSG1Pc2cwSW9oRTk5SlZhc3pQZktRelU0NTU5YWhQRm52TC15UGdmZkpBTHpGcE1oMGtjcXd5SE03N0U2QnMzVGhlUS11TkZSQTJwckZldkhsOFJYMDJtVUE2Q1FyVjVXUFNHM1R2QlRaelBPckllU1NyRHhwdDV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sammobile.com",
      "title": "SamMobile"
    }
  },
  {
    "title": "Contrasting Apple standing up to FBI with Microsoft BitLocker keys isn’t fair - 9to5Mac",
    "description": "Contrasting Apple standing up to FBI with Microsoft BitLocker keys isn’t fair  9to5MacMicrosoft Gave FBI Keys To Unlock Encrypted Data, Exposing Major Privacy Flaw  ForbesHow to encrypt your PC’s disk without giving the keys to Microsoft  Ars TechnicaMicrosoft handed the government encryption keys for customer data  The VergeMicrosoft Provided Private BitLocker Recovery Keys to the FBI  TechPowerUp",
    "published date": "Mon, 26 Jan 2026 12:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOZ3dyV0owZzVRRk1GQkVidVpZUktHdmQ0SWJULUpRTl9KWmJXVldMOGliNzFFcHptQnJJdmNraG50UXZaTnEyd1RsWGlGR3BFclF3MzRkQXVQc2hSM09URGl2aXRYZmhtVFNlUVQwTHg1dlVMQjhKa1RYdm1VTXh5cU5mSTZEamhzSWF6bTU2bDZXSHl1X090YUI5clVwZ21kdDVHQzFXWmxSTWRS?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "BAFTA Nominations: ‘One Battle After Another’ and ‘Sinners’ Face Off - The New York Times",
    "description": "BAFTA Nominations: ‘One Battle After Another’ and ‘Sinners’ Face Off  The New York Times'One Battle After Another,' 'Sinners' among top British film awards nominees  Yahoo'One Battle After Another,' 'Sinners' among top BAFTA 2026 nominees  ABC NewsWhy KPop Demon Hunters missed out on Bafta nominations  BBCBafta has caught the zeitgeist with One Battle After Another, but let’s hear it for The Ballad of Wallis Island  The Guardian",
    "published date": "Tue, 27 Jan 2026 13:21:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOZENyLVNaTDRUNTJ2VVpiREdrX3lKQTJITl8xYkllcDVYc1MyRlJ2cEVRYzFVOFF4MkkxSEkxeTJkMmdmWG0tYVhWMXg0SnpnMzFJdmZqdWRJTFFWcTNtY01NcXEtTEJrQ1VVWDVQLVhMWE8xQlFJQWo3enBOS2psSV9IUVVpeFpKeGdneXZlQm94TWdXV0tBcjEtNXFoQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Philip Glass pulls world premiere from Kennedy Center - The Washington Post",
    "description": "Philip Glass pulls world premiere from Kennedy Center  The Washington PostPhilip Glass Withdraws From Kennedy Center, as Its Symphony Vows to Play On  The New York TimesPhilip Glass pulls new symphony from Kennedy Center  PoliticoComposer Philip Glass withdraws 'Lincoln' symphony from the Kennedy Center  NBC NewsPhilip Glass withdraws his ‘Lincoln’ symphony from the Kennedy Center, citing conflicting values  CNN",
    "published date": "Tue, 27 Jan 2026 17:31:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPT1RGZ2F6VFJQcDdueVEwWmV5NjNPb1VVa1d3X0EycFR2dXhJVjh2SDQ4c2R1UjFaZHlsWWdHTUNaS1BDTnlzOEw1OWV3M3VUV2ktaXVTSzBtWTFSMkZZaTBzWmlOb1FpRDdCVmxKRW1POGtSMFBlN3VDYlRBVkFpZFV6V2ItS2FNUFBaaXFKOGVkUjNmbXJORE9rTVU0UWJONTlsMnJkcm9zUEk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "“America’s Next Top Model” Winner Adrianne Curry Pushes Back on 'Woke Lens' Reexamination of Reality Series: 'Absurd' - Yahoo News UK",
    "description": "“America’s Next Top Model” Winner Adrianne Curry Pushes Back on 'Woke Lens' Reexamination of Reality Series: 'Absurd'  Yahoo News UKThe America’s Next Top Model Documentary You’ve Been Waiting for Is Coming  Netflix'America's Next Top Model' Winner Dani Evans Cries, 'It's So F--ked Up' in New Netflix Docuseries  People.comTyra Banks says 'I knew I went too far' in trailer for 'America's Next Top Model' docuseries  ABC News‘America’s Next Top Model’ Winner Adrianne Curry Criticizes Netflix’s “Woke” Documentary  hollywoodreporter.com",
    "published date": "Tue, 27 Jan 2026 14:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5uREpvS09iN2FVRlU1bjdSWHFORkFxakFHRFl2bWtkVC1za1FndnNxS2xlNGdXenBscUtPV25ZVkFfaWNsMVhacFZkVGRvUkdvRWpTQi1fSU1xUVZ2VndHa2d3QVN2UTZnRERSclotRFgxWnNkMVVjV3ZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://uk.news.yahoo.com",
      "title": "Yahoo News UK"
    }
  },
  {
    "title": "‘Maybe We Don’t Belong Together’: Harry Styles Fans Call-Out ‘Insane’ Ticket Prices - TicketNews",
    "description": "‘Maybe We Don’t Belong Together’: Harry Styles Fans Call-Out ‘Insane’ Ticket Prices  TicketNewsHarry Styles Fans in Uproar Over “Gross” Tour Ticket Costs: “A Shock to the System”  hollywoodreporter.comHarry Styles is playing six huge shows at London’s Wembley Stadium this summer – and tickets go on sale this week  Time Out WorldwideHarry Styles 2026 tour presale: How to get tickets to the ‘Together, Together’ global residency  YahooHarry Styles Reveals the Unofficial Dress Code Fans Should Follow for His Upcoming Residency Tour  People.com",
    "published date": "Tue, 27 Jan 2026 14:03:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOQ1BGX3g5bGpCUTd4d3lIMF9nTmNkaHYxeVI1MExpUEsyaE9YOWx6MW1ZUXdwdExodGlNbjloemw0QldHbFk1Y1d5cTZjMlk3dTF2aFBfdmtqS01VMXpXVThSclVBWEswVjRValI5aEpoVWFjN0o3dEQyNWVka2lmYU8tYU5ZT1ZBc1kwalV2SXJORnBndl81NjRmOW5RcTI0TFMxbEZJSTlTTTZFZmVlc1BmMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ticketnews.com",
      "title": "TicketNews"
    }
  },
  {
    "title": "NBA mock draft 2026: Lottery simulation delivers young star to big winner - SB Nation",
    "description": "NBA mock draft 2026: Lottery simulation delivers young star to big winner  SB NationThe Bounce: Cameron Boozer vs. AJ Dybantsa for the No. 1 pick in the NBA Draft?  The New York TimesDraymond Green breaks down why the 2026 NBA Draft class might be the best in league history: \"It's going to be hard to get it wrong\"  Yahoo SportsJanuary 2026 Scouting Roundtable  No Ceilings | SubstackThe Race for No. 1 — Part III  NBA Big Board | Rafael Barlowe",
    "published date": "Tue, 27 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPR0stVlZIMlpCc3BuU2NOelBISkJ5NDZjZ2JFMU1CaHUyendGU00wUlluaFhSVXhxZC1nOF9RUkJvbHdKYmdvbmFiVFU0bmR2ODRsRnFwTHhPemVhR1ZUQTlJdFhHVWlBbnRyS0UyS28yazlfYWRHcmNzTzJoWTg5dFZsVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sbnation.com",
      "title": "SB Nation"
    }
  },
  {
    "title": "Coco Gauff has ‘private’ meltdown at Australian Open — and isn’t happy there is video of it - New York Post",
    "description": "Coco Gauff has ‘private’ meltdown at Australian Open — and isn’t happy there is video of it  New York PostCoco Gauff falls to Elina Svitolina in Australian Open quarters  ESPNCoco Gauff smashes racket in frustration after 59-minute collapse in Australian Open quarterfinal  CNNCoco Gauff unsuccessful in privately breaking racquet as AO cameras document frustration  Tennis.comSabalenka, Svitolina to meet in semis after Gauff's racket-shattering exit, Alcaraz sails through  AP News",
    "published date": "Tue, 27 Jan 2026 13:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOQWIzMGpLMFlkZVJwOV9JZHJKVklMNzBnbkxOOXd4bDJWTHB6NE80VmkybnZ1aHdIbkR1ZFJoT0RhckFCXzQ5SEg5RmE2WkFaQ0dkOFdDOEFxbDNBblNHZW9xY2x2a0ZieUdDZXFyQnlndm43LWRVV1BzZjVSRVdpdDJpa0ZaMm1wdnVKS0hPa19VT3BTMGtweEJEOXNIQ3VuTW92MzFSMWo5WnJzRms2c2dBX2tQZWxyNGExcHN3RTVDZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Sri Lanka vs England: Joe Root and Harry Brook centuries take tourists to ODI series win - BBC",
    "description": "Sri Lanka vs England: Joe Root and Harry Brook centuries take tourists to ODI series win  BBCBrook praises Root's influence as England seal rare overseas ODI series  ESPNSri Lanka vs England LIVE: Third ODI, Colombo - cricket score & updates  BBCAsalanka questions Brook's 'worst pitch' assessment after second ODI  ESPNcricinfoEngland beat Sri Lanka by 53 runs to win third men’s ODI and series – as it happened  The Guardian",
    "published date": "Tue, 27 Jan 2026 16:31:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9NTzQyU28yTVg3ZHRUQ1FUU3E2UXhiY3VCVjk3UTlNN3ZoWGhGbnJsMXNNU2VERmZtTFFXNm9vUVd3WUJJeVp1SW54YUhCMWYxTUFINEhScHVaamhsSlFvTUlxV0ZWUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "A LeBron James-Cleveland Cavaliers Trade that Actually Makes Sense - Bleacher Report",
    "description": "A LeBron James-Cleveland Cavaliers Trade that Actually Makes Sense  Bleacher ReportLakers Trade LeBron For $238M Big Man, Longtime Target In New Idea  Heavy SportsCan Lakers-Knicks-Bucks Blockbuster Trade Solve Everything?  Last Word On SportsOne trade idea could end up helping both the Milwaukee Bucks and New York Knicks  sportingnews.comLos Angeles Lakers Trading LeBron James To The New York Knicks In Blockbuster Idea  TWSN Sports",
    "published date": "Tue, 27 Jan 2026 12:13:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOanNRRHo2b2lQTllTUnVoM0FjRFhJZ3FHS1gtRVIybUxPTjFqM0dLSXk0RjY1MnNKdnpSWHFJUk9sMlFPR3NFWUtaUFNPdHNtWnlhbHZUYXhkZXNibl9HYUFUc2dmWGFyc0l3ZEtIQ1Rqc214NDNGdjktTDAwVXV0dkZKODhPVlJWZ29RSkFFRHN0UDhlNGRubXA2ZUF4eFdNZmNvVmVnRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "Live coverage: SpaceX to launch GPS 3 satellite following switch from ULA Vulcan rocket - Spaceflight Now",
    "description": "Live coverage: SpaceX to launch GPS 3 satellite following switch from ULA Vulcan rocket  Spaceflight NowSpaceX set to launch cutting-edge GPS satellite Tuesday from Florida  YahooWatch SpaceX launch advanced GPS satellite for US Space Force on Jan. 27 after delay  SpaceLaunch Roundup: GPS, Starlink, Electron launches scheduled for last week of January  NASASpaceFlight.com -Scrub! Poor weather postpones Monday night SpaceX launch from Cape Canaveral  floridatoday.com",
    "published date": "Mon, 26 Jan 2026 16:42:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPTE9wOU9kMlJzZ2IxcFhrRUFNOWoxc0ZCTDRJLVhwWmFhdmZkUW9zOElDQ0VZX00yN2ZFZTBLN2F6c1AxTzU4a0R2bndJRDEyaExJSkVmZG9Pb2xyVlRQaThYNUtTM210TDJtdWVVSE9hOEVCR0ZuY01OY2txcWRLTDNYMXhQWk1JYm15YWVWZXFUQm1peEZ5dkxMNkhhVTJOc3NqS1pvUU5LV29KbjNNYXcxSHp6MmdnaU4tanR0RW42d0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://spaceflightnow.com",
      "title": "Spaceflight Now"
    }
  },
  {
    "title": "A New Way to Flirt: Dazzle Potential Mates With Patterns Invisible to Humans - The New York Times",
    "description": "A New Way to Flirt: Dazzle Potential Mates With Patterns Invisible to Humans  The New York Times",
    "published date": "Mon, 26 Jan 2026 20:00:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYWFPV2xmQUdlOEgzTFd4bVpkR1NNLWxQRUV4UWpTQWNpaGhva3Z1OVE5TEVJVDZzNXU0amJpNnYtY25YTXpSZFJMNzVyMGlpdHF6eG9ScjVfQU1kTGJQZE41dmFYRThOS2ZxeUxDR0pGV0NmYkh4ZVVCejV5M0VOdklKaTNKVkVnT0lmVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Scientists Finally Figured Out How Much Groundwater There Is Under the US and It Is Enough to Fill the Great Lakes 13 Times Over - ZME Science",
    "description": "Scientists Finally Figured Out How Much Groundwater There Is Under the US and It Is Enough to Fill the Great Lakes 13 Times Over  ZME Science",
    "published date": "Mon, 26 Jan 2026 19:19:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9Ia0UxdE45QVZnVU5hcGljWk5FZTR6QWRCandpd1FQYllrdFVtS3Q4YWlmdTYzYnZwR1VkeUxPNWFOa2E2MGxvSTBuN0MwTXUwUFBWcFREZ1laUzlKc2FGbFgxOW1BWlRDRVNKWmxvOGtLUVBoQnRUTHVUTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.zmescience.com",
      "title": "ZME Science"
    }
  },
  {
    "title": "AI makes quantum field theories computable - Phys.org",
    "description": "AI makes quantum field theories computable  Phys.org",
    "published date": "Mon, 26 Jan 2026 18:11:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1iYnFrM2E2ZmF4SUdyRzdBRUw1V2lwRmloR25BeHdQaTl3YkVtZ1lIemdya1U1N2w0MnFXUUR3eDFQUnNPWk5hYWZVNHRvbTFZRlF0bE1FdC1JNkQ0cDdZTk82aUlqbGhnWVozMw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Trump policies at odds with emerging understanding of COVID's long-term harm - CBS News",
    "description": "Trump policies at odds with emerging understanding of COVID's long-term harm  CBS News",
    "published date": "Tue, 27 Jan 2026 10:00:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9oTHdCME5YWDY0dWZ4eGpFbEZfejZKdUZIRXJoeGtJRzNDRTVhTGhNbWlaTWRHLU9xeUU3RW9PdXV6ZEFBWWZXcTJHY0ZnN2VUblM2NHV4TWFTbFJBT2lvSjZaUU1NNjV2ZlBWZ2Q3eDJkbHhE0gF6QVVfeXFMT29QMG5Lc190N0xXZk9vU3NBSThGdnpBbFZCVTgwcXFRYlNnU3BuY1FRUnoyWktOeGY3dV9VY004TjlmRjR3YTYtVE01cUNqWXl4NzhqMEZMQTVNOWVudVZ4M2NBMUFIVm9LZ2RrdjFnMkZjU0JINU82VVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Menopause linked to Alzheimer's-like brain changes - BBC",
    "description": "Menopause linked to Alzheimer's-like brain changes  BBCEmotional and cognitive effects of menopause and hormone replacement therapy | Psychological Medicine  Cambridge University Press & AssessmentGrey matter loss during menopause may raise dementia risk  The TimesBrain Scans Reveal Hidden Changes After Menopause  SciTechDailyMenopause linked to loss of grey matter in the brain, poorer mental health and sleep disturbance  cam.ac.uk",
    "published date": "Tue, 27 Jan 2026 00:04:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE14eERsaTEwUkVxcFh0Ni1VNU5JbHUzQ0dxQXpQNVhvMnJfSW8zTTZGMmhIbU1NbkVHbXhiVVlRQk5GTmFoTXNidkNDSllrb3JQZUVMXzJaT0Q1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Exclusive: In major test for longevity field, FDA greenlights study on a 'near total reset' of cells - Endpoints News",
    "description": "Exclusive: In major test for longevity field, FDA greenlights study on a 'near total reset' of cells  Endpoints NewsScientists May Have Found a Blueprint to Revive Old Cells  ScienceAlertThe first human test of a rejuvenation method will begin “shortly”  MIT Technology ReviewCan aging be treated at the cellular level?  Penn TodayIT PAYS TO KNOW: Can We Slow the Aging Process?  rafu.com",
    "published date": "Tue, 27 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNa3ZOa1VvMWwzc2hPZHV0VkZBRnM5aFowZ2JHSW9USUFQV1BPX0tvVHlxZGw3U2FheC1fMnZKdTFLX2EyUnBGTHZzV1pWSGx6R1Eyd1g4eEFPVnI3S0dmZmdkbHdWRkRNTzhPVXNjbFZTMEV0MTJTOWdNUEVvaGJRNk9JeDNhSlNJaEY5OTR2bVBjNVd0bmFkRzBibw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://endpoints.news",
      "title": "Endpoints News"
    }
  },
  {
    "title": "Marburg virus disease - Ethiopia - World Health Organization (WHO)",
    "description": "Marburg virus disease - Ethiopia  World Health Organization (WHO)Ethiopia declares Marburg outbreak over after 42 days with no new cases  BNO NewsScenario assessment: Marburg Virus Outbreak in Ethiopia  Centers for Disease Control and Prevention | CDC (.gov)Ethiopia declares the end of its first Marburg virus outbreak  king5.comEthiopia declares end of Marburg virus disease outbreak  Big News Network.com",
    "published date": "Mon, 26 Jan 2026 20:46:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1Bd01NTGhuVUc0R2RfbVNnRVlfVDdYcUc2d3NaYVd6cGwwYklDR0p4eUFYOW80MW9SQ2VxaEVXN2F2V2FWZ3o5a1d1cElWaHlLbkQzUzREazhlSjVpcDJWZk40dm9LQkFmNHZTckEtenYtOVdVanpraTBB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.who.int",
      "title": "World Health Organization (WHO)"
    }
  }
]