[
  {
    "title": "Russia killed opposition leader Alexei Navalny using toxin from dart frog, UK says - BBC",
    "description": "Russia killed opposition leader Alexei Navalny using toxin from dart frog, UK says  BBCNavalny Was Poisoned With Frog Toxin, European Governments Say  The New York TimesRussian opposition leader Alexei Navalny was poisoned by deadly 'dart frog' toxin, Europeans say  NBC NewsTrump remains ‘very serious’ about taking over Greenland, Danish PM warns – Europe live  The GuardianRussia killed Alexei Navalny with dart frog poison, UK and allies say  Sky News",
    "published date": "Sat, 14 Feb 2026 15:58:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBGR0pJNGtIaHRHY3dUMXdnT3RyZHRjcTlGNGtKN053Mm1hWVJFMllGcnZGVExOTVBCUHN1WWgtMHlwT25ZVGt0MGxjd1JpTkJNRVpFZklJV0xZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Inside the Debacle That Led to the Closure of El Paso’s Airspace - The New York Times",
    "description": "Inside the Debacle That Led to the Closure of El Paso’s Airspace  The New York TimesLaser weapon that shut down El Paso's skies was LOCUST system  AxiosTrump on El Paso flight restriction: 'People learn' after cartel drone scare  El Paso TimesConfusion over laser system led to El Paso airspace closure, officials say  The Washington PostWhy is the U.S. government exploring using high-energy lasers near the southern border?  CBS News",
    "published date": "Sat, 14 Feb 2026 10:02:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOUlhkS3ZHTFJnZU9NRDZPeE5RTXp3TGlMY1M0NlFLUTFPX3Q2LTQ0aGV6YVlTMlM1R0F2bEthTWVBOGNIWGdQVldvd0wxOXFUN3VabnZ1ZmRJb0duQ3Q5aVgtUF9pLW9sSTJ2UUxhMnZwczVyOHhjTjM3TjRJUjEzdV9rNlVlUHZoWUlTRF9BaHkxNVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Courts have ruled 4,400 times that ICE jailed people illegally. It hasn’t stopped. - Reuters",
    "description": "Courts have ruled 4,400 times that ICE jailed people illegally. It hasn’t stopped.  ReutersOpinion | A Very Dangerous Ruling in New Orleans  The New York TimesAppeals court greenlights Trump admin policy of detaining undocumented immigrants without opportunity to seek release  CNNEven Trump’s own appointees are ruling against ICE’s mass detention strategy  PoliticoCourt ruling means Minnesota immigrants sent to Texas may have little chance of returning  Star Tribune",
    "published date": "Sat, 14 Feb 2026 10:07:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPMlZ1NC1EeGtJVUFUSnJGYmlHM3ZrTFJCR2NrNmpQTEhIUXRkSTVXdDNVV0hEN29ybkFzQUJxLUUzTlJvRGhWd0laRVdfSjRmU3h4SnVUbDQyZ1E3Uy1qd3dKX0ctVmdJRV90a0R4WmJQbGh4NXlDYWR0bkJLUElBVFFuTGpURnBocmdaYl83LTZrT2stRFhscllmSThLSldiQVM3V0VCeVBHQ0lMV1dRc0tseVB2T3JpZnBBWjZJT0hQb19WZF93Zmlkdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Researcher skeptical of ‘Havana syndrome’ tested secret weapon on himself - The Washington Post",
    "description": "Researcher skeptical of ‘Havana syndrome’ tested secret weapon on himself  The Washington PostCIA, Pentagon reviewed secret 'Havana syndrome' device in Norway, Washington Post reports  ReutersCIA and the Pentagon conducted tests of a secret device causing the “Havana syndrome” in Norway  БуквиHavana Syndrome, CIA and Pentagon launch investigations after mysterious test in Norway  TelegrafiCIA and Pentagon's Secret Investigation into Havana Syndrome  Global Banking & Finance Review®",
    "published date": "Sat, 14 Feb 2026 15:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNa2JVQnFpblRYZlV5N2dGT2Zja0NaNFJvcUxnZkpUQjRkQlRDTU1sSko5ZGZqNjZ0Q3VvRTVTTVdfWktIaklMNGppYk5qcXJOZUtNUG90aXpvWG1JbWhBWFUxQUVkRXVkN3JyWVF5Q1hNR2FST19feHNtX2RuWnNRV29ZelFpbE9JdFFhbHhQMnRwQWRhdDVpaE5odi1GTTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest. - The Washington Post",
    "description": "Trump officials condemned Don Lemon. He’s bigger than ever after arrest.  The Washington PostDon Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon pleads not guilty to federal charges stemming from church protest  CNNDon Lemon Hires Federal Prosecutor Who Quit Over Immigration Crackdown  The New York TimesDon Lemon, Nekima Levy Armstrong plead not guilty in church protest  Star Tribune",
    "published date": "Sat, 14 Feb 2026 16:02:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTGlxaTVmZGNfZ1lOUlZqRUdNVWZhUnQyZkV1dWpOMFM0V2tsSTZOcUdjMmItUTd4MDBRMWZxZ0x2TFJRUlJMZGx1UVRPeTRhbXVPa1VPUWJZYUNWRUVFS2k2NXhJY1RRZXVZbG9waElyZlZkODZGa0FpUEhiakItLXFna1o4ZnZFQ0I0MGhwZGhiQlJjeXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times - The New York Times",
    "description": "Gisèle Pelicot, the Woman at the Center of Rape Trial That Shook France, Shares Her Story - The New York Times  The New York TimesGisèle Pelicot’s first televised interview: 5 takeaways from the woman who launched a rallying cry against sex abuse  CNNGisèle Pelicot plans to meet ex-husband in prison for answers on other allegations  The GuardianGisèle Pelicot felt overwhelmed and honoured by letter from Queen Camilla  BBCGisèle Pelicot recounts her ex-husband's \"unthinkable\" crimes in first U.S. TV interview since mass rape trial  CBS News",
    "published date": "Fri, 13 Feb 2026 17:41:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYlJBV1dLeE9waDBORk5TNzJkM0RRRl9IdVJ2WXpUNjR0RUY1QXdMRUZDQlQxdHpIbklxbjJQLTF5SnVJaVk4Y2VsbzJmVi1UNWdjM1RaUEpVWXQtRnVPcjNfTE9xdURLQjJ5Zk1FSXhZZzUzWW1CN2RTQlRDM0piNi1adjRFWXZqem5NRWFZYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "ICE Tried to Justify a Minneapolis Shooting. Its Story Unraveled. - The New York Times",
    "description": "ICE Tried to Justify a Minneapolis Shooting. Its Story Unraveled.  The New York TimesICE officers face criminal probe for alleged 'untruthful statements' under oath about Minneapolis shooting  Fox News2 federal agents placed on leave after appearing to make 'untruthful' statements about violent encounter in Minneapolis  NBC NewsDHS says immigration agents appear to have lied about shooting in Minnesota  NPRICE says federal agents appear to have lied about confrontation that led to shooting  Politico",
    "published date": "Sat, 14 Feb 2026 10:02:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNMWRuVUJsT04waGxpOGxuLVVCcDdRSGtOdWFkWUZSTVZaSUtnRzNoY0F0TXhkM040R2M2SjR4akVyUDNpQ3JGM1Rpa1pyWGVabVhDcDF2V3I0VmZ5ZDB5akhvVm1hNmdaNkRUdm1LaEFFSlh6VHczd2tTSTJ6S3dxbEE4dnROQ3ZpWElVVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Tahoe snowstorm could make travel ‘impossible,’ officials warn - San Francisco Chronicle",
    "description": "Tahoe snowstorm could make travel ‘impossible,’ officials warn  San Francisco Chronicle\"Major travel impacts\" expected as winter storm watch is issued for northern California  WRAL50+ Inches of Snow Forecasted for California Through Presidents Day Weekend  POWDER MagazineCaltrans urges drivers to cancel travel as major winter storm threatens I-5 closures  KRCRHeavy snow headed to Lake Tahoe as the region sees coldest temps of the season  South Tahoe Now",
    "published date": "Sat, 14 Feb 2026 09:31:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPaDluel9kRDBhbm1Ca1dIX19tSVA2aXNBYW1wWlJzLXlPTHpod2YyQTF3LWJmcFVxUnRrZzZmNUdEYnZCYVFPOFJUb2FIaW40MmVna2dsU21LTGJKVzl3bFI0M0tVZEpuYzFDUGItdGt6UHdYRlVSdnFkem1wTGkyUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sfchronicle.com",
      "title": "San Francisco Chronicle"
    }
  },
  {
    "title": "Under oath and unredacted: The top political stories on Epstein this week - NPR",
    "description": "Under oath and unredacted: The top political stories on Epstein this week  NPRThe Epstein Files and the Hidden World of an Unaccountable Elite - The New York Times  The New York TimesThe Memo: Epstein scandal feeds suspicion of unaccountable elites  The HillSex and snacks, but no seat at the table: the role of women in Epstein’s sordid men’s club  The GuardianThe Epstein files come for Hollywood royalty  CNN",
    "published date": "Sat, 14 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPc2M4aWwyV1d1WmxGSkZCWkY3RmtHWnlmbk9zQlFHRlVzLU05MHBDOC1fZ3dYV25EYk1nUFVNRUVRNkNDYlB5ZjFjMDJBeC0zQXBtYktycDB1V2QwNFYtaFFIdldxdElWNzZYeGVRUVFheVlUZHZHak5kX21qWVpBZQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Don’t forget: All post office locations to close, mail won’t be delivered - MLive.com",
    "description": "Don’t forget: All post office locations to close, mail won’t be delivered  MLive.comIs Presidents Day a federal holiday? See full 2026 schedule  USA TodayWhat’s open and what’s closed in the DC region for Presidents Day 2026  WTOPPresidents Day is Monday. Is the stock market closed?  The Palm Beach PostBanks will shut down for a whole day in February. Here’s why  NJ.com",
    "published date": "Sat, 14 Feb 2026 11:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOb2NXbkNVclJ3WmdZTXZBVWRFTi1DX3NfZUtYZnFZODBJWWVBVG1NQWI0NUl2MWVBRHZWeDE0eXBEdmh3SlVNU0xMaGNxTTFicko3LXAzdmg2NGlDN2lCU0szdFhxamJ2WndYUXpLWDZNWnJZdmtUSVhZajZhVm9fWVE0OXQ1YkNwd1FjTkMza3pnRXoxcTVYUHBrRFZpUmE2cmZ3RGhWdWRRazJ3ZkFob2dSLWhMSUprZ3fSAc4BQVVfeXFMTVdkVUdsLWJIZ2ptTXJtUjBxSHRwbUlCV18zT21BSGMxOWJtWUYzenhGTm4yTG94cGNaSXRjdzJpd1VmNWdMMmF0ZHhTMHZ4czNTMkF3RGxfaFB6clVuRm1RaFFVWlpLaWJHdWxpanY4YXN0dmM0V3FVU1VmYmNNVXpNYjBYRnZpZ2lPVkFZeWpMRHBBOVQzUEF5Tzg4aVlJWVNOUm0zTXNXdkxnQmxZWWxUdmQyUldkUWtLY196NFd0MXRZWFBWa0dTYWRxVmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlive.com",
      "title": "MLive.com"
    }
  },
  {
    "title": "US readying for potential weeks-long military campaign against Iran — sources - The Times of Israel",
    "description": "US readying for potential weeks-long military campaign against Iran — sources  The Times of IsraelExclusive: US military preparing for potentially weeks-long Iran operations  ReutersTrump sends second aircraft carrier to Middle East in effort to increase pressure on Iran  The GuardianU.S. Is Sending Its Largest Warship to the Middle East  The Wall Street JournalTrump says change in power in Iran ‘would be the best thing that could happen’  AP News",
    "published date": "Sat, 14 Feb 2026 03:02:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNWGEtM1JLbmdheS1aYThzTXc5NWZhakFqTlE2SnlSZlVSY3dEb0JCVGtXbjFTQ2ttNWhLOUtCRFBBRWljVXo0SDNNQW5MZFdUMTVyaXBwcHZJSGZlS3psQ3d5Q1pSX01LS05qTU4tbnJ3M0p4MFdvdV9BY0MxeGxCY2dpaVpvMTFaQWFKSEp6SGxid2M0TjVlRGRLeDU3Y1M0RFE5SnRuY0F3d9IBrwFBVV95cUxPUlVseE9leWpEd3pQUm85MGFrSmxoYnFhNlE2Z2VCTi1fRThqdmhFQmFrQUlQWV9ZajF4Vm1DeE9LSHZ6TWJ3OUd3Q1RCTkFqd25fLVRaY0pWS1c1TnRwNllJNlNMRTVkOHEzSDZJRGl2S3lrTVN3MllsekRlcHBISDc4RDlBbnFvTUptbjRqMS1YSnpKa29HR2tpM3VQdTh4RU16RzZzUEpkY29Zd0R3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Iran’s crown prince says survival of Tehran government ‘sends a clear signal to every bully’ - AP News",
    "description": "Iran’s crown prince says survival of Tehran government ‘sends a clear signal to every bully’  AP NewsIran, US spar as diaspora organises rallies abroad calling for action  Al JazeeraSon of Iran's last shah urges US military intervention in Iran  Reuters'Sick of the regime': Thousands march in support of change in Iran  Australian Broadcasting CorporationThousands Rally for Iran Regime Change in Cities Around the World  The New York Times",
    "published date": "Sat, 14 Feb 2026 17:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOcHQ1WmlqaFh6RDdHdnUyNmVoNmpCSGJWMHR1cS1UZEJUWnAxbV9TOGltY2s2eHJta09WTC1LbElkaHNiNDlENXg1OEFvWGJjYXB2Z3pzb2pwUTMxcEdubzJKNy1EYUlNNFNxczRCVE81Unk3QmFpVGl1b3RPeWhxTkxsSGVBSWdwSmdOYVBfbHlhanFJTUdjWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel - CNBC",
    "description": "What's next for Cuba? Trump turns the screws as the island runs out of jet fuel  CNBCLife in Cuba Is Grinding to a Halt Under U.S. Oil Blockade  The Wall Street JournalRussia has started an 'evacuation' of its citizens from Cuba amid the island's jet fuel crisis  Business InsiderAs US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services  CNNU.N. Condemns U.S. Measures Halting Oil Deliveries to Cuba  The New York Times",
    "published date": "Sat, 14 Feb 2026 06:58:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBaRmQtYlFFa1JBUV8ycHlrdk9FODB2blQ0MlljTnFFX3hQMFFrU0dlWkROVW1OUlNaSHpTaU9hZ1lCQ1VYcEZEV2k5ZmlnTzZaa1FCTGxuMEk2eE93aUktS1NVcFh3N1BqUTJmRG04S01Tb05BNU9pbtIBfkFVX3lxTE1WV2JzUXBQcVRzaGdEZ0UzSjZzSkVmNlRHVDRwNEoyNTd2NHNiWTNkRVZoWHN1TFozVzBiSUw2OVkyLW5PNXF0T2kxLURIcDFacmFMU2FYVW5BX0pWVW1SN3UxeW1uZzBST1hPUUMxZGI5Um0wVGgyaWNpRnU0QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Sydney police to be investigated by watchdog after anti-Herzog protest violence - BBC",
    "description": "Sydney police to be investigated by watchdog after anti-Herzog protest violence  BBCAustralia police defend actions after violence at protest over Israeli president visit  BBCClosed-door apologies are not enough for a community confronted by images of worshippers being seized by NSW police | Aftab Malik  The GuardianWhy Isaac Herzog's visit was important for Australia's Jews  The Jerusalem PostIsraeli President’s Visit to Australia Splits the Country  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 05:09:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5OXzFkVTl1S1RlU3h2RXdMTENxMXFlMVhHMS1PRVlOclFLSmV2SHRqcTBfVlJ4RU1lZUs5d3VRZThaVlhkLTdvYzVVZjZweWV4aU5LZWFWTnRCdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Prestige cracks: BMW, Benz, Audi slash prices as China’s luxury market turns local - CarNewsChina.com",
    "description": "Prestige cracks: BMW, Benz, Audi slash prices as China’s luxury market turns local  CarNewsChina.comLuxury and China: Will the next decade be back to the future? - I by IMD  imd.orgLunar New Year gives luxury brands a chance to win back big spenders in China  MSNIt’s not a rebound. It’s the great China luxury market reset.  Forbes IndiaChina’s luxury car slowdown exposes a structural shift -- and a strategic opening for JLR  Moneycontrol",
    "published date": "Fri, 13 Feb 2026 04:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOMnNOOVl3UUQ1T0hOeVpMRFNhV0tVeElwLTh2UWxCQkJPSk9NblVGdDRxZTVzQUpjRzc4R3NyS0JHRThjTkx0WGJwYjhRQjBOcnBkdnJaU3dqUFk4Z21qb3BHNjB0MTBpT3B5Y05wQUtQZW1ONVJKLXJaaEN1OWJQTWhZd1FvczRTeUVBdl9YSi14REtNSVBxZGd3bW9WYU5jNk9KQmZjelRHNVJIMFJpeldudk5pdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://carnewschina.com",
      "title": "CarNewsChina.com"
    }
  },
  {
    "title": "The Goldilocks economy, if you don't look too close - Axios",
    "description": "The Goldilocks economy, if you don't look too close  AxiosThe ‘one-legged stools’ holding up a fragile economy  The Washington PostU.S. economy suddenly seems on track for fabled soft landing: 2% inflation without a recession  MarketWatchSupply Side Strong  Seeking AlphaFinancial expert weighs economy outlook, cautious investors and cryptocurrency's latest  WJLA",
    "published date": "Sat, 14 Feb 2026 15:03:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9HcHZ6a3FlNWlQdUJILUdZeHJ1NEgyWlRZOEJLd2dlcVVidUxjaWc0ekZGUlFaRGJVaHktUWFKWWNfX012WHh6YWgyX01WWHNjRGtPTWVOUmNMVEhMVTNiX09Ob3FSUEVOb3BjNVEwdTE4aHVMdW00?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "40 Epics Sales to Shop This President’s Day Weekend - Gear Patrol",
    "description": "40 Epics Sales to Shop This President’s Day Weekend  Gear PatrolShopping This Weekend? These Are the Best Presidents Day Deals We’ve Seen So Far, Starting at $6  TODAY.comAmazon's Presidents Day Sale Has Kate Spade, Lego, and More for Up to 80% Off — the 100 Best Deals Start at $5  People.comBest Presidents' Day Amazon deals 2026: Apple, Lego, Roborock  MashablePresidents' Day sales 2026 are live: The best deals we're shopping now from Amazon, Best Buy, REI, Apple and more at up to 75% off  Yahoo",
    "published date": "Sat, 14 Feb 2026 00:18:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1HVk5mOHhwRVVYSnFQdVkwcGdJVDM4R1h1SlVaT2tNRGZOaUg0c05BX01waFNzbm55MU9OaXNKSHIwTWtoU2pSNXhTZ2FXamJyWmNtNUdIaVF5WVA0SkdWRWluR3pqZm83Z0s0Vk1nazlaZFBNbmEwS0theEM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gearpatrol.com",
      "title": "Gear Patrol"
    }
  },
  {
    "title": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations - The Guardian",
    "description": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations  The GuardianElon Musk's xAI faces threat of NAACP lawsuit over air pollution from Mississippi data center  CNBCNAACP threatens to sue Musk’s xAI over Mississippi gas turbines powering data center  The HillGroups threaten suit over xAI turbines in Whitehaven  WREG.comPublic hearing set for xAI turbines in Southaven. Here's what to know  The Commercial Appeal",
    "published date": "Sat, 14 Feb 2026 00:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOTUF1NVUzOEFOUVhETUlhZjd2OFFwRkM3ZjFadG9QNzJFYzlLaTZBS0VvQTU1ck03bWM3cm85S1B1Z2hxOThXc2FVUFh6SWtpUFRsb3dTMlgwTHJMMkRrV1B0Uy1ObFBzZVRzV1p5NGlRQmNYcGlZWVNadHd0V1F1MXRnYnlrLWtrdVAyc3dwVjFxR09nT3pEZHhUaVJZOTQxYTk1cHl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "What it’s like to go on a date with an AI in NYC - CNN",
    "description": "What it’s like to go on a date with an AI in NYC  CNNMy Dinner Date With A.I.  The New York TimesThey have AI boyfriends, girlfriends. Here's how they're celebrating Valentine's Day.  USA TodayMocktails, potato balls, and 10 bots: My cringe Valentine's date at the AI companion wine bar.  Business InsiderInside the New York City Date Night for AI Lovers  WIRED",
    "published date": "Sat, 14 Feb 2026 12:46:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNMFBwVnlaV0VBWnhYbElQaXpiNlA4WGp1b1hOWVpDYms2S195YnlERERzUkE0RGFieHpoOTRNbGZxc2lzUmkyMGdkUWVpNXFRenV1dXFLNlh3bXltWkd0TEpfcnpyUERmRzBnNFU2d09PVGthZU5MMUhlUXl1OEhqUThJS0pSa0ZVSnY2MWFHRG00ZW9EVEVCSF9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Apple Presidents' Day sales: Get the Apple Watch Series 11 for $299, plus more deals to shop this weekend - Engadget",
    "description": "Apple Presidents' Day sales: Get the Apple Watch Series 11 for $299, plus more deals to shop this weekend  EngadgetSave $100 on Apple Watch Series 11, plus 28 other Apple Presidents Day deals  CNNIf You Own Apple Everything, These Presidents Day Deals Are A Must-See  HuffPostAmazon's Presidents' Day Apple sale offers price cuts of up to $400 off  AppleInsiderThe Apple Watch Series 11 is more of the same, but that's not a bad thing. Here's why it's our favorite smartwatch.  Business Insider",
    "published date": "Sat, 14 Feb 2026 14:38:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPcDBVS0xFNDd1VnpIOUxrRmxKN0FJdmdINTRiZGJTbVhoaHBXR1prZDhCbnItQ09JY2pYZmpFRUhmYzhjUk1rbWtUdm0zOEZWUzBHV185R1FGenBSSDFhaEJKdWc4cXAwNU02NXhkbjFFU19ieHoxMzk3RGpxbF9Ja0RnYldsZXg3SWtEdm9DOENKcVZTdmdSa2RfSFpxQmxOdlVpN2hRNFJpQnhiSkhYZ05vLWJFaGUxR3Z2VnZXU2xrWEhlZWdQanpBOTFER0RHckFqRmozc3pwQV9YRjQzVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.engadget.com",
      "title": "Engadget"
    }
  },
  {
    "title": "ChatGPT promised to help her find her soulmate. Then it betrayed her - NPR",
    "description": "ChatGPT promised to help her find her soulmate. Then it betrayed her  NPRChurches Confront The Spiritual And Emotional Risks Of Chatbot Attachments  Religion UnpluggedFeeling lonely this Valentine’s? Psychologists urge against confiding in AI  Straight Arrow News - SAN“ChatGPT took over my life”: the shocking confession behind AI addiction  Talk AndroidAI as a Confidant: Between Salvation and the Abyss 🤖💔  vocal.media",
    "published date": "Sat, 14 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFV1TUFOVkYzVnhNVmFhLUQxZzFtdUZTRFhRZ3Q5ZVRmdWZ3Ylp1Z3pFTnFRVkNKMmktQjNZM2JGU3RkMmhLbURHRFB0SERReC1aelhUaHZBT29qLWJLZUd6UzRQUVpiZG52UEhmWHpTa2JlaVlqWGJVV1BCV0tnd2VObDlacjlSak81ZDZsU1AtSWtKblNXTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Their Secret to a Happy Marriage? A Translation App - The New York Times",
    "description": "Their Secret to a Happy Marriage? A Translation App  The New York TimesSecret to a happy marriage: A translator  Oman Observer",
    "published date": "Sat, 14 Feb 2026 10:00:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaTN4TGNiUTBjWl9IRjBsV2hFU3N2Y09IdG00dkZ5RzQ5YmJmNnlqajFJOUFTdmNTTUpmaFdHdGtFTmswSFAzTW81ZDFkNDlXLXVncjhVNUR0NHNNblljMmVtcUhPN2dsRkZTQXBuV1duNWVYekNQMHhJejRzbFNWaFdxenh2S0tWQ0E4OEtvak9fV3N0U3plbGpKbVVVcHdpVnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "'Wuthering Heights' stars Jacob Elordi and Margot Robbie react to its 'gut-wrenching' ending - Entertainment Weekly",
    "description": "'Wuthering Heights' stars Jacob Elordi and Margot Robbie react to its 'gut-wrenching' ending  Entertainment WeeklyJacob Elordi, Heathcliff and the Controversy Over ‘Wuthering Heights’ - The New York Times  The New York Times'Wuthering Heights' ending makes major change from Emily Brontë's book  USA TodayWuthering Heights review – too hot, too greedy adaptation guarantees bad dreams in the night  The Guardian'Wuthering Heights' celebrates mad, passionate excess — but lacks real feeling  NPR",
    "published date": "Fri, 13 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQdzEtZ01FdS1xMWMyc1dpUXY4YzRUaFVDNE5lbkRweVZPeFNoTVJyazEyOUYtbFBoQ3dIQjhZYnpHV2puSkFmbEM2SUEwUTRrUUh6VVowdURGV19adUx4MHg4c0xvTlJna3dLTGdhbm5YYjNYZmVFRVFMMC1FYU9BZWh2TTJKM2xwcHpaVzh2UjdNTEZRV2RzSkRrdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "Wiz Khalifa Painfully Announces That His Father Has Passed Away - HotNewHipHop",
    "description": "Wiz Khalifa Painfully Announces That His Father Has Passed Away  HotNewHipHopWiz Khalifa Announces 'Sudden' Death Of His Father  YahooWiz Khalifa Announces His Father Has Died  ComplexWiz Khalifa's father dead at age 63: Rapper reveals dad Laurence W. Thomaz was 'at peace' during sudden passing  Daily MailQuick Facts About Wiz Khalifa's Father, Laurence Thomaz: Personal Details, Final Moments and Cause of Death  International Business Times UK",
    "published date": "Fri, 13 Feb 2026 22:27:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPYlhjbjJROE1aY3ctWUlKdFh2c2xfZEl0Z2RZR0kzdjZFM1g4RzRBM3hEMFg5V2c4UERTVGwybGZwclotNm5ya2dsYjAxMjBINlY2eVdtN0VJVnlSNUJNY3lVaXRwbm1jM0RLQkRISUZ0c1ZIc0ZVdC1RUGpLa00wdndvQjlwSU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hotnewhiphop.com",
      "title": "HotNewHipHop"
    }
  },
  {
    "title": "Beyoncé Debuts Dramatic Hair Transformation With Her Shortest Cut in Years in Surprise Super Bowl Photos - instyle.com",
    "description": "Beyoncé Debuts Dramatic Hair Transformation With Her Shortest Cut in Years in Surprise Super Bowl Photos  instyle.comBeyoncé Unveils Blonde Bob Transformation, Her Shortest Look in Years  E! NewsBeyoncé Debuts a Stunning New Bob With a Body-Hugging Ensemble  ELLEBeyoncé Brings Back the Bob (and Stirrups) at the 2026 Super Bowl  W MagazineBeyoncé’s Latest Act? A Blonde Bob  essence.com",
    "published date": "Fri, 13 Feb 2026 15:48:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQdFNkT2t1UG9pWXZra2RIN1VrSXp5QzFNLXhhU3Q1ZHBiaExzNEh2VlFzYkRyQ25uSHR2c3dpd3JlaE02cUZ4bDJzUVRsbjZZZWFXRS1KRURCb0YtcUhScUdQTF9YWU5xNk1DNXl4RDd3Rk5weEE4N19yNnplb2pXY0pmVzg4cG54?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.instyle.com",
      "title": "instyle.com"
    }
  },
  {
    "title": "What makes a good book-to-film adaptation? We have thoughts (and favorites) - NPR",
    "description": "What makes a good book-to-film adaptation? We have thoughts (and favorites)  NPR20 Classic Literature Movie Adaptations That Turned Required Reading into Standout Cinema  Rotten TomatoesSoar to Epic Heights: Watch These Movies and Series Inspired by Classic Lit  Netflix5 Perfect Book-to-Movie Adaptations Everyone Slept On (But You Shouldn’t)  Screen RantOpinion: There is no such thing as a faithful book-to-movie adaptation  The Battalion",
    "published date": "Sat, 14 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRm4xdFI5dGNWYWJzZ1FtbE1XNkdtdFFlYXlXQm5JOGQxc0w2RkhBNWIwdHlGRm80NFRWVnpvNEF5bVpjUW1pZWlMQ2pnOGF0amFqczI2OGxyYjN2akhVdlNiYV9ZZF9GVEk2UUJqUVh2QXRjZHpoS2JiR2RQR0RMcjdqbG1JTEJvTDlpTWxPMXotbWxENUJpVzlfRlRsMkdJWVJsMUtabkJYV3JydGNDSXhQckxJcjRpaFdoQkR5b19FN09sNkhpQm5yTzItLWJzdWhV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Biathlete’s infidelity confession that rocked the Winter Olympics – and Norway - The Athletic - The New York Times",
    "description": "Biathlete’s infidelity confession that rocked the Winter Olympics – and Norway - The Athletic  The New York TimesWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'  Yahoo News New ZealandEx-girlfriend of Norwegian Olympian speaks out after public cheating confession  The New York TimesNorwegian biathlete who made cheating admission wins another medal  NBC NewsNorwegian Olympian regrets revealing affair after winning medal: 'Not thinking clearly'  Fox News",
    "published date": "Sat, 14 Feb 2026 07:49:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOdWFndkhnOWE4bklyMzhVVXZKUVBtTGVxSzNjWHRzbjdEMUotUFRrT3FGb0JQdjdnRFl4M3dibS1GSlRtVkpZcmVDOTc1MXN6RmxrdVlxb2N1ZTJVdThVLUlKTVdoODBDX0x1R1pUVDF6UTFtZmg3S2tRdGttaFpOeVQwSWFMQ1pVdHEyR2ZHRU00bDlEOU5OczBmX2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’ - MMA Fighting",
    "description": "A decade later, Charles Oliveira’s injury suffered against Max Holloway remains a mystery: ‘Nobody knows what actually happened’  MMA FightingPic! Charles Oliveira looks incredibly ripped for ‘BMF’ title fight | UFC 326  Yahoo SportsCharles Oliveira's 'hunger' questioned ahead of UFC 326 fight against motivated Max Holloway  Bloody ElbowDoctors Said Charles Oliveira Couldn't Play Soccer, Now He's Fighting For BMF At UFC 326  MMANews.comUFC 326 – Legacy, Violence, and Redemption: Holloway and Oliveira Set for Explosive Showdown  MyMMANews",
    "published date": "Sat, 14 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNVklYaXdFX2w4N2JWOERud2V3NnYtcVRVazRwR3B3SDdnYTdUeW9oeUFmaW5QSDNnTkhBWWpHa19pNDFZZkhVQVh0d1huaWd2WTFEOFRLTF9qRlRZckhjajloNFUyMmExWE9wOTc2UHdKZkkwZXdTal9QZW85NzN3ZEpOcE5QcUxhUkRJOS1nel9ISDRmQ3ZuY1E1LV83TG1PTDhHQVpvcnR5UWJObnhRUmwwVnNLVkZEbWNOSTl4SEtiY2xnVi04blMyUGk0WVRlLXNHakZJQm1sTmZRVW52TFNCQVRFUng1TDI3TVhjc3JEWFEx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "Padres, Nick Castellanos Agree To Contract - MLB Trade Rumors",
    "description": "Padres, Nick Castellanos Agree To Contract  MLB Trade RumorsSource: Padres, OF Nick Castellanos agree on one-year deal  ESPNHow the Phillies’ $100 million marriage with Nick Castellanos ended in divorce - The Athletic  The New York TimesPadres address needs by adding Griffin Canning and Nick Castellanos  San Diego Union-TribuneNick Castellanos reportedly signing with Padres after being released by Phillies  Yahoo Sports",
    "published date": "Sat, 14 Feb 2026 16:10:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPVkllYnd4Ylg1ejZ2VkJBRnRkaHo3Z3FqMnZtVlo0ZHF4OHdxZjBPQk02WDRvdFM0TEZ0SXpRT1FkcEZMWmlwZnN0ckVPYUJmZlp2U0owOHprRXc5MkQzXzVKZFN1alh5SGtTZGRVQnh1MWFNUkFyUUd3ZGVBT3gzelc5NkJNZVhwb1NqZFpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Meet the power couples of the 2026 Winter Games, from rivals to teammates - NPR",
    "description": "Meet the power couples of the 2026 Winter Games, from rivals to teammates  NPRHeated Rivalry and Marital Bliss: Two Wives Go Head to Head in a Scary Olympic Sport  The New York TimesLove in the air! Meet Winter Olympics power couples at Milano Cortina  USA TodayValentine's Day at the Winter Olympics might look a little different, but it's still special  WMURValentine’s Day at the Winter Olympics might look a little different, but it’s still special  AP News",
    "published date": "Sat, 14 Feb 2026 12:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPQjNycU5ONkRwR2FqZnZ5Zzh5NEJuUjRta2l4Xy1DZXUxM01haHlkQUxGbDd0SDNVbE1PMzBQclFMdmJFekRwRVEwRDkyLVFoeDM3bC1mYzZXZndibVFpZG1aTVRFYm5rUF9neS1ERm1lcUNRRDBJOWthbHhfWWM5WWU4YVl1TnE4Vi1Va0d1Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "NASA Selects Vast for Sixth Private Mission to Space Station - NASA (.gov)",
    "description": "NASA Selects Vast for Sixth Private Mission to Space Station  NASA (.gov)Vast wins ISS private astronaut mission  SpaceNewsSpacecraft company in Mojave wins invitation to International Space Station  Bakersfield.comAxiom Space wins NASA contract for fifth private mission, lands $350M in financing  InnovationMapNASA Awards Vast Private Mission To ISS  Aviation Week",
    "published date": "Thu, 12 Feb 2026 21:15:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQdmhCS3hCeDc0MGI2OHkzTUg4ejQwRUtQdDNnMzJyS0F1VzlTdlB6dXVCZ1RtUDZJODRpcTFub3FZTUJjdlpnRG1jVFU1OVdmUnoteHowTDJ0QjR3MTVoSmtORjRFN0V3MUt4Z3N5OTdqb3M1azlSVXJEZmFkbjRscmhLMzdTZWVnUm8wZ0xILVJBR0hLeVVIMGxrZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nasa.gov",
      "title": "NASA (.gov)"
    }
  },
  {
    "title": "Rocket Report: Say cheerio to Orbex; China is getting good at booster landings - Ars Technica",
    "description": "Rocket Report: Say cheerio to Orbex; China is getting good at booster landings  Ars TechnicaSpaceX launches 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB  Spaceflight NowSpaceX plans Saturday Starlink launch from Vandenberg Space Force Base  KSBY NewsSpaceX resumes Falcon 9 flights with Starlink satellite launch from California (video)  SpaceSpaceX plans Valentine's Day rocket launch. Spot liftoff in California  Ventura County Star",
    "published date": "Fri, 13 Feb 2026 12:00:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNZ1FSSWNRWkFZdXpRU3FvMVFuUVRBNXRnREg1eTdSWk0wdnBybm0yN3NRYzVBVGxpZG4yTlZJRm9UNzl3ZU80VVYwUW5Bbk9lSTU0bGdhbV94aWRNU3h0RXpjMjZLZVhyeDQzY2JEcEU1OVpGRldnNXlia005dl8ySEliUjg2bFpIUnhwRDBYbk56a0N3TmpiNFlPZ3pGRWtvREl5SDdWeXVPMWtPUFJYejI5QW51UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again - Live Science",
    "description": "Record-breaking gravitational wave puts Einstein's relativity to its toughest test yet — and proves him right again  Live ScienceHow a Perfect Gravitational Wave Tests Einstein  Universe TodayThe era of gravitational waves  INFN - Istituto Nazionale di Fisica NucleareRipples From Black Holes Could Reveal Flaws In Einstein’s Theory Of Gravity  Quantum ZeitgeistGravitational wave signal proves Einstein was right about relativity  New Scientist",
    "published date": "Fri, 13 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQem9lV1h1VjhkVy1PYzN3czA4WGtHZ0E0eklIWWM1Wm1vQjZkaGJfSl9GYVFwTVA2ZVd6cGtTRENCQVVwSFZYSHltRlhxU010MnEwSU82cFplUUpHbmhZbFl6aWhRSk1iTFVsckd6bEtneVZJaS0xOGlVRnc1Z01JWFFPQk1NZ01weWhZQlZRcVA2cFNEQzZiTE93SG9JLXVzUElXVzAzbFNXeF9RWnk5SHNwRm5XTVQ2SnF1VXB2U3lXX211UjE0bWJuYmplaEs4aUFWYVczNUxiMTNZQXpheUhsV1BpRFZqa3JiWDRvWTV2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "NASA telescope spots the building blocks for life spewing out of comet 3I/ATLAS - Live Science",
    "description": "NASA telescope spots the building blocks for life spewing out of comet 3I/ATLAS  Live ScienceInterstellar comet 3I/ATLAS is spraying water across the solar system  ScienceDailyJupiter-bound spacecraft turns gaze on solar system trespasser  The TimesNASA space telescope sees interstellar visitor comet 3I/ATLAS flare up while exiting the solar system  SpaceNASA's SPHEREx mission spots 3I/ATLAS's bright envelope  Phys.org",
    "published date": "Thu, 12 Feb 2026 22:07:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNWmpXRzdWM00xM3JSQzRFb0VLYzlUZkJLcWZhV0VaTXI5VkJGS3dqMGdPSE9UWXI0QlhWbW8tOVItUGpCN3YxMlo5bDlmV3c4S0xXaUZRNGhSVGVaVFJEWmludlNEbjItdURUR0xZcE14cjdnTGlyQUI3YTF4RkxpMldTUUJneG9tTjEtSm9EclNOU0haLUdkWV9ra2NtcnIzUmVkbmJrTk9icmpuWWlJdzJTR0NvbnNIY2kxUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Popular drinks might house major health benefit, research says - PennLive",
    "description": "Popular drinks might house major health benefit, research says  PennLive2 to 3 Cups of Coffee a Day May Reduce Dementia Risk. But Not if It’s Decaf. - The New York Times  The New York TimesDrinking 2-3 cups of coffee a day tied to lower dementia risk  Harvard GazetteWhat to know about a new study on coffee, tea, caffeine and dementia risk  CBS News",
    "published date": "Fri, 13 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxONnVDeTY3NE5xcVF4WmVFdXpsYm5DYS1FdXVhT0RnM0Z4Rk04TERPNkZhblFBSVh6ZFJ2T0oxZkNnNUF0TEt1SVZQdGIxR284c1duVW9EUjFKTG9fMnQtVXZxbEk5VTA1RFk0YkVqdDVzZzNYc1htU1VlWm9VUS0wY3BkVGMxZVhuSFhfMHNLYm5fRUg3RTYxMEZpUDVMcTNHZFlKQThOUdIBuwFBVV95cUxNZi01V05JbWtBLVNBb2FYY2lVb0pRU2JhQU1RM2x2bEFGalBmMnRNSy1yN1Y4eEh3ZGFPbG1qcDQ4VnhZZlVhcy1HeEVIQXFOMnZBU1Q0c0VoV2FsZmdwdm9PNzlETHFuMUUycUh1OVhpUVcyTWZWLUY5UVFlNGNESldFRUdsZGpWSGRhOW9haGdYM2tlODBmRHJtLXRwSDJNZWMzZ0pkSjZ5RkR3enNtNEoyNXVndTk0TFFF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pennlive.com",
      "title": "PennLive"
    }
  },
  {
    "title": "WHO slams US-funded newborn vaccine trial as \"unethical\" - Ars Technica",
    "description": "WHO slams US-funded newborn vaccine trial as \"unethical\"  Ars TechnicaPlanned US-funded baby vaccine trial in Guinea-Bissau blasted by WHO  BBCStatement on the planned hepatitis B birth dose vaccine trial in Guinea-Bissau  World Health Organization (WHO)Guest post: The CDC hepatitis B study is unethical and must never be published  Retraction WatchWHO director-general calls plans for U.S.-funded vaccine trial ‘unethical’  statnews.com",
    "published date": "Fri, 13 Feb 2026 23:16:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNElOc0h0aG1Lck5tVUpRTTFnS2pEOEVxU2hndTl1UFpIYkU3NUZsZlFkNmRfdUh1dEdtS3l4NkN5Nld5N19EeWRuWUNTV2g1ZG1halJSUkVfR0x4YWJqODNVSElpM09SSzh1UGFKODJvLWQ2em1WSzFuSGhaOWl2WFIySnJoMHRuU29sNU9ZbkV4WGxfd09DaklR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "5 ways heartbreak affects the body - CNN",
    "description": "5 ways heartbreak affects the body  CNNDoctors warn of ‘broken heart syndrome’ spike around Valentine’s Day  WWLPCan you die from a broken heart? Louisville doctor explains the warning signs  WDRBHeartache isn’t just emotional  The Desert ReviewOrlando health cardiologist explains realities of 'broken heart syndrome'  WESH",
    "published date": "Sat, 14 Feb 2026 15:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFAwa2hOX0wteDNOeVFDdXh4VkpIajhGM2Y4VHZkd1Z0eHpnN2xIWGdzc080LVpsQzR5czJHSTdGUE5salJ0Q3piQjl3eldVSGJaU2E0TWVTTmNQX1RNalVlMmlQNmRwZTBmS2lBa3d0ZmRDV3c0QWdpRVVLU1VCdmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "It's a dangerous complication of pregnancy — but a new drug holds promise - NPR",
    "description": "It's a dangerous complication of pregnancy — but a new drug holds promise  NPR",
    "published date": "Sat, 14 Feb 2026 12:46:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNNjFKcE5aZWU1bkN2M0YwXzVLRTVRa2p2aUhUeThiRHlZUlJjWmduWlRrWks4NFdRaWMzb2tSczYxVlJKS2lCeWhzN0lkd3YyOFQ2dWZpZ0J2LTc3MFJSejl1cFZra3pVU3gyT0xvbjdnZW9kQmNqcmdmQ190c1lyLVVzdjNWbU9uUUVPbGYyYndUR1hm?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  }
]