[
  {
    "title": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks - AP News",
    "description": "Iran meets UN nuclear watchdog in Geneva ahead of more US talks  AP NewsNuclear talks between US and Iran set to begin in Geneva  CNNU.S. and Iran hold high-stakes nuclear talks in Geneva as threat of war looms  NBC NewsThe patience and the poker face: Iran’s wily diplomat set to face the US in nuclear talks  The GuardianIran FM in Geneva for US talks, as IRGC holds drills in Strait of Hormuz  Al Jazeera",
    "published date": "Tue, 17 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdU9KcTluVUp5cU54V2FibWZEd0dBTkJpMVhhSXFUbnh2ZDlOLXUwTFlFZmx6T0JSeC1RN2Z1SVRwMlc3R3RCWXRDR2tUUmhndG9WX3RPcENwT2N2OUk0WWpoRmF2QmF4cGJGd1ctVFE0M3RjdGloZ0pGV0s2V1hmc002OVJNTVB5dWlXLXJOeGZSZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "After Trip to Germany, AOC Expresses Frustrations - The New York Times",
    "description": "After Trip to Germany, AOC Expresses Frustrations  The New York TimesOpinion | Class warfare comes to Munich  The Washington PostRubio shines on global stage while AOC, Whitmer, and Newsom take heat  Fox NewsTrump news at a glance: Alexandria Ocasio-Cortez blasts president’s ‘age of authoritarianism’ at European conference  The GuardianYou Know What? Maybe the Time Is Right for an AOC Presidential Bid  The New Republic",
    "published date": "Tue, 17 Feb 2026 01:33:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPakc1LWFXSFEydnE5RF8yTi1HWnczRHFrWndWUFl5cGdxczVOdmVkd0QzZGMwMVdOQ3F5aU9FVW9tTEJ6TkxkeFVhVWFrSkVpVWtMbm9SWDJ1c1pCYm43THIwUFVjdW4yRU9NQ21MbHBZdnd4RWlaSWZHb2E4SWRCaXctc3JHODJiZ3J3WlNsWEZuVE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "China is piling pressure on Japan's Sanae Takaichi. Will it work? - BBC",
    "description": "China is piling pressure on Japan's Sanae Takaichi. Will it work?  BBCJapan Says China’s Warning Over Militarism Not Based on Facts  Bloomberg.comChina is the real threat, Taiwan says in rebuff to Munich speech  ReutersJapan's reaction to China's fact-based warning over militarism at Munich Security Conference shows unease, lacks diplomatic decorum: expert  Global TimesTaiwan 'will not escalate, but will not yield' to Chinese intimidation, foreign minister warns  Fox News",
    "published date": "Mon, 16 Feb 2026 23:21:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9XUjlXV0IwWXNERXV0TzhDRmhWTk5EX1gzLTVUaUQxVDNRbEEtdFZnQWE5SEk3eDdBdHFiMXl4bjh6TUJaQzNiRzQxZDYyNHhKVEhNS2FzNlFvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Lunar New Year 2026 live: Year of the Fire Horse - BBC",
    "description": "Lunar New Year 2026 live: Year of the Fire Horse  BBCChinese zodiac predictions: What’s in store for 2026 as we enter the Year of the Fire Horse  CNNLunar New Year prayers, robots and festivities usher in the Year of the Horse  AP NewsHappy Year of the Horse! Let’s trot out some fun horse science  Scientific AmericanLunar New Year welcomes the Year of the Horse. When does it start?  USA Today",
    "published date": "Tue, 17 Feb 2026 03:50:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE55SHAxR1VqbjFUcHVza3VhOUxoVWRELUZ4VHcweWh1TERTSEVnN2dzX1p0WkMySGdKOUVlNndPMkZCMjh1b05oalRNNGJIN25vRWc2VQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Epstein files end business, political careers across globe - Axios",
    "description": "Epstein files end business, political careers across globe  AxiosEpstein files fallout: The high-profile people burned by past dealings with a predator  CNBCTamara Keith and Amy Walter on the public's response to the Epstein files  PBSOpinion | Ro Khanna Is Shaken by What He’s Learned From the Epstein Files  The New York TimesDOJ declares full release of Epstein Files, but list of 300 names sparks backlash  WBFF",
    "published date": "Tue, 17 Feb 2026 07:05:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE4tdW1xWUl4R040WGxNOFM3ZXltV0JtN2tvZThPS1dEdEN1YTBIWFdoMURoMEU5TEx3QXFGc2NBdjhuZ0piWU9sMEIwVHU1em5UWGZ3bHZobUlVUFRMR0F4UG11NHdfS3lpeE8zc1A3eV8tVEEybWZyOGxzeGZPWTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Epstein ranch in New Mexico bought by family of ‘Trump Republican’ candidate - The Guardian",
    "description": "Epstein ranch in New Mexico bought by family of ‘Trump Republican’ candidate  The GuardianNew Mexico approves comprehensive probe of Epstein’s Zorro Ranch  ReutersNew Mexico lawmakers launch sweeping investigation into Epstein ranch  AxiosTexas GOP politician Don Huffines plans Christian retreat at Zorro Ranch  Santa Fe New MexicanNew Mexico House unanimously enacts Epstein ‘truth commission’  Source New Mexico",
    "published date": "Mon, 16 Feb 2026 17:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNMmxhQzctN1RGX2RsUDBRMlh1WC1xRmg5TEVoaXhsVW1UZGtlOUxTbVJSR0pJNGNOYkVwelpra1ZXSGlDUFJTZ3JqR1dMYlZHa29na2hIdUNaRWZ2eFBpdzlpZEZGTFlKYThTZVdwc1Y5MHlGUm40SU10TS05MlpvRi1pX2g2bjg0RVpiSE5tZVVBdW5YQXdXRlBFa24xTjFCNzd2bw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "The U.S. ready to make up, Europe ready to break up in Munich - NPR",
    "description": "The U.S. ready to make up, Europe ready to break up in Munich  NPRMarco Rubio Doesn’t Get It  The AtlanticWarmer words but relations remain frosty between the U.S. and its old friends in Europe  NBC News5 takeaways from a tense Munich Security Conference  The HillThree American Speeches at Munich, and Plenty of Confusion  The New York Times",
    "published date": "Mon, 16 Feb 2026 19:49:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5seVFLZE9pRjJNWGNEVldfOWhoVkt5Qnh6WjhLZXVIUExzZnBIM0JMXzQyUlU5MkdaVzBwcHZhX1pycnU4VHU5eWFuVVVHdmpFcXpGc0N3ZmJOZFNFcHdpNTFaQlZuNmdOZi1nUEl5RW42ZFo3SFc5LURaOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Aliens are ‘real,’ Obama says, as Washington shrugs - The Washington Post",
    "description": "Aliens are ‘real,’ Obama says, as Washington shrugs  The Washington PostObama clarifies alien comments after telling podcast ‘they’re real’  CNNObama clarifies views on aliens after saying 'they're real' on podcast  BBCObama says aliens are 'real.' Congress has heard about UFOs for years  USA TodayBarack Obama clarifies he's seen 'no evidence' of aliens after saying they're real  NBC News",
    "published date": "Tue, 17 Feb 2026 00:23:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9RQTlQS0FmNDA0YzNhVTFkUGI3RmlTUkk4UUtZOEdyenB4eVBTdEMxZ3g0QmJXNUt5MWVJZUpaejVncHFySEMxcXB2TjBROXQ5djVkR0tyVDFTNEhnaG9rV0pFRkRyZGhpbk1IQnltUF9YVVdLSkNsTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Australia refuses to repatriate ISIS-linked citizens in Syria as escape attempt fails - CNN",
    "description": "Australia refuses to repatriate ISIS-linked citizens in Syria as escape attempt fails  CNNAustralia won't repatriate 34 women and children from Syria  NPRAustralians with alleged IS ties are turned back after departing Syrian camp for repatriation  AP NewsAustralian IS families in Syria camp turned back after leaving for home  BBCAustralia won't repatriate 34 women and children linked to IS from Syria  KSAT",
    "published date": "Tue, 17 Feb 2026 04:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPSGFsaFVZNnZnemZvUFU5NXYwUGZ3Ml9kTlNqS0N6cUFxckw4LTlIMUE2dVNIcjhVaHdmVmxyWlU1S2dZZTA5RU9ZTFB0bHhLYWNtZlRBbHQ3c2RvNXFKN2UtOGZOUS1nQlJRVDR0VW5PSlgwV2ppV0JlcndfR3hSYjlMMHFFZnF1cTFIdXhkTjNHMncx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Rubio plugs Orbán’s bid for another term in Hungary’s elections - AP News",
    "description": "Rubio plugs Orbán’s bid for another term in Hungary’s elections  AP NewsWhile MAGA faces challenges at home, Rubio seeks to export it abroad  CNNRubio lends hand to Hungary’s Orban as he faces tough election  The Washington PostTravel to Germany, Slovakia and Hungary, February 13-16, 2026  U.S. Department of State (.gov)Trump is ‘deeply committed to your success’, Rubio tells Orbán during Hungary visit – as it happened  The Guardian",
    "published date": "Tue, 17 Feb 2026 01:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQeGFPMjRrLXpuSWRjT3ZGa2ZGRGR3N21zZnhvbndXbHA0ZXJFSkpkem1WVGhLdkxGTlhCQ1ZTdEZSQWMxUHVvTmYwMnhmOGV2NXM5d3V3bmVTSzNUSS1PUmswTkhtekFvR1Q5SmV3eGJCOHdlYVFBQWxQNmpWSW9wTVBGV1U5NEhMZFJSWm5BZ0NtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Italy’s Meloni doubles down on law and order - politico.eu",
    "description": "Italy’s Meloni doubles down on law and order  politico.euGiorgia Meloni’s Mission: Persuading Trump and Europe to Be Friends  The Wall Street JournalThe end of the Trump era won’t spell the end of U.S. populism – just ask Italy  The Globe and MailGiorgia Meloni’s Visit to Japan and the Japan-Italy Summit  The Diplomat – Asia-Pacific Current Affairs MagazineItaly at a Crossroads: Giorgia Meloni's Dance Between American Populism and European Pragmatism  ekhbary.com",
    "published date": "Mon, 16 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPTlhjZVlzV2tiRXZkSHllT1ZyVkoxUUo1Sm1fbm5ZSlJTLUFJZmxSblZKVnl5T3lIcjBSYzQ5SGpjanQtYnRjWFNPdkxKVWhjZ2ZlSVUyWXgwRDlNTWhQMXpoQm9NenR2dE5Ob3BNUVpmUHFqdUthT0puQUs2ekhOamRRMmxVOUYzSGNZZ1dsTzVoOVpBcU1nSy1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "U.S. Ally Humiliates Trump by Degrading Him on Presidents Day - The Daily Beast",
    "description": "U.S. Ally Humiliates Trump by Degrading Him on Presidents Day  The Daily BeastView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 01:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUk9PQnM4c1BXUXU3bUdwUTV1b19mMWZ5c3dXbFJPZHpacTVtRFlCZ29tRFFObmR6U3RVTjB6VlBFbFQxV2xoUFJmV2x6UklLZHY1amxQVEROQkZ2cko4Z2pqOEFHRXFOT1hjVDU0dlpXOEhmOTJqdG8zaFZTLTY0UV8tbnIxMms5Q1NmZ2R1TkxZb0Qx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Exclusive | Activist Elliott Builds Big Stake in Norwegian Cruise Line - The Wall Street Journal",
    "description": "Exclusive | Activist Elliott Builds Big Stake in Norwegian Cruise Line  The Wall Street JournalElliott builds over 10% stake in Norwegian Cruise Line- WSJ  Investing.comActivist Elliott builds over 10% stake in Norwegian Cruise Line, WSJ reports  ReutersElliott's Investment Aims to Revitalize Norwegian Cruise Line  Intellectia AIElliott builds stake in cruise industry giant  breakingthenews.net",
    "published date": "Tue, 17 Feb 2026 02:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOMEhzUkNkWkpHUFdVZEFqVVA3UGlVOHdfSHRFUlRKdDAyTEM2dUxPOHY5blZxOE9HWEZ0X1lNZ3hDVldOMGpmLUxSLTZwbndWcm9aQUJVNlVtS3dEQS1tSkRiUXJ5TTUyQkNxQ0w2aHhsck5XNV9BbkphUjI2c1JsQjZaSmp1QWFORFhERi1LY0x3blVyR2k5MnVsQl8wZHY2Y3pTag?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "A top Salesforce executive says Benioff's ICE jokes were 'not OK' - Business Insider",
    "description": "A top Salesforce executive says Benioff's ICE jokes were 'not OK'  Business InsiderSalesforce Workers Circulate Open Letter Urging CEO Marc Benioff to Denounce ICE  WIREDMarc Benioff 'Jokes' ICE Is Watching Salesforce Employees Who Traveled to the U.S.  404 MediaSalesforce workers outraged after CEO makes joke about ICE watching them  The GuardianSalesforce cofounder Parker Harris to employees on controversy over CEO Marc Benioff's ICE jokes in an internal meeting: I am not gonna ...  The Times of India",
    "published date": "Tue, 17 Feb 2026 02:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNbTc3NU1rSjRjdFZqaTlvc3p0R1FSaE1oelBPWTlITy14NkVZMVk0bHB3TGM4RlU4V2VIVDBpV2RFRlNUb2dtZFBMbzdTRThfVmktMTRXQVc4VFlyYXJoa0NySTA4QlRsQVBJUDZGMGlnRmtJblZrem1kQmVlTzduakRvWUNsS2tlMWR2SEFXUm5Xdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "SpaceX to Compete in Pentagon Contest for Autonomous Drone Tech - Bloomberg.com",
    "description": "SpaceX to Compete in Pentagon Contest for Autonomous Drone Tech  Bloomberg.comSpaceX Enters Pentagon’s Contest to Build Voice-Controlled Military Drone Swarms  TipRanksSpaceX to compete in Pentagon contest for autonomous drone tech, Bloomberg News reports  ReutersElon Musk's Starring Role in Pentagon's Drone Swarm Race  DevdiscourseThe AI War Machine: OpenAI, Drone Swarms, and the New Defense Software Era  CTOL Digital Solutions",
    "published date": "Mon, 16 Feb 2026 18:24:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQRzRJZzJDcUhIVnhsS0FMTHd3Rzg1N0lhbkR6eW5fMHhJeWR5UUlXTnVMS1BuU1E5blJSTUVycUJHUXYtWjM1aE5VQWJsbVRCRGNOS2taVzlzeVp2WUZBdEJXa0U1YUVrdVJ2Q2tzMnZKa3FUMEMwd3BUMGxhVzUzalJUVlZlTWMwbTJjT1UwQkcyVUVrUThZd2ZhU0IwbzlESmpHVHRYdnRlVE1ZWUYtREJMcVU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "EU privacy watchdog opens probe into Elon Musk’s X over sexualised AI images - Financial Times",
    "description": "EU privacy watchdog opens probe into Elon Musk’s X over sexualised AI images  Financial TimesIreland opens probe into Musk's Grok AI over sexualised images  ReutersIrish Data Watchdog Opens Inquiry Into X Over Grok AI Images  The Wall Street JournalGrok Shows the World What Ungoverned AI Looks Like  Geopolitical MonitorIrish data watchdog opens probe into X over Grok images  RTE.ie",
    "published date": "Tue, 17 Feb 2026 00:01:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9ZeGlvaGVzTGI0OURhQ0g1ZmZBWXUzT25jazdvZGhKSFVDelBRdXZ4ZXY3endCZkh3SjRreklaQUtiM0NvdExqU2xsUkdkQzV5LUdwSVlMZzViOHFFM0hRc0NFdWFWT25WeUJFRnBfNFA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Unity says its AI tech will soon eliminate the need for coding - Game Developer",
    "description": "Unity says its AI tech will soon eliminate the need for coding  Game DeveloperUnity's CEO Just Explained Why Google's AI Can't Replace Game Engines (And He's Right)  The Motley FoolEngine Maker Unity Focusing on “AI-Driven Authoring” to Allow Devs to “Prompt Full Casual Games Into Existence”  WccftechGame Makers Turn to AI to Cut Costs and Boost Productivity  KoreabizwireUnity AI will let you create 'full casual games' with text prompts and no coding experience  TweakTown",
    "published date": "Mon, 16 Feb 2026 17:14:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPZzVlajNEX3JnUHlHS0dpaVFBYm95SlA2cnpVTU0yRWdNaVBZUDFPa3dhdFFtUVNhSVZOLV9kVlM0WjJOeHV3WS0xWkdocUNndjhpTzZNcUQ2OFk4UmtHYjYwUm5LZDJaai0tYmVqVThZekM5R2hkNEhXVmxSYTFzRzJPR1p0T1o2bmRvVHBicGt2aF9pUlY4b1pLbjBHN183anlTSEcyQjVTLXA1Q2lHTHpreGpTcU94Vk9PbjhMVEljOUl6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.gamedeveloper.com",
      "title": "Game Developer"
    }
  },
  {
    "title": "Assassin's Creed Shadows winter roadmap includes community parkour and Switch 2 Claws of Awaji release date - Eurogamer",
    "description": "Assassin's Creed Shadows winter roadmap includes community parkour and Switch 2 Claws of Awaji release date  EurogamerAC Shadows Title Update 1.1.8 - Release Notes  UbisoftAssassin's Creed Shadows Roadmap Includes Major Update, A Parkour Challenge, And Switch 2 DLC  GameSpotAssassin’s Creed Shadows – Claws of Awaji DLC shares Nintendo Switch 2 release date  Nintendo EverythingAssassin's Creed Shadows Update Finally Lets You... Jump?  Insider Gaming",
    "published date": "Mon, 16 Feb 2026 16:57:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNVWtMeWFyRkdlQ0l4cXViWnhtQkxHd0NzMzIzMzhWRkVQaUZLQWRBalZ5OXVEaVdJZWNMSG83ODAxR091V0VJRWMyZVBpQmFuNFhLejVaRTVzUzc2VmpTZFA3b09TZEhlX2pCRFdXS2ZNRm9pMUZERlNHanFyZkpvMk9LeF80eldyT1dKX3FPaUNTNXgwZjhxcHRZSVZyOWxkZnVfeElMaVBBU3pVa2VIZG1tbWxUV3BPNmJ5aS1XTncwd01KbWxOdHVmOWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.eurogamer.net",
      "title": "Eurogamer"
    }
  },
  {
    "title": "iOS 27 'Rave' Update to Clean Up Code, Could Boost Battery Life - MacRumors",
    "description": "iOS 27 'Rave' Update to Clean Up Code, Could Boost Battery Life  MacRumorsiOS 27 to include code cleanup and interface tweaks in hopes to boost battery life: report  9to5MacHardware and software changes will lead to improved iPhone battery life this year  PhoneArenaApple’s iOS 27 Might Bring Huge Battery Improvements, As Tesla Bemoans The Slow Rollout Of iOS 26  WccftechiOS 27 expected to deliver better battery life even if you have an older iPhone  AppleInsider",
    "published date": "Mon, 16 Feb 2026 12:40:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNbnZzbDY2T21ncThqM1JLRjYyeW5FWWNiT0tEaGxTQ2FJOXFlWWU1V1FSMmNXMVBncFdGYm0yOC1rTjhCZzJ6aVk4eFkyOWJwdUF6VG00SmtUTHFJdjFZcDhGWmZpeHlSUEp1cFIxUlJocEZrR1RZbGIxZDVEc1Jrc0NZOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "Novitec Thinks Ferrari’s V12 SP3 Actually Needed One More Thing - Carscoops",
    "description": "Novitec Thinks Ferrari’s V12 SP3 Actually Needed One More Thing  CarscoopsNovitec has given the Ferrari Daytona SP3 even more power  Top GearNovitec Turns Up the Volume on Ferrari’s Daytona SP3 V12  AutoblogNovitec unleashes custom Ferrari Daytona SP3 with gold-plated exhaust  Driven Car GuideNovitec Becomes the Tuning Fairy for the Ferrari Daytona SP3, Raises Power to 856 Ponies  autoevolution",
    "published date": "Mon, 16 Feb 2026 12:56:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE5IbWVzcy1KdG9IZVJtc0hTLXA5R0tydzJLajlqWVhuNjgzNU9sVHpMUFlGRW9UZVpKdnNhaFJoc1RDeUZ6bE56am9oWHFmaS1YMTdIcUFBOExRelZ1anR0SGZlTTh0Y04xTkFQUEVRcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.carscoops.com",
      "title": "Carscoops"
    }
  },
  {
    "title": "Los Angeles Mayor Says Chairman of 2028 Olympics Should Resign - The New York Times",
    "description": "Los Angeles Mayor Says Chairman of 2028 Olympics Should Resign  The New York TimesL.A. Mayor Bass says LA28 head Wasserman should step down - Los Angeles Times  Los Angeles TimesLA28 chair Casey Wasserman to sell talent agency amid Epstein fallout  KTLALA Mayor Bass calls on LA28 chair Wasserman to resign  ReutersThe ‘Epstein Fallout’ Is Spiraling Out of Control  The Free Press",
    "published date": "Tue, 17 Feb 2026 04:34:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPMGM4blY2emR1UHc1QVZidjZxdkFaUFdYQ05yZ1lJNUJvMUJ6ODBjVjZwQVlpYlZwb1NzdWs5Z2l4MHFnN3hWNWV4VFJ0OWhUa20wZGxrSE5xYUkwSm9wMUxYVndnbWJmS0xfbkRtb2ZndkNKSkhxRGxybUQ0VTFrNHlMU1M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Anderson Cooper is leaving ‘60 Minutes’ after two decades - The Washington Post",
    "description": "Anderson Cooper is leaving ‘60 Minutes’ after two decades  The Washington PostAnderson Cooper to leave 60 Minutes amid turmoil at CBS News  The GuardianCooper’s Final Minutes  status.newsAnderson Cooper to Leave 60 Minutes After Nearly 20 Years as Correspondent  People.comAnderson Cooper to Leave ‘60 Minutes’ on CBS  The New York Times",
    "published date": "Tue, 17 Feb 2026 07:32:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNRVFjaFBHSC1zNjFUblctTVFYdlg1TjRVbEJtdUFQSWlwaGhVNXdYMFdLZlc3cUR5VkdScUc5R0FKS3ZadGlHTTltSUF4Y243Vkx3elpZb3BNNGxWZ2dSQjJnMU95VkxvLUpfZlpGaGtOVi1zS2VETXZGTmIxZjBJbWcydnV3dE1ObW5yaHFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Shia LaBeouf’s Mardi Gras Bar Crawl: “He’s Terrorizing the City” - The Hollywood Reporter",
    "description": "Shia LaBeouf’s Mardi Gras Bar Crawl: “He’s Terrorizing the City”  The Hollywood ReporterView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 03:07:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPeHVCU0NiRjFNazFXSWpZT1E1NHh0OHpzS3VoRVZQOXpWcEwtQXNoSzJzeFN0dzU0ajNOVWU0RmF3WnJ0TnFmczRlQm5OZVg3ZzIyaE1LMGNkRmY0VmRhX1BXb2FPSTZVRmx2NlB5V1IyRm41c3E1VnFxSFI0TEkyaEJRYlBpdDZ0QjZJUXlFX0lFLXdoZERDZks2WGx6Q210VTJUSWtwaUg2YnRtQnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hollywoodreporter.com",
      "title": "The Hollywood Reporter"
    }
  },
  {
    "title": "Ray J performs with bleeding eyes weeks after revealing he has months to live: 'Life on the line' - Entertainment Weekly",
    "description": "Ray J performs with bleeding eyes weeks after revealing he has months to live: 'Life on the line'  Entertainment WeeklyRay J Shocks Fans as He Performs with Bleeding Eyes and Chest Patch at Show  People.comRay J Performs With Apparent Blood Running From Eyes After Near-Fatal Heart Issues  E! NewsR&B star’s eyes appeared to bleed at show weeks after he claimed he is dying  PennLive.comRay J’s Valentine’s Day Performance Shocks Viewers  bet.com",
    "published date": "Mon, 16 Feb 2026 22:03:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQMXZkaVhfdHdYOG1uR2VyU1FQUk1Zei14MVNyU0hKYlU5Y2o4OXl1bnZYMDROLVRLcFFUdXlyT3BFY3lpWm9XV2ZJNzQ1cDQ0VGM5TzhkYWdMV3VxcVZpRm9JeW5IMmUxeVZpaFpQRG12UVB2bEg3N0VpY3hlZzZwNm9MMWxtZmJxSUhkMS0zNFFadG8yWVF4LQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ew.com",
      "title": "Entertainment Weekly"
    }
  },
  {
    "title": "USA men’s hockey can’t look ahead to Canada in bid to end 46-year Olympic drought - New York Post",
    "description": "USA men’s hockey can’t look ahead to Canada in bid to end 46-year Olympic drought  New York PostOlympics 2026 men's hockey: Standings, stats, schedule, more  ESPNWhat to watch for as 2026 Olympic men’s hockey qualifying round gets started - The Athletic  The New York Times2026 Winter Olympics men's hockey odds, predictions: Tuesday playoff picks from expert on 26-12 roll  CBS SportsWinter Olympics 2026: Team USA men's ice hockey schedule – key match dates and how to watch live in U.S.  Milano Cortina 2026",
    "published date": "Mon, 16 Feb 2026 18:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTWJlV1dKVURzWWh6VS1Da0JSdFUwaE5adndHWmVtNTFxOC1VUDNqNjkxS1lRNmlhVWRUOS12bWx4TGJuSFFKVkNtdEkxNnhpNlpZemh5UWdGcnlIYW55NWI0R3JfOFVMMms4eHl0UVRzOWt6bXctLU01S2dQV3VWSWhWLXpaRlFsa00yQkVQUkJRSnE3XzJmc1RLYjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "A curling scandal rocks Olympic ice - NPR",
    "description": "A curling scandal rocks Olympic ice  NPR'A sad day' - Canada rocked by curling cheating row at Winter Games  BBCBlame Canada! Country's Olympians are covered in cloud of suspicion again  USA TodayUmpire monitoring protocol updated following meeting with team representatives  World CurlingTrying to tame the Olympic controversy, World Curling sent in the umps. Then it sent them away  AP News",
    "published date": "Mon, 16 Feb 2026 20:40:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOenBpZHBOTHJSRXBvcU1PcnlOUTBPZWRZOFRLNFc4WWlELUVuZWxoZUMzajU2cVdpRXNqV0c5aVltdXlLUlRMY3NLQk1vOE5vY2VWRHZBN19lOFBsTy1sQ2JZRWdjVlV0NlRyZlUwOWk3aG5ORUFxd01EanBjTjduXzF2VVk0eEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Ilia Malinin hints at 'inevitable crash' amid Olympic pressure and online hate in social media post - AP News",
    "description": "Ilia Malinin hints at 'inevitable crash' amid Olympic pressure and online hate in social media post  AP NewsIlia Malinin hints at 'inevitable crash' amid Olympic pressure  ESPNIlia Malinin Posts About 'Vile Online Hatred' and 'Insurmountable Pressure' as He Teases Event After Olympics Struggle  People.comMaxim Naumov says skating community has Ilia Malinin's back  NBC NewsIlia Malinin hints at intense Olympic pressure days after unexpected result  Fox News",
    "published date": "Mon, 16 Feb 2026 23:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQUVdHUTBkc2JfYjVMMzhkRjdMRl9Id1AtQXlmbUh0OHdneklsTms3MjI2dEpVTnZsUl8xMGJwUkFNS2pQMWxkbkY2Sk9JNXVpSEpTVEVIZVh0cm5zMUEwZ2k5WlpuT2NoYmxTZ3ZXdzI1d002ZTlibzI0N0JKS0k2Z3ozZFlKQV91cEtKSGw2TGNzQ1gxRUR0eHgwQUstd2VrMy1ONDR3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "French hockey player who fought Tom Wilson suspended - ESPN",
    "description": "French hockey player who fought Tom Wilson suspended  ESPNWilson has been 'outstanding' on, off ice at Olympics for Team Canada  NHL.com‘That’s hockey’: Canada’s Wilson shuns Olympic tradition and brawls during win over France  The GuardianFrance suspends Pierre Crinon after Olympic hockey fight vs. Canada  NBC OlympicsNo fighting at the Olympics? Canada’s Tom Wilson doesn’t care - The Athletic  The New York Times",
    "published date": "Mon, 16 Feb 2026 21:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSm5Ncm5HSmhCS0JORWtpdkFMWWItWjlTQk1HSGpWaFBPVGhoN256TWVlN0JQaDVfRnJNLVpFZXMwTUJsZFFFeDlqbUVsN3lqQVpCNnZfM3JTNFQ4TnhtN25vaThLR3FMN1BoMVFOSnJ1T0swd2hnbEpqc2JYN0JONWVaMkxTdVRWSDEtMm43OC1rQWJFSUd0Y1lGVmNvWms?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "How one genome creates two distinct fungal bodies - Phys.org",
    "description": "How one genome creates two distinct fungal bodies  Phys.org",
    "published date": "Mon, 16 Feb 2026 20:00:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4xTkFCQVUwalVDOXhERVdGQU1iOGFyZGs1ZE1mcXBjWTYzdzg2c2ZZVDg3UENObFNWNGJPNzN1WWRJdnJHam1BVlRyYThkRUQxY3lfM1RxMm8zOUtLbjdGMjRnSGp3dS1mZG1UTl9jUE9YZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "This Bonobo Just Did Something Scientists Thought Only Humans Could Do - SciTechDaily",
    "description": "This Bonobo Just Did Something Scientists Thought Only Humans Could Do  SciTechDailyWhy scientists played make-believe with an ape : Short Wave  NPRNot just humans, apes can imagine, pretend and mentally track things that aren’t real, study finds  The Times of IndiaWhat A Tea Party With A Bonobo Taught Us About Imagination  Science FridayA Simple Tea Party Might Change What We Know About Primate Intelligence  Gold Central Victoria",
    "published date": "Sun, 15 Feb 2026 20:12:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQQzN4ZnMtUnl3NXFNbllsSDBERnFsaV8yV0ZtNlUxV1l0RmlxSnF4UnJmV1R6T3JOdDJZNjlXdVUyTTVrZkk1Yzg3dE9ZbS0xWE1McFU3OW9EUTgxMDFEcHdxem5GREc4RnpFSGk0eFZ1S1JPamFzWW5ndk0wVW9lM2ZSaHN6OGZtUXU5MnhHbXhrZjZ2NHNwdWo4Uzg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://scitechdaily.com",
      "title": "SciTechDaily"
    }
  },
  {
    "title": "Space Station returns to a full crew complement after a month - Ars Technica",
    "description": "Space Station returns to a full crew complement after a month  Ars TechnicaFour people on NASA'S Crew-12 arrive at the International Space Station  NPRSpaceX Crew-12 Docks to Station Beginning Long-Duration Mission  NASA (.gov)Replacement crew docks at space station, boosts crew back to seven  Spaceflight NowCrew headed by Jewish American Jessica Meir arrives at International Space Station  The Times of Israel",
    "published date": "Sun, 15 Feb 2026 21:11:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQalNiRl82bTQ0MjRVUW0teTBSU2xHZ1owcF9idWpOXzlpSU5zc3U1UXN0bjFYUGV2N25UVVp5Q2VockJlOTBNeWVHVWI4ODg5NkIydzRCZW5GZFF6ZEpuMFZzNzlRVUFPU3EwOEI4b2l0aWVlU1hxcnVtRWxEM0dUVWh6dVRHUjZWYWxRNjJXT0JQeHlaR2gzWklhV1NSMHZQMGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "A solar eclipse is coming tomorrow. Why isn’t anyone talking about it? - OregonLive.com",
    "description": "A solar eclipse is coming tomorrow. Why isn’t anyone talking about it?  OregonLive.com‘Ring of fire’ solar eclipse: February 2026 path, visibility over Antarctica and partial eclipse for South Africa  CNNHere's what will happen during each phase of the Feb. 17 'ring of fire' annular solar eclipse  SpaceWhere will the annular solar eclipse be visible on Feb. 17?  SpaceHow the New Moon will influence your sign in February 2026  Vogue Australia",
    "published date": "Mon, 16 Feb 2026 18:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdXF4cWpQX3Q5OUZIc1FsTXp4LTVaZ1AtbmNjMm9XVWJBNVpTb2dPUTBzeEZMcFJFRUFKMzdQbmlUODFZTHlraG5FUUY2UnRrRGR5SUhWalZxLTllVHRRT0szMGIyTGYwaFk0bFc4OEdoS0MxeWpvekFQTVRyUVVSQzZONUlnelkxWXQwZ1laNXBqOWxXQ1hLQTJabWlwVG4wbTVIb2xSckoyek9IZS1HNGpLZ0hfUdIBygFBVV95cUxNY0t6WlRMR2VTcWFUVkZKS3p5U2JpWTVsazJWbV9uNnJ1a1R1MU5iTjBJZ3lrazlubW9tVXgtLXpROEIxdlRFNXNYRGVHTERZM2VMaUtVbjE5TlBOZ3pGM1pWdEpYZ3hXSUFyQTdycWFFMGFCNlJpRGpYcVlPWGJxLXFyYjQ0LWhCSVJ0TmdFNWhGbTlKVTRYVlNyVXNBQkpIaFVUZUV6S2NCZlM5eGhISnBZWlpLODNJYU80TzJlN1lyMUtWOTczV1lB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.oregonlive.com",
      "title": "OregonLive.com"
    }
  },
  {
    "title": "Adult with measles possibly exposed others in Fairfax County - WTOP",
    "description": "Adult with measles possibly exposed others in Fairfax County  WTOPMeasles patient went to 3 places in Lorton. Check times and locations  NBC4 WashingtonVirginia measles cases this year already surpass 2025 total, VDH data shows  WVIRAnother measles case in Northern Virginia; potential exposure at THIS Giant grocery store  WJLAVDH confirms 8th measles case of 2026, surpassing 2025 total  WWBT",
    "published date": "Mon, 16 Feb 2026 23:30:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPYXVnSWZLTmZwNkVKM3N1X3VYMk5xS1hWNjVQa3JuQlUtQUMwbVEzaUdtTzd5WldtVV84cnRJTVVDUE1wZExmMGFiQkpkWkNDSzFLYlNJaDRwOWdDenJReWN1azB5c0hTU3V4TVlZcU0wbk00a0lJeXdjdmd1bHFEb0ptMldiYldSNWhNQmhzRWpOTE5QalE5UU1xYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://wtop.com",
      "title": "WTOP"
    }
  },
  {
    "title": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health - AOL.com",
    "description": "Cardiologists Share 6 Surprising Lifestyle Habits That Boost Heart Health  AOL.comDoctor says these three things can help your heart’s longevity  WAVE NewsHeart Month brings focus to heart health in the Roaring Fork Valley  AspenTimes.comHeart disease prevention tied to equity, awareness during American Heart Month and Black History Month  KTVU8 Heart-Healthy Habits to Lower Your Risk of Heart Disease  West Tennessee Healthcare",
    "published date": "Sun, 15 Feb 2026 10:08:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNMks5Y1g3X09jLU95dnJLcW1SREFvREtCbjBYTXZBeVV4UHdwaXkwZXNrMW1adjFCZGlXUVRlZlp5OU9sQk8xb0h2NHRNLU9ydW9FbTY4T1dWbFdRbVRqT0ZsNmdxdVV3cjRfV1NQN3N0VGlwbEpUZjV5Q0EteWVHVkNDU2pLRUhoUm5UT01Tbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aol.com",
      "title": "AOL.com"
    }
  },
  {
    "title": "Brain game may reduce risk of Alzheimer’s and other dementias - WMUR",
    "description": "Brain game may reduce risk of Alzheimer’s and other dementias  WMURJust 5 weeks of brain training may protect against dementia for 20 years  ScienceDailyAlzheimer's Risk Cut by Nearly 40% for People Who Did This One Thing  People.comThis Simple Brain Exercise May Protect Against Dementia for 20 Years  SciTechDailyReading and writing can lower dementia risk by almost 40%, study suggests  The Guardian",
    "published date": "Sun, 15 Feb 2026 22:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdldEYjZxM3lmdGJvOWdhcUhqNExDWml0Q05qb0JJWHJScU1QWU5qRGJKQ0FrUXl6RUJWeTZxaDc2bTZNWXFWd1NwcVZqY1ZFd2NvRV9heUFlc1Bvd2htUEM3Wk9PNVh1MndsTXA0QUVFLUVxekZ6WkRkYk5ZQnlWU1Jn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wmur.com",
      "title": "WMUR"
    }
  },
  {
    "title": "Warning Stroke: What It Is And Symptoms To Look For - HuffPost",
    "description": "Warning Stroke: What It Is And Symptoms To Look For  HuffPostMEDICAL MONDAY: Knowing stoke signs & symptoms can save a life  WJHGWarning sign that suggests you are going to have stroke within 90 days  LADbibleSponsored Content: Signs and Symptoms of a Heart Attack or Stroke  WJHLRecognizing the signs of stroke and getting prompt treatment  South Carolina Public Radio",
    "published date": "Sun, 15 Feb 2026 12:00:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPR3MxTlVfbm1yYUlOMHZJSTlyUUdaSFRZeWNxaWR3dzB4UVJMRHdpR1ZzSHJienlrcmRRT1BlNTRmbTZIQzlxWGRaWkNPRHFEMW90RmFVaXk5TTlVTllnVDVnaDRlQnBpT2gxLUZsOWc2NEhrd1ctQlZBaUE5M3FXT0thQnBaemcyTzBWbNIBkgFBVV95cUxOcXJrbGluTDBvUWdqbUNaOGhvZ0F4YVN2akdxZnZLcE5icklpcm1rUFF3TVFqcm52dzRoZ19PQjhOVi1BZnBuZ3g0M1B4SDBQR0NWYzFITmFZVC1mWDlWNl9QZVMxVDExRlQxOHg0VlB2X0x0OW5IZUVwQ2RQN3Bad18wY0dLNk5GN3UzY0dvWk1UUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  }
]