[
  {
    "title": "Trump feels obligated to take action on Iran as administration weighs risks of retaliation - CNN",
    "description": "Trump feels obligated to take action on Iran as administration weighs risks of retaliation  CNNLive updates: More than 2,400 protesters killed in Iran as Trump warns against executions  CNNTrump Says Iran Currently Has ‘No Plans’ For Executing Protesters (Live Updates)  ForbesGreenland live: Denmark says 'fundamental disagreement' remains after US talks  ReutersAnalysis: Trump Supports Protesters in Iran, but Not in Minneapolis  The New York Times",
    "published date": "Wed, 14 Jan 2026 16:49:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9vM0RpN2Z1cmVRSGR3c3VGMHFWYUNPdG1OSHVoVG01ZnJaTFlTaGxqUzNneTZFbDJxQzNFX0RLTzVZaHNYNWVqSXprSkJVZVREaDFDZ3c4TWFBbHVZV2J1aVF2VG00YXkwTzJrakxIVGpnZDQ1QXoxWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump administration indefinitely pauses immigrant visa processing for 75 nations - The Washington Post",
    "description": "Trump administration indefinitely pauses immigrant visa processing for 75 nations  The Washington PostUS suspending immigrant visa processing for 75 countries  CNNUS freezes all visa processing for 75 countries, including Somalia, Russia, Iran  Fox NewsA Guide to the Countries on Trump’s Travel Ban List  Council on Foreign RelationsThe full list of 75 countries where Trump is suspending visa processing  The Guardian",
    "published date": "Wed, 14 Jan 2026 21:36:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQcXZBV0tIRzJZbnlrQXcxNThvSm1pOGY1YTdsS0t2TlZfRXZieEhlaDE4STBYVGd0RGNRbXdsRTQwT2YtMlFqZDhNaWxYTjByNlpMNUQydWF3UWh5NXV1dHl6TE1nc3JWb2Zoc29XMnphRjRuNzdzdkstbHJSem9udmxzMWRUaE9aTHg2UkRnWFZXMXBZMUVTZnJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Trump administration sends letter wiping out addiction, mental health grants - NPR",
    "description": "Trump administration sends letter wiping out addiction, mental health grants  NPRTrump Cuts $2 Billion in Federal Funding for Mental Health and Substance Abuse Services  The New York TimesNational Council Statement on Cuts by the Substance Abuse and Mental Health Services Administration  National Council for Mental WellbeingHHS terminates thousands of grants for substance use, mental health worth billions  Politico‘People will die’: Trump administration cancels up to $1.9bn for substance use and mental health  The Guardian",
    "published date": "Wed, 14 Jan 2026 14:50:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSGNDR3ZwamIwREVPRzBzbGRGTjZ1TlI1VnAxM2Zmai0wTVpEMkloUDA1dXBwbEp0NnE0YXhzS3VQZk90M2l3bnNaZ0JkQ0JKNXBTMFpCdGZob3Bkd05YLVJoNWNiYmtHX25LNlJxRExLWDRCOUpETjBfcWlTZmNYNGYwVWZzRlVPNl9uRUttdmozeWc3aFczRTRmMWNKZjUydmt0cXlYLXl1X0xMSndJOXFaT2J3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Congressional Bill S. 222 Signed into Law - The White House (.gov)",
    "description": "Congressional Bill S. 222 Signed into Law  The White House (.gov)Is Whole Milk Healthier for Kids?  The New York TimesTrump signs a law returning whole milk to school lunches  ABC NewsWatch live: Trump to sign bill allowing schools to serve whole milk  The HillThe Trump Administration Just Posted A Bizarre Photo Of The President That I Could Have Gone My Whole Life Without Seeing  Yahoo",
    "published date": "Wed, 14 Jan 2026 21:05:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQaEhGZ21rUG1ldGV3b0V5LUdob2xnODdGV1NBSzlZWG8xd2tSYnhiZk9fbFFpaUttQllRYUZ0aFNjX2lWTWd3TzlHaU1tc3dBcnEwZnFGcmVFQl9ZdDBlcGc2RUhEVHRBNVBSMFNpOFFDZGlIYm1xRzlfSlhkaUxpTVZMcmhmWnltQmg2STZLSzJTU2t2c2lLSUFsRFVwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.whitehouse.gov",
      "title": "The White House (.gov)"
    }
  },
  {
    "title": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it - BBC",
    "description": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it  BBCIs Starlink helping Iranians break internet blackout, and how does it work?  Al JazeeraUS lawmakers call on Donald Trump to restore internet access in Iran  The GuardianHow Iran switched off the internet  Financial TimesIran Is Hunting Down Starlink Users to Stop Protest Videos From Going Global  The Wall Street Journal",
    "published date": "Wed, 14 Jan 2026 18:15:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9kVzdfc2dNYUVCYkNwMHFkQUNFS2U1eFczeUFZbUNKTkVvZG9EWTViRG80aDFfdWxQSF9NbnozZzhvVzJvTFBGN1JCRXlSRzNCQjVfOVFGUDI0d9IBX0FVX3lxTE5RZlBSOVR5RVgxRjFZaFdGdVlvc2t1RjRPWHpUV3A3MmVfNEJWaFJlOFc3S0dMMVhnZEVZb0pzZzFhNzZpTmdQaTV4eGhRVnB2MThVUmNOOTdsREdsZDhv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations - U.S. Department of Education (.gov)",
    "description": "U.S. Department of Education’s Office for Civil Rights Initiates 18 Title IX Investigations  U.S. Department of Education (.gov)Federal investigation targets Champlain Valley School District over transgender athlete policy  WCAXTrump administration opens 18 new probes over trans athletes  The Washington PostUNR among schools under investigation for alleged Title IX violation  KOLO | 8 News NowTrump administration to investigate two Maine districts over transgender athlete policies  Portland Press Herald - Maine Sunday Telegram",
    "published date": "Wed, 14 Jan 2026 19:06:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNdG5QLWFpMVY5STZTZlktR0RKZVJFNVlST1Z3SU4tb2lLT2lLbmhXZS1Vdkw4em9FSTJpbzVXWEdxS2VwNEpiWlF2azc1S3BvTVRjQ2RZT0xFdndheTJub0FSbERweDRCTkJqSWFNdHk5VDlSTFczTUU2ZzdwU2I4YlYtR3JLcFQ1UDQ4OEVhUUY5bnNMNUs2ZXNORElXVE15S0c1SGRVMWFXZGFhQlhNS2UxczBiZWQ3RDhqejI4YmtMVngxOExr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ed.gov",
      "title": "U.S. Department of Education (.gov)"
    }
  },
  {
    "title": "White House defends Trump over middle-finger gesture at heckler - BBC",
    "description": "White House defends Trump over middle-finger gesture at heckler  BBCTrump makes obscene gesture, mouths expletive at Detroit factory heckler  The Washington PostSuspended Ford employee who heckled Trump sparks nearly $700,000 in GoFundMe donations  Business InsiderTrump flipped off an autoworker at a Ford plant. The White House says it’s ‘appropriate’  CNNA Ford worker called out Trump. The president flipped him off. Now, he’s been suspended.  Michigan Advance",
    "published date": "Wed, 14 Jan 2026 20:14:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE53Tjg4TUdsOFJLUmVSVUZtSkFuTi1YdkFXZ1FLa1dNY2ExTHFFYlR3ZVk2Sk9pWERtTDJ1S2o5UTFYb1cxOHBCdDJVYnpkRzFnalBRa00tdXdSUdIBX0FVX3lxTE9pX1oyWkFwVUNqLVo5NXJVYjNMWDUzMnQxMUVUMV9nb01EQm5DSEtLN2JYbVpfZUxMTWRvRWViakh2TEFfY2ZCWUdDTHpaMF9MTlhKRkRvUjQybFBVdTZv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota - CBS News",
    "description": "Woman describes \"desperate crying\" at facility after she was detained while following ICE agents in Minnesota  CBS NewsFormer federal officer weighs in on ICE actions in Minneapolis  CBS News‘I was flooded with fear’: Minnesotans describe their encounters with ICE, being detained  MPR News‘I heard screaming, I heard crying:’ Inside ICE detainment at the Whipple Building  Sahan JournalICE protester detained in Fort Snelling shares detention experience  5 EYEWITNESS NEWS",
    "published date": "Wed, 14 Jan 2026 17:53:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPT2tES2FpNWFwT0hNdDJGZzZEVG42TE5Xb1ByaGFoZ2oyYVlidzFfdjRTWWtKSmVuZjQyS3JtZ3RybmtKSGpzZ3VScTJXeGVpMjJmcHFRV2hGMXZmQlNiWUNXQkFJYk5uMVVsUW5WemdkMmNvWHotbDZqWklJcjlYREpRLTVnY1h50gGOAUFVX3lxTE5jNG5SdmNFaGNfenZsZGJGaFpYNkNobkpXaGdqNldsdlM4R2VCQ3FCZ21jMUVUVjVqazZDYTA0NFBGVDJ2OHVtMVlhS25vajdFVk1TaXo2NGl1NlNBY1pPdDdsendGMVU3YTlEMlFvZXNRWmxFQ29EVE1ITzNvTWotNENCR0pzRFhQX3pQZEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Brazilian au pair testifies against former employer and lover in double homicide case - ABC News",
    "description": "Brazilian au pair testifies against former employer and lover in double homicide case  ABC NewsAu pair testifies she flipped on Brendan Banfield because she felt guilty about the killings of his wife and another man  CNNAu pair's jailhouse letters before plea deal questioned in ex-lover's BDSM double-murder trial  NBC NewsAu pair testifies, says Virginia man stabbed wife, framed stranger  The Washington PostFormer Brazilian au pair testifies her ex-lover plotted to kill his wife, though lacks some details  AP News",
    "published date": "Wed, 14 Jan 2026 19:39:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxORWU5ODdpdTZSZGtHZVlUVGJFMlFId1RhOVh6OGU5TkdybVZMRFRlSTlVNEY2RTBBNmdyRXN2RE5jZWlkaUdUYzI4SVVHQzhTZlNGOXhucmNBMTFWVkw4NDI5dFBlSTFUQmRMNDdPYm4wT0hsdlBUYXRYZG1YSHJUb21qaGpUWlZzMDJhbHE5UkdvLTFGaGtZc1daVTVpQVZWM0oxatIBqgFBVV95cUxOZjJ5ZW1ObTFESW96c09iREVHVW9rYV95RHBseG1SZWxaM0hfak1ZYUhRelFVR3NaMFFILVFQcmJlWjZtbk8xbGxCSzFRX3BZaDVyRE5qZmk5Sms1T2cxNTFLUS1DTVJKb3VhZUc1OXdyU0Y1WVpZUmJvb25RRzFHVmdIemZpSWpEWWdlMFJUdHZLa3VwVTZwOXNHVUhKaVU2TlFlaEx0YWdVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Democratic lawmakers file articles of impeachment against Kristi Noem - The Guardian",
    "description": "Democratic lawmakers file articles of impeachment against Kristi Noem  The GuardianRep. John Larson joins effort to impeach DHS Sec. Kristi Noem  CT MirrorScoop: Over 50 House Democrats sign onto Kristi Noem articles of impeachment  AxiosDHS’ Noem faces new articles of impeachment backed by dozens of House Democrats  MS NOWNoem job approval slips to 36 percent: Survey  The Hill",
    "published date": "Wed, 14 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNHNuSEtZZWpSR1VxT2tNLWRuOGlfd19rejZOeU5UN25QYUdwTDlGVkFYekpEY05ZWVJORk8wSFlXd0Z1V1ktckkyVmxrbUFhbUU1aGp3MU1DWmZCQ3Z2eTBHdXdfOVNmczVUVjcyZ0xfSXRGRjhwd04xMVhUU2dJLUo3QmZ2NzdlMEY0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump Live Updates: Denmark and U.S. at Odds Over Greenland, Diplomat Says - The New York Times",
    "description": "Trump Live Updates: Denmark and U.S. at Odds Over Greenland, Diplomat Says  The New York TimesTrump faces Venezuela war powers vote as Danish official says there’s ‘disagreement’ over Greenland  CNNDenmark's & Greenland's Foreign Ministers Hold News Conference  C-SPANTrump Is Risking a Global Catastrophe  The AtlanticWhy Trump doesn’t need to own Greenland to build Golden Dome  Politico",
    "published date": "Wed, 14 Jan 2026 23:05:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTFBGNFJQNld6T19WUVVWVjJ0ZzVqdl9MQ2tRS0ZBanA3UTJ1dnhUdzJxUno4eV9YQU0teHdmR0c3M05vc1NmV19ZaDdYMDZhdGpZUEpUblJ1RjlYOHhPWkdnb3JuMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US announces start of phase two of Trump's Gaza peace plan - BBC",
    "description": "US announces start of phase two of Trump's Gaza peace plan  BBCPhase two of Gaza peace plan will be complicated, protracted and unpredictable  Sky NewsTrump: US notified that killing of Iran protesters has ceased, executions won’t take place  The Times of IsraelUS announces start of second phase of Gaza ceasefire  The GuardianTony Blair poised for role in Gaza governance  politico.eu",
    "published date": "Wed, 14 Jan 2026 18:37:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1fUnNNNmlKR290ZFhVS1lXSFl5NHFVdzlVdlh5Mk1uemVPNmlUOWluaHk4dU1CZmJhaWVYOVJ5TWFSckFGeHVPUFRubWVWNVFNZGd5WERHT3h0QdIBX0FVX3lxTE1ZdHpfdHIxTkhKMGRYQUh1WWYxSHJfZi15aDZVT1AxdGxhV1phSEVtbU1MaVkySk50S2tKZVc5QUI5bkc2VlhQVmx2UEtRaFRITXJQeGF4eXRzQ1g5djNF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Elon Musk bows to pressure over Grok creating sexualised AI images - Financial Times",
    "description": "Elon Musk bows to pressure over Grok creating sexualised AI images  Financial TimesGrok and the A.I. Porn Problem  The New YorkerMusk denies awareness of Grok sexual underage images as California AG launches probe  TechCrunchCalifornia launches investigation into child porn on Elon Musk’s AI site  Los Angeles TimesHe could just turn it off  Engadget",
    "published date": "Wed, 14 Jan 2026 20:43:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1oQkNMMk40QWg5QzlGTEZXNkRaT2thSVZfVWdQRHYxRFFidFFXd0F6dnNIUFp1aE5wbFJSeXo4QXk1WWNHQkNfeFV0SlJ3cVFrSGtJTGxaR0MyenJON2RveUJ1ajd0X3Zqd1lMVDVYZlY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "U.K. Retreats on Plan to Require ‘BritCard’ ID for Workers - The New York Times",
    "description": "U.K. Retreats on Plan to Require ‘BritCard’ ID for Workers  The New York TimesStarmer and Badenoch clash at PMQs over digital ID U-turn  BBCOnwards and sideways for Keir after another U-turn leaves him going nowhere | John Crace  The GuardianThe UK is watering down plans for mandatory digital ID cards after a backlash  ABC NewsUK drops plans for mandatory digital ID for workers in latest U-turn, media reports  Reuters",
    "published date": "Wed, 14 Jan 2026 14:21:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOQzRMS0ZEd1FiRlQ4dmcyaHRpQWl3ekNRdWJqenBreHBSN29PbENSamhWaVhjUE1yVHI3eWJOcFlib2JUekRsQnFMajVmT0Iza3FrODlkbGdkeG9qNGRKZ1dGOWp4N2x0QWRtczVRdVAyeE9oNjkyb2w4OXVXNEVpcg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "S&P 500 books back-to-back losses as tech sells off, Bank of America slides after earnings: Live updates - CNBC",
    "description": "S&P 500 books back-to-back losses as tech sells off, Bank of America slides after earnings: Live updates  CNBCStock Movers: Bank of America, Citigroup  Bloomberg.comStock Market Today: S&P 500 Slips After Bank Earnings; Gold, Silver Hit Records — Live Updates  The Wall Street JournalS&P 500 slumps as investors turn sour on tech; banks deliver mixed results By Investing.com  Investing.comStock futures are little changed after S&P 500, Dow slide for two straight sessions: Live updates  CNBC",
    "published date": "Wed, 14 Jan 2026 21:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE00Rk52cFUxbFF1THA4d3VTb2xRVGN0OU81LXBlZUR6ci1CcnN3NHFDd2F4bTRvVFNUTlV6Q3RHYlVmb19WSkdJSVZwZE9FSlItaXlHWmJjblk0VFFvbmxuRUpoRmtKcE9vd0JuTG4tQXJQUjNRRDlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Trump’s Credit Card Threat Casts Shadow Over Wall Street’s Profit Parade - Bloomberg.com",
    "description": "Trump’s Credit Card Threat Casts Shadow Over Wall Street’s Profit Parade  Bloomberg.comDo markets price a Trump risk premium?  Robin J Brooks | SubstackWall Street gets hit with Trump's \"flood the zone\" policy fire hose  Axios'Going to be wild': Investors brace themselves for 'market-moving' chaos from Trump  AlternetWhen 'TACO' becomes 'Big MAC,' how does Wall Street seek a safe haven amid policy 'chaos' on the eve of midterm elections?  富途牛牛",
    "published date": "Wed, 14 Jan 2026 17:41:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPS0RQMWt1MVQ2TTJzOUVWQkRLQ0FzZWhVQUlVSUVTYXJqUThmaEQxTG13bUpmZGFOaEhXR3hHMGY0WHBKUUwzTGJWcXRKc1lxVGZHVkozZDdsSi1CZ3ktZDg4SF9Na3JKZGxhU3JVOGRxSi1TTkM1YW1fNjc5THgxYlNCUHhIWC1PcVp6WjNfcjhNTzZCOWNNRUFBOGxSMHc5WHJBZmczVTBINi1qWXZvaG9Icw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  },
  {
    "title": "Wells Fargo misses profit estimates on severance costs, shares fall - Reuters",
    "description": "Wells Fargo misses profit estimates on severance costs, shares fall  ReutersWells Fargo Shares Fall Most in Six Months After Profit Miss  Yahoo FinanceWells Fargo Stock Slides After Income Misses Forecasts  The Wall Street JournalWells Fargo Reports Fourth Quarter 2025 Financial Results  wellsfargo.comWells Fargo’s profits hit by severance costs as bank lays off 5,600 workers  New York Post",
    "published date": "Wed, 14 Jan 2026 16:39:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNZHpfLV9XY0pDdEZEOHNxTjJabUJ6c0c4RVFlZEFsZmlta2I0cVpjd2FrZTJNcENWZm1ZR3M2YU85aWtPMnhvRlpsdWFKem1FdjFDellUT2p4eW1rYXlyMEo1MDg1Smwwd1B6c1ZJMHh1Yk9TV09YbkZxdGlVNXE4SnVOc0VfTno0anNFTGhEcEcwa2JFa1ZBOFkwRGI4VWF6QVhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "NAR Existing-Home Sales Report Shows 5.1% Increase in December - National Association of REALTORS®",
    "description": "NAR Existing-Home Sales Report Shows 5.1% Increase in December  National Association of REALTORS®Existing home sales end 2025 with a strong beat, as prices ease further  CNBCHere’s how the housing market can rebound from one of its worst years in decades  MarketWatchUS Home Resales Climb to Strongest Pace Since 2023  Bloomberg.com2025 home sales hit fresh low as the American Dream stays elusive  USA Today",
    "published date": "Wed, 14 Jan 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPRXlUQ1JWUkItZnpjT2hodzRiRmNsaVZiMDN1dFNoNVd4MlFLdTdadkV3ZmJOdHJfR1hwYWduY3FPOWNPWFFKczFnUGw5Yjc3QmNJbUo5amNrSXpMQV9RWmh2bFJjNnd2MHFjNEMwYmR5TUJacWMzSWRUaFhUNzF1bWNlWTBXc054RHYyLUNkRTVwS002dlR3NUZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nar.realtor",
      "title": "National Association of REALTORS®"
    }
  },
  {
    "title": "Nvidia’s new app update includes DLSS 4.5 and more Control Panel features - The Verge",
    "description": "Nvidia’s new app update includes DLSS 4.5 and more Control Panel features  The VergeNVIDIA App Update Adds DLSS 4.5 Super Resolution & New GeForce Game Ready Driver  NVIDIANVIDIA rolls out DLSS 4.5 to all RTX GPUs  EngadgetGamers Find That Nvidia's DLSS 4.5 Can Upscale 240p Pixel Junk, Make It Playable  PCMagNvidia Proves It Still Has the Best Software for Better-Looking Games  Gizmodo",
    "published date": "Wed, 14 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdzAxbUlKYWhUX1lwRGZ3dnRsSUdVRlBjQi03WTdtSHFYV2VYOHFIY2kyR1hzbTE2YzB3SFVHVXhWeklwTFRWdnVobXZreVpOcW94dXlfVUlvNzV2dVFzSjdPQkdkVEphYVNVZGZyRVlyZHhzNWM1ZEYyZElMU0U0X0pjVFVaS09Rd1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theverge.com",
      "title": "The Verge"
    }
  },
  {
    "title": "Apple's Foldable iPhone Rumored to Be Built With Liquid Metal and Improved Titanium - MacRumors",
    "description": "Apple's Foldable iPhone Rumored to Be Built With Liquid Metal and Improved Titanium  MacRumorsiPhone Fold's titanium & Liquid Metal rumors just won't go away  AppleInsiderSamsung just solved the foldable crease, but Apple's solution might be different  PhoneArenaA case maker might have leaked the iPhone Fold design  MacworldApple eyes Samsung Display technology for brighter, slimmer foldable iPhone  varindia.com",
    "published date": "Wed, 14 Jan 2026 15:30:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNVldRb2R0RzMyd2t1bzdFaU9vNFBteVBqTzVFcnJZeDF6cTF4aG9zNUYtMEVSLWFiX1V6TmtTRURCUnY2N1Y5RDlEeGFqbUlJekdSUHY4Nm9PcGZfTlVFUERQSDlGTWpicGFnNDdObmNxYnZpYURCaHNuZ3pTTkJ3amRjRVpjczJJcTZN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.macrumors.com",
      "title": "MacRumors"
    }
  },
  {
    "title": "Leaker details iPhone 18 lineup screen sizes, Dynamic Island plans - 9to5Mac",
    "description": "Leaker details iPhone 18 lineup screen sizes, Dynamic Island plans  9to5MacNew Leak Reveals iPhone 18 Pro Display Sizes, Under-Screen Face ID, and More  MacRumorsiPhone 18 Display Sizes Shared By Tipster, Claims All Models Are In The Prototype Production Phase, With The ‘Pro’ Models Being Tested With Under-Display Face ID  WccftechIs Apple changing the iPhone in 2026? Latest rumors and leaks explained  The Economic TimesiPhone 18 design won't change much, except for Dynamic Island  AppleInsider",
    "published date": "Wed, 14 Jan 2026 14:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNVTBFWDc1MWF6dENkZnQxRlFCcTU5RTgyeXhGUFhTZXFKazZ3SkdnSzlfOU5fd3Q4aUtMdFFZTldkUnlVdkZPLVRLNTQwWmtQRHEzVXh6dUVsU1hMUVI0OGRLcjJiWUp6VlVjM0tjZ2dUSFV3SzRDanhnNGJtb0w0eUdqSFYzanBfTHFKeUd0bmx6aTkwWmZ1bFdnSExIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://9to5mac.com",
      "title": "9to5Mac"
    }
  },
  {
    "title": "A single click mounted a covert, multistage attack against Copilot - Ars Technica",
    "description": "A single click mounted a covert, multistage attack against Copilot  Ars TechnicaReprompt attack hijacked Microsoft Copilot sessions for data theft  BleepingComputerNew One-Click Microsoft Copilot Vulnerability Grants Attackers Undetected Access to Sensitive Data  Cyber Security NewsYour Copilot data can be hijacked with a single click - here's how  ZDNETMicrosoft Copilot Reprompt exploit allowed attackers to steal your AI data  Windows Central",
    "published date": "Wed, 14 Jan 2026 22:03:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNcy1mVENKRnlKWU9rN1hTUXAtd080YTlyLXpMRE1PMjlFVWhnejgweE00Rm1xTVh3VldDUmdHb1cyY2dIX3ZNMGZEOWZXbTlpc1ZGUzNZZElhRE5IR1RnV1lNcEt5RGhzWUFYclBXRUpCR2VlMjUzRWJCelF4akhJbFJBNVpMNXcyclVZbjFEQXlFQlBOenNfNTB4S2FDdGdiSVlYX3d1dWVqeWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  },
  {
    "title": "Jonathan Bailey and Ariana Grande to Star in Sunday in the Park With George in London - TheaterMania",
    "description": "Jonathan Bailey and Ariana Grande to Star in Sunday in the Park With George in London  TheaterManiaAriana Grande will reunite with ‘Wicked’ costar Jonathan Bailey for ‘Sunday in the Park with George’  CNNAriana Grande and Jonathan Bailey to Star in ‘Sunday in the Park With George’ Revival in London  VarietyWicked's Ariana Grande and Jonathan Bailey set for theatre reunion  BBCLook, Ariana Grande and Jonathan Bailey Are Making a Hat  Vulture",
    "published date": "Wed, 14 Jan 2026 16:59:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOQ0YyTnd6YWJJQjZ3QjZvbjdrUXpQX28ydHVVYTBCYnJyX2JqdENpX2JaejlJcHdPbDhocjZ0czNhYm9ZMGREOFIyc09PbTgxb3VSQlFnX3pPcVRIdWtrN2cxNS1QdlhQRjBTVVZ3VXEwOVgxNjdMejIyc2ZVMDNwazY3NnhxU0FRck4zcXQ5aXhmd2F3NHQxNTFsX28zb1BuU2ZuMWlBSU5qNGtidzNjcnFxZEhlV3RBTzI5X3Z4ZHVrTjYzS1pN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theatermania.com",
      "title": "TheaterMania"
    }
  },
  {
    "title": "Darth Vader and Other Original Trilogy Updates Coming to Star Wars: Galaxy’s Edge at Disneyland - StarWars.com",
    "description": "Darth Vader and Other Original Trilogy Updates Coming to Star Wars: Galaxy’s Edge at Disneyland  StarWars.comStar Wars: Galaxy’s Edge Timeline Soon Expands at Disneyland  Disney Parks BlogGalaxy’s Edge Will Soon Cover All Eras of ‘Star Wars’  GizmodoDisney Will Bring the Original Star Wars Trilogy to Disneyland in Theme Park Pivot  The Hollywood ReporterDisneyland is pivoting on ‘Star Wars’ Land. Here’s why  Los Angeles Times",
    "published date": "Wed, 14 Jan 2026 17:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBiSkNWUHd4TFRjZ1J2X3RodDZ3ZTJ4SXZmU3lkYzM2VmFlZE05ZjJXREowYldFWVVZRkhsVWZHWDRzbWt0dkwtY1JBQm1ZY1VaY1hZUnNEZkROYWNGWXFiS1JCNGIxLUdKTzJnZGd5MkVZd2o1MnYzUjN3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.starwars.com",
      "title": "StarWars.com"
    }
  },
  {
    "title": "Zoe Saldaña is now the highest-grossing actor of all time - NBC News",
    "description": "Zoe Saldaña is now the highest-grossing actor of all time  NBC NewsZoe Saldaña becomes the highest-grossing actor of all time  Los Angeles TimesThis actor just dethroned Scarlett Johansson as the highest-grossing movie star at the box office  YahooZoe Saldaña Becomes Highest-Grossing Actor of All Time With ‘Avatar: Fire and Ash’  VarietyZoe Saldaña becomes highest-grossing actor of all time  The Guardian",
    "published date": "Wed, 14 Jan 2026 16:38:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOR2FVZ19CSnRZMHZtWnBwWXJNZkVrdXF2TlhxNEZadW5zRTdsemVGb0RqUzVOMHJpVU1qVjVDRzlfZjFXMHpJcVhsMzVNLXRoWEh2akx4Yjc5S2FNbmZRd1lCZFdFc0gyMWFSemtfSzBpU25RczFkUzNheWFBZ0htTjJ2djA4WWlyVmxMb0tzeE9vWFkzNG94ZnBVcVJweV960gFWQVVfeXFMTmNpUThmM0tVaFhhcGdKX0xYQ0l1NnVabzdPUS1TcnlzbTlpWG9FQllZbFdDM1gzQ2pNNTRUUTZZeU9sUkF3TmRkdFpOTmRRWk5jeDg5V3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Inside an Exploding Marriage: Belle Burden in Her Own Words - The New York Times",
    "description": "Inside an Exploding Marriage: Belle Burden in Her Own Words  The New York TimesHer Life Was an Old-Money Dream. It Collapsed in a Moment.  The New York TimesNew York heiress Belle Burden recounts the voicemail that torched her husband’s double life: memoir  Fox NewsHow well do you know the person lying next to you in bed?  The EconomistThey were happily married for 20 years. Then he left her out of the blue  The Telegraph",
    "published date": "Wed, 14 Jan 2026 10:09:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPczJvTWRrdjNCZFhFVEEyS2ttMDVPUDZqVmV0OUZMVzhPRkxLRVZmbkp6cjdMamt6dzR2N2NHdWxCMGhRbGVuRjBvTmtFNFVJRDdLVTlWeWJCSVhNTEg4ZjZTeGptamRxRzRXVWRqaW5vU2xjQnJ0eFVwRFlTQWVCaU92VVdTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Report: Harrison-Nunes UFC 324 title clash ppd. - ESPN",
    "description": "Report: Harrison-Nunes UFC 324 title clash ppd.  ESPN'Biggest women's MMA fight ever' is postponed: Harrison has surgery to repair herniated discs in her neck  Eagle-TribuneFive Amanda Nunes Fights To Watch Before UFC 324  UFC.comUFC 324 fight card: Kayla Harrison vs. Amanda Nunes postponed due to injury  CBS SportsKayla Harrison off UFC 324 due to neck injury, Amanda Nunes fight postponed  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 18:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORUQ2RGRENC02cHVVazAyNnM3Vm5LcC1LR2ZvX3RxTWs4NDBDeHZuQjlMY0FidjlOZVNKV3c5VjJSajdrTF9DbHVXSXRPTFNsM2hmWlJjdU1RX3R4ODBhWHBWaWxqUnAzUnU0WUNicUV4czVQTURpTU9TNk51QVdtNXdBUExLb0dPNEg3aE00WjYtYnNNbk9qWUlwYmh5dDd0dnR0STF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "LA 2028 Olympics open ticket raffle - with seats starting at $28 - BBC",
    "description": "LA 2028 Olympics open ticket raffle - with seats starting at $28  BBC2028 Los Angeles Olympics tickets draw registration opens. Here's what you need to know  ABC7 Los AngelesLA28 Olympics ticket update: Registration opens and ticket-buying windows announced  Los Angeles TimesL.A. Olympics ticket lottery opens today. Here’s what to know — and what comes next  San Francisco ChronicleRegistration for tickets to the 2028 Olympics begins today. Here's what you need to do  LAist",
    "published date": "Wed, 14 Jan 2026 15:30:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1PamdHSmVJQUFOQk5VQmowbHZtb0xjcU9VQW91UTVKT2N3U2JtdDBuN3VUTEkzYXBrQXlLTTg4MGU0SDdEZzNhY2tBYjZrRjVxYUxMVDBzbExxZ9IBX0FVX3lxTFBNMEZ4NTM1SGlZRmtOdngtR3lNMFJhM0hRVWlHMndsaEloRG16dTQ0c1hOSGo5eWExcUprYi1UUUZtVVA5aUdJNzJudk0yRzU2bGY3UHpSUk4tMjhCdHRj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "NFL divisional round confidence picks: Chicago can upset Los Angeles - The New York Times",
    "description": "NFL divisional round confidence picks: Chicago can upset Los Angeles  The New York TimesBears counting on DE Montez Sweat to even out fight vs. Rams' offensive weapons  Chicago Sun-TimesHow to watch, listen to, stream Bears-Rams Divisional Round playoff game  Chicago Bears Official WebsiteNFL picks: Rams vs. Bears among best spread bets for Divisional Round  CBS SportsRams must blow out Bears to avoid dumbest playoff elimination possible  Yahoo Sports",
    "published date": "Wed, 14 Jan 2026 15:07:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQN1IxZFNNQ2FsUTF6M1F5VFNxSVl4ZlExYnZiRmlFLXdLWHVGS05PR2pWUnJNaDJhTlRBUU1wc21oSzMzWld6VWRSSXFuVHRCSEhsRnY3cUZyX25xRG11ZURTaEVOR2R4ZDBuQ3d1M2dEUl9vS1htUHZnRXFNRHVjcEdVZF95UE56VDVpVFhmcjQzMGh1ZnJzdEQ3QU5UNnYyYnpJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Tim McGraw to headline entertainment for 2026 NHL Stadium Series in Tampa - NHL.com",
    "description": "Tim McGraw to headline entertainment for 2026 NHL Stadium Series in Tampa  NHL.comTim McGraw to headline Tampa Bay Lightning’s outdoor game at Raymond James Stadium  FOX 13 Tampa BayWhy there will be ice in Florida for Tim McGraw's first 2026 concert  YahooNHL unveils climate-controlled rink plans for 2026 Stadium Series in Tampa  WFLATim McGraw to perform at Tampa Bay Lightning’s Raymond James Stadium game  Tampa Bay Times",
    "published date": "Wed, 14 Jan 2026 14:04:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPdWxUdlNQMTZrajI0ZC1Nc1RjUFI2RVROT2R2WUstQjFXWDZpWTlEeC1EVWNxUUFKWHhEcHpTanp5cHBkZnZmczhJX2dFZS1rZVhpUFRwZDRScC1kMkMxRGhjLXZ1OFpNX2dVYVFIXzFmM01vS05UdlhSN2JaNXNlalBaR2huMGdoVEVoOFdKeGVCM0Y1Q0QtX00xcWNaeWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "ISS astronaut medical evacuation latest news: Crew-11 astronauts now returning to Earth - Space",
    "description": "ISS astronaut medical evacuation latest news: Crew-11 astronauts now returning to Earth  Space4 astronauts to depart ISS, leaving behind just 3 crewmates to staff the orbiting lab  CNNNASA to Provide Live Coverage of Crew-11 Return, Splashdown  NASA (.gov)NASA to Begin Space Station Medical Evacuation: Video and What to Know  The New York TimesCrew-11 to undock from ISS with astronaut who suffered medical issue  Spectrum News 13",
    "published date": "Wed, 14 Jan 2026 22:40:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxORVN3TUt6TVJjZVBic3JkUU1FUWsyN0NwQWRaUHNRT1pvclpRM3lsMjF4QzlOY2plZ0M2Q0R0cEFubHdJQlFPRUJvRm1lLW9mTFEwaXJtUEZZODhuZHh6NnVXZlYwVkxLV1ItamVDTWVTU2ZRRmlpRzJpTmhLQU1OWTNfMmdOdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Researchers solve mystery of universe's 'little red dots' - Phys.org",
    "description": "Researchers solve mystery of universe's 'little red dots'  Phys.orgLittle red dots as young supermassive black holes in dense ionized cocoons  NatureJames Webb Space Telescope's mysterious 'little red dots' may be black holes in disguise  SpaceBlack hole butterflies? James Webb telescope spots dozens of black hole 'cocoons' in early universe.  Live ScienceLittle red dots in other galaxies may be black holes wrapped in gas-cloud cocoons  Scimex",
    "published date": "Wed, 14 Jan 2026 17:40:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBYM05nX2JQcFhkOGs1T19mYjlQY1pIZ0tBQ1A1U0RDUm1nX2t2NFE0YWdfZ3pteTN4aEcwLXN4OGZLZm9ZdTdUdjRmRGI0c1J5TlFIOTJNcm03TXItUWhxS3lYNkV4dkhYVjFHTw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "Mega-iceberg A23a, formerly the world's largest, turns into bright 'blue mush' as it finally dies after 40 years at sea - Live Science",
    "description": "Mega-iceberg A23a, formerly the world's largest, turns into bright 'blue mush' as it finally dies after 40 years at sea  Live ScienceWhy is this infamous iceberg turning blue?  Popular ScienceMeltwater Turns Iceberg A-23A Blue  NASA Science (.gov)40-Year-Old Iceberg Turns Vivid Blue as It Approaches Total Disintegration  ScienceAlertMassive iconic iceberg turns blue and is \"on the verge of complete disintegration,\" NASA says  CBS News",
    "published date": "Tue, 13 Jan 2026 17:35:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNUHZvSlAxSUQ1Qk1sdkJ5QmtuYVg0VEJLaVNNLVM4LUNpXzduR1VGd0tqdjNvbnlYQkExSGt0b1ZQamlaUFRYVXVxVzdRd1JoMGpQek9UcGpienBxeGFrUGNFbnNqUDhta3E0bm9tQVZRS044YlZsUmZmNE1MaG9RXy1qMk15R2pyOE01dnU5dy0yVUxBN05nVllZZG03bEhvREx2WHdQWExOSVhhQVZuc3pMVUZlRkFKdVI1bTBxUWlObUxiamdFOWxocUJCell3eGFoMnNvM2o2ZDQtLXQwRzMxV0cwa2gzWm9PQzkwTWFGUkZ0aHl4NHNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "NASA’s Webb Delivers Unprecedented Look Into Heart of Circinus Galaxy - NASA Science (.gov)",
    "description": "NASA’s Webb Delivers Unprecedented Look Into Heart of Circinus Galaxy  NASA Science (.gov)JWST interferometric imaging reveals the dusty torus obscuring the supermassive black hole of Circinus galaxy  NatureWebb Space Telescope’s Special Aperture Turns One Sensor Into Seven  PetaPixelWebb Telescope Exposes Hidden Secrets of the Circinus Galaxy’s Black Hole  The Daily GalaxyWebb telescope zooms in on a black hole's messy feeding zone  Mashable",
    "published date": "Tue, 13 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNRHJHcUdmUkdNMnhQODhsMGtPQVd6RFJFQW5FSnZDRDJNSDJiRkRUZmd2MDgta2NqdFRIWjJkeWtDR1lkRVp4WGtkT1VNLVdBc0x1ekVYY1FyNVlBd0ktdE9sc3JyRU9ldmktM0ZsSXlRVDMwRmRLS3hqVk1HdTdUUFFXMWZ2WUtSOFJHSEYzamplbXpsR0UxWGFrYmF1d0dsa1hEeUVPRlpsQXZ4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://science.nasa.gov",
      "title": "NASA Science (.gov)"
    }
  },
  {
    "title": "Health secretary RFK Jr appoints two vaccine skeptics to CDC advisory panel - The Guardian",
    "description": "Health secretary RFK Jr appoints two vaccine skeptics to CDC advisory panel  The GuardianKennedy adds vaccine advisory panel members with histories of opposition to vaccines, antidepressants in pregnancy  NBC NewsNew RFK Jr. pick for vaccine panel: ‘I was not anti-vaccine. I am now.’  The Washington PostSecretary Kennedy Appoints Two OB-GYNs to CDC’s Advisory Committee on Immunization Practices  HHS.govRFK Jr. taps new members, including self-described ‘anti-vaxxer,’ for advisory panel  The Hill",
    "published date": "Wed, 14 Jan 2026 17:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOZlRlaXpVOFozVWlTUUFNdDBXbklKVmRtdFpfVUtTZWJOVGQ4dGZiSWtlV3Zlb1BLemtaeWdyTlJkbnU0SmVyWkpVR0xuNkhsN1Y4WllkTVJxbHNvSlNvUjFqVDMtb0xxY1ZrSXVGOEpTdnp2b2xhblZZQmEwWjF6SjB2Uno?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Massive brain study reveals why memory loss can suddenly speed up with age - ScienceDaily",
    "description": "Massive brain study reveals why memory loss can suddenly speed up with age  ScienceDailyHow Structural Brain Changes Are Tied to Memory Decline  Technology NetworksMega-Analysis Shows Why Memory Declines With Age  ScienceBlog.comThe Sad Reason It’s Getting Harder & Harder To Remember Simple Things, According To Psychology  YourTangoMemory loss can suddenly speed up with age: Study  lokmattimes.com",
    "published date": "Wed, 14 Jan 2026 14:56:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE0zVk5WUUIxZlNZY1R4VGJrbHE3aTRRZkg4dHR1MlI4TEtweVR2QWtkNENpQTBpRjNWSmVnUG1INkZ0RUk5UkJMaUNQbVBxbU1fYThkVWFsUlRkeUY5dG5UdmNraFI2NVEzT1ctLTVUNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencedaily.com",
      "title": "ScienceDaily"
    }
  },
  {
    "title": "Patches of low vaccination in the US are becoming bigger, riskier holes - CNN",
    "description": "Patches of low vaccination in the US are becoming bigger, riskier holes  CNNNonmedical Childhood Vaccination Exemptions Are Climbing  MedPage TodayEarly Vaccine Delays Raise Risk of Missed MMR Dose  European Medical JournalRising Vaccine Refusals in US Children Increase Measles Risk  БуквиTruveta Study Links Early Childhood Vaccine Delays to Lower Measles Immunization, Highlighting Strength of Its Health Data Platform  TipRanks",
    "published date": "Wed, 14 Jan 2026 17:33:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZVplRzZNMjRhQi12ZndfLWx3V001YlFnSWJjZWg5b1k2R1RRd0hJY2U3UHFTNk1iWmhLT19VS2RrNENkdC1MNzlyZHJiQVVYMUxnSmJ4M3BvUHdSUGd0WXlkRkRPQ3FEN3hvNkVYV1BrcGFidFhxRzRNd2w5dWJXMll6Tm1Tb1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Medical Groups Will Try to Block Childhood Vaccine Recommendations - The New York Times",
    "description": "Medical Groups Will Try to Block Childhood Vaccine Recommendations  The New York TimesHealth officials slash the number of vaccines recommended for all kids  NPRCDC Acts on Presidential Memorandum to Update Childhood Immunization Schedule  HHS.govRFK Jr.’s theories about vaccines are about to be tested  PoliticoNew CDC Guidance Could Revive a Rare but Deadly Disease  MedPage Today",
    "published date": "Tue, 13 Jan 2026 16:13:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPcmQ0ZHdmdVlLOTBhTW1aTWJYR2dBdDh2VGt3d3Rob2Vnd2Zac0hjVTVfc3FiQnBhMTlzWFVqQTJKR3FHa2VxQ2xPY3pINkJ2a2s1Zzh1eTRWRkxvT2YtQlc1UkxlMUpMSl8tQjVHS1lpVU9qamZsSTFzLVQtcFVHck1pRkZ4QVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  }
]