[
  {
    "title": "Government considers removing Andrew from royal line of succession - BBC",
    "description": "Government considers removing Andrew from royal line of succession  BBC‘The photo gods were on my side.’ How that astonishing image of Andrew was captured  CNNWhat Former Prince Andrew's Arrest Says About the Royal Family: 'It's the Stuff of Nightmares'  Rolling StoneHow Former Prince Andrew’s Trade-Envoy Role Sowed the Seeds of His Downfall  The Wall Street JournalAndrew Mountbatten-Windsor's ex-wife 'Fergie' also undone by Epstein ties  Reuters",
    "published date": "Sat, 21 Feb 2026 10:09:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1xY3MwVzZQWWwyeU9GYnA2eE1Ea1BZUUdrYzcxdXJhRzFhdGFwNHZJN1F3TExsVmhDTUFVbjVfNUwwaGxOV2lNWHpyRmdDWW5LR3kweXY4TXQ4Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "India signs critical minerals deal with Brazil to curb dependance on China - Al Jazeera",
    "description": "India signs critical minerals deal with Brazil to curb dependance on China  Al JazeeraIndia, Brazil sign mining pact as Modi targets $20 billion trade in five years  ReutersPresident Lula interview: 'As two of the world’s largest democracies and dynamic economies, India and Brazil cannot remain distant'  The HinduBrazil, India Seal Rare Earth Deal Amid Global Supply Strains  Bloomberg.comIn India, Lula Puts Middle-Power Diplomacy on Display  Foreign Policy",
    "published date": "Sat, 21 Feb 2026 11:32:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQbWcxRFFOWUJvOE80Q3d3cS1NZzNBb2lwMUY5MTlKZFo3MmlvTEdXeUpWb3BtMUNPWFJvMHFCdlpBNFJzLVFvTGJrcW5lZkg2Z3VpZnJPT2pBakkxT2VsTlFvcUNfYklTYjdjUzdweS1oWEpSNzc1YURXczU4bWRWTjh3VVhIOWcybjNRbmoyRDNuX05uNndhMnIxTnNuaFI4MGZVZktaa0xNNmRmb1dGUNIBtgFBVV95cUxOQ0NXSVg3V2VWSVBNOHlIb3BfTDNmME0xWWpyNS1vNlFqLXpKVnZYY3BtNm1xWE5HcmxXbG1ZbEJfaUJwRVNHUjVSTFdSYXg3WWJMZ05uNGJTcHBsSXFsbElaWjhmTExtMDBRTlN3dVplOFg2Y0lFcWZEbm45SjktckxaLTVJZ3FpMzQxNzY1WDNvOS1wd044LXVzUjRpcV9TYnBoTFR1YndFcHZhSk14UDF5ajdMdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine - NPR",
    "description": "'Given a gun and sent to die': Kenyans lured to fight for Russia in Ukraine  NPROver 1,000 Kenyans recruited to fight for Russia in Ukraine, report says  ReutersOver 1,000 Kenyans enlisted to fight in Russia-Ukraine war, report says  BBCAs war losses near 2 million, Russia accused of trafficking foreign recruits from Africa, Asia  Fox NewsKenyan families demand return of loved ones recruited into Russian army  Al Jazeera",
    "published date": "Sat, 21 Feb 2026 11:20:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE8yNEM2ckMtdFlsbC1QVmlQV1EtUFFBUGJyTlZRWFllUjZQU2ZkT25QejNvZDhOU2tTaWlpTFNSX3VJTXhNZUFyVFV2bklUZlRFUS02YVpOWDcyb2pteXZ0OEc1Sk1pQkppWXBkOHVjdHRWcENnd0E3Tw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Chaos, confusion and $200 billion dreams: What I saw at India’s AI summit - CNBC",
    "description": "Chaos, confusion and $200 billion dreams: What I saw at India’s AI summit  CNBCAt A.I. Summit, India Tries to Find a Way Between the U.S. and China  The New York TimesAI hit: India hungry to harness US tech giants’ technology at Delhi summit  The GuardianThe flaws in India’s AI plans  The EconomistIndia’s AI summit draws global leaders, big pledges and some chaos  NBC News",
    "published date": "Sat, 21 Feb 2026 08:50:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5Hb2p3em1Pbmt6Rm1PN09hSW0yU3JaelU2UXE2bVFPazRnaGJ2MTlEYTUzdmVLRllRU0pMa2xiRlE3eEFfc1ZuQ3NBUFNZY01hVGRuZmxoOFZ0YWVWWmFkZ0JkRWpiSjdC0gFuQVVfeXFMTlJEcjViTXd4V1pCYmJ1ZXBvS2xLUHdWWW1Ld0JPSElLNVlBVnlVSG1WRXVkdUFZbklBQVUxUG1rMEdERE1BTElvZzZMRDhJUnN6aW0zVzFDU3NOZVhCb0JjTGxVRnkwZWlxQ1I5RHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Live: Macron calls for ‘calm’ as tribute rally for slain far-right activist begins in Lyon - France 24",
    "description": "Live: Macron calls for ‘calm’ as tribute rally for slain far-right activist begins in Lyon  France 24Death of far-right activist in France sends tensions soaring and draws US criticism  CNNHundreds march in Lyon to protest far-right activist's killing as Macron urges calm  WRALKilling of nationalist student leaves French far left in deep trouble as elections loom  BBCFrance's Macron calls for calm ahead of march for far-right activist killed last week  Reuters",
    "published date": "Sat, 21 Feb 2026 07:56:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOcUowNWZONVRaWVl0RDhLZ0ZlSHh3Slc2Vlp1R2xqTHBLM29DSlphaVdpTFI3MXVtOENBazN4SWJhQnZnVmlaZU9EMmRXTTVRSHowXzg2RldBaG1rNEhjdnBYRDJaY1pUaVZ1X3JvbWpEM2sySGFlMllrOFJjcnA5MzZtYl9CWTltcHhSOEVLeEVVaWNINnl6YV9rcnlIM2pxaEUwMllPSGE5UmxUSTBwLWd6cUlVRDZwYXZSOElxV2RQRXNE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.france24.com",
      "title": "France 24"
    }
  },
  {
    "title": "Four years on, Russia is still paying for a fatal miscalculation in Ukraine - CNN",
    "description": "Four years on, Russia is still paying for a fatal miscalculation in Ukraine  CNNCivilians to soldiers: how four years of war has changed ordinary Ukrainians  BBCFour years after Russian invasion, Ukrainians around Philadelphia are thankful for support, wary of future  Inquirer.comHow a four-year onslaught has changed Ukraine  The EconomistWhere is the Russia-Ukraine conflict headed? These charts tell a grim story  The Globe and Mail",
    "published date": "Sat, 21 Feb 2026 09:00:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5JTlFyNEFBMkYyTkE1bkRYc3R0T2FTTHRnTmpCSXVmMWVGOHlFaDFaVVc0MWFhZWJEZTZ5NllTUTZDck5xMnk3X09QSEg1bUYwZ19sbUZZZTZ2ZzJYWllFcDhxTkJmZWh1Z0N2bWd3Nm5HaXRaVWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "5 NATO allies agree to produce low-cost drones - politico.eu",
    "description": "5 NATO allies agree to produce low-cost drones  politico.eu5 European allies pledge millions to build cheap drone defenses with Ukrainian know-how  PBSUK agrees drone defence plan with four EU allies  BBCUK and European allies to develop low-cost air defence weapons, UK says  ReutersE5 defence ministers in Krakow say 'Europe has woken up'  Euronews.com",
    "published date": "Fri, 20 Feb 2026 13:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPc0JyZkx3a3kwVVZzYnBNekhIaGluZ0NVbzUyYkxJREVBSEdZOF9QeHZacnZpZ0JfMk1icDlDSFpkeWh6Y0dMN1huR3kzZmpaX3ViSXNDMDA2c3pDY0ViM1JVdHJHeWNMbWktbWY3VzdUT1Z4SGhrUkU0cEkxY0ZoRmZPQ2xPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Trump's Board of Peace painted a rosy picture of Gaza's future. On the ground, there is only despair - AP News",
    "description": "Trump's Board of Peace painted a rosy picture of Gaza's future. On the ground, there is only despair  AP NewsFrance says surprised by European Commission presence at Board of Peace  ReutersTrump gets his Board of Peace, even as bigger countries steer clear  PoliticoStephen Colbert Balks at Trump’s Board of Peace  The New York TimesTrump's Ambitious Gaza Vision Is About to Hit the Gaping Chasm of Reality  Haaretz",
    "published date": "Fri, 20 Feb 2026 17:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPODVrUTNtTEplVGJkYnBPeWFQcHpkRVhEMjcxVXlicHpyOE1ReWRBRG12V1VzMEtLN2xLTW1OeHZKVFpzTktlM05UTEZoSXZtNWQ0ckpna1hRdFNmZFBGcHlwSzM2UjNQN1NMMTRyYmo5VUNsLW5fQk5idGg3LTRDWXY4R1hzbW8xRnZIanpXVXhhWnNQZVE5eFNDV2k4RUI5blYxVmtzZ0VpSTB2bVkzRW42TDM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "description": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey  USA TodayViral monkey Punch rejected by mother given stuffed orangutan  BBCMeet Punch: The abandoned monkey taking the internet by storm  Euronews.comAbandoned baby monkey finds comfort in stuffed orangutan, charming zoo visitors  ReutersAfter lonely baby monkey goes viral, his IKEA comfort toy sells out  The Washington Post",
    "published date": "Fri, 20 Feb 2026 20:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPWnJyNTRCYmhDTmJjNE1nLWQ4QUwtSTk2YW54dllMZzZJMmNOWHk5WEJVSWxXcFFSOVZNWlZab0NJcVgyX3huQjRRWDhkLXE4dGdLY1VPVlhBZXR5eHpFamdsRE9uMDlBb3ZnVFdhUFF6YWNsc3J6Q1V1b01FLXBmRGVPNU9kbW8xZjJjT094MXdBLS05VUdYVDVRa1N3M3lYRkxXRS1uMndiZjVlYnRldFlrbVhvZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death? - The Guardian",
    "description": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death?  The GuardianFormer South Korean president sentenced to life in prison for imposing martial law  PBSAn Enemy’s Fall Frees Up South Korea’s Leader. Now Comes the Tough Part.  The New York TimesSouth Korea’s ex-President Yoon gets life in prison for insurrection  Al JazeeraSouth Korea's ex-President Yoon apologizes after life sentence over martial law  NBC News",
    "published date": "Sat, 21 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNYUFLMVdVVDFpU2dnQl9hUzVwQTZyb3J1MUhQNXRhcTUtQ2tyM3JSeEJiZ0psZ0ZST3djRE0tM0RfV0lYT3BWUngyYmFhQzVoRW56a2hjaVVEbGZFNFNIekdUaW15ZnhuOUJYWTRnR1BKc1hRQlByRFdrYk0zY0lmSDRPckpRaHlfVVZ5bHowcEFCR2pndEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Tucker Carlson, Mike Huckabee debate Israel’s right to land in Middle East - The Washington Post",
    "description": "Tucker Carlson, Mike Huckabee debate Israel’s right to land in Middle East  The Washington PostUS envoy Mike Huckabee says it would be ‘fine’ if Israel took all Middle East land  The GuardianU.S. ambassador Mike Huckabee causes uproar by claiming Israel has a right to much of the Middle East  CNBCIsrael has 'Biblical right' to take over all of Middle East, claims US envoy Huckabee  TRT WorldIsrael has biblical right to the Middle East, Huckabee tells Carlson  Axios",
    "published date": "Sat, 21 Feb 2026 03:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNV1c4WXhMSzkxZU8xVi1OUEIyS0stZkxMTnVEaGNDVG9vVm1XdnVjbzdrN19CTWZ3amg2bVRWNlVSTmVYZ2FHaTVZNkZ1aXhJcFJDOExuTkk2bjFiTVRya1M5SDEydms4QXlsZ1NVYXBjbFZiY05CdlBRanNQa3luV2hhdTBrbXdvbG0tQUFXblZ4UlR4MDZuRVNVaXloZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Hungary Poses Unexpected Hurdle to Europe’s 90-Billion Euro Loan to Ukraine - The New York Times",
    "description": "Hungary Poses Unexpected Hurdle to Europe’s 90-Billion Euro Loan to Ukraine  The New York TimesSlovakia threatens to stop electricity to Ukraine unless Kyiv resumes piping Russian oil  ReutersUkraine war briefing: Hungary threatens to block €90bn EU loan to Kyiv in oil row  The GuardianEU’s €90B plan to fund Ukraine in jeopardy as Hungary blocks deal  politico.euEU convenes emergency meeting over Druzhba pipeline row  Euronews.com",
    "published date": "Fri, 20 Feb 2026 22:48:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOY2FkYThtRTRYaEdUSW1Ic1g5TFFkSi01dm5MVkVKS1NfdnlfNXdIakhnSG9UM0RQVVZHWTNvTjk3NHpNdUhrWHVjNDA5ZzQ3R0wxMWt3dUFmT2NzYm9IY0hEVWNxbUpJQldtQkFTdkdJQmlSd2hqSFlHSE4zaFdaeE1uWmRFdmE5X1o0V1F2UWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Family of Palestinian-American man killed in West Bank demand accountability - BBC",
    "description": "Family of Palestinian-American man killed in West Bank demand accountability  BBCIsraeli settlers kill 19-year-old Palestinian American, officials and witnesses say  The GuardianPalestinian-American Teenager Killed in West Bank Is Laid to Rest  The New York TimesIsraeli settler killed Palestinian-American teen in the West Bank, local health ministry says  ReutersNews Wrap: Palestinian-American killed by settlers in occupied West Bank, officials say  PBS",
    "published date": "Sat, 21 Feb 2026 05:56:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5iaWtCcTBwdDZZelJTMEtkUmlmWTlmcUN3UjMxSXFqQXoyNU1CZ1JBVzVya0RlVHNaSEMxMnM3VWQ5cHZEcUJ1SVhSY3dxWnVuNUZRMDNmMVhJQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "These shy, scaly anteaters are the most trafficked mammals in the world - AP News",
    "description": "These shy, scaly anteaters are the most trafficked mammals in the world  AP NewsView Full Coverage on Google News",
    "published date": "Sat, 21 Feb 2026 01:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOMGl2bTlONmRDbWxWZ0Fub0N5eWpKMnZEdWlyS0lOeS01d0l5VVdjOGdPSk5Fd1Q0X25Da1diNzk1WWY2akZpVU90TFhvNFdWV0dQZ1NZNTM3c1FMSWJmRHZFZVR4UkVVYllvLTJYekV5anVCQ0FOREMyUUlCWkJOSHF6eGxkajg3RlZNWmFRemV3dXRoQUFtYThKalp2TkpiWEhrdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Why Arab states are terrified of US war with Iran - Responsible Statecraft",
    "description": "Why Arab states are terrified of US war with Iran  Responsible StatecraftWhy are Middle Eastern governments lobbying against a US attack on Iran?  Chatham HouseWhy a Nervous Mideast Braces for a New Round of Upheaval  Council on Foreign RelationsIran and the Gulf: Why Hedging Is No Longer Enough  War on the RocksWar and the deceptive sense of security  Arab News",
    "published date": "Sat, 21 Feb 2026 13:44:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9NYWZXZTJGRldpaEhOWmJEdHJ1UVlJazB4WXlfa19DbGExX1FDb0xablgzeXNzZHFtazlZSnpTWkFwYWFxRzFPdkI1WlZ5VUY3ZVRHVFozdmU2T2RwRm9CSzh2cFJIdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://responsiblestatecraft.org",
      "title": "Responsible Statecraft"
    }
  },
  {
    "title": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say - AP News",
    "description": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say  AP NewsUkrainians, scattered across Europe, trapped in limbo by war  ReutersAs conditions worsen in Ukraine, refugees struggle to return  UN NewsFour Years into War, UN’s Top Human Rights Official in Ukraine Warns that Violations Are Escalating  Better World CampaignCountry Conditions: Ukraine February 2026  U.S. Committee for Refugees and Immigrants - USCRI",
    "published date": "Fri, 20 Feb 2026 12:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNYXJROVp4eDJrdW5CQ0luUUxDenFacW5paVQxOU1xUERjTjlwVVlUdFJ5VkNsb0NpcnMyZUtKT1VxMy13MlI3bTVqQmlmUHB2cktnZkJ5di1uMnFILW1aem9vNW1KT3BUYVBFdG43Ni1Cc21zZUU2RXJadm9jcEdGUWtLN09MYlY5NzhJNUl3amdWT0JreVktR0d2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Exclusive | U.S. Intelligence Says at Least 15,000 at Large After ISIS Detention Camp Collapses in Syria - The Wall Street Journal",
    "description": "Exclusive | U.S. Intelligence Says at Least 15,000 at Large After ISIS Detention Camp Collapses in Syria  The Wall Street JournalPower Shift in Syria Upends an Archipelago for ISIS Prisoners  The New York TimesSome 15,000 at large after security collapses at Syrian detention camp holding ISIS family members  i24NEWSWhat is happening to Syria’s IS camps and their former residents?  The GuardianFew people left at Syrian detention camp that held ISIS families after thousands flee  The Times of Israel",
    "published date": "Fri, 20 Feb 2026 17:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNZGxfOUNOY0tmNU84T185MTZEY1d3MmVqV2Y1Q0NHV2xIVHd4WnVkb28zU1cyS0Iwa2xWWEZVczVDaGpKbjF3M011WXI2N1VWQ3JtdEJEckZ5QVdBRWZuTlFEN1ZhakFEUjlBUkh1cFN0MFNNQ2NOZnNRQTlsMGxMV2FCcFlMemg3WV9oSmRKaUJpbDdmWFpwTVkxMjhMWlBwcmFHQ3BKVnMydnh0SnhOUy1WSmdPREQ1X2xiQXloQWpoVnA4bjQ4XzhDc1hZR3Q5RjcxMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  }
]