[
  {
    "title": "US lawmakers seek to reassure Copenhagen after Trump Greenland threats - Reuters",
    "description": "US lawmakers seek to reassure Copenhagen after Trump Greenland threats  ReutersTrump knows good real estate — and he knows Greenland's value to national security  Fox NewsIn their words: Greenlanders talk about Trump's desire to own their Arctic island  ABC NewsAmericans have been quietly plundering Greenland for over 100 years, since a Navy officer chipped fragments off the Cape York iron meteorite  Fortune75% of Americans oppose US attempting to take control of Greenland, CNN poll finds  CNN",
    "published date": "Fri, 16 Jan 2026 12:52:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOMEg3aWdHUW50UE1CT0x4SFZrV1hqakFwRnhWVTlydnNKLXlRdVhuTG9UMDNMLW9HZk9EVko4SW9UZHpGeXdocG1rWTU1RVRmMmFBX0ZPb0plUW45OXc0eGZxc25wUko5ZnBUb3FUYW5GZDcxQUw0WkhQU1drNU81TXF3Mk40QTQzSWM3LUlsZUh0emxGQ19KTG5sYlNKYkhBZ3JSa1pNTTI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "China and Canada announce tariffs relief after a high-stakes meeting - BBC",
    "description": "China and Canada announce tariffs relief after a high-stakes meeting  BBCCarney opens Canada to Chinese EVs, China cuts canola tariffs  PoliticoCanada’s leader patches things up with China as rift with Trump upends old certainties  CNNCanada agrees to cut tariff on Chinese EVs in return for lower tariffs on Canadian farm products  AP NewsChina and Canada Edge Closer With Progress on Trade  The Wall Street Journal",
    "published date": "Fri, 16 Jan 2026 13:11:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE05OEw5WHl2amlqTE1pbXJhNmFfZlhyZ3pSQVhrc0c3aUhCNmRNQkl2TUhudS0wbXc1OW9kcVlMeDhSWWxzWk1JbktKREpmemZwUTM5a19HOUlHZ9IBX0FVX3lxTFA0YlRDSE1oRGRSSkZHa2ZmT2lvUkdKOTFGNU5qZDdoUXF1bU1ReHRwYy1iUGtxTHpIeWRjYktIU3hYWDJ0LS1BRmRGQWgtLUw3aDJuOVdMdVJ2VTB0Tmw0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "South Korea sentences former leader Yoon Suk Yeol to five years in prison - Financial Times",
    "description": "South Korea sentences former leader Yoon Suk Yeol to five years in prison  Financial TimesEx-South Korean Leader Gets Prison Term in First Ruling Over Martial Law  The New York TimesSouth Korea's ex-president Yoon given 5-year jail term in first ruling over martial law  ReutersSouth Korean court sentences former president to 5 years in prison  ABC NewsSouth Korea's impeached president found guilty in first of four trials: What you need to know  BBC",
    "published date": "Fri, 16 Jan 2026 11:03:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE43ZkhHaGNDZzd6alQxdG5NNnlnWkdXaHV0VlFKVU5TOXdsQ1Q4dFpTNVVabF9xOEdMUkZueTdkT2RYWUxEZmV3bXlqWHJfd0NvRldUN2NRYXRWakl2WFhoRWdyMVJNUW5uUnFnQ2dhZ3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Trump pushes for disarmament of Hamas as second stage of Gaza ceasefire begins - The Guardian",
    "description": "Trump pushes for disarmament of Hamas as second stage of Gaza ceasefire begins  The GuardianLIVE: Israel continues deadly Gaza attacks as deal moves into phase two  Al JazeeraTrump launches phase 2 of Gaza peace plan — but Hamas disarmament remains the real test  Fox NewsTrump says he supports transitional Palestinian panel in Gaza, announces 'Board of Peace' formed  NBC NewsUS announces next phase of Gaza ceasefire plan as committee is formed to run battered enclave  CNN",
    "published date": "Fri, 16 Jan 2026 15:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPNkl0Z2thbVluMWlrVzExOUhCWFB4UjVPZVBlMmlWZFc5U19iR3VHRHhqQTFiVjJXcV94dnM0SmxFQ3o5aTFhY2UxcUJzVjQ2X19vTERDV2JDYnNGU05sS2NxcHQtUXd3cHdBeDFTeUtIN2tnOEZ3UVFYQzB6RmhHSEZPVFFreklGNVhkcnhaa1c2REhqQjBYTTFZdDRGQXVWem14c0hFa0xsQVdaV21MR2IxcmM0WEhEUVZBMVFWLVdQUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded - BBC",
    "description": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded  BBCJenrick says he hopes his defection to Reform UK will ‘unite the right’ after Badenoch says he ‘tells a lot of lies’ – UK politics live  The GuardianWhere Robert Jenrick’s defection to Reform UK leaves the Tories  The EconomistUK Conservatives Fire Senior Lawmaker Over ‘Plot’ to Defect  The New York TimesAdvantage Nigel Farage as the right realigns  The Times",
    "published date": "Fri, 16 Jan 2026 12:43:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBFSTBLZ0xhMXc3UkdpcEM5UGY3MHgyZ2s2RlZlV2Z5ZjVoeC16MEJkYksxNXBvN1cxd2QybWZyWU53OUdULUtpcVF1NVRELU1qUUh2UGxwelMyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "EU troops in Greenland will not impact Trump's plans, White House says - Euronews.com",
    "description": "EU troops in Greenland will not impact Trump's plans, White House says  Euronews.comU.S. threats of a Greenland takeover spark talk of trade wars  CNBCEuropean troops arrive in Greenland as Trump throws another curveball  NBC NewsTroops from Europe deploy to Greenland in rapid 2-day mission as Trump eyes US takeover  Fox NewsFrance, other NATO countries send troops to Greenland for exercises after meeting with Vance and Rubio  ABC News",
    "published date": "Thu, 15 Jan 2026 20:01:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNeU9WQV96ZmNFNjg3ZExQR0k3YWc2NkQwWkljN1J2OUo5NXVjYXZkNjhUR0M0Z1dzU053S0tER0RiME1kcmlxbzlqdWRreS1YWnFNZVhWcWUzaXhuTTJFdVRibmdIV3dvRHhVcWg3TzlkbVRiMnFHdV9sYzU3U2ZMVzItelFxV1hVdUhOSHNBQ25uTXE1S0EwS2p1ZHV1M2t3Rjh3alBnQnFTRVpZLXo1czBOeFRyck1QaUlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes - BBC",
    "description": "Ashley St Clair, mother of Elon Musk's child, sues xAI over Grok deepfakes  BBCMother of Elon Musk’s son sues his xAI over AI-deepfake images  CNNMusk's xAI limits Grok's ability to create sexualized images of real people on X after backlash  CNBCAshley St. Clair, the mother of one of Elon Musk's children, sues xAI over Grok sexual images  NBC NewsX could face UK ban over deepfakes, minister says  BBC",
    "published date": "Fri, 16 Jan 2026 13:56:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9zU0FGRF9XalVabl9QUVZqZVRidFZxTDBnenY1SXFMMGhjNVJ5aENRaFVGM3JaWW9iYU5rZ0k3RG4zdGVxcXRqc2oyYzd1eFRYUlk2cU42N3lKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Ukraine substation fire leaves city without power in freezing temperatures - BBC",
    "description": "Ukraine substation fire leaves city without power in freezing temperatures  BBCRussia Knocks Out the Heat in Ukraine  The New York TimesUkraine scrambling for energy as Russian strikes hit infrastructure  Al JazeeraWith the Power Out, Kyiv’s Residents Confront Cold as a Weapon of War  Bloomberg.comUkraine able to meet only 60% of electricity need after Russian attacks  Reuters",
    "published date": "Fri, 16 Jan 2026 11:47:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTFBLR2RfNmpuMGhfQ3k1dzZwdENQa3hqbGJ1blJtdnJrVW5kNlZVSGYxX0xZcU83ZDlHekVKTTNZQVVmeWE2eHRYaXNmVFI1WldsclZKZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "How Iran’s Islamic revolution devoured itself - Financial Times",
    "description": "How Iran’s Islamic revolution devoured itself  Financial TimesWhat the collapse of Iran’s regime would mean  The EconomistIran's ethnic minorities could hold key to regime's fate as protests continue  Fox NewsOpinion | Iran’s Regime Is Losing Its Greatest Weapon: Fear  The New York TimesHow has Iran’s environmental crisis fuelled nationwide protests?  Euronews.com",
    "published date": "Thu, 15 Jan 2026 16:53:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1uemZrb2RjbklacXpmZFBDVm8zQXdUQWtXcTRtazI0MTVWbTZSdS1WT2drRlBxdU85N1hvVHdqb3VIaE1aZ3d5LUdXMkhJcFhoN05fWGRqZGNJdkxiRlQ4bU1MckFDM2RDMGRqd1FhS1Q?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Trump is making the world fall in love with China - Financial Times",
    "description": "Trump is making the world fall in love with China  Financial TimesTrump is making China – not America – great again, global survey suggests  The GuardianThe united West is dead  politico.euTrump’s ‘America first’ agenda driving countries closer to China: survey  South China Morning PostGlobal Survey Finds Much of World See China on the Rise  Time Magazine",
    "published date": "Fri, 16 Jan 2026 05:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBzV2p2TlBEd2xBWEQzMzU3QjRoMEVrY3I2ZXNVSW9QaFRZV1BNaTB4MlR6UDdNTVFoYXpRNHZKaUExUWhPeDdXT3N6ZWVnWGV1bkM3OUtzUDZGc2lGUGw1ZGVSVEtxLXFHZXZCQUlGbjM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Trump's immigrant visa crackdown targets Southeast Asia's Cambodia and Thailand, a decision experts find 'puzzling' - Fortune",
    "description": "Trump's immigrant visa crackdown targets Southeast Asia's Cambodia and Thailand, a decision experts find 'puzzling'  FortuneUS freezes all visa processing for 75 countries, including Somalia, Russia, Iran  Fox NewsTrump visa suspension hurts New England immigrants  The Boston GlobeA Guide to the Countries on Trump’s Travel Ban List  Council on Foreign RelationsU.S. freezes new immigrant visas for 75 countries: See the full list  CNBC",
    "published date": "Thu, 15 Jan 2026 11:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPeG9Kc2tST3NacG5LYXlDRjFReUdxY1E4dW16dk4xa0pwdkZCU0JYTUxuR3RVcU1Xdm9UVFREdmV6RGRadE9TWWhZZnZNTFIxbG9WRXdXMDNYaUpJendrX2gxc3Q1VDhhb1NrcTh2Q0lxVTMta0pZZEV3Rk1EcXV6TUtGa1AyYUR4ZTdzTXJiZVZidjRjUWlacHR4NkJxMjloRmZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://fortune.com",
      "title": "Fortune"
    }
  },
  {
    "title": "Wikipedia’s Existential Threats Feel Greater Than Ever - WIRED",
    "description": "Wikipedia’s Existential Threats Feel Greater Than Ever  WIREDChicago Wikipedia Contributors Celebrate 25 Years Of Aggregating Knowledge  Block Club ChicagoWikipedia inks AI deals with Microsoft, Meta and Perplexity as it marks 25th birthday  AP NewsWikipedia celebrates 25 years of knowledge at its best  Wikimedia FoundationAt 25, Wikipedia Now Faces Its Most Existential Threat—Generative A.I.  Scientific American",
    "published date": "Thu, 15 Jan 2026 10:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZ1UyWXF3M2kxRmZxc1JnUXpyeUo5NGhfa2Q3YkFtWWR6YzlEczZZRDkwRHIzSGNCbGx1Smxma3YxbGlYVVozVjQzYkFtdlFpcnBISm40eGxmczRZM0x3alpWajk2VDNyUWc0azZ1WXJTVWdhTkJNRDJjbE1ERjZUdVRCcml4ckpESi1B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wired.com",
      "title": "WIRED"
    }
  },
  {
    "title": "Israel and Arab Nations Ask Trump to Refrain From Attacking Iran - The New York Times",
    "description": "Israel and Arab Nations Ask Trump to Refrain From Attacking Iran  The New York TimesTrump says Iran has ‘no plan for executions’ as US weighs military options against regime: Live updates  CNNIran’s Gulf Rivals Warn U.S. Against Strike on Tehran  The Wall Street JournalGulf states and Turkey warned Trump strikes on Iran could lead to major conflict  The GuardianGulf countries gear up diplomacy to stave off US-Iran escalation  Al Jazeera",
    "published date": "Thu, 15 Jan 2026 22:27:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE8tRG9IbnRocmpCMk80VklyUGlCS19fYXZWdlhxOXNRb1B4dk91aTM4c2RXbmFTOWhCc25LZkFPYXRaTldUSzNfSWxLa3puYld3UFgyVjFScC1ncndoekhvVk1Xb3hCSjVjQmpKQVZGZm1jMnVCMm5ab2xhc1I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "‘Squished Between Chairs’ on a Train: How Some Passengers Survived a Crane Collapse - The New York Times",
    "description": "‘Squished Between Chairs’ on a Train: How Some Passengers Survived a Crane Collapse  The New York TimesCrane Falls on Passenger Train in Thailand, Killing at Least 32  The New York TimesThailand halts multiple major construction projects after fatal accidents  ReutersAnother crane collapses in Thailand, killing two, after 32 die previous day  Al Jazeera'It was terrifying': Residents describe carnage after Thai train crash  BBC",
    "published date": "Thu, 15 Jan 2026 18:30:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbkIwLXl2dmFBWkU1VVA4LV93dkZKRGVzRDFuLXRSMy1qQ2pIeGV4UDdrellTay1xLUk0VkVmZG4zYzVHZEZRRHFDdFF1bEl6bVB3VHpDOEFpYXFlWlpySy1WRS1weUFaenQ3MmZhUHo0V2VwMFByOUhmemE4dkNSRFdlWmM2YTVs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Europe’s Only Hope Is to Stand Up to Trump - The Bulwark",
    "description": "Europe’s Only Hope Is to Stand Up to Trump  The BulwarkGreenland Should Be a Wake-Up Call for Europe  Stimson CenterEurope heads for White House collision course: podcast  ReutersWhat unites Greenland, Venezuela and Ukraine? Trump’s immoral lies and Europe’s chronic weakness  The GuardianTrump bites. Europe grasps for an antidote.  politico.eu",
    "published date": "Fri, 16 Jan 2026 06:34:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPNXZVUDY3c1hiZ2wtLU9DRUNmYzlQUFJXLTJLSndsRGRFR0hPMjJXX0FKdmRQbUx1aE85elVrTENsM3Bpa09CSmtoZlpjeUdBZlVheWsyQWpXbk1jU0gzaU04RVJBTUxxZVcwWEdOOExCUEJoT2JEd0tiTnM4aVM5NnJRWHFraW1xc29VQk14VFF3U3J3UFFleWR2ZzJUUm5iYk55UF9pZzZRdTZ2Nmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebulwark.com",
      "title": "The Bulwark"
    }
  },
  {
    "title": "Russia says it's monitoring Trump's 'extraordinary' push to take over Greenland - CNBC",
    "description": "Russia says it's monitoring Trump's 'extraordinary' push to take over Greenland  CNBCRussia notes Trump's dispute with NATO allies over Greenland as European troops head to Arctic for war games  CBS News‘Only Russia Can Stop It’: Moscow Taunts Europe, Denmark Over Trump’s Greenland Plans  The Moscow TimesSenior Russian official says Greenland could vote to join Russia if Trump does not hurry  ReutersRussia says the West should stop claiming Moscow wants to occupy Greenland  Reuters",
    "published date": "Fri, 16 Jan 2026 11:09:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxON0U1ZW5vMUkwbGw3Ylc1LWRwYkIyUThlay1uMHNXYlB2eXY5S3Z0VWlJNEpOQ2x5S0Z5elhGZXhMNnJPVE9DdE5OMElJWjkxQklhNUVvYk44dzU0aGRrSlBpVXVuZGNMUjJjUlA0SHNua3U5d09mRVFqVEgwdHJjMzV1TkVET1ktTl9EQ2c4bFZHNWJm0gGaAUFVX3lxTFBaaFNRbXJ6OEZTS3p6eThyd0xKRGJUeXhKWEFBZGxpSkZzb2FyMXlpYlJLbjVTc1FrODNRT0RzUG9qQ1VrUHpmY0VHRGlCWk05a2N0dWpldkl1U2p5ZE1FNnFKblVWck1ROFI4LXBLb3BodDFfM19sNFZSOHVlOEEtYWp3ZmJwb3hDRFZDRExQa05OWFNydDlERlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Winter Cold and Collapsing Buildings Kill Palestinians in Gaza as Israel Blocks Shelter Supplies - Drop Site News",
    "description": "Winter Cold and Collapsing Buildings Kill Palestinians in Gaza as Israel Blocks Shelter Supplies  Drop Site NewsConditions in Gaza worsen as winds and hypothermia kill 5  Al JazeeraSix dead as Gaza’s displaced struggle to hold ground in torrential rain  ReutersToday's top news: Occupied Palestinian Territory, Myanmar, South Sudan, Sudan, Syria, Ukraine  OCHAAid continues despite winter hardship in Gaza and West Bank, UN says  UN News",
    "published date": "Thu, 15 Jan 2026 16:43:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPMVJyVDBwR1BYOWxlRWxZTGdndzZSZUU2ZGU0Um95NWVRakloUHM0blBrZE1zQS1lRGU2Mm9zcU51OVAtNTMteDR3c2FoczlydXdybHhtaWZZVDJReF9MTENmeGZ4SG52MEh0QUtDMTRmc1NGN1R0TmpuNmFZd0Z6N2RMVlk2ZnUzWFozbjZ6bUNtSVlGbVRMM2Z4bmkzX0lLZlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dropsitenews.com",
      "title": "Drop Site News"
    }
  },
  {
    "title": "There's an internet blackout in Iran. How are videos and images getting out? - NPR",
    "description": "There's an internet blackout in Iran. How are videos and images getting out?  NPRHow Activists in Iran Are Using Starlink to Stay Online  The New York TimesUnder Iran's internet blackout, SpaceX’s Starlink is a lifeline — if it can stay online  NBC NewsIs Starlink helping Iranians break internet blackout, and how does it work?  Al JazeeraMusk's Starlink faces high-profile security test in Iran crackdown  Reuters",
    "published date": "Thu, 15 Jan 2026 17:24:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNYXVpbGtieXI3NGlZcmh2cUlnaHk1SnlBRF9sbDJHYjhVMWQ5S3BHVndhY0taRllEM0t6VXZGQThKRTRQT0dQaTBTLWh0Rm5JdnJNQWZZSGpSaExObGtnbFZjYjFfOGNCWkQtRzFONkhkZktLUTRrS3NoeGxkT1ZPc3Rn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "US lawmakers introduce bill to create $2.5 billion critical-minerals stockpile - Reuters",
    "description": "US lawmakers introduce bill to create $2.5 billion critical-minerals stockpile  ReutersExclusive: Bipartisan plan aims to create U.S. reserve for critical minerals  AxiosReps. Kim, Bera Lead DOMINANCE Act to Break China’s Chokehold and Secure America’s Energy Future  Congresswoman Young Kim (.gov)Key facts in the latest NCAA basketball betting investigation  The PantagraphPress Release: Senators Tim Scott and Jacky Rosen Introduce Bipartisan Bill to Enhance U.S. Critical Mineral Mining Workforce  Quiver Quantitative",
    "published date": "Thu, 15 Jan 2026 17:03:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPNFBoa0Nsb05kRHUtd1Q0emsxa3RTdVczNldxdWZpLVhFTDVCNDZidTFBMExpNm11Q2R3RkNZWVZ6Mzl5b0lJaVJ1a0hIUDRWdUVvS08zVXRyS3RGX3RBLUxJQjdVX0lXSk1tSlVxZ2JJT3k5QTdBbHFRYlN5RjZDUnhIUVRDRjJqYVB5aUtzanRGNXZWbndRVkVZSGFadnoyb0FPVWpWRUwyNXI4a0RhdVJZRVBHTEdWaktqbDZ5bzllUVpY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Tech Billionaire Forced to Rename Humongous Yacht After Realizing It Spelled Something Horrible Backwards - Futurism",
    "description": "Tech Billionaire Forced to Rename Humongous Yacht After Realizing It Spelled Something Horrible Backwards  FuturismBillionaire Larry Ellison scrambled to rename yacht after coming to horrifying realization about its name  New York PostLarry Ellison Had To Change The Name Of One Of His Yachts After Finding Out It Spelled 'I'm A Nazi' Backward  JalopnikEllison's yacht name spelled \"I'm a Nazi\" backwards  Boing BoingQuick Facts About Larry Ellison: Net Worth, Career Highlights and Why He Rushed to Paint Over Vessel's Name  inkl",
    "published date": "Thu, 15 Jan 2026 16:13:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE91MF9jUzQ2QzhUN2IxNGJIbWM3cVlyRUdsQ3dTZ1I2dHZQTjdRRW11Z1JIODRfRElLMmNySVY1NjItdXRnODViUmN4a3VJN2x1QmxDNTZXOTZIeFNOdzFTSTRwV1dlZG1VaGtkRg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://futurism.com",
      "title": "Futurism"
    }
  },
  {
    "title": "Why Trump wants Greenland and what’s standing in his way - Yahoo",
    "description": "Why Trump wants Greenland and what’s standing in his way  YahooOpinion | Operation Total Nuuk Submission  The Wall Street JournalPanicking over Greenland plays into Trump’s hands – it’s time for cool heads and stalling diplomacy | Simon Jenkins  The GuardianTrump’s latest geopolitical gambits all lead back to China  CNBCTrump latest: Venezuelan Nobel Peace Prize winner says she's given her medal to US president  Sky News",
    "published date": "Thu, 15 Jan 2026 19:06:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUUZIdXFtQjJsM0R6Z2RwSC1yLWF0bS1VenRnNmxicVdvWkJVX2FNVXpRaEFLVHJVdDAzOEI4cWcxZmZxZUNwNjFXdmhfUUEwclBHTEhYeXpoRmNuQVpRZFhSWnd3VlNUYXY0bFNheEFILUNHUFJfNkFBTHNCLTQxZzlnajZxYUJnNS1YRGtn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "Time to dump Trump? Europeans whisper last-resort options to save Greenland - politico.eu",
    "description": "Time to dump Trump? Europeans whisper last-resort options to save Greenland  politico.euEurope has three options for defending Greenland  The EconomistEU will maintain Arctic cooperation with US, von der Leyen says amid Greenland tensions  Euronews.comEU's von der Leyen: Greenlanders can count on us  ReutersEU Parliament Explores Tying US Trade Deal Approval to Greenland  Bloomberg.com",
    "published date": "Thu, 15 Jan 2026 20:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQdlNOVXJndzF0X0NwMURRZGhndzNNemR6dlJ2ejRXY0I1bDhYN0RqTXVFOV9nNWFTaDJCMHNLSHZtX0hkWExZa1MycllOSnQybDRoQ2xBYzRON0QzbGtBdXRVR3EwRF9SWV9Jczd6OFZJcHBsWmI0MnRMQndOZkRLMERNRnBndDhQMnBPQW1lSXpXTDF0TGJBUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Mummified cheetahs found in Saudi caves shed light on lost populations - AP News",
    "description": "Mummified cheetahs found in Saudi caves shed light on lost populations  AP NewsMummified cave cheetahs inform rewilding actions in Saudi Arabia | Communications Earth & Environment  NatureIncredibly Well-Preserved Cheetah Mummies Show Big Cats Once Roamed Saudi Arabia  Scientific AmericanHow cheetah mummies could help bring the species back to Arabia  Science NewsMummified cheetahs could help save the critically endangered big cats  Popular Science",
    "published date": "Fri, 16 Jan 2026 01:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPdWdYZnREcGh1ZldHZVYzdlJDZ2VIOFM2TVlHLTFPdGc3U2RZOFNST2tEdkkxOC1yVUFBVzRIdC16dDU2cUtyZVhVSk5kSjlnMnl5QW1hRzN1Y3NZTFVJVTVWcmxvaFpkZTR3WWd1bVY5bjBsRTVIRkRlQkY2V1N6ZWsxcHFqcUNjZ1JqbnJXQ1k4YUxET2Mw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  }
]