[
  {
    "title": "How Former Prince Andrew’s Trade-Envoy Role Sowed the Seeds of His Downfall - The Wall Street Journal",
    "description": "How Former Prince Andrew’s Trade-Envoy Role Sowed the Seeds of His Downfall  The Wall Street JournalThe photos that have kept former Prince Andrew in the public eye  The GuardianHow Andrew's arrest brought global glare to quiet town  BBCAndrew Mountbatten-Windsor's ex-wife 'Fergie' also undone by Epstein ties  Reuters‘The photo gods were on my side.’ How that astonishing image of Andrew was captured  CNN",
    "published date": "Sat, 21 Feb 2026 02:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQc1Fab2xzNWlfODBteVFSbDdxQ1pwUUtsQmRXUUFSN2lOWlZsNllDOHBlVS1tbHZLX1A4b3h4c1VHSEk3NVJweWZ4R0luQ0tDdEpWamgwMndFbVJnQXNDN25yQnRRdGtSaEpCeUZHOUpFSEVZTkZLQ0o5ZHpoMmhaaUxkclFDbTFmc1FjVEFCaHRBWWFTQ3dNYjVZSHhHall5bHlwLUY2Zll3YTNvZ19tRHBn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death? - The Guardian",
    "description": "Why is South Korea angry that Yoon Suk Yeol wasn’t sentenced to death?  The GuardianFormer South Korean President Yoon Suk Yeol handed life sentence for leading insurrection  CNNAn Enemy’s Fall Frees Up South Korea’s Leader. Now Comes the Tough Part.  The New York TimesSouth Korea’s ex-President Yoon gets life in prison for insurrection  Al JazeeraSouth Korea's ex-President Yoon apologizes after life sentence over martial law  NBC News",
    "published date": "Sat, 21 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNYUFLMVdVVDFpU2dnQl9hUzVwQTZyb3J1MUhQNXRhcTUtQ2tyM3JSeEJiZ0psZ0ZST3djRE0tM0RfV0lYT3BWUngyYmFhQzVoRW56a2hjaVVEbGZFNFNIekdUaW15ZnhuOUJYWTRnR1BKc1hRQlByRFdrYk0zY0lmSDRPckpRaHlfVVZ5bHowcEFCR2pndEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump's Board of Peace painted a rosy picture of Gaza's future. On the ground, there is only despair - Associated Press News",
    "description": "Trump's Board of Peace painted a rosy picture of Gaza's future. On the ground, there is only despair  Associated Press NewsFrance says surprised by European Commission presence at Board of Peace  ReutersWith a Golden Gavel and a Threat to Iran, Trump Launches His Board of Peace  The New York Times“Colonial Apartheid Regime”: Jeremy Scahill on Trump’s “Board of Peace” & Plans For Gaza  Democracy Now!Trump gets his Board of Peace, even as bigger countries steer clear  Politico",
    "published date": "Fri, 20 Feb 2026 17:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPODVrUTNtTEplVGJkYnBPeWFQcHpkRVhEMjcxVXlicHpyOE1ReWRBRG12V1VzMEtLN2xLTW1OeHZKVFpzTktlM05UTEZoSXZtNWQ0ckpna1hRdFNmZFBGcHlwSzM2UjNQN1NMMTRyYmo5VUNsLW5fQk5idGg3LTRDWXY4R1hzbW8xRnZIanpXVXhhWnNQZVE5eFNDV2k4RUI5blYxVmtzZ0VpSTB2bVkzRW42TDM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey - USA Today",
    "description": "Give Punch a break! Zoo responds to heartbreaking video of baby monkey  USA TodayAbandoned baby monkey finds comfort in stuffed orangutan, charming zoo visitors  ReutersMeet Punch: The abandoned monkey taking the internet by storm  Euronews.comA Lonely Baby Monkey Wins Hearts, and Even a Few Friends  The New York TimesBaby macaque becomes a viral symbol of hope  Yahoo",
    "published date": "Fri, 20 Feb 2026 20:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPWnJyNTRCYmhDTmJjNE1nLWQ4QUwtSTk2YW54dllMZzZJMmNOWHk5WEJVSWxXcFFSOVZNWlZab0NJcVgyX3huQjRRWDhkLXE4dGdLY1VPVlhBZXR5eHpFamdsRE9uMDlBb3ZnVFdhUFF6YWNsc3J6Q1V1b01FLXBmRGVPNU9kbW8xZjJjT094MXdBLS05VUdYVDVRa1N3M3lYRkxXRS1uMndiZjVlYnRldFlrbVhvZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.usatoday.com",
      "title": "USA Today"
    }
  },
  {
    "title": "India’s AI summit draws global leaders, big pledges and some chaos - NBC News",
    "description": "India’s AI summit draws global leaders, big pledges and some chaos  NBC NewsAI hit: India hungry to harness US tech giants’ technology at Delhi summit  The GuardianCNBC's Inside India newsletter: India is throwing its weight behind AI — but is there substance behind the headlines?  CNBCThe flaws in India’s AI plans  The EconomistOddest moments from India’s AI summit: Missing stars, traffic chaos and robo-dog controversy  politico.eu",
    "published date": "Fri, 20 Feb 2026 20:17:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPNHctMGtILWlMOFdQR0Z3aTJPdGtpTE15VzJzcVBRVFhDVm1iZXY1RlVsa280d1libF9DRDdLM1dLeWQtYnRiV0E5QV9iSGI3blU5WGd1NWtLT19XcFQ1MjVkV0pmZnp2bmQydW14MmNnZ2hBM1haeVV5TWdESGtyeGJ1Y0llRFEzZG5Bb0VZUnZ3ZUNlQW14LWVhNkxvN1NJazdN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Hungary blocks EU's 90 billion euro loan to Ukraine, demanding Russian oil ahead of war anniversary - The Kyiv Independent",
    "description": "Hungary blocks EU's 90 billion euro loan to Ukraine, demanding Russian oil ahead of war anniversary  The Kyiv IndependentHungary Poses Unexpected Hurdle to Europe’s 90-Billion Euro Loan to Ukraine  The New York TimesUkraine war briefing: Hungary threatens to block €90bn EU loan to Kyiv in oil row  The GuardianCroatia must allow Russian oil flows to Hungary and Slovakia, MOL says  ReutersUkraine’s Neighbors Threaten to Cut Off Energy Supplies  The Wall Street Journal",
    "published date": "Fri, 20 Feb 2026 19:52:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNZmotSVRrcjJGamI5WmJnMDItTjVrbWJ0SHFYYUsxUEpCN19PUkdmUHk0QUZORDk1Z0NjS3drOU9uUGNodTAtM1c3Tl9jQklzQVc4aTd2TEVaM3dLdHZraWdpVVdvaTR6di1FYl93ZVhTODF0Y0NmV1loemJuMDhBVlpRdEE3NG9GaXJhUmVDTm1Wanc3Y2tsVy1Md3h6UE05UnlNd2NwV01JWWt6aWY0OFJYTjRSeDEyY05hcGYzZ3RPUnBu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Palestinian-American Teenager Killed in West Bank Is Laid to Rest - The New York Times",
    "description": "Palestinian-American Teenager Killed in West Bank Is Laid to Rest  The New York TimesIsraeli settlers kill 19-year-old Palestinian American, officials and witnesses say  The GuardianFamily of Palestinian-American man killed in West Bank demand accountability  BBCNews Wrap: Palestinian-American killed by settlers in occupied West Bank, officials say  PBSIsraeli settler killed Palestinian-American teen in the West Bank, local health ministry says  Reuters",
    "published date": "Sat, 21 Feb 2026 03:48:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPQzdsUmdjN2lpT0p6YTRiVjl3bTRabWtXU29sQS1KVzg3UEk5RGg2Tk1Kb1pzZThwbDVISXNfRWszcXBqN212c284V2tnOENkTzYya3NfNk9hUTVpeERRdkNZdnNsWTBYV0Q1TkRZVlVtZ2VDOVBuOEdpNG9sWTFCTDZsVXZkdWwxUGZtbDVJaF80bHlUdzQ1UXBNNmRNaUo3SzdYWEZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "US envoy Mike Huckabee says it would be ‘fine’ if Israel took all Middle East land - The Guardian",
    "description": "US envoy Mike Huckabee says it would be ‘fine’ if Israel took all Middle East land  The GuardianTucker Carlson, Mike Huckabee debate Israel’s right to land in Middle East  The Washington PostUS ambassador Huckabee says Israel has right to take over ‘all' of Middle East  Middle East EyeIt would be ‘fine’ if Israel took over entire West Asia region, says U.S. Envoy Mike Huckabee  The HinduUS envoy suggests it would be ‘fine’ if Israel expands across Middle East  Al Jazeera",
    "published date": "Fri, 20 Feb 2026 22:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbWlSaEVMNU9fQ0pSeFdsTGVBYllRTHlyNFB3OU16NmtsTV9xOVM4clJ1Z0hTLTlKUDdTaVduczRpOUlGR0F4akxDa3dpOFhqaWxSeTB1d3JCNE5EYjllV1NscThyNTBOTUFWRjQ3Q3NkWFVPZy1YaDNZWmw3SkRiNHpXZXh3UGVUdUlwODZCTW5wMmxOWm1NeWFXbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "North Korea’s Kim Jong Un triumphant at rare congress - Financial Times",
    "description": "North Korea’s Kim Jong Un triumphant at rare congress  Financial TimesNorth Korea's Kim reviews country's progress at key party congress  ReutersNorth Korea shows Kim Jong Un at the wheel of a mobile rocket launcher  CNNNorth Korea unveils nuclear-capable rocket launchers  dw.comNorth Korea's Kim Jong Un says new military goals to be set at party congress  NBC News",
    "published date": "Fri, 20 Feb 2026 06:26:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5oU0tabWlnTmp2aTA0cmVrS0Zwbi12S0drYU5TRENLMzBURHZUVk1PaWRpRWlHOV9LaTVUd1dkVWVmczdOeWJPQU9sNmpialM5UXM2VnBiZkhJQmt4SjVOWlM2WXNHbFMyaTRmdC1hYTM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Macron tells Meloni to 'stay at home' after comments on activist death - Euronews.com",
    "description": "Macron tells Meloni to 'stay at home' after comments on activist death  Euronews.comKilling of nationalist student leaves French far left in deep trouble as elections loom  BBCHow the death of far-right activist Quentin Deranque became France’s ‘Charlie Kirk moment’  France 24Tensions flare between Macron and Meloni over killing of French far-right activist  ReutersFrench far right looks for Charlie Kirk moment after activist’s killing  politico.eu",
    "published date": "Fri, 20 Feb 2026 10:22:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPUjRJUGdSNGhIM0IwV2JhaXRldm9Na2hoMnM0MWxhVS1MdnZmZ1pRSk1Rck51bzc2VzFBbnJydlZKOWxETlVBaEFfTFpaekt6d2RNVkltT2piaF9rWGJ5VV81ZDFtN2h6RXFGdTBDbFpyRkxUMEh6bFhsM3pfVFlIOWNGVHZGeG5GLWVPaVBWYncyNEY5bVBzX0g2YVZ5RnAyZzgwSVQydktuOHR0WVVHdWh1dEg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Exclusive | U.S. Intelligence Says at Least 15,000 at Large After ISIS Detention Camp Collapses in Syria - The Wall Street Journal",
    "description": "Exclusive | U.S. Intelligence Says at Least 15,000 at Large After ISIS Detention Camp Collapses in Syria  The Wall Street JournalPower Shift in Syria Upends an Archipelago for ISIS Prisoners  The New York TimesFew people left at Syria camp that held Islamic State families, former director says  ReutersWhat is happening to Syria’s IS camps and their former residents?  The GuardianHow thousands of people linked to Isis went missing  Financial Times",
    "published date": "Fri, 20 Feb 2026 17:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNZGxfOUNOY0tmNU84T185MTZEY1d3MmVqV2Y1Q0NHV2xIVHd4WnVkb28zU1cyS0Iwa2xWWEZVczVDaGpKbjF3M011WXI2N1VWQ3JtdEJEckZ5QVdBRWZuTlFEN1ZhakFEUjlBUkh1cFN0MFNNQ2NOZnNRQTlsMGxMV2FCcFlMemg3WV9oSmRKaUJpbDdmWFpwTVkxMjhMWlBwcmFHQ3BKVnMydnh0SnhOUy1WSmdPREQ1X2xiQXloQWpoVnA4bjQ4XzhDc1hZR3Q5RjcxMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say - Associated Press News",
    "description": "Life is harsh and dangerous in Russian-run parts of Ukraine, activists and former residents say  Associated Press News'Everything was lost': Ukrainians mourn missing homes, loved ones after four years of war  ReutersAs conditions worsen in Ukraine, refugees struggle to return  UN NewsFour Years into War, UN’s Top Human Rights Official in Ukraine Warns that Violations Are Escalating  Better World CampaignCountry Conditions: Ukraine February 2026  U.S. Committee for Refugees and Immigrants - USCRI",
    "published date": "Fri, 20 Feb 2026 12:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNYXJROVp4eDJrdW5CQ0luUUxDenFacW5paVQxOU1xUERjTjlwVVlUdFJ5VkNsb0NpcnMyZUtKT1VxMy13MlI3bTVqQmlmUHB2cktnZkJ5di1uMnFILW1aem9vNW1KT3BUYVBFdG43Ni1Cc21zZUU2RXJadm9jcEdGUWtLN09MYlY5NzhJNUl3amdWT0JreVktR0d2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "UK police seek information from ex-protection officers of king's brother Andrew - Reuters",
    "description": "UK police seek information from ex-protection officers of king's brother Andrew  ReutersMet asks Andrew's protection officers what they saw or heard in Epstein inquiry  BBCU.K. Police Contacting Security Officers Who Once Protected Former Prince Andrew  The New York TimesUK police assess claims Epstein trafficked women on flights through London Stansted Airport  CNNPolice investigating claims that Epstein trafficked women through UK airports  The Guardian",
    "published date": "Fri, 20 Feb 2026 08:34:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNU2pqMlFMaUxaV29ndUZabEh3RlFGcTZ2VkhZQUlCU2ozX2ZtSTV1ZDRBSGdGdHRWZUpEakdwQ19JX0tHM0hHUFRCbW4yMWlMOGJmR19nMzRlNG5LZ3pPR0FJZ24wd0VIYkZaMktKWUQ3czIyZmJlNDJhZXpBSzF2Vzdzb19nd21wSGhCYkRlcF82S3VEQXpkRjFWV2ZwMDYwSWcyNkE4cmI0Z0M1aVdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Austria convicts climber over girlfriend’s death on mountain - dw.com",
    "description": "Austria convicts climber over girlfriend’s death on mountain  dw.comAustrian Man Found Guilty in Girlfriend’s Death on Mountain Hike  The New York Times‘The costs could rise’: Austria manslaughter ruling could alter climbing in Europe  The GuardianClimber is convicted over girlfriend's death near Austria's highest peak  ReutersClimber accused of leaving girlfriend to die on Austria’s tallest mountain goes on trial  CNN",
    "published date": "Fri, 20 Feb 2026 02:39:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQZDFmU1d2Q0NXWTVjMEh6V3AycU5uX2d5eDlsUElMci1aeWNNdHpFNkNfR3JYVl9OMDAycnI4VkVDaWQtSVdSUG5ScVQ2MGRRejJiS3pBcXhFSExDQUVYLW0tUnU3QjVxR3lUVzI2a0VBTUZRcmVDSnl0Q0dVWWxjTUROTXc1czNsM081QzRSVUlyUFl1UWFSSXJfeUZCS0ktTVBxcndTSnhuQ0lLUmNPMFhR0gGyAUFVX3lxTE16aVE3SFJCOUtVRERUOHVPRGdPNE5ra2F1cGE1andjZ0RFdkFxMHFGZ25kVW9zeVA2ZFdJbEdXMENqd2dfYW5JSGdRaTF4WnF6S0xFZ2thSllrYmgxVWtWUk5BVFJ2VVBMUEFKbWlIcC05cVFpbzhfcU9UbktMVFkzY2dPWllWc0F6SzFDZVRWc2J4U2xGcVVrUnB5OE5FZE1ybThVZ1hXVHJMczFyY2tJR3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Ali Akbar, who's sold newspapers on the streets of Paris for 50 years, is now a knight - NPR",
    "description": "Ali Akbar, who's sold newspapers on the streets of Paris for 50 years, is now a knight  NPRView Full Coverage on Google News",
    "published date": "Fri, 20 Feb 2026 13:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPZWNMcUpfVXVUVW15SndNQVJ1WURLaWtKcGptNTd2eS1oMHR0MWZuVDd1VUl3bEo1a3ZBSk9lMm1FTWxrd2VfZWZZMEdWbnpIdkE2TmJFbXltX1lmNW9xY3pQUzR0SmhXWWhJOGdTYXZuVVAwbUZJUV9FdlBybU5rSHFSUE5VOEx3UmZ4RHFhdE41cHdjZC1lYnBMNnVjMS0tRmZBSDd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "An ‘astonishingly’ large new dinosaur species has been discovered in the Sahara - BBC Science Focus Magazine",
    "description": "An ‘astonishingly’ large new dinosaur species has been discovered in the Sahara  BBC Science Focus MagazineFossils of huge 'hell heron' dinosaur unearthed in Niger  NBC NewsAstonishing Spinosaur Unearthed in The Sahara Is Unlike Any Seen Before  ScienceAlertThis odd-looking new Spinosaurus is reviving an age-old debate  National GeographicSkull of ‘dinosaur from Hell’ discovered with sword jutting from its head  New York Post",
    "published date": "Thu, 19 Feb 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQU2dWMWNlVlVHc25iQnhxWGRaNVNZY2ZyV0VXN1d0N3U5Tmo2c1oxNHNkeGpuSlBYX1VCQmVEdkpsQy1TbXpKelpib0JCUUtwLThYNHNkZWNzNFdjQ3NFalRKWUVsSnQxT3J5YkZXRjRXN1gzc21lN2RBOGlnRWJtVGctZWlsSmNubUduTnRwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sciencefocus.com",
      "title": "BBC Science Focus Magazine"
    }
  },
  {
    "title": "U.S. Builds Tech Bloc to Counter China, Adds India as Newest Member - The Wall Street Journal",
    "description": "U.S. Builds Tech Bloc to Counter China, Adds India as Newest Member  The Wall Street JournalIndia joins US-led initiative to build secure technology supply chains  Associated Press NewsWhy India joining this U.S.-led tech alliance could help supply chains  CNBCIndia to Formally Join US-Led Pact Pax Silica on Supply Chain Security  Bloomberg.comWhy India has joined US-led Pax Silica but not Trump's Board of Peace  India Today",
    "published date": "Fri, 20 Feb 2026 14:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQV2hvc3ZBd2tST29IU21PcEhKbER5Y1dINGFXemxzX3VYd0pQUHNfRFF6RVc5WUFqLWRULW1UX3UyYldLVHdsVjdvd051M3dnQ2hwMU82NG00Z3BlMWRWenRzeEI4cWs2RUoyZ3AzSlpwTWx5QUF2MXN5d3NJNENZcUxBTkx4QmsxTzhibzhUQVZqTV9EZEk5bElrSS11N3d3NmItb0FhV2lJQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.wsj.com",
      "title": "The Wall Street Journal"
    }
  },
  {
    "title": "Ukraine liberates 300 square kilometers in southern counteroffensive, Zelensky tells AFP - The Kyiv Independent",
    "description": "Ukraine liberates 300 square kilometers in southern counteroffensive, Zelensky tells AFP  The Kyiv IndependentElon Musk flipped a switch. Now, Russia is desperately sending men up towers to die  Scripps NewsMusk cuts Starlink access for Russian forces - giving Ukraine an edge at the front  BBCRussia’s Front-Line Comms Hit By Curbs to Starlink and Telegram  Bloomberg.comUkraine makes fastest battlefield gain in 2.5 years  France 24",
    "published date": "Fri, 20 Feb 2026 23:49:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQamRVR21PcExWNV9OSGczZkJmZFRvSEJZQWNjSUp0VFZKT05ycHpIVEhiUFpDdTE0RG9JdlhudlpQazkzZDZIaF9IVS14QnI5bHBsYlc2a2h1QUthdFlwa3d0MGNJVjNnME5hZTBicjFRTkNjMm9vSVB5Sm0tanM5TFpFbVpjVE4telJhSkFYQkhocUtjdnB5MHZ0cG5uWlY5WTJIOFJZYWdfRkt2V2ZOMXhib1EtVnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]