[
  {
    "title": "Israeli strikes kill 20 Palestinians, including children, as Gaza ceasefire inches forward - AP News",
    "description": "Israeli strikes kill 20 Palestinians, including children, as Gaza ceasefire inches forward  AP NewsLIVE: Israel kills 29, including children, in new Gaza ceasefire violation  Al JazeeraIsraeli strikes kill 30 Palestinians, including children, as Gaza ceasefire inches forward  WRALIDF announces capture of one of Hamas's top remaining commanders during overnight operations  The Jerusalem PostHamas commander captured after attempting to flee south Gaza tunnel — IDF  The Times of Israel",
    "published date": "Sat, 31 Jan 2026 10:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQZFBjS1c5Q0RkLXNYWmxLdWlfZ1ZrRGFuaTF6bWFKdlBaNk51ekFwT0VucUtTSTdsQUpjaTNvNmRTUlZiNEp1blRaQk5nYjd5R3NEblJUODVvYWhtbFE0SmVTdDUwanNKVFJiTUlWTE5sOV9MNFhQZmVzRkR3eWxmaTZiUjNpSzhrWV9EUnQ0ZlZrcmRoMmtF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "U.S. Allies Are Drawing Closer to China, but on Beijing’s Terms - The New York Times",
    "description": "U.S. Allies Are Drawing Closer to China, but on Beijing’s Terms  The New York TimesWorld leaders flock to Beijing, hedging against U.S. disruptions  CNBCUnnerved by Trump, U.S. allies are making nice with China  NBC NewsChina’s Economic Statecraft Is Working  Foreign AffairsPushed by Trump, US allies are resetting relations with China  AP News",
    "published date": "Sat, 31 Jan 2026 05:01:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBZTDYya1RwQmNvRUxSeXpJOTF3Yk05YUZnTklhdnVJTVFTQUc0dW5BNmRObS1WODdBWGpLMmxxSmx5OU5pTXZaQ0J3Vi0xMTNVamJ3QVVKSG40VlBLb2daTUZSdEplVTNkYVlwQUFVN2otUEFpUm1NTllGeElFSHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Over Creamy Chicken, Europe’s Leaders Try to Reduce Dependence on Trump - The New York Times",
    "description": "Over Creamy Chicken, Europe’s Leaders Try to Reduce Dependence on Trump  The New York TimesAnalysis: MAGA’s right-wing allies in Europe are repulsed by Trump’s push for Greenland  CNNGetting to ‘no': Europe’s leaders find a way to speak with one voice against Trump  AP NewsTrump’s Greenland threats reveals no-win dilemma at the heart of European security strategy  The ConversationEurope Got Tough With Trump, but It Needs the U.S. as Much as Ever - WSJ  The Wall Street Journal",
    "published date": "Sat, 31 Jan 2026 05:01:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQ1B3RTRLQmhpMGdIcHp4dE5PenFOa3Z1aGZmb3hqbTBtQ2o4QjU2Wk4yVHNCWkZtbE1EcDBaZHFkSUQwbldiNHE2NW94TXpVa1hkdjZZU2dsZW92UFdvNU9JbGVpQmZYMUc5eTVLUFIxY1dPV3p5WG40eHNYc1hJUmRYTW0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Gaza’s Rafah crossing with Egypt to reopen on Sunday, Israel says - Reuters",
    "description": "Gaza’s Rafah crossing with Egypt to reopen on Sunday, Israel says  ReutersThese Gazans May Finally Get a Lifeline to the World  The New York TimesGaza's border with Egypt to open on Sunday after almost two-year closure, Israel says  Euronews.comA bullet shattered her knee. Now a Gaza teen's chances of walking depend on Rafah border crossing  AP NewsIsrael confirms Gaza’s Rafah Crossing will reopen Sunday to pedestrians in both directions  The Times of Israel",
    "published date": "Fri, 30 Jan 2026 11:37:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPTTI1QURiUHgzdUtjYVFyUnB5OVNiLWhzenVVVmRKWWRXZEh5eDEzTWpLdFpzNVViWXc5bDdLdm9XS1NlbHBpaTc5dVp4dmtKaGhTTlptVnV6ZHpGamIwYmhaYzZsLVFzTDFyd2xFcWNZclJycVRyb3l6RG4xRnpBQU91eEFyYVhHTnJkYVhxWmpkLW1COEFGSVg5ZE1GQlJiU0FrRllxTTdRUDQ2SDl6ZGRPa0JNNkJGdHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Aryna Sabalenka appears to tell Ukrainian rival to ‘f–k off’ in Australian Open controversy - New York Post",
    "description": "Aryna Sabalenka appears to tell Ukrainian rival to ‘f–k off’ in Australian Open controversy  New York PostAustralian Open 2026: Elena Rybakina beats Aryna Sabalenka to win women's singles title  BBCElena Rybakina rocks Aryna Sabalenka to grab first Australian Open triumph  The GuardianSabalenka vs. Rybakina: Who will win the Australian Open title?  ESPNElena Rybakina wins Australian Open by beating No. 1 Aryna Sabalenka for her 2nd Grand Slam title  Yahoo Sports",
    "published date": "Fri, 30 Jan 2026 19:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPTjNCRkRPTG1DQjY5dkkwMEhIZk0wNWxxX214VmRra0JFcHJwN2lTTkJhZHNWNXFwUnhSSHd3dDIxQ3NaMVdLZGJZamdyUUVORE1iS25XOEdlNHdUaWJicThFckRqbEJpMFpabk5mVm82ZkltcFE1NTVfOHNZUm9xSWNCMWxnMm5XRWhxQ0NDWUxfMUR1VXRPX3NzTmh4akNMMW8xVVFSUDJCSXREUy1YdzRLR2RJUlo1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Son of Norway crown princess to stand trial for allegedly raping 4 women - CBS News",
    "description": "Son of Norway crown princess to stand trial for allegedly raping 4 women  CBS NewsPrince Haakon of Norway Releases Rare Statement on His Stepson Marius Borg Høiby’s Rape Trial  Town & Country MagazineA princess, her son and a royal scandal: Norway’s trial of the century begins next week  The Irish TimesCrown Princess Mette-Marit of Norway breaks cover as her son Marius Borg Høiby faces rape charges in the ‘trial of the century’  TatlerNorway's Crown Prince Haakon Addresses Whether He Will Attend Stepson Marius Borg Høiby's Rape Trial  People.com",
    "published date": "Fri, 30 Jan 2026 16:43:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNNGJMenVkeVhORXBRbmY3NkNZQ0xFM1kzcjlDNUs3M2E5bVNEUjVwTUVkRng3VGZQNXMwSlNIczgzb3R3d1k4ZzJfbU1Ka3B1SVRzVkNLd3FZclFoMV9ad0gzeHN6d3RRSU4zVXVaQ1FTRnBiV29zYTJzcDlDWTFvLXVVMGRvUUxfN2lTQ9IBkgFBVV95cUxNNGtabzRYQ1Bpd2ktaE1sUFhMZUxzZzJXZkRLQ1Q0WkZ4VkxtM01CRjFpemNpVVpRX0hhU1MxdXg2TmZGMzVoZ1ZkZE5FeGM4NUo4bmxhMVdPTlRLNHhDTUpPWFpiSjBrVk5pb18wdU04UnFEazR2WDFhYk5uRWpjWHFfTHVOOV8xVFJ5cEU1bFhXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Mine collapses in eastern Congo, leaving at least 200 dead - AP News",
    "description": "Mine collapses in eastern Congo, leaving at least 200 dead  AP NewsMore than 200 killed in coltan mine collapse in eastern DRC, officials say  The GuardianMore than 200 killed in mine collapse in eastern DR Congo: Report  Al JazeeraMore than 200 killed after landslide hits miners extracting key smartphone mineral  Sky NewsMore than 200 killed in coltan mine collapse in east Congo, official says By Reuters  Investing.com",
    "published date": "Sat, 31 Jan 2026 08:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxObnRXbFVOZ2toT1p2MFBTeTZwd1hQZjlHT1M2MUhsU1BsX1RCd3AxeFBiam13cWZabmVXTV9HeHVTd1JlVnhWZWJlOGJjSU1FbjVIUlVSbnRMSzlEQTRPX3BmaGo3cDR5Y2R2WHk2MmN2aS1sZ1hRSWhZd3g5UXo1Zk9BV3dhYk5XMU9FR3hyekVNeGto?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Through the eyes of Iranian protesters, glimpses of disorder, disarray and death - ABC News",
    "description": "Through the eyes of Iranian protesters, glimpses of disorder, disarray and death  ABC NewsWhat happened at the protests in Iran?  Amnesty InternationalDisappeared bodies, mass burials and ‘30,000 dead’: what is the truth of Iran’s death toll?  The GuardianUnreported Atrocities: Eyewitnesses Detail Massive and Deadly State Crackdown Against Protesters in Iran’s Provincial Cities  Center for Human Rights in IranThe Brutal Reality Unfolding in Iran  The New Yorker",
    "published date": "Fri, 30 Jan 2026 07:00:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOSmI4MTZiODJrSUJONmp1a1oyMVRDN193NXJhemYxaUNKaF95UzZhYWRoWXBsMFg0QnBJcE1MQlgyZHR6WUxxbWg1ckVTNFBpUDdOTVM1TlZCZDlKMXVSalQ4X3F0VzBHRk5hWU9MaW1kenZqMXo5d3Bjb3J6dVFPTDZYQ0JjbW5JaDVXOUg2S2phMGk1dWJyQ2RJa1RnVGxWcFRCZUdGd0JaTUtOcXZxSWVub9IBuAFBVV95cUxQV0FTOFdtMUd4N3RuYVRXQV9UQnBtdjVBWXVFbEFhenB0S3pWTjg3dFRNekZyT1J2cHZYNzJaMzNKdVVneFI2RGhUcTVkUFlodUItcjFWWl9uWmswZFl1RzcydE0tVzFNNTVuUkkydFhFUW1jRG9FVW03ZFIwVjE5Sk52aE11UDFjRHowVXhPU3FMendQVFpGMjl0Y0NvNlNoRDlvR3FORzBwenkzQVpBNmZTSk1vMDFQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Starmer’s China trip thaws relations with Beijing but spurs criticism at home - Financial Times",
    "description": "Starmer’s China trip thaws relations with Beijing but spurs criticism at home  Financial TimesStarmer arrives in Shanghai as he looks to boost UK business opportunities  ABC NewsTrump Tells U.K. and Canada That Boosting Trade With China Is ‘Dangerous’  The New York TimesChris Mason: What Starmer's China reset tells us about his foreign policy  BBCStarmer hopes his China trip will begin the thaw after recent ice age  The Guardian",
    "published date": "Fri, 30 Jan 2026 22:30:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1YMFdBQVdtRGVreGE3NFJvMmdKd2RNQ2U1Nk9HUXZaMjI5TlV3eXM3c3Z1eXYzbUtVSkVRaUtxbGYyRmFVRW02c1dGd3hWeFlTV3NaQXpkSkRoelBPay1BMEFBX2xsT1c2NW4ycS15X1o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Scoop: Saudi defense minister says Trump not bombing Iran would embolden regime - Axios",
    "description": "Scoop: Saudi defense minister says Trump not bombing Iran would embolden regime  AxiosTrump’s Iran moves rattle Arab allies  PoliticoArab allies urge restraint from US and Iran as Trump demands deal on nuclear program  AP NewsIran's battle for survival is the Arab world's fight too  Middle East EyeSaudi defense minister warns Trump inaction on Iran would strengthen regime: Report  Anadolu Ajansı",
    "published date": "Sat, 31 Jan 2026 00:49:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE13VWVKcnhRLXZXRFJZX2VXdjdoMlRKRzJ1SlZyazFwM0Zob0RGeFlWb2dxOVVkbUpjY0Ffb1hTUi00T1prSjg5bng2bXhxc3lyUGFtVVgtcER5V050Tmlfc3Utcjh5UWlzOXRZR1BQY3A?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Israeli Military Found Gaza Health Ministry Death Toll Was Accurate. Will These Deniers Admit It? - The Intercept",
    "description": "Israeli Military Found Gaza Health Ministry Death Toll Was Accurate. Will These Deniers Admit It?  The InterceptIsrael accepts health authorities’ Gaza death toll is broadly accurate, saying 70,000 have died  The GuardianIsraeli military reportedly acknowledges 70,000 killed in Gaza after previously casting doubt on health ministry’s count  CNNIDF believes 70,000 Gazans killed in war, as claimed by Hamas; civilian-combatant ratio unclear  The Times of IsraelIDF accepts Gaza Health Ministry death toll of over 71,000 Palestinians killed in the war  Haaretz",
    "published date": "Fri, 30 Jan 2026 20:35:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQdjZSZnNsbmh2LUxxSjZkZGZ1R2RzVVpycmxQMkExSDcyQnFEb2xZakFUY01wVXF1elNGR2NzQnBpR3NveDc1bDhOTUNaLWhaZXNKeGl3b2JnQXVJOTM1VWFhdE5OUW1CcGcwaEI3dThXWEd1dHZ0SWRhejlOc3MtZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theintercept.com",
      "title": "The Intercept"
    }
  },
  {
    "title": "Iran to label EU armed forces as 'terrorists' over Guards blacklist - Reuters",
    "description": "Iran to label EU armed forces as 'terrorists' over Guards blacklist  ReutersIran warns of ‘hazardous consequences’ after EU designates Revolutionary Guard as a terrorist organization  CNNEuropean Union Labels Iran’s Revolutionary Guard a Terrorist Group  The New York TimesHow the EU’s internal resistance on Iran finally cracked  politico.euIran: Council adopts new sanctions over serious human rights violations and Iran’s continued support to Russia’s war of aggression against Ukraine  consilium.europa.eu",
    "published date": "Fri, 30 Jan 2026 12:32:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxObUZuSmpyVG1wUG9vR3RzQ0ZSRk4yVGdaeGw4c1ZTLUhlVndMd3hvSUZnaTllRzhqaHB0MDZuSlFzU003bXdOMnBreXVKUE5iOWFHdG5Ja2dJZk9VWFlxVmFKZ1R1ZGRjWFppeEIwOXJkT2ZhdUFYa25oVUN6WngwYVZPWnRoaktCeDVOaTY4Xzh0b1ZYX3puSmtrS3R1QVI2ODFkOWtsZi1WNGtIYWs4a0drMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "At least 170 killed in air strikes during Myanmar's widely criticised election, UN says - BBC",
    "description": "At least 170 killed in air strikes during Myanmar's widely criticised election, UN says  BBCMyanmar election delivers walkover win for military-backed political party  Al JazeeraThailand proposes 'calibrated engagement' with Myanmar's next government  ReutersMyanmar crisis deepens five years after coup, as military ballot entrenches repression  UN NewsASEAN does not recognize Myanmar's elections, which military-backed party claims to have won  AP News",
    "published date": "Fri, 30 Jan 2026 13:12:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBCSW5pdmFEeEZnVGtUUU1lcF85T3Mtelo0amlMUHQ1ZFJlVTV5eG56Uldqa2JrblpzQTZoVWktejNSWkJOMVJ3RDRrSUlkVkVqTjNLMUxXVy1UZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "MSF statement on sharing staff information and humanitarian operations in Palestine - MSF - Médecins Sans Frontières",
    "description": "MSF statement on sharing staff information and humanitarian operations in Palestine  MSF - Médecins Sans FrontièresMSF says it will not hand over staff details to Israeli authorities  Al JazeeraMSF says it will not share staff details demanded by Israel to access Gaza  ReutersDoctors Without Borders Will Not Share Staff Details With Israel Following NGO Suspensions  HaaretzMSF withholds staff lists from Israel due to security  The Jerusalem Post",
    "published date": "Fri, 30 Jan 2026 11:57:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUVhYSHpmVEtkSGFhbWdLZ2pUa2VWVDZwRlQ1M2ZyOWJoeFBhMDJkWFlfY3ZON2VTci1Vb3ozaUhSTUJ2QVRxMWhiVTh3blk0T1lEdGludjZ4TGNGVldVaEJncm5aVXNOdThFSmlPdXVOM2pNSFdVTWtHYjBScW9JN2hjczNmaHdsR1BXZ0VPazBZOFFDSXFLaGxGZFdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.msf.org",
      "title": "MSF - Médecins Sans Frontières"
    }
  },
  {
    "title": "How big a deal is the EU-India trade agreement? With Nicolas Köhler-Suzuki and Ajay Srivastava - Financial Times",
    "description": "How big a deal is the EU-India trade agreement? With Nicolas Köhler-Suzuki and Ajay Srivastava  Financial TimesThe post-US world is already taking shape – look at the massive EU-India trade deal  The GuardianOpinion | The EU-India Trade Deal Is Boring, and That’s a Good Thing  The Wall Street JournalAll Roads Lead to Modi as World Hedges Trump  BloombergIndia to slash tariffs on high-end EU cars to 30% in boost for luxury carmakers  Reuters",
    "published date": "Fri, 30 Jan 2026 05:01:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1pUlExZ1V0ajBNTE1MMFAzNmJfM2NsM0YzZC1HNFpxSHB5UzNMOGVtZl9qZnc0QS1vNTh6NUlfVHBYNTFnVG9ldDhoa0g4eHRLM1JXZTdUcTdXYWJhUFBrcmNNdEZnV1dpOFhHTU45QmY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Xi’s Military Purge May Set Back His Taiwan Ambitions - The New York Times",
    "description": "Xi’s Military Purge May Set Back His Taiwan Ambitions  The New York TimesWhy Xi Jinping Has Purged His Top Military Leaders  BloombergExclusive | China’s Top General Accused of Giving Nuclear Secrets to U.S. - WSJ  The Wall Street JournalOpinion | Why communist leaders purge their generals  The Washington PostChina & Taiwan Update, January 30, 2026  Institute for the Study of War",
    "published date": "Fri, 30 Jan 2026 13:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOcUtiUW5oMnV0Z1dUT3pmODhFVG9oNWVmVlNUYmRIYXBveGZZQm9MSFFQR0Nhem9wYXF5M1dmNkdMX09faHZYcjRBY01NTlZ4N3dPakRUWUpQS3d5MjdBWE5BZXQtS0MtRWI2YmY1VGhtYzFXcDJ5TkdnRWY5R3VGTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "South Africa tells Israel's ambassador to leave - DW.com",
    "description": "South Africa tells Israel's ambassador to leave  DW.comSouth Africa orders expulsion of Israeli envoy, declared persona non grata  Al JazeeraSouth Africa and Israel expel each other's envoys in diplomatic row  BBCSouth Africa expels Israel's top diplomat over social media posts insulting Ramaphosa  PBSSouth Africa expels top Israeli diplomat over ‘insulting attacks’ on president  The Guardian",
    "published date": "Sat, 31 Jan 2026 01:06:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPYS1meUZTTDZPVUlNWmJneFBibzNCcFpKZEdtVW5rZ042QUJzVlVLVVR1b2dmcF9YaG0wVXE4M0JqYXY4LTRFTGZEUmwyNlVzMVNBc3oyQmI2X1FMc0pRRVplRVZKOVM3cTRoam9EUW5XNDJNQldTb1pzVWdGRzBQRnB2WFRyQdIBhgFBVV95cUxQeU9welN3NFVQVDN3NFZGSzJRUWV5LVRnbmk1X1FNNXRWRGttX0dRSXU4ejRHWGNVY0lVSHNNSVVRc3NybkZDY05PM29EOF8tNHd5bG5zRkJRTHBDdzU5LVV5V2NPUlVhYnZjVkVLVjBjakctMzhJTmxpekVfdVU0UmdjVXFrQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "'We are all used to this' — Inside one of Kyiv’s hardest-hit buildings this winter - The Kyiv Independent",
    "description": "'We are all used to this' — Inside one of Kyiv’s hardest-hit buildings this winter  The Kyiv IndependentUkraine, Moldova hit by massive power cuts  DW.comHow Soviet urban planning is helping Russia freeze Ukraine  BBCUKRAINE HIT BY BLACKOUT  Українська правдаKyiv Seeing Widespread Power Outages With Metro Also Halted  Bloomberg",
    "published date": "Fri, 30 Jan 2026 10:11:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQXy1sdldrLThuQkhFRWdfQWpJaDlMdEtCRng0VjNoY3JuTnVseVBqcVAzYURIMUM0OUpqQmc5c2doTms4QkN2ZTJVUHZraVkycmdGdVhCWk1JLUhEUDNpSVBtUF95ZXB6dmU1cUR4Z2d3WHZXRHJ4eW52YnVKaTlqZ1hmVkVhZDJEY2JMcUxHeE5iVkJjcHdHLVpyTFJLMUFUbzJhMHBlUnJLZ1NGcTdj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Communities unite to address stigma and discrimination affecting people with neglected tropical diseases - World Health Organization (WHO)",
    "description": "Communities unite to address stigma and discrimination affecting people with neglected tropical diseases  World Health Organization (WHO)World NTD Day: The diseases we don’t see!  Times of IndiaFrom a snakebite survivor to an active health promoter in South Sudan  doctorswithoutborders.caMedia key to eliminating Neglected Tropical Diseases – REMAPSEN President  GBC Ghana OnlineNews - World Neglected Tropical Diseases Day: Paul-Ehrlich-Institut Actively Contributes to Global Health Through Research and Regulation  Paul-Ehrlich-Institut",
    "published date": "Fri, 30 Jan 2026 08:10:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPV1k1X29SMmZSbHJxdE5rcG5iT1gyMUtPSm1veHhORFh2emFaY0wxeXJVQnRsSFhFRWlwU0FHSkV2V24yTmgzQWs2aW5meDZkb2ZHQi1EZFRMajRyY1IwbWlYa2pFZTFKUXI5UERwZGFhTDZPMmR6U2hQVUFIN000djlVNURvRWdMWUhTci1VMmJNcU44dGxHNVJrd1d4dHBpemd3YlQwUldNNUNBTjlyU2hzUzV4M0hLNUtlaHN4VWVPQ2JtbmVxM1VFTGk5MUplNjJuTExMTnpROTVEQnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.who.int",
      "title": "World Health Organization (WHO)"
    }
  },
  {
    "title": "New Zealand declines invite to join Board of Peace - Reuters",
    "description": "New Zealand declines invite to join Board of Peace  ReutersOpinion | Trump’s Board of Peace Is Anything But  The New York TimesTrump’s wide ambitions for Board of Peace spark new support for the United Nations  AP NewsWhat to know about President Trump’s Board of Peace  NPRTrump’s ‘Board of Peace’ puts rights abusers in charge of global order  Al Jazeera",
    "published date": "Thu, 29 Jan 2026 20:28:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPbEFfeHpYYjk2Q1hVTzRlVlNXSWgxblV2TGk5VGxZRHJ0a1k5WWt2RVZCQTVYV1ppWVhfS1NKUzBac3JtQXUxcjdZcm45REVFWUR6TXlraGJKNi1DR1c5Z2ZGNFVac0FsVHVHS0dXc0NzQmJaZ2JxOWM3a0tpME1TZjVPRGpEdVFKeTRkbW5Oa0ctRmRQWVcySkhiMGhrSDVx?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Islamic State claims attack on international airport and airbase in Niger - The Guardian",
    "description": "Islamic State claims attack on international airport and airbase in Niger  The GuardianSuspected jihadists attack airport near Niger's capital  BBCNiger military gov’t says France, Benin, Ivory Coast behind airport attack  Al JazeeraGunfire and explosions heard near airport in Niger’s capital, residents say  France 24Islamic State claims responsibility for attack on air force base in Niger’s capital  AP News",
    "published date": "Fri, 30 Jan 2026 19:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQVTlfcy1rZnNsU3JibWpPTDNsMUNQT1VkTUQ3ajRRSm5JeUFWWmxtY0JNUnlkY2ZGa1ZmeUNjTXBCMHRDc3RiYnlVaVR0c2locEJuejNNdF85WGRXeUFGVjlxWDJ3aWktUDNnYmFwMm5KdVNFMmw5a1hRaXo1ZFFPZURVODkxRGd4MWJ0MUx3M1VTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Scientists \"quite surprised\" to find one polar bear population thriving: \"A fat bear is a healthy bear\" - CBS News",
    "description": "Scientists \"quite surprised\" to find one polar bear population thriving: \"A fat bear is a healthy bear\"  CBS NewsBody condition among Svalbard Polar bears Ursus maritimus during a period of rapid loss of sea ice | Scientific Reports  NatureThese polar bears are getting fatter as sea ice melts. What's going on?  National GeographicSomething very unexpected is happening to Norway’s polar bears  vox.comSvalbard Polar Bears Are Getting Fatter (for Now), Study Finds  The New York Times",
    "published date": "Thu, 29 Jan 2026 17:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOVkl4QVN6VHZIVHFWVWo1NkF4TTNWMEQtUDdqZ2hadDhvR0NOaUtrZzlJNDVXYW9VcHJORlZXSEpCeG9zeU5veF83MVpXRThiRkNtVkJlQXJFbDdORTFGUEo5alFNQ0dEckRsZzFKQWxSc01VRGFwcHFsU3FSREoxZGR5MDNjMnpKYnJCZFZ5WE9kV0M3a1FycVp5bTV3X2_SAaQBQVVfeXFMUG9INFhpaThuRE1YUENUNEE2UzJXYUNUbU5zSVg2Q3czbndoMFM1RklUNXJlMUc0RHhIcFJCREJoeHdnM1dWekI2bHZ0eFVKNGRValBsVTh6YlJyY201YkhmMzBZTDRSQi1tY0NCcjE2UmFqcWZkbVlTc2RSUm92d0lwVmhRcENqVHJOUHRhLUZOTEVxbnNVaENsTXQwOE9GUUZVRmY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "The Pokémon Company Apologizes For Listing Fan Meet-Up At One Of Japan’s Most Controversial Sites - Kotaku",
    "description": "The Pokémon Company Apologizes For Listing Fan Meet-Up At One Of Japan’s Most Controversial Sites  KotakuView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 15:00:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBZS1dFUkNSeTJyNkg2QnFmallXeXhXUWRuaGZXcGhoMUdIZ2w3MWFFT193Mkdxa1VzYzc3OHFaRU5FMGJjUFNfTGdNNmg4Q3lYQTF4QVctU0J1c0t1QmtNclRVMi00TkkxZWxhMWNxaUpjMDlxN21iRURBNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kotaku.com",
      "title": "Kotaku"
    }
  },
  {
    "title": "Trump’s Greenland play comes with Russia and China running circles around the US in the Arctic as expert sees ‘big game of catch-up’ - Yahoo",
    "description": "Trump’s Greenland play comes with Russia and China running circles around the US in the Arctic as expert sees ‘big game of catch-up’  YahooWhat to read to understand the Arctic  The EconomistOpinion | Greenland isn’t the answer to U.S. Arctic security. This place is.  The Washington PostUS, Europe fall behind in the race to control the Arctic  ReutersOpinion | Trump Is Right About the Arctic. He’s Wrong About Greenland.  The New York Times",
    "published date": "Fri, 30 Jan 2026 17:26:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQLWwyby1qM0FSTnVrSUFvQmdTOEQyNVdHOTlaWlczam1UVURtUml0X0FzQkN4ZmJJbmJ3ZW9BWmxqUkNnQ0lVVkRWWnRIRmVkNGgwZU9ibXN3akVSWjJpcHB0QUplNkw1MVBRNmJnWkthajBMVjBEZjFhRkt3TEJBWHlXWFVLYnZPVE5xcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.yahoo.com",
      "title": "Yahoo"
    }
  },
  {
    "title": "World discovers it can hedge US trade risk - Reuters",
    "description": "World discovers it can hedge US trade risk  ReutersIs 'America First' starting to backfire as Washington's allies go it alone?  CNBCThe implications of U.S. allies seeking new economic partnerships  PBSTrump threatens fresh tariffs on 10 countries in almost as many days  Australian Broadcasting CorporationThe World Files for Economic Divorce from America  Paul Krugman | Substack",
    "published date": "Thu, 29 Jan 2026 15:40:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQNndrNnFFRlFaODJ2cFhURWRodnktWGJoV2xCSi03d2VzdVU0SFdQVF9xSl8tenZRVm1fRGhGUVEwSDJkWk56MTBrRFowVF90ckx3LTR5Z2NIUXk5QTM1d3FVWk11NTZSbmxIT1B5czBELWM2cXh0TmFLNTFlcG1lZW1XNW80a3J3V2dKSU1VbTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Russia’s War Death Tally Spurs European Scrutiny on Recruitment - Bloomberg",
    "description": "Russia’s War Death Tally Spurs European Scrutiny on Recruitment  BloombergZelenskyy seeks 50,000 Russian ‘losses’ a month to win the Ukraine war  Al JazeeraRussia faces a heavy price for limited gains in Ukraine war, death toll estimates suggest  NBC NewsRussian Military Deaths Surge, Leaving Kremlin Short of Troops Without New Mobilization  UNITED24 MediaRussian army loses another 880 soldiers and one air defense system in war against Ukraine  Ukrinform",
    "published date": "Fri, 30 Jan 2026 05:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQVE5tX2l3TWhFaGVYLW5oa0IydGNuR1Q5YmVnZ1VHcGxBOTZIT3AyVktFMVh0S0wwWFg0SEVkV2tGMV8zRXkwc2tBRGNMeEJUU1ZFdWJ1d3prd20yTk1UUzNHelBTQkFQNFZhRzltbV81TTZhQ2tjTkRael9ib0t6Ql95TFZSdEMzM0w4VTNQNHE1NUJDTzhBVy1jSW5uZEJfYXJHT0hTeDhUalk0WTZodWFuVjk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg"
    }
  },
  {
    "title": "US pitches Venezuelan crude to India as its Russian oil imports slow, sources say - Reuters",
    "description": "US pitches Venezuelan crude to India as its Russian oil imports slow, sources say  ReutersIndia to buy oil from Venezuela instead of Russia? US pitch to counter 25% tariffs - The Times of India  Times of IndiaQ&A: HPCL's Vizag upgrade to boost gasoil, crude slate  Argus MediaHPCL Denies Report on Talks to Procure Venezuelan Crude  TipRanksIndian Oil diversifies crude sourcing; eyes green arm listing  The Financial Express",
    "published date": "Fri, 30 Jan 2026 22:27:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOZERlcnNYbVV0ajF0UnFBamxacEhrU0lZc3pxT2VzQmstWndzZTVHYkdzSEhRSGhZRHVHR3g1dDZNSmVoNFMzSlFEaDBsd2E2X01zWFM3SGZIZThtRXJ4a1paRmhhd0ZVZHpnNWJsM3NhdWJ3T2VaRU1KWF91RjVvby1aTkVWaWNjaXRzdGtWbGFqVEFFdndrcnp0RFhLcnY4VnhnVTJVNlFxMlNhd09YdjBEeHBQSlVFNEV1eWRKZ0cyeV9l?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Book Review: ‘The Oak and the Larch,’ by Sophie Pinkham - The New York Times",
    "description": "Book Review: ‘The Oak and the Larch,’ by Sophie Pinkham  The New York Times",
    "published date": "Fri, 30 Jan 2026 10:00:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOYXhTMG5mZnRWMnk5RG9TczJYZTVrWkktZTcwMmx0NFVId1BsaGo0elAzTjYtcEtyOW5RX3h3SE40Znh2RUx5LUY5YmhzREUwTEltVG9vcDdtUVJ0WHY3V3ZWYVB0b0Y5VWRFQ2V0VUI2clQxNGxoX01xell6a3otOGRrQ2FkVGk2RzV3MFdJLUdnMDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Russian Negotiators Reportedly Apologize After Deadly Train Strike in Kharkiv - Kyiv Post",
    "description": "Russian Negotiators Reportedly Apologize After Deadly Train Strike in Kharkiv  Kyiv PostPanic on crowded Ukraine train - passenger describes moment of Russian drone strike  BBCRussia strikes civilian train in Ukraine, killing five, in an attack Zelensky calls ‘terrorism’  CNNRussia Escalates Drone Strikes on Ukraine’s Railways with Seven Attacks in 24 Hours  Kyiv PostUkraine war briefing: Nato chief warns of ‘harshest winter’ in a decade as Russian attacks cut power in Kharkiv  The Guardian",
    "published date": "Fri, 30 Jan 2026 14:26:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTFBXdzZDYjBmRl9UT2wwZ25mWkpXdDhJNXNPTnJWejVmN0NUUVM0cVpfdVhLbWY2dGFPUlA2Wlp6c0dCdlVXSll1SXA2Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kyivpost.com",
      "title": "Kyiv Post"
    }
  },
  {
    "title": "Yemen: WFP stops operations definitively amid Houthi threats - DW.com",
    "description": "Yemen: WFP stops operations definitively amid Houthi threats  DW.comUN says Houthi seizure of telecom gear threatens Yemen aid  ReutersWorld Food Programme terminates all staff contracts in rebel-held Yemen, UN says  Euronews.comThe UN says Yemen’s Houthis removed its assets, equipment in latest restrictions  AP NewsWFP to Terminate Operations in Yemen  Yemen Online",
    "published date": "Thu, 29 Jan 2026 14:22:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNalBqaXEwcGgxVXNaZU11NmoxWEw4b3VOVTRfcG1OaXd0UWIxeXIyMjZ1N29GSl92aXpQbThFZlZCbGI4VnR6WlF2anpsRFhTX0FqZmhVMENlUHh3NlFNRUN5WFNlRWlqNVpHQ1kxX25QWURhb1BReFgzYVMtZzJQajIzNmYzYUFtc3RhX1ZoSFV3VDlCUGV30gGXAUFVX3lxTE1HTkJTZ2JwaW5DR3RCV0dlMVJ0VmVyRG9SYmh1eFZiVkZveTFoT1VEaTlTeVJZc1dDM3dmbnNwOXN2b3dmeTNPNl9Bd3JLSDMxMHRxTEJ3N05LQmNPblgxZW5zUlZqbHhYbWd2UkhNU3BGbWlPRTNERWdVMW1NcmhIeHl0ZzVYQUpUX3BIRnIwOUdmYS0wOWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "China executes 11 members of Myanmar-based group in crackdown on scam operations - NBC News",
    "description": "China executes 11 members of Myanmar-based group in crackdown on scam operations  NBC NewsView Full Coverage on Google News",
    "published date": "Thu, 29 Jan 2026 13:04:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNS2tLSVBabHJCb3d3SlNDRE8yby1oU2VIYW54Qnhkd3MxalFiekMwZy1qU3Q5d0xEc0Z6TlVyR2cwSldZWHk5cTZBS2g5SmlBZXZPRVktQVBocFFZSk5rLUdzYTNFUlMycDhlSlgwV3BLQnlNeDFvMUM5YzR6SWQyMGhyQUJjRE9OZlBXcUNpaHlaODg5TVJCa2lwSDdpVnY2SzJNbHhKczM4ZjN0MlFZWEw0TVlacGFa?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Pope holds surprise lunch with Peruvian bishops - Vatican News",
    "description": "Pope holds surprise lunch with Peruvian bishops  Vatican NewsPope to Peruvian Bishops: Live like the Apostles  Vatican News'Peru holds a special place in my heart,' pope tells Peruvian bishops, surprises them at lunch  National Catholic ReporterLeo XIV receives Peru’s new ambassador to the Holy See  aleteia.orgPHOTO GALLERY: Pope Leo XIV arrives unexpectedly in Rome to dine with old friends from Peru  ZENIT - English",
    "published date": "Sat, 31 Jan 2026 10:36:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQR005NVQ0VXkxLXFscTFoRW9jYmxjTWs4em5nZHVvczRyU2k3ajQwd05rWTR1UkhWNkd1aUc4RDdSdmpJOUp0cklsMFhiSE1wVnd6eGFwOElHdFBaSkc2LU1IbWMzVTZvVEJ6UDdNaExSaElOSU82NFVjVDBYNEZCNjc3dUVMYW5tSklxSm1VaDRDMENMZUZabU83M1ktRm1UVVRoeE5JQ05ZcDAz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vaticannews.va",
      "title": "Vatican News"
    }
  },
  {
    "title": "Trump's trade minefield squeezes America's allies - Axios",
    "description": "Trump's trade minefield squeezes America's allies  AxiosOpinion | Forget TACO. It’s GUAC that matters with Trump’s tariffs.  The Washington PostTrump Returns to a Familiar Role: Sowing Trade Chaos  The New York TimesTACO Tracking: Trump Carries Out Just One in Four Tariff Threats  BloombergTrump ratchets up tariff uncertainty as spot rates continue to slide  Lloyd's List",
    "published date": "Fri, 30 Jan 2026 17:46:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ia09DX0toRXY0ajh0TkdFMTdmU0xkOTdvZTFQNFVIYWZjUFBkcWZ0Tld5a3dlVG52bkJkR2huTXZsRnNKTW54QkQwX1dPLTNTRVM2UFVtUGNoOEJ6MU5lZExlNXZVWnNVTUxGVEVBaFhsSnhadVJV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Moscow records heaviest snowfall in more than 200 years, meteorologists say - Euronews.com",
    "description": "Moscow records heaviest snowfall in more than 200 years, meteorologists say  Euronews.comFootage of massive snowfall in Kamchatka is AI-generated  YahooAvalanche of fake snow images from Russia's Kamchatka Peninsula hits social media  SnopesMoscow Gets Last Brunt of Winter Storm Ahead of Coldsnap  The Moscow TimesMoscow sees heaviest snowfall in 200 years  ITVX",
    "published date": "Thu, 29 Jan 2026 19:09:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPdjNRelFlUkJzckczRmVNdWdsV09rX3h6Qi1Kclp6Y2tOX0dDNXBUNUFNODN4LTRHbXl4WUYxYzdGNVhadkNkQ1JaM2Z2eGl2MW9sSXYzRWs1ekw0YWtVbWVaa1cxdXZFNmpPQVZmNldJZHpkRllsV2YxRlRQVjhXc1JHVEJyTllnamhpT0VESkhacmFZT2pVaTl6SVpWcWxSTnNXV2M5aFVFLVRjRWZZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "US changes CMCC leaders amid uncertainty as to its future - The Jerusalem Post",
    "description": "US changes CMCC leaders amid uncertainty as to its future  The Jerusalem PostUS changes leadership of Gaza mission amid uncertainty over role  ReutersWhite House replaces civilian, military leadership of Gaza 'coordination center'  thecradle.coTrump says Hamas 'looks like they're gonna disarm' during Gaza ceasefire [Video]  AOL.com",
    "published date": "Fri, 30 Jan 2026 11:04:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE1xVVVCTUNQZDBXeTk3OW1CRlBvb2t6R3FwUHNTMDdTTHk3YUUxNmF0dEZUV21CdV9OQTNucGRzUkhlckRsbE00bnRNbHB0cV9Jdzk5bmlVVURYeHlM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Belarusian balloons full of cigarettes pose NATO’s latest security threat - The Washington Post",
    "description": "Belarusian balloons full of cigarettes pose NATO’s latest security threat  The Washington PostNATO Hit By Aerial Incursion From Russia’s Closest Ally  Newsweek‘Hybrid-type incident’ triggers Polish airspace restrictions on Belarus border  TVP WorldPoland Lodges Formal Protest with Belarus Over Escalating Drone and Balloon Activity at Border  112.uaSmuggling balloons from Belarus trigger temporary flight restrictions over north-east Poland  VisaHQ",
    "published date": "Sat, 31 Jan 2026 00:47:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOU3NyQzlDRWxtV2lnbnZ5RjdiX2lncnJKMlNOSmVQME9aeW1LNnJRN0M3RlVIN2dxRGdVTzJLczZGUXRTNGhWVkhOWVMzZGdZVEt1TWYxWm1xdkg4WHFSOHp4bGxub0tTRTdKemJuS2N4NDJndkx0UklUZzhMR0FxSS1SZ0s1TGhNMlVuVg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Poland Signs Deal to Build €3.5 bln ‘Breakthrough’ Anti-Drone Defense System - Kyiv Post",
    "description": "Poland Signs Deal to Build €3.5 bln ‘Breakthrough’ Anti-Drone Defense System  Kyiv PostPoland Inks $4.3 Billion Deal for ‘Drone Wall’ to Deter Russia  BloombergPoland’s Historic $4.2 Billion SAN Anti-Drone System Contract to Boost Defense Capabilities  UNITED24 MediaPoland Shows Hedgehog Defenses Laid Across Its Border  NewsweekPolish Delegation Visits Embraer to Review C-390 Millennium and A-29 Super Tucano  MILMAG",
    "published date": "Fri, 30 Jan 2026 13:40:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE82WVBxUWw4TjR5NTFOS1pwdVpfSjNNeHhUSXRxRmM2NTlZOE5KWXcxR1Fvak53cWFHem4tSGJSRmpHVjJGcW9IaTRHbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kyivpost.com",
      "title": "Kyiv Post"
    }
  },
  {
    "title": "Russian Offensive Campaign Assessment, January 29, 2026 - Institute for the Study of War",
    "description": "Russian Offensive Campaign Assessment, January 29, 2026  Institute for the Study of WarRussian Offensive Campaign Assessment, January 30, 2026  Institute for the Study of WarRussia-Ukraine war: List of key events, day 1,437  Al JazeeraISW Russian Offensive Campaign Assessment, January 30, 2025  Kyiv PostMoscow dismisses US approach to negotiations - ISW  RBC-Ukraine",
    "published date": "Fri, 30 Jan 2026 04:12:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQR3hMaF9BanZUdzllYnhkT0FnUDBkYk5hUjRnZE9lR1BNRDdrUHpxbGZINFBrU0JNSmt4cjZxam81eHRLSVVvRXpfRDc1WHJrbi1EdGdvVFNuRmU2aTVXdHFadFBvckhpdjhrSV9kMzFJaUFhXzVONWc1YVA0UnhydzlTRzk2M3c5TEdlNm5uR1JUbHJ4bm5OMUFsWDJORmxJSF9UNUpaczBVOTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://understandingwar.org",
      "title": "Institute for the Study of War"
    }
  },
  {
    "title": "Trump’s Waterloo? by Harold Hongju Koh - Project Syndicate",
    "description": "Trump’s Waterloo? by Harold Hongju Koh  Project SyndicateRinse and Repeat: Western allies ready for next rollercoaster with Donald Trump  CNNThe end of ‘Pax Americana’ and start of a ‘post-American’ era doesn’t necessarily mean the world will be less safe  The ConversationIt is time world leaders matched Donald Trump’s game | Letters  The GuardianNo, the International Community Isn’t Dead Yet  Foreign Policy",
    "published date": "Fri, 30 Jan 2026 09:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQekNyQVk2V2szWU8tQ194aDlUNmhPVHNOMG4xbVFualZ4eWxPMUNRWHJDV3Q4RWZWTy0xZ1ZpeEVkYTVnN2FOOS1hQVhTUWN3bE8wek9aVnZxYWhiajMtM0JYbEpCYTY1QzZuWlN4c0tHWU8zVU1PeEFZWVpnbFhoakRCbWNCN2dGcHdQcXJqbm0tYmFsWFRtLXdZY19XZ3pZU0YzLUstUTh6UFkzNGZLdVpGZmM3S0llYnZQY1Fpa05TLURuVEF1WGN2eWpUTWlORGRQQkV2T2J6R2RDM3F6TDJzUFNvTXNVYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.project-syndicate.org",
      "title": "Project Syndicate"
    }
  },
  {
    "title": "Ex-Nigerian oil minister did not take bribes from industry insiders, court told - BBC",
    "description": "Ex-Nigerian oil minister did not take bribes from industry insiders, court told  BBCEx-Nigeria oil minister in bribery trial spent £2m at Harrods, court hears  BBCNigeria's ex-oil minister Alison-Madueke given 'luxury' life, UK bribery trial told  ReutersEx-Opec head confronted tycoon over his threat to ‘take her down’, court hears  Financial TimesNigeria: Everything you need to know about Diezani Alison-Madueke’s corruption trial  The Africa Report",
    "published date": "Thu, 29 Jan 2026 19:38:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBFcDZyVVhUa2tSS0lJQkhLR0RzRUtpS0Nzd1JjVlBtRlhLSi1ua2syaFNBYjNKd19tNHFhakZjNmZSczd0T291emxmeThjakZ5NDRkOVloWkdRUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Burkina Faso junta dissolves all political parties - DW.com",
    "description": "Burkina Faso junta dissolves all political parties  DW.comBurkina Faso’s junta dissolves all of country’s political parties, saying they cause divisions  AP NewsBurkina Faso military government dissolves political parties  ReutersWhy has Burkina Faso banned political parties, and what’s next?  Al JazeeraBurkina Faso junta announces ban on all political parties  BBC",
    "published date": "Thu, 29 Jan 2026 23:07:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNTHl6Zno5MDlmNU9PZjctN042R2lIM0Y2VGRSbnFFY0MzUWZsOElTME5BWGhaUXhPUFN1eG1YRmVLakZXamtXNGdFX2IyaGpkVENydHI2UGJxREVnOXc1Vk5PMDVFNWJnWHFKelVjY2ExdDNOMzdxTWZlUmJCOURKS1lCOFVKeUFOYXE40gGLAUFVX3lxTE12ZE1xb1UyMHVFdGpRZldCd09UemNIUWJHV3hsZFpfTUNlbU5oX0JNNVV1MUItOXdmN0hiYVBBTDZ5Wm1sVnhsYUw3TEVZQ1poM2ZsQzNFSTl1bGlnVlYzNWpOc1dVZDZWYzdDbWh3NGZVc1hod3habTJjNnQ3aGdLMzd2YjNla1F6bjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "5 things to know about UK’s new passport rules for dual citizens - Vanguard News",
    "description": "5 things to know about UK’s new passport rules for dual citizens  Vanguard NewsNew U.K. Dual Citizenship Passport Rules For 2026—Explained  ForbesMore than 1m Australians on notice over UK immigration change  AFRFrance Joins Spain, Italy, Germany, Belgium, Netherlands, and Others in Facing Several Regional Travel Changes Across Europe as the UK Is Set to Implement New Entry Rules Starting Next Month: Everything You Need to Know  Travel And Tour WorldUAE Travellers Warned: UK to Enforce Electronic Travel Authorisation From 25 Feb  VisaHQ",
    "published date": "Fri, 30 Jan 2026 14:33:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPaTM0NTBZVGZ3U3h0VEVpbDdtbWFJM2tBdkZFYUFnQmk1cm5yd3ZlX2drNndvWWJDQmZfcXlpY05HMTdnaVRBZzJib2ZLRjY0SzluUGpsWGVCWkZ2NzJhczBzOWttMG0wS2pMeFdhUVhMX2U0ZDhNTmIzVDRRRU93dHpvVzZxXzRjNzIwdkMwNTJoSThGS1JjR0t4WXpabXMtMUHSAacBQVVfeXFMUGZmZ2o4Skc2WkgtYkxCaFZzZnJOakZCT2tJUzVNeXh1Smh3bno1ZlZyOWdHcnpOZFN6V0ltb1ZIOU43Smd3aWd4UUJGUzd2VE5vOFVFQjlFTHpaVTBKT20zVFk1bWZxeE1tZkVpQ2JmbExpYkRLaFFWUTg1bDJPUm95bi1PQ2huUzlhUXFFTmw1VlNCajlDNVhqSGxRSkk4RWw5bGhTNzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vanguardngr.com",
      "title": "Vanguard News"
    }
  },
  {
    "title": "Lockheed Confirms RQ-170 Sentinel Spy Drones Took Part In Maduro Capture Mission - The War Zone",
    "description": "Lockheed Confirms RQ-170 Sentinel Spy Drones Took Part In Maduro Capture Mission  The War ZoneRQ-170 Sentinel Flew in Support of Operation Absolute Resolve  RealClearDefenseU.S. Ghost Drone and Electronic Warfare Dominate Skies  조선일보Lockheed CEO: Air Force RQ-170 drones used in mission to capture Maduro  Defense OneLockheed's RQ-170 drone used in mission to capture Venezuelan leader  Interesting Engineering",
    "published date": "Thu, 29 Jan 2026 18:52:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNM0IyQl9kUnBKZk0xcmRoZE1XaFZKQzktRnlveG9FWGJXR2t1bzNYd0lGa2NybEVKTkdoYTFJbFlnWXRDUHpfWUZJWW9kUEt1QlFJWjIybzRYUnNoekNCdUpqelNPLXBEUk1pVVpEX2RVNDFqcDNnM0JzQW9YVHd1OFRld2k3djNPYmhxUUFCVUtaQTB6ZVc5UDRNazdGdUFaVjU0RkxBSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.twz.com",
      "title": "The War Zone"
    }
  },
  {
    "title": "CofE priest erupts during election service of first female archbishop of Canterbury: 'I object!' - Christian Post",
    "description": "CofE priest erupts during election service of first female archbishop of Canterbury: 'I object!'  Christian PostSarah Mullally confirmed as 106th archbishop of Canterbury  Episcopal News ServiceFirst woman to lead Church of England in its history confirmed in ceremony  OSV NewsMore liturgy, fewer lectures please, Archbishop of Canterbury  The TimesWill the new Archbishop of Canterbury be any different?  anglican.ink",
    "published date": "Thu, 29 Jan 2026 16:04:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOXzBzcTdpOGRibGZuVkgwTEk3U28tYmpBVkQzUE1ieE85Q2xOWWdldUVJSDVVTHNhVEZYQnBKZWVWbERpajZrZkJkM3cwYUlfUUdTRFMtcEExVm16V3Fkd2k1LUZDLUVCcDQxTjVuNzA2SHQwYVNZS3IyT0ZNNFhVQjBnaC1Ma0tIN0FQRFVuY28wZzlZclJxcldqeS1GRDR1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.christianpost.com",
      "title": "Christian Post"
    }
  },
  {
    "title": "Ukraine receives 1,000 bodies in latest soldier swap with Russia - BBC",
    "description": "Ukraine receives 1,000 bodies in latest soldier swap with Russia  BBCUkraine receives bodies of 1,000 soldiers from Russia  Al JazeeraRussia Returns Bodies of 1K Ukrainian Soldiers in First Exchange of 2026  The Moscow TimesUkraine returns to Russia body of soldier Moscow presented as fallen Ukrainian defender  Українська правдаUkraine repatriates 1,000 bodies claimed by Russia to be fallen Ukrainian defenders  Новини про права людини",
    "published date": "Thu, 29 Jan 2026 13:31:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE92ZXpnU0N4MzNBQXlzd2ZOWEl4Nm1CYlFoTDFNNHVBaVA2c0ZLYUJsNVFoR1BOemRxemFDUzl3dzU5MlVSQTVLWGJMTGpKMEMtczdZcXR0NU9ndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Criminal Charges Pressed Against Budapest Mayor After Hundreds of Thousands Defy Pride Ban - erininthemorning.com",
    "description": "Criminal Charges Pressed Against Budapest Mayor After Hundreds of Thousands Defy Pride Ban  erininthemorning.comHungarian prosecutors charge Budapest mayor over role in banned LGBTQ+ march  CNNHungary announces charges against Budapest mayor over Pride events  The Washington PostBudapest mayor charged over Pride parade  DW.comBudapest's liberal mayor charged for organizing banned Pride event  PBS",
    "published date": "Thu, 29 Jan 2026 23:51:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9DUFU3VDJBaXpVN2lKd0VNQnVlR1ZadXdrcDhzb3c5U19yUlVBYmd6M2RXb1ZhemxhZVpVTF9OMW04bEJxejBCckQ3bW9pR1RYNlZTdzRmXzJEMC1PZ1VQZUI3OU1MbWh4QUNxTFkwQ012RWJUbEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.erininthemorning.com",
      "title": "erininthemorning.com"
    }
  },
  {
    "title": "Taiwan’s Indigenous Defense Submarine Hai Kun (SS-711) Conducts First Submerged Trial - navalnews.com",
    "description": "Taiwan’s Indigenous Defense Submarine Hai Kun (SS-711) Conducts First Submerged Trial  navalnews.comTaiwan completes first undersea trial for domestically made submarine  ReutersTaiwan's first indigenous submarine completes maiden underwater trials  Janes‘Hai Kun’ starts submerged sea trial  Taipei TimesTaiwan headline news  Focus Taiwan",
    "published date": "Thu, 29 Jan 2026 16:09:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQVGtVQVJoR1lQNlpDSWwxOXBhWEdJYlo3NUhBMzlmY0JkTWpUWjREdGdMTkUwalM0N0g5bDhycmFTM3BvenZodUZXTWNWME0xeFFaUnFORlp5R2hKcnB3NDhuR2RDR2ZTRkVqdHN3WnRWbjA2OHY3Z2ZHcDhYNjk4eGlNa1A4Tmg5dExaV2twY0h1OFlIVjcxTXhyZFRpTlIxSVlzVXJoOHpVZWN3Z19xZzhFSzZPVE9vY3lXbFJITnRnT2RVeWxV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.navalnews.com",
      "title": "navalnews.com"
    }
  },
  {
    "title": "Putin Attacks Ukraine Just Hours After Trump Claimed He Had Promised Not To - HuffPost",
    "description": "Putin Attacks Ukraine Just Hours After Trump Claimed He Had Promised Not To  HuffPostUkraine war briefing: Russia pounds cities across country ahead of fresh round of peace talks  The GuardianRussian strike kills couple near Kyiv as attacks hit cities across Ukraine  ReutersRussia-Ukraine war: List of key events, day 1,431  Al JazeeraCasualties, damage to infrastructure reported as Russia launches missiles, drones at various regions of Ukraine  The Kyiv Independent",
    "published date": "Fri, 30 Jan 2026 21:53:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQMVJNZzFPSm8xcUt4dkpodTZwWnBhT0xtOXgyY0pXNDJZNE5tanhxTmQySUNEUUVZNE1UQ2FBOV9IQWFSaEJrUWo3cjBsT3EyWjhMYWhRb1B5bVd5OWcxR3EwQXljeGV6X2RqV3MtWS1vWTl0OE9UaldlVWNtYklYWWV6TnlMOWNNa2hhYUVrUdIBlAFBVV95cUxNM0lNN2puUFU5bW8tTDROOU0yNlFMS1Y2dlA0ZzdmQk4wdVo2ZG0yR0k5RUp0RzFGYXRFcXZMSkpXcGVvVnpSSmV6X3JtX0RkYXhCY2FiMTR2MmE0Z1NVUDhORzdQcnlsdjhNM0dTUTZoeWN3OU01aDJHcllocWR6ZE9UUkJGV2U4dE5FU2lia3RjNGZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "NATO chief should stop being 'American agent,' Charles Michel says - Euronews.com",
    "description": "NATO chief should stop being 'American agent,' Charles Michel says  Euronews.comNATO chief wishes 'good luck' to those who think Europe can defend itself without U.S. help  NPRYes, Europe Can Protect Itself Without the US  Cato InstituteNATO chief says Europe should ‘keep on dreaming’ if it thinks it can defend itself without the US  CNNFrance snaps back at NATO chief Rutte in feud over Europe’s defense muscle  politico.eu",
    "published date": "Fri, 30 Jan 2026 08:21:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQLXVicWNqYnFTa0MwYkpvS3RJTWp1ZFFxaXROdHZmSTBFdWVXWEN3U2xheGZlQTFWOEF2QzVIdS1aNGoyU055dW1Kd3lBcS16WXRTLXowam5CdUN5YmZWRWFvdWZINkF6SmtpdnlSbkNyNlYwU3hfaENnWEdLVHF0bG9VOVNXTmlubm16djNmdjdWR2VQMnpXY19TbWU3N1JpX29uNzBkTF9qSDBvTmh5VnFXSUhmbFhxZFVkbDBsVTNyOWw2dWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Cause of plane crash in Colombia that killed 15, including Congress member, under investigation - AP News",
    "description": "Cause of plane crash in Colombia that killed 15, including Congress member, under investigation  AP NewsSmall plane crashes in rural area of Colombia, killing 15 people including congressman  AP NewsNo survivors found after Colombian plane crashes with 15 people on board, including lawmaker  CNNSATENA flight carrying 15 loses contact over Colombia’s Catatumbo  The City Paper BogotáPlane Carrying Colombian Politicians Crashes in Area Contested by Rebels  The New York Times",
    "published date": "Fri, 30 Jan 2026 00:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQWHgwdFF1eUROcVlFM29JclBHcDR2SzUxS0dNWjN1Y0VNYW1aNk1YT0x4UXllZEFZQW5RU0ZzZVRKUmlHS0Q4YWxBU191cVpYRkZndFdseTNJV1k5ajByZWh2NWdSQzVNQU1tMWR4aThaN0wwZXJQRnpQNC1VSXdRV2Q1VjFHU2w0UXF4dVVSNFd1eWFHM3hXMDVGZGFkLS1JTWNPVC1Pdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Peter Magyar could defeat Viktor Orban, Hungary’s leader - The Economist",
    "description": "Peter Magyar could defeat Viktor Orban, Hungary’s leader  The EconomistHungary's opposition keeps poll lead, backed by younger generation  ReutersHow Orban Went From Invincible to Underdog in Hungary  BloombergIs it really that bad? PM Orbán's successor already being sized up – and the frontrunner may surprise many  Daily News Hungary94 days to election: Hungarian government brands opposition’s Magyar ‘mentally ill’  EUobserver",
    "published date": "Thu, 29 Jan 2026 13:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNWTlaVUxnNUowZW0wZGlBMGdzeDIxVGlPQ3haUVdEcVBNeVZGaDN3UDRmVUJhbHg0VzFsSWR0ejhTSDUxSFp2UlFhY1k3REUtMVJJN0ZJaXAwbXNQZ1Fvc0hJQXk4SEkzNEc4NHBhOUZoOElsdGJ0NDZZOHY1Z1BMTkh4WkdnRHhuSlV3dDJrcHFFUHZYQXR2RFZyZTdGdDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Algae Growth on Greenland’s Ice Contributes to Melting, Studies Show - The New York Times",
    "description": "Algae Growth on Greenland’s Ice Contributes to Melting, Studies Show  The New York TimesAirborne Mineral Dust Is Accelerating the Melting of Greenland’s Ice Sheet  Technology NetworksGreenland's ice is melting faster. It's not due to heat from Trump  India TodayA study in Geology reveals sediments beneath Greenland's ice sheet that could accelerate sea level rise  El AdelantadoSomething dark is growing on Greenland's ice. And melting it faster.  The Economic Times",
    "published date": "Fri, 30 Jan 2026 17:11:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNQUpVRkdZa0w1cDFZUE1HcHZ6TTB2dlp4NEJFM2JFVzZVQ2ZiWnVvXzBYeFBkaXMxcjJ0bS14TUtjRk1IX2l1bDlPWExxTHRUNllYOEZCbHBTZ3lwcEc2SHFBcnhYWk5TM3Z2X2tzVl9IY0htdmR0QkJEYkRDM0dRYnNMWkJhS1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "How Netanyahu is sabotaging phase two of the Gaza ceasefire - +972 Magazine",
    "description": "How Netanyahu is sabotaging phase two of the Gaza ceasefire  +972 MagazineNetanyahu's goal is to ensure Trump's decisions on Gaza sway in Israel's favor  HaaretzTrump wanted to play peacemaker, Netanyahu made sure he failed  thecradle.coIsrael-US scheme for Gaza  Press TVTrump is set on launching phase two of his Gaza plan. Israel's last hope is that he fails  Haaretz",
    "published date": "Thu, 29 Jan 2026 23:03:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1kWWdKSjM2Qmp0NjAwVjR2TjFDQzNJbWltRGlESVc3c1N0bWp2QlVuVFYtWGtERnhFdHpIWFN5Y29ZVElCM21TS0pya2w2REVYRWFqbHNSYXdpaWY0ZWY1MEN4M1RmTUhSTTBEeno2OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.972mag.com",
      "title": "+972 Magazine"
    }
  },
  {
    "title": "Snakes on trains: King cobras are 'hopping railways' to unsuitable habitats in India - Phys.org",
    "description": "Snakes on trains: King cobras are 'hopping railways' to unsuitable habitats in India  Phys.orgCobras may be riding trains in India  Butler NatureKing cobras take the train in India  Popular ScienceSnakes on trains: King cobras are travelling India’s rail lines, here’s what’s happening  Moneycontrol",
    "published date": "Fri, 30 Jan 2026 17:50:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB3aUhRVTFQOEdsaUZqbmE4YXZpeXpndVJLbGhmaGREVDdjZGZrRXBhVVd5ekFiYnBaMlNBcld5RWg4VnBhNng2OXFVMUgyWUhfVkpvNzdmOXhwaWtKQnNOYUdab0dlWFJfTXVfZ2VnWTAySnZZNXhwVVZrbUp0UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "President Museveni’s Son Kainerugaba Makes U-Turn, Apologises To U.S. After Suspending Military Ties Over Bobi Wine Claims - Sahara Reporters",
    "description": "President Museveni’s Son Kainerugaba Makes U-Turn, Apologises To U.S. After Suspending Military Ties Over Bobi Wine Claims  Sahara ReportersView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 11:16:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNZUQtb1pmSUJvRWNid0staFNHcHBjRjRlNkc2bnhsSS1HbUxJR1JHb2ZFeExRSG5pQWM5RGlGdV9rSUJDS0lyWXFXVG1VSmNDdG1KTEZOTndfTm1RQlVGbFdoSVdEZ0VLUjJSRXd4ZXVtaVY3SUJ6R0E5QXlWOXdYWTFuc1pub0ZZSU9oMDgteHZqTGt0SzBuWWY0S1dEU0FqWVNmTm9BaUFVVUtaaUZxNWxvamYyaVczc29POUEtSG1pRXdLaWc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://saharareporters.com",
      "title": "Sahara Reporters"
    }
  },
  {
    "title": "Lib Dems name Gorton and Denton by-election choice - BBC",
    "description": "Lib Dems name Gorton and Denton by-election choice  BBCThe deadly weapon that gangland armourers are making with limited expertise and a £10 drill bit  FacebookIf you take a risk voting Green you will let Reform in says Lucy Powell  About ManchesterMinister: We will make the case for Labour in Manchester  ITNNational politicians head North as by-election campaigns ramp up | ITV News  ITVX",
    "published date": "Fri, 30 Jan 2026 10:20:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5vWjV5WVpmLWNYcmpCTmtzd1lrSFgyeU1MNDNBS0N5T3FxTTgxZG5sdGtvSjV1VFRNeFo3Skd4OEJCSmdCTXpkUXROUlpQbkZRS0x6Wk43SU53dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms - Live Science",
    "description": "Stone Age teenager was mauled by a bear 28,000 years ago, skeletal analysis confirms  Live ScienceResearchers Say This Paleolithic Teenage Boy Died a Slow Death After a Bear Mauled Him  Smithsonian MagazineA foraging teenager was mauled by a bear 27,000 years ago, skeleton shows  Scientific AmericanIl Principe bear attack evidence  Ancient OriginsArchaeologists In Italy Just Uncovered A Brutal Bear Attack That Killed A Teenage Boy 28,000 Years Ago  All That's Interesting",
    "published date": "Thu, 29 Jan 2026 16:04:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNTXdiTjVhQUlmaE1NZ1VtWF9hLTF4Ti1VU3ctNWZrWFJUcW85dlB2emZzRnJtM3hFTGI0WkxmcFE2UnBmZm15ZUMxcFJoZGxSUFpUOWhhSkJNc2VVa1NlYUZ4b185STl1ZW1fTzVINHNOWVYtQ0wwSTJaMDhlZXNUX0daODNMRDF4XzBpZk95b3ZLdDVybDFSeWVLX3AxOTZfNmdDV2RueVRULXM5TXFSWVFFc0lXdUhJUU9tc19WdWU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "The new Dutch government has big plans. Here are 5 things to know. - politico.eu",
    "description": "The new Dutch government has big plans. Here are 5 things to know.  politico.euThe Netherlands Is Getting a New Government. Will It Last?  The New York TimesNew Dutch government plans 'freedom tax' to fund defence spending  ReutersDutch parties strike minority coalition deal three months after D66 election upset  The GuardianPodcast: The Our Orange Is The Best Orange Edition  DutchNews.nl",
    "published date": "Fri, 30 Jan 2026 18:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNMHFxdGVPWGE5OXRHYUJQN092RjZxbXcxbzZ4LXdEZWw3LTFFNVhhcmY5Z0JtWVpsYS1na3VBMjJGM1FEXzFheTZLcWlQVUxRRjcwblZHOG9QQnV2amZtb2RPb3N1NkZuY0FCYlptcU45eWVXX0VNREgyZm45RUhqNlRDYTVCcEpWdTlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Prince Turki Al-Faisal reaffirms strong Saudi-UAE ties, urges reliance on official sources - Arab News",
    "description": "Prince Turki Al-Faisal reaffirms strong Saudi-UAE ties, urges reliance on official sources  Arab NewsRisk, Order, and Power: The Saudi-Emirati Divergence  War on the RocksDiscord in the Gulf  Foreign Policy'Frantic lobbying:' Does Trump have a favourite in the UAE-Saudi rift  Middle East EyeIn the Saudi Arabia–UAE Rivalry, the Saudis Are Wrong  American Enterprise Institute - AEI",
    "published date": "Fri, 30 Jan 2026 10:24:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFBvWlYwU20zMURmelpnZFNrUnBzUDQ1MmY1M1poNnA4S0kzSm9zMFA0dDdCSGJhLXFCd0l4UWxTTHJRTDY3Ukg4V2ZzMFVQWk5LOHNYY1BFYlhrT3RsSG9V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.arabnews.com",
      "title": "Arab News"
    }
  },
  {
    "title": "Russia’s Oil Revenue, the Lifeblood of Its War Machine, Is Plummeting - The New York Times",
    "description": "Russia’s Oil Revenue, the Lifeblood of Its War Machine, Is Plummeting  The New York TimesAre the West's tightening oil sanctions finally taking their toll on Russia’s economy?  France 24Russian oil income drops sharply as sanctions bite  Financial TimesRussia’s oil and gas revenues are shrinking. Meduza explains what that means for the Kremlin’s war chest.  Meduza — НовостиMore Russian oil being stored in tankers, awaiting sales  Reuters",
    "published date": "Sat, 31 Jan 2026 10:02:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFA1Y1NRRk9JWFRYU1NqakZpR1ZicXdNMXh3VXlBRW9GVFpyZl9KR1d6VVo4YkNhYVdiSGxyR3lYRUpTRUJjTlhrQ1F0TUpMMFJmT1JCWFFraGhQelpGVFZsblR1NzRpdjI1WmNXc252NWdFVUhwdDRQbDlONA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Justice for Hind Rajab: On the Second Anniversary of Her Killing, The Fight Is Real. The Cases Are Active - THE HIND RAJAB FOUNDATION",
    "description": "Justice for Hind Rajab: On the Second Anniversary of Her Killing, The Fight Is Real. The Cases Are Active  THE HIND RAJAB FOUNDATIONOpinion | Hind Rajab’s Mother: No Child Deserves to Die Like My Daughter  The New York TimesGiant portrait of girl killed in Gaza war unfurled on Barcelona beach  Reuters“The Voice of Hind Rajab” masterfully utilizes subtle dramatization to portray the real experiences of those who try to save lives in Gaza.  Elements of MadnessNew Shepard Fairey print commemorates killed Palestinian child Hind Rajab  huckmag.com",
    "published date": "Thu, 29 Jan 2026 11:55:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxQS2FsRXRhXzlyQndteE9DX1NJeHhHeXZtcEVoTEtlQUMtZjYzcllLZGF1WURXRXdESUFxMWpjOE9YcGpVdzd0ZjUzM01SbF9BOGl0M0xBLWJGczVoVmpYdTZDZVdYdVRzSWpPOUZUUXJoZWJWT2VBY2tCQTdhMWJneHNnLWpKSVhpcE1MenY0aWVlcXRQUWQ2YWdKSXF1bTJvd3pybW5GZWRhbmZnWnZTM1EyTUdCNUd6eG1ma1hkUzJrOVg1Mzg2M1dheC1WTXczbVBfanlXTldITTZW?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hindrajabfoundation.org",
      "title": "THE HIND RAJAB FOUNDATION"
    }
  },
  {
    "title": "New satellite view of Tibet’s tectonic clash - European Space Agency",
    "description": "New satellite view of Tibet’s tectonic clash  European Space AgencyNew satellite image of plate collision in Tibet  Karlobag.euTibetan Plateau horizontal displacement  European Space Agency",
    "published date": "Fri, 30 Jan 2026 10:48:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNcktWcjhKQXU1ZlEwQ0ZJWkFVR1h3TzF5RmI0eVduWlpBM1BNTnlqcTE1UEFxUU5kaHpvYmZDT09xSnBJNlF5dmJHVDVHekdHNG13bURjUjdhWFZFVm1rdFBIR3lvOE50cmtBQUFqcmU1ZWV2MjR3OWJWRlQtaklWVTNLZ2VwS2wtSmZ4YWJwOEUyTmNZcGtxWkd4b1hIWDVRVmdXdERXVlN5N0RLVFMwSF9wWTB1OVVaZHpZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.esa.int",
      "title": "European Space Agency"
    }
  },
  {
    "title": "At India’s main energy summit, signs of a new world order without Trump - The Washington Post",
    "description": "At India’s main energy summit, signs of a new world order without Trump  The Washington Post",
    "published date": "Fri, 30 Jan 2026 18:00:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOTUZIVXk1UVZnQ2d5VnByLUMyVTJia1BRODkyX01QU1lzalB5eWhfazJseEhFQmdSSnJqZC1IRURTVTdmcm5maDN3cktCZ2liY3F4X3NxcXpmYnN2aTFhX24xblVBajlFNmNOaGxBd0tRWXdqVU9FZ29KRC1qZ2NmQlRTQnpqWFdNM3ZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.washingtonpost.com",
      "title": "The Washington Post"
    }
  },
  {
    "title": "Settler-only IDF units functioning as ‘vigilante militias’ in West Bank - The Guardian",
    "description": "Settler-only IDF units functioning as ‘vigilante militias’ in West Bank  The Guardian‘We are reliving the Nakba’: A Palestinian community says it’s being erased as Israeli settler violence intensifies  CNNThe Israeli Ethnic Cleansing Militias in the West Bank Have Succeeded Once Again  HaaretzIllegal Israeli settlers force Palestinian families to leave homes near Jericho  Anadolu AjansıEscalation of settler violence in the West Bank draws US criticism and international concerns  جريدة القدس",
    "published date": "Fri, 30 Jan 2026 17:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPbGFHWmdiemxBaFBWSVVFTFl3cXBVVmpNRTZuQUxKZ1hGSlRNbWo2cGVKSDN0V2VkX3JFVUJmellsc2VKRjVSWjkxSmpBaHNxUkIzLVpYdm53eGtlRTA3ZzlOR0NwdWlVQnVHS3RucHFHV1c5MDZfYjVuVWRINkVBZTFwclFZSnM1YS1nMlFhbmYyUTFmZy0zanRiQWJPYU5obzkwa2FhbHZjNjdWY1BVVU1HVXdkZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Sailors get a rum deal as Royal Navy makes them go teetotal two days a week - Forces News",
    "description": "Sailors get a rum deal as Royal Navy makes them go teetotal two days a week  Forces NewsNavy introduces new alcohol limits for sailors while on ship  BBCNo more drunken sailors as UK navy sobers up alcohol policy  Euronews.comA right rum do! Navy restricts booze to make ships 'dry' for two days a week  Daily MailNo more drunken sailors? Navy to restrict alcohol in health kick on ships  The Independent",
    "published date": "Thu, 29 Jan 2026 16:24:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPRkVGU25kS3Rmb1dKMFFGWU4wck4taEtNMHRwajJFQlpZdzJiSDdFcWRhYnpPZk5uR3VZdnVxMW5lNy14XzVVLS03ZU5udndFTnNwZW9Ecl80LWRvS0M0eWg0QzJtVDkxd3ZvdXViNEcwZjhIdEU4eWQtMjVCTHJ4RS0xenhyY2xQamUtWU1VRElvbGR3NlZETGtkNmViOFpub1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forcesnews.com",
      "title": "Forces News"
    }
  },
  {
    "title": "Ukraine distributes boilers from Italy to support heating for up to 90,000 homes - The Kyiv Independent",
    "description": "Ukraine distributes boilers from Italy to support heating for up to 90,000 homes  The Kyiv IndependentPoland raises approximately €2 million for generators for Kyiv  UkrinformZelensky praises leadership strength of Germany's Merz  YahooGermany Sends Emergency Power Units to Kyiv Amid Russian Attacks on Energy Infrastructure  UNITED24 MediaUkraine’s FM lauds Polish church support as Kyiv faces winter hardship  polskieradio.pl",
    "published date": "Thu, 29 Jan 2026 22:42:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPOUhOM0N0T0ZRUFRZemlCazlicGdjNFNpNnFoTGZGdjlRVGlBaU9HcUpmSTVpSUdxUUZTQklBa3B6Rk5xR2dHa3J3RHk1bWVDQUtVSUZ5MGtMMmpGazJOeUdfbzExb0FhcE41cVhVU3NabEp2cHdURTU2bHl4NDhCdFpwY0RraGdDVkZjQ1RkeFlleWh4ZlM2NHp1Vi1JbGFfcUdFZVU3NlhsTlh6RGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Turkey deploys F-16 jets to Somalia as it strengthens economic ties - Middle East Eye",
    "description": "Turkey deploys F-16 jets to Somalia as it strengthens economic ties  Middle East EyeTurkey said to deploy F-16 jets in Somalia  The Times of IsraelTurkey Deploys F-16s in Somalia to Step Up Strikes on Al-Shabaab  BloombergTurkey’s F-16 Deployment to Somalia Reinforces Danger of Arms Sales to Ankara  Middle East ForumTurkey Bolsters Somalia Ties as New Military Chief Takes Helm  Dawan Africa",
    "published date": "Thu, 29 Jan 2026 14:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFA3UUtsYm10YU1ndDFpUXg3bktKOHR2THZ6TlFmd1gwWmZsTWN6YUN3TjNfNnVaXzlqUFJXX2RMR0dXRV9PUHYtUkNQRUdESlRYNHkzR2NiSVVoT3VMRTY1YnRqRVJQdWIzblVVQmlYR21ZbWtYSGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.middleeasteye.net",
      "title": "Middle East Eye"
    }
  },
  {
    "title": "Former Harvard History Chairman Boasts of Transforming It From 'White Male Affinity Group' - freebeacon.com",
    "description": "Former Harvard History Chairman Boasts of Transforming It From 'White Male Affinity Group'  freebeacon.comLosing the West  Minding The Campus",
    "published date": "Fri, 30 Jan 2026 00:04:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNTUtDWEhMUm1McjNCcG80Mk52MGhEdGlzWFBxQXlMQUxyX0k2ODc0bV9xVEFZZi1HSnI5bG45aG45ZzFBTTFLYlh4czUya3pRd1JKTTZWQTJXQXRnVTVzWWJjYjdQdU9tUHprdTZnZ3YtTzBqZ3FiOTdVaURKcUN5RkhxWVhncERhUS1KZk1Sc3l0cHBNVThiSGVHTEdaSWFTc2Z2eEhnOENIZ2U5WW1fQUpSR01nY0NGbVpZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://freebeacon.com",
      "title": "freebeacon.com"
    }
  },
  {
    "title": "Russia Is Finding the Gaps in Ukraine’s Front Line - The New York Times",
    "description": "Russia Is Finding the Gaps in Ukraine’s Front Line  The New York TimesRussia says it captures another village in Ukraine's Sumy region, defence ministry says  ReutersRussian forces make no significant gains near Hrabovske in Sumy region – military  UkrinformUkrainian Border Guards Conduct Mopping-Up Operations in Kharkiv Region, Capture Russian Troops  UNITED24 MediaRussian Forces Capture Villages in Ukraine: Latest Updates  Global Banking And Finance Awards®",
    "published date": "Fri, 30 Jan 2026 10:00:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSXV1eTFyS3VPUXg4MHZZOUM1VXFSaFNQM01TZ0ZQNlFzd1ZPQ0FOUGtFRWo3Tm9fZ0JoVjJ0NG5xWlFSOTF1dENaTWVnaDBnZV9HUmpPdENGWUV6Zk5EMWVweVExejFmVnlnaEdaZDVqaW8yWGpiOGpVUUkzWEJMdjlBOWVUOXZEc0RoVUNiM3RQQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Russia straps Starlinks to new unjammable drones - The Telegraph",
    "description": "Russia straps Starlinks to new unjammable drones  The TelegraphRussia is using Starlink to make its killer drones fly farther  CNNMusk responds to Ukraine's request for help in tackling issue of Russian drones using Starlink  Українська правдаUkraine working with SpaceX to stop Russia from using Starlink to guide drones  ReutersRussia Using Starlink-Equipped Attack Drones For Precision Strikes  Aviation Week Network",
    "published date": "Fri, 30 Jan 2026 08:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPYmtPZ2tZOHBRaGlMWjVNRVIzbmh0ZXFZa3JxVWpVaF9Uem1XaTRDY0hOVUl1bmFMb3pXLUh0WXNjek1SaHQ5ZFgzdlREamF1eExlQ3dveWJIdmR0NGhQSkpYNlZaTncxRWc1bl9YSzVsU2QzcFczNXNkbDhrOGp2QThGa183bXExYm1kcXdR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.telegraph.co.uk",
      "title": "The Telegraph"
    }
  }
]