[
  {
    "title": "Why François Legault is pulling a ‘Justin Trudeau’ and resigning in an election year - National Post",
    "description": "Why François Legault is pulling a ‘Justin Trudeau’ and resigning in an election year  National PostLegault played identity politics. In the end, it wasn't enough  CBCAfter Legault resignation, what’s next for his party and who might replace him?  CTV NewsLegault resignation shakes up Quebec’s political landscape at uncertain time for businesses  The Globe and MailJustin Ling: This is going to be a long year in Quebec politics — and Legault’s resignation is only the beginning  Toronto Star",
    "published date": "Wed, 14 Jan 2026 21:03:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOVWJ6eTUtWlNYa1h3VndXSkVleGh5N0dpV1BNVDhKZUVWN1ROZ1hZdkVoUC1sMlRkaEgyUG9ZVGU4aXc0aF81YTItaExBNk8tME5YQ1lWQ0g1QmlfRXZNU2JDTTNBTjFncm1xUFJfYWZhN1RYWmR3ak9hRVgzd2FXd0hEREcxMERPaEs1Zjlta0hBQTdrZk9ESTVabnhVUWRudmMxcWRWRV9Eb3N3dTZtN3JB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Toronto could see the biggest snowfall of the year. Here’s how much the city could get. - CTV News",
    "description": "Toronto could see the biggest snowfall of the year. Here’s how much the city could get.  CTV NewsToronto getting hit by major winter storm. Live updates here  CP24Schools closed, roads unsafe as snow squalls batter London region  CBCSnowfall warning issued for Toronto. Here’s how much you can expect  Toronto StarBrace for significant travel impacts as snowstorm to bring hefty totals  The Weather Network",
    "published date": "Thu, 15 Jan 2026 02:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNdGIzSnY1OFpmTWZna3BENTZKU1o3RFhMMlBfdDJzRXFmRzVodXVTVXFyZTFkV2pucEJpQ0ZSak1VUXpwa1lPN081WUc4c0EtTzZFQUVTQnBRLVp3bU5YNFRFd2o5N29veDBaLUg5bC1IZjR3TGdydkRjUkIwSnVkYnZTUGIwLUpKeHlNUk9xTzV5dUJFUFBpNFZQWFBveEtWYnl5ZlpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "GTHA school bus cancellations: Some schools close due to storm - CityNews Toronto",
    "description": "GTHA school bus cancellations: Some schools close due to storm  CityNews TorontoSchools closed in Toronto and across the GTA due to snow storm  CP24All TCDSB Schools Closed for In-Person Learning Today (January 15, 2026)  Toronto Catholic District School BoardSchool closures and bus cancellations across Toronto and Ontario cities  INsaugaBus cancellations, bitterly cold temperatures  CTV News",
    "published date": "Thu, 15 Jan 2026 11:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQT2xZeHNhMEYxdGRiRG9rcVp4eEM0V2plRkZQRDdod084WEJ2YUczRVF2bWdSbWlpSlUwZFVTVG1CWF82RTBzcHlFZXc1VVNaaWExMnNXSFVHbHp0TmJIVkVrMFlHT04xMDlTbGdVa0RRdmM4YVExanNndTB2VzVqa0VBODVNNW04MlhMYjBOdjBVTWhSRi1PY1BFa2h5eUlaaXdLMEh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "Canada-China talks on reducing canola tariffs have been fruitful, Anand says - The Globe and Mail",
    "description": "Canada-China talks on reducing canola tariffs have been fruitful, Anand says  The Globe and MailCarney's 1st day in China secures agreements on energy — but no tariff breakthrough yet  CBCCanada, China plot course for more oil, gas and uranium exports  The Globe and MailMark Carney says Canada entering ‘new era’ of relations during trip to Beijing  CTV NewsCarney risks provoking Donald Trump with a pivot to China on trade  National Post",
    "published date": "Wed, 14 Jan 2026 16:06:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPMGJ2ejVVNVZ0aHRKNlNXZXdtSld3RnA1b0xfbjRxR2JOck4wQTJDRkpfQ1l6bUc1OUZmUGhkT2lYQ1FJWVNmNXBESXFzajRuRHU4YjBWWkFCcElXM3IteUc1Y1RtY1gybHppa2RZVEdHZk1vUmhlZEdZeGNIMlRORXNYMzdKRUpv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Alberta government will do its own review of Calgary’s water system - CBC",
    "description": "Alberta government will do its own review of Calgary’s water system  CBCUpdate Jan. 14: Major water main break  Newsroom CalgaryBell: Danielle Smith UCP demands Calgary city documents for their water pipe probe  Calgary Herald16 Avenue NW fully reopens as water main work progresses  CityNews CalgaryCalgary expected to provide updated timeline on weeks-long water restrictions  The Spec",
    "published date": "Wed, 14 Jan 2026 21:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOcE0tVUhVNFc5ck41TTItUTBSNkF2VG5iV3dROEtOdnBLSW05Zmp4empYblZZSno3azF0MndicEM4VUdiOW1jbm5tOWlQeWoyaXVjdmtlelpnbHdIdmlOVlpYclZiUXRUWnVTVTAwWFlMZXN0Q2J1WllpeFNpa0ZzUWdaMlJ6RmF5SXB5N3V1U1JRaGxJMFA4cWw5VURNc3QtNW5MTjdlV19IOVpuVkVnbnNfMGY2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "‘I had a guardian angel over me’: Sarnia man recounts harrowing ordeal after being run over by car - CTV News",
    "description": "‘I had a guardian angel over me’: Sarnia man recounts harrowing ordeal after being run over by car  CTV NewsSarnia resident charged with attempted murder after man run over by SUV  CBCVideo released as motorist accused of intentionally running over man multiple times  Toronto SunAttempt murder charge laid after man repeatedly run over: Sarnia police  The Sarnia ObserverAttempted murder charge laid in Sarnia  CTV News",
    "published date": "Wed, 14 Jan 2026 21:17:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPcVJLMk5icnVURU00VUN5NW5FbVBjY2s2by1LMjJFTWxLZFBqZDJmZ1drQnJqdkVBRm1rQkNLZEVRSTlwZFNKU0NJS3ZDbmt2N3l1OXlzeTFNUkdPUnM3MndiWk5TRFluNGRSaW55Q0Ntczg2X1pISDU3UDZOZUN3MW0tR3BaaGhjYWFxc2pVM3BLdE5qY2FvLWVvN1VsdlVsUTdRVk45NnBEUEdSeVNERjNrQUJnMU5ObnJBcG1GZzR0TWJncWpLSkp3Vi1jOWc2b2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "British Columbia ending its 3-year drug decriminalization pilot project - AP News",
    "description": "British Columbia ending its 3-year drug decriminalization pilot project  AP NewsB.C. to end drug decriminalization project, after ‘challenging’ three-year-experiment  CTV NewsRob Shaw: Poilievre calls for immediate end to B.C. drug decriminalization pilot  Business in VancouverB.C. ending its drug decriminalization pilot program  The Globe and MailB.C. ends three-year drug decriminalization pilot program  Global News",
    "published date": "Thu, 15 Jan 2026 00:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOX1g5TDFqVlFGQmxod3FrVHdUNnJPek55TElyYVV6QTRJVVVuVTI4NFlnYktKRk9uQVVCTGRPazg1eU1UU2dEckJYWE5kNWJPbnBpcjFBVEl6U25xQUpGRGJoZHhDYTJsRVpLeXBIVWVRcTdvZWVPa0RpS0JEd3RJai0xc0c4b0QtQmxfUVJCdEw1TnJEQ0dCeEtNUXpzYTRGQTJDZmxiMXo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Manitoba bus rollover sends 14 teens and 1 adult to hospital - Global News",
    "description": "Manitoba bus rollover sends 14 teens and 1 adult to hospital  Global News'When I woke up I was in the snow,' says 1 of 3 teens airlifted to Winnipeg after bus rollover  CBCAt least 14 high school students, one adult injured after Manitoba school bus rollover  The Globe and MailThree airlifted to Winnipeg after bus crash are being released, health officials say  Toronto StarPanic, then relief for woman with grandchildren, niece aboard rolled school bus  Winnipeg Free Press",
    "published date": "Tue, 13 Jan 2026 17:45:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9lUTItQ2l3V1Q2TGtQRjZ1dUJRWHFhUFYzSGhicjJ3RHF4eXZZRFAxZnVQdjNtclJ5RkYyTi1oeEpQQ3J6WU5IOUhLTHJjZm5ldXJSeHlmOXhEdk4yMnZlU0JVQlJYS1pidTN6ZTA1d3AxMFJKZFgzRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ontario Liberal Leader Bonnie Crombie announces resignation - CityNews Toronto",
    "description": "Ontario Liberal Leader Bonnie Crombie announces resignation  CityNews TorontoBonnie Crombie no longer Ontario Liberal leader ‘effective immediately’  CTV NewsOntario Liberals announce Bonnie Crombie will step down immediately  Global NewsPotential field of candidates emerges as Ontario Liberals remain mired in leadership limbo  Toronto StarBonnie Crombie formally resigns as Ontario Liberal Party leader  CBC",
    "published date": "Wed, 14 Jan 2026 17:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQTXlHOVpjNHR2ZmpHZTNCYzNoeW5Xd05ocVotWFlmTVdMZWxmcVBUd3RIeHVvYzhFTXgyYjAzUkFXMEkxMUk0ajBFZUxFa1lLMkk0T0hIMkhIeVB5bmRqZ09yZVBTOG54WGlzNWh4d0lvNWVTT2xQdW1hTENKZE10dnZON0NSQmxfQlFXSg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "Snowstorm closes schools in Waterloo Region Thursday - CityNews Kitchener",
    "description": "Snowstorm closes schools in Waterloo Region Thursday  CityNews KitchenerAll area schools closed, buses cancelled today  Guelph NewsHeavy snow closes schools, creates messy commute Thursday in Waterloo region and area  CBCThe Record today: Snow day: schools closed + Speed cameras are still active + Conestoga president John Tibbits suddenly retires  The RecordAll Schools Closed, All Buses Cancelled – January 15, 2026  WCDSB",
    "published date": "Thu, 15 Jan 2026 11:01:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNUEM1dTJwUVhrYlJjb2VLV3NBWkJuWFFaQ0xfTlhxWW95QlAwNWJCUE9Ca0VWVXIzMTVjWVhhUFpKdFRsUDdBSEloZ3gwak95ZXUzUHN6clhpT0FtOExVWGFBWjg3X3hXZEQ4ZGNJeVV3UHlfZlZmazdMOG5RR3dKMG5CeHV6ZnZoeW11SVFYSVBzWGJvMlI3Zjdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kitchener.citynews.ca",
      "title": "CityNews Kitchener"
    }
  },
  {
    "title": "Vacant Manwin Hotel in Winnipeg burns, collapses - CBC",
    "description": "Vacant Manwin Hotel in Winnipeg burns, collapses  CBCVacant Main Street hotel ‘total loss’ after overnight fire  Winnipeg Free PressManwin fire was 'simply a matter of time,' advocate says as city promises tougher action on empty buildings  CBCVacant hotel on Main Street destroyed by fierce blaze  Winnipeg SunHistoric Winnipeg building destroyed by fire expected to be total loss  CTV News",
    "published date": "Wed, 14 Jan 2026 22:33:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQS2RXUmlnNXpKRC1MYWVneVNBWlNYNUVxdGt0aE5INXVTdWZlZzhvX2hDX0JEQ1NiX016T0M2RHJJUzY5VS1ZbWUxVUtJUzdGeU1vT20tYlozdjlrTWVNelZma0I4bHl2ZHpCYmJkMlotYTZzS1FfSW9xYThua2RpRE9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "John Ivison: Carney has other West Coast fish to fry before an oil pipeline - National Post",
    "description": "John Ivison: Carney has other West Coast fish to fry before an oil pipeline  National PostB.C. Coastal First Nations say meeting with Carney was ‘productive’, but pipeline position remains  Global NewsFirst Nation expresses opposition to major projects ahead of prime minister’s visit to Prince Rupert  Radio-CanadaCoastal First Nations hold firm on opposition to bitumen pipeline during meeting with Carney  Vancouver SunPolitics Insider: Carney meets with B.C. First Nations leaders to talk resource development  The Globe and Mail",
    "published date": "Wed, 14 Jan 2026 11:02:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOZUhURHJCU1Y3STliSjJSUEdJcGhQUVVwZld2ZEt6UnFqYnkwOVBDc1h1VWtPU0o2TUJqUTJ5YnB1QUF3eEYySERKQUFjR0J6dGZIZVpqQXZBMkxSRDg0eTNrOHozV19XeHVsTTJWYjJ5alpZeU1Ga0NTTl91bDg0TU1XdTk4eS1MTXFuTHV0d1JrY21GN2w1allFalJwcEhSZE82Sw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Man killed in self-defence in Edgemont had history of violent allegations, records show - CTV News",
    "description": "Man killed in self-defence in Edgemont had history of violent allegations, records show  CTV NewsCalgary woman’s act of self-defence prompts another victim to come forward  Global NewsWoman ‘lured’ to Edgemont residence, fought off attacker in ‘self-defence’: police  CBCPolice say woman who killed attacker with knife was acting in self-defence  Yahoo News CanadaFatal northwest Calgary confrontation an act of self-defence, police say  Global News",
    "published date": "Thu, 15 Jan 2026 03:10:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOdnhYb1lLRGp2TkYyazZwM3NlWkV0YjVMNmFydGl2cnBwdFNSbVBlSlpWbXh0X0owOUhMSlh6UmFLLXp1UGt3bl94OUIyNlVLZkY3YmNFME1XWUJHNGhhNzBjZlBwY2pISEsxVWVoWVFiTmJybS0yU0EtMWFOTTNiWjZPOXNMNG5BdDFONV9VR0VJdGloZDNkVy1Rckt5UWdNLWxvX0M2RkR4N3dNUlZxZ2ZfOTljc01HeGlrMnJMZ3ZHZ2Ew?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Edmonton snow-clearing raises mobility concerns as mayor recognizes change is needed - Global News",
    "description": "Edmonton snow-clearing raises mobility concerns as mayor recognizes change is needed  Global NewsParking ban in effect on Edmonton’s residential roads  The Weather Network'Incredibly infuriating': Edmonton mayor says cars flouting snow parking ban should be towed  Edmonton JournalSnow removal service level isn’t enough for the ‘city we have’: Knack  CTV NewsEdmonton’s mayor knows you’re frustrated about snow removal  Yahoo News Canada",
    "published date": "Thu, 15 Jan 2026 01:21:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQYk9YX1M1WjJDT3I2OXNnRVp5NnBpaWl4LXVZVEY5VDJuZ09pZVptd3BEOTBubkxmSE5wNGR4RGZfOEVqNTZsMi1Nd3paUFI3ZWpvM01sQzdRVFdoajlRV2FzSG0wRGhoZW15MndMUC1FQmJpemNOSWxzLVhiQWwyYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Nearly 85,000 people homeless in Ontario, up 8 per cent in 1 year: report - CP24",
    "description": "Nearly 85,000 people homeless in Ontario, up 8 per cent in 1 year: report  CP24‘Really heartbreaking’ new report shows increase in homelessness province wide  CTV NewsNearly 85K people homeless in Ontario, up 8% in 1 year: report  Global NewsNorthern communities see fastest-growing homelessness rates in Ontario, new report says  CBCHomelessness Crisis in Ontario Continues to Worsen  Association of Municipalities of Ontario",
    "published date": "Tue, 13 Jan 2026 21:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQLUdyWmNseHNnV3pqcEdUT3dxdmxSTjZhSkxtLUlxUzFmekZyQ05wRVZyTzkyV1JYMTNucGFZS2VPSXYzVDk0OGJRTzVlNzVTa1NvYjhZcWpNSWlFaW43WXo2cUh5SGpfWkxRTzFoWm9xeDdxaGg5b2F6aHlrU2c1bjZSUnZiazhDSmNKLTl5SXUtcnoxUTVNRHdzQ1BsbWhyVU1lQkhlejJqM1VPb1haZllyYl9Bdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Brampton man reaches settlement with Boeing over 2019 crash that killed six family members - Toronto Star",
    "description": "Brampton man reaches settlement with Boeing over 2019 crash that killed six family members  Toronto StarOntario man reaches settlement with Boeing over family's death in 2019 Ethiopia plane crash  CBCBoeing reaches tentative settlements in related 737 MAX crash lawsuits  Yahoo! Finance CanadaBrampton, Ont., man who lost family in Ethiopia plane crash reaches settlement with Boeing  CP24U.S. trial begins over deaths of three Ontario passengers in 2019 Boeing crash  The Globe and Mail",
    "published date": "Wed, 14 Jan 2026 18:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxOTkJ2M2dDYXNfTFpnOHpYTWJuVUdaZW9reDQ0QlB1bmppVkJaZnNFZjB2VzczVzNfTWVLT1drbnFnZWxMVzRlcHRFR3g0WXo1VFI4eUtfQzhtcFFYeE9aMFo1TXo2cE93RDAxa2dPb2U5THhtNkNTX3JwN25iZHRGdjV5YlNuMTRSZXR3cW9nZ05BRnA5ZExad2xyLU9JV1o5Vk5tZkp5ekFnYS1CWTdSclI3V05MUVdubjd6MzFoQ3RjVC05SjY0VXduVWVsbWVrcnRySzZJSkRNSE42NGpyNm1ZQ0xEM1hQam13SXYyRENpN2RRcHFDYzU3Q2xjU2pLUDlv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Pet owners call for trapping signage, regulation near community trails - CBC",
    "description": "Pet owners call for trapping signage, regulation near community trails  CBC",
    "published date": "Thu, 15 Jan 2026 09:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQTkNkUk5LTGlNSllLYXRVZGI5cEU4U2pVejdPbnBpbHJFLU5OZEhlUVdGOWtGM0tfeDdhZGY3OFFxVkZ2WTNYSE12bjZaVEdFeTBBLVdnLTkyVVQtcW5lbHdrNHJGdWNZSW9WV2xoVG00TTlGUGROUFVJUDNRamJ6ejBEVGI0STBIdTNXU3dsUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Two teens charged in violent Facebook Marketplace robberies: Calgary police - CityNews Calgary",
    "description": "Two teens charged in violent Facebook Marketplace robberies: Calgary police  CityNews CalgaryTeens charged in 2 Facebook Marketplace robberies in Calgary, police say  CBCTeens arrested, charged in connection with 2 violent robberies  CTV NewsTwo youth charged in Facebook Marketplace robberies  Newsroom Calgary",
    "published date": "Wed, 14 Jan 2026 22:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOUjFTeWJoY284RkV1SzRJQW9Wa282VS10MDdZWWFWT0dmeTU1U2wyZm5xZzdiZWJSYXJxQUxCQjZhaXgxcVpMSExBYmlTNmJjY25QVnR6b2NBM2pNUW5IMWJFMVBCYVJfemtVV0JQT0NidW5HQVdHc0RGR2RJRmZmRjlKRjFBWnY2bl9nNjZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://calgary.citynews.ca",
      "title": "CityNews Calgary"
    }
  },
  {
    "title": "Accused in Lethbridge sex trafficking case breaches conditions, re-arrested: police - Global News",
    "description": "Accused in Lethbridge sex trafficking case breaches conditions, re-arrested: police  Global News3 teenage girls rescued from sex trafficking situation in Lethbridge, charges laid  Global NewsAlleged human trafficker re-arrested by Lethbridge Police 30 minutes after release  Lethbridge News NowLethbridge man released on bail after multiple sex-related charges  The Lethbridge HeraldAccused Lethbridge sex offender re-arrested for breaching release conditions  CTV News",
    "published date": "Wed, 14 Jan 2026 22:07:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQbjZvODEyUGhTNDl2MnIyRHJ0aVNkX19WZmw4N2VXdG80YlN2clNmcl9DUldFektrOURnZnpyOEFSbUtCU0xZX0h2M0JfUHJtdklWTWhKUEtYT1h3THc3M0VQdWxZZmRvTFBTMlNTcWNDa1czNkdTMXRBWHkwamoyM0hYa2MyaE9W?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Prospective mom in Ontario murder trial testifies about restraining children with zip ties, locked bedrooms - CBC",
    "description": "Prospective mom in Ontario murder trial testifies about restraining children with zip ties, locked bedrooms  CBCCrown probes accused killer’s claim she wasn’t warned about boys’ troubles. ‘I hate myself’ for awful text messages, she says  Toronto StarProspective mom tells Ontario murder trial she did nothing to kill boy in her and her wife's care  CBCMANDEL: Mom accused of murder says she never wanted 'horrible' boy to die  Toronto SunCo-accused in couple's Ontario murder trial testifies she wasn't prepared to deal with boy's high needs  Yahoo News Canada",
    "published date": "Tue, 13 Jan 2026 22:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNZFNTUjlKQzhyWElKVUhiLVh0YzE4cHUzbDlvWGpCdjVlOUpGbFNCT3Y2RVhtWUtrQkJGVlJ6RWs3SklxbGgyOHpLcGhlMEE4NWpacnl1UzlEOTFlX1l6LXAyMTRzck54SW5aWURxVElib25uczRiSUtCRDJRUjJDMVNfQzVPbzE0dkNhZTY0VWVXaUt5cWtoNDNIbzk5LTRrdkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Police investigate another extortion-related shooting in Surrey, B.C. - CTV News",
    "description": "Police investigate another extortion-related shooting in Surrey, B.C.  CTV NewsOvernight shooting at Surrey, B.C., business believed to be extortion-related, police say  CBCAnother extortion-related shooting in Surrey early Wednesday morning  Global NewsPolice investigate overnight extortion-related shooting in Surrey  Vancouver SunPolice link another shooting in Surrey, B.C., to extortion  The Spec",
    "published date": "Wed, 14 Jan 2026 15:39:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNdmFnUFlFMGh2dTg4WHFxX1pfMnN2Tk9NaFFHWWJMaXlxcnNqQzktSFBucmZCdGxncUtqUTNQUGE2ZHBOeVYzQzNVS3pRNjZkZDh6LUhwU0VOb1NLcXlreS1wWU9pMm85QkNhSVhoelpGOVNyZV9lNC0zUmx6SjZtMU5lNzc5UlU5U2VpcF9TUGR0N2VjTDJuZ0dzcU9IYmhpbVpwRHRpRE1sREFv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Ford government moves to pause affordable housing rules for new Toronto buildings - TorontoToday.ca",
    "description": "Ford government moves to pause affordable housing rules for new Toronto buildings  TorontoToday.caFord government moves to pause affordable housing requirements near transit stations  Toronto StarFord government pausing its own affordable housing policy, calling it ‘red tape’  Global NewsOntario looks to pause affordable housing requirements near transit hubs in Toronto, Mississauga, Kitchener  CBCOntario proposes pause on inclusionary zoning  reminetwork.com",
    "published date": "Tue, 13 Jan 2026 20:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPaVJyVzlfakIwbER4RzZPcU12SDlhOC1JV0RSM1JsNDFuMlgtN1lCcEMxV196QnV0d2FLNFlVQU9oVkU4Q2w1N1N1QmdPNjVPNWF5a0gySVRFTmVHdTJxd0g0MEhxdXpNbzRYcFFpaXRhWFBuOHRaYVdEdlZEUlI2QVZWT1JpWC1ENVBIRm83V3RTUWVkQ0pDS0thaDV2d3ZEZlBlTGotYXRBQ1pONWM2ellYeDY2OGo3a2VHa3dB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.torontotoday.ca",
      "title": "TorontoToday.ca"
    }
  },
  {
    "title": "Ford CEO says trade deal with Mexico and Canada is ‘critical’ for industry - CTV News",
    "description": "Ford CEO says trade deal with Mexico and Canada is ‘critical’ for industry  CTV NewsTrump claims CUSMA is 'irrelevant,' but says Canada 'wants it'  CBCTrump is ‘dreaming in Technicolor’ if he thinks Americans don’t need Canadian products. Trade experts explain why  Toronto StarTrump says USMCA ‘irrelevant’ as Canada attempts reset with China  The Globe and MailTrump says ‘it wouldn’t matter to me’ if CUSMA left to expire this year  Global News",
    "published date": "Wed, 14 Jan 2026 14:47:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUVBkNGNRMlVZU2g2Z3JXMm5laWlNOE9mN1VyMElSUWdFcmUyVW5XOUNRb2s1a3FyVExCTnR3NG1JTUZLM1NEa2w5WDZ6TmxEWTluQVV0bk9adGYycnNhQk9DU2p1M29MTWVRaElPVmVTTDNhTjNFTXVid1J4dF8yT2xDclo5SmhkUk1HaGpEMS0wSFlobkQ2U0tRRzRmX25sQnNXaFA0LXNYb21CUnFwT2lINA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "College instructor, a mother of two, allegedly killed by ex-partner in Saanich - Times Colonist",
    "description": "College instructor, a mother of two, allegedly killed by ex-partner in Saanich  Times ColonistFriend identifies business prof. as Saanich, B.C., homicide victim  CBCCalls for inquest into alleged domestic violence death of B.C. woman  CTV NewsSaanich murder victim remembered as devoted mother, passionate instructor  Victoria NewsSaanich mother, alleged victim of domestic violence, remembered as loving, dedicated  Global News",
    "published date": "Thu, 15 Jan 2026 09:40:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQa3E3a0M3bUxVWkpUWF83RFItZUdIMDlfXzk0bVkzYmZHN25MeEdGbnJDRXRUTlZ5VGdBSnZQNGxSR2M4aGxDRHZINGZxYk1DT2pEcFpaamo5SS1IdDhJNUtkNVl1YkxxV3l6UzlHcHN5bGJnR1ZRazZqZDZXWHlSVHZIQzl2dnh0TjcxbVB6LTh0U2JXTUR4VkNmbU9BM1NpR2EtbTlEWXJVYVQ4cDB2bDVNQmN4alhH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timescolonist.com",
      "title": "Times Colonist"
    }
  },
  {
    "title": "Ontario school board invokes secrecy provision to withhold records on $34K fine art collection - CBC",
    "description": "Ontario school board invokes secrecy provision to withhold records on $34K fine art collection  CBC",
    "published date": "Thu, 15 Jan 2026 09:38:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMGdHa1JlX1VvM2d0NC1obEJHVXhOY0x1WHgxV2JFeVc2OFJZRlpqOWxWd0tEYld4S1pYMmI1TGhDdm5CWDN4STNqZ0puN3BiQUJBVWxUak5GWHN2d3ppQjBjSWxoMHZrSXNfRndXaW9SWXNEck5QdlFwNGV3REVZUk9mTGFnWFhLYWh6ZVJJNTV0NVVpSFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Manitoba government freezes the price of a litre of milk, eyes more price caps - CTV News",
    "description": "Manitoba government freezes the price of a litre of milk, eyes more price caps  CTV NewsPremier Kinew freezes Manitoba milk prices for 2026  Winnipeg SunManitoba won't increase price of 1L cartons of milk in 2026: premier  CBCProvince freezes maximum price for litre of milk in 2026  Winnipeg Free PressManitoba freezes milk prices for 2026  SteinbachOnline",
    "published date": "Thu, 15 Jan 2026 02:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPRUFlSFpHZzZBVW1zbF9TdWQybTk0d1NKMEwwYzVVOHJ6Rkc3OHZpaVNvbTluN004X1ZqR1V3ckVCUmVKY1c0YWpTbncxa0pRRXJOZExvZVgxSFRPYXU3QTdyeG9OMkw3VDJ2NFI0UEpiblNZUFdwQW9ubjlCWmNjbjVJMHkyQ3lXdmk4M09LaExXaUZMemhXUUNMSVktT0xMaktxMThGYlZMNmlzM1lNMzUtSWo5VVB3VGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "B.C. gov't settles prison solitary confinement lawsuit for $60 million - CBC",
    "description": "B.C. gov't settles prison solitary confinement lawsuit for $60 million  CBCView Full Coverage on Google News",
    "published date": "Thu, 15 Jan 2026 01:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZHp2TFJJUm93ZXMwVGpPV0c4cno2VjNOdy1oaEVjWVQ3d05EdlJ3ak1JYzF0U19rTE9acEJxZ1pKdF8yTmdXQXJLS1pRYjN3cWh1LVZSRlBidE1kMHlFMlFpcGdNN1FvZ2VYUDZIaDRmMWhHX3pYQUVTd2FhZzJHMm9NQVlNamFzMWtkVmFHcWx5d2tSeU83cDlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Record-breaking temperatures forecast for Calgary Wednesday - CityNews Calgary",
    "description": "Record-breaking temperatures forecast for Calgary Wednesday  CityNews CalgaryCalgary sets January temperature records as chinook warmth reshapes winter routines  CTV NewsWarm Wednesday breaks record: Environment Canada  CityNews EdmontonPotential for Canada's first 20°C of the year in Alberta...in January  The Weather NetworkCalgary basks in record high temperatures, could smash January benchmark  Calgary Herald",
    "published date": "Wed, 14 Jan 2026 14:38:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOSE01ZVdENlJEZGo5eTJRdlRJd1k5Ynk2LVh0NzFXdWI0QmpUUnFicjZERHRzaVQyOVFKUEhfcWs3OEVJeXF5UmdXT2ZVZUc4U2VSekg1SFJqN3pQU1R2akZid3lSRHBSaThTd0FnRW9RdjU4U3JTUXJRS0hWNEdXaEc0TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://calgary.citynews.ca",
      "title": "CityNews Calgary"
    }
  },
  {
    "title": "‘They’ve taxed us to death in Toronto’: Doug Ford says new revenue tools not on table in New Deal 2.0 talks - CP24",
    "description": "‘They’ve taxed us to death in Toronto’: Doug Ford says new revenue tools not on table in New Deal 2.0 talks  CP24Matt Elliott: Olivia Chow’s low tax hike budget shows she’s skilled at ‘bare knuckle’ politics. There’s just one problem  Toronto StarWhy Toronto may defer some infrastructure work — even as backlog grows  CBCSTEINFELD: Highest housing taxes in Canada haven’t built a better Toronto  Toronto SunResidential property taxes in Toronto expected to increase less than 5 per cent  MSN",
    "published date": "Tue, 13 Jan 2026 21:47:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxOc3Nrc2JGZzF5MDNYZHB6M2s0ZnpxLXYzY25QcHFSblYwbVJMTkhYSzkzV1VHajNVS21Tc1VmaEw1d0ktT0RoTkZtZkFQYVlsSE1TRXlqUmltODZkYUkzWWw0TlhHcDJuNXdmMEltS1VTY29ONDQ2SUM4cHRxZHVSeXJWM2dQaXp3UUZxM2FIdVd4OG13QWJLZVVJYW1LR2JoV3J6eHIwcTBUXzJPWFc5dVRCWXNIajVMTU14RC15RnRsdC1IdHNqMXJSanh5TGdVeW5ZNDJWRDE3ODhYQTZIM2hHdTBKVlYzT1JITw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Ottawa to buy private garbage landfill in east end - CTV News",
    "description": "Ottawa to buy private garbage landfill in east end  CTV NewsOttawa councillors vote to allow staff to finalize purchase of dump for undisclosed price  CBCCouncil votes to give staff go-ahead to buy east-end landfill site for undisclosed amount  Yahoo News CanadaOttawa councillors vote to allow staff to finalize purchase of dump site  CBC",
    "published date": "Wed, 14 Jan 2026 23:20:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOMEVUTktQcVVwb1oyNFZnV2dWNnVZZEhXci1DYS0zQlJCWVJyckJ0TE1jczBFcVZkYUQxSmlVMGhjUDZuc0lpVlJka2NwVmZ2NFVyNzlXLWlBLXJYbjQwbkw3VWZuUXN4Y09NM0ttdDZnRmVhVGFMRTdSc1hpY1hYQ0U1S25teGlyS2oyZHBsNC01OHNxMi1ob3JrMXJ0V1V4WlJBS3NZMkxFSnBMdW1CMDVR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Rescue dog found after 54 days in wilderness on Vancouver's North Shore - CBC",
    "description": "Rescue dog found after 54 days in wilderness on Vancouver's North Shore  CBCNorth Vancouver dog missing for 54 days reunited with family  CTV NewsNorth Vancouver rescue dog found safe after spending nearly 2 months in wilderness  Yahoo News CanadaMissing rescue dog reunited with North Vancouver owners after 53 days  North Shore News",
    "published date": "Tue, 13 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPbFlRT2RIbzJpOV9zT1JrSXJJTnZjZVMwc3J0Yk1QcUU3Q2llS2tCQ1lqbGxITmlId1dSeURqd1NHY3FEdHVPUkFnQmFRMFJKOXNYamN6ZFktNGNrbDd5bm90WXRpS3QyMVktVUJ4Qm5zeU9wN1ZxaVFsSjVkOGhJdU5WSzdta3VGWDZxa0NYekVCZkx1RkNjcU8yWTBqdHlqTEF4dnlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Ontario Investing $242 Million to Prepare College and University Students for In-Demand Jobs - ontario.ca",
    "description": "Ontario Investing $242 Million to Prepare College and University Students for In-Demand Jobs  ontario.caOntario colleges warn more cuts are inevitable without help. This is how bad they say it could get  Toronto StarColleges Ontario's 2026 pre-budget submission  Colleges OntarioOntario invests $242 million to upgrade college and university facilities - Kingston  Global NewsInvesting in cutting-edge learning tools  Queen's University",
    "published date": "Tue, 13 Jan 2026 12:56:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPb19naDB6RTgxbjU5dmVQMFpEZjlSZWIxS2M5MmtCSTRuRjdEbDJIcThCZ0FuV0daWUlEc0UtT2xOVFJOWV94ZTI5Q3ItUmJCRmdNYTJPNUdrc2g0NnkzdFFBSng3NHM3LXlXaFJsMmM5WjBORnFfQWtETFlOM1JoRXVnOVRrYXlqb284ZTVlQmhsMlBMMmJnMF9fWk0tclhMcXpuZnJPM1lDUm9PeW1MTFhlcy01c25samtFTS1xajJqNGRIUDV0eTdqZ3p0d3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://news.ontario.ca",
      "title": "ontario.ca"
    }
  },
  {
    "title": "Former NDP cabinet ministers say B.C. has ‘stalled’ on $10-a-day child-care plan - CBC",
    "description": "Former NDP cabinet ministers say B.C. has ‘stalled’ on $10-a-day child-care plan  CBC",
    "published date": "Tue, 13 Jan 2026 21:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQTDlST05NVTA3ZWw5eE05bzREWlJvajZ4WFc3cXhTTnJuVjJma3pVRy1udklVVUR6TjVSbl82OWRFdmVGbWNqY0NlTzZOUkt5OFNCRmJYRXNvVWdwbi1GMXlkTHNCTDR6TVpXZ2VjWnJXcHpyekVFWFFzMFZXdTE1MVNRUjBBbUxOeEN6aUpLWG00bWJDWlA2TTZWNG1aZ2ZjU2dmNkxHVTZLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Overcrowded Edmonton hospitals refuse patients from Red Deer hospital - Red Deer Advocate",
    "description": "Overcrowded Edmonton hospitals refuse patients from Red Deer hospital  Red Deer Advocate‘Pleading for the government to do its job’: AMA on emergency department issues  CTV NewsAlberta NDP calls on UCP government to acknowledge, address ER capacity 'crisis'  CBCRestructured AHS not helping overcrowded ERs, doctors say  CityNews CalgaryEdmonton hospital doctors urge province to keep inpatient beds open  The Globe and Mail",
    "published date": "Tue, 13 Jan 2026 23:02:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOZHNiTzdlSUVScnZsbE5PVjJpQzVHam5PUGlhb2xrdHc1SnRDRDNFd3RPRGFldzd5cEdSZ3lNZkh5WmJhRlY0LTR6clY5Ul9YbjdkbUxKY0NabDRieGx4dEU2MVdlekJFblJYbi13a3NfY0x2U09wTG1Pb1h5WnY5WndwZXJIMktBeUtUaHQxbmZPY05xZThLMUNrSndTYnBWRkpiei05NWJYQk45Z2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://reddeeradvocate.com",
      "title": "Red Deer Advocate"
    }
  },
  {
    "title": "Woman in distress dead after police-involved shooting at Burnaby residence - Daily Hive Vancouver",
    "description": "Woman in distress dead after police-involved shooting at Burnaby residence  Daily Hive VancouverWoman dies in police-involved shooting in Burnaby neighbourhood  Global NewsOne person dead and independent investigators called out to Burnaby  Vancouver SunB.C.’s police watchdog investigating fatal shooting in Burnaby, B.C.  CBCOvernight police incident in Burnaby Heights still under wraps  CityNews Vancouver",
    "published date": "Wed, 14 Jan 2026 22:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTnFnZHVtM01uV0FidEt6dmktQURUT1A5dEZuaFlUY296c05mZHY2c0JDSVdKUkk0bHJRQXZxRzNEWlhlVGxqMTZueVFFMDZNcmhhbjhxT081V0NJblFaaW5tMVozS3FIQUVCa19LbktvTWthcGhvNktmYVE2NlNJMg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Another murder in the Lower Mainland brings total to 3 in 5 days - Global News",
    "description": "Another murder in the Lower Mainland brings total to 3 in 5 days  Global NewsMan fatally shot in rural area of Surrey, B.C., identified as local businessman  CBCMan found shot to death outside in Surrey  Vancouver SunIHIT investigating 3 new killings south of Fraser River  CityNews VancouverMan shot dead in Surrey, burning vehicle found nearby  CTV News",
    "published date": "Wed, 14 Jan 2026 00:23:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9QT1h6eFhHeFJ3WnlDdTJrZkJLLWlEalhXY281STFNTXBaNTNrQ2lKOHdMMDVsQ2EtNzd0T1U4S3BqV3M0M1BMM0tjbFZQRVlrcWdvbkttWjEwVFJZS0pJZS1GUklwOGRxTFMybG1iUm53M2tH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "York police lay new charges in illegal gaming extortion case - CityNews Toronto",
    "description": "York police lay new charges in illegal gaming extortion case  CityNews Toronto2 charged, including former Toronto police officer, in online gambling ring investigation  CP24Ex-Toronto cop among two charged after extortion investigation into gambling ring  Toronto StarBarrie man, ex-Toronto cop charged in gambling extortion probe  OrilliaMatters.comUpdate – Additional Charges in Extortion Investigation  York Regional Police",
    "published date": "Wed, 14 Jan 2026 15:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNQmdJUUd1ZVlPZXRQdVdMdXhGemZUc0RGbkdJR2RyTk1ybHBLanZSZFdEQk5qdG5DaUhRNjJiaEd3R2FFMHpJY1BKZy0zN2FmUGhhcHZTdDdBN0VzM1RnQ3ZYbEdXdlZ5U2ZQV2hVRXpISTlxdE9zX2ljb20waTZYZVZITm5pcHRsOTNHVTNuR1VTajRZYVJ5WjRFaW1yWDUwZy1Bc1hYTnYtZkl5bUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "John Tibbits retires as president of Conestoga College, effective immediately - CTV News",
    "description": "John Tibbits retires as president of Conestoga College, effective immediately  CTV NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 22:00:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPbC1vQVdjbS1KMXA5b0NOaG5DTUhlS0F6dzAySXZVWGMyRkstdkR5OWllWjAxaXBvVzBHbnFOMS1xb3V2dnBESnZaQVRkTThBdF9NMW02WHB0eVRER1NtQzIxYjV1OFIxMUFDNzNGeU5oR3d5TV9IakpjUnNXMDlZT2NqYVdoRXlBb0NNa2RxSDlEdUFlS2g0cHN3Mkh0TzVOcFlremE0QjRXbl9Od05GXzRIVVg3VkR5TEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Poilievre takes aim at high cost of living, DFO policy during Yarmouth visit - CBC",
    "description": "Poilievre takes aim at high cost of living, DFO policy during Yarmouth visit  CBC",
    "published date": "Wed, 14 Jan 2026 22:25:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQcmJzOThMTFZZUmdadDRGeHlCaTRYVXBLbFBjb1pJTUE1dXU1M2wwallROGNaOVRhdmZsSmFBTFA0OTBMV2haLTNUc0VfOVZTLUpKaUxFNXhIdHBHR0Q4MzFtcmpmaDhtTzJGTWlnQTc1YkRpb0JhbURoR1BYQ3pvSm1wSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "1 suspect arrested, another wanted after copper wire worth $10,000 stolen in North York - CP24",
    "description": "1 suspect arrested, another wanted after copper wire worth $10,000 stolen in North York  CP24",
    "published date": "Wed, 14 Jan 2026 23:53:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOWkdiWk1xTnNfMU1wYl83TjBDSkpNc2pXSjlsVzY4a1FfczZwNXJVSmszWmJ2M01ES1RQSllMTVZmWU1Tc2plaWU0OWMxRGV3T1lkQlVRZGZQQVB2d1p2MVVkOU5OSlZfZFhCNTFlMWg2RHZKLTh6MU9ETXpRbHBkQWJyVU5aeVQyNGNrVWxMUWNoOXVSeVFqenFyVS1vcV9PTlAxRV81Q2lDUzVqNW9jcnFsVlF3SXJJZXl6djJRUDBzVm9OZXNjaW1HMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Why an Ontario couple is leading MAID lawsuit before B.C. Supreme Court - Global News",
    "description": "Why an Ontario couple is leading MAID lawsuit before B.C. Supreme Court  Global NewsTransfer from St. Paul's Hospital for assisted dying caused patient distress, trial told  Vancouver SunSam O’Neill’s mother takes the stand in precedent-setting case on religious exemptions for MAID  CTV NewsMAID advocates challenge religious exemptions at BC Supreme Court  MSNCharter challenge of religious exemption to assisted dying law set to begin in BC Supreme Court  Canada's National Observer",
    "published date": "Wed, 14 Jan 2026 15:59:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdnJKcTdzbm9MMlpLeWN6OTkzSHRBcVhSQWV0YVYwb2U2dThINU1NdkdjdlRFTWxTcUM2QktMYy05OHluS05wQmtPbF9NZ1laZmtHTE9Wd0tUNXF0NVZFMXlBTHZqQmZjODcwSllZQ1VKWC1PY0VmZU5EQm5HZ0F6VGgwWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Female doctors in Ontario spend more time with patients than male counterparts, study suggests - CBC",
    "description": "Female doctors in Ontario spend more time with patients than male counterparts, study suggests  CBCOntario female family doctors spend more time with patients, make less money: study  Global NewsFemale family doctors in Ontario work longer with patients—for less pay  Yahoo News CanadaFemale family doctors in Ontario spend more time with patients, make less money: study  Yahoo News Canada",
    "published date": "Wed, 14 Jan 2026 22:08:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNbFUxQktVd1BoZ295RldIMEZwQ0FQQjAteWc3Ykx4NXBkV3hDamdodHVwemlmT2dqcmtVcEcwNkhGVmVqbnpfdFdPekpYX1Bsb0JqWkJ1RWdHTlM5ang2SXpjUnN1bWl3MDNuWVl0U3dsVVVJVzdvVzVDa3lfejZ1X2N6bDJPS2JlWEVTMy1DTldIVlhLUmxIWUlZenhaOTlIdHFGM3d3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Ontario town joins Toronto as latest community at risk of losing housing funding - Global News",
    "description": "Ontario town joins Toronto as latest community at risk of losing housing funding  Global NewsTecumseh waves goodbye to $3.2M from Ottawa over fourplex housing  Windsor StarTecumseh says goodbye to federal housing money after receiving warning letter  CBCRed Deer city council stands their ground on HAF2 four units as-of-right condition  rdnewsnow.comHAF conversation in Tecumseh officially over as council votes to terminate deal  AM 800 CKLW",
    "published date": "Wed, 14 Jan 2026 22:34:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFA5cXVfc2NhMXQ1N0g3WUhLSzdTMFpUM0EtZkQ5cE9vZDZ5N25TbkNNM1Z5bWdITzYzSHBzNUJRTVM4R3ltcHd1VjAxSWlvMTJKNWFaZzlwYXQxVDBHX1A4TTBxSkJqWlN1ZHZhVzFZU0xpaUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Government, authorities step up efforts to tackle extortion in Peel Region - CP24",
    "description": "Government, authorities step up efforts to tackle extortion in Peel Region  CP24View Full Coverage on Google News",
    "published date": "Tue, 13 Jan 2026 22:52:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPVWVJUHJPSWE0eGlJOVRNUlItU0VOeFhsUDBDS0Q4RVBYcUxvZ0gtSlNxQWp4NEdlbmROWU45MGxDdFZrRDQ0aVB4RFFkSnF0TnFXWHJ4M2pvVWpKZjNuZWM1ekZPSU5ZRmxBYW5NZE40VmJHMFU4QTBoWVVwTFlzS2dDdnZ6RmVObkN6Tm96b0tqWExHTkt3b3N3SWdYLTh1MWRQLVVqdkJrMmIwV21EUDFBUGxYU05K?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "CTV NEWS EXCLUSIVE: Former spouse of Canada’s worst mass shooter reveals what fuelled his paranoia - CTV News",
    "description": "CTV NEWS EXCLUSIVE: Former spouse of Canada’s worst mass shooter reveals what fuelled his paranoia  CTV NewsView Full Coverage on Google News",
    "published date": "Wed, 14 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPTVJmRjJrVDAxamlYREVBMVNQWWhlZVozRHRGY2pPcXlQWUJzZVppM3h2R1E3TUxkTnI0Tm9ZdFhZMmRoQ1Q5QjRaVFFSTzBnanAwRzE0RkxtRFMwbS0wdFBwZXp3QmdqLUlXb0x4ZFdWbGJlSi1EYUFoNmF2cXRCVkpaVnV3Q2xtNk45NkZiRkc4eEdmajBTaEVNYmxrdy1LMlVlNmNod1E3ZENnMVlhWXVHQVpDYVd1dm50dDM1aF84cVBGRkZNQjhLX2lzdUJt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "2 injured in fight on and near TMU campus, both arrested - CP24",
    "description": "2 injured in fight on and near TMU campus, both arrested  CP242 arrested after stabbing near Yonge and Gerrard; 1 taken to hospital  CityNews TorontoMan seriously hurt, another injured after fight leads to stabbing near TMU, police say  Toronto StarDowntown stabbing leads to injuries, 2 arrests  TorontoToday.caWARMINGTON: Arrest in random stabbings tip of the iceberg on unprovoked attacks  Toronto Sun",
    "published date": "Wed, 14 Jan 2026 16:56:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPemh2OVdtMXZiM2UzaWw2dDlsbUhFQnVDMWZaVFhfY3pxdkV2dUlvSE8xalh0YzN0aG5zSjlPeXVCOGZaZDN3S091XzBHOXFleUtaX2NkamFqZDc4aEl2c0VXcGJrc3hWZWlNNFdwOFNnZng5X1FQcndpeGFsS0JIZ2hBNDE1bmVfcWlLOENIUll1bDRteTJCMDNFSG1rSmhlU3dDQ3JENGZwd1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Brothers Keepers gangster and alleged hitman found dead in Surrey house - Vancouver Sun",
    "description": "Brothers Keepers gangster and alleged hitman found dead in Surrey house  Vancouver SunPolice identify victim of suspicious fatal fire in Surrey; investigators probing connections to gang conflict  CityNews VancouverBurned car in Surrey connected to fatal house fire, homicide team reports  Global NewsMan found dead after Surrey house fire was suspected gang member, IHIT confirms  CTV NewsPolice release image of victim in fatal Surrey, B.C., house fire being investigated as homicide  CBC",
    "published date": "Tue, 13 Jan 2026 20:16:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNQlVMLUJkVF9oVTYxTi1JbVdYSXFIa1laSElVWklOTW56dm1ZMXhXeThrZEFySEpQVm9HN2xwem56WGZaR0t5NEdyTWhveFRqUkhOZEo0NW5PZnBVV1Y1d1FjSTc0Y1oyMmhDWHlsekxjcXd4Q0JDRjctVVZIZ1didG1qaVBxcFM1TFFxeFdwOTJrUGdkcmVTOU1LT2F4blJhZ1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vancouversun.com",
      "title": "Vancouver Sun"
    }
  },
  {
    "title": "Husband testifies Mountie body-slammed, punched woman during arrest in western N.B. - CBC",
    "description": "Husband testifies Mountie body-slammed, punched woman during arrest in western N.B.  CBC",
    "published date": "Wed, 14 Jan 2026 23:18:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPTEJOajFad0lFU25lOEtFTVdUb2JYR040SkZoWkRIOHZ3WTdnc2hQUDVkRUhxbUpzTktDQ3BEaHJrUWFlbkRvUUtBSEZqdktsbHN1X0xZX2kyOHR6NGdKSENwaDdxeEQ1LVMxTjVITU42Tm1paEtNWmdSaVE5VWlZV1lubDBLMFJybU5mSnBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Man, 55, charged with sexually exploiting teen girl in Winnipeg - CBC",
    "description": "Man, 55, charged with sexually exploiting teen girl in Winnipeg  CBCPolice arrest man accused of giving teen booze, drugs and sexually exploiting her over 11 months  Winnipeg Free PressMan, 55, accused of sexually exploiting teenage girl: Winnipeg police  CityNews WinnipegMan facing charges in connection with sexual exploitation of teen girl: Winnipeg police  CTV News",
    "published date": "Wed, 14 Jan 2026 14:11:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOTHg4ZTZqMFE5NzlGRmZVZzZ6Q1NQVHBuMmNDdTlMdko4dnhtSGVoMmJRbTdkcWN2aGlaZjh3VnhGZ0Zqd1lqYXNsTEphRUU4bkxnbDZ0QW0zZG1BQnBEQV94VENObU1Tc0V6U28zdlBscFBSUm1XR0FqYS1FLTlfd05mVmk4cG5qT2ZTNTRvWjAyXzVKOEZwVDc2b3NNNUxHdEQ2Tm92SWwxUi1YY2pxWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "‘Shot with a bow and arrow’: Antlered deer found dead in Toronto cemetery - Global News",
    "description": "‘Shot with a bow and arrow’: Antlered deer found dead in Toronto cemetery  Global News‘Gruesome discovery’: Deer found dead with arrow in body at Park Lawn Cemetery  CP24Deer found shot with arrow at Etobicoke's Park Lawn Cemetery  CityNews TorontoMinistry of Natural Resources searching for hunter after deer found dead in Toronto cemetery  Toronto StarDeer shot dead by arrow in Toronto cemetery  CBC",
    "published date": "Wed, 14 Jan 2026 11:41:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNTWZoVVh6VFo3YkQ3WG5xTGhpRU9LcE90blZqcmNPOVdzNEcwWjNPV1VmN18zX0RPNU5zNGNBWUFpaXkxczlteXRWN3dvTm5zTUNSRWpXZ0loX1NmeV8yazh3TnpkUms2c3ptN3RfeVpGd0U3TW9NV2p4NmtsU3RiVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "First Nations assembly purchases area around sacred Mi’kmaq petroglyphs in Bedford - PNI Atlantic News",
    "description": "First Nations assembly purchases area around sacred Mi’kmaq petroglyphs in Bedford  PNI Atlantic News",
    "published date": "Tue, 13 Jan 2026 20:29:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPUEhzQ3E3bjRFSWlNbHRpMnFIVUl0ekZQSHNLX0NUQVRtY2pBTExsVXliVFN1MWU5VU1iNlo0MzY1OGJlbmVzYnJYTG9qc3p3dVJodzFMNkJiSVBvb2RIOG9DaTNzNWxsc0RkcnlLa0Q4N0pTUEI2WEtsLUMybUNtc0Q4aWEzNGo5dEZjZHFNbUplN2wzWEpLaDJsdVlJRTlFQnZ6UTdQNHRWcEU2cW1EbV91ME1vNnFIR0ZBS0htQXYwaXR5?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.saltwire.com",
      "title": "PNI Atlantic News"
    }
  },
  {
    "title": "Saskatchewan’s first wellness centre of its kind to open doors in fall - Saskatoon - Global News",
    "description": "Saskatchewan’s first wellness centre of its kind to open doors in fall - Saskatoon  Global NewsSask’s first Wellness Centre with MRI to open doors in fall  Global News",
    "published date": "Wed, 14 Jan 2026 01:22:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQTGpxbEVXZmxvRUhtbE1jdmtrOFFUenhtdUFKRjI0eGVHc3VYdkZHUWJ2QzZqNHJMbVR4bjVZYmxLOUg3cS1hbEFsNzdDVklScDd0S3pYS2pDc0gyaWxNeUtXN0EwTmRObk9XbDA5NTZYSEZCaWRiNEU0cjFoSTBfVFhITDN4bnRFLWhGTVdueXJ2dC1vWTk5YWtaTzRxTWRNcG9EdklnSl9DUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "‘Nerve-racking’: Toronto senior has been without windows in her downtown apartment for more than a month - CTV News",
    "description": "‘Nerve-racking’: Toronto senior has been without windows in her downtown apartment for more than a month  CTV News",
    "published date": "Thu, 15 Jan 2026 00:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPbnNyVFRyUE9KbWdGaDJVRTNWSFJnd0dnd0VtRVVCTDFmcUpCMnI5OHduQUFMN192YlFLbVRPTVlXVFJqVXFXbUwyUDkwQWY3bXRMUWVERzh2MXI2dkphZ3d6TnJWa3lLV3piX2w0aVZCdllZZUZXSmpWcUhtejh6b2dKbVhWYnpnSG55eE1tdVl6MmlhN0ZUeWs1aDJ5VENzWE12ZG0yQktONjRXYlF6SUpfZkxtdHBvSGY4NXFKWDZWcjhCVDk5SlRGdVJNa1VaNnpCSjhJUE8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Power outages, tricky travel possible with wet, windy East Coast storm - The Weather Network",
    "description": "Power outages, tricky travel possible with wet, windy East Coast storm  The Weather NetworkSnowfall warning issued in northern N.B., soggy and foggy for the rest of the Maritimes Thursday  CTV NewsSnow, Rain, Ice Pellets Forecast For Island Tonight  VOCMSevere damage in Port aux Basques as high winds, snow, continue to slam N.L.  CBCWinter storm closes schools throughout the Maritimes before heading to N.L.  Global News",
    "published date": "Wed, 14 Jan 2026 09:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNUC1XNmdPMXRGV3VKQzZUWktySXlpV0xxQXoxYUJ6WXF5THJrWU15SnZLVmRCLWNubmdOcTJQb2tuLVNBLUl4THVMOGJoa3hHRmZfODhLLS1yeTJNeGJ0YkNYNlA4c2FJNDN1Mkh6MlNTekJfLVFOS3g0dk5FVzhKZnotUzk4SWFyanRJX01BZ2tuYWZhNlYtV1ZIQzVqSHZYSGx1czdnSmNCS2ZBc2kxWWhBRFdiMmpnTGczNmVmNy1tcEJoR1Eyc0VhVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "This brick-throwing, feces-smearing offender has terrorized Nanaimo for years - Vancouver Sun",
    "description": "This brick-throwing, feces-smearing offender has terrorized Nanaimo for years  Vancouver Sun",
    "published date": "Wed, 14 Jan 2026 23:45:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYVRIU0NSUzdyTEhjX1J6WVRKUWxLcHZySDRVNTZBdVYtYmI2a1RBMFNmalFZNFBYb09OU203T3lBSGFlSkIxLU15UWc1OTJoMllaaUhZbWsyTDVpSjF6Y2lBVDRwV0RRRER0VnVfc1VlejUyQXN0d0k1Zi1Bb3ZlXzBqeFJoX0F2MUNFU0VxRmlTaG1hQUtOd1V6cHU3V3JiQ1BLT1loNk5wX1hxNmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vancouversun.com",
      "title": "Vancouver Sun"
    }
  },
  {
    "title": "Bell: City boss Duckworth isn't fired as gutless Calgary politicians wimp out - Calgary Herald",
    "description": "Bell: City boss Duckworth isn't fired as gutless Calgary politicians wimp out  Calgary HeraldBraid: Duckworth stays on, but new councillors won't take bull from administration  Calgary HeraldDavid Duckworth to continue as Calgary's CAO amid questions over water break accountability  CityNews CalgaryLetters, Jan. 15, 2026: 'No accountability in water crisis'  Calgary SunBell: Calgary water pipe fiasco, city hall top boss Duckworth could be punted Tuesday  Calgary Herald",
    "published date": "Wed, 14 Jan 2026 04:40:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNckNFTnJSNHFRQklXbjhGVDlPNExPaG9yc3pILWxxYzZ3Q1IwVFNET3g3NDRPRkxuQldSOFduY0h1c0tLQVczc2xXRnJnTEpJNEZXMy1jbldKd1hHSmFVNkFreWtZUUVpWEs3SUpPTENGaXhIcXVQR3ZzcHhxcDV4cndOZEdtNFMzYVZwMVVPT2xIUExPQko4MUJSTUFPb0hHdE1NSnJoSXpUc2k1NE51dVBmSFhTSVl0TDM4SA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://calgaryherald.com",
      "title": "Calgary Herald"
    }
  },
  {
    "title": "Proposed sureties pledge $1.2M in bail for man accused in Ryan Wedding case - CP24",
    "description": "Proposed sureties pledge $1.2M in bail for man accused in Ryan Wedding case  CP24Potential sureties for Ryan Wedding’s alleged money launderer questioned on his lavish lifestyle  The Globe and MailMan accused of buying $13M car for fugitive Ryan Wedding tried to flee Canada, U.S. says  CBCThe ‘bank’ behind Ryan Wedding’s cocaine empire or a modest jeweller who put 0 on his income taxes? Bail court hears two versions of Rolan Sokolovski  Toronto StarProposed sureties testify at bail hearing for man accused in Ryan Wedding case  SooToday.com",
    "published date": "Wed, 14 Jan 2026 18:17:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNY0V0Y2VIZE52bl9BaHZ4ckExUlhMQ00xbjRGUXBua2tTLUZ2cFpXQjdCWUpNNnphejRZR0NLUzRZSEFLZmkxaDB4VWtEYUFUd19ZWXJVLUJsQkVjWjVneVIxNkZqN21pd3hZNldwMVk1YXdfZlJQM0FsWWxNNEhNcmw0UzhTN0R6Y2RJUEpsdUFSMDJoVnA5QUFpQVVWcFNCenFMRnRoSEg0NUJkMXRvaXpQVjhlRnNtVzNzQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Kelowna RCMP breaks silence amid growing crime and safety concerns among business owners - Global News",
    "description": "Kelowna RCMP breaks silence amid growing crime and safety concerns among business owners  Global NewsKelowna RCMP, City respond to increased social disorder, many ‘addiction-driven’  Kelowna Capital NewsKelowna business owner ‘just trying to survive’ amid downtown crime chaos  KelownaNowBusiness owner in Kelowna’s Rutland area pleads for more attention to crime, social issues  Global News‘Insufficient treatment options available’ to solve downtown Kelowna’s ‘addiction-driven’ issues  KelownaNow",
    "published date": "Wed, 14 Jan 2026 02:34:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxORFBxVUYwUzlqUWN4em1GMXdoRTVTZ1lUZ1VoZWdBbnBHNlhibDBLQmE1ZktwbTNzRUpkUktlTmI5ZXJwY3ZBVDJjWFVrVVRKeTNSRzRCX2MtYk1aSl9ST2RiaTBESVpBakFOSjlfMkFWZllwd0F1d1I2RWZJYWVmbzlXTjdZZzlXajN1WXJfMktLWWl2NVdiejh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Girlfriend recounts victim’s final moments after east-end stabbing - London Free Press",
    "description": "Girlfriend recounts victim’s final moments after east-end stabbing  London Free PressLondon man, 45, identified as victim of city's first homicide of 2026  CBCVictim identified in London’s first homicide of 2026  CTV NewsLondon’s first homicide victim of 2026 remembered as generous, well liked  London Free Press",
    "published date": "Wed, 14 Jan 2026 19:22:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNaHpSdk5YVkNwZEVMdHVabUpMSDRUVFRmWUk5VDNnNVctWTFBTVNYcXpBNXF6THlRdVZqeTBrTUhVRlRkYXJUREtqcV9tTVhGNkhpTzVqVWFhemcwWGREanlTUUJyeDRBeWozR0J2QzJUS1BQSVVnRXlnNXdITnkyY05JMElDNXJucDRkNUFzbzVTZlZscnRoTEZ0V09TWklMYmJJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://lfpress.com",
      "title": "London Free Press"
    }
  },
  {
    "title": "3 Brampton men arrested in $500,000 cross-country bank fraud scheme - CP24",
    "description": "3 Brampton men arrested in $500,000 cross-country bank fraud scheme  CP24Project Carbon Copy, Three Arrested in Major Fraud Investigation, Image Released  Toronto Police ServiceToronto cops accuse Brampton men of orchestrating cross-country fake cheque scheme, swindling banks out of $500K  Brampton Guardian$500K casino and cheque scam leads to charges for Brampton men  INsaugaBrampton trio busted in alleged $500G fraudulent cheque scheme  Toronto Sun",
    "published date": "Wed, 14 Jan 2026 22:34:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcjV1cVBvVWhBcHJPaXhlQXlBdXJZQlBQSUV6aW9BR3REOVY3dVlkZnF2M1Bab1FfMmZPN2lmZHJkN0lDdDRUdmxUZld2NUk1Rm5CMHJsVW1UY05jdGlrU09aS05lamFNYWZZVVZ3eHJIZWhVUEh6Um4zZVo1UXlmc0FQbG5XMDhob2NSTGZVS2pzSVJ4SGFEam9hWWU1cEZHcFhHalJRYnpiS2FsMF9UREJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Answering machine message left at dead B.C. couple's home helped lead to murder charges, trial hears - Vancouver Sun",
    "description": "Answering machine message left at dead B.C. couple's home helped lead to murder charges, trial hears  Vancouver SunAnswering machine message was crucial lead in B.C. murder investigation, officer testifies  CTV NewsCrown alleges financial motive behind Abbotsford, B.C., couple's deaths  CBC3 men accused in Abbotsford couple’s killing cleaned their roof, gutters the month before - BC  Global NewsCanada elderly couple murder: 3 Indians charged; student visa holder with no college record accused  Times of India",
    "published date": "Tue, 13 Jan 2026 23:51:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOQk1GWjA0QnZyTThoaG5sQi1qbGhfc1FIOWlYWGJOTE4xd0FGdmZQYndFY25DZWFqTnFXZHVOaVdHbFY2UVFJQWhWNHBCV2ZFbjBuaHpqdFNjR3phbEZzVjhFeHhkVzd0dnQ5aE1KVm9vdU1EQmpFbUVQbEtSSTdvT09adG9wSUF1M1FjeQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vancouversun.com",
      "title": "Vancouver Sun"
    }
  },
  {
    "title": "Elderly Toronto victim scammed out of $4,000 in credit card pickup fraud, police say - CityNews Toronto",
    "description": "Elderly Toronto victim scammed out of $4,000 in credit card pickup fraud, police say  CityNews Toronto2 suspects wanted after allegedly defrauding elderly victim out of $4K in Toronto  CP24Toronto senior loses $4,000 in credit card scam involving ride-share driver, police warn  Toronto StarSuspects Sought in Fraud Investigation, Images Released  Toronto Police ServiceImages released of fraudsters who scammed elderly victim out of $4,000: Cops  Toronto Sun",
    "published date": "Wed, 14 Jan 2026 14:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOcGxnaEh5ckxXdEc4TXpRbnZPZnZyQU4zSERpMmZTNzJybVk0NHBnUEgzUTZ5SHpmQ05QVW1BbUlkRVVfWno3UlRjdVJkN2s2OVpmSlFUU1dLM3RCVjdWMkJjM19ZcW5pUUtMczhzc0c5Rng0SXRyTVBlWlozSG5vVUE5M3lfYXZYNG1qR2cwQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "Saanich teen in critical condition after Richmond hit-and-run - Times Colonist",
    "description": "Saanich teen in critical condition after Richmond hit-and-run  Times ColonistFamily seeks answers after alleged hit-and-run in Richmond leaves teen critically injured  Richmond NewsRichmond teen fighting for his life after fight, hit and run caught on camera  Global NewsTeenager in critical condition after hit-and-run in Richmond, B.C.  CTV News17-year-old found unconscious, bleeding in Richmond hit-and-run  Daily Hive Vancouver",
    "published date": "Wed, 14 Jan 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYjJfTnRvNHRDU293LVU2dy1PSGlKemQ1X1p1NnJ4YkZLaWkxZVNZMHU4aGJMelBkZklFMEdKY25UaktSbnBkcVFpcG1BdWhFc2VGTlpmZjNlNEZ2aEE0RnBzZTQ3Q3NNRFdTWGNxNjhFV3R1UEVHekc0YTVnMm5lN1hldkVLTDloc01PWVlLS1RFc2xvSWZLTW8wQXdjQW5jUkNrRGZnZC1Vd1l3akVSZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timescolonist.com",
      "title": "Times Colonist"
    }
  },
  {
    "title": "Girl, 15, was killed amid parking space dispute in St-Léonard, court told - Montreal Gazette",
    "description": "Girl, 15, was killed amid parking space dispute in St-Léonard, court told  Montreal GazetteMurder trial begins in 2021 drive-by shooting that killed Montreal teen Meriem Boundaoui  CBCTrial begins in 2021 drive-by shooting that killed Montreal teen Meriem Boundaoui  Global NewsTrial underway for 2 men accused of murdering Montreal teen in 2021 drive-by shooting  Yahoo News CanadaMen accused of murdering Montreal teen Meriem Boundaoui in 2021 appear in court  CityNews Montreal",
    "published date": "Tue, 13 Jan 2026 21:11:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPUWtQaU9oNUQtdmRIamR1R0d6TFgwaFJmTzdWMHA5WmpGcU4wMXdNMGZwTUdMRmpfeFh5RWhrTWFEb2ZldzY4Z3luWG1oMGJ4Q3NTRjZETnJ6N2NJdktCWUYzckJaMlF2d2ozRm5YbzBBN25OeGxBNEVJWVQ0ZF9IRG96SXlXeUNmdlREZDlOdXRFLU9oUnp3b0ZfX1g3Y1I0XzJfQ2J2V3RVaC1OT1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montrealgazette.com",
      "title": "Montreal Gazette"
    }
  },
  {
    "title": "RCMP responds to firearms complaint; suspect sustains fatal injuries - Haligonia.ca",
    "description": "RCMP responds to firearms complaint; suspect sustains fatal injuries  Haligonia.caMan who was subject of Hants County police alert killed in RCMP shooting  CBCSiRT investigating death of Sipekne’katik First Nation man shot by N.S. RCMP  CTV NewsFatal police shooting being investigated by watchdog in Nova Scotia - Halifax  Global NewsSuspect dead after shooting that followed reports of man with gun on Hants County road  PNI Atlantic News",
    "published date": "Tue, 13 Jan 2026 20:57:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOMmVIS1diRmNpN1o4QjhwTUl6NDRzNHR1TWxNUFdkU2MzdHdCZks2RjdqdTd4VEJKQmttWHJaSmt2ZThBdlhCZktRYmdYVXk4X2hxZHNVbXhQeU9aalBZLUY4bTNYZWNHYU1JSUhYaDdJUVBlNzAtZEZIT0hZRmZpZUdKWWhBMXlYaDZTNzJTMWR6NTJyWFZwRlpENko?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://haligonia.ca",
      "title": "Haligonia.ca"
    }
  },
  {
    "title": "Michigan politician says Ontario’s electricity surcharge didn’t hurt relationship - Global News",
    "description": "Michigan politician says Ontario’s electricity surcharge didn’t hurt relationship  Global News",
    "published date": "Wed, 14 Jan 2026 11:00:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPMm41UXdTaGdUUUlNNnJ5MDdCbDhvdTJiOHI2QmxRbS0zZEwxdTBXSjN0U3ZTc3RyZnYyWXJJdmhEd3ZJbG4wcUZrV1pINThQdktkSHlWbjdNTjBlX3ZraGxKa2MxQmh3Y2pYNmpObjg4cXJVUmo3VjZFYk9PYk9LUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Another overpass strike causes partial shutdown on major B.C. highway - Daily Hive Vancouver",
    "description": "Another overpass strike causes partial shutdown on major B.C. highway  Daily Hive VancouverOverpass strike in Surrey causing delays on Highway 1 eastbound - BC  Global NewsTruck driver strikes Highway 1 overpass near Surrey  CityNews VancouverTraffic Alert: Expect delays on Highway 1 in Surrey after commercial truck hits overpass  Vancouver SunTruck hit Surrey overpass on Hwy #1  Surrey Now-Leader",
    "published date": "Wed, 14 Jan 2026 19:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFAyMEZ5SE80bGU5VzRoN29ITk9UQzN5ei1sMWVFRlB6WVZRZm5mbi1adlY0d1dESkxQMENqbWRXa2pjSDlOcW1ILTlDM3FJU21WYV95Qjh1NGozdmwyek5ad0ZVYUF5bjRpQ0dVa0h2VkdGd3Awdmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Day parole extended for man who raped, killed and decapitated a 12-year-old Ontario girl - National Post",
    "description": "Day parole extended for man who raped, killed and decapitated a 12-year-old Ontario girl  National Post",
    "published date": "Wed, 14 Jan 2026 18:58:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9rOUNrWlFVakZjNU8yWGFPdy1wZUkySEotRUZFUi1aT2pXLVRsMlc4Mnl6R3VENEdNMzd0Wl9GWXRtV0hhd0JXSUVuaGVoalI4TlhuLUtwYWd2NFh4NnVjam5HLTEwYXh2bTRzVzhyMDJaLU12bnhhbHd2TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Four highrise towers, including a restaurant, proposed for Orleans near Petrie Island - Ottawa Business Journal",
    "description": "Four highrise towers, including a restaurant, proposed for Orleans near Petrie Island  Ottawa Business Journal",
    "published date": "Tue, 13 Jan 2026 19:57:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9udXNSRm1FS2I0R05KVXBTQ2V3YlhrMW5rcGZxVjcxeU80RENBR2hZSVZKZWFmLVF1cjNrU2daN3RxbzlLT1R1dTRJdU9ORXp5VmtTdm1wZ0RPU2pxZ0F4Y0tfTVpmekk5OVZWZVI3NTl4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://obj.ca",
      "title": "Ottawa Business Journal"
    }
  },
  {
    "title": "Cyclist dead in probable hit-and-run in Richmond, B.C., police say - Coast Reporter",
    "description": "Cyclist dead in probable hit-and-run in Richmond, B.C., police say  Coast ReporterCyclist found deceased in east Richmond after what police suspect is hit-and-run incident  Richmond NewsMan found dead in Richmond may have been victim of hit-and-run, police say  CTV NewsRichmond RCMP investigating after cyclist killed in hit-and-run  CityNews Vancouver",
    "published date": "Tue, 13 Jan 2026 21:07:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQQ08xbjdqX1YydVpJcEcxMEg5RUtlTEktVkt3N0pVYkNWN2UwMDdiVnM3R2dPZEd0Nzg2T3lLNjRsWXNjVkx0Y2Z4d3oyMVRuMW52RXVXMEp4cHU3SjRMdjROX0Jhamc5Z0V5aXJnNHVfTmNKNmtTNzZTckRwZGNaNXJKTW5DTTlRQ3hDZEVNdlNFN2ZuX0xDMmc1eEZVX1ZDcUs1TkxPcWNjQU9JN3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.coastreporter.net",
      "title": "Coast Reporter"
    }
  }
]