[
  {
    "title": "Canadians finish well back in Olympic men's ski cross - Sportsnet",
    "description": "Canadians finish well back in Olympic men's ski cross  SportsnetCanada's Reece Howden rips 'absolute joke' conditions in Olympic men's ski cross final  CBCCanadian ski-cross star Reece Howden on Olympic conditions: 'An absolute joke'  SportsnetTough field, tough day after Canadians overcome adversity to compete in women’s ski cross  olympic.caCanadian ski cross racers endure disappointing day at Milano Cortina 2026  TSN",
    "published date": "Sat, 21 Feb 2026 12:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNVUdaUFY1MENLZnNUV0ZOb3o5VlpkNGFtazVxZGx5RDdrbC04UE1XVDVlSDVUQ005T1QyM0k0R01KcHRqX1J2b3NhSU5mRjloSjlqd3NvNWRqM0pKV2MxckRzS3JEM2MzMzhod0l1amtGVnRfaGhBSXlEZkRaZGcxdkg0ZGpHR1Y2MGVqRl9aVnZNWGxPMGM0ZlU3OA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Jacobs, Canada to meet top-ranked Mouat, Great Britain for men’s curling gold at Milano Cortina 2026 - TSN",
    "description": "Jacobs, Canada to meet top-ranked Mouat, Great Britain for men’s curling gold at Milano Cortina 2026  TSNWhat to know as Canada’s Team Jacobs takes on Great Britain for gold in the men’s curling final  The Globe and MailJacobs plays men’s curling gold, Maltais seeks fourth medal at Milan Cortina Olympics  CP24Canada’s Team Jacobs advances to curling gold medal final after beating Norway 5-4  CityNews KitchenerOlympic curling takeaways: Jacobs' mistake-free plan sends Canada to gold-medal game  Sportsnet",
    "published date": "Fri, 20 Feb 2026 18:49:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOTjlnd0U2M2R4YzlsZ0NEVnZOMjZmb0JPdEhYdU9pcl9mcVJmOEFqendBNFpnQmhDcFJsWW1xdUFWVWhaSkJXR2U1SXhTcjQyMFZBeE96ejlGbVBKaEdhU203Ym56YXJqUWs3MzM0Sks1X2VWZ19UUHRmME1yZm02MWVwaGJpUFllNlpyVGxSNWdpM19vbzRFdUhPb0R4X0pXS1RaU3RzbHAwS2FpM0VPdHJxNEJyR0JtTC1lZFRLckM1NkR2a2RwR3hmYkloV3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Swearing that he's a \"true Canadian,\" Wayne Gretzky is cheering for Canada in the Olympics - Toronto Life",
    "description": "Swearing that he's a \"true Canadian,\" Wayne Gretzky is cheering for Canada in the Olympics  Toronto LifeIn saying he’s a ‘true Canadian,’ Gretzky shows he’s still a wonderful deflector  The Globe and MailWhat Wayne Gretzky said of Canada’s women’s hockey Olympic run  CTV News2026 Winter Olympics: 'True Canadian' Wayne Gretzky says he wants Canada's hockey team to win gold: 'I've never wavered from that'  Yahoo News Canada‘I’m a Canadian’: Wayne Gretzky defends heritage amidst friendship with Donald Trump  Daily Faceoff",
    "published date": "Fri, 20 Feb 2026 20:01:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQVWUxWFFJMmM5VElJMFNyR3VqcEh6Q3FMLTE0U2RBMElnUDNhQXFidzZCY0ZlNTlLTzJheGpqT0h2UldRbVBrb0ZFYnZXclRJQXdIcDkzNkRXSTh0VDRGeGNhcUVxMzQzYTR1UDRHTUtvUkQ5TmgwbS1NRWR0Y0IxRjFTcFM4Yy1PWFlpUzdsSGtwUnFiUmxoaHdyTkFOUmVqekk2TTdGR1hZQ1Zka1YtNGdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://torontolife.com",
      "title": "Toronto Life"
    }
  },
  {
    "title": "Olympic viewing guide: What to watch on the last full day - CBC",
    "description": "Olympic viewing guide: What to watch on the last full day  CBC2026 Olympic Games: Canada aims for bronze in women's curling against U.S., while men's team goes for gold  CBCCanada goes for gold in men’s curling; Maltais chasing fourth speed skating medal  The Globe and MailDay 15: What to watch with Team Canada at Milano Cortina 2026  olympic.ca2026 Winter Olympics Day 14 recap: Team Canada's men's hockey team defeat Finland, Valérie Maltais captures bronze, as Courtney Sarault skates for history  Yahoo News Canada",
    "published date": "Sat, 21 Feb 2026 00:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOWS1sRWFFc0ZOeEhwREEwX0JQZ0E0R1h6YnF4WXd6ZWRpUmVsc2Q4ZndDb3dUMnIyT0dwZnpSdUtPWWx4bWdBcG81Ymswdnk2ang1VkFXOHV6OEdfcno5TEhiUVVDMjIwS21NbzZ1UDAzSTA5MTN6dDZsdVN1VVg5RnhXSlJoVXByRDRxdzNrTl90WXlyNUh0Vmpkaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "'Absolutely embarrassing penalty': Finland raises referee controversy after losing Olympic men's hockey semifinal to Canada - Yahoo News Canada",
    "description": "'Absolutely embarrassing penalty': Finland raises referee controversy after losing Olympic men's hockey semifinal to Canada  Yahoo News CanadaMacKinnon sends Canada to gold-medal game after sinking Finns with game winner in dying seconds  CBCFans in Milan react to Canada's advance to men's hockey finals  Yahoo News CanadaFinnish great Teemu Selanne rips officiating: 'What a joke'  SportsnetMarchand, unlikely line spark Canada comeback in Olympic semifinal  NHL.com",
    "published date": "Fri, 20 Feb 2026 22:58:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxPYlM1WmotVjVPUFoyeWo0YjIwUWgya2JLdUllTGRBbkhwNGFub3dRemRUbjY2TlplWGd2WnlLUUU2WkotSk5wV3RscFVmRFdKX3ZCSTNoQ0QwVHNxVks4ZjBJZFhuS1NzLUVMaDhBamFLUFIycjFXdC1GbW13dmEwbHZUU0V3NXlDazlwekRzbS1lMlVUX3pWRWY3NDBDS3hVVU1YeFVWRUtMMEJocG0tRU0zOVJfb0ZNRmRSeGlwR0xRR3psRGcydklacElPSURzRGhSQUZYZFJPcm9VX1VwcVdSSmlUQUpKeFUzZTR2SXJXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "PQ MNA blasts Olympic officials for forbidding Marie-Philip Poulin from speaking French - Montreal Gazette",
    "description": "PQ MNA blasts Olympic officials for forbidding Marie-Philip Poulin from speaking French  Montreal GazetteWith her knee taped up for the gold medal final, Poulin hid the pain from her Canadian teammates  The Globe and MailOpinion: As U.S. loses lustre among Gen Z, Canada must pounce  Montreal GazetteThe Canadian women’s Olympic hockey team needs an overhaul  Daily FaceoffSaskatoon's Team Canada women's hockey player Emily Clark takes home silver in third Olympic Games  CBC",
    "published date": "Fri, 20 Feb 2026 23:51:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPWTBYLTRYWlJSbjZZVUdaLUc0TmdlOFZDdXFseDZya1EzeUdoTFRHNWpUZTlGaV9sQjhKbWk3VS0tV0lmaU80dEszSUExSm9BS3kxc2NqQkpiMTh2bkpEOVQyM1RvZHIwZ191dmUxckJiNFBCQzJPQzhUZXdHV2RVYUtXTW9Oaks5QzVIbEJqRGtVMDBSQ1UtMm9ERU9OZklieEQ5TkZ6SU5sRzlQWUtiRFhCZU5aX0xnY1puSVhWT0FjZlNDdXBF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montrealgazette.com",
      "title": "Montreal Gazette"
    }
  },
  {
    "title": "Homan, Canada to play for bronze after falling to Sweden in semifinal - TSN",
    "description": "Homan, Canada to play for bronze after falling to Sweden in semifinal  TSNTop-ranked Canada, U.S. fall in women's Olympic curling semis  ESPNTeam Homan to play for Olympic bronze medal in women’s curling  olympic.caSweden and Switzerland to play for Olympic Gold at Milano Cortina 2026  World CurlingCanada’s Homan improves playoff chances with victory over Italy at the Olympics  Welland Tribune",
    "published date": "Fri, 20 Feb 2026 15:51:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZGZKdGx4OERmeVVWMzcyWmMzRFZwcE43RmFnWmVFdXBVZWFsMGgtZmtGdmE2UWR4MWl5QUFxSXFReEhSbWtLTThIYjFaRXdCZURIY3hpNDVDNF9NOHZGeWg1dGt6TTJIajQ0SWVQLTItQk9OQ2NZNEhIc1BTTF9TdHpEbV9aRzVoMWk1TnhQbVZyWUkzeW5pSC1tMUh2ZTRJb3JERVZ5WTk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "2026 Winter Olympics odds, picks: USA vs. Slovakia men's hockey Friday's semifinals predictions from proven expert - SportsLine",
    "description": "2026 Winter Olympics odds, picks: USA vs. Slovakia men's hockey Friday's semifinals predictions from proven expert  SportsLineWhat Team USA is saying about facing Canada for gold  SportsnetMaple Leafs' Auston Matthews Faces Ultimate Legacy Test As USA Takes On Canada In 2026 Olympic Hockey Gold Medal Game  The Hockey News2026 Milano Cortina Olympics On Tap: Canada-U.S. gold medal game on Sunday  NHL.comCanadian players know the importance of a Canada-U.S. rematch for gold  The Globe and Mail",
    "published date": "Fri, 20 Feb 2026 17:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQVGZNaDRPbVBZNjlVdFhtZlktbkMxWVZPNnRVckVXTmE2SWZrU3hhU2FSczZ5WEtqUlhMUUc0VkQtQVFUbHJMeVlmNWJhbURrcFhfa1VmNUdNblM5ekpldXhORmdxb3hqOG80a3VFbUNUQnpWZ0lOVTAtdWdUNk1zZnctWVBfNl9oVHN1dzVsU0E3V0RkbTNvUENrWDByWHRiQUxJczlvUXpENGZtcVh3eEJGUjRiWDQ3emZwdklEUFIybXFNR2Fyc1FGN2F1eWE5MTRoek0xLThwSFFyak9n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsline.com",
      "title": "SportsLine"
    }
  },
  {
    "title": "Canada’s McDavid sets points record at single Olympics with NHL players - CTV News",
    "description": "Canada’s McDavid sets points record at single Olympics with NHL players  CTV NewsCanada’s McDavid sets new single-tournament Olympic hockey record for points in NHL era  Daily Faceoff2 Oilers Who Need To Bounce Back After Olympics  Yahoo Sports CanadaCanada's Connor McDavid breaks points record, keeps 'C' warm for Crosby  SportsnetMcDavid sets Olympic points record, extends it to 13 with assist on MacKinnon’s GWG  TSN",
    "published date": "Fri, 20 Feb 2026 19:38:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPNG5qTm5FbzBiRDZneUhJdkRfMFM1bXhFdGxtem1zeDZ0MW1LXzZXbFg0Q1MyUWxpeWxaLUlBbGs1dThCQ1JYRWhLWnJlSHUwZG41WnpDTEZsS2RvWVl0cWR5Zy15Qkg2ZTd2cWFyLUNRRVdZUDh2Mm45WXpTbmZ0WHd3NGJOUWVwUFhHUlVQTkdlQ0FySk1ZbVhzczJodkZxdjhhdFpXUU9sN3JrS0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Vancouver fast-tracking early liquor service for Olympic gold medal hockey game - CityNews Vancouver",
    "description": "Vancouver fast-tracking early liquor service for Olympic gold medal hockey game  CityNews VancouverFord allowing alcohol sales at 6 a.m. on Sunday for gold-medal game  SooToday.comOntario bars can serve alcohol early for Sunday’s gold medal hockey game, Ford says  CityNews KitchenerWinnipeg bars, restaurants opening doors early for Olympic gold medal men's hockey game  CBCDoug Ford approves 6 a.m. alcohol sales in Ontario for Team Canada gold medal game  CP24",
    "published date": "Sat, 21 Feb 2026 00:43:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNldGYmdLTmVOdERBRHBVT2xhcm5qTThWV3JISjB6MFN6SGwzQmlXcUZoQkJuOFk1NldDN2owT0ZoMC1SUjJ4TzREQS1FU0t4dGNOcXhLYjFSS214N0l5VmpwSHJvMFh6empLSktFSjRRY3V3dTRFamc4bFVCYTVhNG5fMUVTM1MyeWx5UEdpaHlwYnVmUlRWR2FCdFdRQkk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vancouver.citynews.ca",
      "title": "CityNews Vancouver"
    }
  },
  {
    "title": "Milano Cortina 2026: Day 15 Olympic events to watch, full schedule - Sportsnet",
    "description": "Milano Cortina 2026: Day 15 Olympic events to watch, full schedule  SportsnetFive things to watch at the Milan Cortina Games on Saturday, Feb. 21  TSN2026 Winter Olympics: Live updates Saturday from Milan Cortina  ESPNDay 14: What to watch with Team Canada at Milano Cortina 2026  olympic.caOlympics schedule tonight: What's on in primetime in Milan on Feb. 21  Yahoo Sports Canada",
    "published date": "Sat, 21 Feb 2026 04:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPVzV1cHI0MGhMcDNNUDZfTzQ4dFlqTGk0SGVVYkppd3c5S3RLbkRkTzhkcU00bFJoS2xvaDhDS1pfeE9fMGhuSTlnWGRaOVUxWExFN0NsdDRBMWN5dmtNTDZkRnB5cEtUT2pmVlhUeTZINV9ITGJEUFJQSDI4RC1YYXZOSHVfdUZhblBOOXUzTjJHSnZCWk80aDBSSlA5Z29vTmJybExEcWYwSDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Canadian freestyle skiier wins shocking Olympic medal with insane final run - Daily Hive Vancouver",
    "description": "Canadian freestyle skiier wins shocking Olympic medal with insane final run  Daily Hive VancouverBrendan Mackay wins bronze in men's ski halfpipe - Team Canada  olympic.caU.S. freeskier Alex Ferreira completes Olympic medal set with halfpipe gold, in photos  Toronto StarCanadian skier Brendan Mackay wins bronze in halfpipe  CityNews VancouverBefore these Olympics Alex Ferreira’s dad told him he had to win gold. So he did  The New York Times",
    "published date": "Fri, 20 Feb 2026 20:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQZXVnckU1Q3p2NlBpaThPcHVsZk5GLVlkTFJGb0d6bFdocUdLbnpOWlFUeXJfOVk1UmRSU3JPdGdRd3BHUkFYdlNOem55YmlTTE0xcE54bUpJeE0wV3NzaDRKb0FXbFdwX3JVMkVWSE05c1VUS3dWZ3pEanRXZTMwcjNhenllOE90YUVLQ2I5clRNUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "‘Unbelievable,’ Mark Carney video calls Team Canada women’s skating team after back-to-back Olympic gold - NOW Toronto",
    "description": "‘Unbelievable,’ Mark Carney video calls Team Canada women’s skating team after back-to-back Olympic gold  NOW TorontoCanada’s Maltais wins bronze in 1,500m for her third medal at Milano Cortina 2026  TSNCanadian speed skater Valérie Maltais takes surprising bronze in women's 1,500m  CBCRosie DiManno: Valerie Maltais wins her third speedskating medal in Milan, and this time she surprises herself  Toronto StarMacKinnon lifts Canada into gold-medal game; Maltais wins third medal in Milan  richmond-news.com",
    "published date": "Fri, 20 Feb 2026 19:58:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQQ2w2UzkzRXFkVHYzNm9xdGNCc2FhQkpLNTFQMDlodlhnck1ZRXRHbEI5M2Z0bE9QSkhnNTZOUko5aGd5alZidmJwTnVNNzVndnlSRTRkbnNWZFYtQTQxNm9ScHVEaC0wa2V5b3YxSU1qUmo4VmdRaENZT3FZXzVsVTFhVnJoYzBJeE9IWFBUTlc0TmNMcUFfVzQ2Y1pvTVg3TXRDSGJjeVFDLWdzRVJja1JSUEVfV3piYm0w?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nowtoronto.com",
      "title": "NOW Toronto"
    }
  },
  {
    "title": "Crosby could return for Team Canada in Olympic gold medal game - NHL.com",
    "description": "Crosby could return for Team Canada in Olympic gold medal game  NHL.comCanadian captain Sidney Crosby is a game-time decision for Olympic gold-medal final  Toronto StarCrosby misses Canada's Olympic hockey semifinal win over Finland  ESPNCrosby’s absence for Canada helped Barkov-less Finland keep game close  Daily FaceoffCanada's Crosby a game-time decision vs. USA, Morrissey out  Sportsnet",
    "published date": "Sat, 21 Feb 2026 00:33:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPWmFLMFFnQzlXS0lEZ2tHaVJRNnpHR244ZS04b1F5ckY1bkxzc0RaQVBLckJac2lYVnYxdGhfdnE5Uzh3cG9pUmFkcUNiZkNabEt3Z1ZCNWhlZDZrNDVQMGxUdk1uVmNTa0Zoc21nWGxFMFREdFFIZ0VuUnR0WDFGYXlWaVhZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "How big could ratings be for US-Canada men’s hockey gold medal game? - Awful Announcing",
    "description": "How big could ratings be for US-Canada men’s hockey gold medal game?  Awful AnnouncingWomen’s gold medal in hockey an inspiration to Hughes, men’s team ahead of semis  NHL.comCanada’s women came up short, but the effort was heroic  The Globe and MailWinter Olympics 2026 Day 14 recap: Canada’s comeback win sets up men’s hockey gold medal game against U.S.; Canadian Brendan MacKay wins bronze in halfpipe skiing  Toronto Star2026 Olympic gold medal game becomes most-watched women’s hockey game ever in USA  Daily Faceoff",
    "published date": "Fri, 20 Feb 2026 00:04:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQTnJOZWVDM2ZhdlZFZnBzOFVjR2JuSWlrdmJDWDJwdGdUVll5MG0xemtNY19kczB1WVYzVEtsSnRuWkFfdVQtTzk2WFctM0d4TG9raDlxSDAxRW1GcVBEeng5dDlWUEo1RnJ1SVlTWXBIWENVRFUyS1ZLODd2a1AwVTMwSmtUOGN4bmtwenF4YWJEZ9IBlwFBVV95cUxOWUhmZkpEd0JneTNHQVNjUi1LbHRwdGJkOGNkVlZTekliTXo2VFB4ZTVTNHY1ZFZacXhoRUQ0ZkFuempDZ1oxMm1oVjgteEdWMG11X3QzSU8ySS1ZQUIzSTZ3YmIxb3drYzN2NENieWQ1NEJnNmozVzd2NXJBcWRMcllVNUVBVUUtdmN0VVRrcnd4bHg4VDFV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://awfulannouncing.com",
      "title": "Awful Announcing"
    }
  },
  {
    "title": "F1 2026 Bahrain pre-season 2nd test – Day 3 morning results - racingnews365.com",
    "description": "F1 2026 Bahrain pre-season 2nd test – Day 3 morning results  racingnews365.comWho was fastest at the second Bahrain test?  Formula 1Charles Leclerc clocks quickest time at final F1 pre-season testing in Bahrain  The GuardianF1 testing: Ferrari impress as Charles Leclerc goes quickest in Bahrain  ESPNTeam by team: How Bahrain's double pre-season test went for the F1 2026 field  Motorsport.com",
    "published date": "Fri, 20 Feb 2026 11:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVVRxS2NuR29UQl9DRXd0dnFiNTlRVkFiWE91ZHdkQUppWnliQWdEeU1QbHlwLVIyN09vMkFKWGQ4b3g0ZEgyV3JfNGI1emNZU0VJazVfV2NTV1RUZndEM3RXaGwyMDRPTW5jenBNRndOVm1XeExTaUo2WU9lSWlxVkw1QUdTaS14UDJ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://racingnews365.com",
      "title": "racingnews365.com"
    }
  },
  {
    "title": "Latest Blue Jays update suggests Toronto is nearing a replacement for Shane Bieber - Jays Journal",
    "description": "Latest Blue Jays update suggests Toronto is nearing a replacement for Shane Bieber  Jays JournalBlue Jays' talks with Max Scherzer getting more serious  SportsnetReport: Blue Jays, Scherzer in contact over potential reunion  TSNWhich Team Will Sign Max Scherzer?  MLB Trade RumorsBlue Jays Predicted to Reunite With Pitcher Amid Rotation Concerns  Sports Illustrated",
    "published date": "Fri, 20 Feb 2026 23:00:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNUUVyTUZlVGR5QWNCZkFyMlRHRk5uaVlMUFhWZndNQU1ITlkzdnh2dklCMTFudVlkRkZFNk1jUzBFTE8yTFNZS2xnSEdiN1FBbEVwRU1FV0g3V1paSVRrRWpVT0dnWm14NG1DRmMtZ2w4Qk9Ydmp5UHFvOTZvTHdiMk1LWFlNVk5DWVdDU2EySVRzUmk4a3NlV1ZtTVhCd2pDM3BySTQ2eWROUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jaysjournal.com",
      "title": "Jays Journal"
    }
  },
  {
    "title": "19 Of The Best, Most Wholesome Moments From The 2026 Winter Olympics - BuzzFeed",
    "description": "19 Of The Best, Most Wholesome Moments From The 2026 Winter Olympics  BuzzFeedWhat did the 2026 Olympic Games mean to you?  CBCEverything that happened on Friday, February 20 at the Winter Olympics  NBC OlympicsNotable quotes from the Milan Cortina Olympics: Feb. 20, 2026  Toronto StarThe Olympic stars of Milano Cortina 2026, including Alysa Liu, Johannes Høsflot Klæbo, Mikaela Shiffrin, Federica Brignone and Mikhail Shaidorov  Milano Cortina 2026",
    "published date": "Sat, 21 Feb 2026 00:38:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOYTNpSzEyZTFmbjE3VW1QbzVmWlJlOEN4R1k2eXRJbWl5d3MzMDFlT2xGNEd5TmtjMzdaRF9rLVQ1d3EzSExyTFN4WHJwOGFzV2dfamlXS0U2NW9pd3hhVFFLMlpOUnVyUnFVcDlGNWI1X2JYZVEwVmFfZHByVXZtNUFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Why Macklin Celebrini's Olympic play has Maple Leafs players in awe - Toronto Sun",
    "description": "Why Macklin Celebrini's Olympic play has Maple Leafs players in awe  Toronto Sun‘I’m surprised I didn’t play him more’: Jon Cooper on Macklin Celebrini’s team-leading ice time  Daily FaceoffWhy Macklin Celebrini is already a Team Canada superstar  SportsnetMacklin Celebrini and the Sharks’ Olympic Legacy  The Hockey NewsCanadian Olympic hockey star Macklin Celebrini 'always smiling,' says former Vancouver coach  CBC",
    "published date": "Sat, 21 Feb 2026 02:34:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNjF2WFM4ay1zVUNCYzNWclJFbGJwYUZNcXFIcGFORmVBa0V4MGIwM0ctNkdCQjg4YzVheUdqak91TDBtaXJUZlhjUlpVYUJkU2VzVTB3WlRRck9YVnlzRkxyWlh6clhkQXRuSUNhWFBqZlNIU3lUZzVUMWJIYlBmaFhBOF9aR1B1eThvVHNrSExfT2k4YlJNZm95TGw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://torontosun.com",
      "title": "Toronto Sun"
    }
  },
  {
    "title": "IIHF makes a change for the semifinals after the controversial goal against Canada - Hockey Patrol",
    "description": "IIHF makes a change for the semifinals after the controversial goal against Canada  Hockey PatrolMarner 'showing he’s one of the best' for Canada at Olympics  NHL.comCanada’s depth was the difference maker against Czechia  Daily FaceoffMaple Leafs React To Former Teammate Mitch Marner's Overtime Winner With Team Canada At 2026 Olympics  The Hockey NewsCanada’s men’s hockey team eyes spot in gold-medal game, but captain Crosby out  Toronto Star",
    "published date": "Fri, 20 Feb 2026 11:04:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQVmhzT0hOb24tSVBBM1VFczZ4dUY2YVVKODBnbXBEOUdMcl9fYktvUW9tQ0xtV0QyUmh0SjVIbEY4b19rQ2c0bENfUGFTNDJ5WnZ6bmlsVWpVSmtVUTBjX1dqNGFuNTJpTjlvZzRCb1MxUkpGb1Z3Rlo3UUtSSzZSYVhpSk5tRGJWXzN0QkZKNlhjYml4VmV1T3NkTDk1SklEblhMMDBWN3lYQjJjVDJ2TkNadlBLcld6YlRoZDVydm54VmFXUW9jQVNzODRILVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hockeypatrol.com",
      "title": "Hockey Patrol"
    }
  },
  {
    "title": "Sean Strickland delivers profane message, flicks off UFC Houston crowd - MMA Fighting",
    "description": "Sean Strickland delivers profane message, flicks off UFC Houston crowd  MMA FightingUFC Cage Locks: Can Hernandez push pace, impose will on Strickland?  SportsnetChael Sonnen disagrees with Sean Strickland vs. Anthony Hernandez odds  Yahoo Sports CanadaUFC Fight Night predictions -- Sean Strickland vs. Anthony Hernandez: Odds, picks for main event in Houston  CBS SportsMain Card Results | UFC Houston  UFC.com",
    "published date": "Fri, 20 Feb 2026 23:52:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNTDVmSjVEYXVqTE9tYko5WXA0Y3FlVnFyQ0x2M2ROUDlqVEgta1R5ZFFNXzZoRlRKZVJsSjRfaW03UkJUSnlhNE1OREVNZWNTRU5mX2NTLWFaVUVyY2xhLUNhcHJJSFRYbHM1X1drVm1aNFVsMGM0TlA5ek93UnJSNG12TjhncXFhLUxTLTMzemFibGtxcTVJRXNqSkRKLWlRejVZUDJma1lDb3RT?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "A letter from Commissioner Don Garber - MLSsoccer.com",
    "description": "A letter from Commissioner Don Garber  MLSsoccer.comMLS team-by-team preview: Why is 2026 your team's year?  ESPNMajor League Soccer opens the season with eyes on the World Cup and a schedule shift in 2027  The Globe and Mail2026 MLS season preview: Miami eyes repeat, Vancouver tops Canadian clubs  Sportsnet10 2026 MLS Storylines We’re Hyped For  Yahoo Sports Canada",
    "published date": "Fri, 20 Feb 2026 23:02:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ad2lzZFRzRnQ3MUdScUMyT3JfRXV6b2hJdHRtSGdiWnV3OXY1RUdjS19tQWp2eGxQeERadlNiVU13V1NDdFBEM19vM1VjRUN4eHI3elU2NjZtUTdFRldmWVdMZi1pSmxUXzBXN3FUaDF6M3J1c2w0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlssoccer.com",
      "title": "MLSsoccer.com"
    }
  },
  {
    "title": "Naramata man spots large wolf spider in the basement of his home - Castanet",
    "description": "Naramata man spots large wolf spider in the basement of his home  Castanet",
    "published date": "Sat, 21 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPX1QxM1pTejZpU2VxS0RNVzBZMmNFM1JpWU1OX0p1d19ETG1zb0lPb0tQVERFX05kMzVSZC1IOEx2X3E3XzR4eTdXdjN1WG9FUzlhZWhwMEN0VzNrbkZMVXg3YW5KMnpHV1RrbXJhLUlXaXJhLUhQV1J6UVBBakc0T1NfVFJiOG5ISlRSRGdhZXJvV1k1NVBNMWlHd29uUk10NXI3OWJhNkZiTFZE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "U.S. champ at 13, retired at 16, Olympic champ at 20; Alysa Liu's remarkable journey to top of Olympic podium - CBC",
    "description": "U.S. champ at 13, retired at 16, Olympic champ at 20; Alysa Liu's remarkable journey to top of Olympic podium  CBCAlysa Liu, her father Arthur and Chinese spies: Unusual road to Olympics  USA TodayAlysa Liu quit skating. Her carefree comeback won her Olympic gold  CBCAlysa Liu vs Eileen Gu — How two Chinese American stars wound up on opposite sides of an Olympic proxy war  Fox NewsAnalysis | Figure skating needed something completely different. Enter Alysa Liu.  The Washington Post",
    "published date": "Thu, 19 Feb 2026 22:55:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNSHgtd080MmpBdnZZQUQ4YndJRXFpT01SVDl4QmY2R1hDUG5MRnVfVU5rWXVVQjZkRzZaUW00QkdRb3VoUEZ5RGx5MVo0ZnUtbmVPYXdrY2RYOHVvQndTdkFmalRicHk4WnRKZm1rYjRLRlNOS2NtRU0zOXRjWDRCNlg3RHpoeE9ZdHhtQVBSLXkwcU9LMGJ3VHFTUHludkt2N085M1h6OUJlUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Hughes has ‘Olympic spirit’ watching sons star for Team USA - NHL.com",
    "description": "Hughes has ‘Olympic spirit’ watching sons star for Team USA  NHL.comUSA’s puck-moving defenders a big reason for team’s Olympic success  Daily FaceoffWild's Quinn Hughes Keeps Etching His Name In Olympic Record Books  The Hockey NewsBrothers Jack and Quinn Hughes are shining for Team USA at Milano Cortina 2026  TSNDevils’ Jack Hughes Deserves More Respect  The Hockey Writers",
    "published date": "Thu, 19 Feb 2026 14:52:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNQmt6RWxybkhjdGExOXJzSk1fUEN3VW5nTG4tYzJCQ0JLVUVHaE9TS3lPLW5yVDhJRUp0ZjRSdkxKVl9xY1JTT0hnSUhDbmZsTDhXcWhFYmxMbzhJRDhpS2d2S2Zkck95UElGSDZhcGs1R1BYTU5KMHNkYzdacTBySlFCM0hXaElqaVVqcV9XbFB4TDM4V1FGUUJJY0IwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Mayweather, 49, announces pro comeback after Tyson exhibition - The Ring Magazine",
    "description": "Mayweather, 49, announces pro comeback after Tyson exhibition  The Ring MagazineMayweather to unretire, resume boxing after Tyson exhibition  ESPNUnbeaten Floyd Mayweather says he will return to pro boxing nine years after his retirement  SportsnetFloyd Mayweather ends retirement again to return to professional boxing  BBCFloyd Mayweather Jr. to come out of retirement after Mike Tyson fight  The New York Times",
    "published date": "Sat, 21 Feb 2026 12:16:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPbTBRZHg2TlVuanl0Z3hIaVZ1X0g0UzdUME1FRFUwaUxDQ1JvcTBaOU1iUlhZZko0WkViNW9DVFZZWHlubTFTZUpWRXlSV1hqZ0FRS3R6WFdEUXlqcVctWVN5LUdEYkNUMnlreVN4YUc3WXFXcDhvVTloRGdOSHJBTFRxbE12aFk1ODU1NU1yXzh0UTQ4aDF6eGpOeUtycWY2TURaMFRvU2xMdFVoLU9yQXJCNksxM0k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ringmagazine.com",
      "title": "The Ring Magazine"
    }
  },
  {
    "title": "Josh Sargent headed to Toronto FC - Norwich City receive potential MLS record transfer fee - Transfermarkt",
    "description": "Josh Sargent headed to Toronto FC - Norwich City receive potential MLS record transfer fee  TransfermarktJosh Sargent: Norwich City striker set to sign deal with MLS side Toronto  BBCReports: Toronto FC acquire Sargent in $22M deal  The Globe and MailUSMNT, Norwich forward Josh Sargent set for Toronto FC transfer - sources  ESPNTransaction tracker: Toronto FC agrees to deal for Josh Sargent  TFC Republic",
    "published date": "Sat, 21 Feb 2026 01:57:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNR0NYUng4UkdDSjVaOXBZYVNDMEJ0SElZZ3NvcmRNRUE3NlR2VXlnVDE4QWNXbkFHTGtYVGhMZk8xV1VJeTNvSkZWZlZGWE1Pb2M1Q1oydERQNGxjWk13V1EzTDN0Z2VzUnBWX25ZVDJLZlY4Z2RTOUJzVlpnTnNjQTVoMW9wVkQ5YlI3MmJld2lCb3pPN3pEa2FncVNpalpzb3ZWbmx3blRWYms2RFczZ0JjZ2Z0Z01sWHQ2THJORUxLcHdfOGFkdG0zMmhuYkNo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.transfermarkt.com",
      "title": "Transfermarkt"
    }
  },
  {
    "title": "'Serious concern': Twist for Aussie teenager after scary scenes at Winter Olympics - Yahoo News Australia",
    "description": "'Serious concern': Twist for Aussie teenager after scary scenes at Winter Olympics  Yahoo News AustraliaCanada's Cassie Sharpe not medically cleared to compete in freeski halfpipe final  CBCCassie Sharpe won’t ski for a medal in women’s halfpipe final  CityNews VancouverCanada's Cassie Sharpe not cleared for Olympic freeski halfpipe final  SportsnetFreestyle skier Sharpe crashes at halfpipe qualifier as Canadians advance to final  CP24",
    "published date": "Fri, 20 Feb 2026 03:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxONFRwdERXVFVxS09YY1FkRGFiN2xmWFh5OHBWN2szYkNHbFNLdGktOHlXVkhYSzVac0VYT2hlYTlZNGF3eUY1emhFZlp1LXZqc0ZLOUo1b0ZjYk1KWTA3T0hrQ2lJUkxZaXppbkFEbW1JemZWZUlPc1J5OXVldS1yMWJ5ckVkTHZwT1ZfR21xMGUyci0wUGdWc3hBM20zRUtaMjdjWE83Ul9FTlBWbzBBZTJ6aE9iMC1hWF9vVlpId3VoUWNJQWlvOVdpajd6QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://au.news.yahoo.com",
      "title": "Yahoo News Australia"
    }
  },
  {
    "title": "Sweden is refusing to let go of Canada’s alleged Olympic curling cheating - New York Post",
    "description": "Sweden is refusing to let go of Canada’s alleged Olympic curling cheating  New York PostRule violations clarification following men’s session four in Cortina  World CurlingCanadian curlers are being accused of 'double-touching.' But what's the advantage?  CBC‘Double touch’ rule rocks conversation at university national curling championships  CTV News'A sad day' - curling cheating row at Winter Games unsettles Canadians  BBC",
    "published date": "Fri, 20 Feb 2026 22:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOQ2ZsOFZtNUUzOTN6TGh3bkpCVUR1T1JpRTlaRE1rUlRENy0zRmhwXzNMc1VodHl4NURtR2t3M0ZoNzFCYzh0dmx3S25WU1ByeHJWaVIwNFF6UEZyVHZOSEl5MmFNeWxiWHhySHJUMGZFaE5BUElBZDRTUU9yY1c3VGJnalJxSzFELU9JMjlNMzNNM0FIbTF4Sy1jemdLWUpiSHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nypost.com",
      "title": "New York Post"
    }
  },
  {
    "title": "Raptors begin meaningful stretch with ugly win over Bulls - Sportsnet",
    "description": "Raptors begin meaningful stretch with ugly win over Bulls  SportsnetJa’Kobe Walter looks ‘ready for the challenge,’ says Rajakovic after win  Raptors HQRaptors vs. Bulls: All-star Brandon Ingram helps Toronto climb 10 games above .500  Toronto StarBulls struggle with turnovers, fall to Raptors 110-101  NBAIngram, Raptors get past Bulls in return from All-Star break  TSN",
    "published date": "Fri, 20 Feb 2026 14:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOTkcxVWptdG94c2hud0FFVnlrVXE1bnE4Mkg0N0MzOENfTjVlVl9Mc2YzSTk4dV9hck9vcl94RDcxcm53dWw4cHBJRXMyTmZrdDZ5SVNKU0hhUEVzZmNvSUdIejZuY0ZNVkN2LUNRTDgySTZrUk82a01TamRFT3pYRUxrN1hORHhwdEEwbFU0a3R2dF9ldUxUQ3pJaw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Kamila Sellier: Polish speed skater suffers gruesome cut from rival’s blade - The Times",
    "description": "Kamila Sellier: Polish speed skater suffers gruesome cut from rival’s blade  The TimesOlympic speed skater Sellier in hospital after taking blade to the face  The Guardian2026 Winter Olympics: Polish skater has facial surgery after short track crash  BBCPolish Speedskater Stretchered Out of Olympic Race After Opponent's Blade Slices Below Her Eye  People.comWinter Olympics 2026: Polish speedskater Kamila Sellier hospitalized after suffering blade cut to her face  Yahoo Sports",
    "published date": "Fri, 20 Feb 2026 22:30:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOQm5CaEY0aTQyS1BzRmxpZnNuMDUzeUNmNk1HSlZlN05OMlBHaVA4S0JieUM4aWlBRFFtUFRuWDlSaG9TSURpaThwRXJpbXAxUmlyT1dpZ3ZRQXVoZ2p6OUlycEh2Mm1WY2stUlFNcGJTTXd2MENfVjYtRlZjSEJZeHVmWU5UckN5ejZhZm5OV3p1VzJqeTljQmEyTW90U24wUThjVnJKQlA5QTRERVRvelZ1akdyN3lycjQtcnJTRGpaUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thetimes.com",
      "title": "The Times"
    }
  },
  {
    "title": "Team Canada version of Binnington playing at different level during Olympics - NHL.com",
    "description": "Team Canada version of Binnington playing at different level during Olympics  NHL.comBlues' Binnington, Parayko To Play For Olympic Gold, Dvorsky Will Have To Play For Bronze  The Hockey NewsJordan Binnington is the best option for Canada in net  Daily FaceoffThe Drive - Cameron Gaunce: You can talk about a lot of heroics, but the story has to be Binnington  TSNLike incoming pucks, Binnington continues to deflect doubts  The Globe and Mail",
    "published date": "Thu, 19 Feb 2026 17:00:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQSmI1eVYzYWdTUEJWdjl0ZGxBeUhZYmRsakQ4ZjJVQ0hkYU9UZlpLcGRKMG1kVWRJY1lhb0VsNnM3Q2J2eWVKWXpJdV9NbFBwYTQ0dEtINmJvdGNYVktBbDJHZXhZWFg2LWNUVHBpaW0tTXJlVEVNTmU2eVc2MWhtRGJ1aDM5aVRBS2NubjlISHhSbmJaR2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Canucks’ Filip Chytil Out Indefinitely With Facial Fracture - NHL Rumors - ProHockeyRumors.com",
    "description": "Canucks’ Filip Chytil Out Indefinitely With Facial Fracture  NHL Rumors - ProHockeyRumors.comView Full Coverage on Google News",
    "published date": "Fri, 20 Feb 2026 20:38:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQU3dWSXRtLVo0RzY4dWdBaHFLejdfVmhwSWJzZ3RxMGV4Q1NUbGpkZkRFOWVPNE50cjRuSGo5WlhBa0t4TEkzbEluck9xeE1OMjZEcHc4MGdNWjFWdzhOVEhTU2pIVzBYdXc2TXY4NTA4TGpWT3BrR1QxR0NHc2hSMDRPY0JHQThZeGY0dFBGQnJCVkJ1djJZMGFBNThHVVFncEdqSmRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.prohockeyrumors.com",
      "title": "NHL Rumors - ProHockeyRumors.com"
    }
  },
  {
    "title": "Canadian fans basking in warm embrace of Olympic host country; .U.S.A endures frostier reception - Winnipeg Free Press",
    "description": "Canadian fans basking in warm embrace of Olympic host country; .U.S.A endures frostier reception  Winnipeg Free Press",
    "published date": "Sat, 21 Feb 2026 00:12:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPMFAwcHVzdmZ2T01YSHJxTjdUZGFPU3REUUZsYTJJVFJfZ29WWnh4NWpDQnRtWU8yNlVMVnFyQ1hXRmJmbFVnNWg1U3RoZUNRZFdrVjhRb0FxVjlTQXlQNk83TEhkLW9lQWRSTVBDZkszem9FeURjeGx6Q1ZUNTdDNVpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.winnipegfreepress.com",
      "title": "Winnipeg Free Press"
    }
  },
  {
    "title": "FIFA Could Introduce New 'Prestianni Law' Following Vinicius Jr Controversy - GiveMeSport",
    "description": "FIFA Could Introduce New 'Prestianni Law' Following Vinicius Jr Controversy  GiveMeSportSources: Prestianni told UEFA he called Vinícius Jr. anti-gay slur  ESPNMourinho made 'unacceptable, huge mistake' - Kompany  BBC🎙️ Arbeloa on Vini: UEFA have the perfect opportunity  Yahoo Sports CanadaReal Madrid sends UEFA evidence of alleged racist insult against Vinicius Junior  Sportsnet",
    "published date": "Fri, 20 Feb 2026 08:48:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMV9Ub05TNlpRdUdDZFhsZVhMVklGMFUtZXlYYmVoclBwUTY5WFY3UTVxelJBc1BzX3I1MDNxNl9jUGo5c0Fyc2ZLSXpaX3NyVEVVdUdsVnVBdGdYQ1pmMWxKTm1CaVhxZmJjVjVPcUVJRTF6dnZWc05faFdYaDhCTVllU3d0SFFBUGtoSjI5b0NPUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.givemesport.com",
      "title": "GiveMeSport"
    }
  },
  {
    "title": "Lance Stroll delivers Aston Martin vow as F1 testing nightmare ends - racingnews365.com",
    "description": "Lance Stroll delivers Aston Martin vow as F1 testing nightmare ends  racingnews365.comHonda issue statement amid Aston Martin’s test struggles  Formula 1Honda ‘unhappy’ with its own F1 performance, not just reliability  Motorsport.comThe disastrous Honda F1 spiral that Aston Martin's now trapped in  The RaceAston Martin 'look four seconds off top teams', says Lance Stroll  BBC",
    "published date": "Fri, 20 Feb 2026 19:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOaWJJZzVzR0VwWkR6SU1NcDc4a3lWOUpNMGk3dTZvTzJhdDg2YXVvVDh4a3pTOE9NTExPM1ctRVF6YWE3eXVQY2ZjbS1sNENLbklETk1Zc0F3aktyYUZFLTBvbl9SV25XNkZOal9rRjNWT3VjSnp4X3FXNk1SWTRwb1QtOE05TlNUSVA1Z250NW1kRWY5OXZxMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://racingnews365.com",
      "title": "racingnews365.com"
    }
  },
  {
    "title": "NBA Scouts Unfazed By Darryn Petersons Injuries, Still Viewed As Top Draft Prospect - RealGM",
    "description": "NBA Scouts Unfazed By Darryn Petersons Injuries, Still Viewed As Top Draft Prospect  RealGMKansas coach Bill Self sends clear message to Darryn Peterson over ducking out of games  Yahoo Sports CanadaKansas’ Peterson misses most of second half with cramping  TSNSelf airs 'concern' after Peterson exits win early with cramps  theScore.comKansas fans duped into believing Darryn Peterson has wildest clause in his NIL contract  Yahoo Sports Canada",
    "published date": "Fri, 20 Feb 2026 15:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPb2tvRmdoV29HcEVVQjd1OUVKa0dBdlo4Z3dEZVk0Z0prV25hTGE3TGlLYThJZk1oM0x6T1RBNUZ4MGhnQWtqMlFRNDRsV2pFWWlrbkRoTDlxNG5NMlRLNGM2akJXeWhkeHZ1SVpRRy13OENUU1FodnNoOWI4V3F4MEpJV05XLXl1c0hnM0VBRWJZQTA4UmNmOXp0T1QxZTRxX0NOSkdrZGpnTnFVUm00MkFxZV9QbGNFbTFwZk4zRlRvVm9aNFHSAcsBQVVfeXFMTlRxUnJHS2ZYeUptQktVRF9Fd3JGRXNfYVRkWlk1RWZ5dGVRZGxWd2VpWTdab0dRbTM3a0hFdXFCWjhVQjR6VkNSaE5HMjBiRi1YS0NBS21wNWxQNUNnU3ZjN1BhdlV2NDM4OXc0VW92NGhvUFhDWXFBaTM2OTV5NVRWcWpIa1djb1ZaX0RlUzVUYm9jbnlFRnJQVTh6LVdJYWQ5dFZVdmNURUxfSGFYODdZX1Q2NVFJeVl3VENiZ0VnSkR6aUFOZUU5cUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://basketball.realgm.com",
      "title": "RealGM"
    }
  },
  {
    "title": "Last three biathlon finishers stop mid-race for wholesome Olympic moment - Daily Hive Vancouver",
    "description": "Last three biathlon finishers stop mid-race for wholesome Olympic moment  Daily Hive VancouverTrio battle it out for unique honour in Olympic biathlon race - not finishing last  Reuters",
    "published date": "Fri, 20 Feb 2026 22:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQNW1XSmx0eWJud0t2ekE0cDdLVEFjWFE0bXdLVVdRWTZKbzNMWlhmdmY0UmFGT0VJU0RENkxuU193Zy04ckxia2NXZFRHYjFBamJWZVAwcXAtdm4yM1liNzRWRmpkMTc1M2p0VmwtMUJpYUxXTXZrMl9SSV9FcXdqd1lmWG8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Slafkovsky, young core putting Slovakia back on map at Olympics - NHL.com",
    "description": "Slafkovsky, young core putting Slovakia back on map at Olympics  NHL.comDvorsky playing beyond his years for Slovakia heading into Olympic semifinals  NHL.comSlovakia makes an underdog run to the semifinals of the Olympics, this time with NHL players  TSNSlovakia advances over Germany  IIHFExhausted Senators Winger Tim Stutzle On Olympic Loss: 'I Feel Like We Left Something On The Table'  The Hockey News",
    "published date": "Thu, 19 Feb 2026 15:14:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQdW1iUHludnptR0NvU3NaMHBhV25aLVF0MlV1UlBGd2pDN1p5clRFNzJwSWJXVnA5VllCU3pOQllyc1hlR3JVTkVEcGJ5ZVZGcEJlVVNqVzFqczBkb1BSSXc2VGNUU0dpbGhJOV81QV8wQmRmdVhFRTdEQU8yNkdPd0ZTamRCUDhHbmd5SGxCd1ZLQWM4eDAwcWpZbWdYOFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Spalletti: Juventus right to react to Kalulu ‘injustices’, McKennie ‘useful’, David returns - Football Italia",
    "description": "Spalletti: Juventus right to react to Kalulu ‘injustices’, McKennie ‘useful’, David returns  Football ItaliaSquad List | Juventus-Como  Yahoo Sports CanadaSerie A Liveblog: Juventus vs. Como, Lecce vs. Inter, Cagliari vs. Lazio  Yahoo Sports CanadaJuventus vs. Como preview: Team news, prediction, date, and how to watch Serie A on DAZN  DAZNPreview: Juventus vs Como - prediction, team news, lineups  Sports Mole",
    "published date": "Fri, 20 Feb 2026 16:33:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZF9UMDB3cS1XLS1oWXh3Y054ckRaV0NpeC1SMERMYTEyR2J6LUNGSjQtdVRNektIdUVzTGRCUkZULXJhZTF6eEVDa0wxcklOa2o2YVFZQUZOWWZVMjBzbjQ4ZllkWlR2bnUyUU5lRjNGRVpUR0JCS0t1RmNxTjdIedIBhgFBVV95cUxNWGZIc1ZPZ1QxenRJX1FYc2hqaGRoTFdPUlJ3dmw2TzVkdzdodlhkQlZIR0paM29pc1ZmNk9aamFNQkdEYm5lMVVLWWFWVEh2TGY5MnJwNDJFc0JRM2JQR2ZkRmNqaHVNZXRlb3VkQWt4bGpNZnhWM2h0YzlsdXFvVHViQk9HZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://football-italia.net",
      "title": "Football Italia"
    }
  },
  {
    "title": "Heated Rivalry creator Jacob Tierney on gay storytelling (EXCLUSIVE) - attitude.co.uk",
    "description": "Heated Rivalry creator Jacob Tierney on gay storytelling (EXCLUSIVE)  attitude.co.ukHeated Rivalry is igniting Canada's cottage culture  BBCOpinion | Hit show ‘Heated Rivalry’ spawns business and trivia night for Dundas tavern  The SpecThey watched 'Heated Rivalry.' Then they were overcome with desire to hit the ice.  NBC NewsNHL's Jake Sanderson Believes Players Would Be Accepting of Openly Gay Teammates  People.com",
    "published date": "Fri, 20 Feb 2026 16:09:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQVzhDbTJSOW9JMzA1UGlfZi1INXFrekRfTlZROGE5U2R4UVhQLVlENFZfXzRqWWZjUnE2NWVSdk1pN09XZUNDczd0aG9KTWlzYVowcEJ4dHNWNUpWRTZsSDZ0SzhobVdIZ2lCZURjM1NpYlh5U19iVW90Sm90ZFphdXFjTDNzaXpOYUQxZnhoNDhNV19DVXlCLTlpX3YxUUZH?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.attitude.co.uk",
      "title": "attitude.co.uk"
    }
  },
  {
    "title": "Here's What Simone Biles Said to Olympic Skater Ilia Malinin. It's a Master Class in Leadership - inc.com",
    "description": "Here's What Simone Biles Said to Olympic Skater Ilia Malinin. It's a Master Class in Leadership  inc.comElvis Stojko knows Ilia Malinin’s Olympic pain. He’s been there  The Globe and MailSimone Biles reaches out to Ilia Malinin at Winter Olympics 2026: “I went into protection mode”  Milano Cortina 20262026 Winter Olympics: Ilia Malinin meets Simone Biles after figure skating heartbreak  BBCWATCH — ‘Quad God’ Ilia Malinin falls and Canada is accused of cheating | videoclip | Kids News  CBC",
    "published date": "Fri, 20 Feb 2026 20:17:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOeVgzVGlVZHZHUGpJTmQ1UUJKY2VVWGFiYl9LcEZjVWc4blNDODlOV1ZuSXFKMGRQVWhPam1fdXI3YkVKZmlTQktfVjRXSVhfNXVscnh4c2lzRDNDaFNVZlUzcTY1WF9lUGI2WnE2QW15MTF4WURHb2VwMTk1VHJ0dHdtdFJ5bkd3UlZZSXowdlQ1MGp4M0hEY3k1SlRxbTI4RnV5X051WWMtOTZWWDVRQ3lhMzlCeUNIVGxKOGpzYnFrMmdMenRiWlFiekJydw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.inc.com",
      "title": "inc.com"
    }
  },
  {
    "title": "Oilers Coaching Staff Reportedly Unhappy with Coffey Hiring - The Hockey Writers",
    "description": "Oilers Coaching Staff Reportedly Unhappy with Coffey Hiring  The Hockey WritersOilers' defensive deficiencies force Paul Coffey back behind bench  SportsnetRELEASE: Coffey to rejoin Oilers coaching staff | Edmonton Oilers  NHL.comKnoblauch won't survive Coffey's return, says NHL insider. Hmm  Edmonton JournalWhat Paul Coffey’s return to Edmonton Oilers’ bench could change on defence  The New York Times",
    "published date": "Fri, 20 Feb 2026 18:53:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPTHFqQ3hYNldCcFh6bVV1Z1lITmNsLTNmbmxDQV9uVk9FUkdDXzZmNXpIZjJXR0JNRFd5c3R4Y1lIQ0FJb3pFQkcwbVdWekllaElNemVFbWdCbzM1U0NDZzhYdG5fS3M3Q2xWZ0pzX1FkSEdubndyTERqaU9QOEpBWW5WN0RscjFjMHVGZ0xCem5mX1k?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehockeywriters.com",
      "title": "The Hockey Writers"
    }
  },
  {
    "title": "'Struggling' Lindsey Vonn reveals ghastly X-ray after undergoing fifth surgery to fix broken leg - talkSPORT",
    "description": "'Struggling' Lindsey Vonn reveals ghastly X-ray after undergoing fifth surgery to fix broken leg  talkSPORTLindsey Vonn shares X-ray, says pain 'hard to manage' after surgery  USA TodayVonn shares photo of leg after multiple surgeries, says pain has been 'hard to manage'  SportsnetLindsey Vonn Reveals Her Beloved Dog Leo Died Just 1 Day After Her Olympics Crash  People.comLindsey Vonn has more surgery after Olympic crash. ‘I’m bionic for real now’  Toronto Star",
    "published date": "Fri, 20 Feb 2026 19:17:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQdjh1RUx6NTc4NzJuSXo1bUN4aE9EbW4waVgwRXh6dzRXaDcxRzI2Nkxra3FWU1V0U0t4WkVyZEVLSUF0c3ZYNHZFYm1WVzRPdWFOLUhfMVVWT0M2eGdfQWM3dW5XRjFkNlRiNW1iNlFZRG1UampZaE1DVUVCRVVDNEdwZ0hPWnRNOE5wV3NnWXZDd3Vu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://talksport.com",
      "title": "talkSPORT"
    }
  },
  {
    "title": "IOC to investigate FIFA president Gianni Infantino over Trump hat and collaboration - The New York Times",
    "description": "IOC to investigate FIFA president Gianni Infantino over Trump hat and collaboration  The New York TimesIOC to probe FIFA president Infantino after Trump meeting  ESPNFIFA and Peace Board pledge to help Gaza reconstruction through football  Al JazeeraFIFA and Trump’s Board of Peace enter formal partnership aimed at Gaza regeneration  The New York TimesWar-hammered Gaza needs basics like homes, roads and power. FIFA is offering a $50M soccer stadium  CityNews Halifax",
    "published date": "Fri, 20 Feb 2026 22:22:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNTUw1VzV1VWFVV256cGt6UGRwX0FDTjZ4UjJoNmxITzhtSkpUX3RKTzM4N2hRQWVkR1F3eXFjaDVnYlhrcFRNSTdRSFM4VU5za1duUHE0S0lVVHltU3RGeG1CYW5GMUpPcFNZakp5UFpnXzZiSjZ3dHVEOXgwR01sZ3ZHX3ZhMkwyazcyYUFVZDdncEdQbmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "WATCH PARTY | Men’s Olympic Hockey Gold Medal Game - NHL.com",
    "description": "WATCH PARTY | Men’s Olympic Hockey Gold Medal Game  NHL.comMLSE watch party for Team Canada’s women’s gold medal Olympic hockey game switching locations  CP24City to host gold medal hockey game watch party  CTV NewsWitness history for $15: Team Canada's quest for gold comes to Coca-Cola Coliseum.  Toronto.comCOCA-COLA COLISEUM TO HOST OLYMPIC WATCH PARTY FOR WOMEN’S HOCKEY GOLD MEDAL GAME ON FEBRUARY 19  NHL.com",
    "published date": "Fri, 20 Feb 2026 23:08:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQUWNxc1hnRlB1Ui1SeUFMdXNPYUZxSU5mYzJ2UDcyMFBEdDlReXFUbUVwTEZtcWFoampzYmdQcEtVT2UtU0NqbUlUVmxiMkt6YVM5NnNYY3YyQTlYNnRvak1YdkFKbW9obEhCaTQzYkZVUng4SlZzZVgtU2VBVmx4YVRpLWlqV0FFa2pqNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Despite small population, Norway continues to dominate as Winter Olympic giant - CBC",
    "description": "Despite small population, Norway continues to dominate as Winter Olympic giant  CBCNorway’s dominance at Winter Games based on tradition, depth and development  Toronto StarNorway sets Winter Olympics gold medals record with 17th  Yahoo Sports CanadaOlympic medals today: What's the 2026 medal count after Feb. 20 events?  USA TodayJohannes Dale-Skjevdal’s Mass Start Perfection Brings Milan/Cortina Gold  IBU",
    "published date": "Fri, 20 Feb 2026 21:24:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPd1JaWEFGRmhqX05kQ0ZVMTVNN1Y2aHdueFdDSy1xSmYzM09oTTdCVUlWZXNMLTMyVjU5dkVaX3hhMWt3dExhWnY1M29rZnNWYV82MERhWEZFWm1UOTNTM2dpWVdxbmZGNGUyQnN2WG1sWkxrZnAzMERrNEFKRWhMcXY2VWJ4bEhWMmpyWm1lYzc2Y01hQmpQVFlxeGd2REpqRnBNQlJ2TXNiZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Ramblings: Update on Norris; Notable Improvements from Moser, Malinski, Hronek, Drysdale, Timmins, and Zellweger – February 20 - DobberHockey",
    "description": "Ramblings: Update on Norris; Notable Improvements from Moser, Malinski, Hronek, Drysdale, Timmins, and Zellweger – February 20  DobberHockey",
    "published date": "Fri, 20 Feb 2026 07:04:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNQldPRFBlR3pzQzlMVm8yRnVpZjB3ZktLYVZzeUthYXJtUGNmN2hqM1hEWUVqa2xtWGhKNjEyU2lnRFVWZFNKUGVFQWItdG5IVjc4T19wOWg1WV9DUEZ0TVJhTzJoYlBaRV9IRURCNUo1dm1HS1FIZXJDdHlIN3E3REhlMmQ2eWJaN3oyY1lSUGMxVXhHczBUOTdSR0JGQmNTZks3VnJiU0xyQ0EtUUlXOE1KVkpqV0tpd0hSYTlkZkZSaVMwUVY3WV9NdDU0VDl6dF9F?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dobberhockey.com",
      "title": "DobberHockey"
    }
  },
  {
    "title": "F1's defence amid 'panic' over 2026 cars - The Race",
    "description": "F1's defence amid 'panic' over 2026 cars  The RaceF1 boss Domenicalli: Max Verstappen won’t quit over new rules  TSNNorris shares Verstappen's assessment of 2026 F1 cars: 'Not purest F1'  ESPNF1 CEO Domenicali dismisses Verstappen’s retirement hint over 2026 rule changes  Toronto StarDomenicali pleads for calm over fears new rules will wreck Formula One  The Guardian",
    "published date": "Fri, 20 Feb 2026 00:04:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPbFYySHpfVVVJZnN4TXhTRExKXzdtYkdaR3ExbmwzZ0hKUE5LanFVTUZuWDNSNEZWemc0bG1oZS03eDNRZzNhOFlvLUVYVG5GX0FDT000Z25hQTQzSkZKMjhMeTRLZTZrak1nVnZPdGdPdmNiVDJSNEhxc0x3NklCRlp1eEM2em8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.the-race.com",
      "title": "The Race"
    }
  }
]