[
  {
    "title": "2026 Winter Olympics Day 9 recap: Kingsbury claims Canada's first gold medal of Milan Games, as men's hockey team destroys France - Yahoo News Canada",
    "description": "2026 Winter Olympics Day 9 recap: Kingsbury claims Canada's first gold medal of Milan Games, as men's hockey team destroys France  Yahoo News CanadaKingsbury wins dual moguls gold for fifth career Olympic medal  Team CanadaMikaël Kingsbury ends his Olympic career in a blaze of gold medal glory  The Globe and MailGlorious end of an era: Mikaël Kingsbury finally gets Canada's first gold in his last Olympics  National PostKingsbury’s gold headlines eventful day for Canada at Milano Cortina 2026  TSN",
    "published date": "Sun, 15 Feb 2026 21:09:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxQN1R2RG9xb1pGdk1LQVBXTVJBY0I2VFdpWm9PY0IyU3FNV0tielE3UXdBQk14eEpQcXFlRDJYSjRrMHhEem9QRlRLaV9hUGhvVkkzMFIzUjFDMlF5MDRCeTZOcVVuRHNUb3R6M2FFMTdMbXhTUHdPbTg3amhVUUZJZXBIUnpZcHp1dkMyWGFqek92MThkenFSMWx0R2JlbEVBNEx5Rkk2dXhabkE3WXlieG5hWkQ4UG41bE9JVUZncEhMdURqQk1SSG9hNVcta01VR21kTXF0dXRJbFpWQ2ZFMEc4TE41NDBsZHRMb2I4bkxpOGQ3UVl2Y2V3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Curling Canada lowers temperature in conflict with Sweden at 2026 Olympics - National Post",
    "description": "Curling Canada lowers temperature in conflict with Sweden at 2026 Olympics  National PostAs Olympic curling surveillance grows, Britain faces infraction  ESPNCanada’s Team Jacobs handles China as World Curling readjusts hog line monitoring once again  TSNCanadian curlers accuse Sweden of improper filming in Olympic venue after cheating allegations  National PostCanada’s curling controversy: Curler’s wife harassed online, Switzerland latest team to complain after Olympics drama vs. Sweden  Toronto Star",
    "published date": "Sun, 15 Feb 2026 15:59:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOYjE0YTdjNXRUV2thMFpaLTdTLXRqcjRacFVSaHpVYjY3aWN4LUc2dF9Gb3Y3ZS1LNlEzQzQ4aTlkd0IxQ1pJQ2l0OFQxNnpCb0tlUnpyZDctQ1dMR1hCUURCRmlKMHNxZTlfa2xWbDRmNmgzQ0d5MmtLYjFRTkRaaTBvMFBNNFhxb1FlNmZrZlYwZGVzMlVpUW0tOEE2U25SVXE5ZXpVVE10QWhSbmQybzFMNzdBZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Crosby, McDavid lead Canada into Olympic hockey quarterfinals - ESPN",
    "description": "Crosby, McDavid lead Canada into Olympic hockey quarterfinals  ESPNCanada crushes France in push to clinch No. 1 seed at Olympics  Sportsnet'It was a gift': French goalie Junca's birthday was a memorable one despite 10-2 loss to Canadian stars  CBCTeam Canada provides plenty of passion in latest Olympic win against France  NHL.comCanada off to quarterfinals in 2026 Olympic men's hockey after cooking France  National Post",
    "published date": "Sun, 15 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOUXVJMV9FUzB4bmVvYkM4QUVpNWR5MC1EX2pUbTRET3BHZHFZb3c3cHY0VDJjdm0wZXRWam9wUmVGaTN4WUIyU2FadkJkb0ctMkNJYmxTNWxEVjVKQ2owdDhVcy1ES0hSV1pFM0FXTmJVUVI2YXFoREhRLWY2SlJJQldFZ2pTWU5QeFhRaVJ3UkFHWDBidTlfLVpKTWJESjB3RnVfb3VxaVEzS0ZjZFc0Rjh3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "After ‘Olympic curse’ hits Malinin in his free skate, the ‘Quad god’ sets his sights on future - TSN",
    "description": "After ‘Olympic curse’ hits Malinin in his free skate, the ‘Quad god’ sets his sights on future  TSNAnatomy of an upset: how Ilia Malinin lost Olympic figure skating gold  The GuardianPatrick Chan, Kurt Browning relive Olympic heartbreak after Malinin collapse  CBCRosie DiManno: Canada’s William Dandjinou gets caught in the short-track chaos, and another medal disappears  Toronto StarIlia Malinin announces next career steps after fall-ridden Olympics program cost U.S. figure skating star gold medal  Yahoo Sports Canada",
    "published date": "Sat, 14 Feb 2026 13:23:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQaEJCcWVIS2xaRzV2azdCYWFLVm9hRklfVWJMbGs4Q0lMOGZRbDNGUWVldE1ZVDZucFM1ekRXVVIxaVo3N01ySUx0d243QWx3OGk0T0JJR3pVVkFVbWNCRUg1MXhOMEZWQjBmX0F6d0V1R0NFaVhUb3VjQUVEYUN1SEZfV2ktU0EtM3BITXVld1NFVkptcURmdWVlY0VBQXpxYkxLcU5lMmNDT1l3U0JndFJSZ0ZZNUgzUEtVbmsyTG93WHdp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "It’s Day 9 of the 2026 Winter Olympics. Here’s how many medals Canada has won so far - Toronto Star",
    "description": "It’s Day 9 of the 2026 Winter Olympics. Here’s how many medals Canada has won so far  Toronto StarOlympic viewing guide Day 9: Kingsbury can deliver Canada's first gold  CBCFive things to watch on Sunday at the Winter Games  Global NewsDay 8: What Team Canada did at Milano Cortina 2026  Team Canada2026 Winter Olympics Day 8 recap: Gold hopes fade after doom for Dandjinou and Homan, but Dubreuil and women's hockey offer silver lining  Yahoo News Canada",
    "published date": "Sun, 15 Feb 2026 19:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAJBVV95cUxNRUpfdXJEMVdtZDFBLVJkN1Rtc041NWgyUTczblJvSmYzTTV1QkxHVWRDZXJKakJVRUE1WDJZOVNVbkZyX09ycURDTjZfYzM5VEN5T1lhamFEMG1icEN1TUtzaV85Rk1CZWs0a2oyY3lZcEx4X29wb3RucGpTTkVvOTVaSWd1UGFFWFM4Y182U01oaXNuYTZHVU9EUnhZN3BBb0RFTjdHZF9qdXNBMmh4WElCT2w4Q1EzMFY4aXc3MEZsSTJnMmh4WVgwbzgwSTltU2pHUGYxWXhpc2lKUG9RX1BsZDM4ejVUXy0xSHphZjgtZHl2dEJGVEk1a18zd0t0VVptcGNGclBBMjI1?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Canada reaches Olympic women’s hockey semifinals, Poulin ties Wickenheiser record - CTV News",
    "description": "Canada reaches Olympic women’s hockey semifinals, Poulin ties Wickenheiser record  CTV NewsPoulin makes history in return as Canada beats Germany 5-1 to advance to semi-finals  The Globe and MailCanada reaches Olympic women’s hockey semifinals  Global News2026 Olympic Women’s Hockey: Top standouts from Canada vs. Germany quarterfinal game  Daily FaceoffMarie-Philip Poulin is back (and makes Olympic history) as Canada cruises into semifinal  National Post",
    "published date": "Sun, 15 Feb 2026 17:12:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOY1NoUjBBcXMtRG5YQlF5MWh0SHBVa192WVo1OEhlMmhJYjJyR3gyZ2ZvSEp1VXU1QldiZWJaWE00bUpjaWN6NXVjWFNaN3FhUGpMVjhMSTh6MEExV3U2OWZ0UGZxZWdiUU5hSEFuSnlrS2N5b25GdE8wUnlSVHgwLUNZNHMzSXRwa2JvRlNBYUViOE5nSzkwdFB6SW1jRDF0Qi1NT1JEOUFPWlQ1a3Q3b25n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "3 Takeaways from Canada's 0-fer curling day full of fireworks in Cortina - National Post",
    "description": "3 Takeaways from Canada's 0-fer curling day full of fireworks in Cortina  National PostWinter Olympics 2026: GB women spring shock to beat world champions Canada  BBCCanada’s Team Homan now 1-3 at Olympics after losses to Great Britain, Switzerland  TSNGreat Britain get first win at Olympic Winter Games against Canada  World CurlingRachel Homan falls to Great Britain for 2nd straight loss at Olympics  CBC",
    "published date": "Sat, 14 Feb 2026 23:39:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNVmxsRE9Sd29wcng3TWYta25UQjdJcDI0Q2NtMERzYU1KbFdDWDhncmwyYlZRSmxqRlZRaUQ2SHFSTlpNMmdaSnZpcS1zb19YeFliVFl3TDlCQ01PSzlWNXFIYzdxNUhmY0ZMd3cwTllTRmhSa1NMT0c2YmZpb18zaXRfRHhvaHV5dzVzbkZnb1hlMEZ1WDZPTHdncTNSMGV1aHNsd1lmYW9pVHU3dU94YjF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Winter Olympics 2026: Johannes Hoesflot Klaebo wins record ninth gold medal in cross-country skiing - BBC",
    "description": "Winter Olympics 2026: Johannes Hoesflot Klaebo wins record ninth gold medal in cross-country skiing  BBCWinter Olympics day nine - watch live coverage (UK only)  BBCJohannes Hoesflot Klaebo wins 9th Olympic gold in cross-country skiing  ESPNJohannes Høsflot Klæbo's pursuit of a record 9th gold medal is the gift of greatness the Olympics provide  CBCJohannes Høsflot Klæbo sets Winter Olympic gold record as Norway wins cross-country relay  The New York Times",
    "published date": "Sun, 15 Feb 2026 12:42:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE15OGRxSnczN2dUZ2xsNjU2UWh1NHlOeklVOVdZTFpON3pHem5CR1hOSG1vVldCQUpXNTVtN2tVazhVRUpxdG1HT2ljbWFaa0pmTjJPTXZ3V3NWeFk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "United States ready to take on Germany in preliminary round finale - NHL.com",
    "description": "United States ready to take on Germany in preliminary round finale  NHL.comUSA vs. Germany live updates: Auston Matthews scores second goal in Winter Olympics 2026 men's hockey game  The New York TimesUSA vs Germany, Winter Olympics, men's ice hockey: When Auston Matthews and Co play next - schedule & how to watch live in the US  Milano Cortina 2026Should Jake Oettinger get the start against Germany?  Daily FaceoffUSA men's hockey faces Germany in final group-stage contest  NBC Olympics",
    "published date": "Sun, 15 Feb 2026 01:44:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPeWNnaTY0TEMwcC1zeVNGZ2pTOUstRUZ0QmJwRXU0OER3emlrR3NHVG91NFdsdzJDN0pocFhweG1PR1hxb2hhS01JUDBQUnhCX3F3UVZCcHhvU0RRdk9ydFI0MW9teW5NR21ZZ3UwOW1yWU1jZFBkVEZnOVZ6djFhemdvc1lkYy1mcHlXWlVuNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Tom Wilson fights in Canada’s game vs. France at the Olympics - AP News",
    "description": "Tom Wilson fights in Canada’s game vs. France at the Olympics  AP NewsCanada's Tom Wilson drops gloves in rare Olympic hockey fight  ESPN‘Nothing but respect for him’: Canada, France react to Tom Wilson’s Olympic fight  CityNews VancouverCanada’s MacKinnon feeling fine after taking high hit late against France  TSNCanadian hockey star Tom Wilson ejected from Olympic game for fighting  Fox News",
    "published date": "Sun, 15 Feb 2026 19:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNaldTWW9FeXFIU3RvVElNeFlnQXcyZlhrUTdlaHpkTVQyWnBMYTE2Tms4cGlITl9iRFR0STlZMmVCRTF4UEtoWGNWS002WTNyMFRldzh2dmNpN212TWVrUHJoTThhYW54ZEJQV25tSElKa1JyZkNnRDlLVnJ3NXlwd1p2OHg0MmJkdFlYSGNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Fans who raised Greenland’s flag at US-Denmark hockey game say it was a pro-European gesture - Politico",
    "description": "Fans who raised Greenland’s flag at US-Denmark hockey game say it was a pro-European gesture  PoliticoU.S. sticks with Swayman, settles down to rally past Denmark  NHL.com‘I am color blind, so it doesn’t matter to me’: USA’s Jeremy Swayman reacts to long-range goal  Daily FaceoffAmerican Jeremy Swayman allows long-distance goal against Denmark at Olympics  TSNTeam USA Gets A Reality Check In Olympic Men's Hockey  The Hockey News",
    "published date": "Sun, 15 Feb 2026 12:33:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNUjJMU1h0Qkc2Q3N6WTc5ajJVZFN2UFMzQkdqSElJbXY0LVd0VnY4d094Zm5NdHptd2w4cGNXbGF4VHU1dFJjMlpIak1NVHN4V3NKS1Y2UWtpMnNGYWpsNVlNaVhZZGNPaEJTVldYckJtdFVIM09YdERnekxWMW1oZEQxZW1fbjR4dWh6V3lR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "St. Catharines, Ont., bobsledder makes Olympic debut after raising $10K to help pay his own way - CBC",
    "description": "St. Catharines, Ont., bobsledder makes Olympic debut after raising $10K to help pay his own way  CBCTough financial sledding forestalls talk of future Olympics for Jay Dearborn, tests late father's message  The Kingston Whig StandardCynthia Appiah is ready to continue the history of greatness in Canadian bobsleigh  TSNUsed sleds, crumbling venues, crushing costs, Canada's path back to bobsled success is an uphill climb  CBC",
    "published date": "Sun, 15 Feb 2026 16:10:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQTU9ydTVSSk02Y0E4VE1iRE1LY1N0cFVjdE5GeGw3T25WMkxmdFhHZ1ZuQmYtM0U3OXphZk14cUZRRGJaTzNuZHpfWUtvTDI3dE9GaGhxa0FWNEx4QmNsZkFvckN3Z19XZmZ0bGJHcW4zVGZVQnJEYm9YZEI3Q05XVTdJbG94Ymp3dEcwTVFvVjlRbDhMMXpnXzhLbExQSm9UdHFDMi1hak5GQ0pIWUZFTnRqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Canada's Laurent Dubreuil sets Olympic record but doesn't win gold - Daily Hive Vancouver",
    "description": "Canada's Laurent Dubreuil sets Olympic record but doesn't win gold  Daily Hive VancouverLaurent Dubreuil wins bronze in 500m men’s speed skating, after briefly setting Olympic record  The Globe and MailLaurent Dubreuil wins speedskating bronze as Canada opens women’s hockey playoffs  CP242026 Winter Olympics Day 8 recap: Team Canada's Dubreuil wins speed skating bronze as Poulin leads women's hockey to semis  Yahoo News CanadaAn example of perseverance, Laurent Dubreuil wins the long-coveted medal  Team Canada",
    "published date": "Sat, 14 Feb 2026 16:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQNVh5NUtnN0pYT01lZDJ2RS1LUDZTZVVFUy1aaTRlWFZoVHdIYkFJZmdMWXE4QXFNQTdUSjFOaFd0VkhKQzMzdFhOcFdkajE3WnhsSFpuVFV5VVNyZ19YOEZsU01zRUxNRHRKNjVwelJEaXBwNVpUMnpyem9ORHBLcDEyc09rdGxSTkE3bkg4enk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Okamoto, Sanchez finding their feet with the Blue Jays - The Globe and Mail",
    "description": "Okamoto, Sanchez finding their feet with the Blue Jays  The Globe and MailBlue Jays counting on Okamoto, Sanchez to 'hit the ball hard'  SportsnetOkamoto, Sanchez arrive at Blue Jays spring training camp  TSNThe Blue Jays understand the transition Kazuma Okamoto is making. They’re adjusting, too  Toronto Star'Blown away' by surroundings, Okamoto begins transition to bigs  MLB.com",
    "published date": "Sat, 14 Feb 2026 20:13:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNSDgyS3JxYjNoQjcxT01kcjFuZDR4Rzd2b29XU2Q0NHhxY0dxWkhsY1I3REFmdVZVSXpSbzNWREc4UDJiRk1pUkhyY3g5Q1RqZ0UzUkpjRmc1a2hNWmhwdXozRjZGYXM4a1VxeFhNTG1mRDVjVnVyZDkwN3BoSjZPUmRsdEY4UERvemUwSFNpOVB3M29ieG9JSU0zMEZPdUpwMFk1a2FLVTRmdlY3VnZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Crosby sets record, Wilson drops the gloves as Canada thumps France at Olympics - CBC",
    "description": "Crosby sets record, Wilson drops the gloves as Canada thumps France at Olympics  CBCSidney Crosby sets Canadian Olympic men’s hockey scoring record in NHL era  Daily FaceoffSidney Crosby sets Canadian record for points in Olympics featuring NHL players  TSNHow Team Canada captain Sidney Crosby is passing the torch to Connor McDavid at Winter Olympics 2026  Milano Cortina 2026Sidney Crosby records sixth career Olympic goal against Switzerland  PensBurgh",
    "published date": "Sun, 15 Feb 2026 20:48:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOdVI5NkdsTzVOOV9SNDJnQm1aU1hjUzg1Tzh5RWs0cURDWHNkMnlmWEQ5X0JlTXV4emJjUHdYZzA0NVA1UGxmaXRRSHgybWphVm43Z2MxbTlvMk9hQnNnTzRNLW1hMC1EcFlIa2RqQjNxZ1NPTGV4d29CY1RrT3phd3MycXRQZ0dGczhSVTM1ZjRUY3BSX3JoeDA3a19lSmpsQVBtQWdnUWE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Olympic Hockey Predictions: Expert Picks on Sunday, February 15 - VSiN",
    "description": "Olympic Hockey Predictions: Expert Picks on Sunday, February 15  VSiNKukan goal lifts Switzerland past Czechia in OT, clinches 2nd in OIympics Group A  NHL.comSwitzerland beats Czechia in OT in Olympic men's hockey  SportsnetSwiss top Czechs in overtime  IIHFCanada cruises into the quarterfinals at the Olympics by routing France  Yahoo News Canada",
    "published date": "Sun, 15 Feb 2026 01:09:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZDVwTzRyLTdSMndUOTl0UkJuS0ZBcTdhMFVmQVFJOGpqSlpPbHJtdUVEOEdhU3BpUkN4MktYX3RuMXR2azhoMU9SRGdkV21Jd3o0a3BheE5LQ0N6ZGpPWG9OV2k4cVZONmg2N1JYZDJsYTdrQkhmQlBiT1YxUmdFNk9TSEg5cHNmR21r?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vsin.com",
      "title": "VSiN"
    }
  },
  {
    "title": "Time is running out for Canada’s women’s hockey team to clean up its game - The Globe and Mail",
    "description": "Time is running out for Canada’s women’s hockey team to clean up its game  The Globe and MailCanada’s NHLers win 12th in a row  IIHF2026 Olympic women’s hockey semifinal preview: Canada vs. Switzerland  Daily FaceoffCanada's new-look line ignites offense in win against Switzerland  NHL.comCanadiens’ Suzuki Moved Back To Center in Canada’s Win  The Hockey News",
    "published date": "Sat, 14 Feb 2026 21:53:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNY2R5UGN3a0w0RVJidjVPcV9uVk5KdUwtZzBGQVRyVDhNLVktUUhwejFaNUNHMGd1b0htSnRoWnlBZFpTaS1RMDY4SXM3dDNEMFpUUGlUdWpWckpOTEQzSkJ1LWE2b1ZFQmg5M2tTMHljSTdwek12R0Mxd3VlaGliZERmU1Y3QkRLYXRSMjlfZ0E2WXJPeXZtNmxMblFqVC0tZzBpNVF6TmVDUEhZVFZvdEQ5bzcxa0J3UERMVUsteHY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Bayern Munich News: The aftermath of FC Bayern’s 3-0 win over Werder Bremen - Bavarian Football Works",
    "description": "Bayern Munich News: The aftermath of FC Bayern’s 3-0 win over Werder Bremen  Bavarian Football WorksBundesliga Roundup: Harry Kane keeps scoring as Bayern maintains lead  SportsnetChelsea and Tottenham target shines yet again – summer move on the cards?  Yahoo Sports CanadaHarry Kane reaches 500 goals - what other records could he break?  BBCAlphonso Davies subs in for Bayern Munich and sets up Leon Goretzka for the goal  TSN",
    "published date": "Sat, 14 Feb 2026 17:00:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNZjBRWVZ1N19yVTB2WW5SM3p0RkVRZTJuT1AyS2xWTlNreDJRLThsQ0EydnFxZXpGTWVsNkx0Nm9RaWlFTktsc0xwdDNRV0I5Vy0zU2c0NUp5Q3FsdEUydWlzaVF5V3g3TC12ZlBDYXhvWXg2VXZrck1EdW1xMjJBVURDTEdXalNZSmhiZlc1UUZQeEprdEE4TTRiNEIxVms5NHlHUjBic2VEb0xIb3hiNTZKZmRLdjM1YU5UZFB6c2MtbHU2TGRocTdJcGVoUWx1TnJEUWxsMFpab2sxVUU5dDhMc3BkbXRMTnB6SGNkcTU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bavarianfootballworks.com",
      "title": "Bavarian Football Works"
    }
  },
  {
    "title": "Mixing his lines, Cooper rolls out the nuclear option at the Olympics - The Globe and Mail",
    "description": "Mixing his lines, Cooper rolls out the nuclear option at the Olympics  The Globe and Mail'You can’t keep up': Canada’s stacked power play, new super line strike fear  SportsnetWhy Jon Cooper isn't sure McDavid-MacKinnon-Celebrini super-line is the way at Olympics  National Post‘Gold or bust’ mentality robs Canada, U.S. and Sweden of the true joy of the Olympics - The Athletic  The New York TimesFor these 19 seconds of Team Canada power-play magic, it was (almost) worth the wait  MSN",
    "published date": "Sat, 14 Feb 2026 02:36:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPaEZMNm9uLW1aMDhqdGJ5VDQ3VUFRMkllbzM2WnZPM21paGFncE94Tzd2SHFFREpmZnlsZlAtY2hPUWNTVmt3eVJfUVdWeXJzaU1vTmZoX0JOWmxhdWtwLWJMYV9hblpKTlIzQVc0SDMzSVRxNEYtX3I2WVd2Qlo1RjZqelBubk9DVXVzd0FzODNDX3JHbThHd0FaeG84OWpMbHN0WENkU3hYdU9WSTMzOWpzVVZLSWVvbk1aeXVsTEgzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Slovakia loses to Sweden, secures quarterfinals berth at the Winter Olympics - NHL.com",
    "description": "Slovakia loses to Sweden, secures quarterfinals berth at the Winter Olympics  NHL.comHow Slovakia's last-minute stunner flipped Olympic tournament  Sportsnet5 things learned from Day 4 of Olympics  NHL.com2026 Olympic Men’s Hockey: Everything you need to know from Feb. 14  Daily FaceoffSlovaks lose to Sweden but still celebrate  IIHF",
    "published date": "Sat, 14 Feb 2026 19:29:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPYjBjclVnalVmdE1meUkwYkRpRHFjeFhZTTdJQ0xrQm5mSGtPMkNBaDQxWHVQSEpuWjY4bHRoWHVXaHVSSEIzTmptbk1fUHpmTi1vSlNtZ1ZzWVJEenVnTHhIdFpqVEh1NDFTU3NfZU42UUhyZ3BNWnZNa2NEN3RmQUZQa2lfVDRFZzkzNkhqQWhQc1dRdVR4UmQ2bFpWbjVhWVc5M0pHQVk2SmlaX0o4M2NtbkNVMFlzU3E4MkFPRXNXejFQU0U3Zk5fWjFRZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Biggest Concern for Blue Jays as Spring Training Continues in Dunedin - Sports Illustrated",
    "description": "Biggest Concern for Blue Jays as Spring Training Continues in Dunedin  Sports IllustratedView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 13:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQSXRfV1kzdTFDTWo4TUxCSUJUQl90UTRuN0tmUjZGTnZvWEg5M2laMXNyUktpTE9nYUlma1pZejRWV0l4Qi1fM3VESEFvc2wtaXF3SjNhZDA5NXFKV0N2SDlISVQxdnVmc0lIVEFZT0h0a2ZUZm84X2RMM0owTEtlY2g3ZnA0MXUzT1lhMXlheUxXMFN5b1ZFcURwRGExemdQaTBFMllScDA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Ross Atkins says what all Blue Jays fans want to hear after Jesus Sanchez trade - Jays Journal",
    "description": "Ross Atkins says what all Blue Jays fans want to hear after Jesus Sanchez trade  Jays JournalJays Trade Joey Loperfido for Jesús Sánchez  Bluebird BanterWhich Toronto Blue Jays Player is Most Impacted By Jesus Sanchez Trade?  Yahoo Sports CanadaBlue Jays trade Joey Loperfido for veteran outfielder Jesús Sánchez  The Globe and MailLoperfido grateful for Blue Jays stint after trade sends him back to Houston  TSN",
    "published date": "Sat, 14 Feb 2026 13:00:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNdDQ0QVB0MW9DSWZDbzBpYkEzd0h4NW1oa01ZNzJuQl8wQkFhcWhFRERNRDJRcmhCR25yTWFRQ3dlQzE3WnBEb1BWckUwOU9MTHg0VHJ1ZkRELUNLMnl3SUJPNFdKam01bVR0elFrR3VpNmtPX3gyc1RGQldpRkk1SlZ5bU5lNThmdDdJMnFhMHotR2ZBT21IWnVneWNpMGRGZ3lxMDlR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jaysjournal.com",
      "title": "Jays Journal"
    }
  },
  {
    "title": "A better performance but podium missed - Quinte News",
    "description": "A better performance but podium missed  Quinte NewsView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 21:59:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPWEN3eU81TEIwb01sdmFZRzN6VFRxVEFuemU4cGNWcnBYSy1mYmdrM0N0VW53b2twNHdHU0lMOVdDd0wwZ1A3YXB3Q041UWktWXFvbE9fU0pZSkNhd3MwVnNOb25KZkRYZ01CZGVhTGxOTmFSdG1LQTF3cjlMWElkRlRLSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.quintenews.com",
      "title": "Quinte News"
    }
  },
  {
    "title": "Astros Sign Cavan Biggio To Minor League Deal - MLB Trade Rumors",
    "description": "Astros Sign Cavan Biggio To Minor League Deal  MLB Trade RumorsAstros bring back a Biggio, sign Cavan to Minors deal  MLB.comEx-Jay Biggio signs minor-league deal with Astros  TSNBlue Jays fan favorite Cavan Biggio signs with MLB villain to restart career  Jays JournalSon of Hall of Famer agrees to Astros contract after Blue Jays, Dodgers stints  sportingnews.com",
    "published date": "Sun, 15 Feb 2026 16:44:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUnp6Qm90WWRLZm9xOHd5ZG53TUdFWm8wcFZTV3l5b3VGOGhRNTE1UzlCOVVaQnJzQmdkZTlRd3RmbW41RWhjNGpZeEozajQxcUMwbGRSbElRRHhrLVVEQkE4dFd1UkhLOEg3eFQ5Vk1WTnJaVXVMaUZwRzhqd1BkdUhXTWlxQUJ2b0pFamREcjhZUlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlbtraderumors.com",
      "title": "MLB Trade Rumors"
    }
  },
  {
    "title": "Juventus 2 - Inter Milan 3: Initial reaction and random observations - blackwhitereadallover.com",
    "description": "Juventus 2 - Inter Milan 3: Initial reaction and random observations  blackwhitereadallover.comInter Milan beat 10-man Juventus in dramatic Derby d’Italia  TSNSerie A Roundup: Inter beats Juventus to stay eight points ahead  SportsnetSerie A official Week 25 line-ups: Inter vs. Juventus  Yahoo Sports CanadaInter strike late to beat 10-man Juve in frenetic Derby d'Italia  theScore.com",
    "published date": "Sat, 14 Feb 2026 23:16:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAJBVV95cUxQdk9jeV9zR3BpcDhlM2JsbHc2SDBQTU1lYXRJUkQzMWo3dUYtVjU1bm5MQWZhemItVTRKYWJWVllWUTl0S2tHX2hzZGl3T1VLWGVQdU1zNzktWncwOTYxY1BHNWs2c2dJQ1BtYmR1OTA5V0lzQ3R1ZVRRVVBxeUdVZEdPRmJ4SmVyQlZKblVlU1N3RkRrTzREYk9zZnBiV21XazU5My1jSk5kaThuVVJFeHBJRURRZXR3U1E0YjljOTBqLW5tbXEyMllqdVVlbGp6Q1FFOTJMOHg4TGdacDlpcDBDQ0EzaFl1dWR4RnBlOVRiM1RJN2UzT1VHVVozcVJUek9PZ2RYYmo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.blackwhitereadallover.com",
      "title": "blackwhitereadallover.com"
    }
  },
  {
    "title": "Cain Velasquez released from prison after 10 months behind bars following attempted murder case - MMA Fighting",
    "description": "Cain Velasquez released from prison after 10 months behind bars following attempted murder case  MMA FightingFormer UFC champ Cain Velasquez released from prison on parole  ESPNEx-UFC champ Cain Velasquez released early from prison?  Toronto SunFreed Cain: Velasquez paroled after serving 10 months in prison  MMA JunkieUFC legend Cain Velasquez released from prison following controversial 2022 shooting  Yahoo Sports",
    "published date": "Sun, 15 Feb 2026 19:27:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNek5MZVluX2FXWVN0cF8wTUZSWFgtZWd6QWJlLVQwbzB6cmxXamVMMjZpazJXVDRaWnMyVXpZd3l4LWtldVZnNlhpUjJzNW9wUFN6YzkydUlmQXVLYnd1ZU1iWEFXZjlkTThTWWRHaXcyZkMyaTZqZi1sV1dPaGxuci1ENmJBNGIyRkh3ckUxM2Y3aVdPM1FtRW9ISkhuR295eGpZSmFMWm5zdzhHZU03M2NCbVN3UUhTZlBjYnVuSWVEdk1hZVh0cVdrX0RvWlU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mmafighting.com",
      "title": "MMA Fighting"
    }
  },
  {
    "title": "SIMMONS SAYS: McDavid-MacKinnon bring back memories of Gretzky-Lemieux - Toronto Sun",
    "description": "SIMMONS SAYS: McDavid-MacKinnon bring back memories of Gretzky-Lemieux  Toronto SunMacKinnon joins forces with McDavid as Canada loads up at Olympics  TSNCanada’s Nathan MacKinnon is not at the Olympics to enjoy himself  The New York TimesIs Nathan MacKinnon’s intensity a problem for Canada - or a competitive advantage?  National PostMacKinnon all business for Canada in quest for Olympic gold  NHL.com",
    "published date": "Sun, 15 Feb 2026 12:06:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPdGZLZE9iejM4aTBiY1ZXblYzai05cnhldnVocWZvOUtlelhZbFZxSXRUZmd5WG5BMjdVZkl1T29xZDh1d1ZiSTFzT2NUVmpTQVVuQ0ZLZnhVdHg3M0hrRnRka3c1LTlDaFN6S3lla3U0anQ3V1F3dzlBM3QyMmJjbTg2ZVdtNFh6aURJMV9aeGNNVVlNV05vdThrLV9wMUg3OUtqMlgyYmstOF8y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://torontosun.com",
      "title": "Toronto Sun"
    }
  },
  {
    "title": "Dan Orlovsky said what everyone was thinking about Seahawks' defense - 12th Man Rising",
    "description": "Dan Orlovsky said what everyone was thinking about Seahawks' defense  12th Man RisingSeahawks' Julian Love sets record straight on how much they knew was coming from Patriots offense in Super Bowl LX  NFL.comDevon Witherspoon reveals the Seahawks' secret to dominate the Patriots  Yahoo Sports CanadaFormer Patriots legendary coach thinks Seahawks should 'shut up'  Patriots WireThe Seahawks Are Super Bowl LX Champions  Seattle Seahawks",
    "published date": "Sat, 14 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOcEJZMlV0TUc3dElXZmkyV3BmVi02M1ZnVjRtZjEwa2d0MEg4Y3JTWUpWa1hUV3dMM1JCeUxHR3hKM0pvd3JhLUJtTFFLdUg0THRKNHNfREtOS0dSdjBMbWVSOFYwM3otdW5QNElWWW1WMTJFNXJVQUJSXzI0UjJRN0ZpaW9rM0F1blUxWlpnMElORU5yeUhqZ1hkOXl5NU43TUNr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://12thmanrising.com",
      "title": "12th Man Rising"
    }
  },
  {
    "title": "Locmelis becoming 'part of something big' for Latvia at Olympics - NHL.com",
    "description": "Locmelis becoming 'part of something big' for Latvia at Olympics  NHL.comTim Stutzle and Team Germany With Zero Time To Regroup After Upset Loss To Latvia  The Hockey News2026 Olympic Men’s Hockey: Top standouts from Germany vs. Latvia  Daily FaceoffSeider Olympic Update: Germans Stunned In Loss To Latvia  Detroit Hockey NowLatvia upsets Germany, 4-3  IIHF",
    "published date": "Sat, 14 Feb 2026 16:06:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNWjhmOXRXUXlKV1h0cHFhM0RaaWppWEVtb2dodUFLeGxaLW54Nk45cUtRbDl0cU5JZXpUS2xtdXpqVGZNSmgwU0hDV1ktYTBiNzNfNkcyVUJOSnEwM3Q4UUlBbXlRMU1LZ1RNLXJuQUZkemRRYUlvY1ljN3R6VDJkZU1MRmtOQkdrTnFhX2ktZWhVWXJPTWdv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "NHL Rumours: Fiala Injury Fallout, Wallstedt to Senators & Kane Deal Coming - The Hockey Writers",
    "description": "NHL Rumours: Fiala Injury Fallout, Wallstedt to Senators & Kane Deal Coming  The Hockey WritersKings' Kevin Fiala out for season after injury against Canada  SportsnetPredators' Stamkos Could Be a Fit For Kings Following Fiala Injury  The Hockey NewsFiala taken from ice on stretcher during Switzerland loss  NHL.comSwitzerland’s Fiala out of Olympics after leg surgery  TSN",
    "published date": "Sat, 14 Feb 2026 15:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQVzQtUUdwUWFjVUNhSDRwVERQdHNGd3liVDMtNjFJRnpXTDh2YTFxOW1SSzhKcS1fNFVXWDBqMUZ2QVFUVUdJYmZlT2VNSEJjR0NCYmN2Tnh6V250bnVuVUZaU0dkT2N2RU9tYVlaeG83YXdzdTczMkd4MUVvcm5GUHVnMi1WX0lfSlNyakFFRFFnR2FZTEcwNWFWbzJ1dzBRTjl4clVkU0FvSTJTM09Fem5B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thehockeywriters.com",
      "title": "The Hockey Writers"
    }
  },
  {
    "title": "'Gold means everything': Inside Connor McDavid's Olympic mission - Sportsnet",
    "description": "'Gold means everything': Inside Connor McDavid's Olympic mission  SportsnetCanada's Connor McDavid makes Olympic tournament history  SportsnetMcDavid Makes History With Record Olympic Performance for Team Canada  The Hockey NewsConnor McDavid’s Wife Lauren Causes Stir in Red Outfit at Canada Olympics Debut  Sports IllustratedConnor McDavid, Leon Draisaitl make their long-awaited Olympic debuts memorable  The New York Times",
    "published date": "Sat, 14 Feb 2026 15:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOa3c0bUtZR0Rucld1MjhSaHNVczRTeERIdkV4Tl9UVjVrNlp6cTNxX256QTQ0N0VudW83dDVfZHlxcFZ4TzZJcmFWZWhUdHB6S0RSNGRuZ2R5akVtWXBXVXFWbG9qdzBtZzEySFUxM1BNY2VPWnMwUUZDSGNteF9sekhtek1JYXMtaDNkUXFpQVkzM1JIMURYV1JNVElTdFk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Comolli, Chiellini don’t hold back following refereeing errors in Juve’s loss to Inter - blackwhitereadallover.com",
    "description": "Comolli, Chiellini don’t hold back following refereeing errors in Juve’s loss to Inter  blackwhitereadallover.comJuventus furious with 'unacceptable' referee call in Inter loss  ESPNEuropean football: Serie A referees’ chief apologises after controversial Kalulu red card  The GuardianChiellini urges Rocchi to step aside after ‘unacceptable’ Derby d’Italia error: “He wasn’t even at the stadium”  Yahoo Sports CanadaKalulu red card could lead to major VAR rule change in time for 2026 World Cup  Yahoo Sports Canada",
    "published date": "Sun, 15 Feb 2026 03:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigJBVV95cUxQV2Q0NFpPS25acE41Vi1nUk1wXzVXalJiLXpFZnVtVjk0ZUVzQWp6Y3dvc2RTWm9ZZUZJT1BBNEVVR0RuTkNDM1hJTHZkUl8xNVlLNm9yczVydWtoUjVUUzdCUnNiWHpORHJybjE0Ql9LdHlwUFBHalI2a1BjbmxTSE1hNEFPNUd5UVByblBNa1RPVGVjUmVOZUlaR3YtLVd6UjNhaGFYZTZjTTZUaXR4VGppTGdSdWFzaFVLU3hxQUJqX3BBdmdFd2l1SGZRMFJWRzJMeXV5SjloWXEtbXpSN2ZNeVAzR2JQNndrSGI0cXhNdTlpSmJ1S2xtTlRqaU03cnNJaXI3SmFIdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.blackwhitereadallover.com",
      "title": "blackwhitereadallover.com"
    }
  },
  {
    "title": "Blue Jays confident Bassitt's impact still 'lingering around' clubhouse - Sportsnet",
    "description": "Blue Jays confident Bassitt's impact still 'lingering around' clubhouse  SportsnetNow-Former Toronto Blue Jays Pitcher Says He's Still Not Over World Series Loss  Yahoo Sports CanadaUpon arrival, Bassitt states his vision for '26 Orioles: 'Win a World Series'  MLB.comFormer Blue Jays' starting pitcher explains his motive behind signing with Orioles  sportingnews.comOrioles, Chris Bassitt finalize $18.5 million contract  Prince George Citizen",
    "published date": "Sat, 14 Feb 2026 16:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNcURVMnBjOFJXd0p1TE4tMG9VS2tUQm9WclJnX0VnVzAtdnRJOGR4TnRxZVBGX19XWDV5UEJ1QkduUXFlZWwteXkwVjBfenpzVk9GOTI5RUFXNWQ0TUoxdE1OOHdzTUhMUnl2dU11d1dSbnVjamdaWF85TjdxTU5RTnZTSm5jRTRrSGVWZ0NxVDJScDlPZnhvUWJhdzJDZHlHQldJS3NsNzZfUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "One of Bill Guerin’s controversial Team USA picks is already making him look smart - Daily Faceoff",
    "description": "One of Bill Guerin’s controversial Team USA picks is already making him look smart  Daily FaceoffNelson scores twice, United States pulls away from Latvia in Olympic opener  NHL.comU.S. men's hockey dominates Latvia in Olympic opener  ESPNU.S. Men Defeat Latvia, 5-1, in First Olympic Preliminary Game  USA Hockey teamBrock Nelson shines on 'another big stage' for the US at the Olympics  TSN",
    "published date": "Sat, 14 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQOF96a05LVWw2SmxpWkZUUjJMelNRVzBvOTAzM0g5MUdlRFdlSnF0SVFRbVZrN2RVQTc0SEsxbkNSYVZ6V0VSZ0NzTVZDRU41UTFNNmotYzlUOWVGTWhKS05zY3cxbTNQY1pQSENnamVjTkNpeFdmWWhwWEh5eWU3dVdqN0xMcl9uZWUyMTlqQU1EeU50N0hGZ1d3T1FoQy1QZDAyNHgzc2tGOXBTdnA1MVlzZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailyfaceoff.com",
      "title": "Daily Faceoff"
    }
  },
  {
    "title": "Bove makes first Watford appearance over a year since collapse - Football Italia",
    "description": "Bove makes first Watford appearance over a year since collapse  Football ItaliaView Full Coverage on Google News",
    "published date": "Sat, 14 Feb 2026 17:18:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBIMHBSWkgtOHhneU82U3hlQ2pXVGgxdGswbFdDTS1fNVM1cEFzZlN5NHZMVGliRlgxTUFPS3RkOTdqMjFCYTZxSHZIcW9qUnV3ZERScmlqcGVQVjNXQ3J4Nkl5eVFQNFRpdmNOTmRJMGxpLTlVNmxUVWxkWXFDUdIBgwFBVV95cUxONU5QZUxoWG5qVzlzUk5YblZxOFBoXzM4QlhUVHN3eWFsV0xHNG9SR0xJd2tjcGZjYkFyVklxdFFzLU9QNGctSktScUFOajN0T1VXU1VrdnlkVWlIbjRLTmhjbElEZFA3MDN2ZG1uTWxVMjVZaFJlS0lTR3pSN1NwWllwRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://football-italia.net",
      "title": "Football Italia"
    }
  },
  {
    "title": "The IOC’s ban of a Ukrainian athlete over his helmet reveals troubling double standards - The Conversation",
    "description": "The IOC’s ban of a Ukrainian athlete over his helmet reveals troubling double standards  The ConversationUkrainian skeleton racer Heraskevych posts photo of IOC president receiving award from Zimbabwean dictator  Українська правдаVolodymyr Zelenskyy honours disqualified skeleton racer with order of freedom  The GuardianUkrainian skeleton athlete Heraskevych's appeal denied by Court of Arbitration  CBCWho is on helmet that led to Ukrainian athlete's disqualification from Winter Olympics?  BBC",
    "published date": "Sun, 15 Feb 2026 12:57:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOY1V2RS0wQzlUYXFNSTdORTh0dEM1bHNiSXdHSE8xOGFIcUtzcG1rQ0dHcVFraHpVT1BwTXRQeFpybGlxSjVFVzlMYmRLTmw3WUx4dUZ6aGF3MmZJQTQ3T05OdTdlWFJBRGQwMVZMdkkwOV9VajZjakh3QUl4MDBVQzVMNWJZZlkycHBRWmI3QmxicFBJRUxoN2J1Q0NXMzNZMmpKNTVPdWtkRFh5bjRNVXhwLS1RWWF5QWJSUUln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Red Wings Raymond: Penalty Was ‘Unnecessary’ - Detroit Hockey Now",
    "description": "Red Wings Raymond: Penalty Was ‘Unnecessary’  Detroit Hockey NowLucas Raymond has starred for Sweden at the Olympics in Milan  TSNLucas Raymond’s Three-Point Night Lifts Sweden Past Previously Unbeaten Slovakia  The Hockey NewsThree Points For Red Wings Raymond in Sweden Win / DHN  Detroit Hockey Now",
    "published date": "Sun, 15 Feb 2026 05:01:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNOFp2NWtCcl9VOFN2MlNjX1dDSlNzN2ZqWFBxbW45VTNSUExjQ05BV3VpZ1AwUnNxbDVRckd3emROelVwU25JSXJ2RHRzaGszVGpWWFZJNXNVUW9IanhjaVZLNFp5YmRqelBsU3AyY1lSWnRJd29DbmtoVXNLNnFxZ21ONHV0UHlqb3ZyVTUySDRsX05kb1FOT0RYaGVVWmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://detroithockeynow.com",
      "title": "Detroit Hockey Now"
    }
  },
  {
    "title": "Canadian in Olympic debut posts nation’s best men’s singles figure skating result in a decade - CTV News",
    "description": "Canadian in Olympic debut posts nation’s best men’s singles figure skating result in a decade  CTV NewsStephen Gogolev caps Olympic debut with immaculate free skate  Team CanadaCanada's Gogolev lands fifth in men's figure skating finale highlighted by Malinin's shocking fall  CityNews TorontoAs Malinin implodes, Canada’s Gogolev finishes 5th — with second-best free skate  Toronto StarStephen Gogolev Soars to Fifth Place at Milano Cortina 2026  Skate Canada",
    "published date": "Sat, 14 Feb 2026 19:48:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOTDk4SmJvVEp1NEE0SnNITWN3YjFqZHBPbDR2YXNQM3JBSkFnZVFubUlXeG1tSE5hQnVLQXhJS3JNTWtqZnE1TTJmNzd4cVNEX2J6V3kwX1pWRjBISkV2ek8zMDNhNzhjZGU0YjJHTzc3OEZGQ2tNMGZHbkhqSmlIZ25oV0NTTkdpVDV3X3FFb0lTQUNfOE0xZ3RIdlQ4YkNTUXZNcldGeEkxanFKdlFtLURVcms0U2tpZG5zNzlVeUtURHFqdF9VTWpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Final weekend of Winterlude brings out families eager for one last blast of winter fun - CTV News",
    "description": "Final weekend of Winterlude brings out families eager for one last blast of winter fun  CTV NewsThings to do in Ottawa during the Family Day weekend  CTV News",
    "published date": "Sat, 14 Feb 2026 21:32:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNektzS3BEbHJVOEdDdjVYVUExT0Naak1JZWJaUjdoSDlMSXZJMDFqd01TMVZCS3UyNGZQcC1XUzBMbVZTTUp3Z1dCVDNjUFJPS3JIZHhPTEY1ZVZyZ3otVU5oYXJmMV96TTM2dGFWanFGVmFNLS01bWJMblAxNlowVXBwM09mV2tra2NSU0pXLUR2bWkyV3ZNeXRhWXZHalUydXJOelRvbzhZM3diM0FyZVJ0NU43N0FOQjNfd1l2QnpSYTA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Laval vs. Hershey recap & highlights: The Rocket return in a Blais of glory - Habs Eyes on the Prize",
    "description": "Laval vs. Hershey recap & highlights: The Rocket return in a Blais of glory  Habs Eyes on the PrizeRocket Crush Bears for 6 Straight Win  thesickpodcast.com",
    "published date": "Sat, 14 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgJBVV95cUxOQnJjSG81cWVQR2tFWHZUcFpQdUdwdTRvdl80aTFGMG9JT1VRMDJCMnZSYUtsSEtTUG9UTE5DbUJFUGVYek8tMFkxOS1CR0NwdFdZSUl4NWxwaDBFMlhYZDhFcW1CTXE0YkkxaXlGcTNXWXQ2OXQxLU9aN0wtc3RzZFk1LW1YbHhRcmVRR29nOWRyeFVUczdZNWxDSy1WUUNad3Mtc19NWFR3azBkNG1HLVg2YmRyS05LVm5nd2lDLXVzeFdoQTF0Z2d3b2VaU0o2ellaMTVmY056TmRXdUtsNUt1V2dGVFl4bFhLWEZkMXJaTXhaTzZjclQyclVSX0NaS1NtTm1JYldOUmtndklaQ3JnRF8zLWZMOGFuWmNheWxGNlNac0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.habseyesontheprize.com",
      "title": "Habs Eyes on the Prize"
    }
  },
  {
    "title": "The first suspension of the Olympics has been handed out - Hockey Patrol",
    "description": "The first suspension of the Olympics has been handed out  Hockey PatrolItaly’s Cristiano Digiacinto suspended for game against Finland  Daily FaceoffItaly's DiGiacinto suspended for hit to head of Slovakia's Fehervary  Sportsnet",
    "published date": "Sat, 14 Feb 2026 22:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOLTBGS2xydl81UjRKY3VYY255QkhwWFBDZllfRjNLNWRFM0RkWWN5QmtCc0RpclVjRERPVFJiMVZSYy1NY2UxNmZfR0NOUEpDQlF4QmtOZnp0MnBuV0ZxNTlUdHFWNXVLNjBaTTF0MjlkX0IwQURneXUwcXlSYXlTYXkySzhuT25SeDJZSS1VMUx6X1MyM3c0WUxRbDlhUW9jWGNTeU5rdlQ0dkxn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hockeypatrol.com",
      "title": "Hockey Patrol"
    }
  },
  {
    "title": "Silver to consider changing draft lottery, revoking picks to curb tanking - theScore.com",
    "description": "Silver to consider changing draft lottery, revoking picks to curb tanking  theScore.comNBA's effort to stop tanking is 'not working,' Adam Silver says  NBC NewsNBA Commissioner Adam Silver delivers warning to tanking teams  Yahoo Sports CanadaThe only way to \"align incentives\" for NBA, NFL teams is to remove the incentive to tank  NBC SportsNBA commissioner Adam Silver touches on variety of topics at All-Star Saturday  NBA",
    "published date": "Sat, 14 Feb 2026 23:02:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE13elpSWDlCYU43dnlQeXNINWQtb2x0dHlCa2xnMzBlY21Ca2dseFlxSWlFdEdDV29BQU94bFpSQnItM0hDbFcwSFR5bk05bFFPWTJF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thescore.com",
      "title": "theScore.com"
    }
  },
  {
    "title": "This Backward Guy Medaled - Defector",
    "description": "This Backward Guy Medaled  DefectorWinter Olympics 2026: Japan's Ikuma Horishima crosses finish line backward — unintentionally — in chaotic race en route to silver  Yahoo Sports CanadaUSA skiier Nick Page involved in chaotic Olympic duals moguls run with opponent finishing race backwards  sportingnews.com",
    "published date": "Sun, 15 Feb 2026 17:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1SVnZzejF1aFB0WnVTc1ZtT3Vaem1mV2xtSXh0TU1oZThYNnpBb2Q0VmlCNnQ1T01DVXd3TWdPcldvN2I3dm5vaWdRSGNucWxxdGxEbWZUd1JCUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://defector.com",
      "title": "Defector"
    }
  },
  {
    "title": "Lindsey Vonn's Surgeon Speaks Out After Specialist Warns Her She Faces Amputation - SPORTbible",
    "description": "Lindsey Vonn's Surgeon Speaks Out After Specialist Warns Her She Faces Amputation  SPORTbibleLindsey Vonn prepares for U.S. return with more surgeries to come  ESPNAct 2 of Lindsey Vonn’s life begins from an Italian hospital bed. Expect her to push the limits the same way she did in Act 1  CNN‘The ride was worth the fall’: Lindsey Vonn returning to US for further surgeries after downhill crash  The GuardianLindsey Vonn Shares Update After 4th Surgery, Tells Fans ‘Don’t Feel Sad’ for Her  People.com",
    "published date": "Sat, 14 Feb 2026 17:27:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOcGdHWUVycDk4bTMtTjF2VWpUbU15Znl5S1FCelhVZmlnVGF1d1gyNHlIUC1yM21KblJGdVhackRfME1LYjhzMEdKVXVjdUxxRXNMdDgyLTRzNDlYNGZBTUZ6UU4zTXV6YVZscjdQS3dwNmtoVG82MmtFbmRVZHc5Z1g1LWFxWHhxWTFNaEo5SzQ2blhO?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportbible.com",
      "title": "SPORTbible"
    }
  },
  {
    "title": "Are Finland's hockey men winning at Olympics in spite of their coach? - National Post",
    "description": "Are Finland's hockey men winning at Olympics in spite of their coach?  National PostFinnish players mused replacing head coach Pennanen with Panthers’ Maurice over summer  TSNReport: Team Finland Players Wanted Panthers' Paul Maurice As Olympic Head Coach  The Hockey NewsSnapshots: Maurice, Morrissey, Davies  NHL Rumors - ProHockeyRumors.comFinland men’s hockey coach Antti Pennanen on hot seat despite Olympic blowout win  New York Post",
    "published date": "Sat, 14 Feb 2026 15:21:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNcmNCU2xuMTAteU82NGJmeUJBcDV5WkhlNWp5OWk4RUQ3Q184alhxTWFOdEFLckxCMlAxcTFoU01OVUNld01XU3Y1SWM2T1RxVkdadE5QcFdaSVJyTjVGRzlzNFlnY0pDMlcxY2tvLUVPLXo1VFJxeHEyaDFhOE5WQjYyYVJ2VmxnZ2Q1T21xU3lfLXl4aDFndlRWQ3lKR2x3OEZtQW1veS1KYm9yV2hHUThmd0duQmU4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Lucas Pinheiro Braathen wins giant slalom gold to secure Brazil’s first-ever Winter Olympics medal - Milano Cortina 2026",
    "description": "Lucas Pinheiro Braathen wins giant slalom gold to secure Brazil’s first-ever Winter Olympics medal  Milano Cortina 2026Column | Lucas Pinheiro Braathen dared to be who he is. He won gold because of it.  The Washington PostBrazil's Pinheiro Braathen wins giant slalom, earns South America's 1st medal at Winter Games  CBCWinter Olympics briefing: Pinheiro Braathen writes Brazilian fairytale  The GuardianBrazilians celebrate ‘Carnival in the Italian snow’ as Alpine skier wins 1st Olympic gold  Toronto Star",
    "published date": "Sat, 14 Feb 2026 14:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQQkE0ejFVYktlM2tvNGNVOE5EYVZ1dGUxajAzNkNQd1Brc0lFNjhuekxYSnRvSUlBSUU1RDVNVWV6Yy11YVQyRGd0V2JKYmYwaG80ZjhpZlpIUm5TejlFZURpLXNyNi1FVnZBNzlKX2p3Ym5sY2ZZZks0X3RGaVBTMW15UU84OW9USUV3VGt5dk9wUmlYZ2lfbFZtYmpEZ3Y2WmE0Wjhra2VVSjRPWkZ6X2YyWGQzbjhHcEhxUEtacjRBb0pOcW5oVUJvZ2d1QnRwSS16Q3NXSnA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.olympics.com",
      "title": "Milano Cortina 2026"
    }
  },
  {
    "title": "GPS data shows Honda engine responsible for 1.5s of Aston Martin’s Bahrain F1 test performance gap - F1 Oversteer",
    "description": "GPS data shows Honda engine responsible for 1.5s of Aston Martin’s Bahrain F1 test performance gap  F1 OversteerAston Martin 'look four seconds off top teams', says Lance Stroll  BBCMike Krack: Aston Martin “has potential” but \"we have a lot of work to do\"  Yahoo Sports CanadaLance Stroll on Aston Martin's F1 hopes: We're 4 seconds behind  TSN‘We have a lot of work to do’ – Stroll claims Aston Martin are ‘four-and-a-half seconds’ off top teams with 2026 car  Formula 1",
    "published date": "Sat, 14 Feb 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQbVV3UHlhc3RNUWhFZDN4QlZZN1F1MDFuSWkxSmZla0ttTWFCM1hidjVhZ2VwRjJENEREckhISVplb2Y2Z1p1ODBRUjhUNnVwbF91VWZ3TFlfR2dLQ3JoSmk5SVBLZ2pndmk4SnlNN3RDTTZCaUhZZ2htSTl4OF9rUmpVdjJyY184R3dzZGVTQ3Vra3FXSmF3QW95emRvS0lrTFFCM21YQ0NVMnQ1SndxLUt4Wjlwd0dRUnlpWXZXNGJSdjh0czY2akN4WQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.f1oversteer.com",
      "title": "F1 Oversteer"
    }
  },
  {
    "title": "Condom crisis hits Milano Games on Valentine’s Day - CTV News",
    "description": "Condom crisis hits Milano Games on Valentine’s Day  CTV News‘Higher-than-anticipated demand’ led to condom supply shortage in athletes’ villages, organizers say  The New York TimesOlympic Villages Run Out of Condoms at 2026 Games Due to 'Higher-Than-Anticipated Demand'  People.comLove in a cold climate: Winter Olympic village runs out of condoms after three days  The GuardianOlympic Village reportedly runs out of condoms just days into Winter Games  National Post",
    "published date": "Sat, 14 Feb 2026 17:55:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQSjRLa0ZDckszYUQ5Qm9tNmMwTTMzVDNHQkZ6SGpxci1WTUJQR05RU3JEYWcwajkwQng2WjA5bEtDTFZjQnpIWi01NUlWWjl4MkV4SUZ3ZWtLcm5palFTRnptNWNmY0xrNW1ydkR6OGFLUkZQYUpqN2NkWUtyM2RNSFgwaFViV3JlUXJ4VFBqVjUyQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "CAPE cancels meetings with Treasury Board Secretariat over expanded return to office - Ottawa Citizen",
    "description": "CAPE cancels meetings with Treasury Board Secretariat over expanded return to office  Ottawa CitizenTeam Canada grades: Celebrini oozing confidence, Crosby makes history in blowout win over France  Ottawa CitizenSenators captain Brady Tkachuk and brother, Matthew, meet Sesame Street's Elmo  Ottawa CitizenPolitical street theatre brings attention, laughs on Rideau Canal  Ottawa CitizenLongtime Ottawa radio personality Lowell Green dead at 89  Ottawa Citizen",
    "published date": "Fri, 13 Feb 2026 22:27:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQZFpxTHBOZ2JCRndLY3dYeks4aUJLZG00MFBHTW85dWVPR3RnVkRtWW01WDd5Q0FKaHUtUG9hb3IySm9zWFZyRFRqUnBSMTJXWVp2NXRmUXRHdDBMREZZVEVtWmxXSE1rTUZldmcwT0lKZXpoZUVzaF94QkRHS1hKc0I3UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ottawacitizen.com",
      "title": "Ottawa Citizen"
    }
  },
  {
    "title": "How this Italian sports bar became an unofficial ‘Canada House’ at the Olympics - CTV News",
    "description": "How this Italian sports bar became an unofficial ‘Canada House’ at the Olympics  CTV NewsCanadian Olympic fans have taken over this Milan bar and made it their own  Daily Hive VancouverCanada’s Ice Palazzo welcomes athletes, friends and family at the Winter Olympics  CTV News2026 Winter Olympics: Hockey Canada sets up an incredible 'palazzo' for athletes: 'It’s very well done'  Yahoo News CanadaConnor McDavid, Sidney Crosby and Team Canada enjoying experience at Milano Cortina 2026  Milano Cortina 2026",
    "published date": "Sun, 15 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQWkxHRm5CNFhHdTlqVTZraDJEWnNUOWtJcWhVa281R19sSHc1VEpYUzFrNkJIZ2pmb0c3V25pbW44RnF2VExORGhER3ZKOVRSU2hiZ1JUeVpaaWp0MzdzeXVjUnNEd2ZuUVljUW1qNkxNbVBJQWlpSGl3RGEzaVV3TEl0TlZab1JaVzFNTVVPNFFGYURZSUViMFE1bGEtdDJYdy1FbGdBaVhFZDlEV3JrVnhtNnlQZEV2VTJpN2xXdWw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "NHL Rumor Mill – February 14, 2026 - Spectors Hockey",
    "description": "NHL Rumor Mill – February 14, 2026  Spectors HockeyNHL trade matchmaker: Predicting where top targets go by the deadline, part 4 - The Athletic  The New York TimesNHL Rumor Roundup: Wallstedt And Tippett Resurface In Trade Buzz, Kings Could Shop Foegele  Yahoo Sports CanadaAround the NHL: Trade talks heating up around Oilers, Predators, Red Wings despite Olympic roster freeze  The Leafs Nation2026 Trade Deadline Primer Series  NHL Rumors - ProHockeyRumors.com",
    "published date": "Sat, 14 Feb 2026 21:25:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9NWVBSaElxRHBIV2EzT1VSaDdnRkMyOEd3aDVFUHNvdHJibkZrZktlZWNBV3V5Z1UwQzRwRjFrNHJsc010ZDNSX0xfWmszRGJGMHFTWS0yQWdqMXU4czZ6a3BhdEJ0YUgzUVJRZEZYdFNXZ0FSOU8yb3poVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.spectorshockey.net",
      "title": "Spectors Hockey"
    }
  },
  {
    "title": "Love is in the air at the Milan Cortina Winter Olympics - The Globe and Mail",
    "description": "Love is in the air at the Milan Cortina Winter Olympics  The Globe and MailSweeping romance: the married couples of Cortina’s Winter Olympic curling rink  The GuardianHeated Rivalry and Marital Bliss: Two Wives Go Head to Head in a Scary Olympic Sport  The New York TimesMeet the power couples of the 2026 Winter Games, from rivals to teammates  NPRLove, Betrayal, and Taylor Swift at the Milano Cortina 2026 Winter Olympics  Vanity Fair",
    "published date": "Sat, 14 Feb 2026 13:51:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPT0R3b3pmOXZHUmJ1OFVQVTc3OGRJT25RbENCbTNDa25mMUdKXzZXdFptdlNvZUZZQnhqeW42MUdLQ1NJckU4UkhxWHFpRlo4LTQxRlU0cVJfVXhnM0RYM21yYXhBZC0zR0hRNTJpa3Z5TzVMMEtUakptWkRxSVZWM1NqS19QMjZERlpDWDlfMXczRlZVTC1wZUFTUGVna0ZvcEN1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Women’s semi-finals set - IIHF",
    "description": "Women’s semi-finals set  IIHFOlympic Semifinal Preview: USA Looks To Cruise To Gold Unscathed  The Hockey NewsWomen's Ice Hockey semi-finals at Winter Olympics 2026: Preview, schedule & how to Watch Live  Milano Cortina 2026Swedish coach suggests that USA might not want to face them in women’s hockey semis  TSN2026 Olympic Women’s Hockey semifinal preview: USA vs. Sweden  Daily Faceoff",
    "published date": "Sat, 14 Feb 2026 22:33:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbWpQdWhoVEM0RmFhaDNKS1lIWkpPWXBOaDZIZm4zSlJfXy1nWmxfNV9RWWE1WmdINXNkZlJiSTNodDJ3bzBLOElvYTBiVDZWdnJQOXp3NmQ5MkdqZHJ3RGcyWXpfcGpCQUYzeGZydTZWaUVrTTdlS3BUYUVHekpRZnNxeTE2dFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iihf.com",
      "title": "IIHF"
    }
  }
]