[
  {
    "title": "Olympic Preview: Canada vs. Czechia (Men) - Hockey Canada",
    "description": "Olympic Preview: Canada vs. Czechia (Men)  Hockey Canada2026 Olympic Games: Czechia takes late lead over Canada in nailbiter men's hockey game  CBCMarner scores OT winner against Czechia to send Canada to Olympic men's semis  TSNCanada eliminates Czechia to advance to men’s hockey semifinals  CP24Canada advances to Olympic men's hockey semifinals with 4-3 overtime win over Czechia  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 15:40:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE4zYnFVakFHUkJTbEMwbnRGMTltandqR2ZTVEtHTE81cUZOZXE2QU82amhlNlhScXh1OXI1ZGloYWxfNUZxZllhZ1djSlJxdEQxRjNGTGttWlFyeUYtZThNR0lvcWZkTFB0WFlFWnBDOG9kYldYc09wajJwcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.hockeycanada.ca",
      "title": "Hockey Canada"
    }
  },
  {
    "title": "Canadian snowboarder McMorris misses out on fourth straight Olympic podium - TSN",
    "description": "Canadian snowboarder McMorris misses out on fourth straight Olympic podium  TSNMen's snowboard slopestyle final at Winter Olympics 2026: Can Mark McMorris win fourth consecutive Olympic medal? – full schedule, how to watch live  Milano Cortina 2026Canada's McMorris, Spalding miss podium in Olympic men's slopestyle snowboarding  Sportsnet‘Tough pill to swallow’ for Mark McMorris in snowboard slopestyle final  olympic.caMark McMorris fails to add to his Olympic medal tally in Milan Cortina  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 13:31:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOalBzb3BSNHQ0VjJOdmJpRTRzZnRWMFlJRlUtRkQ3UE5kX2xiLVQyLWV4SlJYOURmQkFuUzhQV1JJUDFIdlVwRkIza2dXZzFHMW5FcnhXZS1Fb01UTnBpZTFrTVdmdlhhMFNFZktWeHVYbUpkajlBWUJzYnlPSHFockgwYUNMeExyQjQ3azA1WnFwZ3I5dTBTYWhfOG9Weld1ajhTLWRkaURaZHlNSGN2bQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Gold medal game a moment of truth for Canada’s women’s hockey roster - The Globe and Mail",
    "description": "Gold medal game a moment of truth for Canada’s women’s hockey roster  The Globe and MailHeart, work and desperation: What an underdog Canadian team needs to do to win Olympic gold  CBCCanada's Claire Thompson likely to play vs. U.S. despite missing practice  SportsnetCanada, United States to renew rivalry in another Olympic gold medal game  olympic.ca‘It’s going to be a blood bath’: Canada’s calm meets USA’s confidence on a pressure-packed Olympic stage  Daily Faceoff",
    "published date": "Wed, 18 Feb 2026 09:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNYnJpSHlfMnE3NjNFMjNVYlpkT0NMd0s3OHQwdVQtT1JZdjVRdnNDUTRzRE9ldW91YnIzMHYzZkVoZXZJSjgtNExhUkFYZGZSQjN3ZnJWTEhsWGRKbHBSUUJ6MS05UnBtSG4wUHJYS245a3JFMkMzYWlXcVBsby13TlhmcFdfQVBNc2l5MmZzQVV5Wm9Fb0xqTWxFZkt5UnlpR24zdFJOSU54MmJrdnVMRjhR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Canada captain Crosby ruled out vs. Czechia with lower-body injury - TSN",
    "description": "Canada captain Crosby ruled out vs. Czechia with lower-body injury  TSNWinter Olympics 2026 live updates: Canada, Czechia tied in 3rd period of men’s hockey quarterfinal  The Globe and MailSidney Crosby exits game with apparent leg injury against Czechia  CBCCanada captain Sidney Crosby injured, out of quarterfinal vs. Czechia  CityNews VancouverWhat happened to Sidney Crosby? Team Canada facing injury scare for all-time great at Olympics  Yahoo Sports Canada",
    "published date": "Wed, 18 Feb 2026 16:50:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNU2Z6a2ZXaWJPVVIxNjZYQ1NEVWl4ZTFodGhaRXBvTVVHaDdoRW9qRS15OW0wSWhhc2V4RXN3LUl4OEZqeWVySXkxSFU0TzVpblZ0WDRXMkp6V1BiQ0M0cVVqeFdQM0lhc0Y1Q3BxdG03Q1U2dTJ4NzViMDJpdFNHVk02NEI0UjBOby1ZdUFnQzJlOG1KM3pPOTMyLURyZXFodWVwLVFDLURZcEFu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "With a star turn at the Olympics, Celebrini is becoming a celebrity - The Globe and Mail",
    "description": "With a star turn at the Olympics, Celebrini is becoming a celebrity  The Globe and MailCelebrini’s chemistry with McDavid has allowed the rest of Canada’s lineup to thrive  Daily FaceoffCanadian Olympic hockey star Macklin Celebrini 'always smiling,' says former Vancouver coach  CBCCelebrini thriving for Team Canada in 1st Olympics at 19  NHL.comMacklin Celebrini’s Olympic success is surreal even for his accomplished, stoic dad  The New York Times",
    "published date": "Wed, 18 Feb 2026 12:16:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOTDk4M3VhX2x2bnpkLXVOVjduSWx2cjFFYkR0WVlCbThJZVNHWW1teGZWU1RDQnl4YUJYc3BrdFlYUWY1N2dsanZ4b1RVU3M0dENyRDltR1Q4Q3N6M1hhQVhNc0pPNXB6RmFLRnFTVklIOWsweXBfdG1QOE02UDJOOWtiT0x2M2s0ako2VVJkQTI0T0VpdE45eS1TM1lPeXNvOTA3N0pyb3gxXzdvWjA0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Canada's lineup vs. Czechia comes into focus ahead of Olympic hockey quarterfinal - Sportsnet",
    "description": "Canada's lineup vs. Czechia comes into focus ahead of Olympic hockey quarterfinal  SportsnetMarchand, Morrissey could play for Canada in Olympic quarterfinals  NHL.comCanada’s MacKinnon, Bennett expected to play quarterfinal after missing practice  Daily FaceoffPanthers' Brad Marchand Set To Return To Canadian Lineup For Quarterfinals  Yahoo Sports CanadaMacKinnon, Bennett take a maintenance day ahead of Canada entering knockout round play  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 15:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQa2szTGQtbVVQMzlrU3RrZU9oV1FLcWdBWG9TXzRzbTR0RXBUbnN0U3l6T1NmWmtwaEthbkx5M2pqVzhEeHF3WU9EWWZJM2JzMGtlNFNuMV9PQkFPNkRYbW94NHVmZ1BIMTZkM19FYkFqOWk5VTB2WUZBV01aTDNvNWwxODhCSkhaM1pyNHp0N3BaSXh3ajVYcU1nR19FVDdxYk9EN1ZTcXh2cmJuMFNsaVYzS0M2LTlTVVh3TTNYalptM0RnWlZVVnd6cTE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "IIHF unveils quarterfinal schedule for 2026 Olympic men’s hockey tournament - Daily Faceoff",
    "description": "IIHF unveils quarterfinal schedule for 2026 Olympic men’s hockey tournament  Daily Faceoff2026 Milano Cortina Olympics On Tap: Quarterfinals begin Wednesday  NHL.comWho will Canada face the semifinal? Breaking down Olympic reseeding  TSNOlympic men's hockey power rankings: Finland, Sweden heating up at right time  SportsnetQuarter-final pairings set  IIHF",
    "published date": "Tue, 17 Feb 2026 22:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOMm9zYlhnQ0tvalNwMUExWm1kZUI1YzJwSUdBVG5uNnNxWmFsSUp6dVZ4Z19IVUNQaE9aVXlwekpUNlZEV2ttWTVPSUFKcFowTVEtT2xoRmxjZXJiZFpGN0M2M0JVV3lOTTIzNm9EOXRybk9HM01fWHp5OWNtRG83MUpSTl92aGxvWkRaOGl1d3pqRWNKbGI4OWJfVEFWRGR1TmRkdGZDQ0lBVEV6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailyfaceoff.com",
      "title": "Daily Faceoff"
    }
  },
  {
    "title": "Canada’s Homan beats Sweden’s Hasselborg at Games - Global News",
    "description": "Canada’s Homan beats Sweden’s Hasselborg at Games  Global NewsLast-rock victory keeps Canadian playoff hopes alive in women’s curling - Team Canada  olympic.caSweden become first women’s team to qualify for semis at Olympic Winter Games  World CurlingCanada's Rachel Homan scores 2 in 10th to hand Sweden 1st loss at Olympics  CBCAre they back? Playoff hopes alive as Canada's Team Homan return to form with win over tournament-leading Swedes  National Post",
    "published date": "Tue, 17 Feb 2026 15:54:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNb2daemV0MkRSTzY3MmFuSUIzMkkwWkNmeUlxRkdqOWlOYWZWQjRGUHNicUJzZzFqMDhwNzgzY25ySWhVLXU1MnJLczg3dzNvRk5jdUM4QnBhVEZOWUh1OXBRcmN6bmNmWnJEZzdLR21KNTFueWV6SGoyVDgxVzhjaGVuVlhlODBHLTI0Qg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ontario town to celebrate Olympic gold medallist - Global News",
    "description": "Ontario town to celebrate Olympic gold medallist  Global NewsVideo: Canada's Day 10 at Milan Cortina Olympics  The Globe and MailParry Sound’s Megan Oldham wins her second medal of the games  CTV NewsBruce Arthur: Canadian freestyle skier Megan Oldham almost didn’t make it to Milan. Now she’s an Olympic champion  Toronto StarOlympic Games have ‘surpassed my dreams’ says golden Oldham  olympic.ca",
    "published date": "Tue, 17 Feb 2026 19:11:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSzI2dXFOSEdod1QzX2tnV2VCVUdWVUtnaENCdjJVVWdTb2NLcU9BMFZDbUgteV9iRXFSZ1dTbXJTQWYwWjFyazVtbUQ2bVBWZERJWllIQjZ0S1hpOWZEVDdHX2dRQU1sWV9LYmV0bmFocXRPQU90OTBwdC1Wakg4ZS1ZREZ3TGtEMzh4Tkl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Winter Olympics 2026 Day 11 recap: Speedskaters win Canada’s third gold; Men’s hockey quarterfinal opponent decided; Virtue, Moir reunite - Toronto Star",
    "description": "Winter Olympics 2026 Day 11 recap: Speedskaters win Canada’s third gold; Men’s hockey quarterfinal opponent decided; Virtue, Moir reunite  Toronto StarDespite recent wins, Milan is failing Canada’s Olympic vibe test  The Globe and MailFive things to know from Tuesday at the 2026 Games  Global NewsPride, trust in each other leads Canadian trio to another Olympic gold  olympic.caOttawa speedskaters part of team that won gold medal at Winter Games  CTV News",
    "published date": "Wed, 18 Feb 2026 06:00:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOX1BsTHl1VkswLUVubkFTZVpPalk5czdvV2F3RTA0Z25Qd1ZfamFRNVdZMUEzSUZ5LWFFalE4NXlGbGxZdlVfZDdwaGYtWWE0MGJyQmZ4NkFxZ28yOU5Td3hNazYwdGNJclNIbEo4SG5HOGxFaG5TUld1cGZUMVdNeXJPcWM5OEhBU2MtLXRZTFFjWjZVNlpvOEF0ZFFwbGxXSEtWbVpVS0VnX2pFdk1fX1JlbEFxczFhZTNFTVdzR3pWalpOYm5yRDQwblhCOEZkMG1GdFBHbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Regenda, Slovakia cruise against Germany in Olympic quarterfinals - NHL.com",
    "description": "Regenda, Slovakia cruise against Germany in Olympic quarterfinals  NHL.comSlovakia shows mettle, grit to earn chance at Olympic medal  NHL.comBlues’ Dalibor Dvorsky sets Olympic record for most points by NHL rookie  Daily FaceoffDvorsky shines again as Slovakia dominates Germany to reach Olympic semifinals  TSN'Underdog' Slovakia Punch Ticket To Semifinal At Olympics: 'We Came Out Flying'  Yahoo Sports Canada",
    "published date": "Wed, 18 Feb 2026 14:02:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNUTJXZWQ2X29MYlRWTW9hYW1hQ0tKNGhNWUFaaVMzX0x4MjYweGRpSUZUaDYwS0JWVXJRanJDSDI2Q3pNck1WNWkxMGV2eTlKa05RUlVHN0Z3VnRNLTFSVTFHWXBuM29YdUpaZWpkWEUxM3RNbU1VVlB6aURJZHJVSzZJVUc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Jacobs, Canadian men secure curling semi-final spot; Homan, women’s team top Sweden - The Globe and Mail",
    "description": "Jacobs, Canadian men secure curling semi-final spot; Homan, women’s team top Sweden  The Globe and MailWinter Olympics 2026: GB curlers on brink of early exit after Canada defeat  BBCIt’s on to the playoffs for Brad Jacobs and Team Canada in men’s curling  olympic.caJacobs beats Great Britain’s Mouat as Canada secures playoff spot at Milano Cortina 2026  TSN3 Takeaways from Canada’s curling day Tuesday, including a playoff qualifying win for the men  National Post",
    "published date": "Tue, 17 Feb 2026 22:36:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNMENyem9uT2NzMmg3SzhTUjNVODMtZzVNTGpKUzJyRURBdzVQMVZVZV92dlkwWlJiTzFCN2h0REVSWXBQNkpyQ3RlanB5amVnYVYzaVR2V2FKS3U0ampVNzdGUDVFSHpneUNiSWZ2dHJYeU43R2p4WGlnVEFJSmtnVzNSR0pWaXM2SjF2bndHUGRsdGJxRVlfVHNLOXVGMVpVRDFVemNZbmI4NHlHdU92NlF3UkJSYk90b0JfLXkwM0Fmdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Milano Cortina 2026: Day 12 Olympic events to watch, full schedule - Sportsnet",
    "description": "Milano Cortina 2026: Day 12 Olympic events to watch, full schedule  SportsnetOlympic viewing guide Day 12: What to watch on a big Wednesday  CBC2026 Winter Olympics: Follow live updates Wednesday from Milan Cortina  ESPNDay 12: What to watch with Team Canada at Milano Cortina 2026  olympic.caWinter Olympics 2026: Team GB lose crunch men’s curling tie, Norway’s Frostad wins big air – as it happened  The Guardian",
    "published date": "Wed, 18 Feb 2026 11:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNWkM5NHJRTlJfcDNFODdnc3d6TmRnQ3c3bHctUHlsYnR0cGhkMVVnc0lCbGVJX3JNendTemRmRzF4Ujl2SnpGUmQwMFBDTzQzN1FoQWMwQ0FlNGNWR0lZRUY4eW55OExnbzdGR1JaMHJOU09wb2czaTBxOUZpUDROSXV5VzB5U243S0hyLWJfXzRJUDU4bk81NFpaZ0tFRXhwaWpuRkd0N2UzWjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Palladino: ‘Only half-time, Atalanta think positive, but Kovac protests too much’ - Football Italia",
    "description": "Palladino: ‘Only half-time, Atalanta think positive, but Kovac protests too much’  Football Italia🔥 He’s done it again: BVB star sweeps Atalanta aside with his crosses  Yahoo Sports CanadaGuirassy stars as Dortmund dispatch Atalanta  BBCDortmund-Atalanta delayed 15 minutes due to hosts' late arrival  theScore.com🚨 Chaos over Grönemeyer: BVB match kicks off late  Yahoo Sports Canada",
    "published date": "Tue, 17 Feb 2026 22:58:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBhRFUwaWdlU3hQR1RDelpPNzR3OU5QTHNSNENLcmk4aHVGQmNZUm5JU2pUcTZCVXVKLVUyWGFQaTVOd0RsSERWRTJIanNqZ0pJYUJoaE9GRF84M2Y1cFo1cHRCcmFfX1NPWDVBaWtNZktvQmRlRm0tWnNDenHSAYIBQVVfeXFMUHpnczBaSGVaTTJ1SHJVZkhZX3BoREo0QTBEd1lOdU9fOUF6aVkxWDNsdGNLeFAxQWtxRFl4YTF5aTgxNzBIN3FqTnN4ZTFVSjdTZmxkR01qeEVOOXVWYzdXaVhBay1pNEFCdl9zRWszSWdQd2RiRDBKNDJ1TzA2cmxodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://football-italia.net",
      "title": "Football Italia"
    }
  },
  {
    "title": "From cursing curlers to comeback: is Canada on the turnaround after slow Olympic start? - The Guardian",
    "description": "From cursing curlers to comeback: is Canada on the turnaround after slow Olympic start?  The Guardian'A sad day' - curling cheating row at Winter Games unsettles Canadians  BBCOlympic curling controversy keeps simmering as unofficial umpires raise concerns  TSNCanadian curlers are being accused of 'double-touching.' But what's the advantage?  CBC2026 Winter Olympics: Fans react as Canada's men's curling team catches host Italy making rule infraction  Yahoo News Canada",
    "published date": "Wed, 18 Feb 2026 10:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQQy1PNDVpSTh4X05TdV9URzZiOGdCUGFvRTVvU2hoT2ZxYnNSaU8zQTRNMnotYlg0elVXd0N6bmZOWE1uNU9DOTFoMlJLS1d5ZHJRUEJ4c2VINlE5a05aWk5XMjRMS0M1SVZPbzdIczdlTVJLWXVQb01FVUt4eTR6YXB0cFBjOWpUWFlrWg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Canadiens' Newhook returns to practice, Laine doesn't skate - Sportsnet",
    "description": "Canadiens' Newhook returns to practice, Laine doesn't skate  SportsnetUpdates from practice - Feb. 18  NHL.comLower body injury sidelines Laine from Canadiens practice  TSNMontreal Canadiens get good news in their first practice back from Olympic break  A Winning HabitCanadiens: There Was One Big Name Missing At Practice  The Hockey News",
    "published date": "Tue, 17 Feb 2026 22:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUHBIMHdYZ29RSmtqT212eHFSV25XcndoWk9tWUhBYzhQMThwNmhfTEViVVZyY1loTW8waURZUWtOZUU3VlhwUE9hNXJuc185S01xMkFucWRSSnNFUmJxRFhhQVBQY1NQdm91NTdfeEdUSkZuTlpMSWtIYl8yMlRYUHo4ZThZZF9ZbnNLNzc1Y0ZLNlI1WDl0UXRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Canada and Czechia set for Olympic hockey rematch - this time with much higher stakes - National Post",
    "description": "Canada and Czechia set for Olympic hockey rematch - this time with much higher stakes  National PostCzechia ready for rematch vs. Canada in quarterfinals  SportsnetTeam Czechia holds off Denmark, advances to Olympic quarterfinals  NHL.com2026 Olympic Men’s Hockey: Top standouts as Czechia eliminates Denmark  Daily FaceoffNecas on Canada: 'We know they’ll be coming hot'; avoiding 'stupid mistakes' key  TSN",
    "published date": "Tue, 17 Feb 2026 20:12:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQc2FNZmZsWEt3WmdKSzVTMHpqQUNBTGttbS1Za2o5MFdwR05hNXVIRXU5dUg0ZkFHVnNTWmNqQzVaM1AyTEhpYTZhOGtsWHlVWnJNdGxTWFVZN1dJbWtpWDBTQ1RBcVdfWGNMdHFaRHp5c1ZIczVoS0VpSWpYZ1hjRXJ3WHV1ek1oS1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "For Vlad Jr., what a difference a year -- and a World Series appearance -- makes - MLB.com",
    "description": "For Vlad Jr., what a difference a year -- and a World Series appearance -- makes  MLB.comView Full Coverage on Google News",
    "published date": "Mon, 16 Feb 2026 19:09:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPTXhrRmJaS0VfbTRMR0FyeGkxLVRkLUROVms3a1ZuaXBZcVZFWEE0Nl9pdUFLUjRPYjZ2ZFlhOGJzWUtxdG51UVVsZWYyYU41bWFwTTRObEJ6Q1g2WUZKb213cHo4bDhHMGMzdFZIOHNQNUtyOW5sSU5ob0s2VGl3RU9NVW55ZER2dGdGUG53UjNrLWUzaWFoSHlsdFd0Mm5lclFN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mlb.com",
      "title": "MLB.com"
    }
  },
  {
    "title": "Don Cherry, Tracy Moore and Cameron Bailey among new Order of Ontario appointees - NOW Toronto",
    "description": "Don Cherry, Tracy Moore and Cameron Bailey among new Order of Ontario appointees  NOW TorontoDon Cherry, Edward Rogers among latest Order of Ontario recipients  CBCProvince Honours 2025 Order of Ontario Appointees  Ontario NewsroomUniversity of Waterloo’s dean of engineering to receive Order of Ontario  CTV NewsDon Cherry, 92, receives Order of Ontario appointment  Global News",
    "published date": "Tue, 17 Feb 2026 21:34:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNcTVIZ3l6d1QxVWIxNUlCelpaaTVNQjdzbE1aQUh6SGZZY2d6M21ldnlUQ0JnQXBUTDUyYWdUMHNJYkJEM0w5Tk5kUEVKVmJ1My1iVDctb0lRdDNPc0ZJc1ZmUC1wOHZ1WmJrbzRXeldEeG1fNUN5WlpxdnlzX3VoZFVrS1A0RHVHOFFkWV9ZMWY2dUdpWGhqN2laM1RxZHo5QzBEWWxhaEZoLXVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nowtoronto.com",
      "title": "NOW Toronto"
    }
  },
  {
    "title": "4 compelling free agents still on the market - CFL.ca",
    "description": "4 compelling free agents still on the market  CFL.caA team-by-team look at 2026 CFL Free Agency  CFL.caCFL East Division Free Agency Recap: Redblacks make a splash, Argos, Ticats retool  TSNJeremy O'Day explains why Saskatchewan Roughriders signed James Letcher Jr., James Vaughters in CFL free agency  3DownNationAnalyzing the Roughriders roster after free agency  Yahoo News Canada",
    "published date": "Tue, 17 Feb 2026 19:03:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxORTZTenJoekFKOXpSZjRPR2p6VC1HR05FdVBrMTZjM284NVJNemEtVnZJMml2MkNmU2xVRVY4V2VYTTdobHEtcVJic1lIM21KRUZtbEltak9EeGhnUFoxeVY1eHJaTlVweXh1bV8tN181bW5kMWF6TUkwYXRoTmk0Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cfl.ca",
      "title": "CFL.ca"
    }
  },
  {
    "title": "Canada Needs Marie-Philip Poulin To Bail Them Out One More Time - Defector",
    "description": "Canada Needs Marie-Philip Poulin To Bail Them Out One More Time  DefectorThe great Marie-Philip Poulin leads Canada to a gold-medal rematch. They'll need much more against U.S.  National PostJaques amazed by Poulin's gutsy effort, lauds her 'mental toughness'  TSNBruce Arthur: This Canada-U.S. rematch for Olympic women’s hockey gold will have something extra on the line  Toronto StarCanada’s Marie-Philip Poulin breaks Olympic goal-scoring record  CityNews Kitchener",
    "published date": "Tue, 17 Feb 2026 18:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNX3FUMndkOUVDb0dnU25UQ1Rtc210SzVPWGJiT3VxeF9IbkhMSWtPUGlSLXJpOFQtd0ZEOVRCZm1rek9vVmMtYXhaMnhQcEM0d3dBcGhYcVktOTZXbGlZX3ZoMUxteXUyRWpzTjh2bHI3WXFYM1MtTzZMYXg3dXNYTEJ5LWhVaXVWVE53MQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://defector.com",
      "title": "Defector"
    }
  },
  {
    "title": "Rhode Island shooter killed ex-wife, son before bystanders intervened: police - Global News",
    "description": "Rhode Island shooter killed ex-wife, son before bystanders intervened: police  Global NewsShooter killed ex-wife and a son in Rhode Island ice rink attack, police say  CTV NewsSuspect in Rhode Island ice hockey shooting killed ex-wife and son  BBCPawtucket shooter’s gender identity tied to past family disputes, court records show  WPRI.comHockey rink shooting suspect warned about going 'BERSERK' in X post day before attack  Fox News",
    "published date": "Tue, 17 Feb 2026 19:01:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQanlMaXhGcGxxOV9TR2tPRzAzZHRMM0E2RnpzTnd4R1BUcUYtYVhLUU9BZnY3cXJsaGhYWHNJaFpfWHpmS251U1llcW80WHA0Tk52Rk42cEdSeDdJM08wLUlObUxpM2RwSWdDMmJUMTRmS0I1U1JyUXhXUXd1QWx6SXJwd0FPNEw2eHdfTzg0UDk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Cole Harbour 'bursting with pride' watching Team Canada at Olympics - NHL.com",
    "description": "Cole Harbour 'bursting with pride' watching Team Canada at Olympics  NHL.comFrom Sidney Crosby to Troy Ryan, Nova Scotia's hockey roots run deep in Milan  National PostCanada crushes France to close preliminary round, clinches No. 1 seed at Olympics  Sportsnet2026 OLYM: CAN 10 – FRA 2 (Preliminary)  Hockey CanadaCanada may have unearthed a key moment in lopsided win over France  The Globe and Mail",
    "published date": "Tue, 17 Feb 2026 00:20:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQWl82X045TlVZTFZxMGRPM3lfUjdJTERyRGp4Z2xKeDkzN3U3MnhpS3psU3E4dUV0TVdCMFY1WjhhMmpjWEtYaERoUXZ2bmxxa1dTbm9JUHZubGVTYk9WLUVBRU5CSVBsM2NDWllpLTd2em9zTUdITk9HeWFDeUZUdg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Amber Glenn Falls To The Cruelest Rule In Olympic Figure Skating - Forbes",
    "description": "Amber Glenn Falls To The Cruelest Rule In Olympic Figure Skating  ForbesDazzling teen Ami Nakai leads trio of Japanese skaters poised to win 1st women's singles gold in 20 years  CBCFrom the Sports Desk: The 'Blade Angels' take the ice  NBC NewsAlysa Liu’s joy, Amber Glenn’s anguish and a short program with a gamut of emotions  The Washington PostJapan sweep? Petrosian podium? Women's skating in grand finale  Yahoo Sports Canada",
    "published date": "Wed, 18 Feb 2026 10:30:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOM3VXb3U4RHJETjA3azdaOFpIcmRPd2ZLTzBOTXdURWpDbUtZWW5UVDQ0bGpyajRDcWVzWHRCTmFSTlhwMzhIM2p5WlB6dHUzdGtJbUg4VnB0OTNaaWxCSm9UaHJyWGc2UU1DbmpDUmJvMDR1QXpERlF1VkNHZjB4Ni03aHlYaTl0YnBBcmJRR0NhVEk5WUJUVnBlT0FHelhSNDNDWUdoR2dMUm14dGRYWTl6VU1lSFNmMmE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Winnipeg Blue Bombers QB Zach Collaros says 2026 CFL season could be his last - 3DownNation",
    "description": "Winnipeg Blue Bombers QB Zach Collaros says 2026 CFL season could be his last  3DownNationWinnipeg Blue Bombers quarterback Zach Collaros raring to go after free agent additions  Global NewsCollaros’ football future on his mind as he prepares for 2026 CFL season  CTV NewsCollaros Media Session: Main Takeaways  Winnipeg Blue BombersBombers’ off-season fireworks have Collaros ‘reinvigorated’  Winnipeg Sun",
    "published date": "Tue, 17 Feb 2026 19:46:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPNl9adDVyUEFXMFJlRTV0dTVueFc2VW1OQTNrMHF3WGFWQ09jSVJEQUhxWUNZbmlhRVVwZkxFRVdUU3pZOXBQOGEwa3QwZFNqOEJVMVlZVm5vbzU5WWQ0NFBkcmVrY1E2QVNwRDY4aEdESi1DbnJEZmRnb0NZU2RrTGRSNlcxMTd5TXBfal9YU255Q0F0emlOUHNnWGJvVnQwajhTVnlZbTJQZGJlV3FQU0FOUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://3downnation.com",
      "title": "3DownNation"
    }
  },
  {
    "title": "Day 11: What Team Canada did at Milano Cortina 2026 - olympic.ca",
    "description": "Day 11: What Team Canada did at Milano Cortina 2026  olympic.caView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 00:28:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQMWI3LXktUDRtTDB3Z2Z5NFFBUFpYUWtod2FqWGNEblF5M19xNXA0NEJQRWI4bnlmcmJ5WmFfN2VKak04VVctWjVZd1d3enFONDE1SlZUS01fdHB1dkdET0VwN2ZDa19LdGRhOWdxN0hhUVJkejZoRWw0cTNhZmFZSGRwZXcxMmsy?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://olympic.ca",
      "title": "olympic.ca"
    }
  },
  {
    "title": "Setback for Aston Martin as Honda PU issue interrupts Bahrain test - PlanetF1",
    "description": "Setback for Aston Martin as Honda PU issue interrupts Bahrain test  PlanetF1Alonso: Aston Martin will be fastest ... Newey won’t ‘forget everything’  TSNDramatic Aston Martin spin causes first red flag of final F1 test  The RaceWhy Aston have hope for the future despite early struggles  Formula 1Fernando Alonso: Aston Martin driver says team boss Adrian Newey gives him confidence they will eventually have 'the best car' in F1  Sky Sports",
    "published date": "Wed, 18 Feb 2026 10:36:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQWUxCN1NGUnRZdFhlTjJzRHlCdEdSVkpsdFhqdVFkeWFnLVg0SFU1ZU9mYnlKa1RhdU1Cc1ZEaGNsOFBpOHBqUUhEbVB2VEFXNmtNcnZhcS1NR01WWF8tbGhNWUZORmVIOXJmVkxNcGRXTkdxSWxTa29UanhIeGFYTVN2STZTQWR3aS13ZkJ4eHhjaFh6QnNpVmNNMW1nOEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.planetf1.com",
      "title": "PlanetF1"
    }
  },
  {
    "title": "‘Leading by example in every possible way’: McDavid gets big compliment from Crosby - TSN",
    "description": "‘Leading by example in every possible way’: McDavid gets big compliment from Crosby  TSNWinning gold medal with Canada would mean everything to McDavid: Joseph  NHL.comMcDavid ties Olympics points record with 11 at Milano Cortina 2026  TSNConnor McDavid breaks Olympic record: Can Canada's ice hockey superstar make more history passing Teemu Selanne's all-time mark?  Milano Cortina 2026Monday Scramble: McDavid set to smash Olympic NHLer record, France’s fighter suspended, love for Slovakia, and no thanks to Foegele  OilersNation",
    "published date": "Tue, 17 Feb 2026 23:01:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOcS1VdEctUHRWc18tUnFlOHh5MzQwZ0cyaTU3ZDUyaHFPT2ZDTEpjREZpS0cxQzZxcTdQY3kxZUgwamVMdU1Vbk5meEc2T3RoQ2xBbDdFTUlybmVVcVp4UjI3ZkdDa091V19WcHF6dnVlRWY3N24zaXFELW5OZXRCdXJtUC1rbElucnlxaGVmWTF1cFpjNWE2UUpMNk80dktVdU5ic0Z4dkk5T2dzRE5wNmR5OGJscko0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Toronto FC Acquire Colombian Youth International Emilio Aristizábal on Loan from Atlético Nacional - Toronto FC",
    "description": "Toronto FC Acquire Colombian Youth International Emilio Aristizábal on Loan from Atlético Nacional  Toronto FCToronto FC acquires forward Emilio Aristizabal from Colombian First Division team  SportsnetTFC signs Colombian forward Aristizábal on loan  TSNToronto FC acquire Colombian forward Emilio Aristizábal  MLSsoccer.comToronto FC sign 20-year-old Colombian forward Emilio Aristizábal on loan  Waking The Red",
    "published date": "Tue, 17 Feb 2026 22:08:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUGJTNHQ2Y2h6bDJrOTVtRmoyQUNCRU1xemI4cEFxRGZ0UFZEWTZscjhMODhDN0pXMXp2NWFoSURFbDRpWW9qNG5keTVPdDJ4dy1EdDRHRm1INTZxRWRYbWFlbmgzdllJMmpqeWpsZ25yVm45cGUxTW9icXFnbHM4X3pZQkY1RGpjVkhsV2UxLXFEOUs4Tnk0Q19CcGtqaVVITGcyRmJxMExLZVVHUmRTbXJFV041dDNhaFl2b0IxSThJR1dFVXRR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.torontofc.ca",
      "title": "Toronto FC"
    }
  },
  {
    "title": "‘Time to stop’: Canada’s Wilson on Olympic scrap - Global News",
    "description": "‘Time to stop’: Canada’s Wilson on Olympic scrap  Global News‘A joke’: French players sound off on federation’s suspension of Crinon after Wilson fight  TSNFrance’s Pierre Crinon charged for previously punching goaltender in the face  Daily FaceoffOlympic hockey demonstrates how good the NHL could be, but isn’t  The Globe and MailThe full Tom Wilson experience is on display at the Olympics: ‘A nightmare to play against’  The New York Times",
    "published date": "Tue, 17 Feb 2026 18:57:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQTDMtWXloRW9VWlIwRnRQZkRHVEhEM0dPaGRFRHZmdVRfeEg2ZEhkYU00UzJXVEJZRWVCaV9PUXdxWWpLaVIwcUZGYllwWllMTy1USUt5OEJrUmpOMmROcWxxOW9haFlmTGhJN1MwWDY2U2ZCQTl4dGtLaEkzWklqay1ieVJQYXRP?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Men’s Olympic hockey: Quarterfinals set after Czechia, Sweden, Switzerland, and Germany move on - Canucks Army",
    "description": "Men’s Olympic hockey: Quarterfinals set after Czechia, Sweden, Switzerland, and Germany move on  Canucks Army5 things learned from Day 7 of Olympics  NHL.com2026 Olympic Men’s Hockey: Top standouts from qualification round  Daily FaceoffTakeaways: Stars deliver as Germany, Sweden reach Olympic quarterfinals  SportsnetGermany, Czechia, And Sweden Punch Their Ticket To The Quarter-Finals: Canucks At The 2026 Winter Olympics  The Hockey News",
    "published date": "Tue, 17 Feb 2026 23:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNXzdrTjRJWUpwRl9saDVCZGswekJaVnJXeExTVjQ1LWp2eFBvUGlWTFFtcjdQcTFvSFh4aWhNZmFVSzRPYnF5aFBQeGF4VEdEUzNkbmItMUpMUnpESGNSbFFDNHQ1U0pYWkhfQmRRWDZrOUdXODJnbE9ITi10NXJ1NS1hMFVoY0ZoMUFaTDlGbWYyOE1WemMxOUZ3UFNubHhjV2FtSTViVlJhYU9vanpfMjNFN2RDVmY2V2VZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://canucksarmy.com",
      "title": "Canucks Army"
    }
  },
  {
    "title": "Niklas Edin adds to his legacy amid \"horrible week\" at Winter Olympics, contemplates the future - The Grand Slam of Curling",
    "description": "Niklas Edin adds to his legacy amid \"horrible week\" at Winter Olympics, contemplates the future  The Grand Slam of CurlingEdin rues Sweden's lack of 'toughness' as title defence crumbles  ReutersSweden remain on top form at Olympic Winter Games  World CurlingWinter Olympics 2026, men’s team curling: Sweden's title defence all but over after defeat by Germany  Milano Cortina 2026Edin Unsure of Olympic Curling Future  The Curling News",
    "published date": "Tue, 17 Feb 2026 21:11:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcGVxdU9FMkt6X09tU1hjVWY2RHlwUnFtTDl1Vkc0LXlCcDJlcUhTR19aVEJ0SmJFV0QzWEFOMlJLLVMyT1lmZXdVUTlxMmFQMVA2ZWhBT1F2WkY5M2x6OElkZlE1ZjNXMHRUNjFaNGpPU21iM1psNHdtbElINUc0cDFKRDVRSVVzanJkN3U5UUdWeU9SVERULQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thegrandslamofcurling.com",
      "title": "The Grand Slam of Curling"
    }
  },
  {
    "title": "The newest Olympic sport is bonkers - Boing Boing",
    "description": "The newest Olympic sport is bonkers  Boing BoingEverything you need to know about skimo, the sport making its debut at the Winter Olympics  CNNSki mountaineering is making its Winter Olympics debut at Milano Cortina 2026  The ConversationFrom nearly walking away to Olympic favorite: France's Emily Harrop and skimo's Winter Games debut  Toronto StarA part-time job and DJ gigs helped Lara Hamilton reach the Winter Olympics. Now she wants to put Australia on the map  The Guardian",
    "published date": "Tue, 17 Feb 2026 16:18:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1Yb2V6TlljdFJXWkxjMXp0Sk5NSHE1ZWZBS0JWdE94TW9rVkpFcFF4ODF4dkRFMWVlMGNxRDVXZWRWaFg4WFItd19PM2pwc0I2YmJiT2Y3cDM0UGZiWERYUVpvX211Y1JCZXhKd0JLZGFNclQ1MVAzYkpmRE8wcmPSAYQBQVVfeXFMT0hOUFJUYndwdDZXTjN2UFkxOVJnbTh4ZkM4UGl5VHpjczZENzU0c3ZMUkRpcDAyWjhsSkY0cnNRUERMYWdjc2xlbFYyeHhEZ2QtOXZoeUprS0RXZGdxYmZHb1BIaTAtcURCb2FGQVNqYVJOcGFjT1JibFoxd3BPVzJ0bk1p?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://boingboing.net",
      "title": "Boing Boing"
    }
  },
  {
    "title": "Craig Berube on Matthew Knies' recovery over the Leafs' winter break: \"He feels a lot better... It will help with the ailing thing he's had going on\" - Maple Leafs Hotstove",
    "description": "Craig Berube on Matthew Knies' recovery over the Leafs' winter break: \"He feels a lot better... It will help with the ailing thing he's had going on\"  Maple Leafs HotstoveMaple Leafs' Morgan Rielly 'good to go,' says Craig Berube  SportsnetFeschuk on Leafs holding their first practice since the Olympic break, if Leafs are well-positioned to make a playoff run and more  TSNDakota Joshua Recovers From Lacerated Kidney, When Will He Return To Maple Leafs Lineup?  The Hockey NewsMaple Leafs rule out injured Morgan Rielly vs. Flames and Oilers  St. Catharines Standard",
    "published date": "Tue, 17 Feb 2026 22:56:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOUzRGdFlyY1p0ejRGVWFsbENJenZGdTFPOGdzeDZlWnFtNWpIQ0xVdjI4NThWVENEMTJXWUU5YWRhR29fb0htckJnbDVRamV2VzNsb0M1aURBTmJIWmNjaW9OWko2bUdSNGhnY25QRDFOTWlzSjdUdmxGT0otbmVJcldvU29tTE1rVGtacFVPaEdIV3BvNzJFTUZ0aTgyRVpIZ3ppakpPVi1rVk5jM3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mapleleafshotstove.com",
      "title": "Maple Leafs Hotstove"
    }
  },
  {
    "title": "Toronto FC Acquire Defender Raheem Edwards - Toronto FC",
    "description": "Toronto FC Acquire Defender Raheem Edwards  Toronto FCToronto FC sign defender Raheem Edwards  MLSsoccer.comRaheem Edwards returns to Toronto FC after waiver claim from Red Bull New York  Waking The Red",
    "published date": "Tue, 17 Feb 2026 22:08:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFB0X2VEUWp2MXh2QmZWR3hLOG5qVk5UUWh6bklWcUpNNFNrOVFRVE5Eb2lMaWxBV0dibzE3ZnhjNGhXQWNWR25Ya08xcnlsQkJYZzhUWUFJMmhsUHZrMnpUZWVXeG5OVTlwekxCTDVfdllfMUtpZVlRUklTMFo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.torontofc.ca",
      "title": "Toronto FC"
    }
  },
  {
    "title": "Eileen Gu called a reporter's perspective 'ridiculous,' after being asked about winning 2 silver medals - Business Insider",
    "description": "Eileen Gu called a reporter's perspective 'ridiculous,' after being asked about winning 2 silver medals  Business InsiderVance questions US-born Eileen Gu's decision to ski for China in Olympics  USA TodayJD Vance insinuates American-born Eileen Gu should be representing U.S. at Olympics  The New York TimesFormer NBA player Enes Kanter Freedom calls Eileen Gu 'a traitor' for representing China at Olympics  Fox NewsEileen Gu Claims She Was 'Physically Assaulted' at Stanford for Competing for China  People.com",
    "published date": "Wed, 18 Feb 2026 13:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQRDlKTzVPc3g4VHBXaXFBbEVYU2lnRjVPT0tuYlJxQlg3eUMybG91eTE2VzBZT3lsUndXNTN2N3QtUXl5aEZqRXFxY0NqNm1VOFlodFItb2lZLTBUcHBjMjN0OXc4T3doMWlKQTVTLU1RYXdKM2szSl9fd24wUXZEc1JQOXYxYUowQkljMGVHUXRHcDZHOGQwOTVzSVFJa1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Canada's Sarault has earned $55K for her 3 medals so far. If she were Italian, it would be nearly 7 times that - CBC",
    "description": "Canada's Sarault has earned $55K for her 3 medals so far. If she were Italian, it would be nearly 7 times that  CBCHow much money Canadian Olympic medalists earn compared to other countries  Daily Hive VancouverCanadian Olympians cash in on social media  The Globe and Mail",
    "published date": "Tue, 17 Feb 2026 17:48:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPbE82X3VxazYyV3FrTzlUX0NpTWJ3eXh5V2JMeUNIZVVHemRFNWxoZjBWTWtnWkVpYXQ2alVRcmg3djNKTjN1cTRzMUtmZE5lNGpLNDM0Z252UkR3QmZnZDljczlnSnZGeWVvcGlKTmVrakZkT0pJMlR4UUZxdThULXZnX0pJSXNzT09RRHhjYmtyQ3d4MzRjMGYxMzJpbGgxLW8yWDFkSXBXTzRHVGhBMS1Ycm5ZVWpreUszT2t4Ml9JVm9zcTlWbUhnTWZPSERJZFhJZmxCNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Kalulu on Juventus collapse and Bastoni apology: ‘It’s a pity’ - Football Italia",
    "description": "Kalulu on Juventus collapse and Bastoni apology: ‘It’s a pity’  Football ItaliaGalatasaray stuns Juventus with four second-half goals in Champions League playoff  Sportsnet“We lacked courage” Locatelli explains Juventus’ loss in Istanbul  Yahoo Sports CanadaTurkish Club Galatasaray’s Shares Soar After Win Over Juventus  Bloomberg.comJonathan David to miss first leg of Juve’s Champions League play-off tie with Galatasaray  blackwhitereadallover.com",
    "published date": "Tue, 17 Feb 2026 21:25:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5jbEszREZVRF9Cdk41ZmswZUVSRElyNHNhQTQyYjYwcmhaVXBLelZZWjNDUHBWQzIzMm1uZUNXdk1nRzhVYVRFT18xb1JYeWY4bm00RTZ2dWhmZ0lHanRuWEVCZ3ZHUVZwWlhGOHRJY0F4YVk2c2t0OTdIVmTSAYIBQVVfeXFMTk4xRjRVSkE0b3Y2NHVlTDI0Mmd2X3RGRi1XMlQwVmJzQms5WjcwLWVOcGV0LU5pTFNXZ1FBRWxRSW5EOEdqUGxNUjR3NFFJVUZXSGRMcnFNNjRvV3BfcUp6blVkZXJtSzhSQXMtczV1SFNoaE5YRk5fdkpMOG5VU2lzUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://football-italia.net",
      "title": "Football Italia"
    }
  },
  {
    "title": "MLBPA Leader Tony Clark Resigns Due to Inappropriate Relationship With Sister-in-Law - Sports Illustrated",
    "description": "MLBPA Leader Tony Clark Resigns Due to Inappropriate Relationship With Sister-in-Law  Sports IllustratedTony Clark resigns as MLBPA director after internal inquiry  ESPNOlney on ramifications of Tony Clark’s resignation, if a lockout is imminent next offseason and more  TSNAs Tony Clark resigns as PA boss, Blue Jays reset their player-union representation  SportsnetTony Clark resigns as MLB players’ union head, source says  The Globe and Mail",
    "published date": "Tue, 17 Feb 2026 21:14:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNSUgwRUxLdlRvb0dXNUd1dG5Ccm9RbWluOGNoU2g3ckJ6QU91SlpBbDY2ZktuS3dWNTJIbEFKVlM1X011VHV2Zk1qQWpRTmVPU2stRndpRFd1eGxvclpyZDBiRkFNem9TS25aVjVZbmR6bE9BWDhSQ0tzQmIwQ0Z2YkR0UzVONTVpYWFLN29yNTlNX1p6NVFvelJ2M09wbWd1a2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Kyle Connor has fallen out of favor with the United States once again - Daily Faceoff",
    "description": "Kyle Connor has fallen out of favor with the United States once again  Daily FaceoffView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 20:31:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNZmxmUTdKdEplRHZ4RkRzOGQyUHplb05SLVBwdGxfT2hsWndfZTB5a2g5TDlBdHVFMDdBXzU2dEdEdnJObnhUdUpRVkY3UFZyQ0tnRzM1ZkJjUGQ4aDhsYjBqbE9mMmpBOXFnWG5DdlZKNlFOOHdqaHZhZGI0Ull6VUc2RkQ0UXFtMTVxTUJVXzlWQmQ3Ukx5R2ZyNm5QUGlvYTZ5UFpXN1pYbUZLMzZkbHlRRTJlRG1pSG1NRUFsOWw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailyfaceoff.com",
      "title": "Daily Faceoff"
    }
  },
  {
    "title": "Winter Olympics 2026: GB medal hopes still alive after double win over US - BBC",
    "description": "Winter Olympics 2026: GB medal hopes still alive after double win over US  BBCHow final two Olympic men's curling playoff spots will be determined  SportsnetGreat Britain remain in semi-final contention at Olympic Winter Games  World CurlingStaggering late win keeps alive GB semi-final hopes  Yahoo Sports CanadaU.S. women's curling misses first chance to clinch semifinals with loss to Great Britain  NBC Olympics",
    "published date": "Wed, 18 Feb 2026 11:20:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1GNWdIeTBTYjVodnZaUUNFTGdrYWVkUkxacVlRZTVkQVBmWjBCOGlQYWtsNzlmdUJacnM2Ukx1MXhvS3QwSDljekxVazM5U3F3ZzZBVmxzYTI5eDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "IRCC’s February processing times: Family sponsorship wait times drop, study and work permit applications spike - CIC News",
    "description": "IRCC’s February processing times: Family sponsorship wait times drop, study and work permit applications spike  CIC NewsCanada faces visa delays ahead of FIFA World Cup 2026  The Economic Times",
    "published date": "Tue, 17 Feb 2026 21:13:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPTWZPQVQ3RzJtNUc4TkdaVDhOd1BRUTlpTG9xelZIaG1HRk84dTRsY2xEZGo0S3oteGZQMWFXUTh6dFFLblowZ1cwYUNYd3hVYTFWQUJLTUo3cHlFazduUDI2QWw2UjM4UXJ1RWxZaDVzd0c4NEtCZzBVUVE4akstTTR4c3FoZmdGTU90ZzRWODVqX24xbHJTV0tfNjVMeXNSZ3EzVmplUGZYaEMxQTc4dXZZYXpQVndsVDdqTDlVLXZremM5aFF6Umk1NmRZQkZZa0F5OVNQNnhZSXR1QjZPVnhLVWIxeHfSAewBQVVfeXFMUGhFMEtmR1BFTjg4dlB6M3BfTnBJb3pMYnRqbk11NjFLZld6cmN1NU94Q3lqaXZUaHpyeHRNSDRyRlJEV3UwVHJZczItMjZUTzBWMWV3aHJ4ejVQRnVvNndadDhuaG1IeUhiNTVhWkxBTjZfNVBpSi1SRmg3U0x5WEtEMThSQzBuNDdZOUNDS0lyWGF5X0x3YVNkNllmYTVzZHVuZmpZNE1QOUdQTGZrcW9SSFlnUHdKME45aWZsTnJXMXo5ZFhmNmR3Y1JFYTVoVDBubG9jMHlGY0g5RjA0S2l4MFZNb2Zvb3J2cWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cicnews.com",
      "title": "CIC News"
    }
  },
  {
    "title": "The thank-you gift Lando Norris left in hotel room after F1 win - BBC",
    "description": "The thank-you gift Lando Norris left in hotel room after F1 win  BBCLando Norris’ handwritten note to his first coach is the sweetest detail from his title celebration  Yahoo Sports CanadaLando Norris says 'thank you' to childhood coach  BBC",
    "published date": "Tue, 17 Feb 2026 11:54:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1uNnBLSC1uZWhLZ2JRaE9DWVo2TFdPU2ZONTFqQmptdzA5NkxmeHRnaWlvQ2FCUTREdWtFUEt0Y29mdW0wNmN3bFJKZkJHdVJtUVVuZTZVUVdFQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "East Notes: Penguins, Laine, Flyers - Pro Hockey Rumors",
    "description": "East Notes: Penguins, Laine, Flyers  Pro Hockey RumorsPenguins Notebook: Hallander, Letang Return To Practice On Tuesday  The Hockey NewsHallander Returns to Practice with a New Perspective  NHL.comPenguins' Letang nearing return, Hallander back on ice  SportsnetWhat I’m seeing from the Penguins: Kris Letang healthy, Evgeni Malkin not talking  The New York Times",
    "published date": "Wed, 18 Feb 2026 00:07:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdTNFSWxGSVZ2OEN3TzYxSFQ3SUV1NkV2TE9GY0dZaHlSMDlTckxoYkNHRV9DQm9TeTAyVHBPcG1abGgwbVF6SjBWVFVwcGxDSjE5TlpuaERLSDBrWVhaanAtMFRobEYzSlpxTjhTa3NnYUZ6c0VSb0RGN0I2S1BrX3hpSQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.prohockeyrumors.com",
      "title": "Pro Hockey Rumors"
    }
  },
  {
    "title": "Lindsey Vonn's Sister Finds 'Silver Lining' In Her Ski Injury — And It's Funny - HuffPost",
    "description": "Lindsey Vonn's Sister Finds 'Silver Lining' In Her Ski Injury — And It's Funny  HuffPostWatch: Lindsey Vonn shares her journey home after Olympics crash  BBCHeartbroken Lindsey Vonn shares her dog Leo died the day after her horrific Olympic crash  National PostLindsey Vonn says Olympic injury 'more severe' than broken leg  USA TodayWinter Olympics 2026: Lindsey Vonn posts video of recovery after surgeries, says she's 'slowly coming back to life'  Yahoo Sports",
    "published date": "Tue, 17 Feb 2026 16:15:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQdWtHZmdqb084X25XSk5IRnl2WkZGZDNRdExJbmJQQnNVcUhxZzNsWnNNdHVMLXZKUmNqT1VfaWRFbDYwWFBiTUppQURjTHRFbGxBZEd4V1RuN3p6RWJ2SjVmempFR0lBa3pJQmhXM2RKR04yTnJHVU9yMU0ya3VKRE1BREF6X005SXEydVFJckZkOGxrZThoZU9DcjlDazdUR2d3R0FQLXd3VzdtdmfSAbMBQVVfeXFMTno0clhxSERHaTF1dzFkbTlmT3c4T2ZJWE9tc3BKRDE2WnV0TkpSOG1YY2tRNGVBWTFibHlST0x1MUZ6WHVvVk1kODJEdlR4WUxHWEItYW1Ldk5PYkhoaVYtcndhcjVGNllUUFI1RmRQNll6X0JUX25iSWdTODVzMEdiYjladWR1YV8xa05Xb2VSWFVQQVp4bFliSjRldGZ3ZGk5b3ptb2ZQT0wwOTJ5UHpzVzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Rave reviews at 2026 Olympics for youngest Edmonton Oilers centre - Edmonton Journal",
    "description": "Rave reviews at 2026 Olympics for youngest Edmonton Oilers centre  Edmonton JournalSamanski continues to make ‘big strides’ at Olympics with Team Germany  NHL.comRave review at 2026 Olympics for youngest Edmonton Oilers centre  Yahoo News CanadaJosh Samanski's Olympic Moment  The Hockey NewsShould Josh Samanski get a bigger opportunity in the NHL with the Oilers?  OilersNation",
    "published date": "Tue, 17 Feb 2026 17:02:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNb2ExX2RabHhGbmpkblczWGlXTm85RGVjSUd1cnhySzkzUWxGLXNkczFJcXVGWWl5Y0J0eWIwZFBzeXlPQ0lOeEhBSjI2ZDlRd010NWpVcHVhUExXQndzaE1vbVlTTmJTa3VBVTV3Y3FQN0VaZDlzdkVYT2VNbllLdDMyZXN6NkNkWlptcGp0UmQ0U18zYW16TElFMGtPZHh4Z3hxWDJaaFZQZnVETlNlbjBuWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://edmontonjournal.com",
      "title": "Edmonton Journal"
    }
  },
  {
    "title": "Simone Biles reaches out to Ilia Malinin at Winter Olympics 2026: “I went into protection mode” - Milano Cortina 2026",
    "description": "Simone Biles reaches out to Ilia Malinin at Winter Olympics 2026: “I went into protection mode”  Milano Cortina 2026Rosie DiManno: Wave of Winter Games athletes changing nationalities to chase glory — and Russia leads the way  Toronto StarMalinin meets Biles after Olympic heartbreak  Yahoo Sports CanadaWATCH — ‘Quad God’ Ilia Malinin falls and Canada is accused of cheating | videoclip | Kids News  CBCIlia Malinin admits he was not 'ready to handle' Olympic pressure  NBC News",
    "published date": "Tue, 17 Feb 2026 19:44:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOenZ5d0dEV0hKVDlqSUJreG0xNGxXNWloQ2txNTFEUFNVcUJqRExNenpCd1ZTaHd1TnRHcHZNOUtuQzYwMHdmSmJtNEcyREczS0VkNU01WVN3RUN4ZVlhU0daM00xLTJYUDl6OVNQRjE1MWplY1ZhYS1qaW9PQUJzaXdFZTJ4OWNoUDc1MDkxdlBlUmwyM0hhdFQwa3F1anFnWnZFRUtmWlBKdlQ5YU5qNk9JZmpuWDVjQ0pERExXcWxBcTVBcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.olympics.com",
      "title": "Milano Cortina 2026"
    }
  },
  {
    "title": "Tyreek Hill Released After Trade Buzz amid Injury, How Much Will Dolphins Save on Salary Cap? - Bleacher Report",
    "description": "Tyreek Hill Released After Trade Buzz amid Injury, How Much Will Dolphins Save on Salary Cap?  Bleacher ReportCould Pittsburgh Steelers Pursue Tyreek Hill?  Yahoo Sports CanadaJones recruits Hill to return to Chiefs after Dolphins release  theScore.comDolphins release WR Tyreek Hill in flurry of roster moves  ESPNNFL’s Personal Conduct Policy review of Tyreek Hill remains open  NBC Sports",
    "published date": "Tue, 17 Feb 2026 01:38:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQdjVfZDc4VlpOTnNEcGxaZzlLeE5xX05VVG5uekRvYi1CcW9vUkZwTWpPY3RELXNGQkRsZ1JZZ2FZVVBVbzB6U2MzbEMxaWRjaG52NkJfdTZMSDZzMG02X0QtRmhyUmNBVmJ6cnRwN3c3ejNQSDlWcFdUdzBrTXJicEhkR001d2dYbDZQMFRSTDNoWVVtZU0xeFJxNnRDbG9vNVVKSmszLURnTmlLRDlyQjB3c1F1bjFJYXk2LVhwdzZPZDRkcnhQUUhoUEZVdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "Heavy snow upends Olympic freestyle skiing, snowboard schedule - CBC",
    "description": "Heavy snow upends Olympic freestyle skiing, snowboard schedule  CBCView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 15:39:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOZy1FVDBYVF9QRTVka0pUN2xKWUN6dDRMSUIxWE1qQlJlcGR1QmFLd185R3REc2J0RWdjbzVJVzhNQThOQ0tOLUZ0ZGIyUjBIelQ5RWVQcXZ2cWxITnA3Y3ExSU1nOThSUVlfVlVITmZhZzc1QnpYbDE5emcyRjBvNnYtOWp3cVhKYUU4MUhNdlpmSll6TlZZdVk3NHVDTWg1Sm1ndVVWLWUxdklDZjFOV2JXQWYxd09qOTZITm13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Sharks, Jeff Skinner Terminate Contract - Pro Hockey Rumors",
    "description": "Sharks, Jeff Skinner Terminate Contract  Pro Hockey RumorsJeff Skinner clears waivers, two others waived  SportsnetDon't Look Now, Former Oiler Back On The UFA Market  The Hockey NewsVeteran Skinner clears waivers; now free to sign with any team  TSNSharks place Jeff Skinner on unconditional waivers to terminate contract  Daily Faceoff",
    "published date": "Tue, 17 Feb 2026 21:52:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMU5Nak5kMkpDNjQ1dFpiWDlPSHNMc29DTXVxVGhYVVkteGxoVkxrUXZPbGtueVBHMHdHUFV0MzNzUzNGUTFfMFo1X2ltemp5X3RDRmRRdkk3S045cnhoZEVYVzNpM0VDZjNoSG5XbW1NVnZDUWp6aEpXMFAtbmIxN1VqUFJXS1JneHlrVUFIQ0Z1SjN0OXdGUlBEUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.prohockeyrumors.com",
      "title": "Pro Hockey Rumors"
    }
  },
  {
    "title": "Italy Megastar On Inter Milan 3-2 Juventus Controversy: “I Made A Mistake, I’ve Noticed A Lot Of Hypocrisy & Moralism” - SempreInter.com",
    "description": "Italy Megastar On Inter Milan 3-2 Juventus Controversy: “I Made A Mistake, I’ve Noticed A Lot Of Hypocrisy & Moralism”  SempreInter.comInter Milan Superstar Apologizes Derby d’Italia Dive: Shows No Mercy for Moralists & Hypocrites  Yahoo Sports CanadaInter-Juventus ruined by bad ref call; Liverpool keep improving  ESPNSerie A referee La Penna told to stay at home by police after dozens of death threats  The GuardianInter Milan's Bastoni admits exaggerating contact with Juventus' Kalulu  Sportsnet",
    "published date": "Tue, 17 Feb 2026 18:55:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQRTBRbXpmMHZQb3ZkQU1jcWV5OHE1aWFYYnRpZXN0TENfTS0wWkhqMjNEOXdoVnE0U0ltQ3VfZzM3T1VRb2FhUE8taXMwT3FHeGJGcmlzQUR6cXptSDZwRTM1WE91X0JxbGY0ZmlBMmZ6dTBaVTJvZUJRMXBSLU1NRVROY01JX09lajNXTWIxSEU5YVFOclpCZjIxeDN5Rm9E0gGmAUFVX3lxTE5tWVgwRlB3MC1MQWdUV3VwR056WTkwOHc3QUFYREEzSUhnRFcyTGY1MWFvdHVzMVBPME1BYUpONmxhM3dGazQyWUVkRmNDVFVaak56NnYwUVl2bnhCdkpYb0JYNG55TW1yUlFoeml6cHNZVXpJTW9IWm03WG1xRlBEQkJxb29oZFpkQmxrSUxNeFpkN3JwUnBfWXhtYnAwcy1JcEgwUkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://sempreinter.com",
      "title": "SempreInter.com"
    }
  },
  {
    "title": "IceHogs’ Berezhnoy, Firebirds’ Goyette suspended for violating terms of PESP | TheAHL.com - The American Hockey League",
    "description": "IceHogs’ Berezhnoy, Firebirds’ Goyette suspended for violating terms of PESP | TheAHL.com  The American Hockey LeagueTwo AHL players suspended for 20 games  SportsnetKraken prospect Goyette suspended 20 games for PED violation  TSNBlackhawks News: Stanislav Berezhnoy Suspended, A Special Event Is Coming  The Hockey NewsFormer Sudbury Wolves star David Goyette suspended for 20 games by AHL  Sudbury Star",
    "published date": "Tue, 17 Feb 2026 17:00:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBaN0lVVGtsbGFBeTRlQXdfWmwyeWNVTlZNMEFHdUN0TUR2REVzeEpqWENmRUM4U0ZmMnpUT0xud1RYaDAyenNRMXZzUU1ndGdxbTk3eWhfUlo3RkE0aEJLWERQZEItTGVTVjZJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theahl.com",
      "title": "The American Hockey League"
    }
  },
  {
    "title": "Crosby gifts Team France goalie stick after matchup at 2026 Olympics - NHL.com",
    "description": "Crosby gifts Team France goalie stick after matchup at 2026 Olympics  NHL.comView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 20:50:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQX1BsaG5wZUtSWi1feFZ1R24zUXJ1SFVqc29TS3hnUlhkRmhERFQ2RktHRkZzR2N5aXd6ZEVmdk1UWHhKZ2JfZFhaWVVkMGlvUkd5SlZZMXUxRGxCcWVTeWs4aEUyRGQtekpQU3ZEN0FQYjRJcm9PUkYyUTBnbUNiOW5IVVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Team Sweden head coach doesn't hold back on Elias Pettersson’s Olympic performance so far - canucksdaily.com",
    "description": "Team Sweden head coach doesn't hold back on Elias Pettersson’s Olympic performance so far  canucksdaily.comSlovakia earns the biggest defeat in its hockey history: ‘The best loss of my life’ - The Athletic  The New York TimesHow Slovakia's last-minute stunner flipped Olympic tournament  SportsnetOlympics 2026 men's hockey: Standings, stats, schedule, more  ESPN\"You Win The Hockey Game, But It Feels Like A Loss\" Jacob Markstrom After Sweden's 5-3 Win  The Hockey News",
    "published date": "Mon, 16 Feb 2026 21:12:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPTEpBbDdmNDRzelNvcWM0V2pvN1VpMmM0b1lUVWdhb2diUU10b3Fmd25lcjh1WDY3bC1nMldveFpWQ1lqQVFzWUNJeW1QTUpQbE54NDJJb3JCWmd0U3VVNWRsTUlSLWxmRGNlYVI3SDFCd3RWVG44ZmVBeE44WjhxTk9ILVZJMXllaFlYSzg4SlVBTlNqT2FKeGltTHJva1hiWXc0RVJ2TjRXU2VXcXNwNkdNZVgzMWhCLVR3ZkVjcEZKMW5OMFZ2SF8xUE5MX1cwVUhXX2VQcUs1MWNlSWh5cQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.canucksdaily.com",
      "title": "canucksdaily.com"
    }
  },
  {
    "title": "Ryder Cup captaincy: Tiger Woods has been asked by PGA, but no decision yet - Golf Channel",
    "description": "Ryder Cup captaincy: Tiger Woods has been asked by PGA, but no decision yet  Golf ChannelTiger Woods isn't ruling out return to Masters, Ryder Cup captaincy uncertain  SportsnetTiger Woods teases Masters comeback (plus 5 other reveals)  GOLF.comTiger Woods leaves door open for sensational Masters return after injury hell  Yahoo Sports CanadaTiger Woods weighs offer to captain 2027 US Ryder Cup team  The Guardian",
    "published date": "Tue, 17 Feb 2026 19:09:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQNTNmMzRwXzBnOU9iN00tVlM0ck8yeENmZHBraUxGNFp0aDFaNEQ5R3JDRnFscFlERjM4ZWVGblF6R3dMUUVsemJ5R21WUS05OWFRZC1XTDl2X1A5SktURTdSWU1ucGllVTFXeFJSMEhFbDY0SEFiM25VVVlqNmFnQ3EwVU5CdkpLeHctazdESHBuS3BTS2tBVjV5UEllb2R2LUdZLUNRU2lrNFlKQVFYT1ZfbXNFUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.golfchannel.com",
      "title": "Golf Channel"
    }
  },
  {
    "title": "Ronda Rousey vs. Gina Carano to headline MMA event in May - Sportsnet",
    "description": "Ronda Rousey vs. Gina Carano to headline MMA event in May  SportsnetRonda Rousey, Gina Carano will end their MMA retirements and fight each other in May  CP24MMA legends Ronda Rousey, Gina Carano land Netflix fight. Here's when  Yahoo Sports CanadaGina Carano’s coach says she’s ‘taking it very serious’ getting ready for Ronda Rousey: ‘This isn’t just a cash grab’  MMA FightingRonda Rousey brought Gina Carano fight to Dana White: It didn't exactly work out'  MMA Junkie",
    "published date": "Tue, 17 Feb 2026 16:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNbEVTQ094ZkUtVENQNmhyQlF5T3h0RFBDUF85aHExTmxfaUFJMFJtbFdrUEpDY3BXMjEzTXFWenBpakEzNl9WSkhTUnBBbmZwSlFKTWJGOXZ1RjRCTzZjcmVZYjJHbHdFOU0tMXl6ME40b2VWVlZhUlNYdmRRLWN3WXdINU8tVk11VmtiS1ZSbklNQmZsbklsQU9B?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Uhhh, So Here's How Jordan Stolz Gets His GINORMOUS Thighs - BuzzFeed",
    "description": "Uhhh, So Here's How Jordan Stolz Gets His GINORMOUS Thighs  BuzzFeedJordan Stolz began skating on a frozen pond in Wisconsin. He seeks a 3rd Olympic gold Thursday  Toronto StarJordan Stolz calmly looks ahead to trying to win a 3rd Olympic speedskating gold  Associated Press NewsWhen does Jordan Stolz race again? Next event, schedule  Milwaukee Journal SentinelAmerican Jordan Stolz wins 2nd speedskating gold at Olympics  ESPN",
    "published date": "Tue, 17 Feb 2026 19:24:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE4xNmRZRWxFUGhwZmVtN1BnUWIydDVZVm9zVlBqUFNRVjA1V0J0MzFyMkdSMXJ5SE9oRjRmcXJjeUdLWEtMQmJzQnVvTlJZa0dBWHI2LWNHeFNNNDFCdFFFZmlibUI3UG9s?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Italy Taunts U.S. In Oh-So-Familiar Style After Winning Speedskating Team Event - HuffPost",
    "description": "Italy Taunts U.S. In Oh-So-Familiar Style After Winning Speedskating Team Event  HuffPostItalian speedskater Giovannini uses Curry’s ‘Night night’ after Olympic upset of US  TSNUS speed skaters react to Italians' taunt after race for gold  USA TodayCanadian speedskaters Maltais, Blondin, Weidemann win Olympic gold in team pursuit  CP24Canada strikes gold again in women’s team pursuit, climbs to 12 medals at Olympics  Times Colonist",
    "published date": "Tue, 17 Feb 2026 18:50:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPWXppQy1pZVd3MUtQejl2TFNfWUhGa3Z2ZHhzaF9zRV9lZnVPZmZ0RUNMb0t4cmd5Q0JJWWJKYjZCWC1XLWxEU3ZRNEZ6NFZ4LXZ2TDRrcDMtVkdkOV9NNWVWdlFGZDRhYXpfVWhJWkJvbVVYSGlLUkV4bTdFX0UtaEFTQVlTbVM1YTdkV0VMeElLUXJrZDZZb3JCcGFYaWVmUFlvUW1nWnE2d3BfWEFBTzg1cFTSAboBQVVfeXFMUFY5NEFZTTExcEhock9rTHFMbWczbkNOWWwwT1JzRGdLNmg0Q3Y1UjVvWVhLLU91dEZSVjEwLVJxTDNWM0lDNGhSNDg0YnNxcWJzYnVMeXAxei1Jc2YtQWZZY21TZFFUb2phU2xnZUh2bkFxMjVxRjdLdURMVk83X1prcFF3enhBdVRCV2NaRVVldmFVbEpLakM1a3hnMERlNHpqeEZrTlhPTlFfRV9hNFpnSnppaEVObDZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "Slafkovsky the story of men’s Olympic hockey so far - TSN",
    "description": "Slafkovsky the story of men’s Olympic hockey so far  TSNTeam Slovakia Olympic Hockey Line Combinations & Roster 2026  Daily FaceoffSlafkovsky 'more mature as a player' for Slovakia at Olympics, Gaborik says  NHL.comCanadiens standout Juraj Slafkovsky leads Slovakia in upset win over 2022 Olympic hockey champions  CBCJuraj Slafkovský has resurrected Slovak hockey, but is success sustainable? - The Athletic  The New York Times",
    "published date": "Tue, 17 Feb 2026 14:25:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNLThBRE1iaEYtLWIwaFk0VUhRRDBVRW5od2x1dFJfcWowNjJlT2NwRThlUGcySjBPel82TnBmOGo2c2w4bEoyRVAzamlhUjJkZ2ltNW1wbG8wbFduamJFWlJxYkZBbWpIMmNfX1pCTy1id1B3T1o4YjB4S2h4Q3NXQkRtZVhxVUtJYVhrVjZkejE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Winter Olympics 2026: Kirsty Muir fourth in freestyle skiing big air - BBC",
    "description": "Winter Olympics 2026: Kirsty Muir fourth in freestyle skiing big air  BBCView Full Coverage on Google News",
    "published date": "Mon, 16 Feb 2026 21:02:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTFBVSHl4VHVQQTg0QV9HdmRjTWZwemlMdTA1al9wa1A0Ykw2UGpkYU04elYyZFY2dlBOemFrNTJuOG1TMXlvZ1RXTXFGYTlvNkUxeHlIR0xINE1xcTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Seth Jarvis' buddies are trying to link up NHL star with Canadian Olympian that's obsessed with him - Daily Hive Vancouver",
    "description": "Seth Jarvis' buddies are trying to link up NHL star with Canadian Olympian that's obsessed with him  Daily Hive VancouverJarvis' buddies cheer on Canada forward at 2026 Olympics  NHL.com‘You’re cheering for your best friend’: Winnipeggers travel to see Seth Jarvis chase Olympic hockey gold  Winnipeg Free Press‘A lot of excitement’: Winnipeggers head to Italy to watch friend Seth Jarvis in Olympics  CP24From viral excitement to airline help, Seth Jarvis is a very popular man in Italy  Cardiac Cane",
    "published date": "Tue, 17 Feb 2026 16:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOSzVFRE11YmZ4MklOZlFURkh6bTdzcGtxN0lfRFJUaGZGN3dqTDBrTk5LbDFRTXhaLVp0SHlQRVhjZEU5WTdwLVJOVkdia1dvSGxpZ29ZX241UGI2RTB0Q0hzLVpQQ1o5WThNbk0zRDNVNzRCdzJYV05HbzZmU2VyVVk1bWRCV3loTmZZaVZtRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Italy and USA put focus on fair play at Milano Cortina 2026 - The Grand Slam of Curling",
    "description": "Italy and USA put focus on fair play at Milano Cortina 2026  The Grand Slam of CurlingUSA women's curling loses to previously winless Italy  NBC OlympicsItaly win first round robin game in front of home crowd at Olympic Winter Games  World CurlingItaly make it two straight in front of hometown crowd  CurlingZone",
    "published date": "Tue, 17 Feb 2026 01:10:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOUGJQQkVFZjF0NTk3aHRpUGZxOGdfdTBNc28wUjFvT3o5cW1wdV9abHFOOXM3TGRDeW5NYmstaUNQbnp4aWNmYkxTbVpJY1RKWWFYTVJUY0lLRVF4YV81M0JBQ21CelVCNVpKVWVQeVEzbkIwcTlfV3hKUVJWbVlZWUJiVkRRZjA2bmhUYnk3RFFvY3VDd2RFZTE3eDU5a0hpRTVHXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thegrandslamofcurling.com",
      "title": "The Grand Slam of Curling"
    }
  },
  {
    "title": "Which men’s curling teams remain playoff eligible at Winter Olympics? - The Grand Slam of Curling",
    "description": "Which men’s curling teams remain playoff eligible at Winter Olympics?  The Grand Slam of CurlingA look at the curling standings after Tuesday's play in Cortina  NBC OlympicsChina with clinical performance to take down hosts Italy  CurlingZoneA look at the curling standings after Sunday's play in Cortina  NBC OlympicsChecking in with women's curling action at Milano Cortina 2026  The Grand Slam of Curling",
    "published date": "Tue, 17 Feb 2026 21:41:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxORG9obldVdGVHYnE0OThfbURjVmMwd2lTM1dEN0dWSmM3d2hseC1RQkZlSzRPU3VQeE9Mb2gyX2xxaWEzUXp2NWhYZ0QxWnc1WmJFM0NXaDJEaF9uRUNXdHNPSWtWRUdFWTRnOTJUNU5mVzYxRkhTUktodHJ1QjYyYVp3VU03bTl1bC1NajhSNUl4cmZtYmloVGhSeHE5cVJYYWdydVhR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thegrandslamofcurling.com",
      "title": "The Grand Slam of Curling"
    }
  }
]