[
  {
    "title": "World skiing body FIS aims to quash penis-enlargement sideshow - CBC",
    "description": "World skiing body FIS aims to quash penis-enlargement sideshow  CBCNew ski jumping controversy emerges at Milano Cortina 2026  Sportsnet‘Penisgate’ at the Olympics: why inject acid into your penis, and what are the health risks?  The GuardianAre ski jumpers enhancing their penises to fly further? WADA is ready to investigate - The Athletic  The New York TimesNo penis-related news matters until it happens at the Olympics  The Globe and Mail",
    "published date": "Fri, 06 Feb 2026 16:46:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPM2tjR1d6dkp3VXlubkg3VFpReTBMeVlubndiYjVtbENDVHJHSzlqUFBCM3ZKWElLWUV1N0kyLUlUcGJBZjdXUjUzbHBZTnJ4VnVVVmVWS1RyckU1a21Ray1GcmxoaVBCUkZTcTMwZmFLYnJhV2F0dE02bW5aNXhRM0I5MG5RME1ybUE3MzkzUnFjN1pjTm5V?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "‘Boots on the Ice’: Hockey and politics are about to collide at the Milan Olympics - The Globe and Mail",
    "description": "‘Boots on the Ice’: Hockey and politics are about to collide at the Milan Olympics  The Globe and Mail'Do you guys know where the USA building is?': Team Canada's Maddie Schizas pokes fun at giant Team USA sign in Olympic Village  Yahoo News Canada9 seconds, 3 fights: an unforgettable moment in the Canada-U.S. hockey rivalry  CBCJon Hamm and Auston Matthews prove that Team USA is terrified of Team Canada  Toronto LifeKnight, Poulin face off for 5th and perhaps last Winter Games  theScore.com",
    "published date": "Fri, 06 Feb 2026 02:28:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNODlSYjBSSG4xRUZUcEVyQTVQMEF4QnVoMWhKYVVJVU9sNnhhZkNPaVQzTkFIZFlNZTNfU1d4bFRHdlpOTUNEbDBwZl9JdjU4MmM5TGlfb1k4amFRaHQ5RWNPd3VudVNWRU05ZmU1bXZyQUdBRmpkYVRPRTd4UWo0aFB1VnB2ZjB5ZUtQTEhSOFdNUkh6Mzd3UWczbmI0M3ZCS0hWdHI3U0FPNFlQYmJNTFREMmZNaWV0SXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Blue Jays icon Buck Martinez retires - Sportsnet",
    "description": "Blue Jays icon Buck Martinez retires  SportsnetBlue Jays broadcaster Martinez announces retirement  TSNVeteran Blue Jays broadcaster Buck Martinez retiring  The Globe and MailCommentator, former Blue Jays catcher Buck Martinez announces retirement  CBCLong Time Blue Jays Broadcaster Announces Retirement  VOCM",
    "published date": "Fri, 06 Feb 2026 15:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFByZ1dPbmVTTmRyaWlwdU1CV3g5VHYyR3NOZ0xYRDE4RzJxQktWSVA2bTI1cXB4eTA3Z2o2TXBrbEZrdl9CS1FjWV8zaEx2LU8xY0dsQXBWQ1E5OWphYlVmMmZXUzZCYmJBOURZVEp2VkpaVU9JRzItaW5qQ1FSZDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "The opening ceremony for the Milan Cortina Winter Olympics is today - CTV News",
    "description": "The opening ceremony for the Milan Cortina Winter Olympics is today  CTV News2026 Olympic Games: Milano Cortina opening ceremony is less than an hour away  CBC2026 Winter Olympics Live Updates: Opening Ceremony Will Formally Kick Off Milan Games  The New York TimesMilano Cortina 2026: Day 0 Olympic events to watch, full schedule  SportsnetThe Winter Olympics opening ceremony is here and how ICE agents are scanning people's faces: Morning Rundown  NBC News",
    "published date": "Fri, 06 Feb 2026 10:54:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPeVM4OUtZeFlrV2xqalVEUUdSZ0xrZjVpZHctRnVrS01hQlVGSVZvaEtSWktyVUN0YWpVRXMtQTBld1NlY0RaQkJjX1Q2c3l4SXRRc3VVQW81Zjkyc2o5V000cFNHRElMQjRNZDFWNm1TWWMxeGZOZHVFOGdDV1R0c1pyMThXYXZzcmliUnpxdmlTcUVkN20yTTIxNjRpamRRT3QzZi1NUElDQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Panarin says trade to Kings was 'perfect timing' ahead of Olympic break - NHL.com",
    "description": "Panarin says trade to Kings was 'perfect timing' ahead of Olympic break  NHL.com32 Thoughts: How Artemi Panarin ended up with the Los Angeles Kings  SportsnetInsider Trading: How the Panarin trade came together ahead of the roster freeze  TSNFantasy hockey impact of Artemi Panarin trade: Which Kings, Rangers will benefit?  ESPNHow will Artemi Panarin impact the Kings?  Daily Faceoff",
    "published date": "Fri, 06 Feb 2026 02:42:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOLUVMeW1FRXBFdzNsMkFieEg0Y3NJbGM2MHh3NzJibEpVdHZOTGlBU2JPemxCMWpZMXFfQm9EdURSTVVORjU2R1ZnMEFfTktfeWhFaVdlUHc1SUVVd3hlTEN6eWZnT2FkWUxFcWJScnlJcTR4RGxwMzU4THNPLVdfU1lLX0lMNHVvV0ZDYlZjZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Americans hand Canada's Peterman, Gallant 1st loss in Olympic mixed doubles curling - CBC",
    "description": "Americans hand Canada's Peterman, Gallant 1st loss in Olympic mixed doubles curling  CBCFirst loss in mixed-doubles curling, figure skating team sits fifth at Winter Games  CTV NewsCatching up with the electric mixed doubles curling action at Milano Cortina 2026  The Grand Slam of CurlingCanada sits fifth in figure skating team event after first day  The Globe and MailUnited States of America open with a two win day at Olympic Winter Games  World Curling",
    "published date": "Fri, 06 Feb 2026 13:27:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQWTJ4Y21hdENMczlJSDVKX3NOSElwd3BoNHNtQVVIT2RHaVZZZTZObkVYZFZreGI4MnFIczNDdnBmMERuVXZ0cVRuRzNiZk5QVVByUjNHd0lBa0hqNzlQVEw4MlpCVlJjVDZOeExlbS1hRzNuMUFvR1EwUkJVcnBvWHlUNnRMYS1PaTNMR0lPWXR2V1laTmpkR0taRXpDVWNPUXAtRG1TV0d2cjJwY0lqdTFvN25vbVFhd1pwNjJRYmh1T0swOWxpSm5fRQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Baseball Canada announces 2026 World Baseball Classic roster - Baseball Canada",
    "description": "Baseball Canada announces 2026 World Baseball Classic roster  Baseball CanadaCanada rolls out promising roster for 2026 World Baseball Classic  SportsnetToronto Blue Jays to send 12 players to World Baseball Classic in March  TSNWho Do You Think Will Win the WBC?  Yahoo SportsReigning MVPs, Cy Youngs among 78 All-Stars on Classic rosters  mlb.com",
    "published date": "Fri, 06 Feb 2026 01:23:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNOXJJYU1fQmdBUUpIZlEwa2twMkNMbkpvUF95cmI4UTdDTHgzenRxQjB1elZhMWhXME90czVKRFVrU1VZYVRRN3I1NEZGQzQwUUV6STFaSHVjM21Nd01RVEQtSkNNRGgweVIwSjhRT09ycVhJUVN3TU1wa09OeUJnZTBDd1p3VDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://baseball.ca",
      "title": "Baseball Canada"
    }
  },
  {
    "title": "Jarvis replaces Point for Team Canada at Winter Olympics - ESPN",
    "description": "Jarvis replaces Point for Team Canada at Winter Olympics  ESPNPoint out for Olympics, replaced by Jarvis on Team Canada  NHL.comFrom Naptime To Prime Time: How One Phone Call Changed Everything For Newly Olympic Bound Seth Jarvis  The Hockey NewsAnother change for men's hockey team, and what to watch on Friday  CBCWinnipeg’s Seth Jarvis joins Canada’s Olympic men’s hockey team as Mark Scheifele gets passed over again  Global News",
    "published date": "Thu, 05 Feb 2026 22:20:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUzZrNW12dkxyRHFJSWsyTHBWVVdXZl9Ma0gtRzJYR1hQNDlRbHBIbkZNYXZVdHFuSUl4NThCdnpWVk9jc1lLeGRoajlrSTdmUFNyY3dkSTFmM1MxbkM1YkI1NDRmb2huVjg1eWExMl8xMEVSaEJybkE2b1g3cS1UUncwR3hDUEVSeTdRY1RldS1QNWwyOWRsei1wUTh3QUhwVm8ycUNqLUx6UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.espn.com",
      "title": "ESPN"
    }
  },
  {
    "title": "Dented Canadian team gears up to chase gold in Milan Cortina Winter Olympics - TSN",
    "description": "Dented Canadian team gears up to chase gold in Milan Cortina Winter Olympics  TSN206 athletes to represent Team Canada at the Milano Cortina 2026 Olympic Winter Games  Team CanadaFive things to watch at Milan Cortina Games on Saturday, Feb. 7  TSNSix local athletes in Italy for Winter Olympics  Prince George CitizenOpinion | Meet Hamilton-area Olympians competing in Milan  The Spec",
    "published date": "Thu, 05 Feb 2026 16:32:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOMDlhbUxaTVhmV1FXSTBBZWduZXNwUUlaOTItLXM5dXZRQ0REWXFsQU1aT0VkMU5PRTNlUzdsNkZ0WERHQllobm5KQ3RIem9fSmJaNXB1ZmJ2ZC1aZXZ1bWY5bTMzQW82VlhBdDRlX201ZlgtMTZFVmZ2ZUtUNXBRdWhUMjlBd0xwLUZleW5jZ0t6SlZBMURyMXg1UmtGOXFOUmZFemthTmdWdkxmRHl5aVhqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Raptors' direction remains steady after quiet trade deadline - Sportsnet",
    "description": "Raptors' direction remains steady after quiet trade deadline  SportsnetRaptors GM Webster on team’s quiet deadline: ‘Price got a little too rich for us’  TSNDonnovan Bennet breaks down the the NBA trade deadline for the Raptors  CBCRaptors avoid luxury tax, add depth at centre  Global NewsThe Raptors finally stopped chasing their tail at the NBA trade deadline  The New York Times",
    "published date": "Fri, 06 Feb 2026 16:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQUDNick55a19BTTQ3OG5aV0ZZVmVyd01jODRISjc0MTNOeHBiaDV0Q3JBSnN4VDhjb1pjUkxVcVFvTzNTYksxRndpTGNXMGpVS1JxMUFadlNiSmU0T1JLTzRhY25wWjc3cmFHTzBZRHlnLUI0OF82YWVKMEV1bDR0N2F6dDRBZzBHV3E5bUhnb2VyM3NmTHFUZkcyVUx3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Super Bowl LX: Seahawks-Patriots matchup preview, prediction - TSN",
    "description": "Super Bowl LX: Seahawks-Patriots matchup preview, prediction  TSNSuper Bowl LX ultimate game day guide: snacks, schedule, and DAZN streaming options  DAZNKeys to victory for Patriots against Seahawks in Super Bowl LX  Sportsnet2026 Super Bowl 10 best Super Bowl picks, prop bets from proven model  CBS SportsThe factors that will decide the Super Bowl: a brilliant receiver, pass protection and explosive plays  The Guardian",
    "published date": "Thu, 05 Feb 2026 13:05:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQUXRWMWpsQVlzMnozaWwwM3NtUHJmUURTUXQydGM2N3pOV0JpNWc2SjVUN2djN0JPcHdIdDlUdjhGYTNUb1VScUlkMkg0OXNSRmNoOGxCSmdDQU8tU3VkdmxlU0tudHBxdHhNZVNTdzlVU2FwLS1mQzhERmFSSDg2ZVp5ZGhIbjFTa0Z1M1UyVnVqbVRKdEJrbmxQOE13NWRFZXM3eQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tsn.ca",
      "title": "TSN"
    }
  },
  {
    "title": "Dark horse to medal in men’s hockey at the Olympics? NHL players make their picks - The New York Times",
    "description": "Dark horse to medal in men’s hockey at the Olympics? NHL players make their picks  The New York TimesFantasy top 10 sleepers for Olympic Winter Games Milano Cortina 2026  NHL.comFriday Four: Which players have the most to prove at the Olympics?  SportsnetFrom The Archive: Gold Diggers  Yahoo Sports CanadaCounty park library to close for two days amid major renovation  The Spec",
    "published date": "Fri, 06 Feb 2026 13:18:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOaGVWdXBiN01JdkFxVGhPNURFbzhrcjZOU0JHR2d4U1NsbzdnN3lrdmppNm5vRktEaGRpYnhzQnlXcThhaWNZeVBFSHAtYmRyalg5QTduM1puZklpZDBWUHQtNGVLeFpvNEdGMEpDT185dkE4QXFVYXoyd1Z3WEJUTmxORy1PY01JTnBGOXBZX2FrLTlzWE5FQUpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "It sounds like change is coming in Edmonton Oilers coaching staff - Edmonton Journal",
    "description": "It sounds like change is coming in Edmonton Oilers coaching staff  Edmonton JournalDraisaitl sounds off on skidding Oilers: ‘It starts with coaches... our leaders can be better’  TSN‘It starts at the top, we can be better:’ Oilers’ Draisaitl reacts to team’s recent struggles  Daily FaceoffThe Oilers' Third Consecutive Loss: Welcome to the Break, Edmonton  The Hockey NewsOilers Thoughts: Draisaitl’s passionate interview highlights his leadership, Kapanen’s momentum, Mangiapane’s first-period fire, and Jarry’s accountability  OilersNation",
    "published date": "Fri, 06 Feb 2026 01:50:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPS3B2MGRldDRLeWtaM0ZDWkJXVVFRNFRFb2tqZXNxdkZ6RHd2M2dFb1ZfaXBpeGdOYWNCNUZmcWdKblNvbU1GczUyTC1wdEVaSWZJV1dMTFZQSW9uNzFKSTY0Z19FbUYzOVBrUDdwZFNDN2l6cHhXZTFMbUpsN3d1ck9XRk1Dd0dJb215YUJsbms5QkYteFk3eG12U0VMQ0RmanM0SzQteXNWNERxUHNlWS1odTNyaHAwNU9zdjl6S1pVUlg5TWhR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://edmontonjournal.com",
      "title": "Edmonton Journal"
    }
  },
  {
    "title": "Canada's Mark McMorris stretchered off hill after fall in pre-Olympic snowboard training - CBC",
    "description": "Canada's Mark McMorris stretchered off hill after fall in pre-Olympic snowboard training  CBCCanadian snowboarder Mark McMorris will miss Olympic big air competition after training crash  CBCInjured Canadian snowboarder Mark McMorris drops out of Olympic big air event  SportsnetSask. snowboarder Mark McMorris won’t compete in big air event Thursday after crash  650 CKOMCanadian snowboarder Mark McMorris is hurt, but Olympians are 'no strangers to this'  National Post",
    "published date": "Wed, 04 Feb 2026 22:35:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPWFNMSjRTNnlWaGRCWXIyRmlGTThGLWZBdGZvZl9MV3BGMWRzYWc3aldKa056WjJTeDlibEU5RW81bFlPT2Z1RDZ3MW5GTDVJbUhqM1NuTTdLZ09FWGJYMlByTkJ6S3NNbW5NcXJGeWUxLUd3VjRwelpBUUZYTTdDRldTdXRNTFJnNUpSeVVvNU5XNDAzeUtDTTQ5SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Amid rising political tensions, will there be controversy at the Olympics? - Global News",
    "description": "Amid rising political tensions, will there be controversy at the Olympics?  Global NewsAt Milan-Cortina 2026, avoiding politics becomes an Olympic sport  National Post‘Everything about it is inherently political’: Sports historian unpacks the ties between The Olympics and geopolitics  CTV NewsWelcome to new cold war as world descends on Italy amid global political chaos | Winter Olympics 2026  The GuardianThe Olympics Are a Show Of Global Harmony. The World is Anything But.  The New York Times",
    "published date": "Thu, 05 Feb 2026 20:17:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPSEJxNjgtR3lCV2V5WmpmLXRtVjEtQ2pONnBlN05IQTAtdF9mMUhnV1NFSmlMcWx4TDJUUDNuaDZrU2xxN1hmVy1SVEx3eEVyZ1FabWVTMXNPU19HaXJHd1VTelRUWmdKOHlKWkhxUTVMSlV3Y2d2NTZuV1Z4ZHprV0tSQUdscU9U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ramblings: Dubois Returns; Huberdeau Surgery; 200-Game Forwards in Brink, Benson, and Holtz – February 6 - DobberHockey",
    "description": "Ramblings: Dubois Returns; Huberdeau Surgery; 200-Game Forwards in Brink, Benson, and Holtz – February 6  DobberHockeyThompson sharp in return to Capitals, ready for Olympics with Canada  NHL.comDubois scores in season debut as Capitals beat Predators  TSNNHL Roundup: Capitals top Predators ahead of Olympic break  SportsnetThompson, Dubois return from injury to lift Caps past Preds before break  ESPN",
    "published date": "Fri, 06 Feb 2026 07:02:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOM0xzaVozN1Z5MmVnT2NyV0ZpbGFfSDZkRlpPODVRTEc3MkU2OFRiUXJaUWxFc0JNUW9GbVFJemZGSFhURHQ4emVSNnNWUVVHTkhEaWpwWE1MTGRvTnNTazRqdF81WlVmUk9MdUx6TUlsdEt6SDFEQ1VnQ2ZnTjlSX1ViYUhmX0NucGVESV9ZeENhTjJFR3BqbmpicDJRZDgzZ2FCMENYaUtONEZjamF1OXVRS2ZqOU0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dobberhockey.com",
      "title": "DobberHockey"
    }
  },
  {
    "title": "NHL prospect Gavin McKenna fractured victim’s jaw in alleged assault, police officer says - The Globe and Mail",
    "description": "NHL prospect Gavin McKenna fractured victim’s jaw in alleged assault, police officer says  The Globe and MailPolice officer says man needed jaw wired shut after being punched twice by McKenna  TSNGavin McKenna, projected No. 1 NHL draft pick, charged with felony assault  Global NewsYukon hockey prospect McKenna allegedly struck man in the face during altercation, local police say  CBCCould Gavin McKenna’s Off-Ice Concerns Push Him Into Jets’ Draft Range?  Yahoo Sports Canada",
    "published date": "Thu, 05 Feb 2026 19:39:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPcW9IcVVlVy0zTkxqbEtSTUdjY1dpbFFDdXR4b05IM0V0UW9SUzBwbFN6RjBXQ3kycDQ1VF9KOFQ3M1NRbUVfT1JsQXVCM0R2WDkzcExtZXdnTlM4S0xCQWNUX2k5TnBFbVlrNFVBX0ZadmNZd0pPVHNuZmdNSFZSSzNfZ08xNGNiZnI3Z2JqRGNwNjhPUnp3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Pro Football Hall of Fame Unveils Class of 2026 After Bill Belichick Controversy - Sports Illustrated",
    "description": "Pro Football Hall of Fame Unveils Class of 2026 After Bill Belichick Controversy  Sports IllustratedPro Football Hall of Fame Class of 2026: Quick thoughts on the five Canton-bound inductees  NFL.comDrew Brees and Larry Fitzgerald headline 2026 NFL Hall of Fame class  DAZNBrees, Fitzgerald, Kuechly, Vinatieri, Craig make Hall of Fame  ESPNNFL announces 2026 Hall of Fame inductees  Sportsnet",
    "published date": "Fri, 06 Feb 2026 03:21:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQa1p4Wm1HMEwwTUdzUlJVMDhmeFcwbEZBd2Z3ek1VMjJxX21aZUJKT1NmYlZGbzFEcklhZzI2dkNBeUtrOU12bUxvNVNuakpWLXdoWUVHMEM4MzN3OFBKVTlkNVgtSjd5T1h1eWdZUHVSRTFkXzk1UjEwRVk3NDk2X3luenNoYjg2dzVoWkxjazZRcTZkMEpWTlFB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Statement on postponement of Olympic women's ice hockey game between Finland and Canada - IIHF",
    "description": "Statement on postponement of Olympic women's ice hockey game between Finland and Canada  IIHFWhat to know about 'the sprinter of viruses' that stopped Canada-Finland hockey game  CBCNorovirus situation improving for Finland's women's hockey team at Olympics  SportsnetCanada vs. Finland postponed due to Norovirus outbreak among Finnish players  Daily FaceoffHow norovirus has entered the chat for the NHL at the Milan-Cortina Games  National Post",
    "published date": "Thu, 05 Feb 2026 12:35:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPdVpXTi1PR1h5SVNaU2lVOWNrSkc1M2RJYXNlSDQ2bFE2VDVYN0hneW93QmgtRF9OZW1FMW1KZWRicmJId0tWTHp3bGVodnV1V3cyQ1BCWTNiVE03VjBMenlLcDJmRFNzTlEyekRBSU1pSWpfYnFQd201RkpqOU56Yk9JNGc4amdZTXI3Q2tUQTg4VU10MW55UGtWV0ZfbWFNZFVHQnJjczRmZ2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iihf.com",
      "title": "IIHF"
    }
  },
  {
    "title": "Wynton McManis believes he can help Hamilton Tiger-Cats get over Grey Cup ‘hump’ - 3DownNation",
    "description": "Wynton McManis believes he can help Hamilton Tiger-Cats get over Grey Cup ‘hump’  3DownNationHamilton Tiger-Cats sign veteran CFL middle linebacker Wynton McManis  CBCVeteran linebacker Wynton McManis comfortable donning black and gold  SportsnetOpinion | Star linebacker McManis joins Ticats to ‘chase greatness’  The SpecArgonauts release All-CFL LB McManis  TSN",
    "published date": "Thu, 05 Feb 2026 19:44:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQTmlfS1J0b2xOSWlMTkVzeFg0QnlWVzl2RG1aN0tsaW5pV2gtWndiSzUwRzRKalVCemtJMTFMT080b2xjZllGTGdWa3RKU3JKYURFbnpOX1RvazVvb1pGdjhmeEkwX1dnVmZnUmtCQTFpSEdEZi1udmxMZ2lHdFVVYVNGUE5nLS1xdmdmRGtlb0JKQm5SZTloZFVndmJwLUktZ01nRjloM3NvQjYySFJaeWdsTjA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://3downnation.com",
      "title": "3DownNation"
    }
  },
  {
    "title": "Oilers head into Olympic break with tail tucked between their legs after loss to Flames: Recap, Reaction and Highlights - OilersNation",
    "description": "Oilers head into Olympic break with tail tucked between their legs after loss to Flames: Recap, Reaction and Highlights  OilersNationCooley makes 36 saves, Flames hold off Oilers  NHL.comFlames take Battle of Alberta season series, hand Oilers third consecutive loss  TSNFlames, Oilers ready to battle it out before Olympic break  CTV NewsFlames backup Devin Cooley gets sweet revenge over Oilers in pre-Olympic win  Flames Nation",
    "published date": "Thu, 05 Feb 2026 04:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOMmZmaTRIMTJVVkVfWE8waFA2VWhPN0RNb3NqbVIzWlFMcHY2MFd0c2VTTV9DS1FIenRZVW5JSVNIcXZWWEptMVM0X2N5bzJfQ2xXNUpseGEyXzQxNzY2RzRiZFhsTjg2b2dGZDNJNEtQZmY1MEpuZ0dxdWxnUk9QX2g5NWxldVQ3VzVZRVdtUmx6dlA0cnpuSEJoZlREZDdKclo2anFNaVk5TGVCaS1qejg3bDNUZFpuVktCcW13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilersnation.com",
      "title": "OilersNation"
    }
  },
  {
    "title": "Canadiens hit Olympic break firmly in a playoff spot and with room for improvement - The Athletic - The New York Times",
    "description": "Canadiens hit Olympic break firmly in a playoff spot and with room for improvement - The Athletic  The New York TimesSurging Canadiens roll into Olympic break on high note | HI/O Show  Montreal Gazette‘Really disappointing’: Jets coach Arniel vents on Habs fans taking over in Winnipeg  TSNGallagher, Anderson each has 3 points, Canadiens defeat Jets  NHL.comMontembeault's 36-save performance powers Canadiens past Jets in Winnipeg  CBC",
    "published date": "Thu, 05 Feb 2026 13:40:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNMEk5bnAtN042R3pTTkl2V3Y2MWFHQlRXelp2cHFnb0pWcWtwM3Jld1JfVWNXUlRucTFlQ1BjVHliZWsxT3VNeFA2WUdLOHpfTGdxaHpwOWhTVkpsbmZETEE0ckM4UThCSDU2RHg1Mjk4X3Y5a0c3RnNMQkdqS2NPQTJtSjB6NlpPZ2ZnNDBhSm5WYzJqY2pLVDBrTG9qcFlueGNzMnR2RXoxUnluYnBiZnJIMTd4Q1A5SDI2dzRtczg1VksyX0JUMlFOUFQ3TnYz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "CBC, TSN and Sportsnet put their elbows down to bring Canadians a unified Winter Games - The Globe and Mail",
    "description": "CBC, TSN and Sportsnet put their elbows down to bring Canadians a unified Winter Games  The Globe and MailSaskatooon's Devin Heroux bring us the scoop on what he'll be covering at the Winter Olympics  CBCHow to watch CBC News: Compass during the 2026 Olympic Winter Games  Yahoo News CanadaOn the global Olympic broadcast stage, Canada gets it right  The Globe and Mail",
    "published date": "Fri, 06 Feb 2026 00:33:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPU1dldUgwVVdwQ2Nsenh4a3ViS3pkOUhFODJUZmVqcGNNU0hYMTFkb2FPNjNCX2FhRHRKb3R1RldqRlA4QVN2dnJQemV1ZmMtdUlKZW1IX190UDVnWXlyUThLN2hzWTNxMEFkdjZxWHoyQ0pUYkRpdWt1WnR6OXpoQTR4OFZPSlBsaXdXSHpTRldOam1pTHpyc3g5QzFTMVZuZ2hEZjNVYlFKSUVSdWtJVThCSS05Z3A5VVkyZjV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Winners and losers from a wild NBA trade deadline week - theScore.com",
    "description": "Winners and losers from a wild NBA trade deadline week  theScore.comNBA Trade Deadline Blog Recap: Analyzing the day's biggest deals  SportsnetBucks, Giannis, Warriors and more: Biggest winners and losers from the NBA Trade Deadline  Yahoo Sports CanadaNBA trade deadline: the Knicks get stronger and everyone loses in the Giannis sweepstakes  The GuardianNBA trade deadline: Execs, scouts on the aftermath of a wild week  ESPN",
    "published date": "Fri, 06 Feb 2026 00:18:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiTkFVX3lxTE1TWUZ0MTljbzJPYU51SWRiR3k1YVhwY1R4T3hNSWdZcWtHcjRCNlktd3lna0plbFpLUnVPREY1RkliYmdXVndwcnk1dVFkZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://thescore.com",
      "title": "theScore.com"
    }
  },
  {
    "title": "Lindsey Vonn Workout Video Proves She’s Ready to Complete Her Olympic Comeback - Sports Illustrated",
    "description": "Lindsey Vonn Workout Video Proves She’s Ready to Complete Her Olympic Comeback  Sports IllustratedLindsey Vonn finishes Olympic downhill training on injured knee  ESPNHow Lindsey Vonn can compete with a ruptured ACL  cnn.comLindsey Vonn completes Olympic training run with torn ACL  SportsnetInside Lindsey Vonn’s Epic Return to the Olympics in 2026 After Retirement and Injury  E! News",
    "published date": "Thu, 05 Feb 2026 15:19:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdmRZQU1BSHVzQlZvVzhEQW9teGk4LUluUG5xaUg5S0pLQ0JUYi1PTEI0cWVwQzAxdlNFYVc4UWVxNzZiUjRmVE1rWDhRYXdUWkpDQWc4QWJGOGlnLV9mdHVDTnREWEdPdWw1WmE5bmxpWVYxY0FELVQ2Ukd6OFFGV3FpdDFCOW1Cc2xJLXNTN2FYVktqc0tFOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.si.com",
      "title": "Sports Illustrated"
    }
  },
  {
    "title": "Winter Olympics 2026, mixed doubles curling: Unbeaten Canada bests Italy - daily results - Milano Cortina 2026",
    "description": "Winter Olympics 2026, mixed doubles curling: Unbeaten Canada bests Italy - daily results  Milano Cortina 2026Successful opening draw for Team Canada in mixed doubles curling at Milano Cortina 2026  Team CanadaSome 7,000 km away for training, ‘not easy’ for Peterman to watch Scotties highlights  TSNCanada upset defending Olympic champs Italy at Olympic Winter Games  World CurlingCanada’s mixed doubles curling team defeats Norway and Italy in round-robin play  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 21:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQLTBfa01BLTMxZ1NycEVuM2ZYdEZvV2k3amJlelJ4ZE11dldyQXR6dUo3TzMwNGswSnYxZDVvSFp5RXZXOFdSeG5TczNYN21UTDI5Z2tTbzRZTU8tSkt5b0FJQ0tvWk1CYVZycE9ja3VzajlYNHMyZmhUaWVIMXMwNHFCNno0eXFiRldfXzlldGF3dzYyYWRDZk82SkNZTkdHbW9RZXZKSVhxVTU5OUE0eDE1a0VGWnJqeVhhcVQxRzRYZmxEQlg5alNZWHdIbENmeU1FWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.olympics.com",
      "title": "Milano Cortina 2026"
    }
  },
  {
    "title": "Christian McCaffrey Wins 2025-26 Comeback Player of the Year Award, Full Voting Results - Bleacher Report",
    "description": "Christian McCaffrey Wins 2025-26 Comeback Player of the Year Award, Full Voting Results  Bleacher ReportView Full Coverage on Google News",
    "published date": "Fri, 06 Feb 2026 06:19:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPaFd1UGNEZXZVQmVCQ0FuME5JVU5YVGhsaGNndXVtTEpDV01EMXhSalFaSUZWNnBNaHZGVjVUeU55VWM3V0JoYVM3YnRVQ2FEeEhQVXJ3XzVyWHM5eEF0Zi15WXJWUWVESk9pTVJOanJaMzFZOXMtdjFHYXJnLXVuUDBHUVhGakNqT1ZLNUNVblVtcHVjTDc2WjdxTG53UnhRSDl0ZWpLZmtlVXNUaGZQeGV5b1dNTUFVZFE4YWRxS0JRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "Flames Provide Medical Update On Huberdeau | Calgary Flames - NHL.com",
    "description": "Flames Provide Medical Update On Huberdeau | Calgary Flames  NHL.comFlames' Jonathan Huberdeau requires hip surgery, done for season  SportsnetCalgary Flames forward Huberdeau to have season-ending hip surgery  Yahoo Sports CanadaCalgary Flames’ Jonathan Huberdeau out for season  CP24Flames’ Huberdeau out for season, set to undergo hip surgery  TSN",
    "published date": "Thu, 05 Feb 2026 15:16:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1tMGhsaDhvV3FiV2tjTUdCNXA0cnVYUHlPSFpsY2FsbE1raXQ3NXVYOERZdnplTThhVUYtWXdUWGpyc0VNSzd0QVVoRUlFWnBENXE4dFhGa0FPVlQtS19laUlWcW9MU096c3FQMlNPa1BRakhMQTVqa3B3WUgwNE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "What the world will wear at the Winter Olympics opening ceremony - Toronto Star",
    "description": "What the world will wear at the Winter Olympics opening ceremony  Toronto StarUS Olympians are greeted at Milan’s airport with star-spangled Ralph Lauren uniforms  Winnipeg Free PressFashion is a competitor in any Olympics but especially in Milan  CTV NewsSeven stylish teams heading to the 2026 Winter Olympics  The Globe and MailFrom Lululemon to Armani: Why brands are betting big on the 2026 Winter Olympics  Yahoo News Canada",
    "published date": "Fri, 06 Feb 2026 11:13:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwJBVV95cUxNWkdUTEhsN0NpM0pmeF8zZFFLUllaSUZvaTVSMU52V1BwcXBjc21nUkVRaWdveGRIY3EtQzJhN04zZ3gwUmE0VTZGZmVGa0pCNTJEZlVScl9yYWt3TThQRk1kVjc5UTN5TU4yMjhaZXppU0g4VUc4QmRzdDhjbFZIQzBxbTdaMjV6UUo5ZzFRNy1rNG1Xc3N5b1Z2bEtidzgtTWdZTnBhQ3ZmWmtISXByY05HNmxSem1hNmxlZXNRMmNSemE4ajQxODZkbHpiUTRxQUlXdDBYaV9iZDRhczU2eTllRGoxVGdWUXg1YXpOWDRBbVB1Ty1YTzNPalNwa3VSeUpLdmpIWDczVk5NRDhtNzlkaFJpMlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Wolves, Heat In Play For Giannis Antetokounmpo; Bucks Looking At Ja Morant Trade - RealGM",
    "description": "Wolves, Heat In Play For Giannis Antetokounmpo; Bucks Looking At Ja Morant Trade  RealGMBucks keep Giannis Antetokounmpo, who alludes to not leaving  ESPNAntetokounmpo remains with Bucks as NBA trade deadline passes  The Globe and MailWarriors missed out on 3-team Giannis Antetokounmpo trade idea before NBA deadline  Yahoo Sports CanadaWhy Timberwolves’ Giannis Antetokounmpo pursuit fizzled, and the pivot to Ayo Dosunmu  The New York Times",
    "published date": "Thu, 05 Feb 2026 14:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQendsN21FQmF5bndSdk9nb3ZVamwtM0xXX0Y2S1U5eEN3LWY2OXhNaXVzWHNYS1ZFdGZjZjJhWWF3N3puLUJlYUJra2JaOHgycEpJUVlkV0phdVZFZXNiRFg4YlhRM0tlSVdDRU5fNWpfbm1ZOVlzYVFUcGhnLUdBdEFYVnEwTHNybVlpUURNM0VqZmI4SU1WdXF0eXMtaC01TlpMeEUzVzZyYnhrMWV2SlIxZjgtLXJJOE1CZFg0Y1lBd9IBxwFBVV95cUxNU0c3aTVXa0RDZUcxS2pVX1BXWFNCeGlkNUV5VXpVcDdoUWJxYlZkN3JLVXFKX3NQVXVfQUM5UE43dWU5Ulp4NjdLdkN1RUpNYmttMWl3X2E4RjNzNUJqckJnelA3N2lTUW5rY2pxLV9TeXloOFVsaDhkeUU0S0dFdFNrbTlUbUR1Q1pnNGhVU2w1LXlsRE1DZWdOcUhYTExWQmZBX0MyT092Znk4dUZHbE5yaVNMVkhNSUtyZGRBTEVnd0RsOGhz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://basketball.realgm.com",
      "title": "RealGM"
    }
  },
  {
    "title": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’ - Toronto Star",
    "description": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCMy Life Among The 33 Pomeranians (And A Few Thousand Other Dogs)  DefectorA culinary feast of chicken and carrots for the Westminster dog show winner, Penny  Yahoo News CanadaThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The Guardian",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNTmE2X1hMNzJnbEJUV2h3bVVrOGZyVXUxX2NwakN5SW5fZFpobHNyOXVxdUYxODc3dElTWkwwR2xWRGdGYnFnMFVocEEwTDU2bVBqeGxDTFVpcmVmVXlrMDZmbkZLWWZJOUgzQ05iSlJodDRSWWJ3VHJkMDFZVG5tbEdLMndCSTIzR1ZsaXR0bEZFczF3dXVDWE9oakxjOV9MUG9vZ2d3QU52aWpzYmFmc1ZJVWtZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Tom Brady Blasted by Patriots Legends Vince Wilfork, Asante Samuel After Non-Super Bowl Prediction - Bleacher Report",
    "description": "Tom Brady Blasted by Patriots Legends Vince Wilfork, Asante Samuel After Non-Super Bowl Prediction  Bleacher ReportTom Brady's Super Bowl stance called out by former Patriots  ESPNPatriots legend calls out Tom Brady for Super Bowl prediction  Yahoo Sports CanadaRobert Spillane, former Pats players bothered by Tom Brady not rooting for New England: 'Makes me sick'  NFL.comRobert Spillane on Tom Brady saying he doesn’t have a dog in the fight: Makes me sick  NBC Sports",
    "published date": "Thu, 05 Feb 2026 19:00:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQNmk5R1NCZXBPZURQX29HQWlYWFllLVJJdFExaDh0dUl6aXhvOExmUVl3R3VPSHJWQzk0TTRHVTQ1OHQzSHJMZ2l0Z0Y1Q3NaZ19nZS10S1luVUttREJ4YmZwMk0ta1RVV1dBVEhBRkZyMHJWTmRfVFU5TkJBRnlPdDc4MzhvVm1LbVVkSnVPamk3XzdBa0otOW55cE5HNl9IYUdyZGpFTEM5Nk5WSVBvdWVxSFd2MjVlMER4UXJVeTYyVGFzWFdIYnNvS3dNYlh1ZTVRT0RB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://bleacherreport.com",
      "title": "Bleacher Report"
    }
  },
  {
    "title": "Super 16: Teams that will benefit most from break for Olympics - NHL.com",
    "description": "Super 16: Teams that will benefit most from break for Olympics  NHL.comCarolina Reportedly Was A Top Contender For Artemi Panarin  The Hockey NewsCountdown to TradeCentre: Will Panarin be moved before 3pm ET?  TSNNHL trade board 6.0: Could we get a blockbuster before the Olympic freeze? - The Athletic  The New York TimesCapitals Stand Pat As Olympic Roster Freeze Takes Hold, Hunt For Scoring Winger Continues  Yahoo Sports Canada",
    "published date": "Thu, 05 Feb 2026 04:41:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBWX3ZNMm9SOGFNOUt6ODFTaFpzZDVkeks2NjFVMjdxR1hvNnVVdU9scnV2QjNSN1FURUZXSHNIM21FYXNTWFptX1IyZXFoOWdlVkhWQUxaQXRhRmJ3bW1CaEVBSDlTeW5pOGQ2Y1ZmN1JTUFlyLTFj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Stafford beats Maye to win MVP in closest race since 2003 - theScore.com",
    "description": "Stafford beats Maye to win MVP in closest race since 2003  theScore.comMatthew Stafford wins NFL MVP in closest vote since 2003  ESPNMVP-winning Rams QB Matthew Stafford vows to return in 2026  DAZNMatthew Stafford wins 2025 AP NFL Most Valuable Player award  NFL.comNFL Honors 2026: Matthew Stafford named MVP, Myles Garrett wins DPOY  Yahoo Sports Canada",
    "published date": "Fri, 06 Feb 2026 03:46:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE1EYlFzckVobzQ0TlQtYVF3dGdrMFRUcVh2NnAxQlptZFozWXluTnFpOVIxWHd2QU9IMm05d1czRkdOMXFMenNjZm1STTNRalZaX3k0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thescore.com",
      "title": "theScore.com"
    }
  },
  {
    "title": "Just when Jays fans thought the Addison Barger pull-out couch had been forgotten... - Toronto Life",
    "description": "Just when Jays fans thought the Addison Barger pull-out couch had been forgotten...  Toronto LifeHere's all the free stuff fans can get at Toronto Blue Jays games this season  blogTOBlue Jays announce promotions for 50th anniversary season  mlb.comJumpin’ George Springer, Addison Barger's couch moment headline Blue Jays’ 2026 fan giveaways  Toronto SunBlue Jays to celebrate 50th anniversary game with 77 cent hot dogs  TorontoToday.ca",
    "published date": "Wed, 04 Feb 2026 20:54:57 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOSmpEcWNzRzM5OGpQVUpFZnlqNzdUTTlNZXpiZjM0bDZBQmp1RHNzWHc4V2hZZFFqblhVUE92eHVKZXQ1alFDRDI5ZnhiNEg0R3l3dnFnUDBCYzlFa0JtS2EzZ0ZqQk5hY2ZYT2xDZEVxNFh5aDN2Y2ZBTUlIcWhCaERqQ3JTUF91dXRTcWxQN1hNQThaU2xNcUJqU29vM0czbXRMZGdMS1VodUZHM1Vj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://torontolife.com",
      "title": "Toronto Life"
    }
  },
  {
    "title": "Maple Leafs News and Rumors: Toronto Likely to Be Stuck With $60,000,000 Headache For Rest of the Season - PFSN",
    "description": "Maple Leafs News and Rumors: Toronto Likely to Be Stuck With $60,000,000 Headache For Rest of the Season  PFSNDreger on Rielly’s future, Battle of Florida picking up and who will start in net for Canada  TSNMaple Leafs predicted to trade Morgan Reilly, fill void with point-per-game defenseman  Yahoo Sports CanadaNHL Rumors: Rielly Trade, More on McMann to Oilers, Latest on Panarin  The Hockey WritersCraig Berube provides Leafs injury update ahead of the Olympic break  Editor In Leaf",
    "published date": "Thu, 05 Feb 2026 23:16:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQN2o2RFh5STZNc1Qtb0ZCWmxhZ1phWnI2ZW1DSy1nel9SaU9seUN6TmhrTVhERnBXcTBRQnp6dXZCTjVwVkxKakdMNmIyd3pQZFZsUjhYUTRlam83ZTRfSnNhME8tMU1BWTMzc0YtZ0h3ZWRHNG9Kc1d2NG1jaGFSdENGNlZaa2lJWkY1Tw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.profootballnetwork.com",
      "title": "PFSN"
    }
  },
  {
    "title": "Juventus 0 - Atalanta 3: Initial reaction and random observations - blackwhitereadallover.com",
    "description": "Juventus 0 - Atalanta 3: Initial reaction and random observations  blackwhitereadallover.comToday’s Papers – Juventus collapse, McTominay’s marathon  Yahoo Sports CanadaAtalanta dump Juventus out of Italian Cup  theScore.comBremer: ‘Letter of the law says it’s a penalty, Juventus must accept it’  Yahoo Sports CanadaPalladino: ‘A magical Atalanta night, I enjoy open games with Juventus’  Yahoo Sports Canada",
    "published date": "Thu, 05 Feb 2026 23:12:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOZlZlUnFIUlFlSTdySWpTTXROTXJEMkFzN0xqZXVSZVZ0aTZkTVZFUFp6dWQzckNuaG1jd2JTc2ZCWWhVbWJrWlRyU2xRY0pPMklxdHI5ejNQYzNVX2xOUm1YU1hpMThab2kzU254MlJKdlY3RDRHUXg4WF95WVREYUJ0OFI0am4wdWtwaS1lZzREWl9va2VtMmk1b2RTamIteF9zSFM4YjYwUVNUNWMxZWlWSjNsWGV6MW5BOTNydlJPRUFQVmUzVnI0elJQZEJzRFBXbXFVOWxkRHYyZXlVVXAzczE4RTlnODBvYXdqWjlia000Sll1RFZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.blackwhitereadallover.com",
      "title": "blackwhitereadallover.com"
    }
  },
  {
    "title": "Saskatchewan Roughriders sign Michigan State Spartans kicker Jonathan Kim - 3DownNation",
    "description": "Saskatchewan Roughriders sign Michigan State Spartans kicker Jonathan Kim  3DownNationRiders Add Former Michigan State Kicker Jonathan Kim  Saskatchewan Roughriders",
    "published date": "Thu, 05 Feb 2026 13:53:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNMFRTRS1ZaDh4dkNlNTYtRFFfSnlIYUJuYUxDZ2ZrQWdDdGNVWER4LTlXZktsYndyVG91SGRsVTV2d0RwVkRPWDNOTUJvMXVvUUhLdFBVb1MzY3NvRnUwMDE5b09KM00wNmdaTWpGS1dCV2hYd0t2TFZoeVJPS3NsZ2F1cVVXQldSQV81Tk5KaVdyeVFsR3VDMF9GX0xsUml4Y3h1cVlSTTZ1Qzd4TlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://3downnation.com",
      "title": "3DownNation"
    }
  },
  {
    "title": "Calgary singer Tate McRae says 'I'm Canada down' after backlash over Team USA ad - Yahoo News Canada",
    "description": "Calgary singer Tate McRae says 'I'm Canada down' after backlash over Team USA ad  Yahoo News CanadaTate McRae responds to backlash over U.S. Olympics ad: 'Y'all know I'm Canada down'  CBCCanadian singer Tate McRae faces backlash for promoting Team USA  BBCCanadian Tate McRae’s Team USA Olympics ad is treason  Toronto LifeTate McRae responds to backlash over Team USA Olympics ad  Global News",
    "published date": "Thu, 05 Feb 2026 16:37:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9zTThxWWFCdXBUcHBaS3FMMTQyQ3FHaEp0UzRqa1lBeTNNR215ZXlTeGJtMjM2dFFEZ3Ntb3FIZHdraGFvUndibHQ1Tl9GMC1yUUtBalBuRmFGbjdra2RZTWtnS3I5S2JEdlVtbEREQmtXUl9YcDdkZjM1Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Bruins' Sturm upset with 'brutal hit' on McAvoy - theScore.com",
    "description": "Bruins' Sturm upset with 'brutal hit' on McAvoy  theScore.comPanthers’ Vilmanis exits game against Bruins after hit on McAvoy  Daily FaceoffBruins, USA defenceman McAvoy returns to game after taking hit  TSNBruins' Head Coach Marco Sturm Blasts Officiating Over McAvoy Headshot  Yahoo Sports CanadaBruins’ Charlie McAvoy escapes calamity after elbow to the head: ‘Brutal hit’  The New York Times",
    "published date": "Thu, 05 Feb 2026 05:09:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTFBJdXBxNjMwU0FwVEY2VG1xcFJfVTlsUVc4MDQ2X3A5OTFXZW5CamszWG5ZLW1FUW42bjk0ZmxBUC1ETkNNMkpBbk1CblZxdWh1NVNj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thescore.com",
      "title": "theScore.com"
    }
  },
  {
    "title": "Report: Raptors avoid luxury tax with three-team deal for veteran guard Chris Paul - CP24",
    "description": "Report: Raptors avoid luxury tax with three-team deal for veteran guard Chris Paul  CP24RAPTORS COMPLETE THREE TEAM TRADE  NBARaptors trade Ochai Agbaji, draft pick to Nets in tax-saving move involving Chris Paul  Toronto StarBulls trade Coby White to Charlotte  Yahoo Sports CanadaRaptors expected to trade or waive Paul after acquiring point guard in three-team deal  TSN",
    "published date": "Wed, 04 Feb 2026 21:56:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQaXd1dGZ5RDlEaXRfaWJsSVJWRl9xWHFreU5QX2dhR21NWm5QSmJiUWhrUFBjaDdLNEFKa3pFczZaQzdXdURvZXZiTUNCdGlVdkRrTHJ1ejh4VE1Da3d6VjlYY0pEMmJYZmZkUGdwUlo2YlZIWTVkV2NKM3dTSHR0SjNlZmZ5WDE1aHgyOWhGeldoWU93Y3JRbl9qM2thYk92T3lYWkk2eGlFVzhUVm1VU3lEdFo3X19MRldsdVlDZU1ROHRycXJz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "U.S. alcohol is (briefly) returning to SAQ shelves — and at a discount - Montreal Gazette",
    "description": "U.S. alcohol is (briefly) returning to SAQ shelves — and at a discount  Montreal GazetteRight Chemistry: America's healthier past is no more than a myth  Montreal GazetteCanadiens beat Sabres to ace character-testing week  SportsnetCaufield scores twice as Canadiens beat Sabres 4-2  The Globe and MailHow Canadiens Stack Up Against Toews’ Blackhawks Dynasty  The Hockey Writers",
    "published date": "Fri, 06 Feb 2026 01:26:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxObWUyWDBydk5kbW14RjVib205cFpXNHJNTk1wdnROMjFZVVM4SFRuRTFOMUZuZnZ0VXNPbFJ6X19oZWxfaXQ0S2ZRWWF6ZnVVdnQ5bGQ2NDlQTnQwN2QxOEx3VVM5YzB4U2FVbTljYUNxTFZQNkNfTURpeFotdkQwM1VEMzFBOUR5VHBuSzVWTFJlbFI4N25IcEstdmpWenM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://montrealgazette.com",
      "title": "Montreal Gazette"
    }
  },
  {
    "title": "Montreal Canadiens discussing Patrik Laine trade - NHL Trade Rumors - NHLTradeRumors.Me",
    "description": "Montreal Canadiens discussing Patrik Laine trade  NHL Trade Rumors - NHLTradeRumors.MeCanadiens' Patrik Laine Continues To Create Trade Chatter  The Hockey NewsAnalyst Suggests Oilers-Canadiens Swap Involving Patrik Laine & Andrew Mangiapane  The Hockey WritersPatrik Laine: Nick Kypreos wonders if a trade to Calgary is possible  Dose.caPatrik Laine: An unclear future  A Winning Habit",
    "published date": "Fri, 06 Feb 2026 00:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPN1RUeDJVbkdfTldSWnlMb0JacUM0dVducHdzWEw5Wng0TUZza3d1WXI1aUQzMDUwU3RGZ2hrdUlDX3MzWkN3R05Ibm9tcWgyS3BsMS1YS09FaFg0bGR0bVlxWlh4YnlYUHFXaGwyaW4xa0lZWWRvdEVhbnJIQk9CYldIRUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhltraderumors.me",
      "title": "NHL Trade Rumors - NHLTradeRumors.Me"
    }
  },
  {
    "title": "London, Ont. sportscaster Pete James dies at 89 - Global News",
    "description": "London, Ont. sportscaster Pete James dies at 89  Global NewsLondon’s 'Godfather of Sports' Pete James dies at 89  London Free PressLondon sportscaster and Knights commentator dies at 89  CTV NewsOHL mourns the loss of Pete James  Canadian Hockey LeagueLondon sportscaster and Knights commentator dies at 88  CTV News",
    "published date": "Thu, 05 Feb 2026 19:40:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE96MFBWX2tMNEQxbFFuLUZ4Z01JSlpWcTkteFdfU09qRDc0cEswQzNhUTZIQWF3N0ozQl9wTDZwM1ZRaG1iVU41UnFXYVRrdnpWOGxCTXdSbXlPQnRuZFRDTlNXSXM1N2ljSXZsekNKY0FabXJjUW0xaDlBbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Bruce Arthur: Inside Milan’s Olympic hockey arena: It could have been much worse - Toronto Star",
    "description": "Bruce Arthur: Inside Milan’s Olympic hockey arena: It could have been much worse  Toronto Star‘It was chaos’: Beleaguered rink hosts first game at Olympics after construction delays  TSN2026 Olympic Women’s Hockey: Top standouts from Italy vs. France  Daily FaceoffPipe leaks and puck joy: Milan’s winter wasteland comes alive for ice hockey opener  The GuardianOlympic arena report card: It leaks, it's dusty, but it's hockey-ready  National Post",
    "published date": "Thu, 05 Feb 2026 17:23:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxNOHRCblRIVDdOZnFxUzhRa2o4SDVxRl9kQWZvZ0FWbkFTZG9UdzJKNnNpaHRJb3BRTDBhQnAySlY5QzN0U3E1NTYtMTdFZXM4SXZUazdXNVlnbFpLcmFBODN2cnE2Q3ZsM1pGaW4tcnFfbzV3cXBxTHpqdE85VklhMFdxa2phcjBXMnNmbzhkc09SSlU3RlJ6bENMejVkU1FlVlZieWJZczBoNzUyUEhzbi1XRkxnSWtRZlYxeEV0ZXh1YUJqODZSZVQtZUVZbm9QZTQwalpqdE1XejVib0kyMTVlLUtGT1doRV9kOHpvUEcyZUJRYkZTR2J6VnFvRW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Winners and losers from NASCAR's Clash at the Madhouse - Motorsport.com",
    "description": "Winners and losers from NASCAR's Clash at the Madhouse  Motorsport.comRyan Preece overcomes sleet, cautions to win The Clash at Bowman Gray  TSNSpotter Brandon Wilkinson gets first NASCAR Cup win at Clash  Yahoo Sports Canada‘Crazy night’: Ryan Blaney overcomes Clash crashes, wet weather for podium finish  NASCAR.comRyan Preece wins The Clash in sleet and near-freezing temperatures  Winnipeg Sun",
    "published date": "Thu, 05 Feb 2026 18:08:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPY1FtcDVnbTJDS2lqX2l3WnF4WVNRX1I2LThiXzYzc1JzdF83TXJ1LTVqX1NhbUI0RklYLS1hX3F2MjA5QW1aX0c5UVRiejVyajk3NEZkQmVhUExBTEZyVFM2cTdSMkNzT25MVnlaWXdVN0prX0otUXRKQm9IWGNpdi1DbnNnWnlwUUtJOVpoTU14NWtLUGFzNkptV05HeWVoNkFlcHFCb2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.motorsport.com",
      "title": "Motorsport.com"
    }
  },
  {
    "title": "Tigers’ Tarik Skubal Offers 3-Word Response On Record $115 Million Move - Forbes",
    "description": "Tigers’ Tarik Skubal Offers 3-Word Response On Record $115 Million Move  ForbesWhat Valdez signing means for Tigers' standing in American League  SportsnetSources: LHP Valdez, Tigers reach record-setting three-year deal  TSNFantasy Baseball Offseason Tracker: Top Moves  CBS SportsFramber, Tigers agree to 3-year deal worth $115 million (source)  mlb.com",
    "published date": "Thu, 05 Feb 2026 14:24:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNQ0MzSUV4YzFLMWI1Ny1xMDRKR2k0NFJmUU9FNW9pMzZubUgzeWEwbkVQc00zSTBRQ1VHM0dvYkpwRDZSNFpMdF9BZmplSlkwd1VleGtZSVNvQWhCZHZROGI4bTIxYk0tdFBCcFVOTndJTWc5VjllWVZKelpIUC1paDNyQnh5YlZjUTZNa0NjWUhOQjNvRmtzVEVRUDhkT192MFhHdlo3bnJpM0xnWWZTZ3kyTUpQMHdGeXJ5MURBQW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Raptors add backup big man in trade with Warriors - Toronto Sun",
    "description": "Raptors add backup big man in trade with Warriors  Toronto SunRAPTORS ACQUIRE JACKSON-DAVIS | Toronto Raptors  NBAWarriors cut ties with Stephen Curry's 6-foot-9 fan-favorite teammate via trade to Raptors  Yahoo Sports CanadaReport: Warriors Trade Backup Center to Raptors for Draft Pick  Sports IllustratedRaptors hit a soul-crusher as recent foe steals their perfect trade target  Raptors Rapture",
    "published date": "Thu, 05 Feb 2026 13:25:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQc0FPNmp3QmdxQVA1NjNtbjNVcTU0RG44cU5ETkd1b2VCZy1sejVnRGR1bGtVcUJtajU5YjlmdzlYR2gwX09WR29MOG8xU2dxeTB2d3pIa01yT2lrOFFRbEFReEFqaXo1S1BseFVhT3pYTWlpNmtqNWFvZTJ4LVo4Q3pYOWtNRHhfSklrUVJxbU16emQ2ZDBvNEo1QjN3TTBiaFBGS2ZBckMyVWRxblBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://torontosun.com",
      "title": "Toronto Sun"
    }
  },
  {
    "title": "Saskatchewan Roughriders sign Denver Broncos NFL draft pick Tyrie Cleveland - 3DownNation",
    "description": "Saskatchewan Roughriders sign Denver Broncos NFL draft pick Tyrie Cleveland  3DownNationRiders Sign Former Broncos Receiver Tyrie Cleveland  Saskatchewan RoughridersFormer NFL receiver Tyrie Cleveland signs with Saskatchewan Roughriders  620 CKRM",
    "published date": "Thu, 05 Feb 2026 13:25:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPTEpEMGlQVHpJM0FlZktWM1lyeUQ2MW15UUJpQ3NyWmJHN0JGdHFWZjdsUkZLWFg4QkZza05oTzRyaGE5UzJqUmFlakhjTUY1SWxRRDNCbUwtbFRfOXhjNmdERGZsSmU2Rl9PbnZpRXVlR3cyWjFpS1I1cmhRQldyYS1hYnhla3ZpcXhzNnZBNUtmdGlZZUtxZnpLN1J6cl9NZ09SWl8zX3Vkd1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://3downnation.com",
      "title": "3DownNation"
    }
  },
  {
    "title": "San Jose Sharks in trade talks surrounding RHD - NHL Trade Rumors - NHLTradeRumors.Me",
    "description": "San Jose Sharks in trade talks surrounding RHD  NHL Trade Rumors - NHLTradeRumors.MeNHL Trade Rumors: Sharks Shopping Defenseman  The Hockey News",
    "published date": "Thu, 05 Feb 2026 13:17:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBsdHBkLVFyX3NsRWVoV011b0NXeWd0U29QaTAxODBmSU5PSFkxX2ZaYkpQRWJhMTA4LVFFWG1ySWFRY0pwWGRjY29XM1pKZW9ObVQ1LTNwQ2NzdG1vVXRDNHZuYWNlQ2RQTFZGQkZtc1N4VW9VeV8yY3UtVjA1QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhltraderumors.me",
      "title": "NHL Trade Rumors - NHLTradeRumors.Me"
    }
  },
  {
    "title": "Laval vs. Utica recap & highlights: Rocket rout Comets in return to Place Bell - Habs Eyes on the Prize",
    "description": "Laval vs. Utica recap & highlights: Rocket rout Comets in return to Place Bell  Habs Eyes on the PrizeComets Drop First Game of February in Laval, 6-2  Pro Hockey News",
    "published date": "Thu, 05 Feb 2026 04:49:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgJBVV95cUxQbDZIWlNKcWlNUTlaT2hWQnNBUG1VRFdXOWQ2M3YyZEJGS2lqbmJ6X2ZJdEJWeEx0V0ltbmVlMEk1amVwTXRDeUJRbkYxN3ljTE9YX1dLQkdTUFp4UTMyX3VqM0VWd3dIbkQzY1hZcEZnTlpIYi10Q2ppaEFRVE1HbUJLQ0EtMTQ3MFZUMHotVWoyMWhZaC1nbFBOMFRQV1RjOWRnUWVXV0VwREEySXdUS2l1T2hOYUtUbnhLTkFHaEdmeXQydGN4aDhENy1fZ3RvM3Fva214N0ZwZDAySEJWeXl0TmVqXzg4X0IxeHpjMVNVNWVzam8tMEdXalB4YzF3RkMtek1xaWNva1kyT0xCT0piQ3B5aUg0RkpYQm5KNUcxblQ2RXJKUDY2M1NnbV9Gc2hSMGZn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.habseyesontheprize.com",
      "title": "Habs Eyes on the Prize"
    }
  },
  {
    "title": "Bjugstad traded to Devils by Blues for Bordeleau - NHL.com",
    "description": "Bjugstad traded to Devils by Blues for Bordeleau  NHL.comBlues acquire Bordeleau, pick from Devils | St. Louis Blues  NHL.comBlues trade Nick Bjugstad to Devils for mid-round pick, prospect  SportsnetBlues acquire Bordeleau from Devils | TheAHL.com  The American Hockey LeagueEx-Penguins Forward Traded To Division Rival  The Hockey News",
    "published date": "Thu, 05 Feb 2026 03:33:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNUTVhRkxyZVZ0SnFESzV6bXJxZnpDd1BRN1lnSC15a0Nnd1Z6UzRSdnlMaVE0VHJ0alRTU2NhZXR4bk1Zd041Zi11NU55NTA0a3dkTWNvUmh6bHg1TFk4MUtoc3R5LVZQYndKa21ockpOdHVxMDUtLVZSNnNJajcteDZIczdoZVFyT0U5Tg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Grizzlies Being Asked To Include Draft Compensation To Trade Ja Morant - RealGM",
    "description": "Grizzlies Being Asked To Include Draft Compensation To Trade Ja Morant  RealGMReport: No teams willing to make 'serious offer' for Grizzlies' Ja Morant  Sportsnet“Ja Morant better wake the hell up. Cause in two …  Yahoo Sports CanadaNo Trades Involving Morant, Kawhi, Sabonis, Zion, More  Hoops RumorsJa Morant's trade market remains limited: Sources  The New York Times",
    "published date": "Thu, 05 Feb 2026 18:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNVEJBOEU5akREdVZ1SmN0RlRDcndzdHFfbzZfcWNodjhMNUE4LXRHYlBScVpzUEtxVzRMdlpNUWwwWEZzS21xdVJTTTVfZFoxWUJEbHR4eWx1WTFLLWczUFRBemdIX1BVRW9laGZtbklDbFZIVkRFUHV2T2xkNktzZ204U2VWN0VFZUJ3SXlHQnk1U1ptMWR6S0JFRUUyMTI3RXUwdFRPQzdaLWw2UjdieWU1NERld9IBuwFBVV95cUxQeVlwdU9Qb3pOc255TnBMVDY1M0tfaHFfcmZidTgwd2R2eHRGTXBHN2YyWWZZa0wwT2phalFsd2ZPZUZfSHYwSXVpN0Vsc094M1hmOWZWb1dPTVRHQjFaREdibzhWcjNTdGg1Q25GRXNNaENkTE5sU3pLWmVRMmxYdDlfS0d1b2p5c1pfcHlZWmRMNUFhWkJNWjVYUTZwbzNGS0NXQkhtQUJoWjRpY3QwR0RkYlhvSEQ1Q0Y0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://basketball.realgm.com",
      "title": "RealGM"
    }
  },
  {
    "title": "Algerian boxer Khelif open to genetic testing by IOC for 2028 Olympics - Al Jazeera",
    "description": "Algerian boxer Khelif open to genetic testing by IOC for 2028 Olympics  Al JazeeraOlympic boxer Imane Khelif wants to fight – but only in the ring. She’s prepared to take a test to do so  cnn.comBoxer Khelif reveals 'hormone treatments' before Paris Olympics  France 24Imane Khelif’s latest propaganda campaign should fool nobody  The TelegraphOlympic champion Imane Khelif willing to undergo sex testing to return to boxing for LA28 - The Athletic  The New York Times",
    "published date": "Thu, 05 Feb 2026 11:56:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPdG9CYjZVeEpLSU5vSFJvQmY0MDBadFY1YzgydjYtTEJDcVl4R211bU10OTFYaE5GT1ppR3hjVUZiZTdna2JRZkI0dkttdFFRa2l2OEE3OXFTODltMFAtMmVUTEpXdFVfaG9reVEySVoxTFpvTFVnRGhzMFFFalZ6LXZ0VTJWMjFxYlllMkFHaDJ3a2dKTFE5ZGh5UllsME84SWlmWUxmbktqXzZOVlEyWlVR0gG3AUFVX3lxTFBOZ1FnVXU4VWNKUXZ5NGFHWjQ3WGJlQmxDOUZoUXAybEMzZmRST01TWGhFdE9RRW1Va0J3b3FJNzBvLXJsMnVyMzBncGFQdEVfUUFhUXNRanFnNjFDT01MSnFYTnNyWUhQTEdYbHIzcFA5UXJPU1k0N2FmQmVrUFdOa1BvMmJYVG9QeXBwcXlWR2NBUkF3SEZUN2xBUXdzREhfdzZta3ZEWlg0czNtNFpHZ09LaE1hbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Pacers Acquire Ivica Zubac From Clippers For Bennedict Mathurin, Two First Round Picks - RealGM",
    "description": "Pacers Acquire Ivica Zubac From Clippers For Bennedict Mathurin, Two First Round Picks  RealGMPacers acquiring Ivica Zubac from Clippers  SportsnetNuggets are quietly a massive winner from surprise Ivica Zubac trade  Yahoo Sports CanadaPacers Find Their Starting Center in Zubac  NBAShepherd: Clippers are 'a much better situation' for Mathurin  TSN",
    "published date": "Thu, 05 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQV2FoUGVIUGZaSE5PRGphOWdCN3BKeXZLaHZVeEp3dkh0UUJjaFpsOGtMQk9mNF9aaVdJQkg0Ml9hRkdlc1J6TzBXcFpXekstdHlmdjFhWFNCNGJGSERHZU5sQ2VzMWFJMFNtRUhBYTVyMnlDOVk5NWQ2TGQxWHhBbmZ4czI0bHl0WGM5UG80M1JCZDlobWktVnR3WkJmendTOXZsejFpUHA2RkxPbDQ4SVlUR00yQ1FIX0NBbzZLX21kSDlIZW9xQlpn0gHPAUFVX3lxTFBhUlNzaUptN2ZBVE1YUlZweDl0NmMtUGxXVlFDZVdvaDYxdnRfMjZYWGswNkFRZnlJSGoxcGk2dWhBTU1PUHpPSm9wQ0lCYnhJQXg5akEwYzhjOC10anA2azVQSXA4c09lRm5STEYwOThQa1lnSzlYQ1dGT1FYVmdQUy05elJ4LU1JZlNXVUpRVU1tN0FDTHhPMnhEQTBPOTBpNFZQTUphQnFQeVN5TkJrTTZsclZMaUEyWXJfYlJBSGg5LWRjNndjVnJzRUs2Yw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://basketball.realgm.com",
      "title": "RealGM"
    }
  },
  {
    "title": "Blue Jays fans can't help but laugh after Red Sox 'steal' their free agent - Jays Journal",
    "description": "Blue Jays fans can't help but laugh after Red Sox 'steal' their free agent  Jays JournalReport: Red Sox, ex-Jay Kiner-Falefa reach one-year deal  TSNHow Isiah Kiner-Falefa Signing Impacts Boston Red Sox Roster  Yahoo Sports CanadaToronto Blue Jays lose World Series scapegoat to division rival  blogTORed Sox Looking To Add Right-Handed-Hitting Outfielder  MLB Trade Rumors",
    "published date": "Thu, 05 Feb 2026 12:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQnZUUzhjYTJfbGxyOXNxOE0wcDVKRHdqMjR3U0p2X2s2T2hJeXRqS2EzM3NfcmNzbWZmRHl4UWlaMUdzZE1BUEVXZHhqMC1qVm5uendzZDl6YWw2SzI1SFJFdmYyN1J5SUdHSEIwZGtoU1ltUjh2VS1mdV9vWklLOFVENDdrbEthNGFGd043cnBCOTdiamFvUnhUbnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://jaysjournal.com",
      "title": "Jays Journal"
    }
  },
  {
    "title": "Why Brands Can't Say 'Super Bowl' In Their Commercials - TVLine",
    "description": "Why Brands Can't Say 'Super Bowl' In Their Commercials  TVLine",
    "published date": "Thu, 05 Feb 2026 14:38:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE15WjJfZThfNUNEaUQ0V3Q1aGJ6amNHbV84YzJhc0xGNTNDUjZXMnVmQlpDRDFiQVlOQUxwWFlHSmJaZ3N6dUxiY3RvSE1zaUlYTmtLZHZrclRnMjdqR3BPREFHSjQ0VFlrY2kzZ2ZaTFdCQWppb0ZnRlZ2Zzh3UDQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tvline.com",
      "title": "TVLine"
    }
  },
  {
    "title": "50 Extremely Rare And Jaw-Dropping Vintage Olympic Photos That Look Literally NOTHING Like The Games Today - buzzfeed.com",
    "description": "50 Extremely Rare And Jaw-Dropping Vintage Olympic Photos That Look Literally NOTHING Like The Games Today  buzzfeed.com15 Vintage Winter Olympics Photos Over the Years  goodhousekeeping.com",
    "published date": "Thu, 05 Feb 2026 16:31:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9UVjZESXB6MkFrWTVNMnZZbFBEbVJjWllpUkZGMHltdjJuLVVIcGlQWElLMFhxSnBDdzNfMV9OUTRHbWxXZ3FCZW1GM0pjQnZyWE9kQmRkMGJxcnV4ek0tWE1xZDY2Q0IyRml0a1AtTnpOWjQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "buzzfeed.com"
    }
  },
  {
    "title": "Where are NHLers staying at the Winter Olympics, and how are the beds? - CTV News",
    "description": "Where are NHLers staying at the Winter Olympics, and how are the beds?  CTV NewsThe beds are basic, the toys a distraction. Welcome to the village  Toronto StarTeam USA settles in to athletes' villages, 'smash' pizzas  NPR\"You've made it, you're here\" - IOC President Kirsty Coventry speaks on eve of Opening Ceremony at Milano Cortina 2026  Milano Cortina 2026Milan’s Already Thinking About the Second Life of New Olympics Village  Bloomberg.com",
    "published date": "Thu, 05 Feb 2026 17:44:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOVkNfMGFTblRrTDl3QWw2Y2FPaGF3RU85cUoxZ1A2SEhDTWtEYnhoRHRudDQ3ZGxiMF9feXUwX0o1eWQzUEE2UGxENTJKRUdadlZjTmFpcW00NExSSzRfNmJCcXlXejFWeVZyR3lRb0pXWTB1MzQ3Qjl6c1hzTWdWSUwtaURqcWRaVi1wQUJNbGpld3R4QndfYUVPNkhMQkN6TnZVLWRTTzg4N2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "'We had a tough time': Raptors' sloppy fourth quarter leads to collapse - Sportsnet",
    "description": "'We had a tough time': Raptors' sloppy fourth quarter leads to collapse  SportsnetRaptors stumble before NBA trade deadline  Global NewsEdwards scores 30 points as Timberwolves rally for 5th win in six games, beat Raptors 128-126  Yahoo Sports CanadaRaptors vs. Timberwolves: Toronto can’t take care of the ball, can’t take care of the lead  Toronto StarEdwards rallies Timberwolves to comeback win over Raptors  TSN",
    "published date": "Thu, 05 Feb 2026 13:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOempUeGNHcnlic3dHOFR1NkRZMFpnUHhCMk1vaXlRRVpWY196WE5VTlp1RzA2d1kzakE3ampqcmE0d3hWU3lrRVhtemJJSlhvR2JpcFYweDNIWWRtRFFlOXhHLVNoRFBWWnR3c1JvV2wyYTB0ZmhWdlN0ZWVUdHY0X3FTWHRzUlNWeDdkQ2lINnBnaUZDN2VwZjBOTVVIZVg3YnBSSE5JaWo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sportsnet.ca",
      "title": "Sportsnet"
    }
  },
  {
    "title": "Blue Jays Add 5-Year Veteran Southpaw After Framber Valdez Disappointment - Forbes",
    "description": "Blue Jays Add 5-Year Veteran Southpaw After Framber Valdez Disappointment  ForbesReport: Jays, LHP Fleming strike minor-league deal  TSNBlue Jays Add Experienced Veteran Reliever to Bolster Bullpen Depth  Sports IllustratedReport: Blue Jays sign LHP Josh Fleming to minor-league deal with spring invite  SportsnetBlue Jays, Josh Fleming Agree To Minor League Deal  MLB Trade Rumors",
    "published date": "Thu, 05 Feb 2026 15:09:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOakxYeTR5WHNvWGRLVnhEbTVuajJlYlFsZUZucEpFSWtwaXE0NXJ0Sl9zbFR6MlB1WlNROFFWYl9lRk5pSk1iRUxBWll5NTU1eEE0c0dFTmJFOTVyY3Y4cVZNdU5ZbjFkQUcxTGVFcmltRWd3LWl2ZURudzRVWXJmd0dKZDVhRmtvM2pKcVVBbEZiZHdSTThiOHpKbGg4T3lONE92SnA4WEtkWEdfdTFxTmNyd1dYREJvQ1NGRHJyVlRJOXVUTFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Olympic Committee begs fans not to boo JD Vance and Marco Rubio during opening ceremony - Irish Star",
    "description": "Olympic Committee begs fans not to boo JD Vance and Marco Rubio during opening ceremony  Irish StarProtesters rally in Milan against U.S. ICE presence ahead of opening ceremony  The Globe and MailUS Olympic officials offer 'respect and humility' to world leaders  Yahoo Sports CanadaInternational Olympic Committee Asks Fans to Not Boo JD Vance at the Opening Ceremony  Town & Country MagazineUS Olympic leaders in Milan set goals to be respectful guests and good team players  Winnipeg Free Press",
    "published date": "Fri, 06 Feb 2026 04:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQTW1ZMjgtNzZvN3VWS21GSXpNT3llUnhSazlzWnBWcl9fbEtnZzBDS2FQNXctd2FyeHFQQ2J3YThtS0M0dTRXTzczX0QtRDZ6eDI2b2hEdXZVbzEzN2FteHNSa1NSOFBhYVJlT1ppaklPQ2JhTm9zSXFZRXlteXQ0RHdCUmJVdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.irishstar.com",
      "title": "Irish Star"
    }
  },
  {
    "title": "Raptors are absolutely the biggest winners of the Anthony Davis trade - Raptors Rapture",
    "description": "Raptors are absolutely the biggest winners of the Anthony Davis trade  Raptors RaptureWizards say Anthony Davis will wear No. 23  Yahoo Sports CanadaAnthony Davis traded to Wizards: Trade grades, Dallas' next steps  ESPNAnthony Davis: NBA All-Star part of eight-player trade between Dallas Mavericks and Washington Wizards  BBCAnthony Davis trade makes it clear that the Mavericks are Cooper Flagg’s team - The Athletic  The New York Times",
    "published date": "Thu, 05 Feb 2026 14:06:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNdTBhbTIzR3d6RHl2NnIxLUljRW42V3p6eFBXR1EybzRWY0R0bGRsRzFYZ0txS1hHczBvWEE0a1gxTXpzbS1SMVB3aGdtZDhpS1FrSWlHdGhwLVRaRlp1NTR4NWpUNW4yYjQzcFE2X19TSDV3d3EwMU9BZ0p4eVdoWEhHRVJSdmhu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://raptorsrapture.com",
      "title": "Raptors Rapture"
    }
  },
  {
    "title": "Canada could consider 2038 Olympic bid should Swiss plans fall through - CBC",
    "description": "Canada could consider 2038 Olympic bid should Swiss plans fall through  CBCView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 06:49:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxObDVVV3hMU0ZqYnZwdXlybUVhdHZKR083WWQwcEE4dUlwVFFxdlVDWU9pV0RJdlpZeThWYnNkUXVWN3EwLVNJeFY4aGp0V1lETmdBblEwYXdTZHU2WnpJUEJKRU1NVUNuM2NZVVVjNkpaT09BZVlhWmtObll0SnNpYnYyUnJTYXB4cWZlZVN2UHlsZER0UVhBZU9BZ2xzQUZTaUljQkNVMm8yQXpCV01GVEFRdFlhNWdsZWpaXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  }
]