[
  {
    "title": "Trump warns Iran 'time is running out' as US military builds up in Gulf - BBC",
    "description": "Trump warns Iran 'time is running out' as US military builds up in Gulf  BBCTrump administration latest: President issues warning to Iran as Rubio testifies before Senate on Venezuela  CNNOil prices rise after Trump says a 'massive Armada is heading to Iran'  CNBCThreat of US-Iran war escalates as Trump warns time running out for deal  The GuardianTrump Administration Live Updates: President Renews Threats to Iran  The New York Times",
    "published date": "Wed, 28 Jan 2026 13:36:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE0takM3UTZwejh1aTQ4bUstRk5rWmlud21HZ1B4YlE4OG43bW5nSnVpSXhHdk5SQmUtaUVndEdyYmZXX25mT1A0emJzVXhEM0JleElhY2VCZTgyUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Kim Keon Hee, wife of South Korea’s ousted president, jailed for corruption - The Guardian",
    "description": "Kim Keon Hee, wife of South Korea’s ousted president, jailed for corruption  The GuardianWife of former South Korean president sentenced to 20 months for bribery  CBCSouth Korea's former first lady receives 20-month jail sentence for bribery  NBC NewsA string of scandals and luxury handbags: Who is South Korea's former first lady?  BBC‘The Man’ of Her Household: The Rise and Fall of a First Lady  The New York Times",
    "published date": "Wed, 28 Jan 2026 14:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOeUh2cWh3Ymt2QVplbmZlNk1MSFdtMDBrQ1RLeGEyazg3LU1vTy1EZ2Z1VHNET1Q3aWkybnplYVRJcjRSaXBKWjdhRC1jbWhqMlVqVVJKX0czUG96XzU1VnJ4MlNickRnblhyLThMMlhFMk1kLXphQk5rVDBiYVpjMW9RandGeU1hTFNJOFJmLWx3ci1uNHdTOXRLcGF5T2d2Umk2Ml9ha2xYRVUtcHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Judge temporarily bars removal of boy, 5, and father detained by immigration agents in Minnesota - CBC",
    "description": "Judge temporarily bars removal of boy, 5, and father detained by immigration agents in Minnesota  CBCUS federal judge blocks deportation of five-year-old boy and his father  The GuardianHow four faces changed the way many Americans see Trump’s immigration crackdown  CNNJudge blocks removal of 5-year-old detained by ICE in Minnesota  ABC News5-year-old who was detained in Minnesota can't be moved, judge rules  NBC News",
    "published date": "Tue, 27 Jan 2026 22:33:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBwdWJXbUJadWVTQmhHOGotSzB1amh5OTF4WHFoOElIb3d6cEo0TVo2cVhtcnlxMlFXTFFObGg0MkJ2RldiYkJjckxBa2hGVklLeDA2Q3pMN29nWXQtSnBsNFU4aXdVSGZCVnFtclBGZzZnMV8xaVJkZU1HOElTUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall - CTV News",
    "description": "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall  CTV NewsLive updates: Rep. Omar attacked in Minnesota as Trump says he wants to de-escalate state tensions  CNNRepublicans speak out on Omar attack: ‘Completely unacceptable’  The HillMan sprays U.S. lawmaker Ilhan Omar with unknown substance at town hall  CBCTrump continues to rail against Ilhan Omar after Minneapolis town hall attack – live  The Guardian",
    "published date": "Wed, 28 Jan 2026 11:55:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNRF92U2NiUHFGODE4WFBNVWxFSEd2VlNDemF2SklBWlRwRnBpYm0xc2gySjRvSUFBNEJFLWpmYkp3WGhpdXAyY3BubVljYkctbE1xeWtqRUF6Y0FZTnBMbmVBMDFwREg1Zjctb0FhUVRwOFhUZFZYM1IySWdVZ0cxQVhWbVpqNUM5cWk1cVpzUG95XzcwWkRqRU1lSE1ZeUdTR0JmYmVWMXZram9fMUhWTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Starmer’s China trip shows UK won’t bow in a multipolar world - Asia Times",
    "description": "Starmer’s China trip shows UK won’t bow in a multipolar world  Asia TimesWhy China views the UK visit as part of something bigger  BBCKeir Starmer walks tightrope over myriad issues in quest to bolster China ties  The GuardianFor Britain, China remains a ‘threat’ – but one worth doing business with  CNNAs Trump shuffles global order, U.K. prime minister heads to Beijing  The Washington Post",
    "published date": "Tue, 27 Jan 2026 10:36:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQNHNHQWEzU3BPeS1aRUowRXZ4SkJTaWhmTWdVaXlYZWM0TzFmSm1iT3I1aXRLTENna0pwbTZNOHV6bUVMV1FUYWs0UHZCaTNJcmJCU2tjaHdCUkVsdlNZc2g3SlRGZzRkTHZGZ1JHUlJlUm9kSGRzMjE3Z0ZiSGY5MW93Y2hZTmJpOVF4bkhUSHA4LThD?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://asiatimes.com",
      "title": "Asia Times"
    }
  },
  {
    "title": "Minnesota killing prompts criticism against Trump administration from Second Amendment advocates - The Globe and Mail",
    "description": "Minnesota killing prompts criticism against Trump administration from Second Amendment advocates  The Globe and MailNRA Clashes With Trump Over Gun Rights After MN Shooting  Time MagazineRepublicans wrestle with immigration message after Minneapolis backlash  BBC2 federal agents fired shots when Alex Pretti was killed in Minneapolis: U.S. official  CBCOpinion | They don’t give an inch. Even when an American is killed.  The Washington Post",
    "published date": "Tue, 27 Jan 2026 14:19:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNal9HVS0ydm82XzFOSThWUFhqaHdSSVBUc2NNYThHV2tEZ1BfeVFZdHFScGVMUHZCZVU4ZUVmTVFzdC1xbVZhanJFSHcxSl9ZZzFSNjNsSXE2WTc0Z0RwZWx4RXRXdk5XOHJWS0p3NV93bGRrclhHMU5kMC1leFZjZ0VYajMtODJXMUpHRFJLUnlpb01aQjh2aE8zRTNZcWlVM0l1aGwtelItakZIZGxuODFhYXVjN1JxalBEbDFlbE9nSk5UeXNJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Carney working on trip to India and possible trade deal - National Post",
    "description": "Carney working on trip to India and possible trade deal  National PostIndia no longer views Canada as ‘younger brother’ of U.S. under Carney, envoy says  The Globe and MailCanada and India vow to boost energy trade. What’s at stake?  Global NewsChina Deal, India Talks Connect Carney’s Trade Plans with World’s First 2 Electrostates  The Energy MixJoint Statement Between Natural Resources Canada and the Ministry of Petroleum and Natural Gas of India  BOE Report",
    "published date": "Tue, 27 Jan 2026 21:15:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNcXo1QVhJNkpUZWstMTN4VHB5Ym9RUG1jZTdTN1pTQ1RpR0Zpd21Dc3UwMl8tb3Y1RjdGV055VTZoeFlxQTdnRzRGVjF2TWo3b29rYkM3MnVDSUNxa0cyWi1oUzBnRC1DSWpYWXdkc1Q3LXluNFJpT183em1VcC1Hck8zVGpGMi1uNGxJOUhBRUVFLTNpbzRZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "ICE agent rebuffed after attempting to enter Ecuadorian consulate in Minneapolis - castanet.net",
    "description": "ICE agent rebuffed after attempting to enter Ecuadorian consulate in Minneapolis  castanet.netEcuador says ICE agent attempted to enter its Minneapolis consulate  BBCICE agents blocked from entering Ecuadorian consulate in Minneapolis, ministry says  The Washington PostEcuador says ICE agent tried to enter consulate in Minneapolis  ReutersEcuador Objects After ICE Agent Tries to Enter Minneapolis Consulate  The New York Times",
    "published date": "Wed, 28 Jan 2026 01:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOaHNFcVhtRURuZXJ1OGtTQmdndTJLaXg1b1Q1TUhZa2VjZmd0d19sSnQ0THlxWnNyWS13ZmRkVFl3bXFwSk5DYWlGUWZoaDNyRWpKTHBmd0lDVWowZnVJdTlLZnYxcm4ydlZrWThXZ00ybk1kbHE0d1dZbHdKNXJORFp0OEg5SF9JQS14ZlJ4RGEzWERIOTNhOVJRZ2hXS2plRzRybWJEYjNVWGdfQmVoZzJvR1RtVDBqcFZfSEVkVGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "castanet.net"
    }
  },
  {
    "title": "Torontonians gather to honour ICE victims as NDP calls for end to contracts with agency - CBC",
    "description": "Torontonians gather to honour ICE victims as NDP calls for end to contracts with agency  CBCVigil held in Toronto for man killed by U.S. Border Patrol in Minneapolis  CP24\"Alex Pretti won't be the last\": How Torontonians feel about ICE's violent immigration crackdown  torontolife.comAlex Pretti's sister speaks out on her loss: \"My brother is, and always will be, my hero\"  CBS NewsI grew up with Alex Pretti  The Verge",
    "published date": "Wed, 28 Jan 2026 01:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUmc1X0h2ZnVVdmJuaHR3eWY5c3h1cEt5ZjVwTTJHTzRfeDN6RXIzUU5ZTFhLV0x4RGxBOFVFS0xnUTdlbHpVVkMtYVRDT05OSThJZ1UwS3RreUt4WWFUcldWaDhhaXY3LVpFLVBtSjB1OVlJSDJEaWJSRmZSbXBrbkdxd0ZQLW16Ul9TVE13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Border Patrol commander Greg Bovino leaving Minnesota after 2nd fatal shooting - Global News",
    "description": "Border Patrol commander Greg Bovino leaving Minnesota after 2nd fatal shooting  Global NewsGreg Bovino Loses His Job  The AtlanticLive updates: Trump spars with Minneapolis mayor; man arrested after Omar attack; new Pretti details emerge  NBC NewsDesi Lydic Says Gregory Bovino Got ‘Iced Out’  The New York TimesWho is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?  BBC",
    "published date": "Tue, 27 Jan 2026 13:55:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPS0dQR3NrUC1jWnhLeURHdFRsNG9INS1Jd1RkVzZvaElnNk5lemtrVmNsYmx4UFZhUWQtamwySm9FYW02anRqdE8xWXBVeTRkTU1zdDhUNV80OC03T1VuQjh2bnN0MUF4bDJlMlRTdEFTalIzc0wxa0t1bkxPTEJuYWlOM1pSUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Australia swelters through prolonged heat wave as temperatures near 50 C - The Globe and Mail",
    "description": "Australia swelters through prolonged heat wave as temperatures near 50 C  The Globe and MailSmothering, bullying, stabbing: how it feels to be in one of the hottest places on Earth  The Guardian50°C? Parts of Australia enduring an unprecedented, multi-day heat wave  theweathernetwork.comFirefighters battle 'emergency level' blazes in Australia heatwave  BBC'Incredibly abnormal' temperatures 20C above average in parts of Australia — as it happened  Australian Broadcasting Corporation",
    "published date": "Tue, 27 Jan 2026 11:57:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQOXBJTEh2VGtPbU03dFhFVW1ZVkFTdHd3YTF5M2xXZjNJSUxZeFNzdV9fQ0cxSmswNWVMQ2puY0NNZEcxYTUwd0JvZjl2R0xBSHlVQmJIcFB0VXdPc1lXWElOSFpFVHZpbGFkdFctNHFwZ0U4V1BPZ05uOWNkczkwT3l6bUdVcTk1QmRINHR1cw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "At least 35 dead after winter storm hits U.S., with more Arctic air expected for southern states - CBC",
    "description": "At least 35 dead after winter storm hits U.S., with more Arctic air expected for southern states  CBCMore than 40 deaths from US winter storm as snow and ice persist  The GuardianU.S. braces for more freezing temperatures as massive winter storm leaves at least 45 dead  The Globe and MailDamaged homes and snowy roadways as winter storm hits US  BBCBitter cold grips the eastern US as winter storm deaths rise and power outages linger  thestar.com",
    "published date": "Tue, 27 Jan 2026 18:47:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBlVkpLYmJkcjBmalJqNGJ4X09laFlXT1lPc091WEdkZEp5czdrQUFQMmdRRFpJZDNLY3BNNGNvUi1xdmxBRWtNSjdmbW8yOUJ6TFNCc1dvblBfTGhKZVFaSGRTQmlGTW5Wb0poTVViVU9XMmw3Z2VZNFZHaHF3QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "CBS News chief Bari Weiss tells staff 'we're toast' if they continue on current path - The Independent",
    "description": "CBS News chief Bari Weiss tells staff 'we're toast' if they continue on current path  The IndependentCBS News chief Bari Weiss tells staff ‘we’re toast’ if they continue on current path  AP NewsCBS News names 19 new contributors  CBS NewsAfter rocky start, Bari Weiss plans cuts, adds commentators at CBS News  NPRBari Weiss adds new podcasters and writers as CBS contributors  Axios",
    "published date": "Wed, 28 Jan 2026 06:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQU1JqamdVZUw4SmQ3bWI4ZHFLZm40TU5IMUROclctZ1dJbEFiNjYxOHNPYWlrNTZLaGZUQXFOWS1NOWpLd1IyelBZbi1kTzVGSGxFTWZZTF9rSkVHeXI1UVRxYzNGbVR0MWNBUzQtRzcyTnZ2cG1ud1M0dmFCY1VXZGJTMEhscE51WFRSX1MxajhscjBGeFJvTUVwVVo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.independent.co.uk",
      "title": "The Independent"
    }
  },
  {
    "title": "Who were Captains Shambhavi Pathak, Sumit Kapoor killed in Ajit Pawar jet crash? - Tribune India",
    "description": "Who were Captains Shambhavi Pathak, Sumit Kapoor killed in Ajit Pawar jet crash?  Tribune IndiaObituary: Ajit Pawar, the mercurial leader who stepped out of his uncle's shadow  BBCWho was Ajit Pawar, the Indian politician killed in plane crash?  Al JazeeraAjit Pawar's death: Sharad Pawar rules out conspiracy over nephew's death; asks 'not to politicise' the accident  Times of IndiaLearjet 45 Crash in India: Deputy Chief Minister On Board, No Survivors  Flightradar24",
    "published date": "Wed, 28 Jan 2026 09:38:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPaTdvT3p6VDdrTkF0S3F3WVpvSjVBeFhyeFgtX3ZjY21nS3pGbi10eDloVkpkSFV2QlRQNGlmME9Hb3ZXSWNzSU1YeU9iRGFXRm9YXy10WUd6cm5PelpRR25BaDFhVC11NXFBZTNMVnZQYjVLVk1CYmY4NVVMRHNvekpwYVE0MzVBazV0eTU2eWcwM1E2Zk5LYnVOT05oX2syb3NLNHN1eUtGUkliT3VGcF9RZXozM2xIRU9TX3VB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tribuneindia.com",
      "title": "Tribune India"
    }
  },
  {
    "title": "North Korea launches suspected ballistic missiles toward the sea, neighbors say - castanet.net",
    "description": "North Korea launches suspected ballistic missiles toward the sea, neighbors say  castanet.netKim says North Korea soon to unveil ‘next-stage’ nuclear deterrent plans: KCNA  CTV NewsSouth Korea says North Korea launched an unidentified projectile toward the sea  halifax.citynews.caNorth Korea’s Kim to outline plans to boost nuclear arsenal  Al JazeeraNorth Korea's Kim says upcoming party congress will unveil plans to bolster nuclear deterrent  thestar.com",
    "published date": "Tue, 27 Jan 2026 15:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPQTA1Mi01YW43a0Q4ajZOV0djVzVYVUxlTVB3ZGNRRVhtejhsUVQzMjZWRnRWTXluZ2RrTVpxUElNRUVuMHI0d2NzbE5obXBlNXhUOTcwcDFtbFNKLXV2cWZ4NlpMWHd5aE5raXJMRnVMTy1fc081LXpsdHIxUGZCZUw0cVgzOUVrVmtXNXkwbFRUT2tiUlc3WVhVeW05Nnc3R2ZGSkRRbGVrVnduVkJ3aF94N2VldWh5ZXFDVG1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "castanet.net"
    }
  },
  {
    "title": "CNN Data Guru Predicts Melania’s Humiliating Box Office Flop - The Daily Beast",
    "description": "CNN Data Guru Predicts Melania’s Humiliating Box Office Flop  The Daily BeastMelania Trump rings the NYSE opening bell, placing her documentary promotion at the center of the business world  CNN‘Chaos’: Behind the Scenes of Amazon’s Melania Trump Doc  Rolling StoneMelania documentary struggles in UK cinemas as Vue admits sales are ‘soft’  The GuardianMelania Trump rings New York Stock Exchange bell before movie release  USA Today",
    "published date": "Wed, 28 Jan 2026 08:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNZkUyZWFzMnZnZmpiTHpKcHFGUktRbGtFZzVQSTUtV3VnTm1HWDBkQUFsdUNyeFpER3ViRFdicS1xdWZRREEzZy1oRjBhV29rZzE2NkxkeGpxQWFUOUh6RzVNYWg3WnV3QlA2R1pHaEV3Qk1udlh4ZHhzdkdKRnBPaHplZldZZHlMTVJrS1M4dkFXM1h2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thedailybeast.com",
      "title": "The Daily Beast"
    }
  },
  {
    "title": "Rubio Says US Ready to Use Force to Ensure Venezuela’s Cooperation - Bloomberg",
    "description": "Rubio Says US Ready to Use Force to Ensure Venezuela’s Cooperation  BloombergMaduro is not a guy you can make a deal with, says Rubio as he testifies on capture - follow live  BBCRubio to warn that US is ‘prepared to use force’ if Venezuela does not meet demands  The GuardianRubio set to warn of future military action if Venezuela's new leaders stray from US goals  ABC NewsRubio to testify about Venezuela at Senate hearing today  CBS News",
    "published date": "Wed, 28 Jan 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPdnE2cDc1eC1kaEk2UmJVejdlaFRCYW9UcnlKY2tkVEN5SkxDeXpOMmo3NDJDUkVfb0tBUlJXbTJQRlRDNFFhb0F5N0w2SnFHYnpNUEc2LUxKaXdSWDF5dDN2Z2FLbUVaazl6RmR1NlZuSTBLS2tkMG9tRTEyRGRYNmJIOG5feU9XcVg3QlVNSXQtLVpESTYzR0c0UmNkWF9zV1NaakpjcXFiaGZOcHUwZnRNaVR4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg"
    }
  },
  {
    "title": "Russia suffers more losses in Ukraine than any country since WWII - Euronews.com",
    "description": "Russia suffers more losses in Ukraine than any country since WWII  Euronews.comRussia denies think-tank assessment that 1.2 million of its troops have died in Ukraine  CBCRussian and Ukrainian military casualties in war nearing 2m, study finds  The GuardianCSIS: Russia has lost 1.2 million soldiers, twice as many as Ukraine  Українська правдаRussia’s 1.2 million casualties in Ukraine dwarf all its conflicts since World War II, report says  CNN",
    "published date": "Wed, 28 Jan 2026 10:22:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOZE84UWxCU0Yyc2VwWE9tRXZIYmdqQURncTl6T0cwV0l4eGZSeE5JM3RfWGVnYUdyWVlTOUNNemxVUjlXa25relp4X3FnVUVodU1XWHpnbnBxTnZmbmRlQjZqQW04YTdCdUFpTzQya0pyUkZqM2x1bFRDNllBQzAySlg2TlRRbU5kel90LWxPMFR2Ql81a01TSjY3V1RBSlRpR2JEVGcwN29NZWZrTEY0QjgtczlsTl9vbjNwMGlOSkVfS25K?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "1 person shot, in critical condition in incident involving U.S. Border Patrol - Global News",
    "description": "1 person shot, in critical condition in incident involving U.S. Border Patrol  Global NewsBorder Patrol shoots human trafficking suspect in Arizona  The HillMan in hospital after shooting by border agent in Arizona  The GuardianOne person in critical condition after shooting at US-Mexico border  Euronews.comMan shot in incident involving Border Patrol in Arizona  NBC News",
    "published date": "Tue, 27 Jan 2026 20:03:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNd2Q4dmpZS3pibjJWUjJyYlJxVkdybkZYbFNxSlhiNDBwdTczMVphTzctc3FIcjBsM0F2ejlmckNfZENQMzRoTlpMMm9iQ2RtMUpIeEF2b2hpd216ZDFUekR5Q1RfY0NHVVhReGM2LUFtUzFsU2NTMGNUcGdwbjg2bmV3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "‘Doomsday Clock’ closer to midnight than ever before - CTV News",
    "description": "‘Doomsday Clock’ closer to midnight than ever before  CTV NewsDoomsday Clock 2026: Scientists set new time  CNNDoomsday Clock at 85 seconds to midnight amid threats from climate crisis and AI  The Guardian'Every second counts' - Doomsday Clock moves closer to midnight  BBCDoomsday Clock Ticks Closer Than Ever to Apocalypse  The New York Times",
    "published date": "Tue, 27 Jan 2026 17:39:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNeUVEb0QtWU9yZTNxUTRhNEFfd0VoYkI5RktTbFdXbVFzZ21kRnFMNVpkQzlFY3Jaa1E5b1h0V0diN0xDNnFMVXFuZVh4VHl1UVBoN0tXaUxkVzd0a0o1WFJEVmh0YV9QNTZYbVVyUENjendqVFZ6V2JUeTMzOHI5UUhxdUpOeHU4LXJnYVNUMHBaZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "US embassy removes flags with names of fallen Danish soldiers - Euractiv",
    "description": "US embassy removes flags with names of fallen Danish soldiers  EuractivUS embassy angers Danish veterans by removing flags  Digital Journal",
    "published date": "Wed, 28 Jan 2026 11:23:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPaEstWDFWSE1KOEZKOFRWWFBHZW95SHIyOVVnYUFYR2VlNm1FVXFpVXptd3g0RXByRjVxRGktYzRlczJ0ZXQ0ZTNMOWxiSktPM2lHZ1pVbXd5a1hkR25iT1hQbUpwd0hUQ2ZFVlZ2U0hLdlhBUjlOSzJwYW9WeXJpUTNzOThDbnI1bE5rRG9UeXdFM1gyVU9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euractiv.com",
      "title": "Euractiv"
    }
  },
  {
    "title": "Milan mayor blasts ICE as ‘militia that kills’ before Winter Olympics role - Al Jazeera",
    "description": "Milan mayor blasts ICE as ‘militia that kills’ before Winter Olympics role  Al JazeeraUS to send ICE agents to Winter Olympics, prompting Italian anger  BBCItalians furious over deployment of ICE agents to bolster US security at Winter Olympics  CNNVideo: Italians reject the need for U.S. ICE agents at Winter Olympics  The Globe and Mail‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics  The Guardian",
    "published date": "Tue, 27 Jan 2026 12:01:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQdHNTdzVWc3dvUmVNRnJvVl90Um11cTlBbTVXLVBUeTN1cEVPNTJPWTR6Smh2aFg4aFVMOVl5bkN3aDVOQWJ6MG94TnB4bEp4b0JJOG9yV01SN2R3NlJLZ2V0eUdZTngtek5DV1RWeUdtV0JaZTFlN09seGNZRWNENGY1QVBFWWNhX2xSNVZzR3dKMU1EODVRdFR6U0JUczFGekpYeFkxdzdnMEJCejJoWnFzQ19VUdIBuwFBVV95cUxPV2xzTlpDZ0tzRk1HbW9VTUdLU0tKOFQtSXNkbDFKSTVHSjZqbHh2bkZXcFlIMzNhZTYzcUttOUxXTFFpcWVlOTh3Nl90ZmZ4UHpQcDVmelNZbnNySHZ4ZzFGNDd5dk9IMmVLVEF5MmFCSUswelRmSGE1enBmbFYzcVVPZlNsbm5EZW56bm04U2ZiREtGSHJSV0U3TTRJLTNfTThMQnZ2VzdodERJYzJ1WGp3UWxUcDhwOHJr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Hakeem Jeffries' threat to Trump: Fire Kristi Noem or we move to impeachment - Axios",
    "description": "Hakeem Jeffries' threat to Trump: Fire Kristi Noem or we move to impeachment  AxiosPressure mounts on Kristi Noem as Republicans join calls for her to go  The GuardianGOP on defense over Noem’s future as Congress nears shutdown deadline  The HillTwo Republican senators call for Kristi Noem to resign as DHS secretary  NBC NewsTrump keeps defending Noem. Allies see a warning sign.  Politico",
    "published date": "Tue, 27 Jan 2026 19:18:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOLWU0amVHc2NNczZfbjNXNE1fcDF2MERmMWd6aGRHSEJIMGlxQVk0bkhPa3poMVMxSDVyUFVobG9KY3dkOXpDZnROcVFvaF9FaUlMR2o5N0lMTnhVSmVYejAtNWJyYTNRVmxCbi1WaGtiNzFrcEVYckl3eGZZbHpod2JBQkxGMVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "'The mother of all deals': EU and India strike landmark agreement amid U.S. tariffs - CBC",
    "description": "'The mother of all deals': EU and India strike landmark agreement amid U.S. tariffs  CBCIndia-EU trade deal under the looming shadow of Donald Trump  BBCEU-India deal ‘accelerated’ over past six months amid Trump’s tariff threats – Europe live  The GuardianThe EU is seeking new trade partnerships. Here’s why  halifax.citynews.caAll eyes are on Trump's reaction to the 'mother of all deals' between India and the EU  CNBC",
    "published date": "Tue, 27 Jan 2026 16:58:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE5Jejk2aTVsWHRfRXRhSWZINkI1WVVzb3pRSExmMno3WGViV2JMQ3I0V2RtREowdmd4YktpRVM3UjZ1NkdlbzVwTzJEajl5OHVjLVJndmtxMVBaVENiQ2ljQXZDNl83QzA5LVdZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "1,000 evacuated as landslide leaves homes on the precipice in Sicilian town - ANSA",
    "description": "1,000 evacuated as landslide leaves homes on the precipice in Sicilian town  ANSASicily hit by huge landslide in aftermath of Storm Harry  BBCHuge landslide leaves Sicilian homes teetering on cliff edge as 1,500 people are evacuated  thestar.comLandslide leaves Sicilian town teetering on cliff edge  CP24Sicilian Town on Cliff Edge as Massive Storm Triggers Landslides  Bloomberg",
    "published date": "Mon, 26 Jan 2026 16:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxOZnZST1VQXzZZMmFha29rZzgxdVgzOUc0d3YxWkF0amRxU3ZoQ0lwTDJCR2lVVi1ZUzVkRFlWcmVWLTJPYVJoeVRZMmxOazhGQ0ZIVlp6VC12aG5tdDUxZjZLMUw3eVJxZlRSZHBSa2phZ1R2YndtSzVxeGhuOEc3MERyLW5kSmRPV3R6NzdsWlVZZjVxLThtTF85THB0M2RoaXZjb1JkZ0kySzlDUENjSTBGM3lwR3pPb3hFdTlUTHZiSER2NHFHSWNoMUYyLUNuVzRydHhsX0h4VmJLRzhJdFJidkxKY2JMSEY5bmVvZUF2MDJJTnhUSUMxWXBsLW8xcEN30gGIAkFVX3lxTE5RYkJuX3otM3lpZ25zSWdTa3J0ZUMwSVJ0bGhUeTF1SU10TzBUTWNEUmhURmRoTHVyR1FnYThtaGlZUENSbW83WUpzalNmeUY3ZnFfTHVKWHRmMFphNExyZElDRC1MRUFrNlA1dGxqMVAtaVRTS01XcE9lUHcyUFhUVmo3OVVlejFqUktJbFVXSjBIbmxtSnNOUVdEREFDQXdnQzlpNEM4dGNwMGR6OWpPQXBUc0FGR3F4LUJWZkZjYThoZTZJTjY2S3F6LW9lQmw5MXh3Um5DRVNsSnJ2dFc5NkZGTFNGcjVqUldaM3RRTkZlYVNzRTNudTBSMHdxX21TbTZZTUR4VA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ansa.it",
      "title": "ANSA"
    }
  },
  {
    "title": "Nobel economist has a theory about Trump's new feud with Canada - Alternet",
    "description": "Nobel economist has a theory about Trump's new feud with Canada  AlternetTrump withdraws Canada's invitation to Board of Peace  BBC‘Bummer about President Trump revoking the invitation ... to join the illustrious Board of Peace.’ Letters to the editor for Jan. 26  The Globe and MailTrump to Canada’s Mark Carney: you are uninvited to my ‘board of peace’ – as it happened  The GuardianTranscript: Canadian ambassador Kirsten Hillman on \"Face the Nation with Margaret Brennan,\" Jan. 25, 2026  CBS News",
    "published date": "Wed, 28 Jan 2026 11:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOQjdzUEZ5ZndtU242dE1qeV9mWVZqbU9LMllEXzVGWGc0ZjRVQm02YlVMR1NuRF9KRFpqdTlFRU8wU1plcXNKTmM1Wmd5Y0JlYUR5Tzl0amstNUxDQ3Z6MWNOcTlvR0I3bktmODU1YWlqbVNuY0xJSzFFSHJ2SHNyWlROXzN5TVdta0FCekRFSnFEZXk0UHhJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.alternet.org",
      "title": "Alternet"
    }
  },
  {
    "title": "Mexico’s president says cancellation of oil shipment to Cuba is ‘sovereign’ decision - The Guardian",
    "description": "Mexico’s president says cancellation of oil shipment to Cuba is ‘sovereign’ decision  The GuardianVenezuela and Mexico: How Trump is trying to choke Cuba’s oil supplies  Al JazeeraMexico Shelves Planned Shipment of Oil to Cuba Amid US Tensions  BloombergExclusive: Mexico weighs stopping oil shipments to Cuba amid concerns of Trump retaliation, sources say  ReutersPost-Maduro, pressure builds on Mexico over Cuba’s new oil lifeline  Fox News",
    "published date": "Tue, 27 Jan 2026 19:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1TU3lHeG5QY1QzejI1Y3lxSjBOVDdteTVQbGtwSHVrT0hIS3ZweU9kc3EzY1dMWlFIUFdNWmhXRW9mZFRJdnZNOThHc0FidDJpaTVnWm9zUUdUSUlKcGxoMm9JZVRnYWlkVDVCSWhHWlBES3ZBa0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "‘Political thunderstorm’: inside Trump’s attacks on the Somali community - The Guardian",
    "description": "‘Political thunderstorm’: inside Trump’s attacks on the Somali community  The Guardian'White hot rage': What the people of Minneapolis say about ICE tactics in their city | CBC News  CBCThe Legal Fallout in Minnesota Has Only Just Begun  PoliticoBoth sides dig in as Trump’s ICE crackdown on Minnesota shows no signs of letting up  The Globe and MailMinnesota Proved MAGA Wrong  The Atlantic",
    "published date": "Wed, 28 Jan 2026 13:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNZmZEWHNVMl83MlJiUURZZ1RPbG9vNDRwRmhTQXFTQUx4VEpKZU00VkVTVGNYS2xzdGNIZFFIaFBacktucVhmdTRLcWF5SnJWeUJUcE1pTE9tWDZmMTVVLTk3WUV5V0tfV1VveUFLN0NTdGExemFISFFKc2FQbXJtd1lYOENfUm1INEdfUjlQTzh3Z0Fyb21UV19Hb2lrR251a3d1QmNEVFBJTmFuWkJ1aHh3RQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "US president talks up economy amid outrage over Minnesota killings - Al Jazeera",
    "description": "US president talks up economy amid outrage over Minnesota killings  Al Jazeera'We've got to win': Trump calls on MAGA to turn out for midterm elections  NBC NewsWatch: Why Trump is hitting the road to rally Americans  BBCDonald Trump’s Iowa base shows cracks over Minneapolis deaths  Financial TimesTrump kicks off midterms push amid economic warning signs  MS NOW",
    "published date": "Wed, 28 Jan 2026 03:21:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPdXhSY0FHcnBWenVqSkp3Zk9DZHFSRzNQQ3lHazdUUW8zdkx2bWZYT25rbkV4VzhOQjFhV0RoSnJVZTBTbGhycTlsZW4wY21iUzBvY1VvMW9yelNhTGNkbGVIOFJzYV9FWVpteXhCWU1GbFltRHJtRG8tbHROQldmWDctU1RMTTY1dmJ1QWg5NHNsQ0pzRENfZGxweTlNR3VGUHI0YTJOREd0Y3BFWGVvb2hnNNIBuAFBVV95cUxONF91dERjRlpISUs5QkhoTEd4Yk83dnVQSVlRZW5WR2JITGJtVXZJS0czOXdlQk0wcWo0ak12VFo4bVJ6ZlJYMGQwaVoxUjlSamxpR1hGZVNkVzBaeVNXdzBiYUJwbXIxaUxBZ2pobnU3N2ZEdHAwamhTRmc1UmVDcWphbzdJZmRFYkE2bmdDSXA4VXZ1X1NXNFd3V2VzU3hHU1QyaXdyeHFiTXNueXhoTWNGM2pGemlN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Greenland will not give in, PM says, as Denmark warns world order as we know it is over - CNBC",
    "description": "Greenland will not give in, PM says, as Denmark warns world order as we know it is over  CNBC'Red line.' Greenland shuts down Trump on sovereignty for US bases  USA TodayGreenland minister: Trump push to acquire bases as sovereign US territory a ‘red line’  The HillDanish troops who fought alongside US forces feel betrayed, as Trump threatens Greenland and denigrates NATO  CNNGreenland says there were red lines that could not be crossed in talks with U.S.  The Globe and Mail",
    "published date": "Wed, 28 Jan 2026 11:13:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPeTBINFdJRGpneEw1M0ZRaE01MERMUjd3bG81MnVISEdvZm1YejNTamdoZm8weDdHREh3aTVERDk5TzNJSS0td3NkbDhDa0ozVFhKOXY0VWlkWDNqTmJSWi13dENNQUhaLWs1RmUwZ1kwbmdZeU5WNzdBMzNPM1lWWWFWYTF5d2hfVkHSAY8BQVVfeXFMUEFTbU53c0lkVEVQRTNyajJMSHdQN2Z4Nzc2d0xPZWdVanNrZDVpbFdPRE1qQ09PN2dIOE80V0JVSWtuSVVPNUtJVDdRYXZTTlJXUTI2Q1VnMjRrd2oybTJrUDlWbWNqWlhoQ3RYWVZEQzdHU21yaFB1bXlLemx4Qlhwb3VnaVRZUEhTNUdjSzQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "US YouTube star IShowSpeed to get Ghanaian passport as Africa tour ends - BBC",
    "description": "US YouTube star IShowSpeed to get Ghanaian passport as Africa tour ends  BBCIShowSpeed wraps up Africa tour highlighting the continent’s cultural diversity  thestar.comCan IShowSpeed’s travel videos change how people think about Africa?  CBCIShowSpeed celebrates 50 million YouTube subscribers while on tour in Africa  thespec.comAmerican influencer shares 'another' Africa on tour  France 24",
    "published date": "Wed, 28 Jan 2026 13:25:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBBVnppQ0RkRWY4XzRWM0VmM3pVSmJhTkg4Y19iNms4WEhkdEtvWGlKWnFTMnQ2VXp5ejZ4a0pzVlhRbGpXWV9POE1HcVNzNmc3U0pJR2pUSVBOQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb - Bored Panda",
    "description": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb  Bored PandaAlex Honnold on His Record-Breaking Live Netflix Skyscraper Climb, Whether the Gasping Crowds Made Him Nervous and How Windy It Got  VarietyHow Netflix Turned Alex Honnold's “Life-or-Death” Climb Into a Calculated Business Bet  Huddle Up | Joe Pompliano'It feels infinite': Alex Honnold describes his rope-free climb up Taipei 101 skyscraper  NBC NewsMrBeast slams Netflix over Alex Honnold’s payday for viral Taipei 101 climb  Yahoo Sports Canada",
    "published date": "Tue, 27 Jan 2026 20:13:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOQldyUHl5SkR4c2hPbEotRi1iSjJYNjZ3NlFSLUktclNLb2trd1RkSGZUbGRSMHE3MVcyQzFRZjdRdmJucmtmZmZ2c1hfUlFyWkdRdEFsRWxzcGpxaUtteFZZVDIxVHJpOHBDMEo1NzFRcHRvMkRLOUN1VmFfZzJvWW1yYw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boredpanda.com",
      "title": "Bored Panda"
    }
  },
  {
    "title": "Trump warns Iraq against returning former PM al-Maliki to power amid worries about Iran influence - AP News",
    "description": "Trump warns Iraq against returning former PM al-Maliki to power amid worries about Iran influence  AP NewsIraq’s former prime minister denounces ‘blatant American interference’ in election  The GuardianFormer Iraqi PM Maliki denounces Trump threats to end support if he returns to power  BBCIraq’s al-Maliki rejects ‘violation of sovereignty’ after Trump’s threats  Al JazeeraIran Update, January 26, 2026  Institute for the Study of War",
    "published date": "Wed, 28 Jan 2026 03:32:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPenhUNUltOW5pd25vZ25OQ2F0Y0hnSXd1dVY4MnhBZWdqWjBSS1U1Q3p2Skhqa2NoZ0lBU3huaVEtcUt1WW9hdHZWdzhBYXFGV1g3b1ZsUlhCM0Yybmo1U0s3LTcwQmg3b1lpVlBnMVJhRkJYNFhSUUk1VlduT0pRUGZ3TFBSM0t0RVRHcS0xVldXRmVpTjZLZDE2Tnl1dWh3MVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Trump says he will impose new tariffs on South Korea as he criticises delays in trade deal - The Guardian",
    "description": "Trump says he will impose new tariffs on South Korea as he criticises delays in trade deal  The GuardianAsian shares track Wall Street gains as gold edges lower  halifax.citynews.caTrump threatens to hike tariffs on South Korean goods over inaction on trade deal  CTV NewsTrump says he’ll raise tariffs to 25% on South Korea, which would put Hyundai at a disadvantage  Automotive NewsTrump tariffs live updates: EU, India seal trade deal in rebuff to Trump as he threatens S. Korea tariff boost  Yahoo! Finance Canada",
    "published date": "Tue, 27 Jan 2026 01:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaGJhOGRJTlJRLWhjZE1vWVJFNnBHRFo1LV80eXNHRjJCdTVLbEUzYkw0bFcyX2tTdkhOd3hVcEVrbkgyZ0VlaXd6NTdxLTJIUEk3QVdVSFhDYkpmYkFWbmFSNVVxMC10TFZKclFZWEsweWEwVmY5UmtGS0FrUnQ2UmI5d1BqQVl0WUVZejN0bXBTRXQxUnVmSi1tNmpDQmE3Z0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Mohammed bin Salman closes airspace for action against Iran - jpost.com",
    "description": "Mohammed bin Salman closes airspace for action against Iran  jpost.comKey Gulf Allies Say They Won’t Aid U.S. in an Iran Strike, Limiting Trump’s Options  The Wall Street JournalIran’s President Pezeshkian warns of regional instability amid US threats  Al JazeeraIran warns against ‘instability’ after U.S. strike group arrives  CTV NewsSaudi won't allow airspace to be used for military action against Iran, crown prince says  Reuters",
    "published date": "Tue, 27 Jan 2026 23:33:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE11cGtQTUhlQkFmX0NZRU1pVFcwZnFmcUxRWW10QXF1eE5pSW15OTVwRW1tenYzQnI1QllTZ0dVN2h5aXJHeXdHWGFidXNJRDhmZkRUYndfdnNJSkNR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "jpost.com"
    }
  },
  {
    "title": "China is purging its military leaders. Is this a step toward war? - vox.com",
    "description": "China is purging its military leaders. Is this a step toward war?  vox.comZhang Youxia: Purge of China's top general leaves military in crisis  BBCExclusive | China’s Top General Accused of Giving Nuclear Secrets to U.S. - WSJ  The Wall Street JournalXi Jinping has dismissed two of China’s most senior generals. What does this mean?  The ConversationPurge of top Chinese general throws military into turmoil, raises questions about Taiwan  NBC News",
    "published date": "Tue, 27 Jan 2026 19:55:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE40M3FRWmhTRnlZaTFMOHlObm9WSjZseFUxOEk1V2tSX2xSV0g2NjNUZlZ1Wko1VW9YTTNKTER5b2Q4RDJrUUFYaDFvUFFKWS1vQ3prd1E1V2tOZ2lHSnR2cTkwTWctbjhtMlV1Nzl5RUpLU2Z3ZFVpeWRJZXo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vox.com",
      "title": "vox.com"
    }
  },
  {
    "title": "A bomb cyclone is more likely to impact parts of the East Coast this weekend. Here are the updated scenarios - CNN",
    "description": "A bomb cyclone is more likely to impact parts of the East Coast this weekend. Here are the updated scenarios  CNNAnother Weekend Winter Storm? Forecast Details and Updates.  The New York TimesWhere a nor’easter will bring heavy snow, strong winds and waves this weekend  The Washington PostEast Coast Storm This Weekend Could Become Bomb Cyclone With More Snow, Wind From Carolinas To New England  weather.comLive updates: Millions digging out, thousands without power as next winter storm threat looms  FOX Weather",
    "published date": "Tue, 27 Jan 2026 17:19:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5pOGNlWDhiVjJjSVJSSjUwLXRJVWJoNzdSeFVwdklsV1NWc3owS0ZvQzJVZGY3RmRHbUVOWENwLXduYjZNcVJ1WS0yeGstVGtzZTdqTVpmZmx4VU1qemVnVEVHbEliQkhIaTRQUkhpRzVGeFJPbU5CQg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Young Brits are no longer drinking – so what will a Saturday night look like for future generations? | Emma Brockes - The Guardian",
    "description": "Young Brits are no longer drinking – so what will a Saturday night look like for future generations? | Emma Brockes  The GuardianOne in four adults in England do not drink alcohol, survey finds  The Guardian",
    "published date": "Wed, 28 Jan 2026 15:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPeEN5Uk5RalNva3lUSEh1VElVZUJveW1mY0xHZmpXYmdHTk9mdktVMGlsTll6cEc1SGdWQUFPYUlDUGpPV01JQmc0cE1VNi03dHFNVzBjV3dwU2owYndyZUNLX290alhTNmlKZThKbjZBNV9nQXh4bEZxc1hvby1YYnJ6c3Q3OVNHQWFsMjdVYS1XVFpQcHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Exclusive-US intelligence raises doubts about Venezuela leader’s cooperation By Reuters - Investing.com",
    "description": "Exclusive-US intelligence raises doubts about Venezuela leader’s cooperation By Reuters  Investing.comExclusive: US intelligence raises doubts about Venezuela leader's cooperation  ReutersVenezuela’s acting president says she has had ‘enough’ of U.S. orders  CTV NewsLeaked video shows Venezuela regime’s desperate struggle to control message  The GuardianVenezuela’s Delcy Rodríguez assured US of cooperation before Maduro’s capture  The Guardian",
    "published date": "Wed, 28 Jan 2026 00:14:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPMGJWU1hrUzEwSXVxM0NheEl2UnlrR2dkOV9XZlBLbnBibGZDa2VsMXMwR3NBRVRYUldFbkU0UVktU1hlX09YOHpDcWNGYVUwNmJxaGY2SC1iNktub1VpazREVHVTWUMxdXZLdzlYZnZuUFFHOFMxaTdWZ1VSaVZTLWpKOTdBQWlxUFV3X2cwNW4yQUFNWktWY29uWTRzLXQ4LUZJbnM5UE00eVNHOE9OWUdJc0UzZXp4cm1nWnUwMTRJOXY3RHZ5WXJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.investing.com",
      "title": "Investing.com"
    }
  },
  {
    "title": "Ukraine sees shift in Russia's peace talks delegation as 'pseudo-historical lectures' end, foreign minister says - kyivindependent.com",
    "description": "Ukraine sees shift in Russia's peace talks delegation as 'pseudo-historical lectures' end, foreign minister says  kyivindependent.comCould trilateral talks yield a breakthrough in Ukraine-Russia war?  BBCZelenskyy says U.S. security guarantees agreement ‘100% ready’ to sign  Global NewsUS links security guarantees for Ukraine to peace deal ceding territory  Financial TimesUkraine war briefing: Kyiv and Moscow set to hold more face-to-face talks as US hails ‘big step’ forward  The Guardian",
    "published date": "Tue, 27 Jan 2026 18:02:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUG51b3U3M21NMFpfNURqbS1USW1QbmM3dTNOMHB2Z3NCNEFjNUNyQjFaN3plNDhienJ2bG03Z3RGVmQ0NzBzWHFfNVZoTGtZa1FJWUk3V1pmNkxpU1VPN21KeDFiS0YyT2VHSnVtZGswdlRPMVRoaklvZ2ktX1Z1VG1JcloxWVRf?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "kyivindependent.com"
    }
  },
  {
    "title": "‘We are freezing,’ High Park tenants say recurring winter heating failures have made apartments unlivable - nowtoronto.com",
    "description": "‘We are freezing,’ High Park tenants say recurring winter heating failures have made apartments unlivable  nowtoronto.comMultiple tenants complain of heat issues at High Park apartment complex  toronto.citynews.caApartment tenants want compensation from landlord after living without heat for three weeks  winnipegfreepress.com",
    "published date": "Tue, 27 Jan 2026 19:51:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxNWE9WY210T0RBZ29hUHE0bnE2TVljWkpKTmZJM1lnNkdpZ2lzamFIYmo1UlA3TG9hUnZCSjFQaWlpdE9lTnpybDhiR1F6Ml95QUM2WFlwZWU5X3FrTUU1SmNqWnNkUFdXUWNnczhxRWtzVUlGdVdORG83N2FobEhtSWpheHVIMEJuTWljQVoyZ2dYNlpHTmk0MnVLdzVseFlfRVloWVlpdFBBbUx0NFY3V21GLUE5b1NzT1gzbTAtSUFsNzRuMkpWdnBCbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nowtoronto.com",
      "title": "nowtoronto.com"
    }
  },
  {
    "title": "Is the U.S. on a slow march to civil war? - halifaxexaminer.ca",
    "description": "Is the U.S. on a slow march to civil war?  halifaxexaminer.caIs Canada Ready for an American Civil War?  The Walrus",
    "published date": "Tue, 27 Jan 2026 15:47:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOdktqcWc0d0o0M0VhLUZSZ1Vxa1B2c0lPTVRhMy1QSi1CMm9mYUlITml1RHNzZkhYcU15YTNEb0JMVjlvZUcwdzJSRmt1a0dld2hhMEdJYlpFZTRxLTRGeXdVN25GMEhvXzlNQmZqZjVYeWFmbXJKYXBGYXprWWd5WUgyZ2MyX1pZS2VvdQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.halifaxexaminer.ca",
      "title": "halifaxexaminer.ca"
    }
  },
  {
    "title": "Canada Accelerates Armor Plans To Contend With Growing Threats - The War Zone",
    "description": "Canada Accelerates Armor Plans To Contend With Growing Threats  The War ZoneThe US drew up a plan to invade Canada in 1930. Now Trump is reviving old fears  The GuardianMilitary models Canadian response to hypothetical American invasion  The Globe and MailIn defence of Canada  The Hill TimesIAV 2026: Canada builds up divisional capabilities  Janes",
    "published date": "Tue, 27 Jan 2026 20:39:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNS19WcUNHQ3NrdDhmSzhaU0pvUGVtSTBlRUpMTkhoOFhhRUhFVFpVNFVwYjR2RFFHWTU3ang1bWtOVTVhS0s1Ujg0dEVaZnpFXzB4VmFmcUx0aVRhZFlBS3NuaDJSM3lPUkVCR0V6VUpXM1drRmtNVFBhSVJCNjVsVHFPWWJGc19yZHhyTzlGUTM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.twz.com",
      "title": "The War Zone"
    }
  },
  {
    "title": "When Power Beats Right: Thucydides’ Ancient Warning for Today - GreekReporter.com",
    "description": "When Power Beats Right: Thucydides’ Ancient Warning for Today  GreekReporter.com",
    "published date": "Mon, 26 Jan 2026 21:50:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5neXZkLUVtM3JIZWFnVmtpRnJ3ZzBUY3RKbGo4V0FUM1RBZG42Y2YwRk00WE5xcEw5ZkFHUWNpQ2J2YWtCSzFwNk5tUzNHcHRsVHA3QUY4SDhHTUdQOFpScExGU3BtSXQxWS1CVkFmcHFjZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://greekreporter.com",
      "title": "GreekReporter.com"
    }
  },
  {
    "title": "Family condemn 'disgusting' hospital corridor care - BBC",
    "description": "Family condemn 'disgusting' hospital corridor care  BBC",
    "published date": "Tue, 27 Jan 2026 18:55:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9HN0dtTlNUa0MzeEJkMF8taUE5ZjVIRFZCQXdOOWRhZDZkaFJQMUlDRFhxUlJSazRWelcyM1U3YXRwaDlvQzNkVFFVOUdsOE9xWG9xdTU5dk9Odw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trade wars muzzle allied talks on Trump’s Golden Dome missile shield - Ars Technica",
    "description": "Trade wars muzzle allied talks on Trump’s Golden Dome missile shield  Ars TechnicaWhat to know about Greenland’s role in nuclear defence and Trump’s ‘Golden Dome’  CTV NewsOne Year On, Trump's Golden Dome Missile Defense System Struggles For Momentum As China Pushes Ahead: Report  YahooWaltz says Trump eyeing Arctic ‘Iron Dome’ to counter nuclear threats from Russia, China  Yahoo News CanadaGolden Dome Czar Charts Two-Year Plan Focused on Command and Control, Interceptors  Air & Space Forces Magazine",
    "published date": "Tue, 27 Jan 2026 15:42:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQUEp1SXR6Yml3UFR0Zmc2NlZ3YmJTam5OdDMzMTdnbW85bzFaaWZCWElsVlBnWmllQVpPU1dVeGdEV3JrMFFiVG4weTIzUkdHMTdrT3lBVURWSjBScE11NlJJbUhoMU4zNGlqbjRtZTlabmkzNTg5elNYc0JWRkNLMzRFdHFwNlZuZDAyUXJZLVhmYUpHOTdMTFhxRkM3b2stQTNBUmJzT2hoZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://arstechnica.com",
      "title": "Ars Technica"
    }
  }
]