[
  {
    "title": "US and Iran talks brought back from the brink after White House relents on move to Oman - The Guardian",
    "description": "US and Iran talks brought back from the brink after White House relents on move to Oman  The GuardianUS-Iran talks live: Key negotiations begin in Oman in push to prevent war  Al JazeeraU.S. and Iran Gather for High-Stakes Nuclear Talks  The Wall Street JournalUS and Iran talks begin in Oman amid Trump’s military threats – live  The GuardianA convoy believed to be carrying American officials arrives for Iran-US talks in Muscat, Oman  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 19:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbFdEdGc0cVJSNzBpeFdZSEpJQnVDU3Y5SlhfY0RzcFJIeVQ3dkQxOEU0X21KN0s4ek5ieHZieUpVdW81WHVKZ0JHY0FUUS1MLUdSYlBTb2pWRnltY3RFM3pCbHpPWjZzSDR6U0hpU3BaSTZ4TnZPREZOTFdtUmJLM043aTdlRFVKY0x5cklYaTRjWkVNUnpF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Authorities investigating Nancy Guthrie's disappearance say they're taking ransom note seriously - CBC",
    "description": "Authorities investigating Nancy Guthrie's disappearance say they're taking ransom note seriously  CBCPolice found blood on porch belonging to news anchor's missing mother  BBCLive updates: The search for Savannah Guthrie’s missing mother Nancy  cnn.comAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZSavannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video  Global News",
    "published date": "Thu, 05 Feb 2026 20:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQb0ZoLWdDeHFrdVczTkJmODJfUllCTmNQTGdxX1lyekJRUm5Rbko5X3A0MEUwQWF4cXF3VjNncWVLeDg3RTBlTlBqTmVWcGhWbm5STHd5TTJ5S1duZl94NWd3UkNqVWpJeWRwLU8xMjVFX08xb2w3MVNqS2hWTTlzdFdKWWJwZThaa2FZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race - BBC",
    "description": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race  BBCU.S.-Russia nuclear weapons treaty has expired. What happens now?  CBCTrump's nuclear arms control push with Russia hinges on China  BBCTrump rejects call from Russia’s Putin to extend cap on nuclear deployments  Al JazeeraVideo: Trump rejects offer to extend New START deployment limits  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 05:33:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBwTk95Wm0wM2RqNThES3c5NWpidTUtM2FMamFxajk1bnNTNXFwbExpR3lvMnNFR3NjLUFjSllZMkZtNDg1TkxoSGRmTXd4SV80MlZOaU9lVzVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Analilia Mejia and Tom Malinowski locked in a tight Democratic primary for US House from New Jersey - cnn.com",
    "description": "Analilia Mejia and Tom Malinowski locked in a tight Democratic primary for US House from New Jersey  cnn.comSteve Kornacki: Democratic primary season kicks off with an anti-establishment earthquake  NBC NewsNew Jersey 11th Congressional District Special Primary Election Results 2026  The New York TimesMalinowski, Mejia locked in tight primary race for Sherrill’s House seat in New Jersey  The HillPro-Israel lobby group pressures ‘moderate’ US Democrat in new strategy  Al Jazeera",
    "published date": "Thu, 05 Feb 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUWFBNDNIRHpnLVpWU0xUNG1wYzJtSXZFY3dhNVhIVVV6aUxrRXF2MUZIbTF1RDFvbm1yQUQ0WjNySkdrVFo1VFJGV2VDb2RUVjZ3YloyX095anZ1anQwRTJQM25lMlY5VWpvNUYtR1NOYjRXNkZoWE0yNExuXzZldjlLWmNEeXZzb2dzb0lnbXlHZHdRNENocHd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Russia-Ukraine talks conclude without breakthrough on ending war - Al Jazeera",
    "description": "Russia-Ukraine talks conclude without breakthrough on ending war  Al JazeeraUkraine war briefing: Kyiv and Moscow hold major prisoner exchange  The GuardianU.S., Russia agree to re-establish military-to-military dialogue after 4-year pause  CBCRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBCRussia and Ukraine hold a second day of U.S.-brokered peace talks in Abu Dhabi  CTV News",
    "published date": "Thu, 05 Feb 2026 17:03:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQ3hXQ0UxclI5b00ybDM2bmw2VVRJVWc1SzJveF96X3N2d1lLU0dxVEVGdUlwSS1MbFUxb0NhLTZxRDd2Umg0Tm4xcDA5eHBGRXJnRmZPWlZLWlhOVzA4cDhZN184SlAxcTlkeDFWZTU0Mkw0YVNsWk9VRlBVcHRXTFM5aFpyMmxsdGdfbjF3ZDJCbExnOW1zVlZzcEfSAaIBQVVfeXFMTjdNalczeDlOckFsWGJ4Z1NUN3R6TGZEVUU4eWtRMzVtdlVQYzBfSjRpWDNabnlDcFE3cnM4ZjhxQWw4TmEtYm8tNmtqdHhsZnVxUnA5ZnhDMTUxWDlyX0tGZGkyakhXbEwwOWVobXo1dzZuTXY4SFFhR1hCTjdRVkVNOEYyVkxOQVRjRHB1aDNhNmxKV1BTWDlSQWJuUDM4QzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "'I never left your side': Emails reveal more about Mandelson's Epstein friendship - BBC",
    "description": "'I never left your side': Emails reveal more about Mandelson's Epstein friendship  BBCHow the Epstein files unravelled a senior British politician's career — and now threaten PM Starmer's job  CBCCould this be the beginning of the end for Starmer?  BBCThe Guardian view on Downing Street in crisis: Keir Starmer’s judgment looks fatally flawed | Editorial  The GuardianHow Epstein-Mandelson files rocked the UK government  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 21:28:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1jVFNCY1pRODI3TnpHOXhneUtPYVFseWl0ZkRoYWFDQlFXRDBYZnJMdzRtMVg0UG1qdXoyTjRTTGw1Zl9QOW9rOXMwMjZuZmxhTXdVd0ttYWN1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "700 ICE officers will leave Minnesota immediately, border czar says - Global News",
    "description": "700 ICE officers will leave Minnesota immediately, border czar says  Global NewsTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsWhat Is Minnesota’s Policy on Cooperating With Federal Immigration Enforcement?  The New York TimesU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBCTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The Guardian",
    "published date": "Wed, 04 Feb 2026 15:54:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54aXpHTFJoNWhCT09waGl2dzZtc2RsUUtkT0gxTWxBUHV4eldjZVN0VlN5cWx6SHNTVFlQcXBBRm5yTTlRcXlYOEd2QTlrTTE0cUhzd09hSUM3MnhyZnh1OVRvOXJPNGIwcjJ4aWdsQlRmNGJYa0hfNVFZUnI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says - The Globe and Mail",
    "description": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailAnand in D.C. as Trump administration makes the case for critical mineral trade zone  CTV NewsU.S. wants to create a critical minerals trading bloc with its allies to counter China  BNN BloombergAnand to attend U.S. meeting on international collaboration on critical minerals  CityNews EdmontonTrump unveils $12bn critical minerals stockpile scheme in apparent move to counter China’s dominance  The Guardian",
    "published date": "Thu, 05 Feb 2026 02:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcDJaN1A4UFF3VHJ2QjJJeE4zTVMtSUNadFBqTHVvZmxLdGRUZTIyVjBZWmhpWlNpMkJxUzRIX1otMHJvTVRiYXdYWVUtVDJHWEQ1Y1RDOWtGRTh6SmtVdk9yMjh3UW5pb1ZqZTBJSmhmb3k3aXdjRUZEQ00xZi1FelhBOGx1dC1YQkJxTi03NmI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "The reopened Rafah crossing in Gaza brings pitiful gains - The Economist",
    "description": "The reopened Rafah crossing in Gaza brings pitiful gains  The EconomistGaza patients head to Rafah crossing as people return amid Israeli attacks  Al JazeeraRafah crossing between Gaza and Egypt reopens, with strict limits  Radio-CanadaPalestinians in Egypt torn on return to a Gaza with 'no future'  France 24Women returning to Gaza say Israeli troops bound and interrogated them after Rafah crossing  Toronto Star",
    "published date": "Thu, 05 Feb 2026 13:47:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNNnF5YUxON3liSTB4STBwVThiQVRlemt1TFlLN3U3VGxlYnZYOWxOa1hCS1M0dExuZmN2dWFCXzIwOV9qbDJUS2hwaDg2S1oxX2xoMy0xZDF5Q3llbXJsV1B1MHM5dmM4ek9LZ3dSZUpELXpUQ09QQVZmWkprVTdTWmluVkVQT21KU3BYYWdjaG54R0lYYWszbnM5WFhKZkdaSUxwbnUtLThVZWZIVDhWdVphdFplOUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Iran seizes 2 foreign oil tankers in Persian Gulf, state media says - CTV News",
    "description": "Iran seizes 2 foreign oil tankers in Persian Gulf, state media says  CTV NewsView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 20:34:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQNjlMVjZ0Y3BUOVplY0VjRVBaUUFCRURkNFJBX2tBSmlqYWFFdzBwQWVINEJRNFhmRldVWDl3TkZWZWsyOVVqMVQydXBSSExWaEhEZGo0RUJQSkRacGZYdk80Ym1UQ1BBUFdMc0RrVy1va3l4V2d6Z0Y1U2JlY3J3elVTRUpfWnphT01sUEN5Qzg3N0dDY3M2NjQwM1JsamFXT3A5a0t0NA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files - BBC",
    "description": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files  BBCWho is in the Epstein files?  BBCWoody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files  The GuardianThe Government Published Dozens of Nude Photos in the Epstein Files  The New York TimesLatest Jeffrey Epstein file disclosures rock the rich and powerful: Top takeaways  NBC News",
    "published date": "Wed, 04 Feb 2026 19:57:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE00OXVqYjJYVU5FdVk5dmVkTmxBM2RjREthcWJxWkZnRllqLWRwRUctRFVfZGlZUDB3M01SQm9BOE91bkRhc1lIMEp1SmJOdWJMdUtOZm9UR1FIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - Castanet",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  CastanetICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianDHS Panics After ICE Barbie’s Fourth Amendment Assault Flamed  YahooOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesNew ICE memo gives deportation officers more leeway to conduct warrantless arrests  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 04:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOaVJsb2RzeFVFNjUtZ3R0Ri0zV0ZicWY5b25sN2o4MVA3a2tSVGk4Q2ZVVC12M0VSa01OZko5d1J2ejBQcnB6YkdaTE1qTktvTXBvWTIwWGpFTEVWNFpDczVCUFl5aV9FQjZrQWFyWHFjSzVvU1NPQ3hfcGNRbTBEMWcxNVpPZ3VjSVlKc2dXVzFzNHc3eVBPZzd1Y0tlaGgtNVhsY0VQMjFyZzVuS01HekdNUjdoMGpPNGV1U3lkVGZwck96aTQ5T2lrMkFHS3gzenFkZUJ0LTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’ - Toronto Star",
    "description": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCMy Life Among The 33 Pomeranians (And A Few Thousand Other Dogs)  DefectorA culinary feast of chicken and carrots for the Westminster dog show winner, Penny  Yahoo News CanadaWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBC",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNTmE2X1hMNzJnbEJUV2h3bVVrOGZyVXUxX2NwakN5SW5fZFpobHNyOXVxdUYxODc3dElTWkwwR2xWRGdGYnFnMFVocEEwTDU2bVBqeGxDTFVpcmVmVXlrMDZmbkZLWWZJOUgzQ05iSlJodDRSWWJ3VHJkMDFZVG5tbEdLMndCSTIzR1ZsaXR0bEZFczF3dXVDWE9oakxjOV9MUG9vZ2d3QU52aWpzYmFmc1ZJVWtZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Xi calls for ‘mutual respect’ in Trump call, issues Taiwan warning - Dawn",
    "description": "Xi calls for ‘mutual respect’ in Trump call, issues Taiwan warning  DawnUS must be prudent when supplying arms to Taiwan, Xi tells Trump  BBCChina's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade  CNBCTrump and Xi discuss Iran in wide-ranging call as U.S. presses China and others to break from Tehran  CTV NewsTrump touts ‘very positive’ call with Chinese leader Xi  The Washington Post",
    "published date": "Wed, 04 Feb 2026 17:50:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiSEFVX3lxTE1ZZEduWVotV184ZzVuZFNJcnIzaTJVZEZMbGg3RjU2X1dpZUgtWThZYkxmdVJyTDA0S2lKOTRXaTBRVnZuWUZiRtIBTkFVX3lxTE5GSURKMi1qaFdIM3A4TDgtUll3WnBxbzlxUmhqc2pnNmxNcDBQZ196cVNjSGwtbktKdnE2SlhwZXRPQ2RMVC1nNWFxZFhzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dawn.com",
      "title": "Dawn"
    }
  },
  {
    "title": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children - CBC",
    "description": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCThe Gaza ceasefire began months ago. Here’s why the fighting persists  CTV NewsVideo: Israel strikes on Gaza kill at least 24  The Globe and MailDaily Briefing Feb. 4 – Hamas, far from disarming, attacks IDF in Gaza  The Times of IsraelIsraeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire  BBC",
    "published date": "Wed, 04 Feb 2026 18:35:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdl9FdVNVdVhzdzBSTTVGYXR1XzBTMU10RDBUVjZPUElUQnlIaVZ3UGozaVRYcEZGdVBoMmdja2p2eEhFWEhCQzZXOHhLeFU1eEVsb3lIaGtvODR1Y3dYZFE3d2NtcWNoWHhuLXFQZ3BEaDJKbkx3aVJqQ1RSU3hQcXRQVTI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots - The Globe and Mail",
    "description": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots  The Globe and MailTulsi Gabbard went down to Georgia — and no one in the Trump administration wants to take credit  cnn.comWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – as it happened  The GuardianFulton County fights back after the FBI seizes 2020 ballots | As It Happens | On Demand | CBC Listen  CBCTrump Had Unusual Call With F.B.I. Agents After Election Center Search  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZzlTUVU3aExkTFJLTWlfR3ZBejVnNVU1Mm9QMWlicUJqelZJWFI0ZlVkblJhMDBrenlva2Njd1p4RjRaSUxmN25CcTRHTTZSbkxITEJNb1dmdkJtd0dYaUxXbVBKb1Bqd0pHT2lwWk14cmlPQnA0c1ZMeDZjOFJ3T2ZJM0JUNy1KcGY3Ym1HcXNHX21hTzVjUC1UMnBPc3VjWGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "How Iran’s infighting consistently derails diplomacy - ایران اینترنشنال",
    "description": "How Iran’s infighting consistently derails diplomacy  ایران اینترنشنالNegotiating with Iran Poses Significant Risks  FilmoGaz",
    "published date": "Wed, 04 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE45SzNUMktOcS1YYVRGcHJnVzVwZzJxaTlWdDNEV19QdG1xQkFYd2VvUFRaeGZlU0hTcTJ4SkJyX20xaE80QmJqbEdJNm9td0xEVlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iranintl.com",
      "title": "ایران اینترنشنال"
    }
  },
  {
    "title": "US strikes another alleged drug-trafficking boat in Eastern Pacific - AP News",
    "description": "US strikes another alleged drug-trafficking boat in Eastern Pacific  AP NewsView Full Coverage on Google News",
    "published date": "Fri, 06 Feb 2026 04:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQY1hSa0dvUnN4TlFSYU1mZXlUeXI5OWM4YnBTMG9FdERzLUVQTTNFSl9qeWprVFRjZXdDVERQWnJPSW0ySEh5eTVOMFJ5Z0J2VW54YzViSWVnSmF6b0REVG5scXd0QU5WSEVUWE1VaTZMcjNvSE9ibFM1QThGdmpQSEtvNzBmWmpZOFp4VEFSbkRRemxMV3VJOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "‘Photocopy your passport’: Canadians describe travel to Cuba - CTV News",
    "description": "‘Photocopy your passport’: Canadians describe travel to Cuba  CTV NewsCuba travel advisory: Canada updates its advice, warns of 'worsening' crisis  Vancouver Is AwesomeNew Cuba travel advisory urges 'high degree of caution.' Should Canadians worry?  CBCCanada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’  Toronto StarUS face-off with Cuba could put Canada 'in a vise grip', says former ambassador  Canada's National Observer",
    "published date": "Fri, 06 Feb 2026 00:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOWUhJOGtzQ3hwR092UEJWWE9JeElyLTNkelpJLXkzM3hvSTVQc3Z3Ul9UWjA4Z2plV19MTGlLSGJGSTBYNnhQX3BXYnljZksxVFUyUDJnbHQtMXJlRTNEZHA5SWZreDVfMjZqZl9UUkotSTFyYVpVMjBrR2RXX1FDZnd1QlA3bXRBNTBxVkZWNVB4Z2Q0eGJWeHdPTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield. - The 19th News",
    "description": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th NewsJudge blocks Trump administration’s stripping of Haitians’ protected status  The GuardianOhio’s GOP governor: Ending TPS for Haitians would be ‘blow to the economy’  The HillOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesJudge rules against U.S. plan to strip 350,000 Haitians of legal status, notes 'racial animus' of Noem, Trump  CBC",
    "published date": "Thu, 05 Feb 2026 20:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5GVDZFcTVPS3dZMGt2bkZTVHAwVkYyR1dkU0tvbXlpdTdXc2hUZkl0N0JndU1BNVBLMF90TnlEVlJsN2dERjFqaEtTM3pKUUVMUTUtWERmU2RNUmlZd1JITjg1UUhUbVZWeHptYW01SUtGdmYxcVV2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "Washington Post cuts a third of its staff in a blow to a legendary news brand - Toronto Star",
    "description": "Washington Post cuts a third of its staff in a blow to a legendary news brand  Toronto StarThe Washington Post can close its sports desk, but not even Jeff Bezos can kill it  The Globe and MailOpinion | An Elegy for My Washington Post  The New York TimesHow Jeff Bezos Broke The Washington Post  The AtlanticWashington Post layoffs include entire Ukraine, Middle East bureaus  Global News",
    "published date": "Wed, 04 Feb 2026 14:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNaFV3bUZPYXZnRFdHM3lSdXFGTFhjcXBydVpHd0hrVHhVbENMV3gwbFdZZk5ZTDA0cHVqWGN6MVN4Sm42WHFnc2p3Q2lvZDBCN1RIU0hNeGNqZ0NhVUNWQjY0bXBTWmZjWTNEV3laXzkwa2l0d3lVdl9TYThhdnlaTXpzVGFpMTZvMmM2LVowWGlDcFozRGUxVjV3TzlCekJZb3NiWHRtZHg4cTZa?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Libya’s top prosecutor launches probe into Saif al-Islam Gaddafi’s killing - Al Jazeera",
    "description": "Libya’s top prosecutor launches probe into Saif al-Islam Gaddafi’s killing  Al JazeeraSon of late dictator Gadhafi killed in Libya  CBCKilling of Saif Gaddafi removes alternative to Libya’s rival governments  Al JazeeraSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.frMurdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite  The Guardian",
    "published date": "Wed, 04 Feb 2026 14:55:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPSzM5T2lYRHZ1WVlub2xWUHliLVZyRzk3SjlpLThtY2xNWVpUTnpvYjFINGxOemcwd0h1UUMwUUpTZWZBc0l2QlM0NTUwZDl3N0x6di0zd0pqOFRVODc4Znp3VFlKNzJZNHp6Mlp0LWdYSUNIMHd4QnVoUkZESEp6c2UwbjFrV1FLZmR4Yl9GSThHUy1VeW10VzNuMnU0aG1LUEJPZ01aV1ptR09hSnZ1T2130gG3AUFVX3lxTFBPTDlQUmRkY0JWczNQT1RGSEFTMnFxSWowN0RQcUpZZW5UVGFkREZXN00wdEhUUlowcm9BeXhQY3h0RjVSN2ZVcGo0dG5aTi1nSUxrbGJKUHJJUzc2REh6U1RwZmpuTGgxMlBVcUwzeVZfVjZRN3o3R3BpNE1LRXlOVzhCbzJLWUhIc2xlZDZIbHEyeFZHdWswNVdzZURERUVOd0tMUEVGNVFxVzd1eEtsdEZCbzY3TQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release - BBC",
    "description": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release  BBCChairman of major law firm resigns after Epstein emails become public  CTV NewsTop lawyer, art world exec resign in more Epstein files fallout  MS NOWBrad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout  The New York TimesExclusive | A Revolt Inside Paul Weiss Over the Epstein Files Took Down Brad Karp  The Wall Street Journal",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape - Reuters",
    "description": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape  ReutersSon of Norway's Crown Princess gives evidence as rape trial continues  BBCStepson of Norway’s crown prince denies drugging alleged rape victim  CP24Son of Norway’s crown princess cries in court, denies videos on his phone show rape  CTV NewsWhat to know about Norway’s royals as crown princess and her son face new scrutiny  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 13:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNemhDRHpyYVVyVFFkeks3akdpMkhNb1p1cG83cmI4Q2J0bnh4elE3TXBWNlZfeVRPZ3NaMklGMHBjWTlkRTlfSHlRM1JtS0w1XzlvSV9nVHdPOU9rOU1GM2VxWWFrM0ZaNVdrU2RTZ3RndURvaUNuUWg0cUZ1M1RjWGdBRXZOZ3EtRGJhNnFwVmVwSU9YWnkwQ29iX3Z6ZGhlUkVXNFBKb2pmRURrdWppTFF3cjRmSWdXWEtGMGNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Supreme Court lets California use new Democrat-friendly congressional map - cnn.com",
    "description": "Supreme Court lets California use new Democrat-friendly congressional map  cnn.comWhy a Republican Supreme Court just handed a victory to Democrats  vox.comU.S. Supreme Court green lights California pro-Democrat redistricting voting map  CBCUS Supreme Court rejects challenge to California redistricting map  Al JazeeraSupreme Court declines to block California's new mid-decade congressional map  Yahoo News Canada",
    "published date": "Wed, 04 Feb 2026 19:24:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOa1pVR3NqN0prbzFCdnMyNlllQ3AwMGpxbXRMQm85YnJiaEhkemhocDZ4RmxTOFdHN3FkRFM2RjdCYk5iMW1DQnJQQk8wUGtMVVB6Z3ZpMjVCUF9lLUJDOUU2bmozMmgwSjFHdWQwalMzQVhnb0pwcVpDVXc0cUhTRmx6a3dCN1B4NVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Mexico's Pemex supplied $496 million of oil to Cuba in 2025 - Reuters",
    "description": "Mexico's Pemex supplied $496 million of oil to Cuba in 2025  ReutersExclusive: Mexico seeking way to send fuel to Cuba without being hit by US tariffs, sources say  ReutersUN warns of humanitarian collapse in Cuba as US seeks to block oil supplies  Al JazeeraTrump’s threatened tariffs over oil to Cuba put Mexico in a bind  cnn.comCuba in crisis amid fuel shortages, ongoing blackouts  dw.com",
    "published date": "Wed, 04 Feb 2026 15:28:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQRDg0QjBnS0NQUk5nd0xvTldpeWNPeTVzWmxBdWtNdUk1Q1BpMTF3WlBwTGpNX0Z4MDZoTm1HY2szYjI2UjYycllGd2p5Z2xlZ092VjBxSl9PX3paZ2h4SG11TnNnZkNCd29NaEcweWl2NjkzV3V3SHhQRmcxMFNLTEs5bldTVDBweG54ektpV3pNM1QxVkZ0QXJLZG44WTJyb3FLa1ZOclU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Collision with Greek coastguard boat leaves 15 migrants dead - BBC",
    "description": "Collision with Greek coastguard boat leaves 15 migrants dead  BBCGreek doctors work to identify parents of injured migrant children after deadly boat collision  Yahoo! Finance CanadaDeadly collision between Greek coast guard vessel and speedboat carrying migrants  MSNFifteen migrants die after boat collides with Greek coast guard vessel off Chios, coast guard says  cnn.comGreek rescuers search for potential missing people after deadly migrant boat collision  Toronto Star",
    "published date": "Wed, 04 Feb 2026 11:59:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA0S2dQT0FUVlJtalM1RE84aFloNF9tYlFDSnFoa01iMjB2Y01sMXcyMmFnZ25nWDFrVnFlTXZocklmR04xNG16Ujc5TV9uZ3VKb09QTW9sV0NKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran Is Obsessed with ‘Sinking’ a U.S. Navy Nuclear Supercarrier - 19FortyFive",
    "description": "Iran Is Obsessed with ‘Sinking’ a U.S. Navy Nuclear Supercarrier  19FortyFiveUS says it shot down Iranian drone flying towards aircraft carrier  BBCThe Abraham Lincoln Carrier Strike Group Is Operating Near Iran  ForbesUS shoots Iranian drone as Iran’s president seeks ‘fair and equitable negotiations’  Toronto StarUS shoots down Iranian drone approaching aircraft carrier, official says  Reuters",
    "published date": "Thu, 05 Feb 2026 13:45:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNUFdYZjdMWGRTSEVuTzVjaEo0R2ZSZnFHVkFwU0l6dDJzMTdNMzdtOGtGRnFyVldUenNOanJaQ2VWUFdOdUVaY1Y4Y2dlQWdKaUk0UmlhRGlTTXF4VUt3NFg3YURQRWUyY3JVZm51WlI4MTR2YXZDUkc4TmYxZ2pIdFlSN0o2emQ5djBTTTBVbTRsY1lkY1VESUdCY1NSSmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.19fortyfive.com",
      "title": "19FortyFive"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuba to introduce plan to address fuel shortage amid US blockade  Al JazeeraCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba ready for US talks ‘with no preconditions’ as energy shortages bite  Financial TimesExclusive: Cuba says it’s ready to talk to US, but not about regime change, as Trump ramps up pressure  cnn.com",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Attacks on civilians in central and northern Nigeria kill nearly 200 - CBC",
    "description": "Attacks on civilians in central and northern Nigeria kill nearly 200  CBCAt the scene: Muslims killed 'over rejection of extremist ideology' in Nigeria  BBCNigeria sets up new military operation after deadly attack, while abducted Christians return home  CTV News‘They killed my sons’: chief of Nigerian village where jihadists massacred hundreds recounts night of terror  The GuardianWhat to know after scores were killed in Nigeria while abducted Christians came home  Toronto Star",
    "published date": "Wed, 04 Feb 2026 18:54:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE41dEtTMEVZOV9nbzIxVjh5Vld4MlF6Y01VNV9aWXRxUTAzN3VReVIwMkZZRlpBRDM0bG5Fd0ljQkoxSk1JUm1qd0l5TGxMelhlM1FMQzVjUHhjMUkzaEtaNUVCS2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’ - The Times of Israel",
    "description": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  cnn.comAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsDonald Trump wants to end America’s half-century conflict with Iran  The EconomistSatellite imagery shows where the U.S. military is positioned near Iran  The Washington Post",
    "published date": "Wed, 04 Feb 2026 23:21:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQUG5BTGhYMGZlT0tmV0h6TDYwTV9sTmRncmhPNnQ2dnRjSHR4djZoVkh2YVFkRy1kaWNZYUhzb09HcUZwNWIwMVIzc0lZTVdHOFdBaVBQakxOLWRPemp3LXp3SHVyN1RuZnl0ZVFDNEY1ajAwZ3JaOU91UGpWUDdTTl9wX0p2R1NwWldoX3FZZjdXZ1kwYWlNa04zWldxTTVMODRuTGdfQzBhRU5w0gGyAUFVX3lxTFBESjFieHBPN1NQbDktUm1GdDBXNE9zSW5Ua0dNSlNLbDAzNTNLZXpXNG9ubzRUQ3R4cVF5ODhNSE9CZHZiZzZkeXFFNGdlWWpLR3pCME1XcHZvNk0xZzRhMWIxTzdoRnpvWWg5RFFmMkRvWjY2SktLbHhtdGx3MFIzZ3RkYW9FaHBXR1hRRkhqNnc5SEs1bngtX21VWXU4VUhNYUdUOE9pcjFjZ2ozZkxBd2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "At least one killed as Storm Leonardo tears through Portugal and Spain - Euronews.com",
    "description": "At least one killed as Storm Leonardo tears through Portugal and Spain  Euronews.comView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 08:18:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPNXViMEFROUctSGxJWGJ4MmtEYzF0TXZuNzF6OXQ1R2JfV09GWV9IekdxNTBIUDN3dC1GRlpGNGhBb0xUNEVqMHgyQzl1MmF2TzQ0dUo4QUR0Snl5OU8tYW5aVURTNkhnOHItLWxWdGRNVktwRmM3MWVSdnZDWjdWNExudlZCOGhVdVV4WXAzR3NkS1ZPZl9FVHNZampSU3k2U1FwUHFuN2RoR3RSb2V0aVZqcmYtN2xkalBWSWZNcnJBc04t?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "description": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims  BBCA Second Accuser Alleges a “Sexual Encounter” With Andrew Mountbatten-Windsor at Jeffrey Epstein’s Request  Vanity FairHeads roll in Europe over Epstein files revelations  The HillEpstein fallout triggers resignations, probes  CTV NewsKing must feel vindicated for cutting off Andrew by latest Epstein files release | Andrew Mountbatten-Windsor  The Guardian",
    "published date": "Wed, 04 Feb 2026 18:02:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBuMGZhSzRRSkJyM1BSNWJpSUo3Mmt4eTNJLXN1ZGhHRDl5bzgtMUZNSEZEOTNmd2ZoOTd3VDk1d2t2U28yVW56VktFTFl2TG1pVXZpUU43Mlg0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "[2026-02-04] Risch, Shaheen Meet with DRC President Félix Tshisekedi |... - Senate Committee on Foreign Relations (.gov)",
    "description": "[2026-02-04] Risch, Shaheen Meet with DRC President Félix Tshisekedi |...  Senate Committee on Foreign Relations (.gov)‘We are exploited’: Congolese fear losing out as US makes minerals deals  Al JazeeraCongo to ship copper to Saudi Arabia, UAE via US-backed venture  Mining.com",
    "published date": "Wed, 04 Feb 2026 22:12:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQTHBEaTZkWkdKb3pPU0FqNHYxOVRjeFFsTlNNUE1vb0VjWnZxT2lMdV9FQi02ZUJZZlN4NGJwdTJnZGlReVZoY0xKN29kMF9kdGxGcE5rbUNCUkxDOWs0S0FUcmpyRmFFMnJQME9fNFRVVG1EMUtUODhtaGRsWmFYUGR2ZUJwX1hHZ1NPRFk4V0pjSkpabVJ6a2R0M0t6ZUczQ3pZUW5R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foreign.senate.gov",
      "title": "Senate Committee on Foreign Relations (.gov)"
    }
  },
  {
    "title": "‘Lots of foreigners on the beach’: Australian teen whose family was swept away in the sea struggled to ge - Times of India",
    "description": "‘Lots of foreigners on the beach’: Australian teen whose family was swept away in the sea struggled to ge  Times of IndiaMother says asking 13-year-old son to swim four hours to save family ‘one of the hardest decisions’  The Guardian'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family  BBC13-year-old boy speaks out after swimming miles to save family stranded at sea  ABC NewsAustralian boy, 13, swims for 4 hours to save family swept out to sea  CBC",
    "published date": "Wed, 04 Feb 2026 20:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgJBVV95cUxNVGd3TVg0Uzl2N096ZlFBdGptX0hPckxzbnpralJpR3JkY00tT212TnktZkhyaGM0Vm1MX196NnVIdjRvd3RmSDQyMUpjWlB1V1N6ZXlhUDIwU2Vidm1FZE5MdHotWjcxenNvYXJCazlkNWotRGQ3dFVEQlUxTndVT3ZsLWdveEV4WDlJM3JYUlcyZEROcXNOa1drZmFzVVJlSXBUR0NrdG9DSE5PM05nVnRzc0NNa0d5SE82enNPa3o0dmtCSW93VXVvZjFNWEtHY0xjdDdxcHdMcUJXdjhjOU5yNzc5bXhCNVdaVXpYbFR6OXdJM3F6cXYtdnBNYWVLdGVabDE2UXA1VU16S0VCM1JfNnJoTE4xdFRmb0pvbFJ3RC1ibkHSAasCQVVfeXFMTUtsNHN2SG1YUHBQWm94MzBObjZDM0Vqa1RZQ2toV1BKTmpDRWZ4bHJXbmpWVUNDZ2cwRDEwdWtPRUR5TjlSTk14bTNEbndjM0lvVUxEb3JwRS1wTEhLZEJRQURBQ05qUWNWOFRhVE1pOTFDY3hseDdjaFNnTlh6RnZmck90VEZ5S0M0d2V4WTNtTWcwaTY3LVNIM055WjFkM2RQQWdvekJlbFc4eWhodkpWd2xJbUtGQzd0LUJDOENvcEY3OWRZTzE1UUNRQWJaWlJoMXlKNjR0ZTNlb0VZRm1EM3BNQWd1ZDNNMHlNUUU5ZWZ3MEk4RzNTMTBlWlUzY2U5c2U5cV91OEdiUUZlSi1jem05aEk4TU9ZalVFQmtFVFR4azBKeGRsY3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "Man who tried to assassinate Trump sentenced to life in prison - Global News",
    "description": "Man who tried to assassinate Trump sentenced to life in prison  Global NewsMan sentenced to life in prison for 2024 attempt on Trump's life  BBCRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  cnn.comVideo: Man who tried to assassinate Donald Trump at Florida golf course gets life in prison  The Globe and MailRyan Routh sentenced to life in prison for trying to assassinate Trump  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 19:30:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZjhVSzZZNm9qaTdFNHE5cVJCSVNMRVdFZU1MVF90RDVRUGhlZmhWWEVVX3RBRGl1aTZZUVl1N0o5dllBRmlwQ2p0bzJPM3B3OEZZRDl2ZVZkdEZFZGgtREdsZVhub0Q4QkZHeF8zRjI3aThHcHFEWDlEUHRIbHUzUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Vladimir Putin to visit China, Kremlin says, as Xi calls for 'grand plan' to strengthen ties - NBC News",
    "description": "Vladimir Putin to visit China, Kremlin says, as Xi calls for 'grand plan' to strengthen ties  NBC NewsXi and Putin discuss growing links between China, Russia in video call  The Globe and MailThe Chinese Yoke: Russia’s Return to Vassalship  War on the RocksRussia’s Putin holds video call with China’s Xi  Al JazeeraChina’s Xi and Russia’s Putin hold talks by video  Toronto Star",
    "published date": "Wed, 04 Feb 2026 13:38:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPVW1KNm9YendmWmtBYjZORW94dkJuUGk4Q2ktczVsMjdOV184bjNEaDhJcTBnSENDMU80Snc3ZnBzb0h1aWlOU19iaU1VcUFoLWJfYThwemxtVUxDQ2R6dzdaWWRGZEtSNGtqU2owRUFCQU00R2hhMXR4U3luWlhtWmV5VndaNUlmMGtILW9HOTNGU2Vo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "Want to know what’s wrong with you? - The Economist",
    "description": "Want to know what’s wrong with you?  The EconomistDestructive peddlers of health misinformation: Social media influencers  Genetic Literacy Project",
    "published date": "Thu, 05 Feb 2026 13:47:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOVmpxNzJIdGp3RDdvWEJNOUQ4c0EzV2J4WGE0TE42eFhycjNGRnVuWF95Z0lsME93ZTExZ1M5Rjh5N21LSjFHam5zRG9iclhQZFBRRk5hbFR1cUVoeXFvRWNmUGZWa1dfV2lCWllCYVpmVkVIVEtSa2sxVE1YaFE1MVhmWUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Israeli intelligence chief's brother charged with smuggling cigarettes into Gaza - BBC",
    "description": "Israeli intelligence chief's brother charged with smuggling cigarettes into Gaza  BBCBezalel Zini, brother of Israel’s security chief, arrested in bust of alleged Gaza smuggling ring  cnn.comA dozen people including Israeli soldiers charged with smuggling goods into Gaza  CTV NewsShin Bet chief’s brother charged with ‘assisting enemy’ over cigarette smuggling in Gaza  The GuardianIsraeli Civilians And Soldiers Charged In Massive Gaza Smuggling Ring  i24NEWS",
    "published date": "Thu, 05 Feb 2026 17:58:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9oRE10WHE0ZHR0dXVqVUh2V05uTkpkQ0NUcXlOWnRpbDdLQUx3UU1VZFB2OTVXbGd6TFdzNHNsLWNBTnNDQVBlVFlrT3ZGWVRzWHo2Vl84bWdfQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump endorses Prime Minister Viktor Orban for Hungary’s April election - Al Jazeera",
    "description": "Trump endorses Prime Minister Viktor Orban for Hungary’s April election  Al JazeeraNewsletter: Trump endorses Orbán | Former Israeli PM says Iran regime change should come from within  Euronews.comTrump endorses Hungary's Orban for re-election ahead of April poll  ReutersDonald Trump endorses Hungary's Viktor Orbán ahead of key elections  Euronews.com",
    "published date": "Thu, 05 Feb 2026 20:33:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQSVFnamhtU0EyTV9CdWdJRDRwcHMyRDVBX2lFOUxDb25WOHAteldoV2pCeEM5LTA3YkxCRjdNekZ1MmFlRmNKTUdZMkFzWnR4QXE4RzVHSG9nVlJENDJZYmNBdlhWVHlPMHZpU2U2WjI5ZzUxZkp5VjlLWGVQeE9ra3JnclU0VmVqMlZXb280R0p6R1Y2aDBtU1FORExtdzE2UldKUEVjRHFEUGxtYk1n0gG0AUFVX3lxTE9TNkExUW4tTDVuX3RfZlh6cWtfVWRXWkI4Y2p6WHZmVmQtX3NPVlZBYUFHZk5ieGtjVWtPQnMwVWRabEhNTU1WdDFzM3NYc1NkRWJaQ2pDanVNT3hxMDZNUUkxcDRvUXZYQ2YzVHhEYmJsbVRQN2xCUVVoSDBZVXRFZnFtZDFxcDVjMF82UmFEaGtiNEhLRDZfYVZPMlNPWlZZbkRqa3JXWTBwNlBjTVpCUVZQZA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs - Al Jazeera",
    "description": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs  Al JazeeraSpain hits back at Pavel Durov over mass Telegram post on social media ban plan  The Guardian‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  cnn.comEurope Takes On Tech With Social Media Bans and Paris Raid on X  bloomberg.comSpain’s youth minister floats countrywide ban on X  politico.eu",
    "published date": "Wed, 04 Feb 2026 10:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcnlONWxoSGlTLVN1bWNOX2ZaekJnRWNPYkVReEJRRHpoQ2ZLVi1ibGlNZzg2cVZKckRpY0xlUzBkSjRsekRKcTNEeU5Xa2NwaHZhZjV2QTZNMmE5MHhMMV8wQjRZUmN2Q21XRm41dDJORFlpeEI2T2ZQbUJjQ0YxR05hVm4tTjFCeGRubEZXOF9mQzR2YVVrbjJVOW5LZzRrR0d6RkJtemxUaXdu0gGyAUFVX3lxTE1rSE92d0hQNG56QWlvNVA0S2doUU5Qd21JcGlsckpsX205b2FkYXFEbjdrTGVNYzBvdlI5S3NjZ0sycGVyUE1XYTJIS0lzV21vZlZrN2taOExiNGI1dXZ1T2FBN0tDcGtodmZOVXB4d3RZdzdLVTd0ZjNiLTBYQVpiamR3VUdJOEloSUJodHpXMk9Nd1BQLVRERmhBNUZxLVgzUmhlX2Z2WVkzZDN6aHJFNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Trying to reserve your street parking spot with cones could result in hefty fines: City of Toronto - CityNews Toronto",
    "description": "Trying to reserve your street parking spot with cones could result in hefty fines: City of Toronto  CityNews TorontoWho Has ‘Dibs’ on That Freshly Shoveled Parking Space?  The New York TimesSnowstorm parking wars turn violent as cities crack down, neighbors clash and police warn of escalation  foxnews.com",
    "published date": "Thu, 05 Feb 2026 23:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOaHhqcWpUZEc0bllfZ0d1LU5JUVNUZzlHVXk5UU80REhRalU3NFUxNGNlcHAtbnFHN05TbHJNQjZaZEprWXppLUxxVEd0QnI0UE5EX2RTbXFsTFJvM05KRGMtZWZ4SGloV3NjbHkyUjB1VUFXNXlSVlpFaTd3dmM0Q1ZHaDBDY2VlZFBJdmZiODJxVGttd28zYXZWWlpIMmRGc3hUc3VDSzdvZ3EyUVQwNlpSUmFobEJ1SDRtQXZpZEIxTzBMX19yejg1czk2X2hrR2Q0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "Massive illegal rubbish dump discovered near M57 in Kirkby - BBC",
    "description": "Massive illegal rubbish dump discovered near M57 in Kirkby  BBCMassive illegal rubbish dump found near motorway  Yahoo News Canada",
    "published date": "Thu, 05 Feb 2026 16:34:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBxVmZCZUtMVUJRMFdBTUlHQ0IxTVJlVURydlZBdFVLVVk0bDU1cnI5ajBaWngtcWRHSUcyWmI2Sl8yLWJpRVJLY21hOS1UZW51MkpXc3RCOTExdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Under the ice: Winter oyster harvests on P.E.I. start early as crews work to meet market demand - CTV News",
    "description": "Under the ice: Winter oyster harvests on P.E.I. start early as crews work to meet market demand  CTV NewsCold waters bring sweeter, fattier oysters during winter harvests  WESH",
    "published date": "Fri, 06 Feb 2026 00:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNRHhZcXR3alAwM1RWcVJWRlVmNjQ5cmRNTkZyRTNBdlBkNXlWZkN1RDNJN2pmRUlsSkN4b2JyZGcwTFctTmdxNHhrdFZjb25KSEV0TlZqOW1zdE5hdjVoaGE1Rl9GWlZNTThOWkg4TFY4QmQwLWM0TUlxQlB4eHpRdUd1YjN5aUJteVBPazBlRVhJay1HUnFpUmtGaHJ3X2FZVmFPdm5fckoyNzhDUUszVXYtNXhYY1l2bUM2UXBwcXlyVnVfWkFBN3dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Elon Musk Responds To Police Raid On X’s French Offices: ‘This Is A Political Attack” - Deadline",
    "description": "Elon Musk Responds To Police Raid On X’s French Offices: ‘This Is A Political Attack”  DeadlineX offices raided in France as UK opens fresh investigation into Grok  BBCElon Musk Under Fire for Epstein Links, Grok’s Sexualized AI Deepfakes & SpaceX-xAI Merger  Democracy Now!French police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok  CBCParis prosecutors summon Elon Musk after raid on X's French offices  NBC News",
    "published date": "Wed, 04 Feb 2026 10:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVUJsallBNWExNVY5TU1DQTF6aVU1MFZ6SWRQWWYxdjlSd2hzUFZ6RzIwSnFXQzlDalFIWk9wZFU1ck8zNGVnVS0xMWZ4b3R4WlB1TFEzWFJJcU1RR3NrZzBhanBYMDFKdnYtY3NiTVRScnFlNG5CQ3dsczFSNTRWS3lCZjFaV1R3YTh3YkNReWR2OHFCSTRqd2JR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Man once married to Jill Biden held without bail after being charged in wife’s killing - Castanet",
    "description": "Man once married to Jill Biden held without bail after being charged in wife’s killing  CastanetView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 16:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObVZzQUk0Vy1rbVp1VVVGWVhjZEJ0TC01Z19aVEg1MFI3ekw3cmZZa0tUNjYxZ2ZsS2J5dFJ2Yl9wVkZKR3FHaDdJVEl6MHNHczZqdmItN1JUSzgyWi1EeDBmV094ZWZtSzlLN2MzamhMLWJEVzVYa2huN3g4djVBcWpibWcyaUdWR2J0TURVMXRsOVl3bE5kc2thbTVaT0QxTHVReVhYbThTWUdia0VUcGRYQnJkZ2IyWDROV2dvNURwMUcyY0RiTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Israel returns remains of dozens of slain Palestinians to Gaza, Hamas health ministry says - The Times of Israel",
    "description": "Israel returns remains of dozens of slain Palestinians to Gaza, Hamas health ministry says  The Times of IsraelView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 21:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQYmtOa1BfME1ZTlNKdnNJUzgweUh1RXV2YVprRk94TDdUNi1FNXhqMnJWSmFXWVJtWXF1OVRWY0F3bnY1dTA4UnN6bk1LMWlaVHFBcXAwOV82RGF4VWJWRnBPZklnOUs1Rkw4MWNIYzN6eE50eTJnLVlreWJoVUpsc3Q3bEVDbGpYNm5SV2Jfd3BEQkx3ZEJjR2RzWEVVRjExU3NXNDhtSUJnRHA3d1JFeV9ScTRoOVM3TVFBT9IBwgFBVV95cUxPczRxSlVCcGNmY2dBRUVFdUU2SzV1YTBiRHdfcEthUm0xcElYeFFnVUxzU3lFLVV2QjJvSVR4VmljbW1icnBlNDRJaERPemU0RlFqOVh3Z1BUak9adExHcUN6YjEzdlR3X3hmbVF6T1c3U2JGT0dqQkRWSmNrSm41eUlZM0diZmFIeURMbm41cmV1c1ZjTDk3Mnl2R0pLOWxwbFhZZVJmTEdnTGpLM0tVWUh1TlQ5NnhTWTNtSWN0NE4xdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments - The Kyiv Independent",
    "description": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments  The Kyiv IndependentPutin 'kept his word' — Trump reacts to latest Russian strike on Ukraine  The Kyiv IndependentRussia, Ukraine agree to halt attacks on power grids  The Globe and MailTrump Insists Putin Kept To His 7-Day Ceasefire Promise Despite Flurry Of Ukraine Attacks  Yahoo News CanadaKremlin says it agreed to halt strikes on Kyiv until Sunday  CTV News",
    "published date": "Wed, 04 Feb 2026 19:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaEd3RG9JSzV6YTZTcXUtM19WTjJqTkxuNVBLdXVqT290UG9CTXVsdDBCMmx0WTl6cFFkd25wWFBwRmZlQ0RMOWRIeUxsc0l6Yy1XU1ZVOWRiZTluTUNsYUJXZUt5aExLdk5CVHQ4ZF9jQVZncC1fNXo1NE1PcUVrRDBKZjFRZ0hmR1NHQWVRV24tb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "The Internet Is Absolutely DRAGGING Dr. Oz After He Said Kids Should Work \"Right Out Of High School\" - BuzzFeed",
    "description": "The Internet Is Absolutely DRAGGING Dr. Oz After He Said Kids Should Work \"Right Out Of High School\"  BuzzFeedDr. Oz Says Americans Starting Work 'Right Out Of High School' Or Retiring One Year Later Would 'More Than Remove' The National Debt  Yahoo FinanceThe Internet Is Absolutely DRAGGING Dr. Oz After He Said Kids Should Work \"Right Out Of High School\" And Retire Later To Fix America's Debt Problem  Yahoo",
    "published date": "Wed, 04 Feb 2026 21:27:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOVWVYZDM4dnZ3SUZia1RCcXdPRi1NelA5RkxzQ050cWNIVlRGWFcyUW9ycmJ6WkdCVmQ3WktzN19Hd1diUVpuVUVlWDVMX3gwZkVldlNZTHFWaVpKSFJyS21qM3h5a29LZVVNY3VYRzh2ZzZ2QlNSRkwwZWVMcTZvYkR2dXBUWjhDcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "US probes Nike over white workers' discrimination claims - BBC",
    "description": "US probes Nike over white workers' discrimination claims  BBCNike facing U.S. probe over alleged discrimination against white workers  CTV NewsFederal agency probes Nike over alleged discrimination against White employees  cnn.comNike faces federal probe over allegations of discrimination against white workers  NPRTrump administration alleges Nike discriminated against white workers  NBC News",
    "published date": "Wed, 04 Feb 2026 23:07:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9tVkd1dXJjQ01XQ1dIdlhaVEhmMlk1N0JfbDhTWHpJelZzaDFWUVd2UGJXb2VtdGc1LUFFNHNBY3hIVUpTUFlNVEdyZ1pLY3cxMnlPNVFKb2M1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘I can’t afford that’: Ontario woman frustrated after pet insurance doubles to $866 a month - CTV News",
    "description": "‘I can’t afford that’: Ontario woman frustrated after pet insurance doubles to $866 a month  CTV News",
    "published date": "Wed, 04 Feb 2026 11:08:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOZzMyVHZqN1NQOUZtQWJtUHNkYWhtZnhscEdaVnZvZk9GVmRoanJPZUN5ZjNMaGl4c0VRbElUa3hLMGxoUmxvaVIxODlXUVp1a0VMWmhyRHY0TEtpUDBtNW95eTBUQ0xVZXNDdkdILVdiajAwT3VNaXhWTDRqOU5RbDFoYVI2blhuaGo2S0NkcmJYdUFlRFVBcmNOcVVjclpmTmEwakx0djRxbWdQc0Z4QkpOMkZvVU9YaFIwbkVuekdMcGVBVERQVkJlbUV0MEtfUVF0UU44WXI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "An estimated 8,000 cold-stunned iguanas removed from parts of Florida - Phys.org",
    "description": "An estimated 8,000 cold-stunned iguanas removed from parts of Florida  Phys.orgFlorida euthanizes 5,000 iguanas after cold snap stuns the invasive reptiles  The GuardianWatch: Florida iguanas are 'cold stunned' and falling from trees  BBCState's rare freeze gives residents and visitors green light to collect stunned invasive iguanas  foxnews.comAs cold-stunned invasive iguanas fall from trees, Floridians scoop them up for killing  The Washington Post",
    "published date": "Thu, 05 Feb 2026 21:47:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5DQ1lkQVBKU0ppWGpHemlSTVUyQzQ2aE1sV3hwcVZpdk9BR3hoMXI0dGtvampPMmdNVnV0NkVNeFAxdWhIbTRobkJQbUZDZDJQRGd2T3Y1UWVxNHZxZ3lEcVlSZDVOYVFmaDZpQWxDZ2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "How an art restorer sneaked Giorgia Meloni into a church fresco - The Economist",
    "description": "How an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistAngelic face of Italian prime minister wiped from fresco  cnn.comChurch fresco resembling Italian PM has face scrubbed out after outrage  BBCAn angel resembling Italy’s Meloni is painted over after an outcry from church and state  CTV NewsAngel resembling Italy's PM Meloni painted over after ouctry  France 24",
    "published date": "Wed, 04 Feb 2026 20:35:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPU09zZThZV09BMi1sYjFFMTkteGh3YS1jMW1xeGNIVUNLUlFfZFJhY3lRUFplZ1FyTUxBRlhndTdXcVNVbnItbDZaSDczNUxMbDFmU2ZROXgyVVhTS0ZnaVNqR2dVY19TSEVoTnNfWDZUbjY5c1U5RmhkeF81akl2LXBHVzZFMzJ4TGF0dU8yVjFxNFhlcE11VVpVRkhxVTl6VmVDdHVGM2pGS3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Russia jails stand-up comedian for six years over joke about wounded soldiers - Ynetnews",
    "description": "Russia jails stand-up comedian for six years over joke about wounded soldiers  YnetnewsRussia jails stand-up comic Artemy Ostani over war joke  Al JazeeraRussian comedian jailed for nearly six years over war veteran joke  ReutersStand-up comedian gets nearly 6 years in Russian prison over joke about war veteran  cbsnews.comRussian comedian jailed nearly six years over war veteran joke  Yahoo News Canada",
    "published date": "Thu, 05 Feb 2026 15:39:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTFAtSkhCVklDNlN6ZENRclB2a2VhSmJQaTA3a1lnandCOEVFTG9oeEhNUmZMYWFLZHF0NFBya2VTMF9zWmxNcXNZWEIwR3NnQW9mbzQwTFRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "Congressman prays in front of Trump, asks that president finds ‘greater clarity’ - Global News",
    "description": "Congressman prays in front of Trump, asks that president finds ‘greater clarity’  Global NewsTrump Awkwardly Stands Behind Democratic Congressman Who Makes Urgent Plea During Prayer  Yahoo News Singapore",
    "published date": "Thu, 05 Feb 2026 19:30:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRkNCWldUb1lWZDRTbzdlQUo1QVJKY1pYbzlMR3p1cElrOFd3cG5HNFpkY1JxOG5CRFlZVUVGakxzWXk2cmVZZV9fTDZ0aF93RThuenVqTlBZdEdDWndBSEJ6aWxPclRld3RIckZpMko1eGdVZmsyWkVBVUJ4Zlktdnd2RXJUclJydFp5dWpBV0kwczQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "SCHOLZ, Magdalena 'Leni' (nee Dragaschnig) - SooToday.com",
    "description": "SCHOLZ, Magdalena 'Leni' (nee Dragaschnig)  SooToday.com",
    "published date": "Wed, 04 Feb 2026 20:40:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcjJEbmZoRXFzT0JUNDBHOTNvUFNKb1NnNEtBYk5WSzdkRENyTGwta0lvUGw1Tzc5aWRPVTF4RS1zcS12bVZtQWRmNTF0a0ZycVRMbVZ6NDB3T21abzdtb1FHdERBUTdJVHBfVU8xOUtxU1otdko2SENtelFEMGlqYl9VLVFPOUtLT0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sootoday.com",
      "title": "SooToday.com"
    }
  },
  {
    "title": "‘Stark warning’: pesticide harm to wildlife rising globally, study finds - The Guardian",
    "description": "‘Stark warning’: pesticide harm to wildlife rising globally, study finds  The GuardianPesticides significantly affect soil life and biodiversity, study finds  Phys.orgPesticide residues alter taxonomic and functional biodiversity in soils  Nature",
    "published date": "Thu, 05 Feb 2026 19:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNdmxKVEFQVmVDMllrQktyZTFjcVcwOVZLRC1lLWN6TVEzRFhUSDBWQ0N1dVR6b0ZaOHNVU05DRjlDaWRReEpwaDdGaXVIMDJ4d1VIQTg3RTNwWlhTcERienRONzU4VTZiRXF5NlgyLTAwVC02UFVwaGxkSHg3SkhhMi1zRDhTR01XcmNocUVyS185b1hKMmFjQ2o4aFhvempGRUJqRnd6Um9IQW1NdGJGSnVCWnl4MTV1aElZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Chris King's New Gold Grease is Claimed to Roll Faster & Last Longer - Pinkbike",
    "description": "Chris King's New Gold Grease is Claimed to Roll Faster & Last Longer  Pinkbike",
    "published date": "Thu, 05 Feb 2026 01:11:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPR1BUUlpCNWwza1N1WDdvazVuaEdDTi1sdHh4SUhZenBUYTNXeU9HcGZNZTVPRE5OcWNjWWFDczVKMUhLMkkxcUd2Z0RHNEVOaVZlMDJ2d2o4NTc3TE0zVlg3TkRyb1VfQ0gyWVRUaklaSkNpclpqdkV0ZmY4bTVNNV81VkFnUVJfN25lVHVXbkJRZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pinkbike.com",
      "title": "Pinkbike"
    }
  },
  {
    "title": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead - CBC",
    "description": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead  CBC‘They Couldn’t Break Me’: A Protester, the White House and a Doctored Photo  The New York TimesArrested protester reveals pain caused by White House’s AI-generated photo of her crying: ‘Was just so degrading’  Yahoo News Canada",
    "published date": "Wed, 04 Feb 2026 23:20:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMWh2N1BudVJxZ2dMUVZPWGFfVHM3WFFZd2RRZ2o1UlY4S3BqNUtoNmhwc0QtUUxaV2dsajliMERaQ056akpUUzdfbUtTVzFUdmpMcm15RGVjdFJnMnYzZ2Yzd29jMG5ZaGZPNm1zWjV4X3JJNHVpaXlNNkNKSmI4c3ZMTjJPVHF3N1dn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’ - cnn.com",
    "description": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  cnn.comMelania bristles at Epstein question when confronted by reporter at event to honor Israeli hostages  The IndependentMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania Trump Uses Event With Freed Hostages to Promote Her Documentary  Rolling StoneMelania Trump Gets Confronted About Ghislaine Maxwell's Prison Treatment  People.com",
    "published date": "Wed, 04 Feb 2026 23:03:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTnZfUEtLV2tYNHZhMWpKUEJYdTU1Z0xveFhuZWV4OTgxdHRGcE9PaTA1X0hQbkNpNHZsTHVTZ1FDdHZRd2xlTGJCN25OQWtieVh1bEYzMFlNWTllN0dnT092Vzc2bjJUWkVwWGlPRGhxOHZ3YlJZOVNZVWY3VGZqdHdITmlvYVVkYzdOOUdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings - CTV News",
    "description": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings  CTV NewsHow to tell real Minneapolis ICE surge videos from AI deepfakes — 5 key clues  inklImmigration Agents Are Killing and Abusing People. So Civilians Are Turning to a Controversial Tool to Find Justice.  SlateAI-Generated Anti-ICE Videos Are Getting the Fanfic Treatment  WIRED",
    "published date": "Wed, 04 Feb 2026 21:39:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPNVRyUXFzX3dpTmlVTzltVlVuaWY1YXQyanNGVE9oVXZPMktuSGQ3bDlEXzZUTXJIVXRNbXpjVV96cEY3RjNjRnA0b2xBaEczaXRFNFFxVWt2ZDdBeHFnTzF3RURqUkZkT3hHTkhzbFVfNG0xVG85QndLTmVOTklPREdwanNnc3V1bGFSQnVBQTlWTVprVG1sc1hkTDRCTy1YNlg1OTdzWmFSdHlpYlRFc0tweGc1UnBiVTBZQzIxX05PSmhQQUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Photos of Cubans getting by without power as outages persist and tensions with US escalate - Yahoo News Canada",
    "description": "Photos of Cubans getting by without power as outages persist and tensions with US escalate  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 15:27:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxObk5ibmJZZUIyQko1LU04RURpcGIwalUtQmxUQnpqdXVJVlVWVzBHekxPMndUemhTbjVGVU1LMHdZeGVwSThWcW9rejNLbmNiLTd2dEh4eUJSaTRfV2FFS000TnBCOHpPUkpIbmk4MGZ6TU9FVkZhT1lzaWU3R3dWWGpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Mapped: Which Countries Rely Most on Imports - Visual Capitalist",
    "description": "Mapped: Which Countries Rely Most on Imports  Visual CapitalistThe World’s Most Import-Dependent Countries, Ranked  Visual Capitalist",
    "published date": "Wed, 04 Feb 2026 13:02:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE01NDBlbnZoa201cS00eW84Vk13QUVuY21DUWlwSmJLVkU5dTZzeXpScmdkcEVwTzFaY25zcmVUOU41MUFKTTVyYWwtZ2dKaXpFcXQ5dHpSQU15aEFoM3RKM1l6ODNRX01uVmZldlRKQjJoUE5IdDZfb3BTZEpaR28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.visualcapitalist.com",
      "title": "Visual Capitalist"
    }
  },
  {
    "title": "Ukraine’s Secret Weapon Against Winter? It’s Hiding in Soldiers' Boots - UNITED24 Media",
    "description": "Ukraine’s Secret Weapon Against Winter? It’s Hiding in Soldiers' Boots  UNITED24 MediaVideo: Witnessing the drone war for Ukraine from the Russian side  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 18:15:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRjA4QldlbnkzdUZxbmowVmxXRzZ1ZDFPMzZCTFl4eUxaZlh1MTZ2ZkVfdmxOSHI3QlNFT1JabXdRV0tPVDk4QTJ5M1RXY3BZVEJDdll5eUxQcmlkVi1zOXV1VXBSdlFnUEMxTW55TzRGeTY3TlB1elphXzgtUmdzcjdqN2U0RFpSOFJxVVZyclpqTnM5QW5pRldhOVVRS3FQZWZqTFpMcnR1VnB0ZkNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://united24media.com",
      "title": "UNITED24 Media"
    }
  },
  {
    "title": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’ - Bored Panda",
    "description": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’  Bored PandaNorth Korea: teenagers ‘executed for watching Squid Game’ as regime wages war on K-Drama and K-Pop  Amnesty International UKNorth Korean defectors report executions for consuming South Korean media  Korea JoongAng Daily",
    "published date": "Wed, 04 Feb 2026 16:58:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFo2UzBlWFdZNkNRcHp0U1ZJNm1sQXVVc1E3d0ExbGQ0aHFwcUI4VVJuNk1yUW1CQ3VHSmZURlVUdk9uTjF2cVRqZ0w4bkpoQTZveUhoSXFXUDFLaVdHN0FMUzEzWHRvTFllZG5aWm9UNzc1UUdTTnJibGxvOGpoYjVXY280VlZmT29GaHF3RGdmSmE1RVU4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boredpanda.com",
      "title": "Bored Panda"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentThe Assault on Ukraine’s Power Grid  The New YorkerThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCFamilies suffer as Ukrainian engineers can no longer keep up with repairing infrastructure  Toronto StarRussian attack leaves 1000s in Ukraine without heat in -20C  CBC",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "U.S. Army veteran faces deportation after 50 years in country: ‘Thank you for your service...should mean something’ - CTV News",
    "description": "U.S. Army veteran faces deportation after 50 years in country: ‘Thank you for your service...should mean something’  CTV News",
    "published date": "Wed, 04 Feb 2026 19:34:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOZGJrRU5TR09tLUxWN2g0TmxqYVhHaGxlRU9acjNjN0RHTVFrRXFmRlFudWlMMHNUeTZZN1A4UVZRaDktMHdtc1lvSmRhdVJQNkZMV2xkS2tLNDJEVk9QWm1id1dIWDRteEtBbnU2NV9kVEpkZVFvTkdheXg0SXVjX1M2S1Z3c1ptS1ZObGlNUGZmWjctWWlvNTVCQ3pZb1V1dzNaLWt1aHFNWWRQX2d5OFhzbzVUa2x3M21kbmRPSG5NbzVURWJibmpMNkRCTnN5bWpnNF9iZ21pR2JlU1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost - The Economic Times",
    "description": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost  The Economic TimesWhat to Know About Melinda French Gates, Philanthropist and Ex-Wife of Bill Gates  People.com",
    "published date": "Wed, 04 Feb 2026 12:52:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxQVU54Z1FKOXVsMnpwdkxxcV9vdEhEa20wN0NEOGpHZzYyMEh1RUtFX3BfT25RTGdpT3pWUzdXSlc5REd1U290NlN4a1plLTRlY0lKcUpsa3N4Zk5rX3NWUWZlTUlHRERlWVNCQlBMN0RGODc4LTE1Um1oTDNodV9uNzQyNi1UYTY3SUk4Z0RZRE1ZLWRBc091OExwZ3NGWTRWemRDUVNyN0t4VjZLM0ZnSC1nQ25TZ3p6TFkwNl9VWHEwU18xX2g1M3p2LVhzMzdpRTd5TEFXdG84a3J5WFVNeXJMWHdGaC0zd2dMRFlzZVRvRmtxNk1GVTd3QTdrN3c4NTFRakZ4SnJ2UmdhSWxlTDhlaFnSAZoCQVVfeXFMT1IwTXBucnJ5NjJzWTc4TWEtLUlxWmlRREZLaDhRWW5uTENham1TWmZBUVBwLS1QZTYxeEFDNHVsdVZzdG1zLUlrLWFjencxSmphRUtqVm11ZllQMmJUa0dnSWpiVXU2d2d5akgxcHJtR3hBMjNLQlFEMWkyaEJWNWJWdkpnQ2lXcER0MlUxTnY1Rzk2ekJzZ2J2U1V5Y3NSRkhGVDFNeTJWald1OVB3cmtmYnNGa0ROZnloNzMtSUpxSDhReklQVEpEejBvV0I4ZExHa1REYm5nWUM4Nkh0anlmMk5hUGF2YUVmTzdhUi1vNVRodlliazFmSVlvdzc5T2Zka2NHamdxUGgzeTZPaHM5OFNsMUVndjNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://m.economictimes.com",
      "title": "The Economic Times"
    }
  },
  {
    "title": "Canadians visiting Mexico to face stricter penalties if they bring banned item - Daily Hive Vancouver",
    "description": "Canadians visiting Mexico to face stricter penalties if they bring banned item  Daily Hive VancouverAfter Mexico bans vapes, cartels tighten their grip on a booming market  Toronto Star",
    "published date": "Thu, 05 Feb 2026 19:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5uTk9NSjUxOTRUR29Dc3BHdTdvRnlaUHQ1OUNqOHBDRVR4eFZvcXJGNmlaakhTRTZNRWt1Y2dmX3RRTDlpcnptc25GZldRUEVuc0FxWFI1dXhjRzQtRUlwdGxEdDljczhtOXhDM2pLVU5BUW41V093?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Trump has attacked pillars of democracy, says Human Rights Watch - Reuters",
    "description": "Trump has attacked pillars of democracy, says Human Rights Watch  ReutersTrump-led abuses amid ‘democratic recession’ put human rights in peril, HRW report says  The GuardianHuman Rights Watch warns US heading to 'authoritarianism'  France 24Human Rights Watch: Three-Quarters of the World’s Population Living Under “Autocracy”  Democracy Now!Meeting Trump’s Challenge to Human Rights  Human Rights Watch",
    "published date": "Wed, 04 Feb 2026 17:14:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOck1ZNlRrTW5lM21oUTBPT2R1YW9Zb25FYnUxYVB1RkhEbWItVjBLMWl4UWZVeDd3aGdLRGlxMWtGTGdCZktJWVJGTV9hVjFXRjg2ajkxVzZrUHVibHdaSTZuai15VzhsaEdEc2xGTEFsTDU0bjhubllPOUphN3lfTmF6cGtzcVBEU1poeXlDZGF1ZkUxUEUwTjhGekZ0MGxrbzBaSlRlZ2o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  }
]