[
  {
    "title": "Former CNN anchor Don Lemon set to be arraigned in Minnesota ICE protest case - The Globe and Mail",
    "description": "Former CNN anchor Don Lemon set to be arraigned in Minnesota ICE protest case  The Globe and MailThe Don Lemon indictment: Video appears to contradict key claims  The Washington PostDon Lemon set to appear in U.S. federal court in Minnesota on charges stemming from church protest  CTV NewsDon Lemon expected to plead not guilty to charges arising from his protest coverage  NBC NewsDon Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe  CNN",
    "published date": "Fri, 13 Feb 2026 12:13:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQSkx4SUtOcXNnbXNRSHZ3d1BfOHFOQVpFbHl1ejRVdGlEeVpqVktIM2JzTWFPU3N3VFpldlllZWlDZDA0OUtoeVZscFlUTWhJblpnMTd3N1gzalhEMkhNRWlWeGw2dHgwQXdBcVB6MGtVb3liTkdUNHY0Z3dYSGJ4VlluRlJyblc5ZkR3OHNrREhCUGVOVDJnWU1fRmxmVXpjTUZ2RnVyOUsyQjNqYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns - BBC",
    "description": "World's rules-based order 'no longer exists', Germany's Merz warns  BBCRubio warns Europe of new era in geopolitics before big Munich speech  BBCGlobal Security Experts Gather in Munich to Address “Wrecking Ball Politics”  CBCVideo: Transatlantic tensions in focus as annual Munich security gathering opens  The Globe and MailEurope hopes to repair trans-Atlantic trust as Rubio attends key security conference  Toronto Star",
    "published date": "Fri, 13 Feb 2026 16:42:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE91MFdTUmpKdExzR1dIWG10Wk5CWnJ1U0kyMlBSUktucUxCZDd2aU9lek1Wc0NaYTItVWcySDd6Z19DbGRPWUt5OGRaMDZHTGZ0dXlJOEx6d0ZKQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Bangladesh Nationalist Party wins country's first election since 2024 uprising - CBC",
    "description": "Bangladesh Nationalist Party wins country's first election since 2024 uprising  CBCBangladesh election results updates: BNP claims win in landmark polls  Al JazeeraGen Z toppled Bangladesh’s autocratic regime. Will it decide the next government?  Radio-CanadaBBC at memorial for Gen Z protesters after landmark election  BBCBangladesh Nationalist Party wins landslide election, the first since Gen Z-driven uprising  The Globe and Mail",
    "published date": "Fri, 13 Feb 2026 10:02:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOOUhoT3Jod0hWUEdZNzlSSlE3dFRUME1HenlrSGdXaVU2OUpIOFZoaHRDcG1oeEY4eVhIby11bjNOR0V1cEpZUmJRb3lLU1VkQjBYZ0VTQU9hZEhCcnQ1YktQaFdGVldKSVh3T0xxVzMtMHJrWmk0eVctdEw0UDhrYTltQ3BxWHhHbnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings - CTV News",
    "description": "Border czar says Minnesota immigration crackdown is over, after angry protests and 2 fatal shootings  CTV NewsMinnesotans welcome the immigration surge drawdown but remain vigilant  Toronto StarUS border tsar: Minneapolis immigration enforcement surge ending  BBCThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticTrump border czar says controversial Minneapolis immigration operation to end  CBC",
    "published date": "Fri, 13 Feb 2026 00:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxORVdsaW9MZXQxWlFGWUJ1OVRtOHpzcDJPd1hQc2RiMTJIeTRxVVZzcXhKLTlDVlJqWWN5V3VncFZrajJYV0hCeS1SM2FfZkN1Q19NY0U5OS1NUUNBRnFjUFcycWZxOHRCc1BqY1FpMDdWSDJKb19MZFNMclNtMTZlbExhQzZMeXR3d256Rk96cU5VTmloaFk0YkFxV203UklfQ0pVZ3Zydm9jN3hab1FvWFpUT3lmc0JvbGNTRXJWcm9GRGZjbzhIa1BJU0lhem1rUjQ4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "FBI releases suspect description, new details in Nancy Guthrie disappearance - CBC",
    "description": "FBI releases suspect description, new details in Nancy Guthrie disappearance  CBCFBI releases description of suspect in Nancy Guthrie kidnapping  Yahoo News CanadaExclusive | Investigators find black glove during hunt for Nancy Guthrie’s kidnappers — and The Post was there  New York PostFBI shares description of suspect in Nancy Guthrie case as reward for information grows to $100,000  CNNWatch: BBC in Nancy Guthrie's hometown as sniffer dogs help search for clues  BBC",
    "published date": "Fri, 13 Feb 2026 11:23:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE12OE9MbDhNZUxSUTkzUG5VSmR4bnphOEhRUDFtRDlJZHkxNy1LU00tOVV2Mk1mWE1aX3lXb0RqellQN2dhaWJxTEg3MV9tZDBXcWpqZDhUZzR5M0xqakpJVWtJaFVaR1EtVFduUkFnR3VCa1VXUHRXWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Tulsi Gabbard reportedly accused by whistleblower of suppressing intercepted call about Jared Kushner and Iran – as it happened - The Guardian",
    "description": "Tulsi Gabbard reportedly accused by whistleblower of suppressing intercepted call about Jared Kushner and Iran – as it happened  The GuardianTrump Repeals Key Greenhouse Gas Finding, Erasing EPA’s Power to Fight Climate Change  The New York TimesSix possible effects of Trump's climate policy change  BBCEPA ends credits for automatic start-stop vehicle ignition, a feature Zeldin says 'everyone hates'  CityNews HalifaxTrump sidelines climate contrarians in science rollback  Politico",
    "published date": "Thu, 12 Feb 2026 10:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPUGNJMU5FaHBmX2VMQ3FhdDk4XzFhb3hCWWx6MDdESU1Pb3dLLWd1bzBIWUZRTGdyWEN2VW81bzNCTl95S0tuZEZQMllybHlYZWFEeEtTTThqNjRtYW5aUEVsd29xR1ZPNDlmODFiR2FkT2IzMC1sM2lhNEtMTXB4YlNFMTZyemdPRmtzWDhuTGc2RjFhYnNRZl80ekVkdVdVYl92S0tHa3dLR1Y4YkZkTTl6Z1F3dmIyaHJvRUVyRzVPMTJUbmtpQ0pjTWtmblc2a2VabktIWTNVemdmZ2pMR3lBRl9KM0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. to send second aircraft carrier to the Middle East amid Iran tensions - The Globe and Mail",
    "description": "U.S. to send second aircraft carrier to the Middle East amid Iran tensions  The Globe and MailTrump sends second aircraft carrier to Middle East in effort to increase pressure on Iran  The GuardianPentagon to move carrier to Middle East from Caribbean, officials say  ReutersUS readying another aircraft carrier for deployment amid Iran tensions  Al JazeeraU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York Times",
    "published date": "Fri, 13 Feb 2026 12:00:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQeE14SkYwd3lxVWhzWUtRV01ubmRMUjBfTUI3eFczNXlLRFJ6cmdrMWZIeTBPbjRBaXY4dkExVlVzZTI3OFNHcmNBd2NwTEdGdUJRMmE0eVRmUEppeXd4dzF0NTRlV0pjWkVpSURNa2xlSnVKWm1CNjZtOVlIdmNFazA5eFZNQWpXOHZvbElkNEhVdElYWW1JZEkwVjA4Q2lueFR0bg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Risk level upgraded: Canadians urged to avoid non-essential travel to Cuba - CP24",
    "description": "Risk level upgraded: Canadians urged to avoid non-essential travel to Cuba  CP24Air Transat aims to repatriate all its customers in Cuba within days  CBCSault man concerned wife, child stranded in Cuba  CTV NewsFor some Canadian travellers in Cuba, getting home is not so easy  Financial PostCanada updates travel advisory for Cuba as power outages worsen: ‘Avoid non-essential travel’  Toronto Star",
    "published date": "Thu, 12 Feb 2026 12:36:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOZHFMQ3hEMHp6MHQwQ1I5c1R6bkpKTi1mSTE5b3ptVVY4ZDVhbWlaUDRUZklGMmdRX21VSDZ3WDhFcDI1aDIyaWVaaERRbU9xM043aUdfVHBWcjkzMVh4R3RVZF91UUJiZE0tdUMwNlhmZTA2UEJoOVRhV0RVS1c2dXJRY044eHZoV284VTg2bmoyZWQ2V0RBR0tTUmdPWjJpdGZ6VHZDQ28wWV9hMTJXb3BqbXRiRUk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "No water or electricity, and children begging in streets filled with rubbish – but this is why I won’t leave Cuba - The Guardian",
    "description": "No water or electricity, and children begging in streets filled with rubbish – but this is why I won’t leave Cuba  The GuardianSend Canadian oil to Cuba  Policy AlternativesWill pressure from Trump cause Cuba to finally buckle?  Financial TimesCuba is facing an economic and social catastrophe, and not entirely because of Donald Trump  The ConversationKelly McParland: 'Free' Cuba could carry a heavy price  National Post",
    "published date": "Fri, 13 Feb 2026 15:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQVWNpNmlndkZ3bkRka0FhNWlGSUp5b3JhTWNQT1JYcVpRa2x4YnZUeEw4QUF3WGFsMWNUMEM3dHdBS0JzaGJSOHo5RXRaODRqUjVBc3JzYWhtOEc2X3pDVGNqYWt1WWM5WTdNa2k4LTRrMnhqLUF2cVNoRnV0Qms5elpyLXNtM0paLV9Td1lYZWlROXd1UVZPZ2dycXFJQ3RoQ0d2em0xOGY0M0FCMlBnXzVVRnRUc2EybjFVVFIyUG52d2tfRkt0bHFuQzdHVDc4X3FHcEhYU1puRGdFeW1YUEMxbk5GcHlnTlRZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Pep Guardiola responds to Sir Jim Ratcliffe's immigration comments - BBC",
    "description": "Pep Guardiola responds to Sir Jim Ratcliffe's immigration comments  BBCTrump, Musk and now UK billionaire Jim Ratcliffe – they are the enablers, making racists feel great again  The GuardianBlaming immigrants for problems is wrong, says Pep Guardiola after Ratcliffe comments  The GuardianMan Utd official club statement 12 February 2026  Manchester UnitedHow Manchester United co-owner Sir Jim Ratcliffe sparked a political storm - The Athletic  The New York Times",
    "published date": "Fri, 13 Feb 2026 13:41:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE9RYVduTkFTdE03MnEzQUVmRGN4ZHFQbE9pWEs4ZDlteW5XcVlCOWNyenViYWZHWEhzdGV2S1lFTnhjRUR4ckh6UmRIV2poU1llc1NTWW82YWtHQW03ZzNzWEpPVUdyZTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Mexico sends aid ships to Cuba as US blockade sparks energy crisis - Euronews.com",
    "description": "Mexico sends aid ships to Cuba as US blockade sparks energy crisis  Euronews.comMexico sends aid to Cuba as Sheinbaum walks diplomatic tightrope with US  The GuardianMexican ships arrive in Cuba with humanitarian cargo amid US oil blockade  Al JazeeraMexican ships carrying humanitarian aid enter Havana Harbor  Reuters2 Mexican Navy ships laden with humanitarian aid dock in Cuba as US blockade sparks energy crisis  CityNews Halifax",
    "published date": "Thu, 12 Feb 2026 19:55:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNZUJTWlVtTnkyT3V2SnNSRHBoa0N4Q1FSZDFOMHRQdUE3WVRsU1R5b0F5UnBKbHdrV2Q0QWVaYWdFQWJSTWFEMnI2UGFadklFcllkZ0xOUHg5WWw0R09iMDZubzJ2Nkwyd1pPaDFMbWtic3BCQndneEhsQXZKSGFPcmRqcEVNbXllOC1XbGdDS3QzckxSeXVYbUg3anhHMnpHMURrM2lxU2xoaXlJQ2tlX0NYQnktSXBNOXVkbm5iaERZMGcz?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Two babies found dead in French family’s freezer, mother arrested - CTV News",
    "description": "Two babies found dead in French family’s freezer, mother arrested  CTV News",
    "published date": "Thu, 12 Feb 2026 20:01:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOMlY3WW1yb2w2NkI3dWhuVnpKcHBPcEJuQ05jZHhNTW5NTDk2bTIzY29QMHp0Yk9EWHNmazYyc0xibU1pWHVUSjlsNFFsbFRZS0s3WEpscjd1Mk1jNWNyRkJBRWNrMnN3bFB3TjhjcExiaXhyOWFYQlFZYjYwWjNMVEltcXF6Vmg0Z2k1aGhNZjRqU0M4LUhGenpqYk1weFRIcWc4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Powerful Dubai tycoon replaced after DOJ reveals sexually explicit emails with Epstein - CNN",
    "description": "Powerful Dubai tycoon replaced after DOJ reveals sexually explicit emails with Epstein  CNNDP World ousts chairman after depths of Epstein ties revealed  The Globe and MailDubai's DP World replaces CEO after Epstein links emerge  CNBCBoss of P&O Ferries owner DP World leaves over Jeffrey Epstein links  The GuardianDubai CEO Named in Epstein Files Resigns From DP World  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 12:29:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPYjhMSVRpV0FxNDRFMUFYXzBwQ25NMk9tLVN2T0FUM2x3VXBfY3d1NG5fNzhCWjEtSHlDcER6ZWFYb1VuYy02UUxIVHg2Mjh4aTZNN0tDYkZVbTU5RGk1cGd2cGs1T0tnZUFNVUFYQ3N4MWJUSElHLUlTNTJPak9GVHVUSG9NVDJQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Kathryn Ruemmler: Top Goldman Sachs lawyer who called Epstein 'Uncle Jeffrey' resigns - BBC",
    "description": "Kathryn Ruemmler: Top Goldman Sachs lawyer who called Epstein 'Uncle Jeffrey' resigns  BBCGoldman Sachs chief David Solomon ‘reluctantly accepted’ Ruemmler’s resignation  Financial TimesGoldman’s Top Lawyer Departs Amid Revelations About Her Ties to Epstein  The New York TimesGoldman Sachs' top lawyer to resign after emails show close ties to Jeffrey Epstein  NPRBirthday wishes, island plans and ‘xoxo’ sign-offs: Inside a former Obama WH counsel’s ties to Epstein  CNN",
    "published date": "Fri, 13 Feb 2026 17:10:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE94LU1XV3lURHNuNk9PajBpcm1SOTRTMlpTQWJnc3oyanZlbFNzb2VHS3VURGhhQzV3Z1pXZ0hLS3puNjZLSFdQQjVkdGdEUDFrZnhYYzhvdDZmdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Judge Quotes Bob Dylan in Scathing Rebuke of Hegseth’s Bid to Punish Senator - Rolling Stone",
    "description": "Judge Quotes Bob Dylan in Scathing Rebuke of Hegseth’s Bid to Punish Senator  Rolling StoneJudge blocks US military from demoting Mark Kelly over 'illegal orders' video  BBCFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge temporarily blocks Pentagon from punishing Sen. Mark Kelly for call to resist unlawful orders  Toronto StarUS judge blocks Trump administration from punishing Senator Mark Kelly  Al Jazeera",
    "published date": "Thu, 12 Feb 2026 20:45:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNR2xqSF9faV81T3Y3dzdFNDQwZzVyY0dJMkQwdVpad1lPQXdsOGRTMi0tZGdiQTBJUEdlNmIwN01MQlhUVGU1Rm9XaDV2cWZfN2IxNmNEbDViNl9zNVJYeWRlTFhiWXlWVndIa3BiNHN1QjVDc2tPOGdENDJjY0Y3TTFIdzZBYjl1NE02eV9KdFNmbENkNGhoczNqaWNtQVhKTWVrREt0b3BuaUsyX2pKRWpn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "U.S., Taiwan finalize deal to cut tariffs, boost purchases of U.S. goods - CNBC",
    "description": "U.S., Taiwan finalize deal to cut tariffs, boost purchases of U.S. goods  CNBCU.S. reaches trade deal with Taiwan to lower tariffs  The Globe and MailTrump administration reaches a trade deal to lower Taiwan’s tariff barriers  CTV NewsUS and Taiwan sign trade agreement to seal chip investment  Financial TimesU.S. signs trade deal with Taiwan, lowering tariffs to 15%, while Taipei to boost American goods purchases  CNBC",
    "published date": "Thu, 12 Feb 2026 23:50:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOT0p2X3owVXoxM01HSlZwcElkTzlBNkREZDctdHBsMGlISzZ6aWgyZXdLakh4cXdRSFpUZFlwalpCd21mYkp6NkR5NkJEQUdHUXB6Qko4VU82MFRscTRxVDgydW4tQjM0QkhBbnV4TWdpTEd6Tnh0NjJWV1BFX2dXd0JJeTJJalhZTlcyRENYQWsycDVRc3pKcDdueVVEVlE5UzZWalVB0gGrAUFVX3lxTE5MSmVpaFIwODRJR3RCODk0R2tFRU1ieVB1R3ZWVUtrTm9tMVV4RlZJdmZkbUx0TFg3MV84V25hWl9UdXFJN29EbmY1UllMUW9vTTFUOU9sTmJ4Z1pnZWJrMDJDQVlQT1I3MWZ2Q0VsZUd4el9lR05CUUp3c2d6Y1M5S0hXQU0wbjdULXVlMlpZSzREampkclpoYWd5YV9aLXlFbGN4VVR3X3BUTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Jimmy Kimmel on the US justice department’s handling of the Epstein files: ‘A brazen cover-up’ - The Guardian",
    "description": "Jimmy Kimmel on the US justice department’s handling of the Epstein files: ‘A brazen cover-up’  The GuardianHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoJimmy Kimmel on Maga: ‘It’s such a delicate balance between stupid and evil’  The GuardianEpstein survivors say they felt 'degraded' and a 'lack of empathy' from AG Pam Bondi  NBC NewsPam Bondi’s Contempt for Congress  The New Yorker",
    "published date": "Thu, 12 Feb 2026 16:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZ25vU3ltMnlWYWQyMnVJejZuY2RFUG94VWhIclJCWlFsUm9wTmFaMWFlN09nVTY0aGZXT0hiX3lSTmlQN055dmRzRFBmbG91N0F6eTFNMVd1TmxXbWlzMEdTQWxkdTNUYzMyTEdnR2o5MWRBU3N3YVBpd3JBejdXZmZMemhjYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Exxon CEO’s stark message unfolds as US officials land in Caracas - thestreet.com",
    "description": "Exxon CEO’s stark message unfolds as US officials land in Caracas  thestreet.comVenezuela oil sales top $1 billion, funds won’t go to Qatar account anymore, Energy Secretary says  CNBCUS Allows Some Oil Companies to Produce Oil, Gas in Venezuela  Bloomberg.comAs U.S. companies return to Venezuela's oilfields — one Canadian driller has a head start  Financial PostTrump administration moves closer to opening Venezuela to more US oil producers  Politico",
    "published date": "Thu, 12 Feb 2026 17:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNZV9MdWhPYkVwZzAxbzVDbDFjWVBoMWJLVUtXX2Z3NUxEdjhTYXE3M3pUWlVTakFickxLbkdySlhNa0prMDhSTUl5TUlzb0dmRGxFQzFHUUppSnR0WndzQ0NoelNuRXBNeVF2MHcwRi1fdDBxTnpZWk9uWUo2bHdYdWhKSDBvUUw5NDFzbGxLX1kxZjJmSUNweHo3MDF3Sk0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestreet.com",
      "title": "thestreet.com"
    }
  },
  {
    "title": "RFK’s idea of making America healthy starts with making it politically sicker - The Economist",
    "description": "RFK’s idea of making America healthy starts with making it politically sicker  The EconomistRFK Jr. made promises to get his job as health secretary. He's broken many of them  NPRTrump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted  CNNRFK Jr. pledged more transparency. Here’s what the public doesn’t know anymore  Toronto StarWhat has RFK Jr. done? 7 major moments from his first year as health secretary.  USA Today",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNdzZRNWNrbTMtSkpLb2RTRGx4YXFuYkRlOUtSb0FhWW5XZlNGanRRN1E4QnVlbTUtUU91SjBqM3pybWl2dkpFdUJKSm9vY2MtNWRObjctdVB1R2g0djE4UTFDcEVsNUNTY2MwNEJBaS1zMmpVeXBFczVjZUFGVXBiM3hNclpEUDBEaXVvNllJUkRieGxHUDJmV2QxQ1FCTWZZS3NSRXZScXNtMVMzWGM5d0FUQW9CSnNRU3lzdVl6SlV4Q2ZMd0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Congress plunges into \"no pressure\" government shutdown - Axios",
    "description": "Congress plunges into \"no pressure\" government shutdown  AxiosDHS on brink of shutdown as lawmakers leave DC without a deal  CNNThe Latest: Homeland Security seems certain to shut down tonight  Toronto StarWhat to know about the Homeland Security shutdown starting this weekend  CTV NewsU.S. Homeland Security shutdown looms as Democrats push for immigration enforcement curbs  The Globe and Mail",
    "published date": "Fri, 13 Feb 2026 00:43:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBFdTRZd3VlZ2RuRkFVak9DbEt3NzV2cGV5Z3NhazFINEJxR21kRXNIVjc0RVRJX0FyNzJKNFpMMmVaamZkdFVHT1R1VHVVN05mSHU4UUJzdk1KU2tPOXc5a1hfM2k1TVBKMXZvQVA2bi1rSnptQmNWVmJyRVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump sends calming message, but closed-door talks with Netanyahu focus on potential war - Ynetnews",
    "description": "Trump sends calming message, but closed-door talks with Netanyahu focus on potential war  YnetnewsIran’s Larijani accuses Israel of trying to sabotage US negotiations  Al JazeeraNetanyahu Seeks to Kill U.S.-Iran Talks to Start Another War: Mouin Rabbani  Democracy Now!Returning to Israel, skeptical Netanyahu says Trump sees possible ‘good deal’ with Iran  The Times of IsraelTrump believes US is creating conditions for ‘good deal’ with Iran, Netanyahu says  France 24",
    "published date": "Thu, 12 Feb 2026 18:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE5lUm1ob3lWbXVEOE8tREd5TWVhT2s2d2hSNWl5M05Ja1lqMHRjWEYtZUxBNmo1YVdrV1k1eEkya0xqUHB4eF9XR051c3lONHFGMHFfcXZR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "Mark Kelly Tears Into 'Wannabe Dictator' Trump After DOJ Failure To Indict Him - HuffPost",
    "description": "Mark Kelly Tears Into 'Wannabe Dictator' Trump After DOJ Failure To Indict Him  HuffPostOpinion | A Grand Jury Will Indict a Ham Sandwich? Not in the Trump Era.  The New York TimesSlotkin looks to make sure DOJ has ended investigation into military video  PoliticoDOJ’s targeting of Trump critics ramps up with attempt to indict lawmakers  The Washington PostEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC News",
    "published date": "Thu, 12 Feb 2026 13:57:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZnZYbjR1aE9xYzh5TERGcDlGVF9qaHhKaU1GcTRTZE5wYmRRSHMyZXg1Uk5tNkh4YjRKNjFFSTZ4TmUwZ0RsWmZjMXVBVEprNk5FUGFUa0M2a3p3ZjhwS2ZKd2djMHRVUUtPWTB1Z0FRbHM0X0tXbDh3amFVaGZZOTdmSnpBc1VxaHNJdURyQ0oyRXVXQkQ0a2x2SWF2WW8yYWtUNFRERHdvZ9IBrwFBVV95cUxNVC1NTy1lSE5nSUs2M3hUMVZ0VkdiWXQyd1RaUXdqRllTQTJOd2F4QjNJWGtCZU5nSi1RWGhCY3Mwamx3RmIxRG81NzhILVJzMXRXdmtKVUg1OE0tRnN0N1FhcHdxazB6cVF0dWVMMjFkdkpiT1pPMEY1dWxGSlp5SFliSjROd1o0Vk5SU1B5OVJDYWlzOUp4UFI2SDQwZm5MaU54aktxNXRBd2ZiVVhN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "'I'm terminally ill but owed thousands by pension' - BBC",
    "description": "'I'm terminally ill but owed thousands by pension'  BBCCivil service pension backlog 'overwhelmed' Capita, boss says  BBC",
    "published date": "Fri, 13 Feb 2026 12:06:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFAzdzZTVFFQUEI5a0d2TDNxdWlobjdQQ3dYdWZlRUdiaFBFSzhad3pOTVpvRnNSeWl2T3poVHRRZXl4cFFWMDNsNE9fQm1QVTVLTTRNTkhSMEtUUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Police in France detain 9 people in suspected massive Louvre ticket fraud scheme - Castanet",
    "description": "Police in France detain 9 people in suspected massive Louvre ticket fraud scheme  CastanetView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 00:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPelljU1d1QWV0bnRyNk1KZW5GcGRYRHU1bVQ4UnJLRXdGVGtMSFFPNjhtTnRETDM4ZHpzWVdqM1lmdkJNQUxoSm1heFJJZC1udVUweVl4V1AzUTJjM203LTVOa0dqdG5CYXdKeGxRX3hCYmZqWEl4RUFWYmJJazRPWm1tVkprMU85bGlaMGVIWm9zLUZZVy1xb201RWZuaWY4NW5JeWhYNkc2VDBPZm9qZEJjWGtTQWRPVFpBVlNuZDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "New revelations from Epstein files take a toll across Europe - PBS",
    "description": "New revelations from Epstein files take a toll across Europe  PBSInside Jeffrey Epstein’s network  The EconomistThe Epstein Files and the Hidden World of an Unaccountable Elite  The New York TimesEpstein’s global network: What the files reveal  BBCJeffrey Epstein’s Bonfire of the Élites  The New Yorker",
    "published date": "Wed, 11 Feb 2026 19:55:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQOVZ1VE9ZenpBTTZ0X2FhTF9WbjNvdzFXOUpJNVprcV9CMjhvVWkyZEgxUGhNZHJZbEdkWmI1ZndhRmJCR2VRYThkaVY5LTlKeHBGVjNCUWE2THF3dWNSV2Q1RzVkVjByU1pCUXBqZVJEczdRdnQ3ZkdaV1BKQ3EwQmVZdjRLaHo3ZFk4NXR2a0lkZnJVMVJXajdCNNIBoAFBVV95cUxPeW56RXNnYlF0RGh6bm9Kb183YWxobzhUWDE4UUtiODZIT1VBY2pWU3lYSzhlWGlldGUxb1hlQ0tpbFJXLUtuSnVBMm1laUJHbU9fYTZrSDNEczR4YXlaSXBySFlnLTlSekRRQUh6b1ZXRHZlTkdzckFqVllhRTBxVWRmQ0lpbEVuSEhMcU1xWkw0bWtOeV95SU9pNEx4ZnZi?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pbs.org",
      "title": "PBS"
    }
  },
  {
    "title": "Pope’s Lenten message: Abstain from harsh words and rash judgement - Vatican News",
    "description": "Pope’s Lenten message: Abstain from harsh words and rash judgement  Vatican NewsIn this season of Lent, we are all in it together  The Catholic Register",
    "published date": "Fri, 13 Feb 2026 11:06:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNbUw3V2ZBMVh3ZUlJRXBjYXNnay1wY2hmRF9nVEFyZmx2MkdOUl9GWWVqOWtOSEF2LWNDWXRJX2lITFdaY1FrWWN5QkV1YzJPYVp2amFQYk9mUi1yb1ZtRVIxZ0Z3dXV2WmJDYlgxMmZuNG1qS0JMU0FFb2RIU3luSlZNNUI1NjdJeEpWZnZtZ0g4aEc1enA3YW9BWTFiN1hRejlmZXVUdldkUC05eG1Z?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.vaticannews.va",
      "title": "Vatican News"
    }
  },
  {
    "title": "US urges Europe to take the lead on defence in NATO - Al Jazeera",
    "description": "US urges Europe to take the lead on defence in NATO  Al JazeeraPentagon policy chief tells European Nato members to step up combat capabilities  The GuardianRemarks by Under Secretary of War for Policy Elbridge Colby at the NATO Defense Ministerial (As Prepared)  U.S. Department of War (.gov)US allies at NATO focus on Europe as the Trump administration steps back  Toronto Star'NATO 3.0': US & Europe appear to agree rebalancing of power is needed  Euronews.com",
    "published date": "Thu, 12 Feb 2026 21:39:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdHFudGRaQzcwYjl5SDBsSXlidGduZW1FRjR6SHNDcXlVSTRRankzUldnNkExRHZwaGNlbHV0VEVObVN4Q09iaWJsbGhuS2w2ZUlnUUp5cDVQVEFScTR1RWFQSUlqblFrb1ljMnU1Zk5kMkRRUGZUSGJBQVFQdmdMV1hDN0FNUkJiQnE2RWZRNkVfYjhweF9J0gGcAUFVX3lxTE1MMGhZMmZXNERaOUJqcEtFZEJrM0hzN2o1SWgwUk03NklRWjg3QWIzdmxwMmVXeUpFbTJsX1pLbnlxV1lZX20wWm85Y2Z1YWdhR2h4dm02czZPVzFrc1I0Ym1fc0NDcE9LS19yMGtEQUpHY0FkSXMwVmdPS0F0UWNkckxVaDJKbjB4SDVFMk1XZ1ZyY1Y0eDNzejhETw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Denmark Has a Clear Message for U.S. Travelers Amid Tensions Over Greenland - AFAR",
    "description": "Denmark Has a Clear Message for U.S. Travelers Amid Tensions Over Greenland  AFARSome Greenlandic Inuit say work on independence from Denmark will come amidst fight against U.S. threats  CBCU.S. threats revive independence debate for Inuit in Greenland  Global News‘We are not out of the crisis,’ Danish FM says as Anand visits Greenland  CTV NewsGermany's Merz urges US to repair ties with Europe  RTE.ie",
    "published date": "Thu, 12 Feb 2026 22:13:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOYjhsUFdIQnVpSUUwM0c2UTlTNFNSSjJ4dXRZVnluWFM4dnFCRkZ1dmtLaWpyU3JEX1FtQkdadjdwTkpiNWw5VUhzVGNpYU1Cai1mSE9qVHl2My1UVUNPNzNLTlMxTWY4WTVTYWY0XzlvZHZNaVdqRS1nZVJEcXo4eG5GOTduT2paRnlZZ19pV1htZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.afar.com",
      "title": "AFAR"
    }
  },
  {
    "title": "At least 21 dead after boat sinks on Sudan's River Nile - BBC",
    "description": "At least 21 dead after boat sinks on Sudan's River Nile  BBCView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 11:51:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE02WFpRemY2NXF5OEhlckVYUk9SOTkxOGFoTXZseXBucGg5TmpJdUk3SGZZdGNERnkxN0szQzlleVJ4V0F5bTZSYjA5Rk1YQ0p2Nm1uOHNJbkI0QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "La Niña weakening, El Niño possible later this year - The Weather Network",
    "description": "La Niña weakening, El Niño possible later this year  The Weather NetworkShift from La Niña to a neutral pattern as spring approaches  Yahoo News CanadaLa Niña is nearly done steering winter weather. What now?  USA TodayWeather-Roiling La Niña Is Likely to Fade by April, US Says  Bloomberg.comEl Niño May Be Back This Summer, Bringing Drought and Floods  The New York Times",
    "published date": "Fri, 13 Feb 2026 00:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNejdMY1BWSGFPMXdMOVdSNXpmLXQ2dlZQNHZrRV9ZM0xLZTBKbjBkeWtYazVvdEFnSUNCbVVSRFVOZXktZ2VFc3V2cmo3VzZBajNyZWtSM2pSMGE5dkhUTVRjTDgxZFRSMHlGOG04bU40Q2x5ZU9YeWFfTWJuQnowd1J5d0tHX09fZmRYQkUzSlFPR3otb1VKel96R2hGYnVYcVFEWjNjUzFQWnZraEtHX3dxbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "Trump case against BBC to go to trial in February 2027 - BBC",
    "description": "Trump case against BBC to go to trial in February 2027  BBCTrump’s defamation lawsuit against the BBC is set to go to trial in 2027, US judge says  Toronto StarEvery time Trump has sued the media as court date set for $10 billion BBC legal action  The IndependentTrial date set for Trump's $10bn lawsuit against BBC over Panorama edit  Sky NewsU.S. judge rejects BBC's stay application in Trump defamation case  Reuters",
    "published date": "Thu, 12 Feb 2026 14:51:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5XX0swLTBDOVRsa2FWU0VjdWhOaDc1b1NnUzZ3bXhBN1RjUlBwMDY3RmNDNFMzUG5zbXNGSURfcHBZbnpoaURXbzNqTFpoSEtWaVZSVlo5czViZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Republicans, Democrats want to hear from government about anti-drone laser that closed El Paso airport - CBC",
    "description": "Republicans, Democrats want to hear from government about anti-drone laser that closed El Paso airport  CBCFBI: CBP shot laser at Valentine’s balloons it thought were drones  MS NOWCommunications breakdown over El Paso airspace closure sparks finger pointing across Trump administration  CNN‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  PoliticoDo Drug Cartels Actually Use Drones at the Border?  The New York Times",
    "published date": "Thu, 12 Feb 2026 17:57:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBsWTRpQTFpcjE4NmRLc2ZydU54dFRzbjcxc283WTI3TWFNMmh1U2ZuYWZCX2dTdUdQalVsazItQmdtcGwxV29ubHl6RVprQUl0VUZ5SXRyY2hlakJTSEQ2QVhuTHBYRFh5bEFBY3VRajY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Sister of North Korea’s leader says South Korea’s drone regret was sensible but insufficient - CTV News",
    "description": "Sister of North Korea’s leader says South Korea’s drone regret was sensible but insufficient  CTV NewsNorth Korea Warns of ‘Terrible Response’ to More Drone Incidents  Bloomberg.comNorth Korea warns of 'terrible response' if South sends more drones  France 24S. Korea vows 'immediate' action to prevent drone incursions into N. Korea  The Korea TimesN Korea warns ‘terrible’ drone response  Taipei Times",
    "published date": "Fri, 13 Feb 2026 02:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPdlhIM19BNW4yV3lBS1FsZDZCeGlJc25PbFFzd1huX0c1Y1NfSGNrSE1HaGtlcnBMbzRjRTN0akR6T1k3SW5hUnF4TURKcnBfenByeVdtNzl1UFNIdXR5UFo3aHMzLS12WmNaWTc4NXo5UXRIYnlMRFZRb1RCTld3OW56OXBoOVRUMmYtbnJPMFRsV3lxVkxGRHVvLWpsS3dXZnVjNUdZMFQ1aTNaTDFwUnRsdjhFOC1ZM2o5eXBkaTJCeWVnLVE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Switzerland to vote on proposal to cap population at 10 million by 2050 - Euronews.com",
    "description": "Switzerland to vote on proposal to cap population at 10 million by 2050  Euronews.comView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 15:58:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOR0NmUHoxODdURVhYSXl4Tk5qUDlXS2pzRHpxa1Vtb3VKbXVWZGhKRXAxUVdDT0VrcGY4bGRodlowczI4cW4tS1dQdi1STjZITUpGV0ZmMFVpR09JSEZiMGhGN0xQeWtSWGFyR3lRLUNrbmhkQjl2YzlGQW9hd0tSNFNuMUlpRU52NS1ud1VRV1JTMDNpdzRwOTNrZXNqSUdVT0pWSWEyWXhMTGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Trump Finally Apologized For Something. No, Not That. - HuffPost",
    "description": "Trump Finally Apologized For Something. No, Not That.  HuffPostTrump doubles down on racist video, saying no staffer has been disciplined  The Guardian‘I Didn’t Make a Mistake’: Trump Declines to Apologize for Racist Video of Obamas  The New York TimesTrump says ‘Obama ape’ video was ‘all over the place for years’  The IndependentTrump defends deleted video depicting Obamas as apes, says it referenced ‘The Lion King’  Times of India",
    "published date": "Thu, 12 Feb 2026 10:08:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQU3ZYUGQ0NzVJMEwwaFdSVFR0VVhEQU52WmFvQ09qZFNROU9QMFZCX3VWUzAwSUU1UnFncDhjN3pYMVlvWDRIb0Y4MjVuOGRKRjRHdFNfLVdWOC1mTlZJbmZlSUtsMV9SWWFaMUNFSGFpYmREZWZwUGEtLUVxbTNfSnhfcHZ3akcySDlj0gGQAUFVX3lxTE1UNzA0N2dGTXJzOXl1eFNSV3lMT0d3QXdXYlhSQTVMQUhkMWZrOENLcW1xclNnSHNpU3FfZlotaGQ1WVZzNlVkdFdWal9kMDJ6a0E4LUc0RktTSVExWWdkTElwU3NEYy1Qa1BXTnBkVVNRYU1aODZzeHQ0Nk9oZ2tYMVRsdjBYaGdycGdmMW5Ndw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "UN chief allegedly congratulates Iran regime - The Jerusalem Post",
    "description": "UN chief allegedly congratulates Iran regime  The Jerusalem PostIran commemorates 1979 revolution as nation is squeezed by anger over crackdown and tensions with U.S.  CTV NewsLyse Doucet: In Tehran, rallies for Iran's revolution overshadowed by discontent and defiance  BBCIran’s leaders rail against US, ‘sedition’ in 1979 revolution celebrations  Al JazeeraIran marks 1979 Islamic Revolution anniversary under pressure from inside and out  CityNews Halifax",
    "published date": "Thu, 12 Feb 2026 03:03:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1QZGV4cHhfR1l4SVMxRHJlaGV0ZVZnNTd5aTUwRTZFZTktSGUwYWVfZG81OWxzbF9iX0pMY3J1ZTRnQUhzVU1kM193YXVsZ0hFX2o5cDhzNEVHZXJiaGtzRTdFbDNiUnNXUnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Norwegian police search former PM Jagland’s properties over Epstein ties - Al Jazeera",
    "description": "Norwegian police search former PM Jagland’s properties over Epstein ties  Al JazeeraNorway's former PM charged with gross corruption over Epstein links  BBCFormer Norway leader charged with corruption after probe into alleged Epstein ties, lawyers say  CNNEx-Prime Minister of Norway Charged With Corruption Linked to Epstein  The New York TimesCompromised peace? Oslo Accords figure deeply linked to Epstein network  Al Jazeera",
    "published date": "Thu, 12 Feb 2026 20:25:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOYnpRZ0YzRzVRc3o2dE85c2R0V200ZWkyRERxQjZEVDlGZ3pCN0FJak1HN2xZVE1ZcTM4WUJPWVZ3MjN4endmM05RQk5tbnVXY0Jxd2Z4NGdDZUd4dkxMS0ZpYmZLbUloSjAwaVFtN0NlUGpZMVlRZHE0Ni1lZ05kZlJOV3djNDgwX2lOcnlvM3lkTlM5U1RoUS01XzhhRU50MTZncDBwR1BwMTVSdjllLXdB0gG3AUFVX3lxTE9qYVBLZ0hHSHFMRS1lUXRiR05WX05acEdodnlYTlZ2UVRJOVFBQ1VtU0szTG9GM0xGZEdFM0pkcGt6Smg3OS1fLVlMd1hmUjJDbzU4eGZPSmNTUEt5QWhWNVdYcGNkdHBSbmE3VVN3SF9lM1V0LWJLWGUxczBvYmFGdGVuazRoSWVRb1J2Y0xGamJlYUlKRkhPemhGYWhhYjZGZzViRUtpSTR5b2Fwd1FiekctWnNpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "WhatsApp Basically Wiped from Russian Internet - Gizmodo",
    "description": "WhatsApp Basically Wiped from Russian Internet  GizmodoRussia orders block on WhatsApp in messaging app crackdown  BBCRussian Offensive Campaign Assessment, February 12, 2026  Institute for the Study of WarRussia says it has blocked WhatsApp amid wider clampdown on social media  CNNRussian crackdown on Telegram app prompts rare criticism from soldiers, pro-war bloggers and officials  The Guardian",
    "published date": "Thu, 12 Feb 2026 10:00:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPNXJWWk8zSjd1RmUyLTRhVkdJNEF4d3V5c1hiZGM5UUM1WVBqNGN3NFRXSWN4TVNWaDluSFRFdTk5YXRhVTdUQ2VQLWJzX1paU3dhSnppdkZpanZ1RTMwWTdEaDBDdXB0V1JGRnpEekdmY3JGQ0lXRVJqWllCSFllVVBPZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "UN approves 40-member scientific panel on the impact of artificial intelligence over US objections - AP News",
    "description": "UN approves 40-member scientific panel on the impact of artificial intelligence over US objections  AP NewsKorean professor selected as member of new UN AI panel  The Korea TimesUN creates first global AI safety panel as tech insiders sound alarm over the technology  Yahoo News CanadaAI ‘moving at the speed of light’ warns Guterres, unveiling recommendations for UN expert panel  UN News",
    "published date": "Fri, 13 Feb 2026 01:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUkliRThiLVJTZEZxOXNVZjBmS29uTzhmQWdVa2Mzam1pdHVQOE5vMmxwUXlveWFGMHdPdWFfRUwwWlY3MlFONUVhenlpNkc0Y1d4WmlicE01bnIwQm5telZXdEhPd3ZrSC0xTThhNEtIdHZDQlhnZ0hMVTM1WDRaRC1RNEhFNzZZOUFtSldwTWR1SlFZSUhBaVFJbUd4bWdNOE15SW0zRjI3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "The ‘Trump effect’ may test appeal of Europe’s far-right parties. Portugal shows how. - The Christian Science Monitor",
    "description": "The ‘Trump effect’ may test appeal of Europe’s far-right parties. Portugal shows how.  The Christian Science MonitorModerate candidate wins emphatically over a populist in Portugal’s presidential runoff  Toronto StarAntónio Costa’s legacy: The far right in Portugal  politico.euPortugal elects socialist as president but far-right rival takes record vote share  The GuardianReporter’s Notebook: Portugal’s far right surges in presidential election  Al Jazeera",
    "published date": "Thu, 12 Feb 2026 20:41:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBBZzlVVUVyLW0tQ0NudGhEeFpLM1FFQVl3WlI1Q19wRF9aNTU3cE1YQzh2anRpNEhreUlEbl94Yi1LUHcyT2w4MFZyWFdHaHVoRkxOOEtsYjBpa0tVV1NOdTdsaC00ZElyRGNPdEJremtEbGdnNzlPbjlnTGJid9IBlwFBVV95cUxOdEZsVWlJU1N2QVVQM3ctbnBUbHZ4aVRXN3JFSzhQT2xWUXJ5Y0ctMXo3aWRndDN5Zkg2RVpLSjUtVmh3REFOZWItT0Jsa01Pc1FWVkptZkFpTlZHYUoxTi1aRDdERXhHMzRGcEc1WW0xQW5iczFlM051anQ3VUpjLTdJam9rUlY5d1BwczlfX3hIaWpka3hN?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.csmonitor.com",
      "title": "The Christian Science Monitor"
    }
  },
  {
    "title": "‘Utterly wicked, perverse and depraved’: U.K. nursery worker jailed for sexually assaulting children - CTV News",
    "description": "‘Utterly wicked, perverse and depraved’: U.K. nursery worker jailed for sexually assaulting children  CTV NewsView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 17:37:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQQ2lzSUhoLXdPSGhxd2FRbHRxMVM0aTR3bW91NGdkUEZQOGNJeVE3Qm4yMWYwOTFaRE5ZcDhjdHN1N1kxbF9INDVVWWpTT1h3UEJOS2NzQUtmMlRFVkxSeFdtUkU1dWhYa0wxMjdDN0wza3BCa25ISXMyVDd2U0VsMXItTW9uWjN6WG93SlhwN1BXeFRtOThsR211ckdkT05JQmZGMU85empmNVRsc29VenU1WldJY254c1pUN20xSEZjZnlBemdrcVJPQm0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "What China is really up to in the Arctic - The Economist",
    "description": "What China is really up to in the Arctic  The EconomistView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOVG1iOWp3SFBCdGFGOGxSdjlEeC14OTJ6S3pQbHVlNlo0QjI1RU9nVG9qUVFwQkQ2TGUweXBua28wMlhKc1dfRlZncVNfQVlfVWxOcWh2cFM4OU1kQWN6Z21lUE1IWWwwOUg0TlpvUVpZWGdJUkdkZTBIbWZ1enlCc0I2bmpzNm9CZHAw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "MUN Makes Time Magazine List of World’s Top 300 Universities - VOCM",
    "description": "MUN Makes Time Magazine List of World’s Top 300 Universities  VOCMAmong the world’s best  Memorial University of Newfoundland",
    "published date": "Fri, 13 Feb 2026 10:55:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5sdnBsMWVpMHRlVGJIdHlQdXo5Z1dfaXpOTjlKQTh0OExpWkRjV0xsXzE0aTV1SGE2dmkwZy1mRGN1SlJLbldEUkhGN09RblNsUm9JX1NNOTY1Y1hHVWhRaG1n?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vocm.com",
      "title": "VOCM"
    }
  },
  {
    "title": "Time-restricted eating: Study reveals best eating window for metabolism - Medical News Today",
    "description": "Time-restricted eating: Study reveals best eating window for metabolism  Medical News TodayMeal timing in time-restricted eating matters for metabolic health, find study  Medical XpressDoes Intermittent Fasting Help Your Metabolism? It Depends  Škoda We Love CyclingThe Best Time to Eat Dinner for Better Metabolism and Sleep  Health: Trusted and Empathetic Health and Wellness Information",
    "published date": "Fri, 13 Feb 2026 12:25:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNWmJleEZkZk1EX01iVmxfY3VFeGxEUnRnTlllZ01yR2xVekJTNTZfZEgySUtuYWFyQXJ5aXFENVdEWEZjUUFVdjMwaHFrUkswVXF3eTEtRGdncjNKZ0c3Qm44UFgyWmFSNlQ3UUtxRTJyRXJZVVJrWjNza1Rkb3pOX3J3TThtQjdmMzJzaUJOdzdZOWZQc3FuNw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.medicalnewstoday.com",
      "title": "Medical News Today"
    }
  },
  {
    "title": "China banned all fishing to save the Yangtze River. This 'nuclear' option appears to be working. - Live Science",
    "description": "China banned all fishing to save the Yangtze River. This 'nuclear' option appears to be working.  Live ScienceChina’s Yangtze River shows signs of remarkable recovery after fishing ban  The GuardianYangtze River fishing ban halts seven decades of biodiversity decline  Phys.org",
    "published date": "Thu, 12 Feb 2026 20:02:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNUXp4VDVXNXlxVndqdVQ3U3V0T0hqU1BZaEtsZWROQk5PajRPSUhxN3AtWUs2VlRLNTJyeEVuMDlhWFlDVEc2UFdpUFlueFZLNi1CU2ZMUjJaUVI1ZjlDM3RVUTlIOFFwLW43Vm9RVzJ0MHd2ZTZZSWV2NEhxZU5wT2Zsa2ZJaHllR2RFa2Nldmk1ZHFYSTFDR0hKTExGTTkxZnBkU1VkcXZldi1ZeXpMZFBQZ3R0aHdLMWpPWHZORUx4aXhrbjNhVGk2UEY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "How a Russian ‘nobody’ went from being caught in Putin’s propaganda war to the darling of the Oscars race - The Globe and Mail",
    "description": "How a Russian ‘nobody’ went from being caught in Putin’s propaganda war to the darling of the Oscars race  The Globe and MailHow 'Mr. Nobody Against Putin' struggles with uncomfortable truths of wartime Russia  The Kyiv Independent",
    "published date": "Thu, 12 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQNUoybWQxQnJVMHY3dzhBdEZxQjBtUF94WFRPT1Ffc21EanlfclhUYV9MUUtuWVdRV2hvX0dyNGtieHNPWE5pbUZNZVR6Mm16SG1LcHQ0UFZDUVpkZGRENzZmWjRnc0hJc3lIcnlxeTNyZFByRDNyZ3BEWmR4QjE0S2g3eVNPSVZBRzJYOXBsdmZGSUhsSFZ4MEwzQTFwemtSRnJ6NjlrTENrc25iTVNVaA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "How lichen hold the secret to a breath of fresh air - BBC",
    "description": "How lichen hold the secret to a breath of fresh air  BBC",
    "published date": "Thu, 12 Feb 2026 06:10:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9XV0xYYThHdk5fOWdOeU56cC1PT3AxOXFJTVdfMVY0Um9qZGJIX3lhNjhPS1F4elhZbTlfdTlZOXlibkdkOVJqYWVEVENNQlJIRjZUZWZhcVZKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Gisèle Pelicot’s first televised interview: 5 takeaways from the woman who launched a rallying cry against sex abuse - CNN",
    "description": "Gisèle Pelicot’s first televised interview: 5 takeaways from the woman who launched a rallying cry against sex abuse  CNNView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 00:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNZkZ1dFlpTEZQLXh6Njh4SWRQa2FxRm1yNG8xZjNTRW5fdG00ckhzdTZpd19rZnBCMkFVaGx2SjFtY0gyOGJROTloTWdZTmhGYW4wN3NBZkhDY1pjWllXMFc1UUdidXhfZkhrb2lfcXAwTkRrNzNHcXNIYlVPOUhDTHZsV3hONEVhWUVsZEJiVGMxbmlFdUJB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://edition.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Moving pile of fishing net leads to record-breaking rescue - The Weather Network",
    "description": "Moving pile of fishing net leads to record-breaking rescue  The Weather NetworkBeachgoers Spot A Pile Of Bright Red Netting — Then Realize It’s Moving  The Dodo",
    "published date": "Thu, 12 Feb 2026 22:01:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQclRXTUphdHNURGhzRzRIR09mbmVXSXd4WmdoYkFJeGMtSFBZb0lZaUFPYkZ5RWlpQlpPMXYtY1d2cm9LYmswd01pc29hQ180R2FpUEVLY2dNRDQ3LV93cmo4RGF6S3ZUWEtBbjItZnNqS2Nxb0JHVS1faTJ0a2dLVTBXdlZJRWg3YTdzZDlZYW5QWmZPLWtXTjcyQUY4VTIyWHpPbXo1RHVQNlhkTHhsaGtJemhLQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "Trump’s NATO Dilemma - Foreign Affairs",
    "description": "Trump’s NATO Dilemma  Foreign AffairsOpinion | It Is Decision Time for NATO in Munich  The New York TimesThere’s One More Thing Tearing the Trans-Atlantic Alliance Apart. It’s Coming to a Head This Weekend.  SlateThe transatlantic alliance is down but not out  Politico",
    "published date": "Thu, 12 Feb 2026 05:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9MWU1GdEVFS1Y1Y1JydFQ3YUdIZklkQVJBZG5MVWd4MkVJRGE1cXhLemI5Zmt2X2dUR0hCUTM4Zms5Y3RPTHR4Nm1ZLXpzYkR0X21GRUZVZWFQQjVlSUhhVWdlSGxSUF9GMEhWaU1valM3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.foreignaffairs.com",
      "title": "Foreign Affairs"
    }
  },
  {
    "title": "Subterranean tunnel, possibly used for medieval cult rituals, discovered in Stone Age tomb in Germany - Live Science",
    "description": "Subterranean tunnel, possibly used for medieval cult rituals, discovered in Stone Age tomb in Germany  Live ScienceMedieval tunnel discovered in Germany were likely used for secret cult rituals  Yahoo News Canada",
    "published date": "Thu, 12 Feb 2026 21:11:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOREtmUHdnWXlaTU1pdGdBVFFqTUJUTXRUdXByOVlBSHFLR2JHQU9TU29TRXcwWERoWFhtVEc4V2M3ZUVpTmJqNzhweXZ2Y2ctd25DNmx3VlhJNmI0ZnlpczZGUmpMcnBXV0hpaGtXUElfX0J0b0ZOTDJDa1BjTVg1ZVVTc1FUVlBjVjlrUURydGlxaDBKWmliZHJZUzVxM3dXTlF2NHJjWUhSOFBYWjlTajhMcm15OFdrSW50WVNTNlUxWWJkcXh1LWo1ZzUtYWtmaVhqalpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "'Threat to world peace': How Germans see the US now - DW.com",
    "description": "'Threat to world peace': How Germans see the US now  DW.comPoll: Top NATO allies don’t think US helps deter enemies anymore  PoliticoDonald Trump prompts global surge in people viewing US as a threat  Financial TimesEurope's growing mistrust of the United States  Le Monde.frDonald Trump Drives Staggering Spike in People Viewing the U.S. as a Threat, in Canada and Europe  The Daily Beast",
    "published date": "Fri, 13 Feb 2026 03:44:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNbmFScUxmdnlxaVBZWHI0bFB0U3VwWWVibW0zckV4TnNQMzJkeDRPUkFSMkhnWGN3bzNMeWZsdENEekNabE8ycU1kQmt4aFRBNWlVRFlTVG5IaEtIbFhRc3pjUDFKQUlBU0QtcDZvaU53eExXNzQyQ3NQUzhRRl9oaWhKR2hVZnlP0gGIAUFVX3lxTE44aE5mb1VXcjdmcVQ4a3ZqbTFVYkZITW1fVHdiazhmQkVIaWxEeGRKcmJPUDRPeXRLNjJlZ0NqUlV4eVRGT1p1NjV6TWJZWjRGbno4WTNabFRFTFBVTGdtQm1sTDFjZEYxUHJHNDFnZ2dJQXJyWjRTMzlrcTJwM0RPaVQxNFUtMGQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Macron calls Musk ‘an oversubsidized guy,’ prompting retort - CTV News",
    "description": "Macron calls Musk ‘an oversubsidized guy,’ prompting retort  CTV NewsFrance's Macron calls Musk ‘over-subsidised,’ urges Europe to support domestic industry  France 24Musk SpaceX Subsidies Are The Wrong Target for Macron and Europe  Bloomberg.com",
    "published date": "Wed, 11 Feb 2026 22:55:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdVZVZ1Ewem5YUGJKNmtGQ1FWTjNEYzRFdnJtZzc4UDloSkhvbnctVEdteUpiYm1vekIwRTUtazFvU1dRVEFQMlBLVTdlel9ET2FrNTNjQ0QxMUNYbnFzMURBMXBtRWJKTERtcjFLMS1xcTd3LVV3QXEzX1pScFFZdHBpQ2IxOWpQUkdyZHVoTEJpbnhaclVvR0tn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Most Americans experience passionate love only twice in a lifetime, study finds - PsyPost",
    "description": "Most Americans experience passionate love only twice in a lifetime, study finds  PsyPostHow Many Times Will We Fall Passionately in Love? New Kinsey Institute Study Offers First-Ever Answer  News at IU",
    "published date": "Thu, 12 Feb 2026 13:03:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQYS1yT2JrVzVaUXpfdzJsY2MtY3EzWVhKbzZpOTVSNk5RdWxfY2FXNGhVV05kV1NMUGhLQWI3UUFka21Od2tMQUdtV204d2I3bnZwX2NTRGxUb2dhVzZGSVptNERpYVpERl84TUxfOEJPWjNWRmJlTFdfa29tZEVBZVdaVGdKQjJGcTd5ZFFGZFU0UTI4QXA5MXZWcVJBb1B6a2l6YTNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.psypost.org",
      "title": "PsyPost"
    }
  },
  {
    "title": "Temperatures will start slowly declining through the rest of the week, but first... - CTV News",
    "description": "Temperatures will start slowly declining through the rest of the week, but first...  CTV NewsCalgary forecast to freeze with a 32-degree temperature dip soon | News  Daily Hive VancouverCalgary weather: Daytime highs will be 20-degrees colder in just over a week  CTV News",
    "published date": "Thu, 12 Feb 2026 04:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxORzlJVnIwa25uSkZ1YV81NVR1OUhFZ053bkxIUkppVml6bV9sZVA4LWtSSzE0YmxmRU9jalZfcGdZZVRubDdjUjJ1T0hKY3pzVTg4T21fSUlLMFZEa0lkUU9FVVJiUkxmTjVhSy1CcWZKZTU2MUhGQnFoZkQxT29DUHJXUDlWT0J3QTFHUmtNSXZOdHFndHpkRkl5NXozSC1vVTlEQ2pZY29CLWh4dXV5MTAzMHFJOHdwYkQ0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "410-pound manatee rescued after getting trapped in Florida storm drain - National - Global News",
    "description": "410-pound manatee rescued after getting trapped in Florida storm drain - National  Global NewsA 410-pound manatee rescued from a Florida storm drain is recovering at SeaWorld Orlando  Toronto StarHuge 410-pound manatee rescued after becoming stuck in storm drain  Yahoo News CanadaManatee rescued after being trapped in storm drain under road in Brevard County | Video, photos  WESH",
    "published date": "Thu, 12 Feb 2026 19:16:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQa3FONDRWNkdCRnVFSGl6ZEsxTWVXUTE5UzF2WnpCeTNyT0w5SVRfVkFIMDZ1RTNZYkl4RGt1MjljcTd3dk92U1Y0X0ZEVVJPdHEyejU5Q0c1QUY3WDUyYk1GSEstU1BacFBQUU5ZMkJiU1V2SmJPZGRCY3lWUTJMd0hMRkZJMkQ3TXVLZ0NFcVhrRlpxajFiWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Africa-US relations: The continent grapples with the new world order - BBC",
    "description": "Africa-US relations: The continent grapples with the new world order  BBCAfrica-US relations: Africa dey struggle to understand di new world order  BBC",
    "published date": "Fri, 13 Feb 2026 00:06:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1BWXpWYVNRM2F1UVVtX2pMQUtrZmZrN2tGQUJBZ0tvTGhPR0hobzNLUjNWTkxaQ0I5OHVkSzZQZ2NaUzYyNXdpcXRiNTlucnNyWlY0MTB0aXMtUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Coalition to send aid from Canada to Cuba as concern over loved ones mounts - CBC",
    "description": "Coalition to send aid from Canada to Cuba as concern over loved ones mounts  CBCUS announces $6M in aid for Cuba as island's leader accuses it of imposing an 'energy blockade'  Toronto StarDelivering Additional Humanitarian Support Directly to the Cuban People  U.S. Department of State (.gov)US steps up aid to Cuba while choking off fuel supply  Reuters",
    "published date": "Fri, 13 Feb 2026 01:14:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1Zc3dZUDVIWnFWVmptZ0xhZGoxZi0tR1l4a2lVRjg3TkwzZmNPR1FjbVJ4VkdLQUxXenZhbENBN2Y5T3Q4bnFnQ3dQclM1Nnk4STlyR2VsZGh2c1gzUGdMOWNRc2ZYMDhWeElyT194UThGYmstaE5uSkRaZk1JZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Putin Pitches Trump Dollar Goodies in Bargain Over Ukraine - Bloomberg.com",
    "description": "Putin Pitches Trump Dollar Goodies in Bargain Over Ukraine  Bloomberg.comRussia Memo Sees Return to Dollar System in Pitch Made for Trump  Bloomberg.comWhy silver prices cratered on a reported Russian proposal to re-dollarize  MarketWatchRussia may return to US dollar settlement system in Trump deal: what the proposed US - Russia economic par  The Economic TimesRussia may seek dollar return in potential Trump deal By Investing.com  Investing.com Canada",
    "published date": "Thu, 12 Feb 2026 17:07:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPakZLcEQ3T1kxeWczd3RoM09TOF9aakQycGdNNEtmcFRxS09vVXVGZTZ6SUVHQUlZMVFXdWltelEtaWRkMDFFZHF4RUhwV3BXamluNzRZNEkwZTRzNUJ4R3puQmN0bThnWlc4VFBDX3BPaDBsZ3c3Ui1kQTZNYzA4NXYwbDQ1SHU3SW1EQ1dHazB5OWxUSDR6V1MtSnFfWVBlaUg3ckU3aFhZRjJnMDIydWdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bloomberg.com",
      "title": "Bloomberg.com"
    }
  }
]