[
  {
    "title": "An arts panel made up of Trump appointees unanimously approves his White House ballroom proposal - Castanet",
    "description": "An arts panel made up of Trump appointees unanimously approves his White House ballroom proposal  CastanetTrump-appointed panel approves White House ballroom project  BBCArts panel made up of Trump appointees approves his White House ballroom proposal  Toronto StarSee Trump’s Latest White House East Wing Designs  The New York TimesCommission, packed with Trump allies, approves White House ballroom project  The Washington Post",
    "published date": "Thu, 19 Feb 2026 15:53:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPVTEtdENrbUI5a1lYb3VZdTFvc2pOa2RKbURWUkFLN3FpS0JqN2k4a3VPdnF4VVlMaEZEdGFXelk1NUhUYmFzQ2p0U0tFeXE5TDhPQ1hCRlRLRE5qbktERUN1NEl6OVNiLUdzVE9zZkFtSHZXZ084WUtGZGJvVzdyeVRxbGhqQWJvaEdvQ19jY2d1dnlJR2J2MFAtU3kzZlRqVGxpS3VpTG9BdDhxV2k5cjZfX3l1UzFxTGsydzIzRERPaGNrMzZoaUdUR0c0R0g0SDdLeEpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "With no initial DNA match, Guthrie investigators turn to one of their newest tools to crack cases: genetic genealogy - CNN",
    "description": "With no initial DNA match, Guthrie investigators turn to one of their newest tools to crack cases: genetic genealogy  CNNWhat to Know About the Search for Nancy Guthrie  The New York TimesNo match in database for DNA evidence on gloves found 2 miles from home  NBC NewsNo DNA matches on glove found in Nancy Guthrie case, police say  BBCGenealogical sites have helped solve major crimes. Police in Nancy Guthrie’s case might turn to them  CTV News",
    "published date": "Thu, 19 Feb 2026 09:00:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE96RUZWaVNoTUJRUzJmaDVReGNYbUtvOHJoVFF4OW1nYjV2dy0tWUFmeG9RNnRheVhfckRVSDZ6dnN6TUJXbjlBc3UwbXZxLTdFbjN4YkZSenlwellJZVZiVHhSVmdOVmtoUWRkNk9OVzVteGVuaEt5UA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game - Yahoo News Canada",
    "description": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game  Yahoo News CanadaWhen Rhode Island shooter started firing, bystanders jumped into action to end the carnage  CTV NewsPawtucket rink shooter’s son set fire to Black church in North Providence in 2024  WPRI.comSuspect in Rhode Island ice hockey shooting killed ex-wife and son  BBCDaughter of trans shooter who killed family: ‘He had a vendetta’  The Times",
    "published date": "Wed, 18 Feb 2026 15:58:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQcERKZzVlbEJFRURFcHRGTmpfV2l3VG1DQzZDeUdqSkFvMlVfOXgzcFRmNC1SbWZETkI3cVdCMnA3TkFnQ0J1dzNad3Jla2RyV1BiZTdOTTdCNlY1cXpITGhkcGFBUnNCWGFTX1R2c1U3c2lvZWh0aHNaVHFheldJNXE1Y3gxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Former prince Andrew Mountbatten-Windsor has been arrested. Here’s what we know so far — and what happens next - Toronto Star",
    "description": "Former prince Andrew Mountbatten-Windsor has been arrested. Here’s what we know so far — and what happens next  Toronto StarFormer Prince Andrew arrested: Read the statements in full from the police and King Charles  CTV NewsThe Situation Room with Wolf Blitzer and Pamela Brown  CNNFormer Prince Andrew Arrested in UK Over Ties to Epstein: Live Updates  The New York TimesRead King Charles III’s full statement about the arrest of his brother Andrew  The Globe and Mail",
    "published date": "Thu, 19 Feb 2026 14:28:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNZDBYR3AydmpYcHNFOHNGaFhvNERBQ1NqRkI5ZnZ0aThFQkJpWUU3aGpKUjR6Uk4tQXBiMjVFblh3RWlTaGhaTC1NR0wtM3hVdFYxVlRzQTJRbFUyUVpXS0JSQ1dkY0pYOWF4dXNJc1BfUXozc2VlQWV1VHdQdV9KY1JJT2N6R3M4cUNZaFZEeWF6S1R5UkJFdlR5Z3pMSmNoSzhhNUZnMXhGWGEwWGI2aDlHdEFEbU5hd1dySEl4LVJWbG9XT2dsbFQ1RjNpaGRvLU1ZcTNDd04?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Trump says world has 10 days to see if Iran strikes deal or US takes 'a step further' - BBC",
    "description": "Trump says world has 10 days to see if Iran strikes deal or US takes 'a step further'  BBCWhat latest flight-tracking shows about size and scale of US military build-up in Middle East  BBCDonald Trump repeats call for Iran to end nuclear program as world leaders gather for first Board of Peace meeting - US politics live  The GuardianIran and U.S. wage gunboat diplomacy as Tehran holds drills with Russia  The Globe and MailTrump to decide whether to attack Iran in next 10 days — oil prices jump  CNBC",
    "published date": "Thu, 19 Feb 2026 16:40:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE02ZG1PUjQwZzZYMFBMNEVRQzAyZ1gySzROMjZOeHA0ZlFuZ1VFYklXZFBmOEI3VUkzODBkenVzOWozNTRoMEk3R0hPelE4OXd6bFFKSEhjREhRZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump gets pledges for Gaza reconstruction and troop commitments at inaugural Board of Peace talks - Toronto Star",
    "description": "Trump gets pledges for Gaza reconstruction and troop commitments at inaugural Board of Peace talks  Toronto StarTrump hosts 1st Board of Peace meeting, announces pledges for reconstruction-peacekeeper funding for Gaza  CBCThe Latest: Board of Peace members pledge $7 billion for Gaza relief  Toronto StarTroops for Gaza and money top agenda as Trump’s Board of Peace meets  The GuardianVideo: Gazans hope for reconstruction as Trump's Board of Peace meets  The Globe and Mail",
    "published date": "Thu, 19 Feb 2026 17:30:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowJBVV95cUxOc29TZDJCOXFBRmpERjBLSF9ua1pSTVFiSVBwYk9ib1lZcWU2Qjc2VkhGV1ZRUVp3ZC1wQ3NoTzExbHFTUGJDeXVZRmpHTmN5RDJmMk1Fb09JeW1GbE51VURUMzcxQ0JwYmwwczhiZFpEZDdVQVBJcFRDN2hzQUMzbTlwdDZmaHQtOWxxNXZZRTUxUnhWRXhHQkV5LUREVVNuVDZ2emFGeG9RSEZpNnQ5aWVqdXQ2NjZWcUVHeGN4dWNDUVhvTEpMT0g2azBFcnY5VlRUWlpvWG9tRHFMNGc5VURfNEF5VnBfQWJDNUk2b1dBRWJ6bXBuSFg0cFA5WDJYX25panhtNXFrRFVIMUs5cGpQM1MzQjUtTUdNeEtBNkNfRmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "South Korea's ex-president Yoon receives life sentence for imposing martial law - CBC",
    "description": "South Korea's ex-president Yoon receives life sentence for imposing martial law  CBCYoon Suk Yeol: South Korea's ex-president jailed for life over martial law attempt  BBCVideo: Yoon's lawyers slam Seoul court after life sentence verdict  The Globe and MailThe splitting image: Yoon verdict will deepen divisions  The EconomistSouth Korea’s former president Yoon Suk Yeol jailed for life for leading insurrection  The Guardian",
    "published date": "Thu, 19 Feb 2026 09:48:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9QZzhxU25sb0JINC02cTlvWEJCRzRmWjJuMkNwSlZ3NTlhVzdGX1ZSODdyTXFGR29QcXVjUVN4YW9ZdmZiWjM0MU1FNzNtUUFfZmdyeTBmbm9pVXp5WHhxQUt4VkpZRDVGQk02b2d1WnFxdzM3d3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Leftist who defended child marriage elected as Peru’s interim president - The Guardian",
    "description": "Leftist who defended child marriage elected as Peru’s interim president  The GuardianLawmakers will elect Peru’s next president after the latest ouster  Toronto StarPeru Congress Picks Balcazar, Fifth President in Five Years  Bloomberg.comPeru’s interim President José Jerí removed from office amid corruption investigation  The Globe and MailPeru names new interim president after removal of José Jerí  BBC",
    "published date": "Thu, 19 Feb 2026 13:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPWVlQSlJZZ0Vlb1JSUnJUVXY0bEwwcXBUQ0FWWkVyZjhWa01jbnVNbTFIZVpIZVZSNFNHaFRPUl9qbGJZcjB4cDNVdjJ4WjJUbTR2R1FSMkhlX2pGLXhhRHdkRWdUaTUzd1NaQ3lnYWZWNE8zQU43QWlVODdLYV93Rmh6ZUFhanpTRG5oUE84SnkwcEgwMjFXX1JHS1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader - The Times of India",
    "description": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader  The Times of IndiaOpinion | Jesse Jackson Was a Style Icon  The New York TimesJesse Jackson showed us how love can always be a potent force in public life | Reverend William Barber  The Guardian'I carry his legacy': Black Windsorites remember Jesse Jackson | CBC News  CBCRinaldo Walcott: Reverend Jesse Jackson spoke into an embattled moment. We need another like him now  Toronto Star",
    "published date": "Tue, 17 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPUFF1QmE1cUMtU2hVVVJLVWNvdjdPV0stZXFldzBWakY1bVAwVUZLM0J5anV3S3VjNEowOVlCMklPZFJQWnBlTFlrN243S1FIcnZhWUFFUmp6ZzhMcngwd05uU3MyOGNlRlBRTnlsdVNUdnBVdzVmRFZuV1JOVENTS005bzZIWVo1X1k2d3pjVXFKNUdmdmp2VWNQcDFJM29CU01qbTJPSWxuOE5GSUFqb1N4V0VCTWZ3N0hpTWdndDZEYXVLMWI1bE4yTDVHM0tSV3o1Q0xpWHdTQTRsb0FyYlRVbXE4QVRudUNjTTF3ZWZ2NU9mM1BiamsxTdIBgAJBVV95cUxPaXRXbjVyOU14VFR3YWJYeW5WRDJvSHBaNjFVRFUtN3kzVUgtcEFheVExRlZYaUN2SlRQZzBpTGtjUWNOeGRkbndsd2t5dVNYY3VfZTcyYjlFT05naHZiLXAzVEtnM09iRmI0bnYyZ1ltTTlFejNsdU1MRVBES1dIU0g2ZmY0QktmOHNWNkJXRVk3bFIxV2wxNlpKMEhtZWMtTDZ6elRTczkwMFVINkRETXZXOVVDcm1nTi00ZXEzbmRHckVOcHNFNU9lZUVHQklacHF1dlQwWTNiRWM1Y2xuclk0TmxpUFVQc3JxSU1YWlFldzhLcTVZNmJkRC04NDNK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "The Times of India"
    }
  },
  {
    "title": "8 skiers found dead, 1 still missing after California avalanche - National - Global News",
    "description": "8 skiers found dead, 1 still missing after California avalanche - National  Global News8 skiers found dead, 1 still missing in deadliest avalanche in Northern California in decades  CBCQuestions over why ski group stayed on trip 2 days after avalanche watch issued near California's Lake Tahoe  CBS NewsEight skiers found dead after California avalanche  BBCAfter Avalanche Warnings, a Sierra Nevada Tragedy  The New York Times",
    "published date": "Wed, 18 Feb 2026 20:01:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQWTE5WHpMbG43ZnJmZG4tOVQ2TGlzUEZfQmhHeTRBMW5JeTJSOVJBNXFDLTdZUk1Rb1UwNFR0VlBiZ3VsODNrN05YRjIzcXZyMGdoNkVHaTJHVlluNGg0bkxzRkRFLVJBLTA1WXBleFVBbGpxcDIwemRaRXdvSHZFWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ukraine peace talks cut short in Geneva as ‘dissatisfied’ Zelensky accuses Russia of stalling - The Globe and Mail",
    "description": "Ukraine peace talks cut short in Geneva as ‘dissatisfied’ Zelensky accuses Russia of stalling  The Globe and Mail'Difficult' Russia-Ukraine peace talks end without breakthrough  BBCUkrainian and Russian envoys hold a second day of US-brokered talks in Geneva  Toronto StarVideo: Zelensky ends 'difficult' Ukraine peace talks, accuses Russia of stalling  The Globe and MailBalance of Power: Zelenskiy Says Russia Is Stalling  Bloomberg.com",
    "published date": "Wed, 18 Feb 2026 11:44:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPYVJ0ckU4cHdnMGVDQi1CSnhFbmlIdzF2eS1mUU1UampuRkJ5TGtFenpRZXNzeHhXaEtUbExlajNnNHc3b0hEN2ZYeDZGeVJuSFJOWi13LVBXd3BjOVVUd1JHMHpCZjdoMkF4UDl3ZGtmelNOSWtMdlhGM0VoS29vczU1dHR5TjdRTkItc1RJbjVaeW9CRmRxblc0bzVzRDhIQ1VkMTVOd2ZaTC1UTVczNVdkdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "What is Ramadan, the holiest month in Islam? - explainer - The Jerusalem Post",
    "description": "What is Ramadan, the holiest month in Islam? - explainer  The Jerusalem PostRamadan around the world – in pictures  The GuardianCalgary community joins nearly 2 billion Muslims around world to begin Ramadan  CTV NewsMuslims around the world celebrate the holiest month of the Islamic year, Ramadan  Yahoo News CanadaRamadan ushers in a month of fasting, worship and charity for Muslims, in photos  Toronto Star",
    "published date": "Wed, 18 Feb 2026 11:03:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFA4NGNucEZqUWpJSVVRNERlTjBMQlpJVTBfd1c1QW5JaUVqZHlHNXJMTXZLdko1M1o4XzNwR3hoalRyeG5xNWdKZTZtWmZEeElicV9NdmFnMDBqZ3Mt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Iran security official appears to fire on crowd at cemetery - BBC",
    "description": "Iran security official appears to fire on crowd at cemetery  BBCIranians grieve defiantly for thousands killed in last month’s crackdown  Toronto StarIranian families mark protest killings as schools observe strikes  Al JazeeraIranians Mourn Slain Protesters With ‘Revolutionary Rage’  The New York TimesForty Days Later, Iranians Honor Their Dead  The Free Press",
    "published date": "Wed, 18 Feb 2026 18:14:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA2MW4zcHpCOXl5b3cwLVRaYWVvWGNmNVIzMWU4ZGtVWER6aVpaR1pmdTM0NGd5SnF2UDYtZEJWd3lmMTdtaC0wWDdZNEloTW1sOXFaaWdtMllLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Canada faces challenge as it navigates growing calls to help Cuba amid U.S. aggression - CBC",
    "description": "Canada faces challenge as it navigates growing calls to help Cuba amid U.S. aggression  CBCAid the Cuban people, not their oppressors  The Globe and MailSun, sand and empty beaches: Trump oil squeeze chokes Cuba’s tourism  CTV NewsOttawa faces calls to send essential fuel to Cuba as U.S. widens oil blockade  Toronto StarCarney facing calls to send humanitarian aid to Cuba  National Post",
    "published date": "Thu, 19 Feb 2026 09:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPby1pX2FZbVNlVHo5cERTSWdoZUVIUndZY0RHYkdWWkZOUG43VDZxQTdwWmxLX0VTRkRKTEFralJXU3Zya0MtYmsyUHZfXzBHNmszZ3Rzazl3WmhjR01NdTRoRTNjcTJQSi1fckdaRm1NTEdqeHlSN0Y2X09RQWFQOTNETWVqdVVycmg2MUU0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Iran says 'guiding principles' agreed with US at nuclear talks - BBC",
    "description": "Iran says 'guiding principles' agreed with US at nuclear talks  BBCIran and the U.S. lean into gunboat diplomacy as nuclear talks hang in balance  CTV NewsOil jumps 4% after Vance says Iran ignored key U.S. demands, military strikes on the table  CNBCIran expected to make written proposal for resolving standoff with US, senior US official says  ReutersIran’s supreme leader threatens to sink US warships as nuclear talks continue  The Hill",
    "published date": "Tue, 17 Feb 2026 21:38:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE4xdDdRRFpFZWpxWHowVjZXa1pLY1dUdW1HSmpKb040UmFYeEVmRTRwcjR0S3kzb1Z1LTVBR00tQnlJZmllQXo5NHpDdTR5dnlLYXlvYnNHQ0Vodw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview - Global News",
    "description": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview  Global NewsWhat's the equal time rule at the heart of the Colbert-CBS dispute?  CBCStephen Colbert Splashes Into the Texas Senate Race  Bloomberg.comFCC chair Brendan Carr says media were ‘lied to’ over Stephen Colbert controversy  The GuardianOpinion | What Stephen Colbert’s spat with CBS is really about  The Washington Post",
    "published date": "Wed, 18 Feb 2026 16:14:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9tSTZ2alNoeEw1Mi1XZ3AxVlJsV1JCeHFIMVd0bE5HRVRpZ2wwSkZzS1puZlI5Wlp5SUZSYkR2NDhNUU9haVA1NF9BLVlzSVlVX0JMcE8wbXpRVmkzTDNtSVpVZ1JrRVlOcFY1N0c1am55Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Humanoid robots show off creepily impressive kung-fu moves during Lunar New Year festival in China - Live Science",
    "description": "Humanoid robots show off creepily impressive kung-fu moves during Lunar New Year festival in China  Live ScienceChina’s humanoids are dazzling the world. Who will buy them?  The EconomistChina’s dancing robots: how worried should we be?  The GuardianHumanoid robots perform advanced martial arts at Chinese New Year gala  Al JazeeraAnalysis: China’s biggest TV event had a clear star: the robot  CNN",
    "published date": "Tue, 17 Feb 2026 19:11:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOblNPZWhiRDNjbXJoNHhodHBQT2JfSWtNc1JiZ1BGQ3JEUDJsWi10ZW15cGNpd1VnLXRoOTVCVGRGOE9kdmU2QXI4Q2NfM1VDc204Q3FUdXV4M3BtU2xoSXBTUHA5VjBfSUlfMTZqRy1zckQyaGJqa3BhdFpNZkMzeFEzMzVCSHRGZjJhNnh1NHQ0bmRYUUExNnl0dXMxSTZqVkVSWEFTVXZ6c2k5SGEtRjN5U2Z1dWFuby1scEtnMGV2TjVuRDJJUDRUWkZFbnE5d055T2VmWGttRXMtQklR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "Japanese PM Takaichi's cabinet resigns - China Daily",
    "description": "Japanese PM Takaichi's cabinet resigns  China DailyOpinion: After a stunning election, Japan will be unleashed. Or is it already too late?  The Globe and MailTakaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development  Toronto StarPolitics  The EconomistBloomberg Daybreak Asia: Japan's Takaichi Formally Reappointed  Bloomberg.com",
    "published date": "Wed, 18 Feb 2026 00:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE51aVdhdzFnZzYzQkhqcnppV1BvSXJnSzJxTE1HOEY3SHlzZE55Y08yRVdDbjBWVm1yNmxabW9aV3g0b0ptMzdYZVFjdFFZZWdWSEVaLU1IcnpFR1VqZEF4ajRMRHVhVGhxUFZ4NVUzUXA3cGZrd0pjbnQwSzF2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chinadaily.com.cn",
      "title": "China Daily"
    }
  },
  {
    "title": "Thanks to Trump’s threats, tourism in Greenland is booming - The Globe and Mail",
    "description": "Thanks to Trump’s threats, tourism in Greenland is booming  The Globe and MailWhy now is the time for Canadians to visit Greenland  National PostMorning Update: Trump gives Greenland a tourism boost  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcWItRDl1a0QyWE1fa09YZ0lPRmtxT00xVW1PVkdaQXo3X2hHZGNWUXlORU5PS09rYXRkWWpGYVN1Q1QzaWFSTWhqZHZta0VoSGI3X1ZhalFfYWlVR0JIWEJ3TTVZODNfdGhBdlRtMjNRYTRuTWFwcEZ6OXEyUmZSaEVYNjlUakJDMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Donald Trump’s envoys failed to reassure Europe - The Economist",
    "description": "Donald Trump’s envoys failed to reassure Europe  The EconomistSecretary of State Marco Rubio at the Munich Security Conference  U.S. Department of State (.gov)America offers Europe warmer words, but a deep chill remains  The EconomistForget Maga. Welcome to Mega: Make Empire Great Again | Mehdi Hasan  The GuardianMarco Rubio’s Impressive Speech  The Atlantic",
    "published date": "Tue, 17 Feb 2026 21:28:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNc3ZsNW56VWpUZzZjSnZxUmsyT3MwaEhKR2JSZnpHYnNPUzJwUjR4NEhKVHMzam16WmwySXo2U0IxODdYVS1Lc3haUVNOT0ZGSTMxdEhfVmVnczBZT0RYWjMwT0VFQkpwVmNOZXZyMkt5U1BMM0swamJVRjlzcy1FV0hPU2NwcnpDdVNIWW9SSHlTbFJZOVVVRGkteEI4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections - CBC",
    "description": "U.S. environment agency sued over scrapping scientific rule behind climate protections  CBCOpinion | Why the EPA’s emissions reversal is the responsible decision  The Washington PostGlobe Climate: America vs. climate change  The Globe and MailTrump has done more than harm the government’s ability to fight global heating | Jamil Smith  The GuardianWhy California could be the big winner as EPA abandons climate policy  Politico",
    "published date": "Wed, 18 Feb 2026 17:42:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFB6YXBPbVdGMUZtTk90SGtkbHc0QmtRWHZ4LVFFM1dhWTZWbEwwenFWdVU4cDZUUENrOXlObGdVVXpVc0wweWgtMFFhZ09pVnVuVDZnYlNIcWxrUzVpTm9UYnhGd0FOa1J4Ync?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find - Gizmodo",
    "description": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find  GizmodoThe political effects of X’s feed algorithm  NatureX’s ‘For You’ Feed Could Be Making Users More Conservative, Study Suggests  Forbes",
    "published date": "Wed, 18 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNOV9JbTdROS1RWjR4Wm5ESkpIUGFXeDJOeU1yOTJMVEt1ZVRMRGNlLWlXNFlUeWJ0aG8tajdUS010QTg3WHlBeFFSdnNlaW1FZEZDNV9DSkFQRi1mQ1ZIRnVDakl5M3Roc1AySlJUVk5tWWg5ODR6dTF1VUhXLTdLTnlINTUzU3RrLTRwVVJ6cU5VNVRBVEs1dEEtaTh6R2V3MkQ2cG9iNlRwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "From foreheads to crowns: How Ash Wednesday looks different worldwide - OSV News",
    "description": "From foreheads to crowns: How Ash Wednesday looks different worldwide  OSV NewsChristians mark Ash Wednesday, beginning the Lenten Season in photos  CityNews HalifaxLent 2026  History.comWhat is Ash Wednesday? When is Lent start date? Why Christians wear ashes, give things up  The Courier-JournalAsh Wednesday: Millions mark start of Lent in the Philippines  Yahoo News Canada",
    "published date": "Tue, 17 Feb 2026 20:29:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPc2ItNFJnY0YyYnpHZlU0WlZiS3VJVlUwazhrMmp5eWJDTUtlOFpSakJnVXhNNWk3eUNwdEdQSlpNT3dpV3BXNm94dk1VNmNFSzVOZklsZnVOdWQ0d1dnQld0TDBUazVXYVVzb0w0ZExRbjhOMnVKTTd5VlBXcmgzQnJ3SllIU1hpVGtUMTVJSm9hUzkwZDY0ZQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.osvnews.com",
      "title": "OSV News"
    }
  },
  {
    "title": "Russian Mi-28s And Su-35s Won’t Revitalize Iran’s Dilapidated Military - Forbes",
    "description": "Russian Mi-28s And Su-35s Won’t Revitalize Iran’s Dilapidated Military  ForbesIran holds more drills and US carrier nears Mideast in latest preparations for possible war  Toronto StarUS renews threat of military action as Iran, Russia announce naval drills  Al JazeeraIran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.  CNBCWhy US-Iran Tensions Raise Concern Over the Strait of Hormuz  Bloomberg.com",
    "published date": "Wed, 18 Feb 2026 17:27:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPOXExdEZwREF3UGxhR2FWbjRoVXpZWktMS1RPbHN2NEI2aHFPRk5fOWkxS195SkpjbXV5TW45ZVVSZVlMbUxjd3RuWEtxelgyR29xLTZHeVRzakZ2TDdyQ1lkUk5nWG9YTUVTZy01VzZCZ2NCdlNkeUZidy1qM2N5dWZQTlJDZWFUU000eUlzLXJNcXdnNzYyZmZIQXJHelBucXlPS1dLZkpLQVg4R0JKMFUtLWExVUt2RWl3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.forbes.com",
      "title": "Forbes"
    }
  },
  {
    "title": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply - Associated Press News",
    "description": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply  Associated Press NewsView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 16:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNc2RlNnN2OUdHcmhzVzVPLTU3M0pHVmJGU0V6dXgxaXhJOFc0dUdrQVFKc0tTVGZtNGQzUEY3R2Z5Uk9xS0ZJVU1zSlhQS05TaV9hbUdjLUVTTXJnT2tab2xpdWpac1REbW9XWHhYaHVGVHRvSlNhWGRCeU5MV3Y2bEo1T3MzOEJuclJpS1lvWmFnYVlldkhpbDZNamhhNUJJckhmSmxSV0FGV2JSYzMzTVNPMDBUWm8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "Expert: October 7 trauma shaping Israeli West Bank policy - The Jerusalem Post",
    "description": "Expert: October 7 trauma shaping Israeli West Bank policy  The Jerusalem PostThe quiet conquest of the West Bank and the death of the Oslo Accords  Al JazeeraMore than 80 UN member states condemn Israel’s plans to expand in West Bank  France 24India signs UN statement on West Bank  The Times of IndiaDaily Briefing Feb. 18 – Israel moves to take over biblical sites in West Bank  The Times of Israel",
    "published date": "Thu, 19 Feb 2026 11:49:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE53ZnZndlVrZ0YwTWlqNlJHbldjeGlDMDhEMFRPTHljQjhFbjRYZHFVd1lyTFZDZXd1VU1nNzdPQlZYQnJtX3dOSTd3T3R4X21JSGRoLTRfLWtjcTBr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "US threatens to quit energy agency if it doesn’t drop green transition - politico.eu",
    "description": "US threatens to quit energy agency if it doesn’t drop green transition  politico.euUS succeeds in erasing climate from global energy body’s priorities  politico.euIEA Meeting Ends Without Unity as US Pushes to Scrap Net Zero  Bloomberg.comTrump Admin Threatens To Withdraw From IEA Over Net Zero Agenda  Crude Oil Prices Today | OilPrice.com'Climate cult' hurts Europe's economy, US energy secretary tells AFP  France 24",
    "published date": "Tue, 17 Feb 2026 20:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPcWxlUnJCMExKd0FwY2NFVy11eEt4UGdTeUpyTFFSOUxySXlWdXJyYUdmWjhUOVJNalhXOXVmd2R1WVZrSXFJbmdjZFJTbkFhenBBVGZwV0tDSjZDOEp5TzFrTXBrcU52dmV2X19id09RdVF5RGIzNkVjNDhtQUpkSGNiOG9KMVR0Yy1lcEVLcjNmRXRtN2E0QXFCNngzRGl4eUVlS05qZlZkSUpZNDdlclVfM0YxRHc0eHlzbFNXcW9TaGNVV1FrWTRB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "French activist's killing leads to political furor, 11 arrests and a bomb threat - CBC",
    "description": "French activist's killing leads to political furor, 11 arrests and a bomb threat  CBCWave of arrests over killing of French nationalist piles pressure on far left  BBCFrance on Edge After Activist Dies From Fight at Political Event  Bloomberg.comPolice arrest 11 in the beating death of a far-right student in France  CTV NewsAfter Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left  The New York Times",
    "published date": "Wed, 18 Feb 2026 17:12:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB4dG9vdk5EZmxNWHJXQl85VUhjdGphbmFqOXBzN3llc1g1NzFqdG1uYm5HakFqRzc1djhmOFY1cW5pYW5tYVhQTVVxSzNFWGhscnIxSTF1UWFWTXlhMXJkWUlDZTdaLUpUY2x0SGhtTGpma0dYVXhXSi1ZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West? - The Kyiv Independent",
    "description": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West?  The Kyiv IndependentNavalny's mother says she always knew he was murdered after poison finding  BBCRussian poisonings aim to kill -- and send a message  CTV NewsRussia demands ‘concrete’ proof that it poisoned Navalny with dart frog toxin  South China Morning PostWhy Russia may have turned to dart‑frog toxin epibatidine to poison Navalny  France 24",
    "published date": "Wed, 18 Feb 2026 18:55:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaFhNZWNiWEpvUGxGWEJlZTBqc3B1XzI5dF8zUWkwZ2NrYkkxWm5lSVhtTDktRFBxZF9ZZUsyQ3kybnIzdHZlZ2xkazVtUkc0T1NXUGZRT2hoZS1mX3pVX1lZcXlCZ09jRE9pTHVHOVduZUU3QW5HelFmVHdzNzljSUt2bURrcWZCMzBTMzFpNW1KZFhzNkR3dmYxeWRQbXI2X0c2aXl3aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "The private sector elite enjoying steak through Cuba’s crisis - Financial Times",
    "description": "The private sector elite enjoying steak through Cuba’s crisis  Financial Times",
    "published date": "Wed, 18 Feb 2026 05:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBnUnA2dzd4dWhNUXMzNGRTSzZlWDNPLTYzMVFOT1Jfd0tJVUo1MzQ4dk1pSTQtWFRidTU4TUMyR0czZWU5bDJxd3RCQi1ycjRhb2x3UTZJUUNPUGNfdzBOcjZVQUxHdEJrNXJNRlluZWo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Don’t be fooled: The FCC’s ‘equal-time’ push is almost all bark, no bite - CNN",
    "description": "Don’t be fooled: The FCC’s ‘equal-time’ push is almost all bark, no bite  CNNFCC launches investigation into The View over James Talarico interview  Yahoo News CanadaFCC chairman says the agency is investigating ABC's 'The View' over equal time rule  richmond-news.com",
    "published date": "Wed, 18 Feb 2026 20:12:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPV2pOVkdZbEJnZzF2M1RxRXl4ZWlkVEdDcm4yblVzQ01oTjlCNklUUVRPaGREdjI4R1FhcWZXb1VwUGhIT25WWnVkWnE0b1l2T2lsRS1zd3E2bUg1QjBEVWY5WEVZRDZxY3pKSS1KbWZrOW1MT3QxY0MxbXdoMElzdXd5QTAzbTR5Uk5vcWlsVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "12 killed in China’s second deadly Lunar New Year fireworks explosion - South China Morning Post",
    "description": "12 killed in China’s second deadly Lunar New Year fireworks explosion  South China Morning PostChina fireworks shop explosion kills 12 people amid Lunar New Year celebrations  CBCTwelve killed in China fireworks shop blast during Lunar New Year  Al JazeeraTwelve killed in China as firecracker store explosion triggers blaze  NBC NewsFireworks shop explosion kills 12 people amid Lunar New Year celebrations  Yahoo News Canada",
    "published date": "Wed, 18 Feb 2026 12:15:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPTGJuV0JfYUZwLVhJRmJkZk1OeVNWTzVfTl9fSklMTkJ4cmJZMk8wdXpOa2dvdnpObWt3V2hjd01FaTZYak5fcFhIV0N2LWR0VUdueFI1M2N0d0hULWE2OERhNkFIZ24xUjBKMHpLYm5rSXFUUU9CdzY5dHlPQThsQnc2UDMyTzlpSTRDTjRaSHdlQldZYnB3Wm53eld1R01NZlZCRklrREhrUWtsWERXWXktVm5FaGxsNjVBcDNR0gG-AUFVX3lxTE5XLTJwQlM1S000bnE3ckE0bWhsMWJtY3JGZVplV2pDaHp3UzVxLVZnOTdYLXdFcUR5aTQxOWRFdGg4V19JUUxzazIyQ0tXOW5CbDlWZzlxcGI0azhuY0FTdVR1TTRhSkVEQ2N1YktGMWFkYXpTdXdueWlacjBYUGVkZnc5ZHVsb3R1ZVpkZ1YxRmNXMDRnRnBnLWJqUlhYS2pwbkFvUXZoM0tXblZUSWdPTzdVRnFLemZscmxSeUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club - politico.eu",
    "description": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club  politico.euTerry Glavin: Carney, leader of an anti-Trump alliance that doesn't exist  National Post‘Canada can broker a bridge,’ Carney says on new trading bloc efforts - National  Global NewsCarney constructs a mega anti-Trump trade alliance  politico.euOpinion: How Canada and allies can stand up to Trump and other great-power bullies  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 11:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNR0JIVGozbnRVUkxrakN6TUlMWEVZQTJqYnJPb01xdUlFdnZzbnRRaGJGNWtaRkNkZHhUYnhJbzFBN3h3SWJBM0FTRHAwdnZtLU55a1ctQV81eG4ydUNLVXZBZ0lBZ3M5ZEdlX3NNLUdpOW9MTXBoOXdWYVZLcFBGUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "People Turn to Poison Quick - Counterpunch",
    "description": "People Turn to Poison Quick  CounterpunchDavid Squires on … Jim Ratcliffe’s comments and his need for some home truths  The GuardianManchester United: Sir Jim Ratcliffe immigration fallout analysed  BBCJim Ratcliffe is wrong. Idle Britons are the problem, not immigrants  The TelegraphTrump, Musk and now UK billionaire Jim Ratcliffe – they are the enablers, making racists feel great again  The Guardian",
    "published date": "Wed, 18 Feb 2026 07:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBFRnZoZ3VpckJZc29HSG9kYlNxWmNTMlZ2T1pSMHRvLWt4aUtiZnZUbl9Bc2VUOGRSbWwwN0x4aTIwUjFPSV9hTlgxajdjQmFPLTFicHJ1OUhYYWlvOWE4VWV4SVZadzhOd1NHZ2Z4VGZzQXI3TWNr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.counterpunch.org",
      "title": "Counterpunch"
    }
  },
  {
    "title": "Russia's Putin slams U.S. oil blockade on Cuba: 'We do not accept anything like this' - CNBC",
    "description": "Russia's Putin slams U.S. oil blockade on Cuba: 'We do not accept anything like this'  CNBCRussia’s Putin meets Cuban FM, says US restrictions ‘unacceptable’  Al JazeeraRussia hosts Cuban foreign minister and urges U.S. not to blockade Cuba  CTV NewsPutin meets Cuban foreign minister in Moscow, says US restrictions are 'unacceptable'  ReutersBriefing by Foreign Ministry Spokeswoman Maria Zakharova, Moscow, February 18, 2026  Министерство иностранных дел России",
    "published date": "Thu, 19 Feb 2026 11:41:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQdjE0SmlZX0sxUHBXWkhLRkxQelZzZDRwWGdwdURlV3FubmRXN1lfSFh4MHlkNUpOOFNLTERwV3BRUzNqNFg2YUhGazNwcFJiYmNXNm5RT2pqbVg1WFB3dzNGdHktRkxFQ01DUkN5bXpWWEtiRFVjeXhlaUN0LWZQQ3lTNGFzTFUxTWfSAY8BQVVfeXFMTmhseDB3VnJwN29FZ0FwRUh4TVFIS0JkOWRDUldyeGItbmxTVVdwQVp4UDhiY3dGMVJubTNadEJSS3ZDYURobDVPSzh0alp4c281T0Q0NFQyanhSRE5HXzkxck5uVGJJMi1USVBxR2FBcXFmSzFadzNXNngzdVRpZHhxanJ6VkdNb1lPUERSeHM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "U.S. Attacks Alleged Drug Boats as Venezuela Oil Crackdown Escalates - Crude Oil Prices Today | OilPrice.com",
    "description": "U.S. Attacks Alleged Drug Boats as Venezuela Oil Crackdown Escalates  Crude Oil Prices Today | OilPrice.comFishermen in the eastern Caribbean fear for their lives following a deadly US strike  Toronto StarUS military says it killed 11 people in strikes on three alleged drug boats  CNNU.S. military strikes three more alleged drug boats, killing 11 people  The Globe and MailU.S. Kills 11 in Boat Strikes in Pacific and Caribbean  The New York Times",
    "published date": "Wed, 18 Feb 2026 16:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPZWluZ2tTbjJ0WEMzd19hQUlsZmhGNU90UXp3bXFMc3pwZ0lLbkd0ZHEtcXplZ1p6dDMxZEtZeF9kWHpuLTJfSnJDcjVFZU05ZWp0c2J1T3pIMUVYendSR0ZPaWMxbE5XbU53NG5NOF91QmNlT3pVLXkybS1lQjJDVDVuM19DRXJjaEVNX04yYTdETnBOT0RHeFJpaXhhWEVVRkIyT0VGbHdBZUZqWUVCMU9wNGlYWTNYLXVKY2Rva9IBxAFBVV95cUxQYjktRU1qaER6VGhsOGFsXzdfV2FpNENzQUZlQjdaNm9OVmd1RkJTUFFvVm9ib3U4anlDcjlzUkJEcjBsWlVVSzEtazlJM2xQYUdjZlctS3FCUHZuVGl0ZDg4ZVlDbnNkdnFSU2hlZnBiWXFQNWdWbWRob3pWc3ZuU1hWUTJ5TFlDNmRpTV9zOHFHYVdoN2Fnc3hGLUkyWXBpR1JJVDJtOUVSaUpieVphaThuc3g3WExGM1pNQVlfVUtwdUdC?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilprice.com",
      "title": "Crude Oil Prices Today | OilPrice.com"
    }
  },
  {
    "title": "Russia Orders Google to Pay $1.2 Quintillion—A Fine One Million Times Bigger Than the World Economy - UNITED24 Media",
    "description": "Russia Orders Google to Pay $1.2 Quintillion—A Fine One Million Times Bigger Than the World Economy  UNITED24 MediaMoscow Court Orders Google Ireland to Return $2.1B to Bankrupt Google Russia Unit  UNITED24 Media",
    "published date": "Thu, 19 Feb 2026 09:03:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQZEVmYUM0bjJfSXVzMVFIeVdnRkh1ZDYxZFpsY0Y4UkZkSE42eFRvdFdjc1pJbWN3SllfaHBDNEY5TWgxZVhtNDFKSC1oQTNRb04yZGxoS2ViNFhPTlhhMDNDbDZsNXV2MXQ0QWlJT2hDZnU4UmdjZExVRzJ3UUpXR0x3Zzg1bDh4Q29mTDFJMVJDS1cySmRBN3pjZkFxVHVTckRWNDdKaUZsaWIyN3Z6Mi13ZWZhYk1wTnBoSDJKNUFMeU5HU0NqUGthX0dmZTREVUZLbVFpY3Y?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://united24media.com",
      "title": "UNITED24 Media"
    }
  },
  {
    "title": "BBC to argue Trump failed to show he was defamed in documentary - Reuters",
    "description": "BBC to argue Trump failed to show he was defamed in documentary  ReutersBBC argues Trump failed to prove defamation  The TelegraphBBC reveals how it will fight Trump’s $10bn lawsuit  The TimesBBC Hits Back In Trump’s $10 Billion Lawsuit  NewsweekTrump’s defamation lawsuit against the BBC is set to go to trial in 2027, US judge says  Toronto Star",
    "published date": "Wed, 18 Feb 2026 17:56:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPalI5WENHbFBHU0FtRDlzV0xJZ2E5azlnWWVJWjZSWjdQVzU2MHdoakR6Q0p0UUlBUXp4a2JtaGsxNjVEdUhsNGF4ZFR2d0RtRlJudW93eGNPUW5IaFF6VXhkbzZqZXNQVU1RQzhoSWw3R2tTMjVjVlZGV1k5TXl2WVY2dmt1ajJmc1VPYXUwUmR4QlJWS3J2dTFJdkZsT1NKRzdXaC13dnVJa3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "SBU Drones Fly 500 km, Ignite Pskov Oil Depot as 113-UAV Swarm Strikes Russia - Kyiv Post",
    "description": "SBU Drones Fly 500 km, Ignite Pskov Oil Depot as 113-UAV Swarm Strikes Russia  Kyiv PostUkrainian Drones Strike Oil Depot in Pskov Region, Fire Erupts  МілітарнийUkrainian drone damages Russian Black Sea port ahead of U.S.-brokered peace talks  CBCUkraine reportedly strikes oil depot in Russia's Pskov Oblast, targets Belgorod with missiles, leaving blackouts  The Kyiv IndependentSatellite images show Russia put up anti-drone nets to protect its fuel tanks. A Ukrainian attack punched through.  Business Insider",
    "published date": "Thu, 19 Feb 2026 10:13:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE9mV2s4bkVtdVFHdUY2OWRuY2E2bkVURzQ0SEF1cTFLV3J4SnA0STZjQ1pvc1QtaURtT2xJQnVvVWRPdVY5dW5UcHJUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kyivpost.com",
      "title": "Kyiv Post"
    }
  },
  {
    "title": "Zelensky says Ukraine won’t withdraw from Donbas, 'won’t lose dignity' as peace talks stall on territory - The Kyiv Independent",
    "description": "Zelensky says Ukraine won’t withdraw from Donbas, 'won’t lose dignity' as peace talks stall on territory  The Kyiv IndependentUkraine war briefing: Zelenskyy says Trump exerting ‘unfair’ pressure on Kyiv during Geneva talks  The GuardianZelensky says Ukrainian public won't let him hand Russia territory  AxiosZelenskyy says US ‘too often’ pushes Ukraine, not Russia, for concessions  Al JazeeraUkraine's Zelenskiy says Trump exerting undue pressure on him  Reuters",
    "published date": "Thu, 19 Feb 2026 02:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPNDh2MzRFb3I2R0pzNW9XS1hUYUdxdl9acGUtQlk1c3l6ZXYyd1BPUU5BY1h3S08wZzFlR3hkOUpTWkZOUWlWQ1huSEVyRHdCUzdSSVZDNWZPVDJFZDFVOGxmM29CVUxNenN2TnhWRmNCemt4di1NZ0k5Z0dkcy1fSUR5U25RRHA4M3BmRWZzWXZDZ05PSkszeWNzdHVBYjBCQWNuQWkyX1JhZ3pwdlJJeWhJcG5VQjJJTk1WeG10NFRfNDVwLTlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]