[
  {
    "title": "Two babies found dead in French family’s freezer, mother arrested - CTV News",
    "description": "Two babies found dead in French family’s freezer, mother arrested  CTV News",
    "published date": "Thu, 12 Feb 2026 20:01:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOMlY3WW1yb2w2NkI3dWhuVnpKcHBPcEJuQ05jZHhNTW5NTDk2bTIzY29QMHp0Yk9EWHNmazYyc0xibU1pWHVUSjlsNFFsbFRZS0s3WEpscjd1Mk1jNWNyRkJBRWNrMnN3bFB3TjhjcExiaXhyOWFYQlFZYjYwWjNMVEltcXF6Vmg0Z2k1aGhNZjRqU0M4LUhGenpqYk1weFRIcWc4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Bangladesh election: BNP claims win in historic first election since overthrow of Hasina - The Guardian",
    "description": "Bangladesh election: BNP claims win in historic first election since overthrow of Hasina  The GuardianBangladesh election results live: BNP claims win, Jamaat ‘not satisfied’  Al JazeeraWhat Went Wrong For Hardline Jamaat-E-Islami In Bangladesh Elections  NDTVBangladesh’s BNP wins big in historic parliamentary election  CNNGen Z toppled Bangladesh’s autocratic regime. Will it decide the next government?  Radio-Canada",
    "published date": "Fri, 13 Feb 2026 02:28:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE96cThzYXFMX3dnRHUwc1AtNGg1VG1pc1hvTTZFYWxTUk41Tnh1SHJDYXdfTzZ1NFIzaHdFZmw3WG5QOVhDUFBjSElHZzJWNFVJcUpYU3NEWmRYc1V6Njk1aUhnSnhjZy04TERaRmJlOV9IQWxJYlUyMVlJNTJEUVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Donald Trump scraps legal basis underpinning US climate regulation - Financial Times",
    "description": "Donald Trump scraps legal basis underpinning US climate regulation  Financial TimesAnalysis: Trump takes victory lap after biggest climate rollback yet  BBCTrump's EPA revokes the \"endangerment finding\" on greenhouse gases. Here's what to know.  CBS NewsTrump revokes US scientific finding behind climate change regulations  Al JazeeraVideo: What to know about Trump administration decision to revoke key scientific finding  The Globe and Mail",
    "published date": "Thu, 12 Feb 2026 19:44:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5MazIzYS1MR3BlaDZsZW93S2NZQTllRVdPZnMzX01vcVBUeVFlRTJDQko5MzNuMFdvbnhndmlEc1lOMXlsWWU3MlpBNWFpVy03UWhTQlpIRVYtbkpfWkZnLXlUN3hrLXN6NmluNmJSeno?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says - Castanet",
    "description": "Second US aircraft carrier is being sent to the Middle East, AP source says  CastanetUS readying another aircraft carrier for deployment amid Iran tensions  Al JazeeraUS aircraft carrier ordered to depart Caribbean for Mideast, as Trump pressures Iran  The Times of IsraelU.S. Aircraft Carrier Will Be Sent to the Middle East From Venezuela, Officials Say  The New York TimesExclusive | Pentagon Prepares Second Aircraft Carrier to Deploy to the Middle East  The Wall Street Journal",
    "published date": "Fri, 13 Feb 2026 04:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPSDE4ckE5enZOUHdoeFZFSF9lMW9CRXNSZjlWRk9zMWdONmZJNWF2U2V1ZTJpY2lUM1BvQmN0M3poQ3REUDRqUEZHUzU0TmF5RkZvZjNwOE9DTFBocXN1dk1WazdRMXFadlNXVzFhdmlxZnlMcUU2aFdjY2dsVXNORndvS2ItVF9XYk4tTHpLRkhhcTYwTlhWaElDOVNsZDlSMEFORGV6WnV6ZmczR3h6MGJxbENZNUxp?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Air Transat aims to repatriate all its customers in Cuba within days - CBC",
    "description": "Air Transat aims to repatriate all its customers in Cuba within days  CBCOttawa area couple’s Cuba vacation cut short due to fuel shortages  CTV NewsCanada updates travel advisory for Cuba as power outages worsen: ‘Avoid non-essential travel’  Toronto StarSherritt warns Cuba mining operations could shut down amid fuel shortages  The Globe and MailFor some Canadian travellers in Cuba, getting home is not so easy  Financial Post",
    "published date": "Thu, 12 Feb 2026 23:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPaTBRcHZTaEpZbmttdVg3N082OWhxRU9NX00zQlRxZXpKQkMzZEVOckNnLUpuVm50emw3MHFPc3BSM0U3Q0lSeWRJT0RFRkVrRDNIOEJiQ19ZR0xBTnd0ak02VG5hanJlN2tRV2xMM1BjaXRIUjRiS0FiSkwwMTMwcWRwOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Top lawyer at Goldman Sachs resigns after revelation of Epstein relationship - The Guardian",
    "description": "Top lawyer at Goldman Sachs resigns after revelation of Epstein relationship  The GuardianEpstein files: Goldman Sachs top lawyer Kathryn Ruemmler to step down after email fallout  CNBCGoldman Sachs General Counsel Kathryn Ruemmler Resigns Over Epstein Ties  The New York TimesBirthday wishes, island plans and ‘xoxo’ sign-offs: Inside a former Obama WH counsel’s ties to Epstein  CNNTop Goldman Sachs lawyer Kathy Ruemmler resigns over Epstein ties  Al Jazeera",
    "published date": "Fri, 13 Feb 2026 03:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObG9mS1hUS3E3Q25mQWFvOG8xT21Wc2NSTHZEMWVZNTVxVXRZelBXa0dyeHpqUXNNZF9IUWdaWDk4M3VJRlZiTDkyOEQ3UmNJWTVjQ25ReWpfdE1vQ1ltcXctRnVyMGtBR3d1WWVuRzBHcHhPSHdDZ1loT2RuS3dvRmxiX082Z3U2M0xkTkc0OE1iRk1kRi1v?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video - BBC",
    "description": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video  BBCUS judge blocks Trump administration from punishing Senator Mark Kelly  Al JazeeraJudge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video  CNNFederal court blocks Hegseth effort to punish Democratic senator  PoliticoJudge Quotes Bob Dylan in Scathing Rebuke of Hegseth’s Bid to Punish Senator  Rolling Stone",
    "published date": "Thu, 12 Feb 2026 20:31:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9vY054T0JoQjMxeG40OXM3bjlseGxKTndadVZFMUxfdWZSZG1LeklNcVFzRFhCZlVyZUQ4bjdUUmpEbEhiQkx3NU1SVHFVbzk3S0R1clBtYTVNZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "How did the FBI get Nancy Guthrie's Google Nest camera footage if it was disabled — and what does it mean for your privacy? - Tom's Guide",
    "description": "How did the FBI get Nancy Guthrie's Google Nest camera footage if it was disabled — and what does it mean for your privacy?  Tom's GuideLive updates: FBI shares description of suspect in Nancy Guthrie case as reward for information grows to $100,000  CNNMorning Rundown: Epstein's secret cameras, more about Nancy Guthrie suspect, and... has Big Tech met its match?  Sky NewsExclusive | Investigators find black glove during hunt for Nancy Guthrie’s kidnappers — and The Post was there  New York PostPolice Spotted 'Suspicious Vehicle' Weeks Before Nancy Guthrie's Abduction. Now They Want Neighbors' Surveillance Footage  Yahoo News Canada",
    "published date": "Wed, 11 Feb 2026 19:44:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAJBVV95cUxPLThuMXZWV0FhV0NSNi1HMkNxb0FJcVhnaDNYdmduamxhYjZEcDl0QnRVdm9vMGRFUk1pWGV1Y2lOYXBuai1fQTNYdHZIU3JDTHhwZ1hITmFlcVl3LXZfYzZGMVR0TXl2Y2RBNndXZnprTkc3ZHRha3FaRGozV1lmalVZaGhsZ3F2cGZUSXlnbHlrdTZkOGhwbldTVElnNVVBclNqczI4b3pMalBnSXVGdEVsV2VMTjRXS1NWOE5MRTkxTlotM1FDdFZtNUFjNlVXc25pTVF1N0R1RmptN203Y3N5cVhxcktvWnF2d2Y2NUtrZVBjSFMtaVowM0hqLWhX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tomsguide.com",
      "title": "Tom's Guide"
    }
  },
  {
    "title": "2 Mexican Navy ships laden with humanitarian aid dock in Cuba as U.S. blockade sparks energy crisis - CTV News",
    "description": "2 Mexican Navy ships laden with humanitarian aid dock in Cuba as U.S. blockade sparks energy crisis  CTV NewsMexico sends aid to Cuba as Sheinbaum walks diplomatic tightrope with US  The GuardianMexican ships arrive in Cuba with humanitarian cargo amid US oil blockade  Al JazeeraMexican ships carrying humanitarian aid enter Havana Harbor  Reuters2 Mexican Navy ships laden with humanitarian aid dock in Cuba as US blockade sparks energy crisis  CityNews Halifax",
    "published date": "Thu, 12 Feb 2026 17:09:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQaXZoWWtaNVFLWDM1ek9sMEZ0RXZjalNXcS1Jc3JTVXpoOGMtVDRqRE4tcEpud29YcEQtNkRlWEZkN1FTWERKczRLMElmZ2xkYzR2NWdha2E3TGZZNDZ5SGx6ZHRQSzQ2NmR1ZVNWcW9pMGJmLXRsQm9RMWZaSlRjX0xRWjVkX2NNYXA4Y3k5eWdxMFNwREY0VlBhc1VNMGFubXJDaEJvR2JicERNYUI2cUF4S0tLc1RvN1JIa0FoYzRYX2lSTEFaYWhhbUd6VnF3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Trump’s border czar says immigration operation in Minnesota is ending - The Globe and Mail",
    "description": "Trump’s border czar says immigration operation in Minnesota is ending  The Globe and MailThe ‘You Can’t Fire Me—I Quit’ Presidency  The AtlanticTrump border czar says controversial Minneapolis immigration operation to end  CBCMinneapolis retreat could undercut Democrats’ message as shutdown looms  PoliticoVideo: Trump administration to end deportation surge in Minnesota, Homan says  The Globe and Mail",
    "published date": "Thu, 12 Feb 2026 14:29:54 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSmZTNFlzX1VXcUpmdFpzWE5tbWxmNzNmdzhFSlJJbzlUN2V5Y0dmNHFHYVNvanZkUjA3NnBUNm8xOHdqWnBEY2RGeXc4aU56NjdqY2ZfLUp2NlpEZWtNcTE4enJDdjZUSHZJOFJ0Rnd3cGpBdFViMHlxY2RacTgzNnF2aEZzR1lFb3ZmeA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Jimmy Kimmel on the US justice department’s handling of the Epstein files: ‘A brazen cover-up’ - The Guardian",
    "description": "Jimmy Kimmel on the US justice department’s handling of the Epstein files: ‘A brazen cover-up’  The GuardianHouse Democrats think Pam Bondi just helped them in the midterms  PoliticoPam Bondi’s Contempt for Congress  The New YorkerSpeaker Johnson says he disapproves of Justice Department logging lawmaker searches of Epstein files  Toronto StarVideo: U.S. Attorney-General Bondi accused of hiding names of Epstein associates  The Globe and Mail",
    "published date": "Thu, 12 Feb 2026 16:08:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNZ25vU3ltMnlWYWQyMnVJejZuY2RFUG94VWhIclJCWlFsUm9wTmFaMWFlN09nVTY0aGZXT0hiX3lSTmlQN055dmRzRFBmbG91N0F6eTFNMVd1TmxXbWlzMEdTQWxkdTNUYzMyTEdnR2o5MWRBU3N3YVBpd3JBejdXZmZMemhjYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Canada urges NATO to make Arctic Sentry initiative permanent - CBC",
    "description": "Canada urges NATO to make Arctic Sentry initiative permanent  CBCNATO deploys to Greenland to keep Trump onside  politico.euCanada wants NATO’s new Arctic Sentry security mission to become permanent, Anand says  The Globe and MailNATO launches Arctic Sentry military effort as it seeks to move on from Greenland dispute  CityNews HalifaxNATO launches Arctic Sentry mission to ease tension over Trump’s Greenland push  CTV News",
    "published date": "Thu, 12 Feb 2026 00:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPbGxpY2tpbFRuSnVmcTVqMFVkYTFNWnNwb1JRUlBEQjV3elZsZDNNanBMM2VZaE9ldEZyXzV4eTZicW9sTG5QdmJQbEF1aERWeFkyamphdVh5aVhIN3EwZkdMaXdSUm1fQkJZVFhFVkxDLUh2eTUtODZEZTNoTGtPQ2Y1VV84N0pKZHE4cQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Kelly and Slotkin accuse Trump of weaponizing justice system - Axios",
    "description": "Kelly and Slotkin accuse Trump of weaponizing justice system  AxiosHow Trump failed in his latest bid to weaponize justice  CNNTrump's revenge tour falls flat in the courts  AxiosEx-GOP staffer and Pirro aide tried, failed to indict Democrats over social media video  NBC NewsOpinion | The Trump Justice Department’s most abusive stunt yet  The Washington Post",
    "published date": "Wed, 11 Feb 2026 17:54:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOVmw3WmtjZFVIVkRwTXhOUzlRS2pBazJDYThsWFJvcFRNcmx1dDA1djQxZVpDbjBTZG1SYTBLb0xTbTVkdXFCSExRRG5jV2ZHVnBMcnMwdFdBQ2prWkJmTWJOa0luOHZRVWlocGJpX1pqQ3Y4Y3lzMlY5Y2REeXJzSUt2d0VJd0RzUGxfSTNfaTlGWWx6R183MUJGRnB6b3BhU1V2OGZGNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Congress plunges into \"no pressure\" government shutdown - Axios",
    "description": "Congress plunges into \"no pressure\" government shutdown  AxiosFebruary 12, 2026 — Trump administration news, Epstein files under scrutiny  CNNSenate Democrats block DHS funding over immigration tactics  The GuardianPartial government shutdown looms as Congress leaves town without a deal  The Washington PostDHS shutdown deadline looms. What it could mean for your flight.  USA Today",
    "published date": "Fri, 13 Feb 2026 01:44:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBFdTRZd3VlZ2RuRkFVak9DbEt3NzV2cGV5Z3NhazFINEJxR21kRXNIVjc0RVRJX0FyNzJKNFpMMmVaamZkdFVHT1R1VHVVN05mSHU4UUJzdk1KU2tPOXc5a1hfM2k1TVBKMXZvQVA2bi1rSnptQmNWVmJyRVA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.axios.com",
      "title": "Axios"
    }
  },
  {
    "title": "Trump says he 'insisted' to Netanyahu that US talks with Iran continue over nuclear programme - Euronews.com",
    "description": "Trump says he 'insisted' to Netanyahu that US talks with Iran continue over nuclear programme  Euronews.comIran’s Larijani accuses Israel of trying to sabotage US negotiations  Al JazeeraTrump to continue diplomatic efforts with Iran after meeting Netanyahu at White House  The Globe and MailUnpersuaded by Netanyahu, Trump insists on going ‘jaw-to-jaw’ with Iran and Hamas  The Times of IsraelTrump says he is still seeking Iran anti-nuclear deal after Netanyahu meeting  The Guardian",
    "published date": "Wed, 11 Feb 2026 20:21:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQeGhLWjRkMUxOWTB2cVY2V29Ncm1kSERvcm1YbjhKc0Y0YWpYSlhYZGRfMnB1VU5kQmdUX0JWLUhBOG5wdmdfNVZOdU9NRTcwNDFpdHFWOW5uN2dDZVVfNXVUTjliVzlzblNzWWZhdlRDRnlZLWNwaF81Y3k5RHc3OF9DTzJIQzRfWFB3dEoyX1UyRmc1N0UweHFZd3h5ZTUyVlpkX0hkZHZNUWJWbk8yZVZmUnRqSjBTNldVVEVEeEp0M0g3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Cuba is facing an economic and social catastrophe, and not entirely because of Donald Trump - The Conversation",
    "description": "Cuba is facing an economic and social catastrophe, and not entirely because of Donald Trump  The ConversationSend Canadian oil to Cuba  Policy AlternativesOpinion | Cuba is in crisis and it’s time for Canada to help  Toronto StarBeyond pressure: What is the Trump administration’s endgame in Cuba?  Al JazeeraOpinion | Cuba is collapsing. That’s an opportunity for Trump — and the island.  The Washington Post",
    "published date": "Thu, 12 Feb 2026 14:02:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOSVRLUDZ1eU5OQV92NzZsLXJLZGdGbjlJSjE4endZSzdjN2x4MlZMdmZjMGtTQ0FaMHVZNW9UcmhQeHVWSTVDYkJzOUhxMHR5X3JSTEk1ekF1bTZsNzU1VmtPRUJLMzJrNlRvM3VyRWVlb3ZNSVJNdnBzSVhwNVV5NFFNdXVUZjZJbVJrdXRnUlRNc3YyM01rbjFHQy1LQUhuSkdPbXI3N2N6WlJySVVYRWVpMmJBSDZ2aXNCVVBnTVZacWs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Ineos Grenadiers owner Jim Ratcliffe at centre of political storm after claiming 'UK has been colonised by immigrants' - Cyclingnews",
    "description": "Ineos Grenadiers owner Jim Ratcliffe at centre of political storm after claiming 'UK has been colonised by immigrants'  CyclingnewsFootball must reject Sir Jim Ratcliffe’s cynical, self-serving electioneering | Barney Ronay  The GuardianJim Ratcliffe sorry language 'offended some' after immigration comments  BBCBillionaire Manchester United co-owner sparks outrage by claiming UK ‘colonized by immigrants’  CNN'UK has been colonised by immigrants', says INEOS boss and Man Utd co-owner Sir Jim Ratcliffe  Sky News",
    "published date": "Thu, 12 Feb 2026 12:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxPT3c1ckREcFp2N3VFR0NyX2lvWDEtTlFVMlFJMU8zZXRKUko0QjFLNjNpZm4ycWdreVFmUWRzZ3RiMVkweEZSeThDYmRMblJTekVTX3Z0Y0hxNklaUVpuc2NMeENNSUxvQzg3MEIwZjh6M0VPOE5QMmxqWmlfbXBBbFRmbGNzdGxJUEQ4R1MyMEtPTnBMeFJxcElpQ2N3STBocEo0TFFvM3pqZm9fcnhkUUc3ek5tQUljX3hweGx0cm80QVI5dlFqZ1VFNldwaTdrMGhHWDZxTWJ5ZWxWZDFQV1ZuaXllMnNBV1RUWWxvYUxHR0tibjNyS21VQWtrMTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cyclingnews.com",
      "title": "Cyclingnews"
    }
  },
  {
    "title": "Politics - The Economist",
    "description": "Politics  The EconomistThe world’s most powerful woman  The EconomistJapan Stocks See World-Beating Start to 2026 on Takaichi Boost  Bloomberg.comShe’s one of the world’s most powerful conservative leaders – and she just won again  CNNJapan election: Can Sanae Takaichi fix the economy?  BBC",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9EUmpOQk9uNjJlaDRLMk9IblJ5c3Rwb0trY01EdDNkVVR5cUpmcHRFQXY1RWExeVBzSDI4MW9CMHVsa0daSGF0UGxtNzhEeHhiczZ6WThubTVmd0pJWXdSUThSWHc2WDhmVFhFcXdfQS1obW8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "US Energy Secretary Chris Wright touts oil production on Venezuela visit - Al Jazeera",
    "description": "US Energy Secretary Chris Wright touts oil production on Venezuela visit  Al JazeeraAs U.S. companies return to Venezuela's oilfields — one Canadian driller has a head start  Financial PostUS energy secretary and Venezuela’s acting president tour oil facility in warming ties just weeks after Maduro ouster  CNNTrump administration moves closer to opening Venezuela to more US oil producers  PoliticoBloomberg Businessweek Daily: Job Growth Jumps  Bloomberg.com",
    "published date": "Thu, 12 Feb 2026 01:56:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPanlZNW1OODFCZWRrS1pQeTBseVlFTDEtUWpRX0I0bS1lTGtERktDTXNleC1jcVM4NEhMNGxfNThlQVNXb1ZxRF9FYXljTWxlNWZMTF8xV1RnWDRJS0U2ejBkVDlWSnFRVHZ2QU9tVDBsMW5IYXAzTllyVTFQSzFRQnRGUG9zZkNEX0p6WlZSSzRzSm1CMVVMb09ybTR6OU03cldrX2RJX0N5cUpYOEVUYmxrTdIBuAFBVV95cUxPNlhPRWxiU0szMDlreFB6emJNdVJHaHdSQl8zZmFwMVA3ZzJMaV9uT0FqNWRHYXYzX3poRVd3RVNKblI2cUlYVTA0Sy1HaFc3VUYwdzZzTWxtb3p3VU1vdEliNjFPUGJfUDNqY3VRTjBHVldiRGtJYXVPckJPNlFhS1huZXdlQ2p1WXhtRXhkRW1fdlQ5ZzJBLWdiMExSVGJxYU8xR0E5LWotbE9feXJtRm1nS2hWVDJK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Trump case against BBC to go to trial in February 2027 - BBC",
    "description": "Trump case against BBC to go to trial in February 2027  BBCTrump’s defamation lawsuit against the BBC is set to go to trial in 2027, US judge says  Toronto StarThe BBC has no choice but to teach Trump a lesson about free speech  The IndependentU.S. judge rejects BBC's stay application in Trump defamation case  ReutersJudge rejects BBC bid to delay discovery in Trump lawsuit  The Hill",
    "published date": "Thu, 12 Feb 2026 14:51:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5XX0swLTBDOVRsa2FWU0VjdWhOaDc1b1NnUzZ3bXhBN1RjUlBwMDY3RmNDNFMzUG5zbXNGSURfcHBZbnpoaURXbzNqTFpoSEtWaVZSVlo5czViZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Leaders embrace two-speed Europe to break impasse as Macron sets June deadline for economic reset - Euronews.com",
    "description": "Leaders embrace two-speed Europe to break impasse as Macron sets June deadline for economic reset  Euronews.comEU leaders ready countermeasures to pressure from Russia, China and Trump  Toronto StarCosta Urges Action on EU’s Competitiveness Woes  Bloomberg.comAfter years of resistance, leaders finally say EU should go at different speeds  politico.euEU leaders meet to counter pressure from Russia, China and Trump  CityNews Halifax",
    "published date": "Thu, 12 Feb 2026 21:12:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNMU5RZVNhYWQ3REFQVFVLd3RTcEIyT21BUHBhRFNJMjY2RXBNMGI4R20tOVh2c3Qta2FvbExheGFpTFFpNTBoWlVpdTlOVzdkc2pOdUpVekpWZGZJMEZ3Tjljbl93WFMwQnRacDJLSHRvd0FycUJrQTc5Z2VnWGk5c25PWnBqTFJ0WTVfUlZWRzNjOTl2SlEyZVh3RnhOelZtQmN1c0JjNkV4SjlvSi1mWHNjekg2MldxS2s0OEdZb24xUVFRQnNhYVZ0aG1HSEx4Rmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Three Canadian Prime Ministers Flew Privately to China with Toronto Businessman Flagged in Washington “United Front” Study - The Bureau | Sam Cooper",
    "description": "Three Canadian Prime Ministers Flew Privately to China with Toronto Businessman Flagged in Washington “United Front” Study  The Bureau | Sam CooperTerry Glavin: China's ever-deepening infiltration of Canada  Yahoo News Canada",
    "published date": "Wed, 11 Feb 2026 15:21:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE56Ylg2a1lyTE90Y05GUUhOcUc0cVIxTXk0ZV9ka3c1cWtUd21qOXAyMnFwdEN4cXhEU1hKR1NTcmtJUlZ2RzJZVHFOZDFPTkNwX2J0bGtVT09XaEpXNm9nQ3A2Mjd6V3RKT3V4OTl3a0lXQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebureau.news",
      "title": "The Bureau | Sam Cooper"
    }
  },
  {
    "title": "Switzerland to vote on proposal to cap population at 10 million by 2050 - Euronews.com",
    "description": "Switzerland to vote on proposal to cap population at 10 million by 2050  Euronews.comView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 15:58:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOR0NmUHoxODdURVhYSXl4Tk5qUDlXS2pzRHpxa1Vtb3VKbXVWZGhKRXAxUVdDT0VrcGY4bGRodlowczI4cW4tS1dQdi1STjZITUpGV0ZmMFVpR09JSEZiMGhGN0xQeWtSWGFyR3lRLUNrbmhkQjl2YzlGQW9hd0tSNFNuMUlpRU52NS1ud1VRV1JTMDNpdzRwOTNrZXNqSUdVT0pWSWEyWXhMTGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "La Niña weakening, El Niño possible later this year - The Weather Network",
    "description": "La Niña weakening, El Niño possible later this year  The Weather NetworkShift from La Niña to a neutral pattern as spring approaches  Yahoo News CanadaLa Niña is nearly done steering winter weather. What now?  USA TodayWeather-Roiling La Niña Is Likely to Fade by April, US Says  Bloomberg.comSpring 2026 Forecast: Why the Rapid Shift to El Niño is Reshaping the United States and Canada Outlook  Severe Weather Europe",
    "published date": "Fri, 13 Feb 2026 00:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNejdMY1BWSGFPMXdMOVdSNXpmLXQ2dlZQNHZrRV9ZM0xLZTBKbjBkeWtYazVvdEFnSUNCbVVSRFVOZXktZ2VFc3V2cmo3VzZBajNyZWtSM2pSMGE5dkhUTVRjTDgxZFRSMHlGOG04bU40Q2x5ZU9YeWFfTWJuQnowd1J5d0tHX09fZmRYQkUzSlFPR3otb1VKel96R2hGYnVYcVFEWjNjUzFQWnZraEtHX3dxbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "Europe’s Leaders Gather At Munich Summit, Reeling From Trump’s Criticism - The New York Times",
    "description": "Europe’s Leaders Gather At Munich Summit, Reeling From Trump’s Criticism  The New York TimesTrump’s wrecking ball menaces European leaders as they gather in Munich  CNNOpinion | Sen. Mitch McConnell on What the West Must Do Now  PoliticoAn era of 'wrecking ball' politics: What the Munich Security Report says about Canada's moment of reckoning  CBCTrump's world order hangs over Europe on eve of key defence conference  BBC",
    "published date": "Thu, 12 Feb 2026 22:38:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQZWlrSGlEdGdKczRZclI0VXBiN2NKU05nWmpDQTNkLUdzMFhZNmxrTDVGT1Zwd1Yta3JZTHlBTElOQzZhTkNWNG81SDFUdFpOU3p1WXZtZWltWjlFM2hKYVpOaWxHU1BkR1RmRW5rSkVHTk5lOFp1NWd2MXRsUkhuUDI1SEcxeWlwVElXUk85NHdEUm14c2FDR2poSmdTZFhyZmkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nytimes.com",
      "title": "The New York Times"
    }
  },
  {
    "title": "Costs from Trump's tariffs paid almost entirely by US consumers, NY Fed says - BBC",
    "description": "Costs from Trump's tariffs paid almost entirely by US consumers, NY Fed says  BBCWho Is Paying for the 2025 U.S. Tariffs?  Liberty Street EconomicsA year in, it’s official: Americans, not foreigners, are paying for Trump’s tariffs  CNNUS businesses and consumers pay 90% of tariff costs, New York Fed says  Financial TimesAmericans Are Paying the Bill for Tariffs, Despite Trump’s Claims  The New York Times",
    "published date": "Fri, 13 Feb 2026 01:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFB6WnR1Mi1xLWo1Qy0wa3kyX0JZejk0TnFybjR3bWVfbXpSNzZnNnZZbTRiT3Jwc3BGblVWaFUtOXQ2cGpaT1NjRlJhRGQ3ZE1XS1hkWXdpcUk3dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Police in France detain 9 people in suspected massive Louvre ticket fraud scheme - Castanet",
    "description": "Police in France detain 9 people in suspected massive Louvre ticket fraud scheme  CastanetView Full Coverage on Google News",
    "published date": "Fri, 13 Feb 2026 00:42:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPelljU1d1QWV0bnRyNk1KZW5GcGRYRHU1bVQ4UnJLRXdGVGtMSFFPNjhtTnRETDM4ZHpzWVdqM1lmdkJNQUxoSm1heFJJZC1udVUweVl4V1AzUTJjM203LTVOa0dqdG5CYXdKeGxRX3hCYmZqWEl4RUFWYmJJazRPWm1tVkprMU85bGlaMGVIWm9zLUZZVy1xb201RWZuaWY4NW5JeWhYNkc2VDBPZm9qZEJjWGtTQWRPVFpBVlNuZDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Poll: Top NATO allies don’t think US helps deter enemies anymore - Politico",
    "description": "Poll: Top NATO allies don’t think US helps deter enemies anymore  PoliticoDonald Trump prompts global surge in people viewing US as a threat  Financial TimesEurope's growing mistrust of the United States  Le Monde.frDonald Trump Drives Staggering Spike in People Viewing the U.S. as a Threat, in Canada and Europe  The Daily Beast",
    "published date": "Thu, 12 Feb 2026 03:40:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5mbEM3QTNQb3FHaEVtT19iVDc4LVd0WS1hRnp0X2pkX0toUzFac0JQdUhpN1R2S00yeVZaa3h3UVJ5dTkyNFA4Zi13emQ1TXNmY0huYnctNHRnd3dPWWMwTjRuWHNuMnlKOGNiSVdVdWFqYU1ORzd1OTFFNWM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.com",
      "title": "Politico"
    }
  },
  {
    "title": "First Thing: Congress members name six wealthy men ‘likely incriminated’ in Epstein files - The Guardian",
    "description": "First Thing: Congress members name six wealthy men ‘likely incriminated’ in Epstein files  The GuardianWho are the six men named in the unredacted Epstein files?  The GuardianRep. Nancy Mace says she wants Americans to know the truth about the Epstein files : Trump's Terms  NPRTrump is in the unredacted Epstein files \"more than a million times,\" Raskin alleges  AxiosJustice Department releases names of 3 people the FBI once called Jeffrey Epstein 'co-conspirators'  NBC News",
    "published date": "Wed, 11 Feb 2026 12:16:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObkpSVktlUHFRb1pqcFpYMmNKUHNMRG5xRkdQanBOQUdxdU52YWVjLTh4ZkdBanU4Q2dub0xrOTdtM3ozYVFxeTliTlltR1V3aVcwYmszWXJXczNTeVlwNW5mOS1CZEQxclViN3RfMEJ1Z2M3Z3NuTVN5Wi1DS3Q1RUN4ZFVONFJzUmh1ZWQyb2EzdUt5R21DRWV6MXdvZVVtZk5ZbEVEaFZuWURrZjlleVpNeHNXUHZ0VEZKczRsTThSd2ljLTZWXw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "'NATO 3.0': US & Europe appear to agree rebalancing of power is needed - Euronews.com",
    "description": "'NATO 3.0': US & Europe appear to agree rebalancing of power is needed  Euronews.comPentagon policy chief tells European Nato members to step up combat capabilities  The GuardianUS urges Europe to take the lead on defence in NATO  Al JazeeraNATO allies say Hegseth \"missing a good party\" as they meet, adjust to slimmed down U.S. role under Trump  CBS NewsUS allies at NATO focus on Europe as the Trump administration steps back  Toronto Star",
    "published date": "Thu, 12 Feb 2026 16:35:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQbUlyczJFVHptbDBPOWsyTWFVbWc0S3ViNGU5QVRoSEIyaC1PME5mMmpzTGpyaEpqcXZvWTlzb09tdnpadDUyRTdXdm9YZ0FNcHFrQTBVY05nR2JWeDJyalIza2thM0t3THdYRG5uemdOVkg3T2VKcEt0LWVMd0JqdEo1V3JRV2xzeU11S21NWVlEVXRBXzFiU2h2cFZMd3VnUkdJM1pya0YydjdQSjNEREFLWGs?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "RFK’s idea of making America healthy starts with making it politically sicker - The Economist",
    "description": "RFK’s idea of making America healthy starts with making it politically sicker  The EconomistRFK Jr. pledged more transparency. Here’s what the public doesn’t know anymore  Toronto StarRFK Jr. promised to restore trust in US health agencies. A year later, it’s eroding  AP NewsRFK Jr. promised to restore trust in US health agencies. One year later, it’s eroding  Richmond News",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNdzZRNWNrbTMtSkpLb2RTRGx4YXFuYkRlOUtSb0FhWW5XZlNGanRRN1E4QnVlbTUtUU91SjBqM3pybWl2dkpFdUJKSm9vY2MtNWRObjctdVB1R2g0djE4UTFDcEVsNUNTY2MwNEJBaS1zMmpVeXBFczVjZUFGVXBiM3hNclpEUDBEaXVvNllJUkRieGxHUDJmV2QxQ1FCTWZZS3NSRXZScXNtMVMzWGM5d0FUQW9CSnNRU3lzdVl6SlV4Q2ZMd0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Republicans, Democrats want to hear from government about anti-drone laser that closed El Paso airport - CBC",
    "description": "Republicans, Democrats want to hear from government about anti-drone laser that closed El Paso airport  CBCDo Drug Cartels Actually Use Drones at the Border?  The New York TimesEl Paso airspace closure ordered after drone test shot down balloon - US media  BBC‘It’s astounding': NTSB chair chides FAA, Pentagon after El Paso chaos  PoliticoPentagon reportedly gave Customs and Border Protection laser weapon that triggered El Paso airspace shutdown – as it happened  The Guardian",
    "published date": "Thu, 12 Feb 2026 17:57:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBsWTRpQTFpcjE4NmRLc2ZydU54dFRzbjcxc283WTI3TWFNMmh1U2ZuYWZCX2dTdUdQalVsazItQmdtcGwxV29ubHl6RVprQUl0VUZ5SXRyY2hlakJTSEQ2QVhuTHBYRFh5bEFBY3VRajY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Norwegian police search former PM Jagland’s properties over Epstein ties - Al Jazeera",
    "description": "Norwegian police search former PM Jagland’s properties over Epstein ties  Al JazeeraNorway's former PM charged with gross corruption over Epstein links  BBCEx-Prime Minister of Norway Charged With Corruption Linked to Epstein  The New York TimesThe Epstein files are sullying Norway’s squeaky-clean image  The EconomistThe Jeffrey Epstein files have shattered Norway’s illusions about itself  The Guardian",
    "published date": "Thu, 12 Feb 2026 20:25:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOYnpRZ0YzRzVRc3o2dE85c2R0V200ZWkyRERxQjZEVDlGZ3pCN0FJak1HN2xZVE1ZcTM4WUJPWVZ3MjN4endmM05RQk5tbnVXY0Jxd2Z4NGdDZUd4dkxMS0ZpYmZLbUloSjAwaVFtN0NlUGpZMVlRZHE0Ni1lZ05kZlJOV3djNDgwX2lOcnlvM3lkTlM5U1RoUS01XzhhRU50MTZncDBwR1BwMTVSdjllLXdB0gG3AUFVX3lxTE9qYVBLZ0hHSHFMRS1lUXRiR05WX05acEdodnlYTlZ2UVRJOVFBQ1VtU0szTG9GM0xGZEdFM0pkcGt6Smg3OS1fLVlMd1hmUjJDbzU4eGZPSmNTUEt5QWhWNVdYcGNkdHBSbmE3VVN3SF9lM1V0LWJLWGUxczBvYmFGdGVuazRoSWVRb1J2Y0xGamJlYUlKRkhPemhGYWhhYjZGZzViRUtpSTR5b2Fwd1FiekctWnNpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "The campaign to bring back the Shah of Iran - Financial Times",
    "description": "The campaign to bring back the Shah of Iran  Financial TimesIran's exiled opposition fractures amid climate of fear online  RFI",
    "published date": "Fri, 13 Feb 2026 05:00:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFA4QkNDOVhUb3RmVnpQc2R5S25GZjU0WllaSngtN3pWVl9naVlsckFKR0IwYjdTZ2x3QnlFekE4TmVaV3RhV2xPeXlDN0lpRVpoR2Z0Z0dfNWZvdDd0ZG1LQ0piaV9TN2F4d2diSnRZOS0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ft.com",
      "title": "Financial Times"
    }
  },
  {
    "title": "'We warned nursery about abuser Vincent Chan - they dismissed us,' parents tell BBC - BBC",
    "description": "'We warned nursery about abuser Vincent Chan - they dismissed us,' parents tell BBC  BBC‘Utterly wicked, perverse and depraved’: U.K. nursery worker jailed for sexually assaulting children  CTV NewsNursery worker in London sentenced to 18 years for abusing young children in his care  Toronto StarNursery paedophile used work iPad to record abuse of toddlers, court told  Yahoo News CanadaNursery paedophile Vincent Chan has left us in constant fear for our child, say parents  The Guardian",
    "published date": "Thu, 12 Feb 2026 23:27:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9Hc2gtRElPT0FNT2xuY3llUHhaZVMyR0N6cnNqeDE5UV9TU3NZUVNMR2RKTFJYdll4RjZvdlBJRHRwcEdPRmJDNHZwVEIzbUVfYWpBblIwSjVPZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iranians mark 47th Islamic revolution anniversary with nationwide rallies - Al Jazeera",
    "description": "Iranians mark 47th Islamic revolution anniversary with nationwide rallies  Al JazeeraLyse Doucet: In Tehran, rallies for Iran's revolution overshadowed by discontent and defiance  BBCIran marks 47th anniversary of Islamic revolution  The Globe and MailIran’s leaders rail against US, ‘sedition’ in 1979 revolution celebrations  Al JazeeraUN Chief Urged to Disinvite Iran's FM from Human Rights Council, and Publish Contents of Congratulatory Letter to Regime  UN Watch",
    "published date": "Wed, 11 Feb 2026 10:51:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPQjR5SUh3U3hsaE1vRmF5cUlqSnZ5WllxSl9iSU01RVZ4bTMzdktEM2NUem9Qb1ZvWjNtdGh0MmFOLW1BUmhPcUlHUnpDUHlPZWxtX1ZJNUdPbEg3N3I4b3ZPWlhNUkVRcFpUR21lVmdWd0t5cVFRZzBVT1VFSmRzdDh1T2poa2tmNzBoX1N1VWRIdjA3cndPNjc3VnZBNlRCcDE0TmMtTHBsVXZOU0hRb1hWTFRMQXMy0gG-AUFVX3lxTE5xd1QySlI5Y0ZtOUEzanEyY2ZMNlQ2UHdtMURYY05Vd2VlV3BkQTVfTk12VzFZdHdaM0Y5OTcwTl9Xb3FVS25pYTlCencwU1d0elNCdjlHbmI4eERMMmZDQm9Qa05lRGNLbmpUd3R0RWlRMEx3SmhKX2tNR2JKakFEQ05naXdKQnd3eWJ6bFVlaGRJU0loeEpuODk0TWF3WmZpODJtUWE2NVhWWGFoNTRIYU9Wc2UxQVVWdXh1X0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Denmark Has a Clear Message for U.S. Travelers Amid Tensions Over Greenland - AFAR",
    "description": "Denmark Has a Clear Message for U.S. Travelers Amid Tensions Over Greenland  AFARSome Greenlandic Inuit say work on independence from Denmark will come amidst fight against U.S. threats  CBCU.S. threats revive independence debate for Inuit in Greenland  Global News‘We are not out of the crisis,’ Danish FM says as Anand visits Greenland  CTV NewsHow might U.S. threats to Greenland change the territory's path to independence?  Yahoo News Canada",
    "published date": "Thu, 12 Feb 2026 22:13:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOYjhsUFdIQnVpSUUwM0c2UTlTNFNSSjJ4dXRZVnluWFM4dnFCRkZ1dmtLaWpyU3JEX1FtQkdadjdwTkpiNWw5VUhzVGNpYU1Cai1mSE9qVHl2My1UVUNPNzNLTlMxTWY4WTVTYWY0XzlvZHZNaVdqRS1nZVJEcXo4eG5GOTduT2paRnlZZ19pV1htZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.afar.com",
      "title": "AFAR"
    }
  },
  {
    "title": "France, Germany signal unity at EU's Belgium castle retreat - dw.com",
    "description": "France, Germany signal unity at EU's Belgium castle retreat  dw.comMacron on Collision Course With Germany Over ‘Buy European’  Bloomberg.comFrance, Italy compete for Germany’s favour at economic survival summit  EuractivFrance set to clash with Germany and Italy as EU leaders seek economic boost  Yahoo News CanadaGerman Chancellor Merz rejects joint European debt issuance By Investing.com  Investing.com Canada",
    "published date": "Thu, 12 Feb 2026 18:59:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNSGVKamIzcXpMSUk1aUg0WkN3UG9fZXNKRDctU3VDTnJ2eWszQmJwMl9Jd25QQmMwMWM1Wm4wNjNPTnp6X3d6ZDlLMFFIMnB1UVNvTmozRnVCb2pyVjVHT2VLY1NiWERDQ3pUV1pTVDEzQUVpXzNMckxzemRKaHBVempJZWw4LWg1bDFibEN0NURsZGRD0gGUAUFVX3lxTE9YeW5vSzR0bXNXUkwyTDNoYllUWm9HaUlrbC1ubVNVX0pCemJzZGR2R2t4TlZwQWJlX3o2emRvemlBNHNQZWtiZjRDaDRlcHd1MkVQTmFDZURhMjZUWDcwc3dxdEV6UVlzNnV0TTVaMlZ5WGdocUlzUU85eEtGRVE5MkZXTkxwZVpELTFWUHVzazRCR2o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "Break in the grey as Aberdeen sees sunshine for the first time in 21 days - The Guardian",
    "description": "Break in the grey as Aberdeen sees sunshine for the first time in 21 days  The GuardianAberdeen finally sees sunshine for first time since 21 January  BBC",
    "published date": "Thu, 12 Feb 2026 23:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOYnBwaTZkbUVpdVNiQmFlbXdaeHJOVWNvTm5hdUM4V3lpSjV0RTMwc0JXYlUxdGNxYTJXZXJGejFxbzdGMUpENDVrS0dtV3dKVDlRYVhEcXdmRTV6VUpnNURmQ3hBdW5vTjg2VW91TnV1X1QyVGlManNiVzFZX29TOHlaVC1LRHB5SWdadXF6MmR0YV9xN3k0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump Drives Staggering Spike in People Viewing the U.S. as a Threat - Yahoo! Canada",
    "description": "Trump Drives Staggering Spike in People Viewing the U.S. as a Threat  Yahoo! CanadaView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 12:58:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPN0ViaWtoMWFPQkFqM1pTRXlKY09md000QUlvY0E5VmxNWXV1REFMb1NCSzJjYmxEc040WW4wNlZySkRLMFA4WkRYbi1kb0xIeXZtaFJKaVNMZHZYTGlWdmZhRXdYdUR6VTJpUmtlSFoya2Vma3Y0YmtxeHBROUwwc3dqVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.yahoo.com",
      "title": "Yahoo! Canada"
    }
  },
  {
    "title": "Russia says it has blocked WhatsApp amid wider clampdown on social media - CNN",
    "description": "Russia says it has blocked WhatsApp amid wider clampdown on social media  CNNRussia orders block on WhatsApp in messaging app crackdown  BBCRussian Offensive Campaign Assessment, February 12, 2026  Institute for the Study of WarRussia attempted to ‘fully block’ WhatsApp, Meta-owned company says  The GuardianRussia is restricting access to Telegram, one of its most popular social media apps. Here’s what we know  CTV News",
    "published date": "Thu, 12 Feb 2026 13:13:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQV0JSWUpBSVNQaGpsMmsyczB1MlIzS291ZmpwZXFPWGd1aFo3TGktNGVwT0VSaEJOZ3BMbzQ5anBwaEZhQXh4X2FIOGk0cERjdl8zUmx0R2RmbHFKNFdlVXB2MXFLQ3ZUdlhDVFFhYkZBLWZaS0hBSkl4Z1J0a0k5aXFZdmlVdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "What China is really up to in the Arctic - The Economist",
    "description": "What China is really up to in the Arctic  The EconomistView Full Coverage on Google News",
    "published date": "Thu, 12 Feb 2026 13:50:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOVG1iOWp3SFBCdGFGOGxSdjlEeC14OTJ6S3pQbHVlNlo0QjI1RU9nVG9qUVFwQkQ2TGUweXBua28wMlhKc1dfRlZncVNfQVlfVWxOcWh2cFM4OU1kQWN6Z21lUE1IWWwwOUg0TlpvUVpZWGdJUkdkZTBIbWZ1enlCc0I2bmpzNm9CZHAw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "China's Xi makes rare public reference to recent military purges - Reuters",
    "description": "China's Xi makes rare public reference to recent military purges  ReutersView Full Coverage on Google News",
    "published date": "Wed, 11 Feb 2026 09:45:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPa1hQWk9LbW5WaC1kaHM1SzAxNFA4LTVaVGFLMVhXdjZwLUFaWFRmM1dpSEJlWTBiVkliWlVLMjlaekdNYWxscE1tckxjNXppa1BuNlpCb2l1ckFoVFk2MzNVOFdPQXk3VVpvZjFicVpaR0RMb3pybUpBcmFIWURMVFh1NUJaQ2YxeHNzZU9EbFNZc1AxWUs2Mjh1a1pqZjFfVkdwQldfSnNra1hG?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Atlantic salmon numbers in north west rivers 'exceptionally low' - BBC",
    "description": "Atlantic salmon numbers in north west rivers 'exceptionally low'  BBCSalmon numbers in some premier angling rivers 'exceptionally low'  Yahoo News Canada",
    "published date": "Thu, 12 Feb 2026 09:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1TYTJtdDgwYVlxclVGQXFPdS1IZTBCYUJxalVuREFrQVgxWHY0enZWR1J1YXJXYTUyaWNUdGk0ckFoRmN0YnotU0xtVHZxZUJjbHljbWRnRWxPdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran warns war will be cause of global fallout, signals doubt over US talks - Ynetnews",
    "description": "Iran warns war will be cause of global fallout, signals doubt over US talks  YnetnewsIran’s president denies it seeks nuclear weapon and admits ‘shame’ after mass protests  The GuardianIran will not give in to ‘excessive’ US demands in resumed talks, president says  France 24Iran says nuclear talks gauged 'seriousness' of U.S.  NBC NewsIranian foreign minister warns of attacks on US bases if Washington strikes  The Hill",
    "published date": "Wed, 11 Feb 2026 11:39:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE9UTEFQYkRVUjhyOXBXem04TXZleFdlOHlRb1hzM2JnT19LYk5zN0p6WjRNY2x6RGhVcFFGSE1ZOFk0Z3V4cWRXVjZfdTVzY29FMlNRSU5JNA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "Putin ‘trying to break the Ukrainian people – they will not be broken,’ says Nato’s Rutte - Europe live - The Guardian",
    "description": "Putin ‘trying to break the Ukrainian people – they will not be broken,’ says Nato’s Rutte - Europe live  The GuardianU.S. allies at NATO focus on Europe as the Trump administration steps back  CTV NewsFractures in NATO exposed amid Ukraine and Greenland talks  France 24Official Photo of the NATO Ministers of Defence  nato.intNATO Secretary General hails “shift in mindset” in Allied deterrence and defence  nato.int",
    "published date": "Wed, 11 Feb 2026 08:51:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPY09iTEFhQTVrSVZUb2o0cUROcS1mSmVJcENvNHQ0ZUJvWVVvZjZhem9kV0xTa2RZVHo5QW1yVGtTRENFd3Y4WDdzZGlpd1VWM2U0eDNDbmRjdDJkbnJPai1ESlg0WW1XX2E2bUJlT25vUThiWDBoZ2dlR3h6R2VrenRTMGZZS3BleV9aaS02NV9aaDVMbTg3bHhIc0xLUDV1REE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  }
]