[
  {
    "title": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says - The Globe and Mail",
    "description": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailU.S. proposes critical minerals trade bloc aimed at countering China’s grip  CNBCAnand in D.C. as Trump administration makes the case for critical mineral trade zone  CTV NewsAnand visits D.C. as Trump administration makes case for critical minerals trade zone  Toronto StarCanada pumps the brakes as allies join U.S. minerals bloc  CBC",
    "published date": "Thu, 05 Feb 2026 02:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcDJaN1A4UFF3VHJ2QjJJeE4zTVMtSUNadFBqTHVvZmxLdGRUZTIyVjBZWmhpWlNpMkJxUzRIX1otMHJvTVRiYXdYWVUtVDJHWEQ1Y1RDOWtGRTh6SmtVdk9yMjh3UW5pb1ZqZTBJSmhmb3k3aXdjRUZEQ00xZi1FelhBOGx1dC1YQkJxTi03NmI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "'We are ready to listen': Savannah Guthrie posts emotional plea to her missing mother's kidnapper - CBC",
    "description": "'We are ready to listen': Savannah Guthrie posts emotional plea to her missing mother's kidnapper  CBCSavannah Guthrie releases video appealing for proof her missing mother is alive  The GuardianAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZSavannah Guthrie’s mom 'taken,' sheriff says; blood drops are found and ransom questions raised  Los Angeles TimesSheriff says ransom note being investigated in disappearance of Nancy Guthrie, Savannah Guthrie's mother  CBS News",
    "published date": "Thu, 05 Feb 2026 02:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPc3FOUlZYRmZXbFRzT29ielRYeVZ4R0lPQUZnem81dmRuNFhWR29WX1IydUxXRm5pSlJIYk9XTEFFeVhENWxOZzFGQTZOakdYdlJOSmdMZW5EZHkyYkdkX2JRaV9PRzVHbFRTREZvWUVNMzk4b3hTbkpsQ1FjX2QxZ0Zudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "700 ICE officers will leave Minnesota immediately, border czar says - Global News",
    "description": "700 ICE officers will leave Minnesota immediately, border czar says  Global NewsTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBCTrump news at a glance: president hints at ‘softer touch’ on immigration as federal drawdown planned in Minnesota  The GuardianTrump administration to withdraw 700 immigration agents from Minnesota  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 15:54:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54aXpHTFJoNWhCT09waGl2dzZtc2RsUUtkT0gxTWxBUHV4eldjZVN0VlN5cWx6SHNTVFlQcXBBRm5yTTlRcXlYOEd2QTlrTTE0cUhzd09hSUM3MnhyZnh1OVRvOXJPNGIwcjJ4aWdsQlRmNGJYa0hfNVFZUnI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Iran's president says it is ready to negotiate with the US - BBC",
    "description": "Iran's president says it is ready to negotiate with the US  BBCLIVE: After barrage of threats, US and Iran set to hold talks on Friday  Al JazeeraU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosIran and U.S. agree to hold nuclear talks Friday in Oman as Trump delivers blunt warning to Khamenei  CTV NewsIran’s President seeks ‘fair and equitable negotiations’ with the U.S.  The Globe and Mail",
    "published date": "Tue, 03 Feb 2026 17:05:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5RRms4V2pkN0hjcmU3RmF3aTZWT0s0ZjNhS2k5ck1TNjE0NkxoN3BvR0ZLLWlqSmlPOWRvS21BRWtxdTFSR2U5Tm9jcXNENXJCUDJ0Z1piRnhBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US must be prudent when supplying arms to Taiwan, Xi tells Trump - BBC",
    "description": "US must be prudent when supplying arms to Taiwan, Xi tells Trump  BBCChina's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade  CNBCTrump hails ‘excellent’ phone call with China’s Xi amid trade tensions  Al JazeeraTrump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relations  ReutersChina’s Xi Presses Trump on Taiwan in Phone Call  The New York Times",
    "published date": "Thu, 05 Feb 2026 01:15:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9BQi1FVkc2RXQ2UDNZcDcxc1U5bjU3US1fcDhMSE9vdG1TUFQwRXNKc09qUjhoaWh3azY1T25nWjZzTS15ZkIxWTZLZW5xMnlyQ1ZaSWVFdGhkUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - Castanet",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  CastanetOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesDHS Panics After ICE Barbie’s Fourth Amendment Assault Flamed  YahooNew ICE memo gives deportation officers more leeway to conduct warrantless arrests  CBS NewsLawsuit challenges ICE ability to enter homes without warrants from US judges  Reuters",
    "published date": "Thu, 05 Feb 2026 04:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOaVJsb2RzeFVFNjUtZ3R0Ri0zV0ZicWY5b25sN2o4MVA3a2tSVGk4Q2ZVVC12M0VSa01OZko5d1J2ejBQcnB6YkdaTE1qTktvTXBvWTIwWGpFTEVWNFpDczVCUFl5aV9FQjZrQWFyWHFjSzVvU1NPQ3hfcGNRbTBEMWcxNVpPZ3VjSVlKc2dXVzFzNHc3eVBPZzd1Y0tlaGgtNVhsY0VQMjFyZzVuS01HekdNUjdoMGpPNGV1U3lkVGZwck96aTQ5T2lrMkFHS3gzenFkZUJ0LTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children - CBC",
    "description": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCA look at the violence flaring in Gaza months into an Israel-Hamas ceasefire  CityNews HalifaxIsrael strikes Gaza, killing 19 including women and children, after saying Hamas violated deal  CTV NewsIsraeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier  BayToday.caVideo: Israel strikes on Gaza kill at least 24  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 18:35:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdl9FdVNVdVhzdzBSTTVGYXR1XzBTMU10RDBUVjZPUElUQnlIaVZ3UGozaVRYcEZGdVBoMmdja2p2eEhFWEhCQzZXOHhLeFU1eEVsb3lIaGtvODR1Y3dYZFE3d2NtcWNoWHhuLXFQZ3BEaDJKbkx3aVJqQ1RSU3hQcXRQVTI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "‘Grave moment’: end of US-Russia nuclear pact comes at worst possible time, UN chief warns - The Guardian",
    "description": "‘Grave moment’: end of US-Russia nuclear pact comes at worst possible time, UN chief warns  The GuardianFears of nuclear arms race rise as US-Russia treaty expires  CNNLast Russia-US treaty on nuclear arms control set to expire  Al JazeeraNew Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race  BBCUS and Russia Enter Uncertain Era as Key Nuclear Pact Expires  Bloomberg.com",
    "published date": "Thu, 05 Feb 2026 02:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQZWpRLWRBYlJWb2tZVU5DWHlTYWJmVnk1Z2Z6dWtIaGpXWE5DX3FycnozTVZoTWRYVVdLVm8tdzZmT1VIVVJZMkdLVm1LU3dxeXY4eVdFd1Fydkh2UnNWbE1zalFPQUc0MF9lUnpRMS10eGZHMF9qQlFXRFRuZU44Z056OHpQdERZV2NNR2VsZWdXdXljbHhGR1VpNk5DLTBu?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Penny, the Doberman pinscher with a Canadian connection, wins the 150th Westminster dog show - CTV News",
    "description": "Penny, the Doberman pinscher with a Canadian connection, wins the 150th Westminster dog show  CTV NewsGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCOwners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBCThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The Guardian",
    "published date": "Wed, 04 Feb 2026 11:51:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQRjJ1Z0hKYS1jdHVDXzREMk5adW1MSV9STmYtUzJnNXFoYkxSMW9pTl9oUUpCYmdFSTNXODdwaDlzUnpTVTh4am5nVDZfX0pDSXNOa2Y5UWtxdVg4OHFKbmR3LXBkWG11M25HUi0wTHZkWnY4RDU2cWNLSVVEYldrTjBVZHVzMWJMVm5RU2k5dVhXNE1kMFpBYTJ6em9WbXFibXFiTUJQeENOTWYtc2k0a2lsVFhuWjNYSFNLd0tBaWdYb00tdEZWVjUtNkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Washington Post to lay off a third of staff in newsroom and other departments - CBC",
    "description": "Washington Post to lay off a third of staff in newsroom and other departments  CBC‘It’s an absolute bloodbath’: Washington Post lays off hundreds of workers  The GuardianThe Murder of The Washington Post  The AtlanticJeff Bezos-owned Washington Post conducts widespread layoffs, gutting a third of its staff  CNNWashington Post Cuts More Than 300 Jobs  The New York Times",
    "published date": "Wed, 04 Feb 2026 21:55:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOTndKZXVMWUJSMVN2Q19ycGx4SGhGN2tyeWtlaVlfNnFCMFNVRTV3bmhfSlZwWTR4Ti0wTTVDa296Qk9UWUdoU3ppSDJVeXRIV2hWOU1rRVBfbEUwOXVaajgxU0haWFVBNmltWFI5Y2lfVWpNRHNiUF9OSVhaNlNSd3htV210Z3B2cGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCSupreme Court lets California use new Democrat-friendly congressional map  CNNUS Supreme Court rejects challenge to California redistricting map  Al JazeeraSupreme Court Clears Way for California Voting Map  The New York TimesSupreme Court declines to block California's new mid-decade congressional map  ABC News",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files - BBC",
    "description": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files  BBCNaked images remained in Epstein files despite outcry  BBCNewly released Jeffrey Epstein files: 10 key takeaways so far  The GuardianEpstein’s orbit: will justice come?  CBCHow Trump Appears in the Epstein Files  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:57:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE00OXVqYjJYVU5FdVk5dmVkTmxBM2RjREthcWJxWkZnRllqLWRwRUctRFVfZGlZUDB3M01SQm9BOE91bkRhc1lIMEp1SmJOdWJMdUtOZm9UR1FIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Canada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’ - Toronto Star",
    "description": "Canada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’  Toronto StarNew Cuba travel advisory urges 'high degree of caution.' Should Canadians worry?  CBCCanadians urged to prepare for disruptions under new Cuba travel warning  CTV NewsPlanning a March break trip? New warnings for Canadian tourists travelling to Cuba  YorkRegion.comUS face-off with Cuba could put Canada 'in a vise grip', says former ambassador  Canada's National Observer",
    "published date": "Wed, 04 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxOdmNGMkhodGE1QmxhNGhBczFzZUJidjY2RXp1eEVwXzdyaDZlR2RIQ2std3ZlYWhZOHlYbHQ1N3dmV3FoS3VhbDFrcVpjMWdTTWJJTm94Z3dPSmlaZXlTZnNmaU54V0lUNGZfWnEweDRxMkRjc2dDN2JjcVVCem1WMVdoY1JqdUlSNHFJY3VZQXBvVFVKeWFPZG44dk91N1J4LXJrUjd0VV8yM2FuVzRtZzlRVVZYRkpyTXJINkJqOHlUOWRxWXhvMUhwREZadnlSdDd6MkJvQ2xKaXFxSExfQi0xY015R2hvQi1Mc1hhdG1STy1vbU85NUlteXdYMU5xQVQ2M1Zn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Gazans returning through Rafah crossing describe checks by Palestinian militia - BBC",
    "description": "Gazans returning through Rafah crossing describe checks by Palestinian militia  BBCReturn through Rafah: Palestinian women recount Israeli interrogation  Al JazeeraRafah crossing between Gaza and Egypt reopens, with strict limits  Radio-CanadaPalestinians wait at border between Gaza and Egypt as uncertainty clouds reopening of Rafah crossing  Toronto StarWomen returning to Gaza say Israeli troops bound and interrogated them after Rafah crossing  CityNews Halifax",
    "published date": "Tue, 03 Feb 2026 18:31:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBDanlNV29iTlVhVElSNWYzYmxhUTFhY2ZCN2dNTHYtQjg5NzQwUEtOallaSjE5X0dsblJJOFh0Q24wRTNSalBLdkJFRGQ3NmN0VE9iaXVhR2JGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments - Al Jazeera",
    "description": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments  Al JazeeraSon of late dictator Gadhafi killed in Libya  CBCMurdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite  The GuardianLibya's Saif al-Islam Gaddafi, who crushed dissent then sought political comeback, dies at 53  ReutersSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.fr",
    "published date": "Wed, 04 Feb 2026 18:18:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaUJDazIxdy1ycTByZDUtWVZ4S0Q5MnRuV01iMHhpcFlybi1vUV9pOVVyejVxb2ZxTkRBSlRJU1VtUTdFU2JldnhtcEdwc0h2dHp0ZWk3YThuMzVNeWlsU2xRQ1BPd29wX2pvTEtQc1I2S3dERTJmaThvVjR3OVpDdmV2MW9WTEtGX3YtRTRQeHE3bk00am4yYi12YjdEamxLN25QaS1fY9IBrAFBVV95cUxObmpIMXFJMEJjdjIwblZNcnlpQlBRRDl1LVpqNFVKN1ZlLVVkdVBLeVJIRVdHOGhlcHAyRzhDNDFZZVVFMHU2UGlULU5RV3Y5U1p2WE5aNG1BNmt0aTV4ckhwVGFoTVBnbkFvU2lfNGoxMUU4bk01TXFkWW9xSnp2ak9nZ2ZGUlNsZHpBLXNmdnZtNkxuQkJCclJXNC1NREtqSDZld0dPZ3NHTEVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Attacks on civilians in central and northern Nigeria kill nearly 200 - CBC",
    "description": "Attacks on civilians in central and northern Nigeria kill nearly 200  CBCGunmen kill dozens in Nigeria as US military deployment confirmed  BBCGunmen kill nearly 200 people in Nigeria’s Kwara and Katsina states  Al JazeeraAt least 162 dead after gunmen storm Nigerian village  Australian Broadcasting CorporationGunmen kill at least 13 people in northern Nigeria, police say  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 18:54:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE41dEtTMEVZOV9nbzIxVjh5Vld4MlF6Y01VNV9aWXRxUTAzN3VReVIwMkZZRlpBRDM0bG5Fd0ljQkoxSk1JUm1qd0l5TGxMelhlM1FMQzVjUHhjMUkzaEtaNUVCS2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Melinda French Gates says ex-husband Bill Gates has questions to answer over Epstein ties - CNN",
    "description": "Melinda French Gates says ex-husband Bill Gates has questions to answer over Epstein ties  CNNView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 07:30:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORGhlNEhKRFJlRHEzdGlESzhtUUt6ZWo1cXlVY3ByNzZ5Y1VVTThlVW9QX3lSQ3UxeTFDa2VPMlQyUDR4aTdVbkl5LXRCZGJFTTFqR05KV2lkSmw5WVdyM2xaZGZYYnE0VkkwMll1Vkw4bkQ3RWdOUktBZFFiQjYtMVNmR0E0VnpWNnBIUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Judge rules against U.S. plan to strip 350,000 Haitians of legal status, notes 'racial animus' of Noem, Trump - CBC",
    "description": "Judge rules against U.S. plan to strip 350,000 Haitians of legal status, notes 'racial animus' of Noem, Trump  CBCOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesMany Haitians may soon not be able to work in the US. That will make caring for the elderly much harder  CNNJudge finds anti-Haitian bias likely motivated Kristi Noem’s TPS termination  MS NOWJudge blocks Trump administration plan to strip protected status for Haitians in US – as it happened  The Guardian",
    "published date": "Tue, 03 Feb 2026 15:02:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5iMW1OcWtIaGkzdTgyUFM4UEVfQmIwdzlhNmdzRlFCR21yRXc3WmVOOW4xV3dtYjJIV0VtVktrQ2pGMUhtR19KNW5VTEVneUdwNUwxT19NMFVfcUNLNjVhckhaVVVyZU1KQkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Son of Norway's crown princess holds back tears giving evidence at rape trial - BBC",
    "description": "Son of Norway's crown princess holds back tears giving evidence at rape trial  BBCSon of Norway’s crown princess ‘does not remember’ taking videos of alleged sexual assault  The GuardianStepson of Norway’s crown prince cries in court, denies videos on his phone show rape  CTV NewsWhat to know about Norway’s royals as crown princess and her son face new scrutiny  CityNews HalifaxSon of Norway’s crown princess arrested on new allegations ahead of his rape trial  AP News",
    "published date": "Wed, 04 Feb 2026 16:00:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBFMUJabWdyUmJHU0NXZ3kwbFZJUWdTTkp5bENwV3dkSzJHNnRaZXg5cFFWTXdJbk1SZVpVWnFGQldVTGV0cTFyRGdOYlZIa0pZVjJRWjNXY1BvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US downs Iranian drone near carrier in Arabian Sea - Roya News",
    "description": "US downs Iranian drone near carrier in Arabian Sea  Roya NewsIran risks Trump's ire with new diplomatic demands, provocations  AxiosU.S. shoots down Iranian drone along Arabian Sea, military says  Global NewsUS shoots Iranian drone as Iran’s president seeks ‘fair and equitable negotiations’  Toronto StarUS says it shot down Iranian drone flying towards aircraft carrier  BBC",
    "published date": "Tue, 03 Feb 2026 18:35:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOVTR5cWpJeTB6Y3J2VXpxV0R2VXg0T19fcVBZTWVndjVBMllTeHQycXhPd2g0RmpGc2l4NE16RFZ6ai1LaThlOVRRSW1mOWJMZVVwLWZ1cHlsQlR2eTlvZjFqTDdsMHdCNkhscGUtNV9NaWx1N1hoeFAyTi1BbVZPbWJVak9OOTkwUWgxbw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://en.royanews.tv",
      "title": "Roya News"
    }
  },
  {
    "title": "Russia bombards Ukraine with drones and missiles a day before planned peace talks - AP News",
    "description": "Russia bombards Ukraine with drones and missiles a day before planned peace talks  AP NewsVideo: Russia has broken ceasefire, snubbed U.S., Zelensky says  The Globe and MailRussian hits Ukraine energy sites in 'most powerful blow\" so far this year  BBCZelenskyy accuses Russia of violating Trump-brokered truce amid cold snap  The GuardianUkraine says Russia is illegally targeting the power grid. Here’s what the law says  CityNews Halifax",
    "published date": "Tue, 03 Feb 2026 22:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQZTZkMU45ekNKYUotdGZMTTk0Tm4zNWkySGktOFo5VHQ5SnFKUTJWOUw1ODN6WHBBUzZ2SHp3a0w0YUNNNTdITVJSUnU3YzhSdmlHQWtRc3NhZ241WEtORnFGcTJmMXpvbU1wSmdyUlRUV2ozX0FxOVRsZWpScUFBOUg1d0NaR1pyWkNUVjJsdVlhSG1KOUx0cU5BcmRnb3NZaGQ4VUJCeXd5alUxZHBvMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "'I never left your side': Emails reveal more about Mandelson's Epstein friendship - BBC",
    "description": "'I never left your side': Emails reveal more about Mandelson's Epstein friendship  BBCPlan to release Mandelson documents approved after Labour MPs' anger forces climbdown  BBCThursday briefing: W​ill the Epstein ​files ​threaten ​Peter Mandelson’s ​legacy​?  The GuardianBritain’s worst political scandal of this century  The EconomistHow the Epstein files unravelled a senior British politician's career — and now threaten PM Starmer's job  CBC",
    "published date": "Wed, 04 Feb 2026 21:28:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1jVFNCY1pRODI3TnpHOXhneUtPYVFseWl0ZkRoYWFDQlFXRDBYZnJMdzRtMVg0UG1qdXoyTjRTTGw1Zl9QOW9rOXMwMjZuZmxhTXdVd0ttYWN1dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way - CNN",
    "description": "Trump wants Republicans to ‘nationalize’ US elections. The Constitution might get in the way  CNNTrump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm  The New York TimesTrump news at a glance: Democrats sound alarm after president mulls election takeover  The GuardianTrump doubles down on suggesting federal government 'get involved' in state elections  ABC NewsRand Paul on Trump call to ‘nationalize’ elections: ‘That’s not what the Constitution says’  The Hill",
    "published date": "Wed, 04 Feb 2026 05:04:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOT2NURUNQZlZnRlVXbDVGTEZvalIyT3IzVDhZblNGWkxSLVBCOUhBNmJPeG95MkpxY2lhRFd0R1BYYWp1TGZqQWJDdVFFaG11ZDQzWElzUjgtTUU5bURTR3FKeU1xSDc5N1psS3pxbERqTDJaSUJmYmRoMmQ5X2hEYzdoOUwtRE14U2YyZm1GRnU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Migrant deaths off Greek coast raise questions over quick official accounts - BBC",
    "description": "Migrant deaths off Greek coast raise questions over quick official accounts  BBCGreek doctors work to identify parents of injured migrant children after deadly boat collision  Yahoo! Finance CanadaProsecutor orders arrest of survivor over Chios migrant deaths  eKathimerini.comCollision between Greek coastguard patrol and migrant boat kills 14  The GuardianGreek rescuers search for potential missing people after deadly migrant boat collision  Toronto Star",
    "published date": "Wed, 04 Feb 2026 13:22:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE53V2tnSUNmNk1PUTg0SzB2RHcyclc4RE5SWktoZjhMTjdoZHhUX2VqaWhHd0NJY3B0MUI3a3U3OFluZi1QVTBkUE1HNVJXcjRYWEdIRFZxcWppUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Melania Trump Uses Event With Freed Hostages to Promote Her Documentary - Rolling Stone",
    "description": "Melania Trump Uses Event With Freed Hostages to Promote Her Documentary  Rolling StoneMelania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  CNNMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania bristles at Epstein question when confronted by reporter at event to honor Israeli hostages  The IndependentMelania Trump Gets Confronted About Ghislaine Maxwell's Prison Treatment  People.com",
    "published date": "Wed, 04 Feb 2026 21:57:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPdWdfR2dxVi1BVTV2TUh0TzFPdW9MdzEwWnNra0d0ZjZISktoaXc3czlyU3JNMUVKU1lJZjJaRXkwQmE5TUlDWWtHU0N5RlhYU0w1SU1iT1dYUUszekhCc29nTk9kbkkyTW5BZTdwOWNhN0xwdWtGa0FxUkxDb1V5Y3Rlc2Y0ajZkaC11OG9YaXRYbkp1MkdUWUJpNWZZOThRdWRvMmtyUW4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "description": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims  BBCEpstein emails bring scandal to Europe's elite, from Norway's crown princess to Britain's 'prince of darkness'  NBC NewsKing must feel vindicated for cutting off Andrew by latest Epstein files release | Andrew Mountbatten-Windsor  The GuardianThe Royal Family Is “Appalled” by Latest Epstein Files Release  Vanity FairLatest Epstein files include emails with 'The Duke,' photos of man who appears to be ex-Prince Andrew  CBC",
    "published date": "Wed, 04 Feb 2026 18:02:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBuMGZhSzRRSkJyM1BSNWJpSUo3Mmt4eTNJLXN1ZGhHRDl5bzgtMUZNSEZEOTNmd2ZoOTd3VDk1d2t2U28yVW56VktFTFl2TG1pVXZpUU43Mlg0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Man sentenced to life in prison for 2024 attempt on Trump's life - BBC",
    "description": "Man sentenced to life in prison for 2024 attempt on Trump's life  BBCRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York TimesRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  CNNMan convicted of attempting to assassinate Trump sentenced to life  CTV NewsVideo: Man who tried to assassinate Donald Trump at Florida golf course gets life in prison  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 17:57:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5ZbDkzeW12MDdnUDlHeGZ6c1FXbENZWUlYLWFUQXh2bklCT2NMVjNwRF9SZC1abGg0aE42LVRvSnFVelVMQ1djUVd4bVZTZGNNZkNlSXNGcmZUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’ - The Times of Israel",
    "description": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’  The Times of IsraelOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBCAfter crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack  The Times of IsraelIran’s people stand to lose whether or not talks succeed  Financial TimesSatellite imagery shows where the U.S. military is positioned near Iran  The Washington Post",
    "published date": "Wed, 04 Feb 2026 23:21:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQUG5BTGhYMGZlT0tmV0h6TDYwTV9sTmRncmhPNnQ2dnRjSHR4djZoVkh2YVFkRy1kaWNZYUhzb09HcUZwNWIwMVIzc0lZTVdHOFdBaVBQakxOLWRPemp3LXp3SHVyN1RuZnl0ZVFDNEY1ajAwZ3JaOU91UGpWUDdTTl9wX0p2R1NwWldoX3FZZjdXZ1kwYWlNa04zWldxTTVMODRuTGdfQzBhRU5w0gGyAUFVX3lxTFBESjFieHBPN1NQbDktUm1GdDBXNE9zSW5Ua0dNSlNLbDAzNTNLZXpXNG9ubzRUQ3R4cVF5ODhNSE9CZHZiZzZkeXFFNGdlWWpLR3pCME1XcHZvNk0xZzRhMWIxTzdoRnpvWWg5RFFmMkRvWjY2SktLbHhtdGx3MFIzZ3RkYW9FaHBXR1hRRkhqNnc5SEs1bngtX21VWXU4VUhNYUdUOE9pcjFjZ2ozZkxBd2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Australian boy, 13, swims for 4 hours to save family swept out to sea - CBC",
    "description": "Australian boy, 13, swims for 4 hours to save family swept out to sea  CBC'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family  BBCAustralian teen swam hours to shore to get help for mother and siblings swept out to sea  CNNBoy swims four hours to shore to save family swept out to sea  Australian Broadcasting CorporationAn ‘amazing feat’: how was 13-year-old Austin Appelbee able to swim for four hours to save his family?  The Guardian",
    "published date": "Tue, 03 Feb 2026 14:39:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA0YzdPMnFJbDBKVjNzTEFGTjZfeGVLTmk5b241NW0tUjZheFEtUkRlQ215QUxPdGs2WFdLaURDSTB5OEZYRmY1NGlxN09pQWZzeTAwY2h6TTJ4cHdPMl9RbmNmOEJYeC04d2xiSkpLMVNEeGNfdXkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Donald Trump's lawyers call BBC's Panorama defence 'untenable' - BBC",
    "description": "Donald Trump's lawyers call BBC's Panorama defence 'untenable'  BBC",
    "published date": "Tue, 03 Feb 2026 17:48:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9hWEE5Q28zbkd1eUtRdXJGWm1jVTJrTVdjQ3pDWHVud3Jjdk5weXQ0clM1Nlk2bFE4bS16QWNva0dCS0VsaWMyN3Q2amk5aUhUMW0zaVJSTTI5QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Jill Biden’s first husband held without bail after being charged in wife’s killing - CTV News",
    "description": "Jill Biden’s first husband held without bail after being charged in wife’s killing  CTV NewsView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 18:47:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNYnIwYng2bHZROHAtaVJhTkZuajFUREJtdWxHbG52dmlRelIxYUs2WkpYZmU0a2xRTF95RWM3a2VUSUZveDl1UVVlY1JISzFFdldSMXpnQlhmRkFiZ2Y2cUZDZlRibS1tUlB5X2hPOE9GQ0NIdm9TOGhHU0gzM1VMbThkcGROWlcta0NuMVE5c1YtSmVSaklOVmo4b09YSERHZG9QS21qS0IzSjA0QjVmdWp3dmFXVWd2UVM1WkhBUGFRVURpZzhXdHlYUnU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Police raid, search X office in Paris, summon Elon Musk for questioning - Global News",
    "description": "Police raid, search X office in Paris, summon Elon Musk for questioning  Global NewsParis prosecutors summon Elon Musk after raid on X's French offices  NBC NewsX offices raided in France as UK opens fresh investigation into Grok  BBCCondemnation of Elon Musk’s AI chatbot reached ‘tipping point’ after French raid, Australia’s eSafety chief says  The GuardianFrench police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok  CBC",
    "published date": "Tue, 03 Feb 2026 17:41:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQdjNfdXJBTUp2WDFKbXN3UGNJdDQxRmFaaEkzSnV0M0MwUmdxS2ZYaThNb19ZbHFla29WU25KOWJJVDlFZ3R6cjFfajJCdERpTjI1NktEdVpnNVVoYVUxQ2I4d0xtWEtCWmJUNUl5RUF0RUw1X2NTY0R3NFpacUxHYUIwN1pncU1sSzdsdTBRYlNESjRURDBfM2dic2RMSUR3MGlqRA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ban on asylum seekers using taxis for medical appointments comes into force - BBC",
    "description": "Ban on asylum seekers using taxis for medical appointments comes into force  BBC",
    "published date": "Wed, 04 Feb 2026 22:03:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1uVE1Ja1MwbGhrYUlhNnJNSERUUFFDQ1NPZTlFcHhFV3BWaG00Q0tvZG9FRWhMUk93ekxLem5jSkJ6VDY2RVg2bDJpS0tfalRCdmVyVUpTcHdOZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs - Al Jazeera",
    "description": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs  Al Jazeera‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  CNNElon Musk calls Spanish PM a ‘tyrant’ over plan to ban under-16s from social media and curb hateful content  The GuardianSpain looks to ban social media for under-16s, joining others in Europe  CTV NewsEurope Takes On Tech With Social Media Bans and Paris Raid on X  Bloomberg.com",
    "published date": "Wed, 04 Feb 2026 10:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcnlONWxoSGlTLVN1bWNOX2ZaekJnRWNPYkVReEJRRHpoQ2ZLVi1ibGlNZzg2cVZKckRpY0xlUzBkSjRsekRKcTNEeU5Xa2NwaHZhZjV2QTZNMmE5MHhMMV8wQjRZUmN2Q21XRm41dDJORFlpeEI2T2ZQbUJjQ0YxR05hVm4tTjFCeGRubEZXOF9mQzR2YVVrbjJVOW5LZzRrR0d6RkJtemxUaXdu0gGyAUFVX3lxTE1rSE92d0hQNG56QWlvNVA0S2doUU5Qd21JcGlsckpsX205b2FkYXFEbjdrTGVNYzBvdlI5S3NjZ0sycGVyUE1XYTJIS0lzV21vZlZrN2taOExiNGI1dXZ1T2FBN0tDcGtodmZOVXB4d3RZdzdLVTd0ZjNiLTBYQVpiamR3VUdJOEloSUJodHpXMk9Nd1BQLVRERmhBNUZxLVgzUmhlX2Z2WVkzZDN6aHJFNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela - NPR",
    "description": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela  NPRVenezuela approves new law opening its oil industry as Trump threatens more tariffs on countries selling oil to Cuba  CNNUS Plans to Issue License for Firms to Pump Venezuelan Oil  Bloomberg.comTrump Is Courting Chevron, ExxonMobil, and Others on Venezuela. What It Could Mean for Your Energy Portfolio.  The Globe and MailLake Maracaibo: The oil region at heart of Trump plan to 'Make Venezuela Great Again'  BBC",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNLWlZY1c3ZUZXMGhrRmdzb0tqRDVTcWxHN3gtNk9wMVNWOWdZZUt1cXlSZFhwQy11cWk3V3cwdzhPN0xIMV9kRnZtY3YwcHVYMjRUajdPT1VyZjZNSDM5M1BsR0Z2NE5vNHhtTFcwdTI0eGwzM0Jhb3RHSWprMXEyak9FZWpqc2Q5SVlfaDQ4TFlCeGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Grassroots ‘Red Lion and Sun' network emerges in Iran after crackdown - ایران اینترنشنال",
    "description": "Grassroots ‘Red Lion and Sun' network emerges in Iran after crackdown  ایران اینترنشنالAlarm grows over detention of doctors who treated Iran protesters | Iran International  ایران اینترنشنالIran cracks down on medical workers treating protesters  Le Monde.fr'Finish the job': accounts point to Iran's executions of injured protesters | Iran International  ایران اینترنشنال",
    "published date": "Tue, 03 Feb 2026 14:35:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE53YXliWWdqUjM2S043NjJXTHUtQzJJRl9VRjRDU1hpRjMwVEVLelJFa3NLMHh0eG85cVQyTTJOcFkxRHBGTVoxMFFOZjVYRTBBR2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iranintl.com",
      "title": "ایران اینترنشنال"
    }
  },
  {
    "title": "Trump says his administration is seeking $1 billion in talks with Harvard - CBS News",
    "description": "Trump says his administration is seeking $1 billion in talks with Harvard  CBS NewsTrump seeks $1bn in damages from Harvard  BBCTrump announces plan to sue Harvard for $1bn damages  Al JazeeraTrump seeking $1-billion from Harvard to settle federal probes into the university  The Globe and MailTrump, Changing Course, Throws Harvard Deal Talks Into Chaos  The New York Times",
    "published date": "Tue, 03 Feb 2026 15:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ucWI3eUtmR2l0bzJLZDZtYXZPOGZCNlZBd1ZXLTFBQ05kc2pSVzhubVg0ejkweWxMVFdsZ255allSNWR4NF9zZkd0WnExYmRqMGZQTkpMMTl4ZVBhWGp0a2FrRUtYYVZLV0F5aEdzam9uNTh5MGxOazZfYUHSAYIBQVVfeXFMTTFwRl9YR196U2NKbDg0YTl5TUYtOENCVi1SUUJHRHgzVzJROXNmN2FESldDcndHY3VVdlNOeHQwcllIY3FfY1hOVEo4c3QyNk54XzBCdXlzSlJiMmZwMnVac1hEcWhmVG1lQUpma1hXYnNkbU5Yd2JBYllydWx2YzBaQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbsnews.com",
      "title": "CBS News"
    }
  },
  {
    "title": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments - The Kyiv Independent",
    "description": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments  The Kyiv IndependentUkraine sees quieter night as Trump says Putin will not attack its cities  BBCZelenskyy calls on Trump to respond to Russia’s massive attack as talks resume in Abu Dhabi  Euronews.comPutin kept his word: Trump about energy truce  Українська правдаUS, Ukraine disagree on whether Russia following ceasefire  The Hill",
    "published date": "Wed, 04 Feb 2026 19:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaEd3RG9JSzV6YTZTcXUtM19WTjJqTkxuNVBLdXVqT290UG9CTXVsdDBCMmx0WTl6cFFkd25wWFBwRmZlQ0RMOWRIeUxsc0l6Yy1XU1ZVOWRiZTluTUNsYUJXZUt5aExLdk5CVHQ4ZF9jQVZncC1fNXo1NE1PcUVrRDBKZjFRZ0hmR1NHQWVRV24tb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Restored angel fresco resembling Italian PM Meloni sparks investigation - BBC",
    "description": "Restored angel fresco resembling Italian PM Meloni sparks investigation  BBCChurch fresco resembling Italian PM has face scrubbed out after outrage  BBCAngel that looked like Giorgia Meloni removed from Rome church fresco  The GuardianHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistAn angel resembling Italy’s Meloni is painted over after an outcry from church and state  CTV News",
    "published date": "Tue, 03 Feb 2026 14:10:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9Yenpjc2RmYWh2enl0UEx4ajhEenZUTUJDZE9jRnVTcHFFNEZaX1ZRR3o2OFNhdnpyU0RXS2NxQ2ItM2pqYzdzS2ZvZlFQaV93ZTBRbl9mOXFLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US Winter Olympics hospitality space changed from ‘Ice House’ to ‘Winter House’ following anti-ICE protests - CNN",
    "description": "US Winter Olympics hospitality space changed from ‘Ice House’ to ‘Winter House’ following anti-ICE protests  CNNWhy members of ICE will be in Italy for the Winter Olympics  CBCHospitality spot 'Ice House' now 'Winter House' for U.S. athletes  ESPNOlympic president declines to add pressure on LA Games chair Wasserman over Epstein files link  Winnipeg Free PressWhat is ICE's mandate abroad and can it operate on foreign soil?  Yahoo News Canada",
    "published date": "Tue, 03 Feb 2026 13:55:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQTktmZ0ZGUk5CSTZ6YksxRDNRQkhwWUJrQ0Z3ZXQ2dnJ1N0E5V0ZlZ3ZMRmNtWjFwNHFGTkFwV1pFcmtmY2dYZGQ5b0w0MEh6aHBVNUlKeDB1ZURLLXdod0F0amxqVlQydTJTODIzSVN6bG5CbVpkc1g0MUo0cm1DT25kV0FwMTNqX2lTcHp4ZFFkZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’ - boredpanda.com",
    "description": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’  boredpanda.comNorth Korea executes citizens for watching South Korean TV, Amnesty report says  upi.com",
    "published date": "Wed, 04 Feb 2026 16:58:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFo2UzBlWFdZNkNRcHp0U1ZJNm1sQXVVc1E3d0ExbGQ0aHFwcUI4VVJuNk1yUW1CQ3VHSmZURlVUdk9uTjF2cVRqZ0w4bkpoQTZveUhoSXFXUDFLaVdHN0FMUzEzWHRvTFllZG5aWm9UNzc1UUdTTnJibGxvOGpoYjVXY280VlZmT29GaHF3RGdmSmE1RVU4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boredpanda.com",
      "title": "boredpanda.com"
    }
  },
  {
    "title": "Seeking shelter from Trump’s fury, U.S. trade partners reach deals with each other - CTV News",
    "description": "Seeking shelter from Trump’s fury, U.S. trade partners reach deals with each other  CTV NewsSeeking shelter from Trump’s fury, US trade partners reach deals with each other  AP NewsWorld’s ‘middle powers’ de-risking from America  The Globe and MailTrump ‘woke the rest of the world up’ to leveraging economic firepower against trade partners, says Morgan Stanley CIO  Yahoo FinanceAnalysis-World discovers it can hedge US trade risk  Yahoo! Finance Canada",
    "published date": "Tue, 03 Feb 2026 12:17:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOa3F1TVVOcXNQLUpvUWFycVBQOGxzUlV2UmtiOExQb0RWSThCM1d1Q2wzU2xfSjZ1eVY1WHZSM3RhLW13RXg5RGprd3FtRVZuQmZUQ2FpbzRhTlhXTWJMVVRyZmxqR0E3cV84SjlFMFJhbW1wV2F3SHRVd3EwX0U1VldUZlI2UFhvZVpQaEFIUHl5RjhrZVlWREsxbGZLNm9jeGZadkZEbzltMk1RaE42bmRDY0syNmVfcEM4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Red hats sweeping the U.S. as resistance knitters embrace 'melt the ICE' pattern - Yahoo News Canada",
    "description": "Red hats sweeping the U.S. as resistance knitters embrace 'melt the ICE' pattern  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Tue, 03 Feb 2026 17:25:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1IUXU2Vk51NlZteHUxMEEtOVNJdURKRDYwSkFIZDRPeWxNcXp4NGFkYW5MYTA0QWlZeG5DbjdfaXh0T3d6clNXWEFTNlFISENpQURiZWZpcmFMbldYRmlCSFlwenR6Q2ZCejl6SktsSjZpMk5qTTNodC1KMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Live updates: Colombian president Gustavo Petro speaks after visiting White House - BBC",
    "description": "Live updates: Colombian president Gustavo Petro speaks after visiting White House  BBCColombian president and Trump put aside insults for amicable White House meeting  The GuardianTrump-Petro meeting: Just how icy are US-Colombia relations?  Al JazeeraVideo: Trump, Colombia's Petro meet in Washington after months of feuding  The Globe and MailTrump and Petro trade insults for restraint amid continued detente  Politico",
    "published date": "Tue, 03 Feb 2026 22:33:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE42cXRld0dXc0JJOUVoc2FYNl9manQtVE9yek5ZaHUyRDdNdjQ0R0lNdGNaYm9sYm9CUWpndUdFVi1YNDlFckVaTGQ3N1JCbDdwdjZNQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Alex Pretti’s cause of death confirmed by medical examiner - Global News",
    "description": "Alex Pretti’s cause of death confirmed by medical examiner  Global NewsTwo CBP Agents Identified in Alex Pretti Shooting  ProPublica“I was detained by federal agents in Minneapolis”  The VergeAlex Pretti’s Cause of Death Revealed as Medical Examiner Rules Death a Homicide  People.comProPublica Identifies CBP Agents Who Fatally Shot ICU Nurse Alex Pretti in Minneapolis  Democracy Now!",
    "published date": "Tue, 03 Feb 2026 15:07:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOT3QyZDQwV0RPa0h6MlNuSlh4Q2ZZTGJEbGlRbWJkb3Y5RFN5R3FCOU9sVTFoN2ZaRk41UC1JWWNvdWNmbFpUYldvbGxPN3djN0hMM0tLNmFyQlpPWHNyM1ZrTEVpR0hMUXhXbXVnNElBSmJGbHJ6T1BFM2FWLTVlMy01U0toZmF4WllnT3l1NUNzNHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCFamilies suffer as Ukrainian engineers can no longer keep up with repairing infrastructure  Toronto StarRussian attack leaves 1000s in Ukraine without heat in -20C  CBCUkraine energy minister warns of more power cuts, possible Russian attacks  Reuters",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]