[
  {
    "title": "'We are ready to listen': Savannah Guthrie posts emotional plea to her missing mother's kidnapper - CBC",
    "description": "'We are ready to listen': Savannah Guthrie posts emotional plea to her missing mother's kidnapper  CBCLive updates: Savannah Guthrie’s mother Nancy is still missing, investigators probe potential ransom notes  CNNAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZScoop: FBI chief ready to head to Tucson as Trump pledges help to find Guthrie's mom  AxiosLive updates: Savannah Guthrie makes a tearful plea as search for her mother enters fifth day  NBC News",
    "published date": "Thu, 05 Feb 2026 02:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPc3FOUlZYRmZXbFRzT29ielRYeVZ4R0lPQUZnem81dmRuNFhWR29WX1IydUxXRm5pSlJIYk9XTEFFeVhENWxOZzFGQTZOakdYdlJOSmdMZW5EZHkyYkdkX2JRaV9PRzVHbFRTREZvWUVNMzk4b3hTbkpsQ1FjX2QxZ0Zudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Could Mandelson face jail time over Epstein ties? – The Latest - The Guardian",
    "description": "Could Mandelson face jail time over Epstein ties? – The Latest  The GuardianBritish PM Starmer apologizes for appointing Mandelson, but says diplomat lied about Epstein ties  CBCMandelson sought Epstein’s help in hunt for lucrative roles at Glencore and BP  The GuardianCall for PM Keir Starmer to resign amid Mandelson scandal  BBCVideo: U.K.'s Starmer apologizes to victims of Epstein for giving Mandelson an ambassador job  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 16:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPMVB5cXVleVRQNkg3eFVXcEtoNzVyM2g4UmdVTEZ2b2w2LURPaXZqblpvbk9LNF9ldld5QkdHaHZGYW90RFZfWkJRblgwWUc2MVJJN0FzQkhTV1dXNGlDRUtESHVIRDZ5Q29KUGJXZGVlVWhHU0ZUeTNZSVN0bjBkMkdvRDJTLW9fcTFsWTg5YnNmNFJITUNwaXVjR2UtQmxwRkpGYWowTjA4YnZZRzV2aXhkcEZNMnM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says - The Globe and Mail",
    "description": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailAnand visits D.C. as Trump administration makes case for critical minerals trade zone  Toronto StarAnand to attend U.S. meeting on international collaboration on critical minerals  CityNews EdmontonTrump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China  BloombergUS, UK, EU, Australia and more to meet to discuss critical minerals alliance  The Guardian",
    "published date": "Thu, 05 Feb 2026 02:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcDJaN1A4UFF3VHJ2QjJJeE4zTVMtSUNadFBqTHVvZmxLdGRUZTIyVjBZWmhpWlNpMkJxUzRIX1otMHJvTVRiYXdYWVUtVDJHWEQ1Y1RDOWtGRTh6SmtVdk9yMjh3UW5pb1ZqZTBJSmhmb3k3aXdjRUZEQ00xZi1FelhBOGx1dC1YQkJxTi03NmI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "700 ICE officers will leave Minnesota immediately, border czar says - Global News",
    "description": "700 ICE officers will leave Minnesota immediately, border czar says  Global NewsTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsTrump says Pretti and Good were ‘not angels’ while signalling ‘softer touch’ on immigration crackdown – US politics live  The GuardianU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBCHoman to draw down agents in Minnesota. And, U.S.-Russia nuclear arms deal expires  NPR",
    "published date": "Wed, 04 Feb 2026 15:54:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54aXpHTFJoNWhCT09waGl2dzZtc2RsUUtkT0gxTWxBUHV4eldjZVN0VlN5cWx6SHNTVFlQcXBBRm5yTTlRcXlYOEd2QTlrTTE0cUhzd09hSUM3MnhyZnh1OVRvOXJPNGIwcjJ4aWdsQlRmNGJYa0hfNVFZUnI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "How Iran’s infighting consistently derails diplomacy - ایران اینترنشنال",
    "description": "How Iran’s infighting consistently derails diplomacy  ایران اینترنشنالLIVE: US, Iran struggle to find common ground ahead of talks  Al JazeeraUS and Iran agree to hold nuclear talks in Oman on Friday  BBCIran and U.S. agree to hold nuclear talks Friday in Oman as Trump delivers blunt warning to Khamenei  CTV NewsU.S.-Iran nuclear talks back on after Arab leaders lobby White House  Axios",
    "published date": "Wed, 04 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE45SzNUMktOcS1YYVRGcHJnVzVwZzJxaTlWdDNEV19QdG1xQkFYd2VvUFRaeGZlU0hTcTJ4SkJyX20xaE80QmJqbEdJNm9td0xEVlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iranintl.com",
      "title": "ایران اینترنشنال"
    }
  },
  {
    "title": "Stepson of Norway’s crown prince cries in court, denies videos on his phone show rape - CTV News",
    "description": "Stepson of Norway’s crown prince cries in court, denies videos on his phone show rape  CTV NewsSon of Norway’s crown princess ‘does not remember’ taking videos of alleged sexual assault  The GuardianSon of Norway's Crown Princess gives evidence as rape trial continues  BBCStepson of Norway’s crown prince denies drugging alleged rape victim  CTV NewsWhat to know about Norway’s royals as crown princess and her son face new scrutiny  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 15:21:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQMDg5dHQxbVhCY3NFNjlNTnZNZVc4ckRza2t4RUF0emZYOG40X1lMc25aOE9kWmtDTFRNUTJLTU5FVWFnNGFtTVlxSXlncnpaNlBaM2VrSFBWbW5nRlR6bzlPeExtV2VRTFRmb08xcjEtak1zZVB1RGZpeDBPZmMydmpzU1Z0R2dUTUJfdW5qNTdib1MxZDZ4Wno3TlE2cVRwc2lQcXJVNXJkNDFJdTZMOWM1TFZRal9hbzB5NUhn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’ - Toronto Star",
    "description": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBCGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The GuardianWestminster Dog Show 2026 Live Updates: Latest on Best in Show and Group Winners  The New York Times",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNTmE2X1hMNzJnbEJUV2h3bVVrOGZyVXUxX2NwakN5SW5fZFpobHNyOXVxdUYxODc3dElTWkwwR2xWRGdGYnFnMFVocEEwTDU2bVBqeGxDTFVpcmVmVXlrMDZmbkZLWWZJOUgzQ05iSlJodDRSWWJ3VHJkMDFZVG5tbEdLMndCSTIzR1ZsaXR0bEZFczF3dXVDWE9oakxjOV9MUG9vZ2d3QU52aWpzYmFmc1ZJVWtZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children - CBC",
    "description": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCThe Gaza ceasefire began months ago. Here’s why the fighting persists  CTV NewsIsraeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire  BBCIsraeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier  CityNews HalifaxVideo: Israel strikes on Gaza kill at least 24  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 18:35:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdl9FdVNVdVhzdzBSTTVGYXR1XzBTMU10RDBUVjZPUElUQnlIaVZ3UGozaVRYcEZGdVBoMmdja2p2eEhFWEhCQzZXOHhLeFU1eEVsb3lIaGtvODR1Y3dYZFE3d2NtcWNoWHhuLXFQZ3BEaDJKbkx3aVJqQ1RSU3hQcXRQVTI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty - Reuters",
    "description": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty  ReutersLast Russia-US treaty on nuclear arms control set to expire  Al JazeeraA half-century of US-Russian arms control ends with the expiration of the New START nuclear pact  Toronto StarA key nuclear weapons treaty is ending. It’s a blow to Russia’s ‘superpower’ myth  CNNLast U.S.-Russia pact expires, removing caps on largest atomic arsenals for first time in half-century  CTV News",
    "published date": "Wed, 04 Feb 2026 18:22:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNX3hYcjVUbFlORl9hVlBzckRITkxLNnJQNzhwU3AxRUFxSmdLQ085TmxOOHN2QnNPZVEwdnBzTGdMZHl1empjZzN6My1kdkdjZGZRaXJOYl9SbjYwd0dscjR0ZnRFc09MS3ljRmxkb0RPbDMwa2I0U2xyVHdVcXFZN2ZCTWhNUTRMYV9yNkVkVFZRMlFsQmppX3R6X05lTXA2b3hybW9qY2ZMbXJjeHNRb3htUC1wenU5U2lBZ29oN3owazVRN2ZF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCSupreme Court lets California use new Democrat-friendly congressional map  CNNU.S. Supreme Court green lights California pro-Democrat redistricting voting map  CBCUS Supreme Court rejects challenge to California redistricting map  Al JazeeraSupreme Court Clears Way for California Voting Map  The New York Times",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Gazans returning through Rafah crossing describe checks by Palestinian militia - BBC",
    "description": "Gazans returning through Rafah crossing describe checks by Palestinian militia  BBCReturn through Rafah: Palestinian women recount Israeli interrogation  Al JazeeraRafah crossing between Gaza and Egypt reopens, with strict limits  Radio-CanadaPalestinians in Egypt torn on returning to battle-scarred Gaza with ‘no future’  The Times of IsraelWomen returning to Gaza say Israeli troops bound and interrogated them after Rafah crossing  CityNews Halifax",
    "published date": "Tue, 03 Feb 2026 18:31:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBDanlNV29iTlVhVElSNWYzYmxhUTFhY2ZCN2dNTHYtQjg5NzQwUEtOallaSjE5X0dsblJJOFh0Q24wRTNSalBLdkJFRGQ3NmN0VE9iaXVhR2JGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Attacks on civilians in central and northern Nigeria kill nearly 200 - CBC",
    "description": "Attacks on civilians in central and northern Nigeria kill nearly 200  CBCKwara state attack: Boko Haram blamed as US military team deploys to Nigeria  BBCWhat to know about Nigeria’s security crisis after latest attack kills over 160 people  Toronto StarNigeria sets up new military command to slow spread of Islamic militants after deadly attack  CityNews Halifax'More than 170' killed in suspected Islamist attack in Nigeria  Sky News",
    "published date": "Wed, 04 Feb 2026 18:54:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE41dEtTMEVZOV9nbzIxVjh5Vld4MlF6Y01VNV9aWXRxUTAzN3VReVIwMkZZRlpBRDM0bG5Fd0ljQkoxSk1JUm1qd0l5TGxMelhlM1FMQzVjUHhjMUkzaEtaNUVCS2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Ukraine to change negotiating stance for Abu Dhabi talks after Russia's massive strike - Euronews.com",
    "description": "Ukraine to change negotiating stance for Abu Dhabi talks after Russia's massive strike  Euronews.comSecond day of Ukraine-Russia peace talks in UAE end without breakthrough  The GuardianUS and Russia Agree to Restart Military-to-Military Talks  BloombergRussia-Ukraine war updates: Over 310 prisoners exchanged amid talks  Al JazeeraRussia, Ukraine meet for U.S.-brokered talks as Moscow keeps up attacks on energy grid  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 06:30:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNUU1Mam5PMmYxb21jeEdKV3FGNWpiTGxOR0VvbDhkVEJFWkhxUTR1OU9SaW1HMFpOZkJkenVNU1lyWHFNVVBzb0xKMi1ndElXcmxXS203ckV6NTR6NWVSUmxPVWVacGd4VVJPYTFXNHJ6SjNSekdYWS1vQTNpcHIzWExZU0twc05aR1EzcWF5MGg5aGNjeHpKY2JWajRYWlo1bWdjeXJYZTdINmk1bXk5My1xcGRoQkR2UHpscjBR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Could Trump Really “Take Over” the Midterm Elections? - Robert Reich | Substack",
    "description": "Could Trump Really “Take Over” the Midterm Elections?  Robert Reich | SubstackTrump news at a glance: Democrats sound alarm after president mulls election takeover  The GuardianTrump’s New Threats to American Elections  The AtlanticTrump says he will only accept the midterm results ‘if the elections are honest’ and again pushes to ‘nationalize’ voting  The IndependentRand Paul on Trump call to ‘nationalize’ elections: ‘That’s not what the Constitution says’  The Hill",
    "published date": "Tue, 03 Feb 2026 17:32:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFB2LXhmTFNPWDJZYUtNbVo2YXh5MjVBTlhha2RDbDlqbkx4X3psZGdPMm9GS1B5WXZ5NmJSSUVfanFETmtYOGZOc0JUM1FkMDN2RDVhaU9wR0pSWGg4UXNqN2gtaDl1Sy1iTENoMGhlbWVhTGR2VEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://robertreich.substack.com",
      "title": "Robert Reich | Substack"
    }
  },
  {
    "title": "Trump signs bill to end shutdown but another budget cliff looms over ICE funding - BBC",
    "description": "Trump signs bill to end shutdown but another budget cliff looms over ICE funding  BBCCongress ends shutdown, approves $1.2T in funding — and sets up DHS cliff  Politico\"Schumer needs to get the hell out\": House Democrats fume over DHS funding talks  AxiosTrump signs bill to end partial government shutdown, setting stage for next fight  CTV NewsUS House passes $1.2 trillion spending package to end government shutdown  Al Jazeera",
    "published date": "Tue, 03 Feb 2026 22:28:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5sOTBFNnFfbF9EY2xYa1JnOTVQLThlUjd2WkFHLVJZeVRXX0xNa1l0SnM5TVdwUzh1UndiN3pZZ285cElvR1g0RUU5ODNrN3dzSk5JN2xhZ0ZEUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments - Al Jazeera",
    "description": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments  Al JazeeraSon of late dictator Gadhafi killed in Libya  CBCMurdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite  The GuardianLibya's Saif al-Islam Gaddafi, who crushed dissent then sought political comeback, dies at 53  ReutersSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.fr",
    "published date": "Wed, 04 Feb 2026 18:18:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaUJDazIxdy1ycTByZDUtWVZ4S0Q5MnRuV01iMHhpcFlybi1vUV9pOVVyejVxb2ZxTkRBSlRJU1VtUTdFU2JldnhtcEdwc0h2dHp0ZWk3YThuMzVNeWlsU2xRQ1BPd29wX2pvTEtQc1I2S3dERTJmaThvVjR3OVpDdmV2MW9WTEtGX3YtRTRQeHE3bk00am4yYi12YjdEamxLN25QaS1fY9IBrAFBVV95cUxObmpIMXFJMEJjdjIwblZNcnlpQlBRRDl1LVpqNFVKN1ZlLVVkdVBLeVJIRVdHOGhlcHAyRzhDNDFZZVVFMHU2UGlULU5RV3Y5U1p2WE5aNG1BNmt0aTV4ckhwVGFoTVBnbkFvU2lfNGoxMUU4bk01TXFkWW9xSnp2ak9nZ2ZGUlNsZHpBLXNmdnZtNkxuQkJCclJXNC1NREtqSDZld0dPZ3NHTEVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Canada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’ - Toronto Star",
    "description": "Canada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’  Toronto StarCuba travel warning doesn’t shake Windsorite’s plans; Support grows for those facing shortages  CTV NewsUS face-off with Cuba could put Canada 'in a vise grip', says former ambassador  Canada's National ObserverPlanning a March break trip? New warnings for Canadian tourists travelling to Cuba  YorkRegion.comNew Canada travel advisory for Cuba warns of major health risk | National  Daily Hive Vancouver",
    "published date": "Wed, 04 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxOdmNGMkhodGE1QmxhNGhBczFzZUJidjY2RXp1eEVwXzdyaDZlR2RIQ2std3ZlYWhZOHlYbHQ1N3dmV3FoS3VhbDFrcVpjMWdTTWJJTm94Z3dPSmlaZXlTZnNmaU54V0lUNGZfWnEweDRxMkRjc2dDN2JjcVVCem1WMVdoY1JqdUlSNHFJY3VZQXBvVFVKeWFPZG44dk91N1J4LXJrUjd0VV8yM2FuVzRtZzlRVVZYRkpyTXJINkJqOHlUOWRxWXhvMUhwREZadnlSdDd6MkJvQ2xKaXFxSExfQi0xY015R2hvQi1Mc1hhdG1STy1vbU85NUlteXdYMU5xQVQ2M1Zn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "US says it shot down Iranian drone flying towards aircraft carrier - BBC",
    "description": "US says it shot down Iranian drone flying towards aircraft carrier  BBCIran risks Trump's ire with new diplomatic demands, provocations  AxiosU.S. shoots down Iranian drone along Arabian Sea, military says  Global NewsUS shoots Iranian drone as Iran’s president seeks ‘fair and equitable negotiations’  Toronto StarTrump says talks with Iran continuing as US shoots down an Iranian drone  Al Jazeera",
    "published date": "Tue, 03 Feb 2026 18:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5BVTJ6RGFxVUZpZEh2NGlRenk4c3hOWkdkVUVLVFhwLW1TeTQwQjRvOERVNXhhYUI2TU9VUHp0UzVxcXRVZG1SVV9kckJpTzBYSTU2ajc5OVRwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Fifteen migrants dead after collision with Greek coastguard boat - BBC",
    "description": "Fifteen migrants dead after collision with Greek coastguard boat  BBCGreek doctors work to identify parents of injured migrant children after deadly boat collision  Yahoo! Finance CanadaProsecutor orders arrest of survivor over Chios migrant deaths  eKathimerini.comGreek rescuers search for potential missing people after deadly migrant boat collision  Toronto StarMigrant deaths off Greek coast raise questions over quick official accounts  BBC",
    "published date": "Wed, 04 Feb 2026 11:59:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA0S2dQT0FUVlJtalM1RE84aFloNF9tYlFDSnFoa01iMjB2Y01sMXcyMmFnZ25nWDFrVnFlTXZocklmR04xNG16Ujc5TV9uZ3VKb09QTW9sV0NKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack - The Times of Israel",
    "description": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  CNNAfter crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsDonald Trump wants to end America’s half-century conflict with Iran  The EconomistOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBC",
    "published date": "Wed, 04 Feb 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOYUd2cnExc1BUZnplc1BuSE0tMENOaFBoQktsUVIzT2tjVF9Od0QyZ1RJMUFVRFNTLVBMX2ZCMDd2QXE2Qk5lWkItXzBkaU1MQ2FkeHZFWlBYenh6Q3k3VFJKVkpFUmlsRVBxSlVNS0Vld1VSZlNEVmxJS1FZOVBKN0F6QWl0RE5OZ28zeUJZMHduVWw1dXI2d3VsekVfZ041em1RLUdsNWdqekZlel84ONIBtgFBVV95cUxPaWpnQlpoZmItYl9TTS1yQVBleE1HMUctcFJPU0d5d3Z3TWpsOVpHZVMxcDdSa3FfMkZyeG1RNTdkaXBJSExwbS1Eczg4TVdoRFBXY1BKeGhVZnVxM2hFUDNSTVFFb0pfT3NzUUpFVXdFdjQzOXNualUzWmtVZnlXeHlCcHBqU25zdjhKSlVtMWMyYzc3amhMOEZ0c2VEc3hEblI2S1lhTlJqODExNUNrdzkzVG4xUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "description": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims  BBCEpstein emails bring scandal to Europe's elite, from Norway's crown princess to Britain's 'prince of darkness'  NBC NewsKing must feel vindicated for cutting off Andrew by latest Epstein files release | Andrew Mountbatten-Windsor  The GuardianThe Royal Family Is “Appalled” by Latest Epstein Files Release  Vanity FairCould Andrew Mountbatten-Windsor be compelled to testify in US Epstein investigation?  The Conversation",
    "published date": "Wed, 04 Feb 2026 18:02:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBuMGZhSzRRSkJyM1BSNWJpSUo3Mmt4eTNJLXN1ZGhHRDl5bzgtMUZNSEZEOTNmd2ZoOTd3VDk1d2t2U28yVW56VktFTFl2TG1pVXZpUU43Mlg0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Australian boy, 13, swims for 4 hours to save family swept out to sea - CBC",
    "description": "Australian boy, 13, swims for 4 hours to save family swept out to sea  CBCAustralian teen swam hours to shore to get help for mother and siblings swept out to sea  CNN'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family  BBC13-year-old boy speaks out after swimming miles to save family stranded at sea  ABC NewsMother says asking 13-year-old son to swim four hours to save family ‘one of the hardest decisions’  The Guardian",
    "published date": "Tue, 03 Feb 2026 14:39:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA0YzdPMnFJbDBKVjNzTEFGTjZfeGVLTmk5b241NW0tUjZheFEtUkRlQ215QUxPdGs2WFdLaURDSTB5OEZYRmY1NGlxN09pQWZzeTAwY2h6TTJ4cHdPMl9RbmNmOEJYeC04d2xiSkpLMVNEeGNfdXkw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Canada updates Spain and Portugal travel advisory over serious risk - Daily Hive Vancouver",
    "description": "Canada updates Spain and Portugal travel advisory over serious risk  Daily Hive VancouverStorm Leonardo slams Spain and Portugal, leaving 1 dead and a girl missing  CityNews HalifaxRising rivers and deadly floods slam Portugal as Storm Leonardo hits  Yahoo News CanadaRivers and reservoirs close to breaching as Storm Leo pounds Iberian Peninsula  ReutersOne dead in Portugal, thousands forced to evacuate in Spain  France 24",
    "published date": "Wed, 04 Feb 2026 16:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOZVVKbldsUG9sOGp3cUZOWGNZWEVFZ2V0YXFfY0RZeWdoYVI4Zkh3SlluTGxZYkVnUEE1TnhFQm9UNE1HUFRqTXhGdlduLVJoZFlpS3VaajQ5b2k4OGVKTlhnVlB2WE15VkRTTzVNNVpfbnd4cE5MU1BUT1ZLVzB2cVQ0WnEzZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs - Al Jazeera",
    "description": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs  Al Jazeera‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  CNNSpain hits back at Pavel Durov over mass Telegram post on social media ban plan  The GuardianEurope Takes On Tech With Social Media Bans and Paris Raid on X  BloombergSpain looks to ban social media for under-16s, joining others in Europe  CTV News",
    "published date": "Wed, 04 Feb 2026 10:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcnlONWxoSGlTLVN1bWNOX2ZaekJnRWNPYkVReEJRRHpoQ2ZLVi1ibGlNZzg2cVZKckRpY0xlUzBkSjRsekRKcTNEeU5Xa2NwaHZhZjV2QTZNMmE5MHhMMV8wQjRZUmN2Q21XRm41dDJORFlpeEI2T2ZQbUJjQ0YxR05hVm4tTjFCeGRubEZXOF9mQzR2YVVrbjJVOW5LZzRrR0d6RkJtemxUaXdu0gGyAUFVX3lxTE1rSE92d0hQNG56QWlvNVA0S2doUU5Qd21JcGlsckpsX205b2FkYXFEbjdrTGVNYzBvdlI5S3NjZ0sycGVyUE1XYTJIS0lzV21vZlZrN2taOExiNGI1dXZ1T2FBN0tDcGtodmZOVXB4d3RZdzdLVTd0ZjNiLTBYQVpiamR3VUdJOEloSUJodHpXMk9Nd1BQLVRERmhBNUZxLVgzUmhlX2Z2WVkzZDN6aHJFNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela - NPR",
    "description": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela  NPRThe $100 Billion Bet on Venezuelan Oil Relies on a Broken State Company  The Wall Street JournalTrump Is Courting Chevron, ExxonMobil, and Others on Venezuela. What It Could Mean for Your Energy Portfolio.  The Globe and MailUS Plans to Issue License for Firms to Pump Venezuelan Oil  BloombergVenezuela approves new law opening its oil industry as Trump threatens more tariffs on countries selling oil to Cuba  CNN",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNLWlZY1c3ZUZXMGhrRmdzb0tqRDVTcWxHN3gtNk9wMVNWOWdZZUt1cXlSZFhwQy11cWk3V3cwdzhPN0xIMV9kRnZtY3YwcHVYMjRUajdPT1VyZjZNSDM5M1BsR0Z2NE5vNHhtTFcwdTI0eGwzM0Jhb3RHSWprMXEyak9FZWpqc2Q5SVlfaDQ4TFlCeGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Keith Kellogg on how Putin views Russia's war against Ukraine - The Kyiv Independent",
    "description": "Keith Kellogg on how Putin views Russia's war against Ukraine  The Kyiv IndependentOpinion | Vladimir Putin Isn’t Winning in Ukraine  The Wall Street Journal'Ukraine Is Not Losing, Russia Is Not Winning': Amid Push For Peace, Here's How Things Look On The Battlefield  Radio Free Europe/Radio Liberty",
    "published date": "Wed, 04 Feb 2026 15:02:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWHRrTGx0Um1rU0taTmdxMXZ3aVJJMGZSaWZnMHBXdi15V3NnVWthRmYzME5XR09kRm1NbDdCajNQdWNidTdwUDVQWlJkX1M0NzJDRUQ0QldDREh2dXc5Tjd2SWJNY2dRcmtLWEdNVm92RGhKOHFuUkY4bUJkYVBQTmtqelFTZXlnLXBFM2pyN0wtZmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Angelic face of Italian prime minister wiped from fresco - CNN",
    "description": "Angelic face of Italian prime minister wiped from fresco  CNNHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistAngel that looked like Giorgia Meloni removed from Rome church fresco  The GuardianAn angel resembling Italy’s Meloni is painted over after an outcry from church and state  CTV NewsChurch fresco resembling Italian PM has face scrubbed out after outrage  BBC",
    "published date": "Thu, 05 Feb 2026 11:46:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA4eWdoSU9COUVPNmZyQ1ExdnhjSWo4a1k3MWFjUlJWandIQS1NbGc4OTg0RTF0ZHprRi00ZTd4Q1hMQU1aeFVlQ1pIN3VTeXFwdlE3a0xDbE9UZmZUdzFTSy1qY0tseWRZckVmYU5SRy15dkdGNjgxdGxNdk1pcXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "‘Investigating child sex abuse isn’t controversial’: France rejects Musk’s charge after raid on X’s Paris office - Firstpost",
    "description": "‘Investigating child sex abuse isn’t controversial’: France rejects Musk’s charge after raid on X’s Paris office  FirstpostParis prosecutors summon Elon Musk after raid on X's French offices  NBC NewsX offices raided in France as UK opens fresh investigation into Grok  BBCFrench police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok  CBCCondemnation of Elon Musk’s AI chatbot reached ‘tipping point’ after French raid, Australia’s eSafety chief says  The Guardian",
    "published date": "Wed, 04 Feb 2026 06:43:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxPb3hvblNsVWp2TDRJZlYxNWlrNmNSdGN2Y2ZhaWVEMUdtcTE2Vy1HMC16ZG4zT1dmQWl5LUo2WGxFWTg4WHhsLThBeDJycVVYcVlyV2VWWnVZMmc1djFWUjBHX1pjNTlYeEQyU290RlpSTnBUOGlKNWlQREhNYzlpRU1IcTZJdFEtbGhmZUlYcDBwVWdPUUhBMVVOS3NaZ1huTHEyM21MbXpKaC1MVmQ5eEJxa3NBZU5rZjV0WjdBN3RFTWlCZFFyNW1MdUsyME90UTZzMUJIbkJmdHJ0TF9xMkxYSlRIYXB3X0R4bzln0gHzAUFVX3lxTE5zOVBnajdZYzJaX1VNZ0NHNmNBM1kzOG5WWGdZN0tMV2ZSaTlFcHZIeWZEeVZ5UTB5OU5zLU5nNXR5UmQ3RmJFVUo3T0U5bDNUOHBFUWoxOFV6Z1N0eHVzVGxCQ1RtQXlzU21LVWFrSmtLVmh5cHRRcnlIbzZyR0M3WWZqX3hhTFF0a0V0OVIwclhWbjVuMXg3NjNpeFhJdzNIZFpuemRNLXJ0WWpXRk5KSzEyUlJocVlremlMbU1iaGJGak5oME5XQ1plZi1IQjl3UF9BM2t1YXhMd2tBcVJpQjBwRzRtdjBWTlJQeGcwRS1aWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.firstpost.com",
      "title": "Firstpost"
    }
  },
  {
    "title": "Melania Trump Uses Event With Freed Hostages to Promote Her Documentary - Rolling Stone",
    "description": "Melania Trump Uses Event With Freed Hostages to Promote Her Documentary  Rolling StoneMelania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  CNNMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania Trump Gets Confronted About Ghislaine Maxwell's Prison Treatment  People.comMelania Confronted Over Plugging Movie During Freed Hostages Meeting  The Daily Beast",
    "published date": "Wed, 04 Feb 2026 21:57:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPdWdfR2dxVi1BVTV2TUh0TzFPdW9MdzEwWnNra0d0ZjZISktoaXc3czlyU3JNMUVKU1lJZjJaRXkwQmE5TUlDWWtHU0N5RlhYU0w1SU1iT1dYUUszekhCc29nTk9kbkkyTW5BZTdwOWNhN0xwdWtGa0FxUkxDb1V5Y3Rlc2Y0ajZkaC11OG9YaXRYbkp1MkdUWUJpNWZZOThRdWRvMmtyUW4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rollingstone.com",
      "title": "Rolling Stone"
    }
  },
  {
    "title": "Jill Biden’s first husband held without bail after being charged in wife’s killing - CTV News",
    "description": "Jill Biden’s first husband held without bail after being charged in wife’s killing  CTV NewsJill Biden’s ex-husband William Stevenson charged with murder in wife’s death  Global NewsWilliam Stevenson, Jill Biden’s Ex-Husband, Is Accused of Killing His Current Wife  The New York TimesWilliam Stevenson: Jill Biden’s ex-husband charged with murder in death of his current wife  CNNJill Biden's ex-husband Bill Stevenson charged with murder after 2nd wife Linda found dead  CBS News",
    "published date": "Wed, 04 Feb 2026 18:47:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNYnIwYng2bHZROHAtaVJhTkZuajFUREJtdWxHbG52dmlRelIxYUs2WkpYZmU0a2xRTF95RWM3a2VUSUZveDl1UVVlY1JISzFFdldSMXpnQlhmRkFiZ2Y2cUZDZlRibS1tUlB5X2hPOE9GQ0NIdm9TOGhHU0gzM1VMbThkcGROWlcta0NuMVE5c1YtSmVSaklOVmo4b09YSERHZG9QS21qS0IzSjA0QjVmdWp3dmFXVWd2UVM1WkhBUGFRVURpZzhXdHlYUnU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’ - Bored Panda",
    "description": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’  Bored PandaNorth Korea: teenagers ‘executed for watching Squid Game’ as regime wages war on K-Drama and K-Pop  Amnesty International UKNorth Korea executes citizens for watching South Korean TV, Amnesty report says  upi.com",
    "published date": "Wed, 04 Feb 2026 16:58:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFo2UzBlWFdZNkNRcHp0U1ZJNm1sQXVVc1E3d0ExbGQ0aHFwcUI4VVJuNk1yUW1CQ3VHSmZURlVUdk9uTjF2cVRqZ0w4bkpoQTZveUhoSXFXUDFLaVdHN0FMUzEzWHRvTFllZG5aWm9UNzc1UUdTTnJibGxvOGpoYjVXY280VlZmT29GaHF3RGdmSmE1RVU4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boredpanda.com",
      "title": "Bored Panda"
    }
  },
  {
    "title": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments - The Kyiv Independent",
    "description": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments  The Kyiv IndependentUkraine sees quieter night as Trump says Putin will not attack its cities  BBCZelenskyy calls on Trump to respond to Russia’s massive attack as talks resume in Abu Dhabi  Euronews.comPutin kept his word: Trump about energy truce  Українська правдаUS, Ukraine disagree on whether Russia following ceasefire  The Hill",
    "published date": "Wed, 04 Feb 2026 19:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaEd3RG9JSzV6YTZTcXUtM19WTjJqTkxuNVBLdXVqT290UG9CTXVsdDBCMmx0WTl6cFFkd25wWFBwRmZlQ0RMOWRIeUxsc0l6Yy1XU1ZVOWRiZTluTUNsYUJXZUt5aExLdk5CVHQ4ZF9jQVZncC1fNXo1NE1PcUVrRDBKZjFRZ0hmR1NHQWVRV24tb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Red hats sweeping the U.S. as resistance knitters embrace 'melt the ICE' pattern - Yahoo News Canada",
    "description": "Red hats sweeping the U.S. as resistance knitters embrace 'melt the ICE' pattern  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Tue, 03 Feb 2026 17:25:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1IUXU2Vk51NlZteHUxMEEtOVNJdURKRDYwSkFIZDRPeWxNcXp4NGFkYW5MYTA0QWlZeG5DbjdfaXh0T3d6clNXWEFTNlFISENpQURiZWZpcmFMbldYRmlCSFlwenR6Q2ZCejl6SktsSjZpMk5qTTNodC1KMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Trump has attacked pillars of democracy, says Human Rights Watch - Reuters",
    "description": "Trump has attacked pillars of democracy, says Human Rights Watch  ReutersTrump-led abuses amid ‘democratic recession’ put human rights in peril, HRW report says  The GuardianHuman Rights Watch warns US heading to 'authoritarianism'  Le Monde.frHRW urges pushback against 'aggressive superpowers'  France 24‘Aggressive superpowers’ are setting back rights progress: HRW  Taipei Times",
    "published date": "Wed, 04 Feb 2026 17:14:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOck1ZNlRrTW5lM21oUTBPT2R1YW9Zb25FYnUxYVB1RkhEbWItVjBLMWl4UWZVeDd3aGdLRGlxMWtGTGdCZktJWVJGTV9hVjFXRjg2ajkxVzZrUHVibHdaSTZuai15VzhsaEdEc2xGTEFsTDU0bjhubllPOUphN3lfTmF6cGtzcVBEU1poeXlDZGF1ZkUxUEUwTjhGekZ0MGxrbzBaSlRlZ2o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCFamilies suffer as Ukrainian engineers can no longer keep up with repairing infrastructure  Toronto StarThe Assault on Ukraine’s Power Grid  The New YorkerRussia pressures Ukraine with strikes, leaving cities in freezing temperatures  France 24",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]