[
  {
    "title": "Savannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video - Global News",
    "description": "Savannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video  Global NewsAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZPolice to give update on disappearance of Savannah Guthrie's mum Nancy - follow live  BBCInvestigators Return to Nancy Guthrie’s Home In Renewed Search for Savannah’s Mom  TODAY.comWhat Savannah Guthrie's video plea may reveal about family's strategy in trying to bring mother Nancy home  CBS News",
    "published date": "Thu, 05 Feb 2026 13:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQM0EwVWRKTFVRTUNPM1RVYTZ0VkF0UFp0VDVPVlRjaDFoUkVZUHlHUDZXRHE4WG1SUFZiSXYtUjZDYlMyZ1hsa1FHdWFaS0VESjN5aGxfTTV6YzliMkRWS0tmX21YLUMyT3hxXzBfRnNYaGtGV21peE15NkEtZWRrVk5hM1phQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "US and Iran agree to hold nuclear talks in Oman on Friday - BBC",
    "description": "US and Iran agree to hold nuclear talks in Oman on Friday  BBCLIVE: US, Iran struggle to find common ground ahead of talks  Al JazeeraU.S.-Iran nuclear talks back on after Arab leaders lobby White House  AxiosMissiles, uranium, stockpiles: thorny issues on the Iran talks table  France 24What to know as Iran and US set for nuclear talks in Oman  CityNews Halifax",
    "published date": "Thu, 05 Feb 2026 14:10:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1YWEpXaXY0UkdwR05rM0FLZElzZmpKd3dRek9BcFNTSGkwSW5MRFF3cHktcmRUWTQyaTlnaEU3ODJDM05IZ1V6VEdKOHRTM0ZBd0IwYU9YN2Fqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Keir Starmer apologises to Epstein victims for believing Mandelson's 'lies' - BBC",
    "description": "Keir Starmer apologises to Epstein victims for believing Mandelson's 'lies'  BBCCould this be the beginning of the end for Starmer?  BBCIs this the end for Starmer? – The Latest  The GuardianBritish PM Starmer apologizes for appointing Mandelson, but says diplomat lied about Epstein ties  CBCUK’s Starmer didn’t know Jeffrey Epstein. But the PM’s job is under threat  Toronto Star",
    "published date": "Thu, 05 Feb 2026 16:51:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1FVi16ZjJhX1JnT3JmZ3ZRNERjNzMzUE43UTJ1d2haWDZNZlJnRExtYUhXZUtoWjl2b2NzalFrS2N6R0I3LTdCV3kwSzMyekRfS0k0RkVJMmVZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says - The Globe and Mail",
    "description": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailAnand visits D.C. as Trump administration makes case for critical minerals trade zone  Toronto StarThe Latest: Trump administration looks to rebuild critical mineral supply chain  CityNews HalifaxTrump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China  BloombergUS, UK, EU, Australia and more to meet to discuss critical minerals alliance  The Guardian",
    "published date": "Thu, 05 Feb 2026 02:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcDJaN1A4UFF3VHJ2QjJJeE4zTVMtSUNadFBqTHVvZmxLdGRUZTIyVjBZWmhpWlNpMkJxUzRIX1otMHJvTVRiYXdYWVUtVDJHWEQ1Y1RDOWtGRTh6SmtVdk9yMjh3UW5pb1ZqZTBJSmhmb3k3aXdjRUZEQ00xZi1FelhBOGx1dC1YQkJxTi03NmI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Trump’s border czar pulling 700 immigration officers out of Minnesota immediately - CTV News",
    "description": "Trump’s border czar pulling 700 immigration officers out of Minnesota immediately  CTV NewsTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsWatch live: White House holds briefing after Trump signals ‘softer’ immigration moves  The HillU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBCVideo: Trump pulls 700 immigration agents out of Minnesota, but thousands remain  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 19:14:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNdnUxVTRGNzVCUktobVFWTjdxQ2tGdmFwbFl5S0h6RmhWQ3RRS1YySEpSbWFrTHhHYWRkbnZBYXVhNTJFUFVBcmtnZ1lLNGplcHBTdmRSVFh2R3pPaE1GV0gtaGlEalgxd1lwU1lQV2NpcVh2SnhzV09YWUZxS2xDVmpoWFVPeEYwVjJrbEFIaXp2MjZsejZV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape - Reuters",
    "description": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape  ReutersSon of Norway’s crown princess ‘does not remember’ taking videos of alleged sexual assault  The GuardianStepson of Norway’s crown prince denies drugging alleged rape victim  CTV NewsWhat to know about Norway’s royals as crown princess and her son face new scrutiny  CityNews HalifaxSon of Norway’s crown princess arrested on new allegations ahead of his rape trial  AP News",
    "published date": "Wed, 04 Feb 2026 13:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNemhDRHpyYVVyVFFkeks3akdpMkhNb1p1cG83cmI4Q2J0bnh4elE3TXBWNlZfeVRPZ3NaMklGMHBjWTlkRTlfSHlRM1JtS0w1XzlvSV9nVHdPOU9rOU1GM2VxWWFrM0ZaNVdrU2RTZ3RndURvaUNuUWg0cUZ1M1RjWGdBRXZOZ3EtRGJhNnFwVmVwSU9YWnkwQ29iX3Z6ZGhlUkVXNFBKb2pmRURrdWppTFF3cjRmSWdXWEtGMGNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’ - Toronto Star",
    "description": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The GuardianWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBCWestminster Dog Show 2026 Live Updates: Latest on Best in Show and Group Winners  The New York Times",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNTmE2X1hMNzJnbEJUV2h3bVVrOGZyVXUxX2NwakN5SW5fZFpobHNyOXVxdUYxODc3dElTWkwwR2xWRGdGYnFnMFVocEEwTDU2bVBqeGxDTFVpcmVmVXlrMDZmbkZLWWZJOUgzQ05iSlJodDRSWWJ3VHJkMDFZVG5tbEdLMndCSTIzR1ZsaXR0bEZFczF3dXVDWE9oakxjOV9MUG9vZ2d3QU52aWpzYmFmc1ZJVWtZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Russia-Ukraine talks conclude without breakthrough on ending war - Al Jazeera",
    "description": "Russia-Ukraine talks conclude without breakthrough on ending war  Al JazeeraU.S., Russia agree to re-establish military-to-military dialogue following Ukraine talks  CBCRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBCRussia-Ukraine war updates: Over 310 prisoners exchanged amid talks  Al JazeeraUkraine, Russia agree to prisoner swap on second day of U.S.-brokered peace talks  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 17:02:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQ3hXQ0UxclI5b00ybDM2bmw2VVRJVWc1SzJveF96X3N2d1lLU0dxVEVGdUlwSS1MbFUxb0NhLTZxRDd2Umg0Tm4xcDA5eHBGRXJnRmZPWlZLWlhOVzA4cDhZN184SlAxcTlkeDFWZTU0Mkw0YVNsWk9VRlBVcHRXTFM5aFpyMmxsdGdfbjF3ZDJCbExnOW1zVlZzcEfSAaIBQVVfeXFMTjdNalczeDlOckFsWGJ4Z1NUN3R6TGZEVUU4eWtRMzVtdlVQYzBfSjRpWDNabnlDcFE3cnM4ZjhxQWw4TmEtYm8tNmtqdHhsZnVxUnA5ZnhDMTUxWDlyX0tGZGkyakhXbEwwOWVobXo1dzZuTXY4SFFhR1hCTjdRVkVNOEYyVkxOQVRjRHB1aDNhNmxKV1BTWDlSQWJuUDM4QzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty - Reuters",
    "description": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty  ReutersLast Russia-US treaty on nuclear arms control set to expire  Al JazeeraUS-Russia nuclear arms treaty expires as Trump looks to include China  ABC NewsA key nuclear weapons treaty is ending. It’s a blow to Russia’s ‘superpower’ myth  CNNLast U.S.-Russia pact expires, removing caps on largest atomic arsenals for first time in half-century  CTV News",
    "published date": "Wed, 04 Feb 2026 18:22:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNX3hYcjVUbFlORl9hVlBzckRITkxLNnJQNzhwU3AxRUFxSmdLQ085TmxOOHN2QnNPZVEwdnBzTGdMZHl1empjZzN6My1kdkdjZGZRaXJOYl9SbjYwd0dscjR0ZnRFc09MS3ljRmxkb0RPbDMwa2I0U2xyVHdVcXFZN2ZCTWhNUTRMYV9yNkVkVFZRMlFsQmppX3R6X05lTXA2b3hybW9qY2ZMbXJjeHNRb3htUC1wenU5U2lBZ29oN3owazVRN2ZF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Attacks on civilians in central and northern Nigeria kill nearly 200 - CBC",
    "description": "Attacks on civilians in central and northern Nigeria kill nearly 200  CBCNigeria sets up new military operation after deadly attack, while abducted Christians return home  Toronto StarDozens of Muslims 'massacred' in Nigeria for refusing to join jihadists, says governor  BBCNigeria sets up new military command to slow spread of Islamic militants after deadly attack  CityNews HalifaxDozens die in Nigeria's deadliest attack in months - Eye on Africa  France 24",
    "published date": "Wed, 04 Feb 2026 18:54:34 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE41dEtTMEVZOV9nbzIxVjh5Vld4MlF6Y01VNV9aWXRxUTAzN3VReVIwMkZZRlpBRDM0bG5Fd0ljQkoxSk1JUm1qd0l5TGxMelhlM1FMQzVjUHhjMUkzaEtaNUVCS2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Israeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire - BBC",
    "description": "Israeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire  BBCIsraeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCThe Gaza ceasefire began months ago. Here’s why the fighting persists  CTV NewsVideo: Israel strikes on Gaza kill at least 24  The Globe and MailIsraeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 13:27:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ORzhkYmNPZHZvVXBZMFhxYm9kNXcxZWdlSTBtTXF0TDlMZHlGOGdwOXNhakFkeEtmenZ3Sjd0VXJndG1XaVZ6a0FHeFN1dTFuMEdOemllMmE1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - Castanet",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  CastanetView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 04:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOaVJsb2RzeFVFNjUtZ3R0Ri0zV0ZicWY5b25sN2o4MVA3a2tSVGk4Q2ZVVC12M0VSa01OZko5d1J2ejBQcnB6YkdaTE1qTktvTXBvWTIwWGpFTEVWNFpDczVCUFl5aV9FQjZrQWFyWHFjSzVvU1NPQ3hfcGNRbTBEMWcxNVpPZ3VjSVlKc2dXVzFzNHc3eVBPZzd1Y0tlaGgtNVhsY0VQMjFyZzVuS01HekdNUjdoMGpPNGV1U3lkVGZwck96aTQ5T2lrMkFHS3gzenFkZUJ0LTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Supreme Court lets California use new Democrat-friendly congressional map - CNN",
    "description": "Supreme Court lets California use new Democrat-friendly congressional map  CNNU.S. Supreme Court green lights California pro-Democrat redistricting voting map  CBCSupreme Court allows California to use new voting map boosting Democrats  BBCUS Supreme Court rejects challenge to California redistricting map  Al JazeeraSupreme Court Clears Way for California Voting Map  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:24:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOa1pVR3NqN0prbzFCdnMyNlllQ3AwMGpxbXRMQm85YnJiaEhkemhocDZ4RmxTOFdHN3FkRFM2RjdCYk5iMW1DQnJQQk8wUGtMVVB6Z3ZpMjVCUF9lLUJDOUU2bmozMmgwSjFHdWQwalMzQVhnb0pwcVpDVXc0cUhTRmx6a3dCN1B4NVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Gazans returning through Rafah crossing describe checks by Palestinian militia - BBC",
    "description": "Gazans returning through Rafah crossing describe checks by Palestinian militia  BBCRafah crossing between Gaza and Egypt reopens, with strict limits  Radio-CanadaReturn through Rafah: Palestinian women recount Israeli interrogation  Al JazeeraPalestinians wait at border between Gaza and Egypt as uncertainty clouds reopening of Rafah crossing  Toronto StarWomen returning to Gaza say Israeli troops bound and interrogated them after Rafah crossing  CityNews Halifax",
    "published date": "Tue, 03 Feb 2026 18:31:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBDanlNV29iTlVhVElSNWYzYmxhUTFhY2ZCN2dNTHYtQjg5NzQwUEtOallaSjE5X0dsblJJOFh0Q24wRTNSalBLdkJFRGQ3NmN0VE9iaXVhR2JGdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Cuba travel warning doesn’t shake Windsorite’s plans; Support grows for those facing shortages - CTV News",
    "description": "Cuba travel warning doesn’t shake Windsorite’s plans; Support grows for those facing shortages  CTV NewsNew Cuba travel advisory urges 'high degree of caution.' Should Canadians worry?  CBCSome travellers are still going to Cuba, but they’re managing their expectations  CTV NewsCanada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’  Toronto StarPlanning a March break trip? New warnings for Canadian tourists travelling to Cuba  YorkRegion.com",
    "published date": "Thu, 05 Feb 2026 10:11:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOM0NuM3lJSmMyZFlLb200SjRUd0Nhc2dnbXF3aW5XSHhHUy10RHpmT3BfOHRfbmJQQjJQaGNRcUk3cDNjczY2ZmRSYk8zUHQ5Nm5GU2xBaVNKMjJELUtUS0lOeVFJNmxqUEthTEo2UGxlUHRSQVlrbUt0N0lMVlRYTnVCNU8xNnNDcGc2bHBkMUNNcnZLYjc0clM3RjVXOXozVkc5Um5UMktqdFpWWFhoLVl1aWJGVnI5clNScjctTVhNTDJ4bHdNQUh4MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Arctic Fever: new exhibit finds 19th-century parallels to Trump’s Greenland obsession - The Guardian",
    "description": "Arctic Fever: new exhibit finds 19th-century parallels to Trump’s Greenland obsession  The GuardianHere’s How the U.S. Accepted Danish Control of Greenland 100 Years Ago.  The New York TimesGreenland and U.S. territorial purchases  North of 60 Mining News",
    "published date": "Thu, 05 Feb 2026 14:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5CV3AxTzNibk14NVJBZHN3MGNVdUFRUW5GN1ZVdUtBSTJLYTM3T3otbzJ1aWhOcmxNYVpuSTYwWnJoMUtUYmVEazBSM3BLdHpjRVhzQ001b0hjVmRURnBuMWp6SXM4RzRzZ3MtRG44Skx3c2s5TnBUVlJwdDE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Son of late dictator Gadhafi killed in Libya - CBC",
    "description": "Son of late dictator Gadhafi killed in Libya  CBCSaif al-Islam Gaddafi, son of ex-Libyan leader, killed, say officials  The GuardianKilling of Saif Gaddafi removes alternative to Libya’s rival governments  Al JazeeraLibya's Saif al-Islam Gaddafi, who crushed dissent then sought political comeback, dies at 53  ReutersSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.fr",
    "published date": "Wed, 04 Feb 2026 09:55:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPbUpVZXhJQ1FhTWsycVdlbVZvd0ZjWmF1RjI2M2wxWVZ1SnlMQWo1TF9ka2lyeUoyM2o1ZFBybXdwNk5CcGhsYXhCbHN3YWV1RTIxaXVZZXZqZDRyTTdodVhMYzRQMDdqdnlqRGJjZG5IQlF0c3hlLVFJNHhFUi1Ec3FQOTEyblhZS2hZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots - The Globe and Mail",
    "description": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots  The Globe and MailLatest on the Trump administration: Democrats and Republicans sharply divided over DHS funding  CNNTrump offers revised account of Tulsi Gabbard presence at FBI raid in Georgia  The GuardianFulton County fights back after the FBI seizes 2020 ballots | As It Happens | On Demand | CBC Listen  CBCTrump says Bondi directed Gabbard to attend Georgia raid  Axios",
    "published date": "Wed, 04 Feb 2026 19:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZzlTUVU3aExkTFJLTWlfR3ZBejVnNVU1Mm9QMWlicUJqelZJWFI0ZlVkblJhMDBrenlva2Njd1p4RjRaSUxmN25CcTRHTTZSbkxITEJNb1dmdkJtd0dYaUxXbVBKb1Bqd0pHT2lwWk14cmlPQnA0c1ZMeDZjOFJ3T2ZJM0JUNy1KcGY3Ym1HcXNHX21hTzVjUC1UMnBPc3VjWGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Fifteen migrants dead after collision with Greek coastguard boat - BBC",
    "description": "Fifteen migrants dead after collision with Greek coastguard boat  BBCGreek doctors work to identify parents of injured migrant children after deadly boat collision  Yahoo! Finance CanadaMigrant deaths off Greek coast raise questions over quick official accounts  BBCDeadly collision between Greek coast guard vessel and speedboat carrying migrants  MSNCollision between migrant speedboat, Greek coast guard vessel leaves at least 14 dead  CP24",
    "published date": "Wed, 04 Feb 2026 11:59:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA0S2dQT0FUVlJtalM1RE84aFloNF9tYlFDSnFoa01iMjB2Y01sMXcyMmFnZ25nWDFrVnFlTXZocklmR04xNG16Ujc5TV9uZ3VKb09QTW9sV0NKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US says it shot down Iranian drone flying towards aircraft carrier - BBC",
    "description": "US says it shot down Iranian drone flying towards aircraft carrier  BBCIran risks Trump's ire with new diplomatic demands, provocations  AxiosU.S. shoots down Iranian drone along Arabian Sea, military says  Global NewsTrump says talks with Iran continuing as US shoots down an Iranian drone  Al JazeeraUS shoots down Iranian drone approaching aircraft carrier, official says  Reuters",
    "published date": "Tue, 03 Feb 2026 18:45:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5BVTJ6RGFxVUZpZEh2NGlRenk4c3hOWkdkVUVLVFhwLW1TeTQwQjRvOERVNXhhYUI2TU9VUHp0UzVxcXRVZG1SVV9kckJpTzBYSTU2ajc5OVRwZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack - The Times of Israel",
    "description": "After crushing protests, Iran’s supreme leader Khamenei looks to avert a US attack  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  CNNDonald Trump wants to end America’s half-century conflict with Iran  The EconomistU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street JournalOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBC",
    "published date": "Wed, 04 Feb 2026 17:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOYUd2cnExc1BUZnplc1BuSE0tMENOaFBoQktsUVIzT2tjVF9Od0QyZ1RJMUFVRFNTLVBMX2ZCMDd2QXE2Qk5lWkItXzBkaU1MQ2FkeHZFWlBYenh6Q3k3VFJKVkpFUmlsRVBxSlVNS0Vld1VSZlNEVmxJS1FZOVBKN0F6QWl0RE5OZ28zeUJZMHduVWw1dXI2d3VsekVfZ041em1RLUdsNWdqekZlel84ONIBtgFBVV95cUxPaWpnQlpoZmItYl9TTS1yQVBleE1HMUctcFJPU0d5d3Z3TWpsOVpHZVMxcDdSa3FfMkZyeG1RNTdkaXBJSExwbS1Eczg4TVdoRFBXY1BKeGhVZnVxM2hFUDNSTVFFb0pfT3NzUUpFVXdFdjQzOXNualUzWmtVZnlXeHlCcHBqU25zdjhKSlVtMWMyYzc3amhMOEZ0c2VEc3hEblI2S1lhTlJqODExNUNrdzkzVG4xUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "What the US-India trade deal really means - Asia Times",
    "description": "What the US-India trade deal really means  Asia TimesHope and uncertainty as India and US strike long-delayed trade deal  BBCCNBC's Inside India newsletter: The facts — and frictions — of the U.S.-India trade deal  CNBCIndia Says 18% US Tariff Rate to Kick In After Joint Statement  BloombergModi, Trump announce India-US ‘trade deal’: What we know and what we don’t  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 04:39:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1kOVhjdFNId0daZ2VLRzlsMnB1UEVxYWEwWFpqenZaTi04TTlYY19zWHFRT3BVSTdPRkdPVjBGeHVCM0hQTjR2dmROTmI3WEpaejZZZ09lX0lMUlV2TldiUnF0ZGZWQ3RvVmRiVVc5OHRacHNBTlZKSXVmanQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://asiatimes.com",
      "title": "Asia Times"
    }
  },
  {
    "title": "Canada updates Spain and Portugal travel advisory over serious risk - Daily Hive Vancouver",
    "description": "Canada updates Spain and Portugal travel advisory over serious risk  Daily Hive VancouverStorm Leonardo slams Spain and Portugal, leaving 1 dead and a girl missing  CP24Rescuers contend with fast flowing river in search for woman swept away during flooding in Spain  Yahoo News CanadaNew travel advisory for Canadians heading to Spain and Portugal  blogTOOne dead in Portugal, thousands forced to evacuate in Spain  France 24",
    "published date": "Wed, 04 Feb 2026 16:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOZVVKbldsUG9sOGp3cUZOWGNZWEVFZ2V0YXFfY0RZeWdoYVI4Zkh3SlluTGxZYkVnUEE1TnhFQm9UNE1HUFRqTXhGdlduLVJoZFlpS3VaajQ5b2k4OGVKTlhnVlB2WE15VkRTTzVNNVpfbnd4cE5MU1BUT1ZLVzB2cVQ0WnEzZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Trump says states are agents of federal government in elections - CNN",
    "description": "Trump says states are agents of federal government in elections  CNNTrump ‘openly talking about rigging’ election: Democratic governors  The HillTrump news at a glance: Democrats sound alarm after president mulls election takeover  The GuardianNew Trump Controversy  AGF PerspectivesTrump Repeats Call to ‘Nationalize’ Elections, as White House Walks It Back  The New York Times",
    "published date": "Tue, 03 Feb 2026 23:45:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9lVnRKTmswSmdIbEdBQ0k0NWo4R1FrU3NOVVlqMnVmdTNVWjUyX3NsUkZNMEdDdGhrR3NISFYwYnFNVUNWbEtUZWNiLWdQUFg2OF9aa0ltS29QMEJiSDVIak9wVVBKdThGc0JSekN4bUkxdGttZjZ3Unl3c1lmbEU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela - NPR",
    "description": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela  NPRThe $100 Billion Bet on Venezuelan Oil Relies on a Broken State Company  The Wall Street JournalTrump Is Courting Chevron, ExxonMobil, and Others on Venezuela. What It Could Mean for Your Energy Portfolio.  The Globe and MailUS Plans to Issue License for Firms to Pump Venezuelan Oil  BloombergVenezuela approves new law opening its oil industry as Trump threatens more tariffs on countries selling oil to Cuba  CNN",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNLWlZY1c3ZUZXMGhrRmdzb0tqRDVTcWxHN3gtNk9wMVNWOWdZZUt1cXlSZFhwQy11cWk3V3cwdzhPN0xIMV9kRnZtY3YwcHVYMjRUajdPT1VyZjZNSDM5M1BsR0Z2NE5vNHhtTFcwdTI0eGwzM0Jhb3RHSWprMXEyak9FZWpqc2Q5SVlfaDQ4TFlCeGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs - Al Jazeera",
    "description": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs  Al JazeeraSpain hits back at Pavel Durov over mass Telegram post on social media ban plan  The Guardian‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  CNNEurope Takes On Tech With Social Media Bans and Paris Raid on X  BloombergSpain looks to ban social media for under-16s, joining others in Europe  CTV News",
    "published date": "Wed, 04 Feb 2026 10:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcnlONWxoSGlTLVN1bWNOX2ZaekJnRWNPYkVReEJRRHpoQ2ZLVi1ibGlNZzg2cVZKckRpY0xlUzBkSjRsekRKcTNEeU5Xa2NwaHZhZjV2QTZNMmE5MHhMMV8wQjRZUmN2Q21XRm41dDJORFlpeEI2T2ZQbUJjQ0YxR05hVm4tTjFCeGRubEZXOF9mQzR2YVVrbjJVOW5LZzRrR0d6RkJtemxUaXdu0gGyAUFVX3lxTE1rSE92d0hQNG56QWlvNVA0S2doUU5Qd21JcGlsckpsX205b2FkYXFEbjdrTGVNYzBvdlI5S3NjZ0sycGVyUE1XYTJIS0lzV21vZlZrN2taOExiNGI1dXZ1T2FBN0tDcGtodmZOVXB4d3RZdzdLVTd0ZjNiLTBYQVpiamR3VUdJOEloSUJodHpXMk9Nd1BQLVRERmhBNUZxLVgzUmhlX2Z2WVkzZDN6aHJFNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Keith Kellogg on how Putin views Russia's war against Ukraine - The Kyiv Independent",
    "description": "Keith Kellogg on how Putin views Russia's war against Ukraine  The Kyiv IndependentOpinion | Vladimir Putin Isn’t Winning in Ukraine  The Wall Street Journal'Ukraine Is Not Losing, Russia Is Not Winning': Amid Push For Peace, Here's How Things Look On The Battlefield  Radio Free Europe/Radio Liberty",
    "published date": "Wed, 04 Feb 2026 15:02:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWHRrTGx0Um1rU0taTmdxMXZ3aVJJMGZSaWZnMHBXdi15V3NnVWthRmYzME5XR09kRm1NbDdCajNQdWNidTdwUDVQWlJkX1M0NzJDRUQ0QldDREh2dXc5Tjd2SWJNY2dRcmtLWEdNVm92RGhKOHFuUkY4bUJkYVBQTmtqelFTZXlnLXBFM2pyN0wtZmM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Elon Musk Responds To Police Raid On X’s French Offices: ‘This Is A Political Attack” - Deadline",
    "description": "Elon Musk Responds To Police Raid On X’s French Offices: ‘This Is A Political Attack”  DeadlineX offices raided in France as UK opens fresh investigation into Grok  BBCFrench police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok  CBCParis prosecutors summon Elon Musk after raid on X's French offices  NBC NewsCondemnation of Elon Musk’s AI chatbot reached ‘tipping point’ after French raid, Australia’s eSafety chief says  The Guardian",
    "published date": "Wed, 04 Feb 2026 10:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVUJsallBNWExNVY5TU1DQTF6aVU1MFZ6SWRQWWYxdjlSd2hzUFZ6RzIwSnFXQzlDalFIWk9wZFU1ck8zNGVnVS0xMWZ4b3R4WlB1TFEzWFJJcU1RR3NrZzBhanBYMDFKdnYtY3NiTVRScnFlNG5CQ3dsczFSNTRWS3lCZjFaV1R3YTh3YkNReWR2OHFCSTRqd2JR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://deadline.com",
      "title": "Deadline"
    }
  },
  {
    "title": "Angelic face of Italian prime minister wiped from fresco - CNN",
    "description": "Angelic face of Italian prime minister wiped from fresco  CNNChurch fresco resembling Italian PM has face scrubbed out after outrage  BBCHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistAngel that looked like Giorgia Meloni removed from Rome church fresco  The GuardianThe angelic Meloni behind a fresco fiasco  Financial Times",
    "published date": "Thu, 05 Feb 2026 11:46:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA4eWdoSU9COUVPNmZyQ1ExdnhjSWo4a1k3MWFjUlJWandIQS1NbGc4OTg0RTF0ZHprRi00ZTd4Q1hMQU1aeFVlQ1pIN3VTeXFwdlE3a0xDbE9UZmZUdzFTSy1qY0tseWRZckVmYU5SRy15dkdGNjgxdGxNdk1pcXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Russia jails stand-up comic Artemy Ostani over war joke - Al Jazeera",
    "description": "Russia jails stand-up comic Artemy Ostani over war joke  Al JazeeraRussian Comedian Accused of Making a Joke About Veterans Gets Prison Time  The New York TimesRussian standup comic sentenced to almost 6 years for 'anti-war' jokes  Yahoo News CanadaRussian comedian jailed for nearly six years over war veteran joke  ReutersStand-up comedian gets nearly 6 years in Russian prison over joke about war veteran  CBS News",
    "published date": "Wed, 04 Feb 2026 19:06:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOOGlqQ014cEpaTHg0MjNlNHlSYmVqX2VsOXkyVE9rR0kwMVNiXzdRam5NZGVnZmRubmtObjhadWZnQ0RpNi1Lb2NyMEJrSXRZVER4WndZdGwwMzVxN1JqdmxYNXBjZzJJQkFNUkUtQV9HbHprOG5Rdl9Fc1MxNW9QY0ZRZERpdkJmdTNjYUcwLVoxUlZMMTZKUDJIa9IBoAFBVV95cUxQbjRDTHhqNHJBdUdCSS1XTDQ1Q2taYzRtRUpQaUIzQ3RTQ25IRlpXWVBTNVdoWXpPaVpvejhpOTNtc3hfN01YZU1xc0w4bkJLUXIzczZvWnUyRW5zRE1JYkNJb3dnNjNfSlM2cmRfVVRGNWduamNyZUNfWXBORVc1SmU3bXhBYVY4YW9wakJmSVFNdEJpNVpkUFBfY2NvdUtD?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Man once married to Jill Biden held without bail after being charged in wife’s killing - Castanet",
    "description": "Man once married to Jill Biden held without bail after being charged in wife’s killing  CastanetView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 16:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObVZzQUk0Vy1rbVp1VVVGWVhjZEJ0TC01Z19aVEg1MFI3ekw3cmZZa0tUNjYxZ2ZsS2J5dFJ2Yl9wVkZKR3FHaDdJVEl6MHNHczZqdmItN1JUSzgyWi1EeDBmV094ZWZtSzlLN2MzamhMLWJEVzVYa2huN3g4djVBcWpibWcyaUdWR2J0TURVMXRsOVl3bE5kc2thbTVaT0QxTHVReVhYbThTWUdia0VUcGRYQnJkZ2IyWDROV2dvNURwMUcyY0RiTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "North Korea 'executes children in public for watching Squid Game and listening to K-pop giants BTS' - Daily Mail",
    "description": "North Korea 'executes children in public for watching Squid Game and listening to K-pop giants BTS'  Daily MailNorth Korea: teenagers ‘executed for watching Squid Game’ as regime wages war on K-Drama and K-Pop  Amnesty International UKNorth Korea executes citizens for watching South Korean TV, Amnesty report says  upi.com",
    "published date": "Wed, 04 Feb 2026 00:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNSkFHRTFFbkljaUJxWElkQVpQNjNnUE5SbXgyRHIwemg4N3lIWWl4aDVhaG5MbEV1TmVqWnBWTEV1bXpsODlyc0hLQWJIZnpyS0xIRGM3Q2t1LUhZUlI0NFAwV2pUZUY3SWRDWWNwUFMwWmdNUkFPTnVIQUJMVHBONkstR1FDX2JIZEh5U3ctdjJGbHNGTzRtamwzTTIyRWcxMzJsOTdBYVdubUJDOVhNMXdYNk5qdVVmazJuRXFYWWdWcFFfM2fSAcsBQVVfeXFMT3EzTFllZnBMNTduWU5mcnF3NHJLUDMzaFpYR012ZVJvMjBDUHVfR19jQS1icU9LWnZVYVF0ODFsWW1ub1ZZOTd1dWFic2tMYVVPYVEtajc0T1Rwalc4ZjVJRmVxM1hfbFlNd3p4SzVnYnp5WjA3eFc3aXcwa2FWV201cHFQZFVFM1c1b2NGWDFmM2FPSTg1bEk4ZXBKU1N6NDJnMXZra1dTdFBSeE9xZTQyRk1aWHE4UmtFTGRzcXlFVHhSRXRRRW9jMzA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dailymail.co.uk",
      "title": "Daily Mail"
    }
  },
  {
    "title": "‘Especially concerning’: New study links tobogganing with head injuries - CTV News",
    "description": "‘Especially concerning’: New study links tobogganing with head injuries  CTV News",
    "published date": "Tue, 03 Feb 2026 21:00:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNNm0wZ2pYdVFYZ0l0U1ZvcW1KT29rNUI4TlFqdUI5OXlJRXhwOWJud3RwRld2bWlZVjU2RGZKWTZva0FXSnhCZ3pGcUpEX1RLWWJQZmJBZGhsdmw2QUtFZmVSb040TnpHYWVLODNfTWRWWlpHUTVSYjNPQXVxa3ZUWlBkRU4yTU9Pc0hMZDF2Tm1UNmFZWExvR0VNcEJBeUpmbWNVcG5KLVRSLUZmUWN0eWZ5bVR4bDNZUkNIQndLTWY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’ - CNN",
    "description": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  CNNMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania Trump Gets Confronted About Ghislaine Maxwell's Prison Treatment  People.comMelania bristles at Epstein question when confronted by reporter at event to honor Israeli hostages  The IndependentMAGA Melts Down Over ‘Ghoul’ Reporter’s Melania Question  Yahoo News Canada",
    "published date": "Wed, 04 Feb 2026 23:03:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTnZfUEtLV2tYNHZhMWpKUEJYdTU1Z0xveFhuZWV4OTgxdHRGcE9PaTA1X0hQbkNpNHZsTHVTZ1FDdHZRd2xlTGJCN25OQWtieVh1bEYzMFlNWTllN0dnT092Vzc2bjJUWkVwWGlPRGhxOHZ3YlJZOVNZVWY3VGZqdHdITmlvYVVkYzdOOUdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Tube fare-dodger jailed for attack that caused bleed to brain - BBC",
    "description": "Tube fare-dodger jailed for attack that caused bleed to brain  BBC",
    "published date": "Wed, 04 Feb 2026 18:19:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9sVXRIdHRDOU5ZWkcwMlVQcEQ4S2xFY2hpODdMUi1PYXJSVER0RUlJLU5EN2lJQzMxRkFYeDZjSjdMRGNtLUVyTFl3UVA1b0VOd1RlMTdYYVdkZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments - The Kyiv Independent",
    "description": "Kyiv groans a collective ‘WTF?’ to Trump’s latest Putin comments  The Kyiv IndependentUkraine sees quieter night as Trump says Putin will not attack its cities  BBCZelenskyy calls on Trump to respond to Russia’s massive attack as talks resume in Abu Dhabi  Euronews.comTrump: Putin kept his word on pausing bombing Ukraine  politico.euUkraine passed detailed information to US about Russian strikes during \"energy ceasefire – Ukraine's ambassador  Європейська правда",
    "published date": "Wed, 04 Feb 2026 19:32:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOaEd3RG9JSzV6YTZTcXUtM19WTjJqTkxuNVBLdXVqT290UG9CTXVsdDBCMmx0WTl6cFFkd25wWFBwRmZlQ0RMOWRIeUxsc0l6Yy1XU1ZVOWRiZTluTUNsYUJXZUt5aExLdk5CVHQ4ZF9jQVZncC1fNXo1NE1PcUVrRDBKZjFRZ0hmR1NHQWVRV24tb2M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Trump has attacked pillars of democracy, says Human Rights Watch - Reuters",
    "description": "Trump has attacked pillars of democracy, says Human Rights Watch  ReutersView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 17:14:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOck1ZNlRrTW5lM21oUTBPT2R1YW9Zb25FYnUxYVB1RkhEbWItVjBLMWl4UWZVeDd3aGdLRGlxMWtGTGdCZktJWVJGTV9hVjFXRjg2ajkxVzZrUHVibHdaSTZuai15VzhsaEdEc2xGTEFsTDU0bjhubllPOUphN3lfTmF6cGtzcVBEU1poeXlDZGF1ZkUxUEUwTjhGekZ0MGxrbzBaSlRlZ2o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCFamilies suffer as Ukrainian engineers can no longer keep up with repairing infrastructure  Toronto StarRussian attack leaves 1000s in Ukraine without heat in -20C  CBCRussia pressures Ukraine with strikes, leaving cities in freezing temperatures  France 24",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]