[
  {
    "title": "Savannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video - Global News",
    "description": "Savannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video  Global NewsAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZDay-by-day timeline in the search for Savannah Guthrie’s missing mother  CityNews HalifaxAuthorities investigating Nancy Guthrie's disappearance say they're taking ransom notes seriously  CBCSavannah Guthrie’s mom 'taken,' sheriff says; blood drops are found and ransom questions raised  Los Angeles Times",
    "published date": "Thu, 05 Feb 2026 13:32:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQM0EwVWRKTFVRTUNPM1RVYTZ0VkF0UFp0VDVPVlRjaDFoUkVZUHlHUDZXRHE4WG1SUFZiSXYtUjZDYlMyZ1hsa1FHdWFaS0VESjN5aGxfTTV6YzliMkRWS0tmX21YLUMyT3hxXzBfRnNYaGtGV21peE15NkEtZWRrVk5hM1phQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Keir Starmer apologises to Epstein victims for believing Mandelson's 'lies' - BBC",
    "description": "Keir Starmer apologises to Epstein victims for believing Mandelson's 'lies'  BBCCould this be the beginning of the end for Starmer?  BBCBank of England chief Andrew Bailey 'shocked' by Peter Mandelson's alleged leaks to Jeffrey Epstein  Sky NewsBritish PM Starmer apologizes for appointing Mandelson, but says diplomat lied about Epstein ties  CBCBritain’s worst political scandal of this century  The Economist",
    "published date": "Thu, 05 Feb 2026 18:15:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1FVi16ZjJhX1JnT3JmZ3ZRNERjNzMzUE43UTJ1d2haWDZNZlJnRExtYUhXZUtoWjl2b2NzalFrS2N6R0I3LTdCV3kwSzMyekRfS0k0RkVJMmVZQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran demands Oman venue for US talks amid rising regional tensions - France 24",
    "description": "Iran demands Oman venue for US talks amid rising regional tensions  France 24US and Iran agree to hold nuclear talks in Oman on Friday  BBCLIVE: US, Iranian officials head towards Oman ahead of critical talks  Al JazeeraU.S. shoots Iranian drone as Iran’s president seeks ‘fair and equitable negotiations’  CTV NewsU.S.-Iran nuclear talks back on after Arab leaders lobby White House  Axios",
    "published date": "Wed, 04 Feb 2026 00:36:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOa2J1RTVISWVOVDVITEVqVG5GaFNUS2VuS1hpX2xZWldZTVNuQm9zaEJkdXYxanlPZXpOY1hsbFZqQUw2WXZLWHRJRmM4MGNmMm1iTzFoQTBYblhfaUJWWUQ0M25TTkppMmxELVAyOVZJUlg4MzlIUUhHNGllWHlIbjZGZHI1S2czNnpoTGRhLTVNTnFmX05sZGdoWEZJS3ExQWVRa0kweDlaUXN1dldTUWlMcE9MZkU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.france24.com",
      "title": "France 24"
    }
  },
  {
    "title": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape - Reuters",
    "description": "Stepson of Norway's crown prince cries in court, denies videos on his phone show rape  ReutersSon of Norway’s crown princess ‘does not remember’ taking videos of alleged sexual assault  The GuardianStepson of Norway’s crown prince denies drugging alleged rape victim  CP24Son of Norway’s crown princess cries in court, denies videos on his phone show rape  CTV NewsWhat to know about Norway’s royals as crown princess and her son face new scrutiny  CityNews Halifax",
    "published date": "Wed, 04 Feb 2026 13:17:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNemhDRHpyYVVyVFFkeks3akdpMkhNb1p1cG83cmI4Q2J0bnh4elE3TXBWNlZfeVRPZ3NaMklGMHBjWTlkRTlfSHlRM1JtS0w1XzlvSV9nVHdPOU9rOU1GM2VxWWFrM0ZaNVdrU2RTZ3RndURvaUNuUWg0cUZ1M1RjWGdBRXZOZ3EtRGJhNnFwVmVwSU9YWnkwQ29iX3Z6ZGhlUkVXNFBKb2pmRURrdWppTFF3cjRmSWdXWEtGMGNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Trump administration to withdraw 700 immigration agents from Minnesota - The Globe and Mail",
    "description": "Trump administration to withdraw 700 immigration agents from Minnesota  The Globe and MailThe tension at the center of Trump's retooled immigration message: From the Politics Desk  NBC NewsVideo: Trump pulls 700 immigration agents out of Minnesota, but thousands remain  The Globe and MailTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The GuardianU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBC",
    "published date": "Wed, 04 Feb 2026 14:40:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPM3lnQjJ1N1lpaU1ueXR5eWs2c05yVU1hbVNDWkg4YWFadVNqRENIU1J5NnVxUjV3djlxSl9Kam1mQTZBVFYtMGE1U0tCbHQ2LV9ZTHR6TGF1X3NuQ2t6ZXNtclFQNlFXclMwR0c0OFJHTXU4LXhscnRKNmY4RVF5eFlpbmZPYThqYk9jQmtR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Anand in D.C. as Trump administration makes the case for critical mineral trade zone - CTV News",
    "description": "Anand in D.C. as Trump administration makes the case for critical mineral trade zone  CTV NewsAny decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailThe Latest: Trump administration looks to rebuild critical mineral supply chain  CityNews HalifaxTrump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China  BloombergUS, UK, EU, Australia and more to meet to discuss critical minerals alliance  The Guardian",
    "published date": "Wed, 04 Feb 2026 15:34:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNM2dkUXNmNUZvTl9kWkdDQUE2cUIyMnJjWWRpYUhFbzg0VVRZOGdnRE8yd2lpQmh1b1ZlZmJiMkp0UzJNRXY2eC1hSDQ5MnBxbEM3c3NqTURNY0JOUUhjY2Z5blFUWGxCZHhqb1BiMmF4X0dDNEFNVG8tQnhsaU53SXhKTEtBaTNLWkJQT3VaVDgtM1RjaERpSnVvMFNZMmEyZzcxZkNGLWRhbzFvclNMMmdORUoyMzJidy1yeHN4QzU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "U.S., Russia agree to re-establish military-to-military dialogue after 4-year pause - CBC",
    "description": "U.S., Russia agree to re-establish military-to-military dialogue after 4-year pause  CBCRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBCRussia-Ukraine war updates: Over 310 prisoners exchanged amid talks  Al JazeeraZelenskyy says Ukraine-Russia talks ‘not easy’ but ‘constructive’ after prisoner swap agreed - as it happened  The GuardianRussia and Ukraine hold a second day of U.S.-brokered peace talks in Abu Dhabi  CTV News",
    "published date": "Thu, 05 Feb 2026 19:22:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ0ZpcEpRN0ZmSUF2NDR1YTdtWm5aZlJYTVYxb3lBaDFnNTlmUGZPUGJFNm9zQ09TTXVScFF4STVSSWZMOTJuNkQ2aE9xd2hYcW9KSmV1cWlMbk5uZ2NPakZGMzZ0V2NLdEdUWEVXeWZKOGpkZGYyYnNCanNPODdyU1R1OW9MMmxCbk1GVw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "What to know after scores were killed in Nigeria while abducted Christians came home - AP News",
    "description": "What to know after scores were killed in Nigeria while abducted Christians came home  AP NewsView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 18:24:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPalo5S01hNjd2YUI2U3BoMnJwRDFnWk8zMzFTR0NuYUNmRS1LMnpsUGV3eFBtSUlRQlRJYWNEczAxUDRON0ltR19aSld0alRpaHJLX2I4aUpuUl93ZFZDWWhiUDlIaENHczF4di1mNEN5eERKMUo2bm9QS09SZ3dWU0JoRzA5cEN1RmIwbWJWTUhTNDUzV0NHcQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’ - Toronto Star",
    "description": "Owners of Canadian Best in Show winner bask in Penny’s prizewinning poise: ‘It’s surreal’  Toronto StarPenny, the Doberman pinscher with a Canadian connection, wins the 150th Westminster dog show  CTV NewsGTA dog wins top prize at Westminster Kennel Club’s 150th dog show  CBCThe Pup Cup: thousands of dogs compete in the Westminster Dog Show – in pictures  The GuardianWho's a very good girl? Penny the doberman pinscher wins Westminster Best in Show  BBC",
    "published date": "Thu, 05 Feb 2026 02:09:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNTmE2X1hMNzJnbEJUV2h3bVVrOGZyVXUxX2NwakN5SW5fZFpobHNyOXVxdUYxODc3dElTWkwwR2xWRGdGYnFnMFVocEEwTDU2bVBqeGxDTFVpcmVmVXlrMDZmbkZLWWZJOUgzQ05iSlJodDRSWWJ3VHJkMDFZVG5tbEdLMndCSTIzR1ZsaXR0bEZFczF3dXVDWE9oakxjOV9MUG9vZ2d3QU52aWpzYmFmc1ZJVWtZZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Why Trump and his Republicans can't take over US elections - DW.com",
    "description": "Why Trump and his Republicans can't take over US elections  DW.comRand Paul on Trump call to ‘nationalize’ elections: ‘That’s not what the Constitution says’  The HillWhen Trump makes election threats, it’s best to believe him  CNNNew Trump Controversy  AGF PerspectivesTrump Repeats Call to ‘Nationalize’ Elections, as White House Walks It Back  The New York Times",
    "published date": "Thu, 05 Feb 2026 15:30:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOSzVhVmN6bHRKeC1UTzlzdWJwYkZTNC0xRHBJczhVbWFyM1hvQzdzcGVTMV9JbEgyYVVWMG82X01razZkNmM2T3JnaE5OWk5McklEMk9WSF9hdHE4SlAxVC1UT1VDMXJzWkFlTmNuSm5WaEZTWTZDOTlmOUV3WUVHek9KbC1NRnk0MFI0Wl81MTZSZXgx0gGUAUFVX3lxTFA4Y2hsWXhZQS1JVWhTNjhhR0lpWGY5OW9FYU9jNEg1c0hKQllSWHNMXzZTak9ab0FNWUdIV1lpTnJfVHB6QjhOWHJwRlJsMEVWUkhYNHRqMjdqY3oydFJIbDlLZkJQQlpia0xGeGdoWEljcHk0UVRpaXpXNGo4cW43V1FmRzdTTTctM1JKdWJWR0dBRDY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "DW.com"
    }
  },
  {
    "title": "Xi calls for ‘mutual respect’ in Trump call, issues Taiwan warning - Dawn",
    "description": "Xi calls for ‘mutual respect’ in Trump call, issues Taiwan warning  DawnUS must be prudent when supplying arms to Taiwan, Xi tells Trump  BBCChina's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes trade  CNBCTrump and Xi discuss Iran in wide-ranging call as U.S. presses China and others to break from Tehran  CTV NewsTrump hails ‘excellent’ phone call with China’s Xi amid trade tensions  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 17:50:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiSEFVX3lxTE1ZZEduWVotV184ZzVuZFNJcnIzaTJVZEZMbGg3RjU2X1dpZUgtWThZYkxmdVJyTDA0S2lKOTRXaTBRVnZuWUZiRtIBTkFVX3lxTE5GSURKMi1qaFdIM3A4TDgtUll3WnBxbzlxUmhqc2pnNmxNcDBQZ196cVNjSGwtbktKdnE2SlhwZXRPQ2RMVC1nNWFxZFhzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dawn.com",
      "title": "Dawn"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - Castanet",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  CastanetICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianFederal judge rules against DHS on warrantless immigration arrests in Oregon  foxnews.comDHS Panics After ICE Barbie’s Fourth Amendment Assault Flamed  YahooNew ICE memo gives deportation officers more leeway to conduct warrantless arrests  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 04:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOaVJsb2RzeFVFNjUtZ3R0Ri0zV0ZicWY5b25sN2o4MVA3a2tSVGk4Q2ZVVC12M0VSa01OZko5d1J2ejBQcnB6YkdaTE1qTktvTXBvWTIwWGpFTEVWNFpDczVCUFl5aV9FQjZrQWFyWHFjSzVvU1NPQ3hfcGNRbTBEMWcxNVpPZ3VjSVlKc2dXVzFzNHc3eVBPZzd1Y0tlaGgtNVhsY0VQMjFyZzVuS01HekdNUjdoMGpPNGV1U3lkVGZwck96aTQ5T2lrMkFHS3gzenFkZUJ0LTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty - Reuters",
    "description": "Russia says it's open to diplomacy but will counter any new threats after expiry of nuclear treaty  ReutersTrump's nuclear arms control push with Russia hinges on China  BBCTrump to let New Start nuclear treaty with Russia expire  USA TodayScoop: U.S. and Russia agree to observe New START nuclear pact after expiration  AxiosIs the world heading toward a new nuclear arms race? How the Canada–U.S. hockey rivalry turned political, Why being single costs more than being in a couple. Are algorithms quietly charging you more?  CBC",
    "published date": "Wed, 04 Feb 2026 18:22:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNX3hYcjVUbFlORl9hVlBzckRITkxLNnJQNzhwU3AxRUFxSmdLQ085TmxOOHN2QnNPZVEwdnBzTGdMZHl1empjZzN6My1kdkdjZGZRaXJOYl9SbjYwd0dscjR0ZnRFc09MS3ljRmxkb0RPbDMwa2I0U2xyVHdVcXFZN2ZCTWhNUTRMYV9yNkVkVFZRMlFsQmppX3R6X05lTXA2b3hybW9qY2ZMbXJjeHNRb3htUC1wenU5U2lBZ29oN3owazVRN2ZF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children - CBC",
    "description": "Israeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCThe Gaza ceasefire began months ago. Here’s why the fighting persists  CTV NewsVideo: Israel strikes on Gaza kill at least 24  The Globe and MailIsraeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier  CityNews HalifaxIsrael strikes Gaza, killing 21 including women and children, after saying Hamas violated deal  SooToday.com",
    "published date": "Wed, 04 Feb 2026 18:35:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdl9FdVNVdVhzdzBSTTVGYXR1XzBTMU10RDBUVjZPUElUQnlIaVZ3UGozaVRYcEZGdVBoMmdja2p2eEhFWEhCQzZXOHhLeFU1eEVsb3lIaGtvODR1Y3dYZFE3d2NtcWNoWHhuLXFQZ3BEaDJKbkx3aVJqQ1RSU3hQcXRQVTI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files - BBC",
    "description": "Zimbabwe's Mugabe latest former African leader to be mentioned in Epstein files  BBCNaked images remained in Epstein files despite outcry  BBCWoody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files  The GuardianA timeline of the Jeffrey Epstein investigation and the fight to make the government’s files public  CityNews HalifaxWhy the Epstein files haven't resulted in more charges  CBC",
    "published date": "Wed, 04 Feb 2026 19:57:16 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE00OXVqYjJYVU5FdVk5dmVkTmxBM2RjREthcWJxWkZnRllqLWRwRUctRFVfZGlZUDB3M01SQm9BOE91bkRhc1lIMEp1SmJOdWJMdUtOZm9UR1FIZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Chairman of major US law firm steps down after Epstein files release - BBC",
    "description": "Chairman of major US law firm steps down after Epstein files release  BBCChairman of major law firm resigns after Epstein emails become public  CTV NewsBrad Karp resigns as chair of Paul, Weiss amid Epstein fallout  PoliticoA Top Lawyer’s Fall Shows Growing Fallout From Epstein Files  The New York TimesBrad Karp: Wall Street law firm boss resigns after emails to Epstein released  The Guardian",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran seizes two vessels in Gulf and arrests 15 foreign crew members - Ynetnews",
    "description": "Iran seizes two vessels in Gulf and arrests 15 foreign crew members  YnetnewsIran seizes 2 foreign oil tankers in Persian Gulf, state media says  CTV NewsIran’s Revolutionary Guards seize 2 foreign-crewed oil tankers in Gulf  The Times of IsraelIran's IRGC seizes two 'fuel-smuggling' vessels in Gulf  The Jerusalem PostTehran Turns Routine Seizure Into Strategic Message  Crude Oil Prices Today | OilPrice.com",
    "published date": "Thu, 05 Feb 2026 12:47:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE9XdmFSR2p2RWYySDlyYnltLWhhQk5RNEJna2RzbWtuNDBwYi1EOUs4ZlRrWFpkUG9yTERaQklKZG9FTTZkYWNpZEFFd2FfNUhXS2hXYlpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "Cuba travel warning doesn’t shake Windsorite’s plans; Support grows for those facing shortages - CTV News",
    "description": "Cuba travel warning doesn’t shake Windsorite’s plans; Support grows for those facing shortages  CTV NewsNew Cuba travel advisory urges 'high degree of caution.' Should Canadians worry?  CBC‘Photocopy your passport’: Canadians describe travel to Cuba  CTV NewsUS face-off with Cuba could put Canada 'in a vise grip', says former ambassador  Canada's National ObserverPlanning a March break trip? New warnings for Canadian tourists travelling to Cuba  YorkRegion.com",
    "published date": "Thu, 05 Feb 2026 10:11:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOM0NuM3lJSmMyZFlLb200SjRUd0Nhc2dnbXF3aW5XSHhHUy10RHpmT3BfOHRfbmJQQjJQaGNRcUk3cDNjczY2ZmRSYk8zUHQ5Nm5GU2xBaVNKMjJELUtUS0lOeVFJNmxqUEthTEo2UGxlUHRSQVlrbUt0N0lMVlRYTnVCNU8xNnNDcGc2bHBkMUNNcnZLYjc0clM3RjVXOXozVkc5Um5UMktqdFpWWFhoLVl1aWJGVnI5clNScjctTVhNTDJ4bHdNQUh4MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Washington Post cuts a third of its staff in a blow to a legendary news brand - Toronto Star",
    "description": "Washington Post cuts a third of its staff in a blow to a legendary news brand  Toronto StarThe Murder of The Washington Post  The AtlanticWashington Post layoffs include entire Ukraine, Middle East bureaus  Global NewsHow Jeff Bezos Brought Down the Washington Post  The New YorkerThe Washington Post can close its sports desk, but not even Jeff Bezos can kill it  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 14:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNaFV3bUZPYXZnRFdHM3lSdXFGTFhjcXBydVpHd0hrVHhVbENMV3gwbFdZZk5ZTDA0cHVqWGN6MVN4Sm42WHFnc2p3Q2lvZDBCN1RIU0hNeGNqZ0NhVUNWQjY0bXBTWmZjWTNEV3laXzkwa2l0d3lVdl9TYThhdnlaTXpzVGFpMTZvMmM2LVowWGlDcFozRGUxVjV3TzlCekJZb3NiWHRtZHg4cTZa?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thestar.com",
      "title": "Toronto Star"
    }
  },
  {
    "title": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments - Al Jazeera",
    "description": "Killing of Saif Gaddafi removes alternative to Libya’s rival governments  Al JazeeraSon of late dictator Gadhafi killed in Libya  CBCMurdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite  The GuardianSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.frWho was Saif al-Islam Gaddafi, the man once seen as Libya’s next leader?  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 18:18:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaUJDazIxdy1ycTByZDUtWVZ4S0Q5MnRuV01iMHhpcFlybi1vUV9pOVVyejVxb2ZxTkRBSlRJU1VtUTdFU2JldnhtcEdwc0h2dHp0ZWk3YThuMzVNeWlsU2xRQ1BPd29wX2pvTEtQc1I2S3dERTJmaThvVjR3OVpDdmV2MW9WTEtGX3YtRTRQeHE3bk00am4yYi12YjdEamxLN25QaS1fY9IBrAFBVV95cUxObmpIMXFJMEJjdjIwblZNcnlpQlBRRDl1LVpqNFVKN1ZlLVVkdVBLeVJIRVdHOGhlcHAyRzhDNDFZZVVFMHU2UGlULU5RV3Y5U1p2WE5aNG1BNmt0aTV4ckhwVGFoTVBnbkFvU2lfNGoxMUU4bk01TXFkWW9xSnp2ak9nZ2ZGUlNsZHpBLXNmdnZtNkxuQkJCclJXNC1NREtqSDZld0dPZ3NHTEVv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba ready for US talks ‘with no preconditions’ as energy squeeze bites  Financial TimesExclusive: Cuba says it’s ready to talk to US, but not about regime change, as Trump ramps up pressure  CNNA deal that Cuba (and Trump) cannot refuse?  Responsible Statecraft",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots - The Globe and Mail",
    "description": "Trump wants to ‘take over’ U.S. elections as Georgia officials seek return of seized ballots  The Globe and MailWhite House doubles down on Tulsi Gabbard’s presence at FBI raid of election center – live  The GuardianTrump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid  ABC NewsWhat does Tulsi Gabbard’s job as director of national intelligence have to do with elections?  CNNFulton County fights back after the FBI seizes 2020 ballots | As It Happens | On Demand | CBC Listen  CBC",
    "published date": "Wed, 04 Feb 2026 19:45:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZzlTUVU3aExkTFJLTWlfR3ZBejVnNVU1Mm9QMWlicUJqelZJWFI0ZlVkblJhMDBrenlva2Njd1p4RjRaSUxmN25CcTRHTTZSbkxITEJNb1dmdkJtd0dYaUxXbVBKb1Bqd0pHT2lwWk14cmlPQnA0c1ZMeDZjOFJ3T2ZJM0JUNy1KcGY3Ym1HcXNHX21hTzVjUC1UMnBPc3VjWGc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Fifteen migrants dead after collision with Greek coastguard boat - BBC",
    "description": "Fifteen migrants dead after collision with Greek coastguard boat  BBCGreek doctors work to identify parents of injured migrant children after deadly boat collision  Yahoo! Finance CanadaMigrant deaths off Greek coast raise questions over quick official accounts  BBCProsecutor orders arrest of survivor over Chios migrant deaths  eKathimerini.comGreek rescuers search for potential missing people after deadly migrant boat collision  Toronto Star",
    "published date": "Wed, 04 Feb 2026 11:59:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA0S2dQT0FUVlJtalM1RE84aFloNF9tYlFDSnFoa01iMjB2Y01sMXcyMmFnZ25nWDFrVnFlTXZocklmR04xNG16Ujc5TV9uZ3VKb09QTW9sV0NKdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Mexico's Pemex supplied $496 million of oil to Cuba in 2025 - Reuters",
    "description": "Mexico's Pemex supplied $496 million of oil to Cuba in 2025  ReutersUN warns of humanitarian collapse in Cuba as US seeks to block oil supplies  Al Jazeera‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure  PoliticoMexico’s president pledges to send aid to Cuba despite US efforts to cut oil access  The GuardianCuba in crisis amid fuel shortages, ongoing blackouts  DW.com",
    "published date": "Wed, 04 Feb 2026 15:28:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQRDg0QjBnS0NQUk5nd0xvTldpeWNPeTVzWmxBdWtNdUk1Q1BpMTF3WlBwTGpNX0Z4MDZoTm1HY2szYjI2UjYycllGd2p5Z2xlZ092VjBxSl9PX3paZ2h4SG11TnNnZkNCd29NaEcweWl2NjkzV3V3SHhQRmcxMFNLTEs5bldTVDBweG54ektpV3pNM1QxVkZ0QXJLZG44WTJyb3FLa1ZOclU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’ - The Times of Israel",
    "description": "US-Iran talks back on track after Trump warns Khamenei ‘should be very worried’  The Times of IsraelTrump warns Iran’s supreme leader should be ‘very worried’  CNNDonald Trump wants to end America’s half-century conflict with Iran  The EconomistU.S.-Iranian Talks Are Still Expected After Gulf Flare-Ups  The Wall Street JournalOil prices jump after Trump says Iran supreme leader 'should be very worried'  CNBC",
    "published date": "Wed, 04 Feb 2026 23:21:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQUG5BTGhYMGZlT0tmV0h6TDYwTV9sTmRncmhPNnQ2dnRjSHR4djZoVkh2YVFkRy1kaWNZYUhzb09HcUZwNWIwMVIzc0lZTVdHOFdBaVBQakxOLWRPemp3LXp3SHVyN1RuZnl0ZVFDNEY1ajAwZ3JaOU91UGpWUDdTTl9wX0p2R1NwWldoX3FZZjdXZ1kwYWlNa04zWldxTTVMODRuTGdfQzBhRU5w0gGyAUFVX3lxTFBESjFieHBPN1NQbDktUm1GdDBXNE9zSW5Ua0dNSlNLbDAzNTNLZXpXNG9ubzRUQ3R4cVF5ODhNSE9CZHZiZzZkeXFFNGdlWWpLR3pCME1XcHZvNk0xZzRhMWIxTzdoRnpvWWg5RFFmMkRvWjY2SktLbHhtdGx3MFIzZ3RkYW9FaHBXR1hRRkhqNnc5SEs1bngtX21VWXU4VUhNYUdUOE9pcjFjZ2ozZkxBd2c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "A US House special election in New Jersey becomes a Democratic testing ground - CNN",
    "description": "A US House special election in New Jersey becomes a Democratic testing ground  CNNPro-Israel lobby group pressures ‘moderate’ US Democrat in new strategy  Al JazeeraAP Decision Notes: What to expect in New Jersey’s special congressional primary  CityNews HalifaxNew Jersey Democrats pick from crowded field in special election for Sherrill's US House seat  Toronto StarPrimary for New Jersey Seat Is First House Race in Pivotal Year  The New York Times",
    "published date": "Thu, 05 Feb 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUWFBNDNIRHpnLVpWU0xUNG1wYzJtSXZFY3dhNVhIVVV6aUxrRXF2MUZIbTF1RDFvbm1yQUQ0WjNySkdrVFo1VFJGV2VDb2RUVjZ3YloyX095anZ1anQwRTJQM25lMlY5VWpvNUYtR1NOYjRXNkZoWE0yNExuXzZldjlLWmNEeXZzb2dzb0lnbXlHZHdRNENocHd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Israel returns remains of dozens of slain Palestinians to Gaza, Hamas health ministry says - The Times of Israel",
    "description": "Israel returns remains of dozens of slain Palestinians to Gaza, Hamas health ministry says  The Times of IsraelView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 21:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQYmtOa1BfME1ZTlNKdnNJUzgweUh1RXV2YVprRk94TDdUNi1FNXhqMnJWSmFXWVJtWXF1OVRWY0F3bnY1dTA4UnN6bk1LMWlaVHFBcXAwOV82RGF4VWJWRnBPZklnOUs1Rkw4MWNIYzN6eE50eTJnLVlreWJoVUpsc3Q3bEVDbGpYNm5SV2Jfd3BEQkx3ZEJjR2RzWEVVRjExU3NXNDhtSUJnRHA3d1JFeV9ScTRoOVM3TVFBT9IBwgFBVV95cUxPczRxSlVCcGNmY2dBRUVFdUU2SzV1YTBiRHdfcEthUm0xcElYeFFnVUxzU3lFLVV2QjJvSVR4VmljbW1icnBlNDRJaERPemU0RlFqOVh3Z1BUak9adExHcUN6YjEzdlR3X3hmbVF6T1c3U2JGT0dqQkRWSmNrSm41eUlZM0diZmFIeURMbm41cmV1c1ZjTDk3Mnl2R0pLOWxwbFhZZVJmTEdnTGpLM0tVWUh1TlQ5NnhTWTNtSWN0NE4xdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Canada updates Spain and Portugal travel advisory over serious risk - Daily Hive Vancouver",
    "description": "Canada updates Spain and Portugal travel advisory over serious risk  Daily Hive VancouverStorm Leonardo slams Spain and Portugal, leaving 1 dead and a girl missing  CTV NewsRescuers contend with fast flowing river in search for woman swept away during flooding in Spain  Yahoo News CanadaOne dead in Portugal, thousands forced to evacuate in Spain  France 24Deadly storm sparks floods in Spain, raises calls to postpone Portugal vote  RFI",
    "published date": "Wed, 04 Feb 2026 16:46:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOZVVKbldsUG9sOGp3cUZOWGNZWEVFZ2V0YXFfY0RZeWdoYVI4Zkh3SlluTGxZYkVnUEE1TnhFQm9UNE1HUFRqTXhGdlduLVJoZFlpS3VaajQ5b2k4OGVKTlhnVlB2WE15VkRTTzVNNVpfbnd4cE5MU1BUT1ZLVzB2cVQ0WnEzZnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Russia Leans on China as U.S. Tries to Squeeze Indian Oil Trade - Crude Oil Prices Today | OilPrice.com",
    "description": "Russia Leans on China as U.S. Tries to Squeeze Indian Oil Trade  Crude Oil Prices Today | OilPrice.comXi and Putin discuss growing links between China, Russia in video call  The Globe and MailRussia’s Putin holds video call with China’s Xi  Al JazeeraXi speaks of 'grand plan' with Russia in call with Putin  Australian Broadcasting CorporationPutin and Xi Tout Trade and Political Ties in Video Call  Bloomberg",
    "published date": "Wed, 04 Feb 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQM3pHX0cxMzZiV0lRRGFUSzBDdWNPN2t1d2RMXzVJX0M4dWxzS0Y3dUw2TU1XM2NuVDlFRjViTDFVVmxtYTBWNE1femthRVhhVWhmbXUwbzdyNlhNdzhlWjFFYnE2eUlPZW1JT2NCcU85VjVhTWtfaWszLTY5c2l6QUs2dGMyQ1RfSHpIQ3BmVzdsVDc0alFaUS10SUhZaGV0RDMxX0tpd9IBrAFBVV95cUxPMHdZN2pFZmctYzI2TkpXWTdDV2VpUkMwYTJNN3dJLTVMNVlMM0ZnT3FnUWduMjdEQUtVMlVQNzFQNVJSTEY2WTNhMC1GZVRfM0VUZjd6M2pHd2M4cWwzcjZTc1E5b3lqR0dQWl9VQUpNbHZjUjNkRTV6OThsaFdDVjBYUFVYdkFlV0c3dHo3NUxKM2tTczM3TWZHTXA2aFRwNFdsWU14YVQ0RGVt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilprice.com",
      "title": "Crude Oil Prices Today | OilPrice.com"
    }
  },
  {
    "title": "What the US-India trade deal really means - Asia Times",
    "description": "What the US-India trade deal really means  Asia TimesHope and uncertainty as India and US strike long-delayed trade deal  BBCIndia Says 18% US Tariff Rate to Kick In After Joint Statement  BloombergCNBC's Inside India newsletter: The facts — and frictions — of the U.S.-India trade deal  CNBCModi, Trump announce India-US ‘trade deal’: What we know and what we don’t  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 04:39:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1kOVhjdFNId0daZ2VLRzlsMnB1UEVxYWEwWFpqenZaTi04TTlYY19zWHFRT3BVSTdPRkdPVjBGeHVCM0hQTjR2dmROTmI3WEpaejZZZ09lX0lMUlV2TldiUnF0ZGZWQ3RvVmRiVVc5OHRacHNBTlZKSXVmanQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://asiatimes.com",
      "title": "Asia Times"
    }
  },
  {
    "title": "‘Lots of foreigners on the beach’: Australian teen whose family was swept away in the sea struggled to ge - Times of India",
    "description": "‘Lots of foreigners on the beach’: Australian teen whose family was swept away in the sea struggled to ge  Times of IndiaMother says asking 13-year-old son to swim four hours to save family ‘one of the hardest decisions’  The GuardianAustralian boy, 13, swims for 4 hours to save family swept out to sea  CBC'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family  BBCAustralian teen swam hours to shore to get help for mother and siblings swept out to sea  CNN",
    "published date": "Wed, 04 Feb 2026 20:05:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgJBVV95cUxNVGd3TVg0Uzl2N096ZlFBdGptX0hPckxzbnpralJpR3JkY00tT212TnktZkhyaGM0Vm1MX196NnVIdjRvd3RmSDQyMUpjWlB1V1N6ZXlhUDIwU2Vidm1FZE5MdHotWjcxenNvYXJCazlkNWotRGQ3dFVEQlUxTndVT3ZsLWdveEV4WDlJM3JYUlcyZEROcXNOa1drZmFzVVJlSXBUR0NrdG9DSE5PM05nVnRzc0NNa0d5SE82enNPa3o0dmtCSW93VXVvZjFNWEtHY0xjdDdxcHdMcUJXdjhjOU5yNzc5bXhCNVdaVXpYbFR6OXdJM3F6cXYtdnBNYWVLdGVabDE2UXA1VU16S0VCM1JfNnJoTE4xdFRmb0pvbFJ3RC1ibkHSAasCQVVfeXFMTUtsNHN2SG1YUHBQWm94MzBObjZDM0Vqa1RZQ2toV1BKTmpDRWZ4bHJXbmpWVUNDZ2cwRDEwdWtPRUR5TjlSTk14bTNEbndjM0lvVUxEb3JwRS1wTEhLZEJRQURBQ05qUWNWOFRhVE1pOTFDY3hseDdjaFNnTlh6RnZmck90VEZ5S0M0d2V4WTNtTWcwaTY3LVNIM055WjFkM2RQQWdvekJlbFc4eWhodkpWd2xJbUtGQzd0LUJDOENvcEY3OWRZTzE1UUNRQWJaWlJoMXlKNjR0ZTNlb0VZRm1EM3BNQWd1ZDNNMHlNUUU5ZWZ3MEk4RzNTMTBlWlUzY2U5c2U5cV91OEdiUUZlSi1jem05aEk4TU9ZalVFQmtFVFR4azBKeGRsY3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela - NPR",
    "description": "What U.S. history with Iraq's oil can tell us about what could happen in Venezuela  NPRThe $100 Billion Bet on Venezuelan Oil Relies on a Broken State Company  The Wall Street JournalTrump Is Courting Chevron, ExxonMobil, and Others on Venezuela. What It Could Mean for Your Energy Portfolio.  The Globe and MailUS Plans to Issue License for Firms to Pump Venezuelan Oil  BloombergLake Maracaibo: The oil region at heart of Trump plan to 'Make Venezuela Great Again'  BBC",
    "published date": "Wed, 04 Feb 2026 10:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNLWlZY1c3ZUZXMGhrRmdzb0tqRDVTcWxHN3gtNk9wMVNWOWdZZUt1cXlSZFhwQy11cWk3V3cwdzhPN0xIMV9kRnZtY3YwcHVYMjRUajdPT1VyZjZNSDM5M1BsR0Z2NE5vNHhtTFcwdTI0eGwzM0Jhb3RHSWprMXEyak9FZWpqc2Q5SVlfaDQ4TFlCeGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.npr.org",
      "title": "NPR"
    }
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims - BBC",
    "description": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims  BBCEpstein emails bring scandal to Europe's elite, from Norway's crown princess to Britain's 'prince of darkness'  NBC NewsKing must feel vindicated for cutting off Andrew by latest Epstein files release | Andrew Mountbatten-Windsor  The GuardianThe Royal Family Is “Appalled” by Latest Epstein Files Release  Vanity FairRoyals, politicians, magnates, intellectuals: Epstein files spark storm in global elite circles  France 24",
    "published date": "Wed, 04 Feb 2026 18:02:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBuMGZhSzRRSkJyM1BSNWJpSUo3Mmt4eTNJLXN1ZGhHRDl5bzgtMUZNSEZEOTNmd2ZoOTd3VDk1d2t2U28yVW56VktFTFl2TG1pVXZpUU43Mlg0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs - Al Jazeera",
    "description": "Musk labels Spain PM ‘tyrant’ after Madrid proposes social media curbs  Al JazeeraSpain hits back at Pavel Durov over mass Telegram post on social media ban plan  The Guardian‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  CNNEurope Takes On Tech With Social Media Bans and Paris Raid on X  BloombergSpain looks to ban social media for under-16s, joining others in Europe  CTV News",
    "published date": "Wed, 04 Feb 2026 10:01:26 GMT",
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPcnlONWxoSGlTLVN1bWNOX2ZaekJnRWNPYkVReEJRRHpoQ2ZLVi1ibGlNZzg2cVZKckRpY0xlUzBkSjRsekRKcTNEeU5Xa2NwaHZhZjV2QTZNMmE5MHhMMV8wQjRZUmN2Q21XRm41dDJORFlpeEI2T2ZQbUJjQ0YxR05hVm4tTjFCeGRubEZXOF9mQzR2YVVrbjJVOW5LZzRrR0d6RkJtemxUaXdu0gGyAUFVX3lxTE1rSE92d0hQNG56QWlvNVA0S2doUU5Qd21JcGlsckpsX205b2FkYXFEbjdrTGVNYzBvdlI5S3NjZ0sycGVyUE1XYTJIS0lzV21vZlZrN2taOExiNGI1dXZ1T2FBN0tDcGtodmZOVXB4d3RZdzdLVTd0ZjNiLTBYQVpiamR3VUdJOEloSUJodHpXMk9Nd1BQLVRERmhBNUZxLVgzUmhlX2Z2WVkzZDN6aHJFNkE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Man once married to Jill Biden held without bail after being charged in wife’s killing - Castanet",
    "description": "Man once married to Jill Biden held without bail after being charged in wife’s killing  CastanetView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 16:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObVZzQUk0Vy1rbVp1VVVGWVhjZEJ0TC01Z19aVEg1MFI3ekw3cmZZa0tUNjYxZ2ZsS2J5dFJ2Yl9wVkZKR3FHaDdJVEl6MHNHczZqdmItN1JUSzgyWi1EeDBmV094ZWZtSzlLN2MzamhMLWJEVzVYa2huN3g4djVBcWpibWcyaUdWR2J0TURVMXRsOVl3bE5kc2thbTVaT0QxTHVReVhYbThTWUdia0VUcGRYQnJkZ2IyWDROV2dvNURwMUcyY0RiTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Man who tried to assassinate Trump sentenced to life in prison - Global News",
    "description": "Man who tried to assassinate Trump sentenced to life in prison  Global NewsMan sentenced to life in prison for 2024 attempt on Trump's life  BBCVideo: Man who tried to assassinate Donald Trump at Florida golf course gets life in prison  The Globe and MailRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  CNNRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York Times",
    "published date": "Wed, 04 Feb 2026 19:30:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZjhVSzZZNm9qaTdFNHE5cVJCSVNMRVdFZU1MVF90RDVRUGhlZmhWWEVVX3RBRGl1aTZZUVl1N0o5dllBRmlwQ2p0bzJPM3B3OEZZRDl2ZVZkdEZFZGgtREdsZVhub0Q4QkZHeF8zRjI3aThHcHFEWDlEUHRIbHUzUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "French police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok - CBC",
    "description": "French police raid X offices as they investigate Elon Musk's social media platform and AI chatbot Grok  CBCX offices raided in France as UK opens fresh investigation into Grok  BBCParis prosecutors summon Elon Musk after raid on X's French offices  NBC NewsCondemnation of Elon Musk’s AI chatbot reached ‘tipping point’ after French raid, Australia’s eSafety chief says  The GuardianMusk grapples with Epstein, deepfakes ahead of high stakes projects  The Hill",
    "published date": "Wed, 04 Feb 2026 00:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPaDVhcHhqSjBYQnFHcmhkdWFRVWFMZGdqYi10ckJVSXdqWExkS2VSR1lRbVQ5Ym5PZXpjaF9CTkM2b1VOSlFsYW4zUzY1NHJBeVZickFDV1pKVi15dkJlMk04VVl2RFBId2JwY2dUbjhwdjVmRW9lblp4dlkxWWoxQw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "US probes Nike over white workers' discrimination claims - BBC",
    "description": "US probes Nike over white workers' discrimination claims  BBCNike, Accused of Bias Against White Workers, Is Under Federal Investigation  The New York TimesFederal agency probes Nike over alleged discrimination against White employees  CNNTrump appointee probes Nike over claims of bias against white workers  Al JazeeraNike facing federal probe of alleged discrimination against white employees  Axios",
    "published date": "Wed, 04 Feb 2026 23:07:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9tVkd1dXJjQ01XQ1dIdlhaVEhmMlk1N0JfbDhTWHpJelZzaDFWUVd2UGJXb2VtdGc1LUFFNHNBY3hIVUpTUFlNVEdyZ1pLY3cxMnlPNVFKb2M1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Message from His Highness the Aga Khan - 4 February 2026 - Aga Khan Development Network",
    "description": "Message from His Highness the Aga Khan - 4 February 2026  Aga Khan Development NetworkRemembering Prince Karim Aga Khan — Faith, pluralism and service  Dawn",
    "published date": "Wed, 04 Feb 2026 09:53:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQZnZ1aTU5cWRyUnZjY3NxYWFNMk5lazYyMVdxYjRJZ00zcUNZbS1Wal9zcXFjblhHZ0drMDJPX0d2U2hqUzFYVjZ2elA2ZThZYmVtdXhCQTNDdy0wS0htdTZoMURjNDlPZ2Z0YmVjNllwTUJJdzVvUENRS3BxQVRIWnJwRTVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://the.akdn",
      "title": "Aga Khan Development Network"
    }
  },
  {
    "title": "Angelic face of Italian prime minister wiped from fresco - CNN",
    "description": "Angelic face of Italian prime minister wiped from fresco  CNNHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistChurch and state in Italy are investigating the appearance of a cherub resembling Meloni  Toronto StarChurch fresco resembling Italian PM has face scrubbed out after outrage  BBCThe angelic Meloni behind a fresco fiasco  Financial Times",
    "published date": "Thu, 05 Feb 2026 11:46:53 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFA4eWdoSU9COUVPNmZyQ1ExdnhjSWo4a1k3MWFjUlJWandIQS1NbGc4OTg0RTF0ZHprRi00ZTd4Q1hMQU1aeFVlQ1pIN3VTeXFwdlE3a0xDbE9UZmZUdzFTSy1qY0tseWRZckVmYU5SRy15dkdGNjgxdGxNdk1pcXc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Zelenskyy calls on Trump to respond to Russia’s massive attack as talks resume in Abu Dhabi - Euronews.com",
    "description": "Zelenskyy calls on Trump to respond to Russia’s massive attack as talks resume in Abu Dhabi  Euronews.comUkraine sees quieter night as Trump says Putin will not attack its cities  BBCUS, Ukraine disagree on whether Russia following ceasefire  The HillPutin 'kept his word' — Trump reacts to latest Russian strike on Ukraine  The Kyiv IndependentTrump: Putin kept his word on pausing bombing Ukraine  politico.eu",
    "published date": "Wed, 04 Feb 2026 09:45:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPSC1yUXRxaXd1NUY3QjZTeXNGSm9LckNFWjFOdVY1NG1EUU9fN2VLQ0dhbFppeDBoclBSNk03UDBKc0ZpNTBDUUhsNE1DX0JKLUFWeF82M3Y4ZFdQRmZtOEk3ejBUckNCU1ZiZ1poRFE5c1h4czhRMFBURWswbUNITGpfNVVOQXc4YkZZRFZHWjhadnNUTHI5RzdUTTdRZGYxY1lWMTU4VDdwV0hITmN5alVxNUQ2YjU5cDFHNTY3UFVlcVB0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’ - Bored Panda",
    "description": "North Korea Publicly Executes Citizens Caught Watching ‘Squid Game’  Bored PandaNorth Korea: teenagers ‘executed for watching Squid Game’ as regime wages war on K-Drama and K-Pop  Amnesty International UK",
    "published date": "Wed, 04 Feb 2026 16:58:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQUFo2UzBlWFdZNkNRcHp0U1ZJNm1sQXVVc1E3d0ExbGQ0aHFwcUI4VVJuNk1yUW1CQ3VHSmZURlVUdk9uTjF2cVRqZ0w4bkpoQTZveUhoSXFXUDFLaVdHN0FMUzEzWHRvTFllZG5aWm9UNzc1UUdTTnJibGxvOGpoYjVXY280VlZmT29GaHF3RGdmSmE1RVU4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.boredpanda.com",
      "title": "Bored Panda"
    }
  },
  {
    "title": "Colombian president and Trump put aside insults for amicable White House meeting - The Guardian",
    "description": "Colombian president and Trump put aside insults for amicable White House meeting  The GuardianLive updates: Colombian president Gustavo Petro speaks after visiting White House  BBCVideo: Trump, Colombia's Petro meet in Washington after months of feuding  The Globe and MailTrump-Petro meeting: Just how icy are US-Colombia relations?  Al JazeeraTrump and Petro trade insults for restraint amid continued detente  Politico",
    "published date": "Tue, 03 Feb 2026 23:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQNlExZFlfS1NVOHdIRk9sMHdjem52Mzcwa2dkc1p4YklQUWswYlJQclRZZFlWSkJuWGhSNjdsQlZBVldxSzdmeXFXaW5iX2xFRTZ5U1duTDlITHJmQXAydEl0dXlLYnUxcGdDemttZ3lHeC11TnA2WVB6QmxKVDVsMXE3dXBJREhOTVdxR2NCYjQwNEtLX1kxVzhyVnNSWUNBb0MycXBLd1l5LVI2QVg3dGlIdG9oMUtjNTRaemhYUl9WN203?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Russia jails stand-up comic Artemy Ostani over war joke - Al Jazeera",
    "description": "Russia jails stand-up comic Artemy Ostani over war joke  Al JazeeraRussian Comedian Accused of Making a Joke About Veterans Gets Prison Time  The New York TimesRussian comedian jailed for nearly six years over war veteran joke  ReutersStand-up comedian gets nearly 6 years in Russian prison over joke about war veteran  cbsnews.comMoscow Court Jails Stand-Up Comedian Nearly 6 Years for Alleged Joke About War Veterans  The Moscow Times",
    "published date": "Wed, 04 Feb 2026 19:06:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOOGlqQ014cEpaTHg0MjNlNHlSYmVqX2VsOXkyVE9rR0kwMVNiXzdRam5NZGVnZmRubmtObjhadWZnQ0RpNi1Lb2NyMEJrSXRZVER4WndZdGwwMzVxN1JqdmxYNXBjZzJJQkFNUkUtQV9HbHprOG5Rdl9Fc1MxNW9QY0ZRZERpdkJmdTNjYUcwLVoxUlZMMTZKUDJIa9IBoAFBVV95cUxQbjRDTHhqNHJBdUdCSS1XTDQ1Q2taYzRtRUpQaUIzQ3RTQ25IRlpXWVBTNVdoWXpPaVpvejhpOTNtc3hfN01YZU1xc0w4bkJLUXIzczZvWnUyRW5zRE1JYkNJb3dnNjNfSlM2cmRfVVRGNWduamNyZUNfWXBORVc1SmU3bXhBYVY4YW9wakJmSVFNdEJpNVpkUFBfY2NvdUtD?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Renee Good's brothers tell D.C. lawmakers 'what a beautiful American we have lost' | CBC News - CBC",
    "description": "Renee Good's brothers tell D.C. lawmakers 'what a beautiful American we have lost' | CBC News  CBCBrothers of Renee Good, woman killed by immigration officer, call for action in Congress  CityNews MontrealRenée Good’s brothers, others describe assaults, shootings at hearing  The Washington PostSeveral of these Americans experienced aggressive encounters with Trump’s DHS. Now, they’re telling their stories  CNNRenee Good’s brothers say ‘no good’ has come of sister’s death in Capitol Hill address  The Independent",
    "published date": "Wed, 04 Feb 2026 03:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUFQ0eVJqMmhERlJ5Zl9xRTI0ZTJETU1nQ3ZHcld5eHNCeElIMU1qMVFzdHVpdVhkaFpiN0tBNlF5bkU2eU9CWjNDUWF3bmtFT0lGSFVCZ2RSWkllQ3dIblNrdmxMUWM2Z0VBRUJ6aVdiNjJiVGY1TXBfYi1qSUsxcGhrWG1SOTZ6?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’ - CNN",
    "description": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  CNNMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania Trump Uses Event With Freed Hostages to Promote Her Documentary  Rolling StoneMelania bristles at Epstein question when confronted by reporter at event to honor Israeli hostages  The IndependentMelania Promotes Her Terrible Movie in Weirdest White House Event  newrepublic.com",
    "published date": "Wed, 04 Feb 2026 23:03:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTnZfUEtLV2tYNHZhMWpKUEJYdTU1Z0xveFhuZWV4OTgxdHRGcE9PaTA1X0hQbkNpNHZsTHVTZ1FDdHZRd2xlTGJCN25OQWtieVh1bEYzMFlNWTllN0dnT092Vzc2bjJUWkVwWGlPRGhxOHZ3YlJZOVNZVWY3VGZqdHdITmlvYVVkYzdOOUdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead - CBC",
    "description": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead  CBC‘They Couldn’t Break Me’: A Protester, the White House and a Doctored Photo  The New York TimesArrested protester reveals pain caused by White House’s AI-generated photo of her crying: ‘Was just so degrading’  Yahoo News Canada",
    "published date": "Wed, 04 Feb 2026 23:20:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMWh2N1BudVJxZ2dMUVZPWGFfVHM3WFFZd2RRZ2o1UlY4S3BqNUtoNmhwc0QtUUxaV2dsajliMERaQ056akpUUzdfbUtTVzFUdmpMcm15RGVjdFJnMnYzZ2Yzd29jMG5ZaGZPNm1zWjV4X3JJNHVpaXlNNkNKSmI4c3ZMTjJPVHF3N1dn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings - CTV News",
    "description": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings  CTV NewsHow to tell real Minneapolis ICE surge videos from AI deepfakes — 5 key clues  inklImmigration Agents Are Killing and Abusing People. So Civilians Are Turning to a Controversial Tool to Find Justice.  SlateAI-Generated Anti-ICE Videos Are Getting the Fanfic Treatment  WIRED",
    "published date": "Wed, 04 Feb 2026 21:39:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPNVRyUXFzX3dpTmlVTzltVlVuaWY1YXQyanNGVE9oVXZPMktuSGQ3bDlEXzZUTXJIVXRNbXpjVV96cEY3RjNjRnA0b2xBaEczaXRFNFFxVWt2ZDdBeHFnTzF3RURqUkZkT3hHTkhzbFVfNG0xVG85QndLTmVOTklPREdwanNnc3V1bGFSQnVBQTlWTVprVG1sc1hkTDRCTy1YNlg1OTdzWmFSdHlpYlRFc0tweGc1UnBiVTBZQzIxX05PSmhQQUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost - The Economic Times",
    "description": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost  The Economic TimesWhat to Know About Melinda French Gates, Philanthropist and Ex-Wife of Bill Gates  People.com",
    "published date": "Wed, 04 Feb 2026 12:52:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxQVU54Z1FKOXVsMnpwdkxxcV9vdEhEa20wN0NEOGpHZzYyMEh1RUtFX3BfT25RTGdpT3pWUzdXSlc5REd1U290NlN4a1plLTRlY0lKcUpsa3N4Zk5rX3NWUWZlTUlHRERlWVNCQlBMN0RGODc4LTE1Um1oTDNodV9uNzQyNi1UYTY3SUk4Z0RZRE1ZLWRBc091OExwZ3NGWTRWemRDUVNyN0t4VjZLM0ZnSC1nQ25TZ3p6TFkwNl9VWHEwU18xX2g1M3p2LVhzMzdpRTd5TEFXdG84a3J5WFVNeXJMWHdGaC0zd2dMRFlzZVRvRmtxNk1GVTd3QTdrN3c4NTFRakZ4SnJ2UmdhSWxlTDhlaFnSAZoCQVVfeXFMT1IwTXBucnJ5NjJzWTc4TWEtLUlxWmlRREZLaDhRWW5uTENham1TWmZBUVBwLS1QZTYxeEFDNHVsdVZzdG1zLUlrLWFjencxSmphRUtqVm11ZllQMmJUa0dnSWpiVXU2d2d5akgxcHJtR3hBMjNLQlFEMWkyaEJWNWJWdkpnQ2lXcER0MlUxTnY1Rzk2ekJzZ2J2U1V5Y3NSRkhGVDFNeTJWald1OVB3cmtmYnNGa0ROZnloNzMtSUpxSDhReklQVEpEejBvV0I4ZExHa1REYm5nWUM4Nkh0anlmMk5hUGF2YUVmTzdhUi1vNVRodlliazFmSVlvdzc5T2Zka2NHamdxUGgzeTZPaHM5OFNsMUVndjNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://m.economictimes.com",
      "title": "The Economic Times"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCFamilies suffer as Ukrainian engineers can no longer keep up with repairing infrastructure  Toronto StarThe Assault on Ukraine’s Power Grid  The New YorkerRussian attack leaves 1000s in Ukraine without heat in -20C  CBC",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Trump has attacked pillars of democracy, says Human Rights Watch - Reuters",
    "description": "Trump has attacked pillars of democracy, says Human Rights Watch  ReutersTrump-led abuses amid ‘democratic recession’ put human rights in peril, HRW report says  The GuardianHuman Rights Watch warns US heading to 'authoritarianism'  France 24Global system of human rights in ‘peril’, warns HRW in its annual report  Al Jazeera‘Aggressive superpowers’ are setting back rights progress: HRW  Taipei Times",
    "published date": "Wed, 04 Feb 2026 17:14:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOck1ZNlRrTW5lM21oUTBPT2R1YW9Zb25FYnUxYVB1RkhEbWItVjBLMWl4UWZVeDd3aGdLRGlxMWtGTGdCZktJWVJGTV9hVjFXRjg2ajkxVzZrUHVibHdaSTZuai15VzhsaEdEc2xGTEFsTDU0bjhubllPOUphN3lfTmF6cGtzcVBEU1poeXlDZGF1ZkUxUEUwTjhGekZ0MGxrbzBaSlRlZ2o?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "The Internet Is Absolutely DRAGGING Dr. Oz After He Said Kids Should Work \"Right Out Of High School\" - BuzzFeed",
    "description": "The Internet Is Absolutely DRAGGING Dr. Oz After He Said Kids Should Work \"Right Out Of High School\"  BuzzFeedPeople Are Telling Dr. Oz To \"F–ck Off\" After He Suggested People Should Retire Later To Help America's Debt Problem  Yahoo News Singapore",
    "published date": "Wed, 04 Feb 2026 21:27:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOVWVYZDM4dnZ3SUZia1RCcXdPRi1NelA5RkxzQ050cWNIVlRGWFcyUW9ycmJ6WkdCVmQ3WktzN19Hd1diUVpuVUVlWDVMX3gwZkVldlNZTHFWaVpKSFJyS21qM3h5a29LZVVNY3VYRzh2ZzZ2QlNSRkwwZWVMcTZvYkR2dXBUWjhDcFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "U.S. Judge appears skeptical of Trump’s latest bid to nix his hush money conviction - CTV News",
    "description": "U.S. Judge appears skeptical of Trump’s latest bid to nix his hush money conviction  CTV NewsJudge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’  CNNTrump waited 'too long' to seek moving hush money conviction to federal court, judge says  ABC NewsTrump tries a third time to move hush-money case to federal court in bid to get conviction tossed  NBC NewsTrump Again to Test Path to Clear NY Criminal Fraud Conviction  Bloomberg",
    "published date": "Wed, 04 Feb 2026 22:30:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQWTZYYy13dWZ5MVZvak5ZVmJwZjM3UlViZ1hBYW4yYzhjU1czYzdLd3lBVDRqaFplcWNQTzRJRWlHNUFtcmN2WEFoT2t3RzdhVDNqUmxnUEVzTUVoQ00zRW8tRm41X3JuQmtTOGt2NEZmNmd0T0htZUNNR0NqY1JQb0VzX3k1UGFFeEdnZnAtZmhuQzBNcFAtbm5PUWJHREpqOUJTUF9PZW1CY1BxUkZGa0dnREljQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Canada and France set to establish diplomatic presence in Greenland amid Trump threats - The Globe and Mail",
    "description": "Canada and France set to establish diplomatic presence in Greenland amid Trump threats  The Globe and MailGreenland dispute a 'strategic wake-up call for all of Europe,' says France's Macron  Yahoo News CanadaDenmark, Greenland Leaders Hold European Talks After US Deal  BloombergEuropean leaders call Trump Greenland rift a 'wake-up call'  DW.com",
    "published date": "Wed, 04 Feb 2026 09:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOQW5DTEk5RHhDT2JIZkY4Y29ESVJzT0RhTnlhQTRKTG1GWU1pcV9BNUpuTE5vbEZ6TUdmVktkMlljR0RHTWlFRzRPQmJlSnNYem02Y2xtVDZwVjdqM0JZaXNJaF96VzcxaWc0bXRUeEZ6TmFzODFLWVp1UkJPRXJHNUNtbTNWeUdCQTNSTGhPMXlrdllGaTZzUTZPT3ltakFJUm1QVnJ0MUNUTTZxRlNZYXpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  }
]