[
  {
    "title": "LA 2028 Olympics chief 'deeply regrets' flirty emails with Ghislaine Maxwell - BBC",
    "description": "LA 2028 Olympics chief 'deeply regrets' flirty emails with Ghislaine Maxwell  BBCWhat have we learned from the newly released Epstein files?  The GuardianU.S. Commerce Secretary Howard Lutnick planned lunch on Epstein’s island, documents show  The Globe and MailFrom Elon Musk to the former Prince Andrew, a who’s who of powerful men are named in Epstein files  CTV NewsEpstein files reveal ex-NASCAR driver Brian Vickers' lewd email to sex offender  USA Today",
    "published date": "Sun, 01 Feb 2026 09:50:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1BWTlHSE5HRTVRUG90Rmw2M1dOOWhzLXVybk9pS0RHMWpWT3A0cG5rUzdscHBvTlNlb3FjVlA2a2FYdjMwVUJGVktITEpCN0pJa3RSQjEwQU4yQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump says Iran wants a deal rather than face military action - BBC",
    "description": "Trump says Iran wants a deal rather than face military action  BBCIran's supreme leader warns of regional war if US attacks  BBCIran's Khamenei warns any U.S. attack would spark 'regional war'  CBCUS, Iran signal talks to avert military conflict amid tensions in the Gulf  Al JazeeraWhen it comes to Iran, is Trump a man without a plan?  The Globe and Mail",
    "published date": "Fri, 30 Jan 2026 21:43:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5JSW90eHlkSWs0RFRNYWlvNC10RTJnT0xQaFZvMFRRVVlhczJaM1pLbEFkUjFKWDE4MmdGczlNNks5WktGd1hFVHBjdmlyYWR1X2FIeS1TV3VvUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump says feds won’t intervene during protests in Democratic-led cities unless asked to do so - CTV News",
    "description": "Trump says feds won’t intervene during protests in Democratic-led cities unless asked to do so  CTV NewsTrump news at a glance: president orders homeland security to avoid protests in Democratic-led cities  The GuardianTrump orders federal agents to stay away from protests in Democrat cities  Al JazeeraTrump says Democratic-led cities must ask and say ‘please’ before DHS will intervene in protests  The HillTrump says DHS won't respond to protests in Democratic-led cities until they 'ask for help'  NBC News",
    "published date": "Sat, 31 Jan 2026 21:54:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxQb1pyS0VTTjd5dmQ1dWt2RDRTSXhiNTctWi1vei1wMVpub2ZfYm9raXBYVmh0Tnc3TV9TRnBvZUMzdFZKVUVHMFVYWldzQldlcE9HMUw4eDltZmROTkxkQXBtUjduemFrMjRJUmN6T1BpS0dDWnBUNFRDRk5WeEdkYUZhczBSUWZ3M3ZwQTdTcm1oOWZOZEgtMlJER1oyLVg4QjRpWGNXdGk0SDJOUXIwbDBhbkN2bFY0cXRLSDc2TW1RVDNQaUJkUWJoMjFRbHpfWnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "'Epstein invited to Palace' and 'I have Russian friend for you' - BBC",
    "description": "'Epstein invited to Palace' and 'I have Russian friend for you'  BBCSecond Epstein victim claims she was sent to UK for sex with Andrew, lawyer says  BBCStarmer Urges Former Prince Andrew to Testify to Congress Over Epstein Ties  The New York TimesEpstein files lead to resignation in Slovakia and calls in Britain for former prince to cooperate  Toronto StarKeir Starmer calls on Andrew to testify in US over Jeffrey Epstein links  The Guardian",
    "published date": "Sat, 31 Jan 2026 05:26:25 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5GaEhBVlJZS3o4MGZqcDEyQUZCSkVMaGdzZWQ0X01HUk51cmlacjdDRC02OHJSejZfS3YzRC1tOG5VUDBsNDZxNHM2SktvYnNrM2lQSmFnYWN0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Democrat Taylor Rehmet flips a Texas state Senate seat Trump won by 17 points, CNN projects - CNN",
    "description": "Democrat Taylor Rehmet flips a Texas state Senate seat Trump won by 17 points, CNN projects  CNNDemocratic Upset in Deep Red Texas District Rattles Republicans  The New York TimesDemocrat Taylor Rehmet wins solidly red Texas Senate seat in stunning special election upset  The Texas TribuneDemocrat flips Texas Senate seat in Tarrant County  AxiosDemocrats flip Texas state Senate seat in shock upset  The Hill",
    "published date": "Sun, 01 Feb 2026 05:09:12 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOSTJLQ3lmOHUwaEVzSWttYW8zaFllT3VZOE9MLTlJYjBUcUFpbVNsS2VBRUdvNS10djdYeTQ4NENQdjdfMmlXVHplSGlROC1SRDVLWWtiWUp5WVVOZEo1T1hXMjg1OGxqVGpnNzJpWUtrdkJrVFFaMVpmYjhOSmhsRHFjcGFfZk45LW1ReVBzV3Q1Rnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Judge orders U.S. to free 5-year-old boy, father detained by ICE in Minnesota - CBC",
    "description": "Judge orders U.S. to free 5-year-old boy, father detained by ICE in Minnesota  CBCJudge orders release of five-year-old Liam Conejo Ramos and father from ICE detention  The GuardianJudge orders release of five-year-old detained by ICE in Minneapolis  BBCJudge orders release of 5-year-old, father detained in Minnesota ICE raid  ReutersJudge orders release of 5-year-old detained by immigration authorities in Minnesota  NBC News",
    "published date": "Sat, 31 Jan 2026 20:52:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOVGhndFRCcnA1Yk1MUXJja1dVcm9jZkdwTlNHZ0I5SmdpRTZMZzZaakxmQjVMN3hvSnFfM2FlWk9TMkhIaVA5aVdTYmpMbHo5aTlSWWhrdEc5ajZNQWFvdEg2NkhQOHZRaTNheE56RHRSN1lXZkpxVkR2c091RUJBbUVwYjZULW1BenJZSlpsVjB5MUtiVDlMU2Rxakhudw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Democrat Christian Menefee will win special US House runoff in Texas, CNN projects, shrinking GOP majority even further - CNN",
    "description": "Democrat Christian Menefee will win special US House runoff in Texas, CNN projects, shrinking GOP majority even further  CNNMike Johnson's majority to erode as Democrat Menefee wins Texas special election  AxiosIn Texas elections, Democrats narrow U.S. House majority, land state Senate upset  The Washington PostTexas House Special Election 2026 Live Results  NBC NewsHouston Democrat Christian Menefee wins special election to complete Sylvester Turner’s term in Congress  The Texas Tribune",
    "published date": "Sat, 31 Jan 2026 10:00:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQXzdHTk5EWUcxWEQ0Slg5Nnp4SUFjX0tLY1VZNXhudV9ZYVFZcTdiNnJJNHpCVFdubnluVW9malZTM3NDbmxOanlLenFLZlhwbURQUnFkUVUyS0sxcUszMVRjMVUxVlpRckRoV0h1M0I1Q3ZDSE1QcXNqTjAySWlJMFFWWklNTGFjUHNWOFZwdDNrNUU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Israeli strikes kill at least 30 Palestinians, as Gaza ceasefire inches forward - CBC",
    "description": "Israeli strikes kill at least 30 Palestinians, as Gaza ceasefire inches forward  CBCVideo: Israeli strikes kill Palestinians in different locations of Gaza, hospitals say  The Globe and MailIsrael launches airstrikes at Gaza ahead of reopening of border crossing  Yahoo News CanadaAs ceasefire advances and Rafah nears reopening, hospitals say 12 killed in Israeli strikes in Gaza  SooToday.comIsraeli strikes kill 23 Palestinians, including children, as Gaza ceasefire inches forward  Guelph News",
    "published date": "Sat, 31 Jan 2026 13:48:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5ESU9QLXJGcEU5cFhiVmdpT0R0S1owWG1QSW9DSnJaNnNxaUVid3VjUHJsNXltOG5FTlV0U00yNmpydnktTl9seFYyWlNrZV9ZZ3gyLTMtUE1RWEZSWTVKQUdScmF4SWJja08wd01aSE9wcVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Trump says US is ‘starting to talk to Cuba’ as he moves to cut its oil supplies - AP News",
    "description": "Trump says US is ‘starting to talk to Cuba’ as he moves to cut its oil supplies  AP News‘What the hell do we do with this issue’: Mexico confronts Trump’s Cuba pressure  PoliticoTrump blindsided Mexico with Cuba oil export tariff threat, says Mexican president  CBCCubans queue for fuel as Trump issues energy ultimatum  CTV NewsPresident Diaz-Canel slams Trump’s bid to ‘suffocate’ Cuba’s economy  Al Jazeera",
    "published date": "Sun, 01 Feb 2026 03:35:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPWVZYcm9QZEJhS1FfWTg4aGVDWWVaaGFCdDd2ZHRHUDA4OThUeVVNUkZSemFnZlhFTjRRaGVLeTBubW9BVGxKa2F3TjljUUpmeWRsMDFUS241WXphZzAyUERMSy1IVlN3d0pTOVU2cVNmRFJPU1lzU2FZQWNLWmhFNXRrRWpqQ3F1VkhBSVpSN1ZZd3FCNlkxUXFObGdzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "US envoy arrives in Venezuela to reopen mission after seven years - Al Jazeera",
    "description": "US envoy arrives in Venezuela to reopen mission after seven years  Al JazeeraNew US envoy to Venezuela arrives in Caracas as administration aims to reopen embassy  CNNUS ambassador arrives in Venezuela to reopen diplomatic mission after 7 years  CityNews HalifaxNew US envoy arrives in Venezuela after Maduro's ouster  dw.comTop US envoy for Venezuela arrives in Caracas  The Times of Israel",
    "published date": "Sun, 01 Feb 2026 03:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPLTBsUUdMRWhyZHV5ZDlvdWVrV0RiQzZWR1hzZV9mZlBVRUtISHNrOHpHdzZCejRqSTdyUzVFZENSUHA5WGZ5dDZhOFh1Qk41aG5XeGxLUGIyOHlIT18zZEZkYWJ4ZzhMbWhCWnp5bGRoWDRsckdabmFwRHdCOFZ3YnNzOVE5T1FuZlo0TzIwMFpSVHduNFZQSE1pcWdSLTk3ZC1mNDZ6NnjSAa4BQVVfeXFMUERJLTBtcnpGQjh4Y05Ta2tjV211S0pQeHpWajMyWDk1Q3NYeTVjREhWcklQaGxhMFNNNXdTUm9ocUExOEtpT29OWnAyUkpQczctNDdDREgzRE9wTURQMnE0bWhnM0dLMlBxTVQ0WnRLcU5oRk9McHNIYzl1a0VUWGtieFdQLTRJbHpVX0YtNXVCb0F2SlpqN2dKWXIzX0FQcUtYMGZFQW4xZV9aUTJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "U.S. Senate passes funding deal as shutdown looms, DHS debate to come - Global News",
    "description": "U.S. Senate passes funding deal as shutdown looms, DHS debate to come  Global NewsSenate passes $1.2T government funding deal — but a brief shutdown is certain  PoliticoTrump moved fast to cut a funding deal. It’s a striking change from the last shutdown fight  CityNews HalifaxJeffries says Dems won't help fast-track Senate-passed funding measure, with shutdown expected to drag on longer than anticipated  ABC NewsWhat to know about the partial government shutdown and its impact  Toronto Star",
    "published date": "Sat, 31 Jan 2026 01:04:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNMm56eW1NTGdmbkhPMUVMSloybHliVmQ4TkRYVFQ2QklDWlc3VFlESWVzM0o0bHl4UnhvV2lOWXR4ZHRRdno2SUZvWUlRRnd0dXBLeXFaamxtV3gxcG5vRVItRUkzU2FvYVpKcUpWZVRVN0JlTl9CY0hHeWxEUkVWQXVoS20?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Iran says it now considers EU militaries to be terrorist groups - ABC News",
    "description": "Iran says it now considers EU militaries to be terrorist groups  ABC NewsHow Iran’s Revolutionary Guard became a powerful force within the country’s theocracy  Toronto StarIran classifies EU militaries as terrorist groups in a reciprocal move  Euronews.comIran says it now considers all EU armies to be 'terrorist groups'  France 24Iran declares European militaries as ‘terrorist groups’ after EU listing of IRGC  The Times of Israel",
    "published date": "Sun, 01 Feb 2026 11:36:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQZEtRVmpHVTRKY0tmS2ZyaVlycXNrYkN5QWN1eUxJZjBFbnRub3JOamUwcDZpWlc2MVNIZEUwU3J6YXMwU1ZFcy0yYm9xS1lKbEhlUVFCMnpJakF1WE9GMjR5cF9oMFBSUU9YMmtleWZaalZCSEdBQjVkNGFmOWwtV2NUNGRXZkVfU0NwcW53anFlczRDd1o2cHhGNVRXWHNwcWxtRNIBqgFBVV95cUxPVlRmOGNEVERhVVRvT09lNU5JUmlhTF9rd1UtOEpUTlV0OWJhdy1hanlrZnpxaWM4TkljM1RGM1NHc2g2dEFIM0ZRekRabkF3eEdISHFILVRuMHZodzdyMkdtUHNSNHgwYTh0QXFrMHZWNkp1dmJ3ZDhLWFdtUElCZjA4N3ZvSlZGMUlfcGFxbXNNTmFLYWxic2pDMDNHalBzMWd1dVhFTTJFdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Full amnesty: Venezuela to pardon political prisoners since 1999 - Euronews.com",
    "description": "Full amnesty: Venezuela to pardon political prisoners since 1999  Euronews.comVideo: Venezuela plans mass amnesty law for hundreds of prisoners  The Globe and MailVenezuela’s acting President Delcy Rodriguez announces prisoner amnesty  Al JazeeraVenezuela announces amnesty bill that could lead to mass release of political prisoners  CTV NewsVenezuela announces bill that could lead to mass release of prisoners detained for political reasons  CityNews Halifax",
    "published date": "Sat, 31 Jan 2026 10:12:20 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQNHNNcmdlNHRsUm1qaENDRmFvdjN4ZkVfc1Y5Ym4xM0tLV1lpelhsQlNYOWdmT3FFUUNiSU9xdHIwS1BlN0wwSUNLZzRoSzBJZ2s2RUoyMzhiWUs4M1NrbTZzOHJ6V3otVzYydjljdHRoVnBDdGFKRFVBUGJuNFZlUEthLWtDTDkwNEw0aGVMRk1VZTdwN0dzVDIxR2RmbzNmaDhBVHRYVnlOczJjYWE1Z3lENk5XMXpIZ0RKOHdn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Former CNN anchor Don Lemon arrested, lawyer says - CTV News",
    "description": "Former CNN anchor Don Lemon arrested, lawyer says  CTV NewsFormer CNN host Don Lemon faces charges after anti-ICE protest at Minnesota church  BBCDon Lemon and Georgia Fort vow to continue reporting following arrests tied to anti-ICE protest  NPRThe arrest of Don Lemon is blatant censorship. And he is not the only one | Seth Stern  The GuardianDon Lemon vows to fight charges in First Amendment showdown with Trump  Politico",
    "published date": "Sat, 31 Jan 2026 02:11:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPQXNfTFNCNTBrX3JpRWgycVB6VFVReXVjS2kwc040ejhZeWFCdTlxa0s1d3V6bWdJZWhLb1FtbWVtVUYzZ1NrcWZjdFNHN0ZKenBwWEtvWjBIajNVcXY0aC15N0N0ZHR1MDRhMGpCX29lTkVmd294S2ppSlIxLTJKVGp2aGx4RThxZ3BCVzlfOA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "More than 200 killed in mine collapse in DR Congo - BBC",
    "description": "More than 200 killed in mine collapse in DR Congo  BBCView Full Coverage on Google News",
    "published date": "Sun, 01 Feb 2026 11:27:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9OaEFhZXpaN09Gck9tc2xBUnlXQjlITE5sTV91dE45emZLOEJzMmVHVDcxVWVkMDJmdmlQcnVWZk5pbXZxUEp4R2xxN1k1Vl9SYzlvenR3YjctZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Syrian government and Kurdish forces reach deal on permanent truce - The Guardian",
    "description": "Syrian government and Kurdish forces reach deal on permanent truce  The GuardianSyrian government reaches deal with Kurdish-led forces  BBCSyria's Kurdish-led force and the Damascus government reach a new agreement to stabilize ceasefire  Toronto StarKurdish-led force and Syrian government reach new agreement to stabilize ceasefire  CityNews HalifaxSyria and Kurdish-led forces agree on ceasefire and phased integration deal  France 24",
    "published date": "Fri, 30 Jan 2026 18:59:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPbERYdFBVMERjOXlmVW4xWHhXdXJsTHh0dFR2Z1FNbmo1Z2duT3JqU0gwMk01Qi1Obm5TTXJWYnJnNTNYQ3ZrbHh4dzBub05uMlNoSXNpZGpOUGNVMTJ4WU0wWXRqLVdSN0ZXQ2dLbDlmUThQRjBYc0MyalUyVEJRcmtHMVFsNU5va0UyNnJnX0xmMGp3dXptZg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "U.S. judge denies injunction to stop immigration enforcement surge in Minnesota - The Globe and Mail",
    "description": "U.S. judge denies injunction to stop immigration enforcement surge in Minnesota  The Globe and MailJudge rejects bid to end Trump administration’s immigration-enforcement surge in Minnesota  PoliticoJudge denies Minnesota’s request to end ICE surge in Minneapolis  The GuardianUS judge declines to halt immigration surge in Minnesota amid protests  Al JazeeraFederal judge denies request to block ICE surge in Minnesota  BBC",
    "published date": "Sat, 31 Jan 2026 20:04:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPSG5Qb0NGZ29aeGxBbE9wT3dLaFNueGpaYVRjeUN2eDA1bGVGQWFRUV9rTE0tUWtiN09JYmtjMnJVTlRjODVKOVQzQmRXNzVjNXhRRDZSRnZMVEdTOTdpTlR2TXZpaUJrdFBkNmVrYjdKT0ZKRGJBSkJBc2w1aWw3WmxibXlVU04ya3BoUWNvN3QyQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Blast rips through building in Iranian port city of Bandar Abbas, state media says - CNN",
    "description": "Blast rips through building in Iranian port city of Bandar Abbas, state media says  CNNIran on Edge: Explosions, Diplomacy, and Trump’s Next Move  Euronews.comDeadly blast rips Iranian port city as Tehran plans naval drills in Strait of Hormuz  France 24Deadly blast in Iran’s Bandar Abbas caused by gas leak, official says  Al JazeeraFive killed in gas explosions in Iran, officials say  BBC",
    "published date": "Sat, 31 Jan 2026 14:46:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE93Y0Q5MVV5bUx1aFlWclhCaUNiSDVrRnp4dkJQV3czTklDS2xHZXMtZml4TExCYWpOX1VhVGxKT2hEUGI0MGU0aGVjREpNYXFUbGV5RmMzMVhId2RGS25oeXAwazh6NnV3NnFVeHNTUzdlMWM4RnQ4WkJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Tom Homan To Minneapolis: Look, I Warned You If You Weren’t Nice, We’d Have To Kill Again, And Look What You Made Us Do - Techdirt.",
    "description": "Tom Homan To Minneapolis: Look, I Warned You If You Weren’t Nice, We’d Have To Kill Again, And Look What You Made Us Do  Techdirt.‘Trust Has Been Breached’  The AtlanticWho is Tom Homan, Trump's 'border tsar' deployed to Minneapolis?  BBCTrump border czar Tom Homan promises more targeted immigration enforcement in Minnesota  CBCBorder czar says he plans to \"draw down\" ICE and CBP operations in Minnesota  NPR",
    "published date": "Fri, 30 Jan 2026 19:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxORmtaY3cyRjZlbVBSZ1BXcUF1c3I4T2t6LUxGNjdsTjNyU1dKYk5kcDhJT19sc1k1SmtSdnJySWhwNVdHSEZKaHlJUmZaRmUwMmJjR3IxcU54Qi1QZGNrajBPQVlPd24zdnJiNDhCdjY5THN0X2w0bi1WZE1fXzk4N2lOejY4NmN4ZmYyb2todnU5OVdLa09TYmZ4dFNpcFZzRHItWUVtYUk3TlhwRE5LRWQ2TVNCR0xZbXo1QnAzdlhBQ1QxbDFKbkNMVl9IaHR4bjIyZUcyZEhvMXdsbEl5d0YyZHg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.techdirt.com",
      "title": "Techdirt."
    }
  },
  {
    "title": "What to know about the Strait of Hormuz as Iran-U.S. tensions rise - CBC",
    "description": "What to know about the Strait of Hormuz as Iran-U.S. tensions rise  CBCIranian official denies Revolutionary Guards plan to hold Strait of Hormuz live-fire exercises  The Times of IsraelUpdates: Iran announces naval drills near US warships amid tension  Al JazeeraUS military warns Iran it will not tolerate any 'unsafe' actions ahead of live-fire drills in Strait of Hormuz  Fox NewsU.S. warns Iran over planned military drills close to American forces as Trump weighs action  NBC News",
    "published date": "Sat, 31 Jan 2026 23:09:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE03NU5YMktrTWVUNjg0OGk5VWtxbTdtNzAxRDhhVXYwUldITUJyZnhqS25FRTNfSWlXSzVESndfelFxUDdiUWxDM1N4aVVIbnVSYVZkeHJ6RjYxSDM5ajBYSHYxd1hvS1F1Nk5nVVlQdmVjc3RqNDZLRw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Why Venezuela's Oil Comeback Is Proving Harder Than Trump Expected - Crude Oil Prices Today | OilPrice.com",
    "description": "Why Venezuela's Oil Comeback Is Proving Harder Than Trump Expected  Crude Oil Prices Today | OilPrice.comLake Maracaibo: The oil region at heart of Trump plan to 'Make Venezuela Great Again'  BBCVenezuela's acting president signs law to open oil sector to privatization  CBCVenezuelan lawmakers approve easing state control of oil industry  CityNews HalifaxVenezuela’s Rodriguez signs oil reform law while the US eases sanctions  Al Jazeera",
    "published date": "Fri, 30 Jan 2026 20:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPcFAwOFItdnRldnN0TmhlWFFBQlFSTWZBLWdwajBibTY2cHY5amJvcFcxeGxxdGYxNjJfMkhJbG9wb0VNNlA1dzN5MGVVdGVVbkhUQkRHVkY2WHZKOVdWMm5LY2lMb1Axa3lFYV84cGxKVnN4TkZ3djFOYjlSakl4UXI4QlQxRGthaXVKU0ozZTE3V19QQTZfRnB5dDNJZlUtQ2dLampoaHVmUGxyVDhHSS1Za9IBuAFBVV95cUxOSmRVSlBZVXRpR0JuUWRCOThXSHFDcERqTlVTenRKY05UTlpDQWNiZmpOTTFPWjFiVGMwam5HSzEzNXR1QTlUemZqTFpfY0o0djY5NUxjNGs1V05vbV8yQWxMUmItMlhMbnY2dHVuMVhGa2NEZlRHcnUtSmhudG4xekhKSURnN1BBZlRYcjlGOTkyYzBhRGRySV9OTVUxWHBqSjh3TWxZNEY5VGVOaWNlZGxuUFZweEQ0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilprice.com",
      "title": "Crude Oil Prices Today | OilPrice.com"
    }
  },
  {
    "title": "Lily Jean: Search suspended for missing fishermen after boat sinks off Massachusetts - BBC",
    "description": "Lily Jean: Search suspended for missing fishermen after boat sinks off Massachusetts  BBCRescuers search frigid Atlantic for missing fishermen after boat sinks off Gloucester  CP24Commercial fishing vessel was carrying 7 people when it sank off Massachusetts  SooToday.comSearch Suspended for 6 Missing in Boat Off the Coast of Massachusetts  The New York TimesState senator says missing fishing boat was carrying 7 people when it sank off Massachusetts  Times Colonist",
    "published date": "Sat, 31 Jan 2026 20:39:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE80aWNMWWNWR0Z5aThsWmNzZzNDY3JqNll5UjFCS1NNcnVhZzdPaURxTFp0LVZnVGltMlh5WWo2VXBLVm00a0hTMmgwLXlyX1Z4RGkzRUYxX1ktUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Minnesotans are resisting ICE – and they’re more galvanized than ever - The Globe and Mail",
    "description": "Minnesotans are resisting ICE – and they’re more galvanized than ever  The Globe and Mail‘We’re fighting for the soul of the country’: how Minnesota residents came together to face ICE  The GuardianJanuary 30, 2026 - Minnesota immigration and nationwide protest updates  CNNPhotos of nationwide protests spurred by recent killings by ICE agents in Minnesota  CityNews HalifaxMinnesota Proved MAGA Wrong  The Atlantic",
    "published date": "Fri, 30 Jan 2026 19:26:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQX0lpaGdLZXpUYkNWcHFNWkpPLW1PaWF0cmVDSlNaYXpuUDJNNjdJOHBoQmE3NXByWjhRNi0zLUYwTEhIa0dGWUhMOTBlV2xTenlkMFhDVzAyUmxCak4tb05vdjM2bTRpdWlxVTdOc2VxUURYZGtuZ3lMbzV0d1NUb2dmLTRqTFc3UG1J?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Trump’s Plot to Rig the Midterms Has Kicked Off in Georgia - Zeteo | Substack",
    "description": "Trump’s Plot to Rig the Midterms Has Kicked Off in Georgia  Zeteo | Substack‘Worst-case scenarios’: How Democratic election officials are preparing for potential Trump intrusion in the midterms  CNNOpinion | I watched Georgia's 2020 recount. Here's what the FBI raid in Fulton County is really about.  MS NOW‘It’s a Five-Alarm Fire’  The AtlanticAmid FBI investigation, Trump's 2020 election obsession is still shaping Georgia politics  NBC News",
    "published date": "Sat, 31 Jan 2026 19:14:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5rRlEyb3FyTTJHYkdreXlyTUxwbmttN1NTci1VUDNndVM0TVhFcEExRXlSTDduSUFhVFhRTmxteG14VmhSeER1UnpuaWNrWERwVzU3d3I1ckktUktHbmtQVjB2a3ZJRWtELXM1bjZvZVlNQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://zeteo.com",
      "title": "Zeteo | Substack"
    }
  },
  {
    "title": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics - CNN",
    "description": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics  CNNDespite ‘Wrong’ Comments, Gun Rights Groups Say Trump Has Their Back  The New York TimesNRA attacks Trump after he says Alex Pretti should not have had a gun  The Independent‘WTF’: Pro-gun groups warn vulnerable GOP seats on the line after Pretti response  PoliticoTrump's response to Pretti killing upends Second Amendment politics : Here & Now Anytime  NPR",
    "published date": "Sun, 01 Feb 2026 11:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPZ1NCWC1HOHRSa3BoUHlac1ZpWU5hZ2VHTHpFLW4tLVlwTjlHSXpORmlDRFJ0QnFRU1l6N01PTklBd1RHaTlEcmcxbUc3ZjljRnB2MlVnaHZsT2cwVkw0eFJyT2p2ajhhaDhsZWJtR3lxLVFpOWd6angtWEo4X2dxNQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Iran: A mosaic state rife with internal conflicts - dw.com",
    "description": "Iran: A mosaic state rife with internal conflicts  dw.comCut off from most communication, Iranian protesters share rare stories of determination and dissent  Toronto Star‘Very masculinist’: how Iran unrest felt different to 2022’s hijab protests  The GuardianThrough the eyes of Iranian protesters, glimpses of disorder, disarray and death  CityNews HalifaxOpinion: Iran is crying out for its Nuremberg moment  The Globe and Mail",
    "published date": "Fri, 30 Jan 2026 15:52:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPMDdpMUpxTHJhM2ZhZjlBbHZUcVJoNmFwa0ZCVzFyWWxoQnM0MTJkcFBGVXhlbFUyeF8zUWNfbXpqTkNLaFZ0Q0V6TzkzRUUxZGxIYWpTOVVhQXl1dVZHbTNGNzBYRXVtTjYySDJJakNtNk01VGJleVREcmdHWHJiNU8xVGpPaHhm0gGIAUFVX3lxTE1tRkNYUndpSjZMMGc3WVdVNlN6Vk9QbElOaXdYUm05Y3JyS2N0QzVOeDhDdnFmRFdWT1A3R0tnOXJxOEt2cl9GdEdFcEhKUWs4VEtrV3RlSVROajN2SDdNOEdGeVNUNXBGZ3dKX2ZqTVBZc0FTckJlLTk2LTB2ck12OHdwUmxkWHY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.dw.com",
      "title": "dw.com"
    }
  },
  {
    "title": "South Africa expels Israel's top diplomat in a move that could prompt a strong reaction from the US - AP News",
    "description": "South Africa expels Israel's top diplomat in a move that could prompt a strong reaction from the US  AP NewsView Full Coverage on Google News",
    "published date": "Fri, 30 Jan 2026 17:43:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOS0Y4cWh1SGJmb1ZWeEZTNUx3STFNb25CUnhrZndVZ085X08wTW1ESWJZN2JDbnh0Qm5objk0MllTTC1Uc1c1a3pJdlFMTlVTNFYxSnpad2FCa2FLVGZqdGpwS2wzNnJPRFBaLTdHaXRSUHI2YVROMG9tSUFrYXZOM1JtWjFmbEV0dzhqYzlGWlRPclhaMHRfTWRXbmNtZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "India wants to import more Canadian oil, LNG to fuel its growing economy, minister says - The Globe and Mail",
    "description": "India wants to import more Canadian oil, LNG to fuel its growing economy, minister says  The Globe and MailIndia wants more crude exports from Canada's West Coast: Hodgson  Financial PostCanada Aims for More LNG Exports to India as Carney Plans Visit  BloombergCanada and India vow to boost energy trade. What’s at stake?  Global NewsCarney likely to visit India in early March as Canada trade pivot intensifies, envoy says  CTV News",
    "published date": "Sat, 31 Jan 2026 00:15:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNQmpJV1VoaGlaYl9tSjRZUWdiQTI1QkVYcXV2VENTQUpkeENPTlhmWEE4dXJnamFiVHdoQTlzRVhpVi1DOHlwVmw5TEVGWm9VcF93OUw2bmN0dUtWMEFWRXJDMTNWaGhLbzhKdklYUXUtSHZrN1Fhem5uenppMm91Q1dpekU1WkVVdDJ3MTFVVjdOTDBrNlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Another winter storm threatens to drop more snow as dangerous cold lingers - ABC News",
    "description": "Another winter storm threatens to drop more snow as dangerous cold lingers  ABC NewsView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 18:11:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPU0JDZ3VNV3MyRENhYVJNTU5yYUFMRWtzdWE0MlZvOHFUd2RidWdWSWFnb1F6c21mdkpid18wY3drbDV5eWszVFRkQzV2RlZKUTBkRE5yNWNTck1BZlFpNmkzX2FCdzZVUXA0SGQ3NTJLSDlDbGdpam5WbkI2dXJoS19valNGOTBWR1hNNHExYnZsRjNNekg5RXp5Y2lDQ0hmY3fSAacBQVVfeXFMTkNDM3pjZ2prZ1dSSEFaSy15U3BEazVSd1liN3I3Y0dLaW5EbmZVbkZETndHendQM2FYLUcxNVZ6eF82Rm93QVZ1MVBpdlhKNlVqVDl2ZHhtWmN0Ty1VQ3luQmRSOHRDVGFaWVBoZm4wUTZNajdSYkRtaExKN0hCc0pXMS1ocjJfOENQc3BkekVSYTJuV2xXMGhXZFdYVXdKLWVwRkRtZFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://abcnews.go.com",
      "title": "ABC News"
    }
  },
  {
    "title": "Wowed by the agility dogs at the Westminster show? A winning handler explains how it’s done - CTV News",
    "description": "Wowed by the agility dogs at the Westminster show? A winning handler explains how it’s done  CTV NewsThese Pictures of Westminster Dogs Are Best in Show  The New York TimesDog Show 101: What to know about the 150th Westminster show  Yahoo Sports CanadaSee thousands of dogs compete in the 150th Westminster Dog Show  USA TodayWatch: The dog breed that stands out in Westminster’s agility competition  BBC",
    "published date": "Sat, 31 Jan 2026 19:49:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPN0U1aUJtVjZWN01NdTdnZzE2anZ6UTBvYjlqRW5rampLY0NTQ3IxMFNKaWpYakRjWmhvZnpTcGtHay14QTZKU1JWSUFrSVBUazNCaEI1OGxPQWlXVkFhdEhObW9RZ3g5eklfNWNKc1hidkljQWVVUFlrODlsTVppSGpMNTJ2dnN0dWxGTXlPS3lqUHA0VlNEamZ2bWxTbFF3eWFUNTFUa0tPRlR2ZjVWWWVMOUhyOFpYRHRnQnZpUXEweEVDdGZ0WFdzdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Danes and Italians protest against US Greenland threat and ICE - Euronews.com",
    "description": "Danes and Italians protest against US Greenland threat and ICE  Euronews.com‘We’ve Fought Side by Side’: Danish Veterans March Against Trump’s Comments  The New York TimesDanish veterans protest outside US Embassy over Trump administration’s Greenland plans  Toronto StarProtesters in Copenhagen rally for Danish veterans after Trump remarks  ReutersDenmark: Thousands take part in veteran anti-Trump protest  dw.com",
    "published date": "Sat, 31 Jan 2026 20:47:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQNE9WWXE3QkhLcXlIRllkNGRXUHFaczBnYS1oMWNkeE5hY0RDNVFZOF9QLWd2QVktNE1zN1BsRTFzZTZUaGpmNzMxZng1Sl9lUElLdjhqWHY2YmIweU9kMDZzQ25uRXY1N2lUa3FFVW4xa2Z6bGhRT1FJMDdfenN0a1ZfYW84MHB1NUxYYTd5b1NmMGV2RGw1eDFPN0dxWVpiNVNJeEZZNlA2UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Costa Rica heads to polls amid fears of authoritarian turn - The Guardian",
    "description": "Costa Rica heads to polls amid fears of authoritarian turn  The GuardianPolls open in Costa Rica as centre-right populists aim to extend mandate  Al JazeeraRight-Wing Populist Holds Commanding Lead Ahead of Costa Rica’s Election  The New York TimesCosta Rica Votes for President as Gang Wars Shatter Serene Image  BloombergCosta Ricans head to the polls amid surge in narco violence  France 24",
    "published date": "Sun, 01 Feb 2026 10:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOQVBEcXowQ1d0eHBUSzZvSUg1T1NEdXQzNGNIdEp3WjJ0YWE4MXJPWFA2Y3k1T0Q5X1ljNUE1dGZpR3NCQWU2Sl9ESWR0Y092TTNFUHNNeFVjVmVTN0xHUGlndndCa1BTc0UwcUZsV0J5NVBpSW85b0dtTUZ5WXJCenZERk9pcnVsckw5VW9EZEM0TGRCVEc1UXIzOG05VTRvLW5KbVZ3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "After storm damages Fátima, Pope sends message to Portugal - aleteia.org",
    "description": "After storm damages Fátima, Pope sends message to Portugal  aleteia.orgPortugal braces for more rain as 200,000 still without power  CP24At least five killed after Storm Kristin hits Portugal  BBCRare Atlantic storm batters Portugal  The Portugal NewsSix dead as Storm Kristin wreaks havoc in Portugal with 202 km/h winds  Euronews.com",
    "published date": "Sat, 31 Jan 2026 14:03:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOb2xsbGN1cUlialR4NC05eGxnckhxZlVjUFkzeWxEcTB5NHB1NVFBSlBzV1hHeHVXXzd4OFVIb1NhcFJyRGp5YmFPRWlZNkxZd3ROaTYwOFZpNmpUd3g5VTVTRU1vWVVoRTFwZDY4TFNucG12RWYxU2Nma0ZMcXB2enhoOWpvMzZlTlZjT3hnYjZjZGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://aleteia.org",
      "title": "aleteia.org"
    }
  },
  {
    "title": "CK Hutchison tipped to sell remaining ports despite Panama court ruling: experts - South China Morning Post",
    "description": "CK Hutchison tipped to sell remaining ports despite Panama court ruling: experts  South China Morning PostShipping giant Maersk to take over Panama Canal ports after court ruling  Al JazeeraPanama supreme court cancels Hong Kong company’s canal contracts  The GuardianPanama High Court Gives Trump a Win Over Canal by Ousting Hong Kong Port Operator  The Wall Street JournalChina to take 'necessary action' after Panama port ruling  dw.com",
    "published date": "Sat, 31 Jan 2026 13:00:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPZ19jQ3RncjRvbk5KSDItbzhkUFFVQ19qUkU2Z2d1TzFMUldQNXRHTERDSkFWUk9WM1d4Z0xGN1NCRHc0TDlYQWJERkpMR0RSa2wzdngxQjM4clBIaXhXM0FCZXc0N2ZwQlZzRXhoNldhb1lIYjdkVklMeUZXb1p1eUd6X0haMFZaN1RGQThwSXAyRk5xTU1EcFZGa0ZHSW9PYWRpZF9Vc2k5Q0ZZZXZlcDBMbV9PSENoU1BGSk9DWEE0ajVXTW95Qmxkd2J6Ni1IOWYzMlVzUXlUQXdibGo40gHfAUFVX3lxTFA1R01WM0JBX2xIQU15Nk5tQkw2OVpaUXNRbFNwNUk0c09mSnFrbzM2WUE5bjZ5WDNJZkh2MEpBeGJXSDJBQnFOWnVvWWFTQ1hqbVB0ZnF3RVotejFyaUxLN2stT0dNa0NVNVhTNm9qNnJJODZITFlyS1ZJalV2ZjRfam1lQmJyUHlLcHpfTERqdzlVYWlrcEhwckhqRFpxYzRHSlBhYmJ3OWVLcU9QVHhFbE16bHBSMFRzMG92RFBmSERaOTFPcUFNeHcwWGZSRFNFZzh4ZlE1eHBtdzdBTTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "The illusion of a ceasefire in Ukraine - The Kyiv Independent",
    "description": "The illusion of a ceasefire in Ukraine  The Kyiv IndependentTrump claims Putin agreed to halt strikes on Ukraine energy sites amid extreme cold  The GuardianConfusion in Kyiv and Moscow after Trump says Putin agreed to pause attacks for a week  NBC NewsA handful of attempts at a ceasefire in Russia’s war in Ukraine have proven futile  CityNews HalifaxKremlin says it agreed to halt strikes on Kyiv until Sunday  CTV News",
    "published date": "Fri, 30 Jan 2026 20:29:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNcElTbUpMdlRhZmp6blBpMmxoQ2F1TEMydmNneUswaU9jbEhiWHZIbzdrSDNmM0c3ZEw4N2VJd3JYb0FOaFpma1NZdmRRdndFWm1LcDlsbTM4cEYwbGpfV1lBdndRQVBXU0VwWTNucEJNYmdvVTFvRWtHc2ZEVjN4QTg1bnhBbmVuS1U0SDhUQ19BVGI3WEhJUVZscw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Women joggers 'prepare for the dangers men do not have to face' - BBC",
    "description": "Women joggers 'prepare for the dangers men do not have to face'  BBC",
    "published date": "Sat, 31 Jan 2026 06:15:38 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE93b3luLW9KcDl5aGZUMUZfcThDSk1hSUFIOVdyOXdhbUpsX28xS1BGTUtKa00yZFc4Rk1nRm4xWVozME1jZjlCd1Q4NHhKeEVBdVUxSWQtLU1RUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Milan protests decry ‘creeping fascism’ of ICE role at Winter Olympics - Al Jazeera",
    "description": "Milan protests decry ‘creeping fascism’ of ICE role at Winter Olympics  Al JazeeraMilan protesters call for U.S. ICE agents to leave Italy as Winter Games approach  NPRUS sending ICE unit to Winter Olympics for security, prompting concern and confusion in Italy  AP NewsDemonstrators in Milan protest ICE unit at Winter Olympics  ESPNWhy members of ICE will be in Italy for the Winter Olympics  CBC",
    "published date": "Sat, 31 Jan 2026 17:16:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPSjdRaGk4TkZZYjhaTEtfRm9BaUJtdGl2WTdjYVlRS2hKQTVENGFydWZKWHgwc3dxT192U0Z2RnpZT09uY0lsR282Yy11SklRcGVoUzRXeVhOWEhrQmxBVU5QNEFLb2lzajhGQ0NaWHo4X0Z4RWZ3M2Q5Z3lFU0dZUFZBTWFqU3JJVVZod2t1LVFvd0JVWG9IMDV6Y09YaFJCNmFOcjhfQWRVTXJGU3VvRF9ldGhlZTDSAbwBQVVfeXFMUEUwc0k5VjFvXzQ1Zm9tSFdNMEhIMk8yV0JRRU00Qnhkb1NaTXdwSjJNcktkYXVFRXFWRW5FZGFYdV91Z2duU2cxNGVhcmRFSTRCQV9iQ0NzNUZRb1lrdENrUHZrdzFUMDdMVndFWG54UjRDWWRlVkU1U09hX3dyX1ZkMW5rSzliRVNuVjRvUkxNeFVha3hSekRjbGh1aGRlSGVmM3FaWWpJR1dreWo2R2Fsd3VJdmVudXdIT0c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "The Aztec empire’s collapse shows why ruling through coercion and force fails - The Conversation",
    "description": "The Aztec empire’s collapse shows why ruling through coercion and force fails  The Conversation",
    "published date": "Fri, 30 Jan 2026 16:53:10 GMT",
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQaTVDYzJqdXdiNkhuNWdhMG1hdjJZQVo0RGpEanRhclZiNktEZHdqLXVTZHlWaklfdFJ3Q2RWX1hMZUstQmF0QVAtOEcza2d5Ql9YMDlQTnlJZngyS3NoQ1ctNzRuZXNsUFdfVndPS01yQU1GbkNsX3VDSmNnRk1KcFF1cno1X3ZpUHpYNmZHM2h3d2pzNlNLaThUOEEzZ2FQZ2RSdzJIeEFEWXM5eEY2bQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://theconversation.com",
      "title": "The Conversation"
    }
  },
  {
    "title": "Pushed by Trump, US allies are resetting relations with China - AP News",
    "description": "Pushed by Trump, US allies are resetting relations with China  AP NewsHow the Chinese Communist Party exerts influence over other countries  National PostU.S. Allies Are Drawing Closer to China, but on Beijing’s Terms  The New York TimesWorld leaders flock to Beijing, hedging against U.S. disruptions  CNBCTrump Is Making The ‘Pivot To China’ Trade Great Again  Forbes",
    "published date": "Sat, 31 Jan 2026 03:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMUJwa1ZyeWU5bVdqR09JTlVEOUp1S3VCb2ZBMkg2U0Z6eEU4Z29VRTNvUHQ1MFpsQUx0RlpGak1CbnFfb25pb2dYUVhvcGdHYXdyYUlYWFpUQlRyd084emFraG1yOXJNekZGaVY3THl0VEZXR2N1ZnEyWEs5Z19ac0tkWl9BOGxrNVRhckZSc2t1TFd6Z2Q1cU9UT1MyakVtWEdv?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "EU Faces Hard Choices after LNG \"Wake-Up Call\" - Crude Oil Prices Today | OilPrice.com",
    "description": "EU Faces Hard Choices after LNG \"Wake-Up Call\"  Crude Oil Prices Today | OilPrice.comEurope Gets Deja Vu After Swapping Russian Gas Dependency for US  BloombergUS share of Europe’s LNG imports increased to 60% in January  BOE ReportEU will seek to cut US energy reliance after Trump’s Greenland threats  politico.euAs Europe’s Reliance on U.S. Natural Gas Grows, So Does Trump’s Leverage  The New York Times",
    "published date": "Sat, 31 Jan 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOeXp1YzBOSk9leWZ6NXZEM241blhEUVIzRTEzVjBCOVlsT2FVV2JEUHJMSGVNSVg4eGUwb3Nmc3Iwb1hMT0tsVHJzNDM3NkZVaU5keUdRZkxVd09KQUdXX3Z3VTJ4OTU5RWNILUo0RUFINWU0djdtc2lRSFpoQkMzcWk2STNTVGpLWGJRZUNDSzRTWVnSAZgBQVVfeXFMUFZUM1JESmlLdEtHS1VGUkVzd1d6V0lNUTktYmo4aHpDRkpTYUxUMWFDcmh1bUJQRm9HX3RmQzlWQXFJYTVKNHh5ZHdnNm4tanozeW1ZeFRKMDlsekJCTmFaOHVPczNXQTRGMGdiYld0WDRDdEFqVTkwQm91Mmc3TktEdGJGZFFzUjFvdlAtT2Jic0dIU3hhU2I?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://oilprice.com",
      "title": "Crude Oil Prices Today | OilPrice.com"
    }
  },
  {
    "title": "'Part of the evolutionary fabric of our societies': Same-sex sexual behavior in primates may be a survival strategy, study finds - Live Science",
    "description": "'Part of the evolutionary fabric of our societies': Same-sex sexual behavior in primates may be a survival strategy, study finds  Live ScienceStudy ties same-sex behavior in primates to ecological and social pressures  Mongabay",
    "published date": "Fri, 30 Jan 2026 16:40:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxOWFUxMG1EV0RLZWpTVjluczY4c3N6MWVwMHBnX01HdTJMV0JHTV8weExSVHBFY3ZyRkstUXlWWW9YVlotM2ozbGttSzRCUmo1aWFESjBMdUdsbmNmSDRHTEVTSXhxTk5SMUxFbzE0cHB3Uk00RFVrVGpNLXFHTC1FZGtLa09taFY4VGFTR282Q3dHeTJ2cWVjVmlXbVktOGZiUE9qNk05Sld0dWVFSlN1X2owbkVseDNQRmM1Zl8zTmpBRDM2LV9hUGFXNTBRQkJ3UW92ZUM5SDRGaEkxbUZMVThncnB2T3JVeWNPWGd5bzYzUmhXTEtlcXllOHNQRHBiU2xF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.livescience.com",
      "title": "Live Science"
    }
  },
  {
    "title": "'Russians are to blame' — Moldovans react to mass power outage after Moldova-Ukraine line malfunction - The Kyiv Independent",
    "description": "'Russians are to blame' — Moldovans react to mass power outage after Moldova-Ukraine line malfunction  The Kyiv IndependentPower outages hit Ukraine and Moldova as Kyiv faces winter cold  CBCRussian Offensive Campaign Assessment, January 31, 2026  Institute for the Study of War'Normal life has disappeared': Russia's energy offensive plunges Ukraine into dark and bitter cold  ABC NewsMass blackout and water shortages hit Ukraine  Euronews.com",
    "published date": "Sat, 31 Jan 2026 14:32:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNaEo0THpuV2dYbXRQejkyRVM3dUJWNGdzLVpEdC1vMkZUOXFCYjFuWkRxd0FQMnFzd3VDaHEzUFByeERPdzJjOTdHN3BqNmpRaWYtajZzY2dES0RGUzBjb3EyRWJHN2lsUUc1SXlzOGJPMXZmZ1hxRVk5ZWIyM3RYZzFZZHVqVkVqU0xQalk3OWZRUkpZRVd3bU95elRVSkR4Wm9uVThCRDBnU0hlVXBPRUE4c2I1QnY0SEtvWU5fZ05zczdF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty in federal trial, judge rules - Global News",
    "description": "Luigi Mangione will not face death penalty in federal trial, judge rules  Global NewsProsecutors can't seek death penalty against Luigi Mangione, judge rules  CBCJudge rules Luigi Mangione will not face death penalty in healthcare CEO case  The GuardianLuigi Mangione will not face death penalty if convicted, judge rules  BBCFederal judge drops murder rap in UnitedHealthcare CEO case  dw.com",
    "published date": "Fri, 30 Jan 2026 20:33:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9DbV8zWjhLY1dNVVNydVUzS19WMm9hN2ZZejhHVF9UTkJtdmptREpxT1gzVkNPeFlwZmFqcnRscV91eU5WdFQ4SGI0Rk1vdElVRDQ2UHpmSUVuYkRwYUdxamxwRkdTUXV2cWE3YV91WWVGMmFYLVZj?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "200,000+ outages remain almost a week after devastating ice storm - The Weather Network",
    "description": "200,000+ outages remain almost a week after devastating ice storm  The Weather NetworkThousands still without power as brutal temperatures head to the South  ABC NewsThousands face another arctic blast without power as East Coast preps for a storm  Toronto StarNashville resident without power after ice storm asks electrical utility for answers  Yahoo News CanadaTens of thousands enter 6th day without power as Carolinas and Virginia prep for a winter storm  The Spec",
    "published date": "Fri, 30 Jan 2026 21:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNT2V1M2NxcjhJSkdjMXd3NlFuLUE5RXA4OUFZckZsN3pZck1LM1NuZlRMMlAxRVhvd1RHekQ0TDRPYzd1YkJEdW1JNGJtSVNDNEx0MlYyWk8xaG9jc2l1SlFJSlJLMUFmS1BaOGM2d0FuWDNFdDJpZ01Yakc4STd6NDJjUGJuOG56SFp6ZVVUcXZaaFVObWlYVlNGbTN2N1lCQzFjZ2FwNVVZMk1JcnlfWV9YNFdENlRxdDJ5LXVYSEY0dW42VHh4bW9EeE05UE9welljc0JKVFRJd28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "In America’s first sanctuary city, anti-ICE sentiment is revitalizing the movement - The Globe and Mail",
    "description": "In America’s first sanctuary city, anti-ICE sentiment is revitalizing the movement  The Globe and MailResistance to Trump 2.0 is getting more confrontational | Dana R Fisher  The GuardianFrom Davos to Minneapolis to D.C., Trump is facing sharper pushback  The Washington Post",
    "published date": "Sat, 31 Jan 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQeVQxa0VWMkJsV2t0Zmg2MUs3UzUyeER2MWhuX2hNOHBZS2VycXFONW1XemdFSDR4TDNYc3Rfbm1oMmpHdzkyV3V5WFlSWDVLX05EMGlRN1kzS1JGdG9nNVREbzVBRXlZVC1Gd1VMcUJycjhDS0szaGg5S0diRkRJdnE3V0doMGVLMjNYWWptcGFaTnB4QlFoR1pReEFaRWZxQmEwaE1BSmhsWVZNbmlyMDJmWldWSzFIN3gxMEJR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "It Wasn't The Pilots: NTSB Says The Black Hawk-Airliner Crash Was Due To FAA Failures - Jalopnik",
    "description": "It Wasn't The Pilots: NTSB Says The Black Hawk-Airliner Crash Was Due To FAA Failures  JalopnikInside the Cockpit of the Helicopter That Caused the Potomac Air Disaster  New York MagazineResponders recall a mission of recovery and grief a year after the midair collision near DC  CityNews HalifaxClose helicopter routes and Army crew’s perception of the wrong aircraft determine why a regional jet and helicopter collided  CNNNear misses continue in US skies one year after deadly Washington, DC, crash  WPTZ",
    "published date": "Fri, 30 Jan 2026 20:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPelZvS21aSVRUOVVKSFE5eUl3T1gtT0U4VWc2Z25DU01VNnZqQThnZkF0cURveWxpMWp3azFfYWZLeExkTFE0Q1VGb1RZakVMRU00eUdYbHRwSHBldGZCWHBVMGhqbXJsODJRemZMZnBCSFVJMFAwZlZFQXRnb1JpdTlTd2dyYW9Lc0JBbg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jalopnik.com",
      "title": "Jalopnik"
    }
  },
  {
    "title": "Big revenue, trade leverage, and industrial perks: Why Trump’s $264B tariff haul will be hard to give up - National Post",
    "description": "Big revenue, trade leverage, and industrial perks: Why Trump’s $264B tariff haul will be hard to give up  National PostOpinion | Trump’s tariffs can’t cover a bill this staggering  The Washington PostWilliam Watson: Trump's tariffs hurt more than their average level suggests  Financial Post",
    "published date": "Fri, 30 Jan 2026 18:53:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPaERIQWdudS1zU014YlEzTG9ZYnl6M21WakpyTmI0ZnVJSVExeWtNTXEtTG1aZC1NY25MdHgxNGtuRHRlLThSZ3NIbW5fX3NqUFZDQzhleF9kZG9WeVdEVUlLSDU3aEpXdnNPYTJvRTk4Zk9ZcEdGVXlMdzVEOVFaQ1ZtbmtsNHJPeFRUWFVPQVduU0pubWJ0M2c2Vml6QlFfMnV2czJLQ3dScm9XNWUzeE1jOWRjd2hrNENEbGk4d2JGamNRUVZlQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://nationalpost.com",
      "title": "National Post"
    }
  },
  {
    "title": "Los Angeles man allegedly steals plane and lands it at airport - CTV News",
    "description": "Los Angeles man allegedly steals plane and lands it at airport  CTV NewsMan Charged After Allegedly Stealing an Airplane While High on Drugs and Attempting to Hijack Another  People.com",
    "published date": "Sat, 31 Jan 2026 20:41:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOWHRtTjhqNHREdGFKczBXdzVuV2sweWd6SldPVmoyMkZCVVB3dFMyc2JHX3c5OUJCMU5QYUhZSGZUVm02dkFGNEd0ZVI4aTA5TWdkYzAwUmdOOUp5M3dsM09WSHhJWXhoR193eVA1d3NwRklSV3pYN09zMURkZzhhWE9CVG9ISTRBOWdBUw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Trump sues IRS and Treasury for $10 billion, cites leaked tax information - Global News",
    "description": "Trump sues IRS and Treasury for $10 billion, cites leaked tax information  Global NewsOpinion | Trump's absurd $10 billion suit against his own government  MS NOWTrump sues IRS and Treasury Department for $10 billion over leaked tax records  NBC NewsTrump lashes into female ABC News reporter with new insult when pressed on $10 billion IRS lawsuit  The IndependentIn Trump v. Trump administration, is Trump sure to win?  Straight Arrow News - SAN",
    "published date": "Fri, 30 Jan 2026 17:59:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE91dE01c1RCSGN5czlqQW1SZkM3OXNYeEZ0RE11SjVkZUJtclh6alM4cDBLYUtmbXpWdGNrOXlwdmktTUFVV0JvdkxVUHA4QklFY2lDMklfTVVHYTVCeThDS2xNSWRqTDFzMXJ2VHV3T01ZUWhW?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "UN risks 'imminent financial collapse' by July, Antonio Guterres warns - Euronews.com",
    "description": "UN risks 'imminent financial collapse' by July, Antonio Guterres warns  Euronews.comView Full Coverage on Google News",
    "published date": "Sat, 31 Jan 2026 08:44:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNQXJqWEdqUlpkWl9JMjJSUnlTOUxCbTNTZ1cxMXZuTEhTbzVJQTRzTENoNWJCYWZvT3RhSVVfdDhfX2ZCTHNILVoyZllPZmQ3ckZ4VTBCOU9feTAtdkJHcUhka2dmOVNlSHVEM0E1UDlJMFBKb3YwV1FLaDdOOHZRQlEtejg5REwwNGRlQ1ZYQmR0THd3TTRxcHVmTkRlZU4zMmQ3cFdyc08yYWRsZmYxNWlFOWVHTkJvbm1udUZuT0VOZ25X?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "'Don't know when they will deport me': Pakistanis line up to get approved for regularisation under Spain' - Times of India",
    "description": "'Don't know when they will deport me': Pakistanis line up to get approved for regularisation under Spain'  Times of IndiaSpain offers hundreds of thousands of immigrants a way to stay legally. But who are they?  Toronto StarImmigrants in Spain celebrate government plan to legalize their status  MSNWhy Spain is offering amnesty to 500,000 undocumented migrants  France 24Spain Moves to Legalize Migrants, Defying Europe’s Anti-Immigration Trend  The Wall Street Journal",
    "published date": "Sat, 31 Jan 2026 22:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgJBVV95cUxQRVd4Q3J4TE9GT0dWWkZpcWs5QXFRb0MzWkR0bWNiZVBiSGRoeEY5NXNIVklsYlEwams3SzFOQnlKUjRuWmYxWkVtWGpnWEpldGI4NUh0U2pFNjZpbFhFMmRFYlZDZHpUdnFETW1vSko1T19lalZJWTJjU0lJSEdIcTB3OE1xaEN1MFFlWmN2cl9vczNkZzk4cXJTSFdQbkZ6MEtnZmI1ZHZWc0ZjR3FHZ0JiTmhObFdMQWlKVmRuXzZLeVp4eTJ6UVFNeHFrMVBia2wzckxjLUJrcHE3WVN2aVRscVNUdnVPNy1qRC1sZXh2YnB3WHFNblVMcDA1NTh1UXBUakJIVGl0R0dSWnF3SE5B0gGXAkFVX3lxTE1qampGNmw3SjMtemVfZXpma2kzay0zM0hLbHVpNjJYY2psb2NUc3J4VmNNMWFkWE5yZlEtaUhkLVFseEZvVDd6S2d5QnA5NHVaWkFpX2xaTE42MUVlU2taMUFfaDhPdzR1N0UwUUVuNHlPRTNtSkxnQTNBZzk5SGh6UjQwNm1xUHBlYW9abGpmTDdzUUJtZVdNOU5SMVlOemhtejJfYmxGc250eGtGTmRiTGlZSlpla1dsS1VWbVV1Wl9vc2pDcTZSM0lSOFNaTWI3S3Z5WExHdUtuUTV5dWRPeXNHanRzQWRjbE95OHd0V0FpRFF3Z3VobkJ5SGo0MEJDd2J4aVFxVFZRa2V3eU5UWTA5amNXcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "ICE claims that immigrant shattered his skull running into wall - CTV News",
    "description": "ICE claims that immigrant shattered his skull running into wall  CTV NewsICE claim that a man shattered his skull running into wall triggers tension at a Minnesota hospital  ABC News",
    "published date": "Sat, 31 Jan 2026 15:42:14 GMT",
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQUkYxVTBNUlZNTV9QTjZ0aktCLVlNdlNjcjlTVnRNWUg1ZjM0WE5jaHJDNHhPZmRtU3ZBelpPdnFLd3lwdHJVblhKUTFYUWwteEF6VUxPbWxNcTFIX0l3dndGRUlIOWxDWk51VDJuNXRPazgxRmw5cWVtcHVhcXpiM2k0OU9hVUlsS1hKdnVvZl9ZNkFvaU9xS01aN0ZjeHJHTjVr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "10 unexpected places to escape urban noise - BBC",
    "description": "10 unexpected places to escape urban noise  BBCThe Great Disconnect: Why 2026 is the Year We Traded Algorithms for the Earth's Pulse  Big News Network.com",
    "published date": "Sat, 31 Jan 2026 14:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNb1Z3akxyaF80b0RFR1o4OTVlSENmQmk1Mk5MRzZESFpGX25SYkh3NzBnVDhPQUFqekxibjdlTlRXaDQ2T0dpZ2x3TDJFdE84UkYwZk5yWExrTUlmYURkTWlkS3lnUmpZbDBuRnlWTHVyV2pyeU1BN3NXd09DRFNvMEIxZzRiTEFSNW45cmJ5dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]