[
  {
    "title": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say - CTV News",
    "description": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CTV NewsUS military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CNNIran and the US lean into gunboat diplomacy as nuclear talks hang in balance  Toronto StarUS military ready for possible Iran strikes but Trump yet to make decision, reports say  The GuardianCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI News",
    "published date": "Thu, 19 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNWW1sV3QzUzhGRGs0SlZOcmJEVzlyMndqQ05xTmJNWDRIdU00amNKcWUwbjUwVUhnNENRZ1dzQjdaZEhhSzc0YURLQ3IxaEpOUnprVDlBX1FBLVJlMllCR0lkYXEtS044T2JJY195T1JteHZTYXNOVHE0WGREOUMxTUZxajVobVFERXBzNDhFYjMwZHg4bXI2dFNlT3pBUXlGM1U4NDNEcUcwVEpnNnJhUDdJZ1NWOTNfYjVIQ1NRZ01UWkxjYllyMEs1amZEOFB4TVRiMkVpeTdSSEVJN09OZElnWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Team Sweden left with 'bitterness and heartache' after OT Olympic ouster - NHL.com",
    "description": "Team Sweden left with 'bitterness and heartache' after OT Olympic ouster  NHL.comQuinn Hughes' OT goal sends U.S. to Olympic men's hockey semis  ESPNUnited States leads Sweden in men’s hockey quarter-finals  TSN'We Came Here For The Big One': Connor Hellebuyck, USA Eliminate Gold Medal Contenders  The Hockey NewsQuinn Hughes USA’s OT hero  IIHF",
    "published date": "Thu, 19 Feb 2026 00:47:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNRWhubExzTE95MkdJemgxcFp4bUVESjQwSlRXaWxZcUl0TjFfMG9GZldaNjQ1YXo5Xzk5emZlSVZ4a1l1ZGJ0bWdyWjlKaExBSk1lRUp3VlJPNGFxbVAtUThNNWZhZ0N1ZHI1Z1hRTXlfbkZCbnVOeTdZQ3QwaEZqaVdvWFR5UW5hbHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Eight skiers confirmed dead in California avalanche, ninth presumed dead - The Weather Network",
    "description": "Eight skiers confirmed dead in California avalanche, ninth presumed dead  The Weather Network8 skiers found dead, 1 still missing in deadliest avalanche in Northern California in decades  CBCSkiers with roots in Lake Tahoe’s alpine community among 8 killed in California avalanche  Toronto StarEight skiers found dead after California avalanche  BBC9 skiers missing, 6 rescued after avalanche near Lake Tahoe in California  NBC News",
    "published date": "Thu, 19 Feb 2026 01:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOWFdkaTlLZ25qRWpCMEVPc1NpUjVuLUMyc1RsN2l1WGZiXzRpTW9LM1FTWXZoLWkwcENHWG54Mk8xdEkwN1I1aGZTVVJfRzVqeGZXQVdFX0U0VW5TTV9na1JwX0Rjd04wdWZ4bGlOUHcxZ082ZUQ4ZjBrWnJDczZITkM1MUlaN2lyR0FjUExaSkFMMTJ2bDVLbFpmWWxKd1NCbzlURmhTX1VCajk1OGtCVFRvdFNfMFFfM0RjSWdUZjczeUFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theweathernetwork.com",
      "title": "The Weather Network"
    }
  },
  {
    "title": "'Difficult' Russia-Ukraine peace talks end without breakthrough - BBC",
    "description": "'Difficult' Russia-Ukraine peace talks end without breakthrough  BBCUkraine war briefing: Trump sees conflict as ‘very unfair’ for war dead and US taxpayers, says White House  The GuardianVideo: Zelensky ends 'difficult' Ukraine peace talks, accuses Russia of stalling  The Globe and Mail'Difficult' peace talks spotlight Putin's chief negotiator and Ukraine antagonist  NBC NewsRussia-Ukraine talks: All the mediation efforts, and where they stand  Al Jazeera",
    "published date": "Wed, 18 Feb 2026 22:33:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE10TlRjZTFxT3ZSbF9TQm52SWlVZXB3M0x2ZThJcXhjcEdMN25SYUMtVXVKSl9JaTZPbklzTkJfX3BTMmR3VkFNbjg3VzR5Z2pXTW01dEIzZ2tBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader - Times of India",
    "description": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader  Times of IndiaJesse Jackson (1941-2026): The life and legacy of the civil rights leader through the years  CTV NewsAfrican Nova Scotian community, church leaders mourn Rev. Jesse Jackson  CBC'He did it for us': US soldier recalls Jesse Jackson's efforts to free him and two other POWs  BBCSports helped shape Jesse Jackson's career and inspired the ex-quarterback to fight for equal rights  CityNews Halifax",
    "published date": "Tue, 17 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPUFF1QmE1cUMtU2hVVVJLVWNvdjdPV0stZXFldzBWakY1bVAwVUZLM0J5anV3S3VjNEowOVlCMklPZFJQWnBlTFlrN243S1FIcnZhWUFFUmp6ZzhMcngwd05uU3MyOGNlRlBRTnlsdVNUdnBVdzVmRFZuV1JOVENTS005bzZIWVo1X1k2d3pjVXFKNUdmdmp2VWNQcDFJM29CU01qbTJPSWxuOE5GSUFqb1N4V0VCTWZ3N0hpTWdndDZEYXVLMWI1bE4yTDVHM0tSV3o1Q0xpWHdTQTRsb0FyYlRVbXE4QVRudUNjTTF3ZWZ2NU9mM1BiamsxTdIBgAJBVV95cUxPaXRXbjVyOU14VFR3YWJYeW5WRDJvSHBaNjFVRFUtN3kzVUgtcEFheVExRlZYaUN2SlRQZzBpTGtjUWNOeGRkbndsd2t5dVNYY3VfZTcyYjlFT05naHZiLXAzVEtnM09iRmI0bnYyZ1ltTTlFejNsdU1MRVBES1dIU0g2ZmY0QktmOHNWNkJXRVk3bFIxV2wxNlpKMEhtZWMtTDZ6elRTczkwMFVINkRETXZXOVVDcm1nTi00ZXEzbmRHckVOcHNFNU9lZUVHQklacHF1dlQwWTNiRWM1Y2xuclk0TmxpUFVQc3JxSU1YWlFldzhLcTVZNmJkRC04NDNK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "China’s dancing robots: how worried should we be? - The Guardian",
    "description": "China’s dancing robots: how worried should we be?  The GuardianChina’s humanoids are dazzling the world. Who will buy them?  The EconomistAnalysis: China’s biggest TV event had a clear star: the robot  CNNChinese kung-fu robots steal the show in world's most-watched TV program  Le Monde.frChinese Kung-Fu Robots Put Western Efforts to Shame  Gizmodo",
    "published date": "Wed, 18 Feb 2026 17:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQVkVESmpXbEVnMmFWOHoyeWVJRmVhZjBQZ3NaZ0lMcDd2YmVNTWtDUDFUaXdrcXRIaUVMaWk5MFgzd3dvaFJFWDEwMWt5RlRaU0dTS3FBSjRJODRpdU93MTg4WjZJREVrQ1hBY0JkNzBDd1h6eWJ2M0xTLXdnQ1U0cmFJRG5QOVI0bVFDMG5TV0VqSFE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview - Global News",
    "description": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview  Global NewsCBS lawyers pulled James Talarico interview over fears it would violate Trump’s regulations, Stephen Colbert says  The Globe and MailFCC chair Brendan Carr says media were ‘lied to’ over Stephen Colbert controversy  The GuardianFCC reject claims of censorship, announces probe into US show The View  Al JazeeraWhat's the equal time rule at the heart of the Colbert-CBS dispute?  CBC",
    "published date": "Wed, 18 Feb 2026 16:14:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9tSTZ2alNoeEw1Mi1XZ3AxVlJsV1JCeHFIMVd0bE5HRVRpZ2wwSkZzS1puZlI5Wlp5SUZSYkR2NDhNUU9haVA1NF9BLVlzSVlVX0JMcE8wbXpRVmkzTDNtSVpVZ1JrRVlOcFY1N0c1am55Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Peru has lost another president. Here’s why, and what happens next - Global News",
    "description": "Peru has lost another president. Here’s why, and what happens next  Global NewsJosé María Balcázar becomes Peru’s eighth president in a decade  Toronto StarPeru appoints Jose Maria Balcazar as president, ninth leader in a decade  Al JazeeraPeru’s interim President José Jerí removed from office amid corruption investigation  The Globe and MailPeru's Congress ousts president after four months in office  BBC",
    "published date": "Tue, 17 Feb 2026 22:43:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBUTlk5VzV4RnRvNXhuM0JLTWxMbnA3ZHZDNzZpV2hQbm1TVVF2MjNNbF9lal96YWQycGY3YWJkdE0yNVNoeTRkS19OdFNNWFNXSVVPczVtSnlqd3VZLU5uREg0OVA2WDVnZWFKcmlJUUpnVjdkMEZTWE11VHNmTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Iran security official appears to fire on crowd at cemetery - BBC",
    "description": "Iran security official appears to fire on crowd at cemetery  BBCIranian families mark protest killings as schools observe strikes  Al JazeeraIranians Mourn Slain Protesters With ‘Revolutionary Rage’  The New York TimesPopular anger burns in Iran after crackdown, as Trump turns up pressure  The Washington PostIran's 40-Day Mourning Ceremonies Spark Renewed Protests  Radio Free Europe/Radio Liberty",
    "published date": "Wed, 18 Feb 2026 18:14:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA2MW4zcHpCOXl5b3cwLVRaYWVvWGNmNVIzMWU4ZGtVWER6aVpaR1pmdTM0NGd5SnF2UDYtZEJWd3lmMTdtaC0wWDdZNEloTW1sOXFaaWdtMllLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Witkoff may have gone out on a limb with a new Iran agreement - Asia Times",
    "description": "Witkoff may have gone out on a limb with a new Iran agreement  Asia TimesIran expected to make written proposal for resolving standoff with US, senior US official says  ReutersIran’s Khamenei maintains tough rhetoric with US despite nuclear talks  Al JazeeraIran’s supreme leader threatens to sink US warships as nuclear talks continue  The HillIran says progress made in nuclear talks with U.S. after partial closure of Strait of Hormuz  CBC",
    "published date": "Tue, 17 Feb 2026 23:16:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQSVlPMTVVd1lqa3lRRUp3U2JSTVpwZmJTUk5ub2lOc1dzRmYyVHVWWG5udWxDMEtCdzVSSm5kelpOLVFmWUlBSlB1S2RnV0hPQzBvd0VodnRBbWVsREFRVmVzQ2dsWmlaQVcyTWoyOWVNeXVhbUlXRE8tX3JBdzU0QlhCTnJlUlgzb0lGMTl2elhabzFBbWdCTU9R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://asiatimes.com",
      "title": "Asia Times"
    }
  },
  {
    "title": "‘I just want to stop hearing about it’: a weary South Korea awaits verdict on Yoon insurrection charges - The Guardian",
    "description": "‘I just want to stop hearing about it’: a weary South Korea awaits verdict on Yoon insurrection charges  The GuardianYoon Suk Yeol: South Korea’s ex-president faces death penalty in insurrection trial  BBCS. Korea court weighs death sentence for ex-president Yoon  CTV NewsYoon Suk Yeol sentenced to life in prison for leading insurrection in South Korea  The GuardianFormer South Korean President Yoon receives life sentence for imposing martial law  Toronto Star",
    "published date": "Tue, 17 Feb 2026 16:56:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNSlhHWkJVakhNX3RwLVNxSnRzLWJ3cm1rM1IxLVpjUEg1Qnp3YmFqcTVtMi10bjdpc2pma3R0YTlCMHppeVBISV9QbFJpVkdUOFQ5VDRDelBUYjV2V1BzdXhwQUNMMFR3OVdVSU9qZFVlV3hPZjRrNzU2R1h0eVVocEJCN1hLa3dRMTNMVzd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "What is Ramadan, the holiest month in Islam? - explainer - The Jerusalem Post",
    "description": "What is Ramadan, the holiest month in Islam? - explainer  The Jerusalem PostCalgary community joins nearly 2 billion Muslims around world to begin Ramadan  CTV NewsRamadan ushers in a month of fasting, worship and charity for Muslims, in photos  Toronto StarMuslims around the world celebrate the holiest month of the Islamic year, Ramadan  Yahoo News CanadaRamadan starts tonight!  CBC",
    "published date": "Wed, 18 Feb 2026 11:03:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFA4NGNucEZqUWpJSVVRNERlTjBMQlpJVTBfd1c1QW5JaUVqZHlHNXJMTXZLdko1M1o4XzNwR3hoalRyeG5xNWdKZTZtWmZEeElicV9NdmFnMDBqZ3Mt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Carney faces calls to send fuel to Cuba as U.S. widens blockade - BNN Bloomberg",
    "description": "Carney faces calls to send fuel to Cuba as U.S. widens blockade  BNN BloombergView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 11:00:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNSzBsNnpJY1dhMmtCSGlrdURlZEhKMEJHSE9ldFpGcklpNXRZeTJnWVlRTFBxQzZsVjBUcTg4LVNCUkhwTHJSd1pUOGNLZUlyM0dpa1BmMll5SHpOd1h2eVpFdWZhTVNRNHI1VmFGSE5wZFlhY0thUEFubU1TenotWDZnY0tELVRTbXBRUnA0NG9hRW95c2EtdUZUZGE3blFHSi1uYTdSNXo2S0JyNHFRN3lrSzBsLU5JX2F3bG9RMlBBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bnnbloomberg.ca",
      "title": "BNN Bloomberg"
    }
  },
  {
    "title": "Japanese PM Takaichi's cabinet resigns - China Daily",
    "description": "Japanese PM Takaichi's cabinet resigns  China DailyOpinion: After a stunning election, Japan will be unleashed. Or is it already too late?  The Globe and MailTakaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development  Toronto StarMake Japan strong again: Sanae Takaichi’s plan to transform her country’s military  The ConversationBloomberg Daybreak Asia: Japan's Takaichi Formally Reappointed  Bloomberg",
    "published date": "Wed, 18 Feb 2026 00:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE51aVdhdzFnZzYzQkhqcnppV1BvSXJnSzJxTE1HOEY3SHlzZE55Y08yRVdDbjBWVm1yNmxabW9aV3g0b0ptMzdYZVFjdFFZZWdWSEVaLU1IcnpFR1VqZEF4ajRMRHVhVGhxUFZ4NVUzUXA3cGZrd0pjbnQwSzF2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chinadaily.com.cn",
      "title": "China Daily"
    }
  },
  {
    "title": "In a Scorching Order, Federal Judge Rejects Trump’s Attempt to Trample the First Amendment and Rewrite America’s Antebellum Past - Ms. Magazine",
    "description": "In a Scorching Order, Federal Judge Rejects Trump’s Attempt to Trample the First Amendment and Rewrite America’s Antebellum Past  Ms. MagazineCiting Orwell’s ‘1984,’ judge orders Trump administration to return slavery exhibits removed from Philadelphia museum  CNNTrump administration appeals order to restore George Washington slavery exhibit in Philadelphia  CityNews HalifaxJudge cites dystopian novel ’1984′ in ruling on Trump administration order  CTV NewsJudge cites Orwell in rejecting Trump’s bid to erase history of slavery in Philadelphia  MS NOW",
    "published date": "Tue, 17 Feb 2026 22:14:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPZ2tRNWVmZTRPcFBmeFJlUWVaUGc3bW9jMjVXa21wSjVJWlF1NWRqNDBQcUYzUl85X2xUWUxkRDlaMzFaY2pkMGRzVFlrVFl0alFMajl1VmtSVUppU1d0RWlMX1Z0TTEwZDdKXy03UjdURjhpbmVQakFQcTNHeVdTd2NMMG5hSldZX2s1RWxmV29wbmtlbC0wZUtad1didw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://msmagazine.com",
      "title": "Ms. Magazine"
    }
  },
  {
    "title": "Saultite ponders Cuba's future after returning home - SooToday.com",
    "description": "Saultite ponders Cuba's future after returning home  SooToday.comView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 14:19:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMFpQQTB0MkJPZnR3R0J3aThHNEk5bU1IN05XaDFZb3F4LU40UkFXMW1md3NQVFc3cHRQOHU2MFdsVzBZaWhRZUQ1WkQtMk04bEhBWmFyVy02SWc0clYxbGFBUUx2dnItM2R0SlRzLXE1eXByMlZ4Sm1TUktfcDFCTHF2ZHZUU1dnUW1Ocm1qdTJYZWlNWmZXVFVnZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sootoday.com",
      "title": "SooToday.com"
    }
  },
  {
    "title": "Donald Trump’s envoys failed to reassure Europe - The Economist",
    "description": "Donald Trump’s envoys failed to reassure Europe  The EconomistOpinion | Marco Rubio Is Failing Western Civ  The New York TimesNo, It’s Not Back to Business as Usual  The AtlanticSecretary of State Marco Rubio at the Munich Security Conference - United States Department of State  U.S. Department of State (.gov)Forget Maga. Welcome to Mega: Make Empire Great Again | Mehdi Hasan  The Guardian",
    "published date": "Tue, 17 Feb 2026 21:28:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNc3ZsNW56VWpUZzZjSnZxUmsyT3MwaEhKR2JSZnpHYnNPUzJwUjR4NEhKVHMzam16WmwySXo2U0IxODdYVS1Lc3haUVNOT0ZGSTMxdEhfVmVnczBZT0RYWjMwT0VFQkpwVmNOZXZyMkt5U1BMM0swamJVRjlzcy1FV0hPU2NwcnpDdVNIWW9SSHlTbFJZOVVVRGkteEI4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Trump’s first Board of Peace meeting to draw more than 20 countries: White House - The Globe and Mail",
    "description": "Trump’s first Board of Peace meeting to draw more than 20 countries: White House  The Globe and MailMajor European allies decline to join first meeting of Trump’s Board of Peace  The GuardianTrump launches his ‘Board of Peace’ with billions pledged for Gaza, but many allies are wary  CNNFrance leads backlash against Commissioner Šuica's Board of Peace trip  Euronews.com‘Proof of concept’? What Trump can achieve in first Board of Peace meeting  Al Jazeera",
    "published date": "Wed, 18 Feb 2026 20:28:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPN0EyS205TFNDWG1aclJtd29JRzMtaUpwYTZjVzJUV0xVRDd1VUhLZlB4d0V4RDl6bFFRTjA3d2VQTzF5ODN2Q083eC1RQmhHNzRLOEdtR3RqV195MmN3dkxaVFo4RjNQQ2k1a25oanpQNjA3NTlPcXlRV1NZcG9ndg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game - Yahoo News Canada",
    "description": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game  Yahoo News CanadaSuspect in Rhode Island ice hockey shooting killed ex-wife and son  BBCFamily speaks of 'profound pain' after trans dad guns down ex-wife, son at high school hockey game  Fox NewsPawtucket shooter’s gender identity tied to past family disputes, court records show  WPRI.comMan who tackled shooter at hockey game recounts chaotic moments  CP24",
    "published date": "Wed, 18 Feb 2026 15:58:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQcERKZzVlbEJFRURFcHRGTmpfV2l3VG1DQzZDeUdqSkFvMlVfOXgzcFRmNC1SbWZETkI3cVdCMnA3TkFnQ0J1dzNad3Jla2RyV1BiZTdOTTdCNlY1cXpITGhkcGFBUnNCWGFTX1R2c1U3c2lvZWh0aHNaVHFheldJNXE1Y3gxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections - CBC",
    "description": "U.S. environment agency sued over scrapping scientific rule behind climate protections  CBCTrump has done more than harm the government’s ability to fight global heating | Jamil Smith  The GuardianOpinion | Why the EPA’s emissions reversal is the responsible decision  The Washington PostAdvocacy groups sue Trump administration over endangerment finding’s repeal  Al JazeeraWhy California could be the big winner as EPA abandons climate policy  Politico",
    "published date": "Wed, 18 Feb 2026 17:42:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFB6YXBPbVdGMUZtTk90SGtkbHc0QmtRWHZ4LVFFM1dhWTZWbEwwenFWdVU4cDZUUENrOXlObGdVVXpVc0wweWgtMFFhZ09pVnVuVDZnYlNIcWxrUzVpTm9UYnhGd0FOa1J4Ync?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Lunar New Year 2026 - Minecraft",
    "description": "Lunar New Year 2026  MinecraftYear of the fire horse - explained: the Chinese zodiac sign that’s all about intensity  The GuardianLunar New Year is underway. Here is how people celebrate it  CNNLunar New Year prayers, robots and festivities usher in the Year of the Horse  CityNews KitchenerSudbury communities welcome Year of the Fire Horse with food, dance, family gatherings  CBC",
    "published date": "Tue, 17 Feb 2026 21:18:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9HZG84X3V1RGpsWFdobE0tWnFVSU42TWZPbUxDeFltc1J0YmMzX1ppUkdaUHo2TEthVXZORHZ5S3UzaERSem9ORWFYcWVuUnBrZHk5NFBnYnM3NkJVdmNZUWg1b3JJQmx6Q1VV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.minecraft.net",
      "title": "Minecraft"
    }
  },
  {
    "title": "Thanks to Trump’s threats, tourism in Greenland is booming - The Globe and Mail",
    "description": "Thanks to Trump’s threats, tourism in Greenland is booming  The Globe and MailMorning Update: Trump gives Greenland a tourism boost  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcWItRDl1a0QyWE1fa09YZ0lPRmtxT00xVW1PVkdaQXo3X2hHZGNWUXlORU5PS09rYXRkWWpGYVN1Q1QzaWFSTWhqZHZta0VoSGI3X1ZhalFfYWlVR0JIWEJ3TTVZODNfdGhBdlRtMjNRYTRuTWFwcEZ6OXEyUmZSaEVYNjlUakJDMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "IDF says it dug up Canadian soldiers' graves to destroy Gaza tunnel - CBC",
    "description": "IDF says it dug up Canadian soldiers' graves to destroy Gaza tunnel  CBCA Canadian UN peacekeeper kneels at the grave of Canadian Gerald S. Porter in the Gaza War Cemetery in the 1960s. The children pictured are the great-uncle and aunt of the cemetery's current caretaker, Ibrahim Jaradah.  Yahoo News CanadaIsraeli military confirms it dug up Gaza cemetery where Canadians were buried  MSN",
    "published date": "Wed, 18 Feb 2026 18:00:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBOVXBNaElhWXVKS0lONGJDOUlyMGdIWU8tMFBzZUNKbDZ1ZE55eXdMZzBFdTVNdF9wM3o4ZmpURFlEZFVPZzJpX3B2ZkY0YUZvNG5aYnMzRURvTFFReHBla0EtdnV2ck9NNm9teE12Wk4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Iran and Russia to Hold Joint Navy Drills as U.S. Pressures Tehran on Nuclear Program - The Moscow Times",
    "description": "Iran and Russia to Hold Joint Navy Drills as U.S. Pressures Tehran on Nuclear Program  The Moscow TimesUS renews threat of military action as Iran, Russia announce naval drills  Al JazeeraU.S., Iran to hold more nuclear talks as Tehran closes Strait of Hormuz  Global NewsIran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.  CNBCRussian Mi-28s And Su-35s Won’t Revitalize Iran’s Dilapidated Military  Forbes",
    "published date": "Wed, 18 Feb 2026 15:52:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNM0xBdGVER01PODZEbGZGaGZFblZwbl9BNEZjSnN3bzFEWVdWOGJmYjA4RnVyZzBQUVVUcHh3ZG56X2pLbkpVYUlQZmIxTlNJVnRnSmt2N1V3eFBmcU93aXVhNlRiOUg3WTVJd0V3OHQ0a3lIbkpHcEtvYWtURDhvVXhWYm53U1pXV0NQRE41YmswamEtS1l2R1FtWEViNERmTE1FT2I1bmxjd2ZIaE5Yb0xQMFE5T0FGMnQzSTV6LXo4ZklQNXZwZGdUdEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.themoscowtimes.com",
      "title": "The Moscow Times"
    }
  },
  {
    "title": "Trump family wants to own trademark if airports use president’s name - National - Global News",
    "description": "Trump family wants to own trademark if airports use president’s name - National  Global NewsTrump Organization trademark raises suspicions that family could profit from Florida airport name change  CNNDonald J. Trump International Airport? The President’s Company Trademarked It.  The New York TimesTrump Pre-Emptively Files Trademark For Airports Not Yet Named For Him  ForbesTrump trademarks his name ahead of Palm Beach airport renaming  USA Today",
    "published date": "Tue, 17 Feb 2026 18:15:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1WMmhjVU1XUFB1ek45TWE0M0pUckphMy1hU1RieGZTQV9BVkJIbzJmSnRiUHJ1UlRhbjNjcjJQcTljSmtUOHZDcEVNeFpJaEQtMFVReWl5aEt5V1JYWUUwVDVIYzRlTDl3RE9POTNUUmhFLTZWdHNJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "There Is A Startling New Theory About Nancy Guthrie's Disappearance — Here's A Breakdown - BuzzFeed",
    "description": "There Is A Startling New Theory About Nancy Guthrie's Disappearance — Here's A Breakdown  BuzzFeedDesperate hunt for breakthrough in Nancy Guthrie case turns to Mexico  BBCNo current evidence Nancy Guthrie was taken to Mexico, sources say  NBC NewsNancy Guthrie live updates: FBI has reached out to Mexican authorities, sources say; reward doubles  ABC7 Los AngelesArmchair Detectives Complicate Nancy Guthrie Case  The New York Times",
    "published date": "Tue, 17 Feb 2026 22:21:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1LVVotR1l4UkN5c0l5aWxabHZwVXNRaEwzN3hTajhZTGpFS2ZTTWRvN0pZdUlMYi1WY0VzTjlVQ1BqNWZFeHFaLW5BZXdETXU0WW5UQU95cGJvNmRZdkdDZW1EQnhveTBtVXA4YkUybW5KNHhWUDByVmJUX2U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.buzzfeed.com",
      "title": "BuzzFeed"
    }
  },
  {
    "title": "Hungary, Slovakia stop Ukraine's diesel supply with immediate effect - Euronews.com",
    "description": "Hungary, Slovakia stop Ukraine's diesel supply with immediate effect  Euronews.comSlovakia Releases Emergency Crude Amid Standoff With Kyiv  BloombergHungary Seeks Croatian Help As Russian Oil Flows Via Ukraine Halted  Crude Oil Prices Today | OilPrice.comHungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply  MSNSlovak PM accuses Ukraine of delaying restart of oil pipeline to pressure Hungary over EU  Reuters",
    "published date": "Wed, 18 Feb 2026 15:25:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ21kWkVFMmUtVHlaWEJfaklfbXVIZTVpSW16VlhMNkI3ZzV3YkU5SWg0a0R5a3BaOWxxRXdGQkdiNEczNDZEX2FfRU5PLWlfdC1EQkljQjJETE13QlgwNFR6VjNQOERBcjUzLWZRVUFnYW5RM2xZczF0dmRkb1VLdkNUTXoxREFSTTk1RkhpWDMxVUk3ZHVPU2lMUndoSmxURVo4N3VlV2JtdU5WYVJHOG5haXpvelVZeXNzdElNVQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find - Gizmodo",
    "description": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find  GizmodoThe political effects of X’s feed algorithm  NatureX’s ‘For You’ Feed Could Be Making Users More Conservative, Study Suggests  Forbes",
    "published date": "Wed, 18 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNOV9JbTdROS1RWjR4Wm5ESkpIUGFXeDJOeU1yOTJMVEt1ZVRMRGNlLWlXNFlUeWJ0aG8tajdUS010QTg3WHlBeFFSdnNlaW1FZEZDNV9DSkFQRi1mQ1ZIRnVDakl5M3Roc1AySlJUVk5tWWg5ODR6dTF1VUhXLTdLTnlINTUzU3RrLTRwVVJ6cU5VNVRBVEs1dEEtaTh6R2V3MkQ2cG9iNlRwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "How a four-year onslaught has changed Ukraine - The Economist",
    "description": "How a four-year onslaught has changed Ukraine  The Economist‘It’s wearing on them’: Humanitarian team reflects on upcoming 4th anniversary of war in Ukraine  CTV NewsGlobal Rally for Ukraine in Vancouver  Vancouver Is AwesomeUkrainian victims honoured in Vernon as war continues 4 years later  Kelowna Capital News",
    "published date": "Wed, 18 Feb 2026 16:51:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQcnhMYnJMb05rRUJ0VG9EbU1ZUGptMnA5b0VuZmEwLVhPS280ZHVUNE1obXROV251MVkxVEQ2MnNrSm1CRTg2T0VrbGxnTTdZSWxCdllmUGluaWRMMEk3QkdyTF9wX1k5UHBwZDVLWDlqV3RDUGNpOVBuY0JPRHk2RUxqSnl4TklOZURPZjlUUWFwZFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Russian cucumbers become symbol of rising wartime prices - The Globe and Mail",
    "description": "Russian cucumbers become symbol of rising wartime prices  The Globe and MailFood prices are surging in Russia. Is the war hitting Russians in the pocket?  BBCIn Russia, the humble cucumber becomes latest symbol of rising wartime prices  Reuters",
    "published date": "Tue, 17 Feb 2026 21:00:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPM2R2bHRBdHJBVFVoSEV6S19ESmxRZW1kX0xNS2VBeVdTWDlnZWtVWnRBOWI2YW5tRlZpUHpiZkYzSXV4TU55QUozVEtkLW9qNVVrVXdTUmdyVlJzSFFzT1puSzJsN25QS0pJSkRKMjNKbHdpa3lDc00tNlh4T21jdW5ndTBRZWN0cEE5UUhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West? - The Kyiv Independent",
    "description": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West?  The Kyiv IndependentThe dart frog toxin allegedly used to kill Alexei Navalny  BBCRussian poisonings aim to kill -- and send a message  CTV NewsRussians mourn Alexei Navalny’s death on 2nd anniversary: ‘He was murdered’  Global NewsKremlin rejects claim it poisoned Navalny with dart frog toxin  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 18:55:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaFhNZWNiWEpvUGxGWEJlZTBqc3B1XzI5dF8zUWkwZ2NrYkkxWm5lSVhtTDktRFBxZF9ZZUsyQ3kybnIzdHZlZ2xkazVtUkc0T1NXUGZRT2hoZS1mX3pVX1lZcXlCZ09jRE9pTHVHOVduZUU3QW5HelFmVHdzNzljSUt2bURrcWZCMzBTMzFpNW1KZFhzNkR3dmYxeWRQbXI2X0c2aXl3aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "‘Jordan is next’: West Bank annexation signals ‘silent transfer’ - Al Jazeera",
    "description": "‘Jordan is next’: West Bank annexation signals ‘silent transfer’  Al JazeeraIsrael advances registration of West Bank territory as state land in move decried as “de facto annexation”  CNNIndia signs UN statement on West Bank  Times of IndiaAs Israel takes steps to claim land in West Bank, U.S. stands by  The Washington PostIsrael conducting ‘gradual de facto annexation’ of West Bank — UN official  The Times of Israel",
    "published date": "Tue, 17 Feb 2026 11:08:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOTmN3SjNRLTd4V3ptREF6SXRvU1ZHR1JKWW5FcEJxNWF1NXJNMUF6RW9ucDA4bERWUUM0R2dObDJpWFhBTUdrMGNfOHJkSEdKdTdyWU9LRnBGTUtfcF9PdTRQaV9fRjVkY085OERXQlZuOUtQRW90XzNXYnlicHI4N2tPbkxXYjhwOGhES1owSXh5ZExrU19oNjVPWdIBoAFBVV95cUxPYzJwaVpXTGlBRFh3U25zUkdjeWxIUm9EZGVpMWZjN0dFRllpeXp3dktHOEY5M0k4M3JacldWbHg2bVlLWnF2djlma2JQa0JmU2VNa1hlSkhxdHB6aWE5NmRDeXN0Zmc2NUJqN0dCenI5SHBHSi1VV0YwaDJyVXBnUVdnYVI4cmh3ZTlPN2tCOU5MWlVxbFJxNHh2ZHJRLVY2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "12 killed in China’s second deadly Lunar New Year firework explosion - South China Morning Post",
    "description": "12 killed in China’s second deadly Lunar New Year firework explosion  South China Morning PostChina fireworks shop explosion kills 12 people amid Lunar New Year celebrations  CBCTwelve killed in China fireworks shop blast during Lunar New Year  Al JazeeraTwelve killed in China as firecracker store explosion triggers blaze  NBC NewsA fireworks ship explosion in China kills 12 people in the second such blast in days  CityNews Halifax",
    "published date": "Wed, 18 Feb 2026 12:15:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPTGJuV0JfYUZwLVhJRmJkZk1OeVNWTzVfTl9fSklMTkJ4cmJZMk8wdXpOa2dvdnpObWt3V2hjd01FaTZYak5fcFhIV0N2LWR0VUdueFI1M2N0d0hULWE2OERhNkFIZ24xUjBKMHpLYm5rSXFUUU9CdzY5dHlPQThsQnc2UDMyTzlpSTRDTjRaSHdlQldZYnB3Wm53eld1R01NZlZCRklrREhrUWtsWERXWXktVm5FaGxsNjVBcDNR0gG-AUFVX3lxTE5XLTJwQlM1S000bnE3ckE0bWhsMWJtY3JGZVplV2pDaHp3UzVxLVZnOTdYLXdFcUR5aTQxOWRFdGg4V19JUUxzazIyQ0tXOW5CbDlWZzlxcGI0azhuY0FTdVR1TTRhSkVEQ2N1YktGMWFkYXpTdXdueWlacjBYUGVkZnc5ZHVsb3R1ZVpkZ1YxRmNXMDRnRnBnLWJqUlhYS2pwbkFvUXZoM0tXblZUSWdPTzdVRnFLemZscmxSeUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "French activist's killing leads to political furor, 11 arrests and a bomb threat - CBC",
    "description": "French activist's killing leads to political furor, 11 arrests and a bomb threat  CBCWave of arrests over killing of French nationalist piles pressure on far left  BBCParliamentary aide among 11 arrested over killing of French far-right activist  The GuardianPolice arrest 11 in the beating death of a far-right student in France  CTV NewsAfter Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left  The New York Times",
    "published date": "Wed, 18 Feb 2026 17:12:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB4dG9vdk5EZmxNWHJXQl85VUhjdGphbmFqOXBzN3llc1g1NzFqdG1uYm5HakFqRzc1djhmOFY1cW5pYW5tYVhQTVVxSzNFWGhscnIxSTF1UWFWTXlhMXJkWUlDZTdaLUpUY2x0SGhtTGpma0dYVXhXSi1ZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club - politico.eu",
    "description": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club  politico.euTerry Glavin: Carney, leader of an anti-Trump alliance that doesn't exist  National Post‘Canada can broker a bridge,’ Carney says on new trading bloc efforts - National  Global NewsOpinion: How Canada and allies can stand up to Trump and other great-power bullies  The Globe and MailTrade agreements come with rules: Here’s what Canada can and cannot do  CTV News",
    "published date": "Wed, 18 Feb 2026 11:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNR0JIVGozbnRVUkxrakN6TUlMWEVZQTJqYnJPb01xdUlFdnZzbnRRaGJGNWtaRkNkZHhUYnhJbzFBN3h3SWJBM0FTRHAwdnZtLU55a1ctQV81eG4ydUNLVXZBZ0lBZ3M5ZEdlX3NNLUdpOW9MTXBoOXdWYVZLcFBGUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it - CNBC",
    "description": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it  CNBCThe Digital Retribution: Trump Brothers Vow to Overhaul “Outdated” Dollar with World Liberty Financial  South Florida Reporter",
    "published date": "Wed, 18 Feb 2026 23:04:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdUhZZEZEa3pLd05ia3Fxa1BkR3gxdjJ4VjVOamd3RENiN2I1NTVDbkxCbEd6amVJeXVNSkNzTlJ0N29yNWpsLWF3YlRUZ1k0eTBfcnJ1OW5iaFlhOHZMV05CajJEY0piUTRDeER3WFlOVWFtYXV1aEQzN19reTVWbjNNaXFpcUJJcW1uQlJwOWMwNlYwcGctN9IBngFBVV95cUxNcnFVVGMydDRnRXFEaTlYaEx2U2R0cW9LdWlQdlI3UE9vMVdDT0EzQUNlbkp3WmxGdXFLT3BwZHdoRkc0MUg4em4wVTJqdGV6U0Exd1ZLYkplTHNqS2hVNEp3elJQZXVZNmwwcncwdkF5WTBDOGdwb18yRWpZVDU0WkI4MG0zRjVWVDNJdzdjck9zWDdqZ1ZDOFduanpPQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Eleven killed in multiple strikes on alleged drug boats, US military says - BBC",
    "description": "Eleven killed in multiple strikes on alleged drug boats, US military says  BBCFishermen in the eastern Caribbean fear for their lives following a deadly US strike  Toronto StarU.S. military strikes three more alleged drug boats, killing 11 people  The Globe and MailUS military says it killed 11 people in strikes on three alleged drug boats  CNNU.S. Kills 11 in Boat Strikes in Pacific and Caribbean  The New York Times",
    "published date": "Tue, 17 Feb 2026 17:33:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE40V3dzRmU2UjRXa1dRNzlXQS1uamJ1eFRneHY3UFpOLVg2cU9QLTNpSXNHM0VON1RBa2lncUQySEhVZEM3ODJhLUNUR2lpUXdReXRiOUdRYWE0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "People Turn to Poison Quick - Counterpunch",
    "description": "People Turn to Poison Quick  CounterpunchJim Ratcliffe’s shameless comments signal soccer’s turn toward total Trumpism | Leander Schaerlaeckens  The GuardianManchester United: Sir Jim Ratcliffe immigration fallout analysed  BBCJim Ratcliffe is wrong. Idle Britons are the problem, not immigrants  The TelegraphBillionaire Manchester United co-owner sparks outrage by claiming UK ‘colonized by immigrants’  CNN",
    "published date": "Wed, 18 Feb 2026 07:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBFRnZoZ3VpckJZc29HSG9kYlNxWmNTMlZ2T1pSMHRvLWt4aUtiZnZUbl9Bc2VUOGRSbWwwN0x4aTIwUjFPSV9hTlgxajdjQmFPLTFicHJ1OUhYYWlvOWE4VWV4SVZadzhOd1NHZ2Z4VGZzQXI3TWNr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.counterpunch.org",
      "title": "Counterpunch"
    }
  },
  {
    "title": "Thousands of puffins starve to death during storms - BBC",
    "description": "Thousands of puffins starve to death during storms  BBCBad weather blamed for north-east coast puffin deaths  BBC",
    "published date": "Wed, 18 Feb 2026 18:03:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBoeVRYaVFwSmJ5QVR1SGQ0N2pfZnh3LVY5X1BxbEM1TnowMW1TVDF1QzRSd3dMYkZyeWU4T1BIVFM2VFZPZHVpdnZubFIweDBfTXFQRFltX1dJUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam - CNN",
    "description": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam  CNNFallout from Epstein files in Europe affects royalty, politicians and diplomats  The Globe and MailBondi criticised after saying all Epstein files have been released  BBCDOJ accused of flouting law in Epstein name dump  The HillThe Epstein files have brought a wave of resignations and investigations  The Washington Post",
    "published date": "Wed, 18 Feb 2026 11:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9vZC10WFVhcGhfOTIwb0NmS0w1WHJoOUlYdE8tb2gzRkFLUk90Z3R4MUpsU29WUzgzRnh2NEwzU0dfMFNFdFFNYzg0eFdRSVJVYmJNNGNHMlZDdjgtWTBvYW90ajhHR0pEcEFPUGpLTXF3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Org. trains Gazans to edit Israel, Palestine on Wikipedia - The Jerusalem Post",
    "description": "Org. trains Gazans to edit Israel, Palestine on Wikipedia  The Jerusalem PostHamas is reasserting control in Gaza despite its heavy losses fighting Israel  BBC",
    "published date": "Tue, 17 Feb 2026 20:29:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1rWmhIYk8zZkh5X2hzblBybXB1em1pOEREVHNUNkJOYVRHSUJXUHg4OUFuUEl3bE9rWXd0WmlIU2JWM256VFZHTHJCT0FHZU1UYUhjREp4T05IVi13TGVub1pvS1JJN3g4Umc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Canada's Shadow Refugee Claim System: How Tens of Thousands Are Approved Without a Single Question - The Bureau | Sam Cooper",
    "description": "Canada's Shadow Refugee Claim System: How Tens of Thousands Are Approved Without a Single Question  The Bureau | Sam Cooper",
    "published date": "Tue, 17 Feb 2026 16:56:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9mbGlsUjVUOVlVMjAxWGhPeEE5MEE4U3laRGNwQnFVRFg0eEJYUXhycWMwWFNLNnF1cGlMRzE3QW8xd0JpTW53UmRvVUluX3pRS1VSWm5WRFJaU0M2RHBDWjctZzl3Q180N0JqbXdQMEZQZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebureau.news",
      "title": "The Bureau | Sam Cooper"
    }
  },
  {
    "title": "‘My daughter was supposed to bury me’: Manitoba father devastated after slaying - Winnipeg Free Press",
    "description": "‘My daughter was supposed to bury me’: Manitoba father devastated after slaying  Winnipeg Free PressMinnesota Governor Candidate’s 22-Year-Old Daughter Fatally Stabbed By Husband  BeliefnetWoman's 'safety plan' found in St. Cloud apartment after stabbing  St. Cloud Times",
    "published date": "Wed, 18 Feb 2026 01:22:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPWHUzek5ubFFiVWJMdTlXX1lXLTRUdnRCZnZhSnpTRHM2LUFzOUZpNnRIcDNNOVhOZW1jX0ZFdXJFQkFHYUdLaTkzbzNraTBXaURmM0kxcWVKRXFmVHV4MFRUV1lXQ1hwNVJLSkl2Umw0TlpfM0pwam5ZQWZ6YzNNTTBWdGJFaFZTeERuNnB6Qmh5d0M2cHVIcThMOWIwajFob3ctM3I2NW5NTkd2UHp5aFUtMW5CeWkzc0Uzai16WFg2U0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.winnipegfreepress.com",
      "title": "Winnipeg Free Press"
    }
  },
  {
    "title": "Canada issues urgent travel advisory update for the Philippines - Daily Hive Vancouver",
    "description": "Canada issues urgent travel advisory update for the Philippines  Daily Hive Vancouver",
    "published date": "Tue, 17 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQV2ZEaVhRSnduQVAwWWg1SDNiQ21XOEVOdExTcThxQmQyUDhpUk5ncVBNS1pGczR2YURSZFZ4UU54UVpsMy1qVG1DM2hTVzhibGxEbFFXd3lIX3VMSEVuYk84ZDA5eEs1VTAyWVcxRmI1TlFINXFaOXJRLWU2dFdyWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Lawrence O'Donnell Rips Trump With Clips Of 1 Leader 'Who Can Speak And Think And Feel' - HuffPost",
    "description": "Lawrence O'Donnell Rips Trump With Clips Of 1 Leader 'Who Can Speak And Think And Feel'  HuffPost",
    "published date": "Tue, 17 Feb 2026 17:34:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNZHcwOGpTUGlEbUQ0SUhxNkZxczgxczM1enJNNXlJM01IUWZVQnFITTVhQTdBcmdacm4tYXptYzRLTDJMSkt6WGY2YThqanVvT0NBOGtLdXlSTTF0MHV6NmJFd3p6bFpZaUpZY3MzZzJPbkxuVHl3M2d2cmx4aHRFZkhEVzdZMTlxRWVLVHg5M29HTXpadWFoYVViNGpsWG1vZVViZFhnUmlQX21WOFZ0ZmlyZUFXTXVTQnpkQdIBwgFBVV95cUxNQTdhVjcyVDQ1b1llWEpXYV9zdGFVZEVEaVVTOHdXOTZXSkZPZjVkNkg1c0ktTHl5Q3d0eExyOE1yczBiTVo4eks0bDlkcF9qTjczc2pmTzNUUzBQX1Rma0d3YzJyMjh5bXJXWHZMU2M0NFZmcGw0YnZqeHpfM0VwODRFOE16OExCYmlJYXFVY0JRRVo2bW5faHFsVnpTZE8tTUtzZXFDb3l0aUZsSklyZ0dvQ3ZBZmFUZElaanZDUDBVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "'Absolute havoc' on coast path as storms take toll - BBC",
    "description": "'Absolute havoc' on coast path as storms take toll  BBC",
    "published date": "Wed, 18 Feb 2026 14:54:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9HSjNxNVRnc2xmWlo3eUt0YTdJOTQxRlFDMUQ0Uzg0SFE4R0FJY1Qxa3BVcW5CLUtlM2ZHY3lJSk1NbzcxZkJrWDZ2SVBlT2plc2NIeHRXS2VWdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘Bonkers’: Top Trump Aide Gets Annihilated Right And Left For Claiming Tariffs Aren’t ‘Regressive’ - Mediaite",
    "description": "‘Bonkers’: Top Trump Aide Gets Annihilated Right And Left For Claiming Tariffs Aren’t ‘Regressive’  MediaiteThe Quiet Architect of Trump’s Global Trade War  The New York Times",
    "published date": "Thu, 19 Feb 2026 00:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNdVZkQ3JyRlpxdFJHclM3Q3JGcElTY1JNQ3lhMUwxUE9xOV9haG9ydVpSQXJTNzZGbmxfR3BGMzg3YW9JUUg0QzUyY1dHaW5wMUU0TVU2cUwyelFobVRtLVVicUJsblI1VWFwUUIxTFp0N09Ea3BmaDU1ZUdCYUxoY3JJNlZPbkVIYzRTeWxTUk9lV2xDUm54anVLdjNhSE1BM1pLZHFSb0VZQnF5ZFNzMHc2UEtlaHZIZVNNRHFKenZaVDlCWnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.mediaite.com",
      "title": "Mediaite"
    }
  },
  {
    "title": "Mexico declines Trump’s invitation to join Board of Peace: Tuesday’s mañanera recapped - Mexico News Daily",
    "description": "Mexico declines Trump’s invitation to join Board of Peace: Tuesday’s mañanera recapped  Mexico News Daily",
    "published date": "Wed, 18 Feb 2026 00:04:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOZUk5bUhjMXIwS2k0aTN4S0N0ZV9HY3M1R1A1cDB6b1RLa3RuZGNXbm1ONEhaRXc2ZjhYV2VFQkVxaF9kNWc1RWNWY3I2V09NcENMQ2lKTnVFRUNmdlA4UE9YOFoyd0pKVG44ejVHNWNyQmNyYThtdlhmM1hsVDI2N2NQeER5Qms0WWhVMGhUeVBMck1QZi04S3pGZktCUFFwVnFmWjdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mexiconewsdaily.com",
      "title": "Mexico News Daily"
    }
  },
  {
    "title": "Zelensky says Ukraine won’t withdraw from Donbas, 'won’t lose dignity' as peace talks stall on territory - The Kyiv Independent",
    "description": "Zelensky says Ukraine won’t withdraw from Donbas, 'won’t lose dignity' as peace talks stall on territory  The Kyiv IndependentUkraine war briefing: Zelenskyy says Trump exerting ‘unfair’ pressure on Kyiv during Geneva talks  The GuardianZelensky says Ukrainian public won't let him hand Russia territory  AxiosUkraine's Zelenskiy says Trump exerting undue pressure on him  ReutersWATCH: White House briefing addresses Zelenskyy criticism, Potomac sewage spill  PBS",
    "published date": "Thu, 19 Feb 2026 02:49:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPNDh2MzRFb3I2R0pzNW9XS1hUYUdxdl9acGUtQlk1c3l6ZXYyd1BPUU5BY1h3S08wZzFlR3hkOUpTWkZOUWlWQ1huSEVyRHdCUzdSSVZDNWZPVDJFZDFVOGxmM29CVUxNenN2TnhWRmNCemt4di1NZ0k5Z0dkcy1fSUR5U25RRHA4M3BmRWZzWXZDZ05PSkszeWNzdHVBYjBCQWNuQWkyX1JhZ3pwdlJJeWhJcG5VQjJJTk1WeG10NFRfNDVwLTlF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  }
]