[
  {
    "title": "Russian deputy chief of military intelligence shot - MS NOW",
    "description": "Russian deputy chief of military intelligence shot  MS NOWRussian general shot several times in Moscow  BBCA deputy chief of Russia’s military intelligence service was shot and wounded in Moscow  Toronto StarRussia’s foreign minister claims Ukraine to blame for attempted assassination of top general – Europe live  The GuardianRussian general shot and wounded in Moscow, in latest attack on top military leaders  cnn.com",
    "published date": "Fri, 06 Feb 2026 08:38:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9udDF3MkJ1cGxjWElfXzNRQW1tN1ZlRllJb2thSFJIZlk5M0owMVhpellDdGsteFo0ejFUS1Y1dXpKMGFLNjZqSkt6Nmw3VWtWckJENW0tMS1FbmR4U0hhSEZqa3pLTWlwS2J1cmtsVnRtbkZJS3UzWGZPTkVZZE0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ms.now",
      "title": "MS NOW"
    }
  },
  {
    "title": "Video shows aftermath of Pakistan mosque blast that reportedly killed 31 - BBC",
    "description": "Video shows aftermath of Pakistan mosque blast that reportedly killed 31  BBCAt least 31 killed, more than 160 injured in mosque bombing in Pakistan's capital  CBCA bombing at a Shiite mosque on Islamabad's outskirts kills at least 31 and wounds scores  NBC NewsAt least 31 killed in Islamabad mosque explosion, say authorities  cnn.comExplosion rocks mosque in Pakistan’s Islamabad  Al Jazeera",
    "published date": "Fri, 06 Feb 2026 11:23:22 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE1MNjNrUm0tZjRCMGw5Q0Z0b2hRcWFiNjIySGRPVFNVdGlLNmZwQVFZS29CSldYQW9tRmVDUmZQVWROdS03bkw2N2w2YWVUSTlEU0pPUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "US and Iran talks brought back from the brink after White House relents on move to Oman - The Guardian",
    "description": "US and Iran talks brought back from the brink after White House relents on move to Oman  The GuardianUS-Iran talks live: Indirect negotiations in Oman in push to prevent war  Al JazeeraIran and U.S. hold talks in Oman over Tehran’s nuclear program  The Globe and MailIran, U.S. start crucial talks in Oman as confrontation looms  CBCMissiles, uranium, stockpiles: Thorny issues on the Iran talks table  France 24",
    "published date": "Wed, 04 Feb 2026 19:36:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbFdEdGc0cVJSNzBpeFdZSEpJQnVDU3Y5SlhfY0RzcFJIeVQ3dkQxOEU0X21KN0s4ek5ieHZieUpVdW81WHVKZ0JHY0FUUS1MLUdSYlBTb2pWRnltY3RFM3pCbHpPWjZzSDR6U0hpU3BaSTZ4TnZPREZOTFdtUmJLM043aTdlRFVKY0x5cklYaTRjWkVNUnpF?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race - BBC",
    "description": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race  BBCTrump's nuclear arms control push with Russia hinges on China  BBCHere's Why Nuclear Brinkmanship is Back  BloombergA key nuclear weapons treaty is ending. It’s a sign of Russia’s eroding superpower status  cnn.comVideo: Trump rejects offer to extend New START deployment limits  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 05:33:08 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBwTk95Wm0wM2RqNThES3c5NWpidTUtM2FMamFxajk1bnNTNXFwbExpR3lvMnNFR3NjLUFjSllZMkZtNDg1TkxoSGRmTXd4SV80MlZOaU9lVzVpdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Authorities investigating Nancy Guthrie's disappearance say they're taking ransom note seriously - CBC",
    "description": "Authorities investigating Nancy Guthrie's disappearance say they're taking ransom note seriously  CBCLive updates: Nancy Guthrie’s son pleads for mother’s return as first deadline in apparent ransom note passes  cnn.comPolice found blood on porch belonging to news anchor's missing mother  BBCAlleged Ransom Note for Nancy Guthrie Kidnapping Demands Millions in Bitcoin  TMZSavannah Guthrie urges mother’s alleged kidnapper to prove she’s alive in new video  Global News",
    "published date": "Thu, 05 Feb 2026 20:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQb0ZoLWdDeHFrdVczTkJmODJfUllCTmNQTGdxX1lyekJRUm5Rbko5X3A0MEUwQWF4cXF3VjNncWVLeDg3RTBlTlBqTmVWcGhWbm5STHd5TTJ5S1duZl94NWd3UkNqVWpJeWRwLU8xMjVFX08xb2w3MVNqS2hWTTlzdFdKWWJwZThaa2FZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says - The Globe and Mail",
    "description": "Any decision to join U.S. critical minerals bloc will be part of USMCA talks, Anand says  The Globe and MailAnand in D.C. as Trump administration makes the case for critical mineral trade zone  CTV NewsU.S. wants to create a critical minerals trading bloc with its allies to counter China  BNN BloombergThe Latest: Trump administration looks to rebuild critical mineral supply chain  CityNews HalifaxTrump to Launch $12 Billion Critical Mineral Stockpile to Blunt Reliance on China  Bloomberg",
    "published date": "Thu, 05 Feb 2026 02:54:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPcDJaN1A4UFF3VHJ2QjJJeE4zTVMtSUNadFBqTHVvZmxLdGRUZTIyVjBZWmhpWlNpMkJxUzRIX1otMHJvTVRiYXdYWVUtVDJHWEQ1Y1RDOWtGRTh6SmtVdk9yMjh3UW5pb1ZqZTBJSmhmb3k3aXdjRUZEQ00xZi1FelhBOGx1dC1YQkJxTi03NmI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Analilia Mejia and Tom Malinowski locked in a tight Democratic primary for US House from New Jersey - cnn.com",
    "description": "Analilia Mejia and Tom Malinowski locked in a tight Democratic primary for US House from New Jersey  cnn.comHard-fought New Jersey election too close to call, as Democrats debate over the party's future  NBC NewsA dozen Democrats are vying for the nomination in N.J. special congressional primary  MS NOWPro-Israel lobby group pressures ‘moderate’ US Democrat in new strategy  Al JazeeraNew Jersey 11th Congressional District Special Primary Election Results 2026  The New York Times",
    "published date": "Thu, 05 Feb 2026 12:00:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUWFBNDNIRHpnLVpWU0xUNG1wYzJtSXZFY3dhNVhIVVV6aUxrRXF2MUZIbTF1RDFvbm1yQUQ0WjNySkdrVFo1VFJGV2VDb2RUVjZ3YloyX095anZ1anQwRTJQM25lMlY5VWpvNUYtR1NOYjRXNkZoWE0yNExuXzZldjlLWmNEeXZzb2dzb0lnbXlHZHdRNENocHd3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "Russia-Ukraine talks conclude without breakthrough on ending war - Al Jazeera",
    "description": "Russia-Ukraine talks conclude without breakthrough on ending war  Al JazeeraU.S., Russia agree to re-establish military-to-military dialogue after 4-year pause  CBCRussia and Ukraine exchange prisoners as peace talks end without breakthrough  BBCRussia and Ukraine hold a second day of U.S.-brokered peace talks in Abu Dhabi  CTV NewsUkraine, Russia agree to prisoner swap on second day of U.S.-brokered peace talks  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 17:03:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQ3hXQ0UxclI5b00ybDM2bmw2VVRJVWc1SzJveF96X3N2d1lLU0dxVEVGdUlwSS1MbFUxb0NhLTZxRDd2Umg0Tm4xcDA5eHBGRXJnRmZPWlZLWlhOVzA4cDhZN184SlAxcTlkeDFWZTU0Mkw0YVNsWk9VRlBVcHRXTFM5aFpyMmxsdGdfbjF3ZDJCbExnOW1zVlZzcEfSAaIBQVVfeXFMTjdNalczeDlOckFsWGJ4Z1NUN3R6TGZEVUU4eWtRMzVtdlVQYzBfSjRpWDNabnlDcFE3cnM4ZjhxQWw4TmEtYm8tNmtqdHhsZnVxUnA5ZnhDMTUxWDlyX0tGZGkyakhXbEwwOWVobXo1dzZuTXY4SFFhR1hCTjdRVkVNOEYyVkxOQVRjRHB1aDNhNmxKV1BTWDlSQWJuUDM4QzJn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "700 ICE officers will leave Minnesota immediately, border czar says - Global News",
    "description": "700 ICE officers will leave Minnesota immediately, border czar says  Global NewsTrump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview  NBC NewsU.S. border czar says about 700 federal immigration officers to leave Minnesota  CBCTrump’s border-czar takeover does little to calm Minneapolis tensions: ‘The agenda is still the same’  The GuardianVideo: Trump pulls 700 immigration agents out of Minnesota, but thousands remain  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 15:54:21 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE54aXpHTFJoNWhCT09waGl2dzZtc2RsUUtkT0gxTWxBUHV4eldjZVN0VlN5cWx6SHNTVFlQcXBBRm5yTTlRcXlYOEd2QTlrTTE0cUhzd09hSUM3MnhyZnh1OVRvOXJPNGIwcjJ4aWdsQlRmNGJYa0hfNVFZUnI?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "The reopened Rafah crossing in Gaza brings pitiful gains - The Economist",
    "description": "The reopened Rafah crossing in Gaza brings pitiful gains  The EconomistGaza patients head to Rafah crossing as people return amid Israeli attacks  Al JazeeraRafah crossing between Gaza and Egypt reopens, with strict limits  Radio-CanadaPalestinians in Egypt torn on returning to battle-scarred Gaza with ‘no future’  The Times of IsraelWomen returning to Gaza say Israeli troops bound and interrogated them after Rafah crossing  Toronto Star",
    "published date": "Thu, 05 Feb 2026 13:47:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNNnF5YUxON3liSTB4STBwVThiQVRlemt1TFlLN3U3VGxlYnZYOWxOa1hCS1M0dExuZmN2dWFCXzIwOV9qbDJUS2hwaDg2S1oxX2xoMy0xZDF5Q3llbXJsV1B1MHM5dmM4ek9LZ3dSZUpELXpUQ09QQVZmWkprVTdTWmluVkVQT21KU3BYYWdjaG54R0lYYWszbnM5WFhKZkdaSUxwbnUtLThVZWZIVDhWdVphdFplOUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Iran seizes two vessels in Gulf and arrests 15 foreign crew members - Ynetnews",
    "description": "Iran seizes two vessels in Gulf and arrests 15 foreign crew members  YnetnewsView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 12:47:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE9XdmFSR2p2RWYySDlyYnltLWhhQk5RNEJna2RzbWtuNDBwYi1EOUs4ZlRrWFpkUG9yTERaQklKZG9FTTZkYWNpZEFFd2FfNUhXS2hXYlpR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "Israeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire - BBC",
    "description": "Israeli strikes kill 20 in Gaza, hospitals say, after soldier wounded by gunfire  BBCThe Gaza ceasefire began months ago. Here’s why the fighting persists  CTV NewsIsrael kills two in northern Gaza as Rafah crossing sees little movement  Al JazeeraIsraeli airstrikes kill at least 24 people in Gaza including medic, 7 children  CBCVideo: Israel strikes on Gaza kill at least 24  The Globe and Mail",
    "published date": "Wed, 04 Feb 2026 13:27:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ORzhkYmNPZHZvVXBZMFhxYm9kNXcxZWdlSTBtTXF0TDlMZHlGOGdwOXNhakFkeEtmenZ3Sjd0VXJndG1XaVZ6a0FHeFN1dTFuMEdOemllMmE1UQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules - Castanet",
    "description": "ICE agents can't make warrantless arrests in Oregon unless there's a risk of escape, US judge rules  CastanetICE agents in Oregon cannot arrest people without warrants, judge rules  The GuardianDHS Panics After ICE Barbie’s Fourth Amendment Assault Flamed  YahooOpinion | We Were Top Homeland Security Lawyers. You Can’t Wish Away the Fourth Amendment.  The New York TimesNew ICE memo gives deportation officers more leeway to conduct warrantless arrests  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 04:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOaVJsb2RzeFVFNjUtZ3R0Ri0zV0ZicWY5b25sN2o4MVA3a2tSVGk4Q2ZVVC12M0VSa01OZko5d1J2ejBQcnB6YkdaTE1qTktvTXBvWTIwWGpFTEVWNFpDczVCUFl5aV9FQjZrQWFyWHFjSzVvU1NPQ3hfcGNRbTBEMWcxNVpPZ3VjSVlKc2dXVzFzNHc3eVBPZzd1Y0tlaGgtNVhsY0VQMjFyZzVuS01HekdNUjdoMGpPNGV1U3lkVGZwck96aTQ5T2lrMkFHS3gzenFkZUJ0LTY?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "‘Photocopy your passport’: Canadians describe travel to Cuba - CTV News",
    "description": "‘Photocopy your passport’: Canadians describe travel to Cuba  CTV NewsCuba travel advisory: Canada updates its advice, warns of 'worsening' crisis  Vancouver Is AwesomeNew Cuba travel advisory urges 'high degree of caution.' Should Canadians worry?  CBCWindsor travel agent offering tips amid new travel advisory for Cuba  AM 800 CKLWCanada updates travel advisory for Cuba as power outages worsen: ‘Exercise a high degree of caution’  Toronto Star",
    "published date": "Fri, 06 Feb 2026 00:25:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOWUhJOGtzQ3hwR092UEJWWE9JeElyLTNkelpJLXkzM3hvSTVQc3Z3Ul9UWjA4Z2plV19MTGlLSGJGSTBYNnhQX3BXYnljZksxVFUyUDJnbHQtMXJlRTNEZHA5SWZreDVfMjZqZl9UUkotSTFyYVpVMjBrR2RXX1FDZnd1QlA3bXRBNTBxVkZWNVB4Z2Q0eGJWeHdPTQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "US strikes another alleged drug-trafficking boat in Eastern Pacific - AP News",
    "description": "US strikes another alleged drug-trafficking boat in Eastern Pacific  AP NewsUS strikes another boat in the eastern Pacific, killing 2  cnn.comUS military kills two people in latest attack on vessel in the Pacific  Al JazeeraU.S. strikes another alleged drug boat, killing 2 'narco-terrorists'  NBC NewsUS military says two killed in strike on alleged drug boat  BBC",
    "published date": "Fri, 06 Feb 2026 04:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQY1hSa0dvUnN4TlFSYU1mZXlUeXI5OWM4YnBTMG9FdERzLUVQTTNFSl9qeWprVFRjZXdDVERQWnJPSW0ySEh5eTVOMFJ5Z0J2VW54YzViSWVnSmF6b0REVG5scXd0QU5WSEVUWE1VaTZMcjNvSE9ibFM1QThGdmpQSEtvNzBmWmpZOFp4VEFSbkRRemxMV3VJOQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Bill Gates says he ‘regrets’ knowing Epstein as ex-wife alludes to ‘muck’ in marriage - The Guardian",
    "description": "Bill Gates says he ‘regrets’ knowing Epstein as ex-wife alludes to ‘muck’ in marriage  The Guardian'Painful times in my marriage' - Melinda French Gates reacts to ex-husband in Epstein files  BBCTop Oversight Republican mulls Bill Gates subpoena in Epstein probe  PoliticoBill Gates faces fresh scrutiny for Epstein ties following Justice Department’s document release  cnn.comMelinda French Gates Reveals Whether She’s Forgiven Ex-Husband Bill Gates amid Newly Released Epstein Emails  People.com",
    "published date": "Wed, 04 Feb 2026 16:37:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdWZoNUQwXzlsS2hPYXNuREd6NUY0aGFmU3d1cTJCUldCc3dBYzJqRnJIcGE3ckt4ZnQ1dWdkMlpZYTNjSERkWUxMZUZpWlRxWm5mM2JkeF8zaFNJaU5DaV9YbGNnUDBLcDZPYjVfNU9Nck9pN1BLSWc1bkxBS09YQ2FfWm9RZGNYb1FOUGI2anQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Murdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite - The Guardian",
    "description": "Murdered son of Muammar Gaddafi was perceived as a threat to Libya’s elite  The GuardianSon of late dictator Gadhafi killed in Libya  CBCWho was Saif al-Islam Gaddafi, the man once seen as Libya’s next leader?  Al JazeeraSeif al-Islam Gaddafi, enigmatic son of the Libyan dictator, murdered in his mountain hideout  Le Monde.frGaddafi’s death, the last nail in an ICC coffin  JusticeInfo.net",
    "published date": "Wed, 04 Feb 2026 18:26:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNQmhnak8tUUVMSTUxeFlwSHJYNk14YVZDZmNhNkppU1hhWnJmRm9WcHRlTHU2dXA1cm5aZ1YtVUFKa0h5bVp0Y3RSbnRUeWlnWFFCazhtMWNGQUVYdndYX0xhcWtwVU5aMTJLZTRTX3BMQWNOeU1RMHZvNUZFallWT01xcEtWQ2VzdzlLSHhqMFpodEs1eTYwVE1WajRsSmw4UjZUckZSTjBRVDctNUtKeDZ2czFWcFhXV21j?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release - BBC",
    "description": "Brad Karp steps down as chairman of major law firm Paul Weiss after Epstein files release  BBCChairman of major law firm resigns after Epstein emails become public  CTV NewsTop lawyer, art world exec resign in more Epstein files fallout  MS NOWLeader of Paul Weiss Resigns Over Epstein Ties  The Wall Street JournalBrad Karp Resigns as Paul Weiss Chairman Amid Epstein Fallout  The New York Times",
    "published date": "Thu, 05 Feb 2026 17:39:49 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5Lc3RtOWdyV3pkcHZmSmpsYmxOMHJJUDV5LUdwR05DWnZ5NEpwU0k5ZndkaHVyREE4TjhxRG8wVHhQWjJhcThHQTluNVpmT0R4M3RCbXNJNnIyZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "After crushing protests, Iran’s supreme leader now tries to avert a US attack - AP News",
    "description": "After crushing protests, Iran’s supreme leader now tries to avert a US attack  AP NewsTrump warns Iran’s supreme leader should be ‘very worried’  cnn.comDonald Trump wants to end America’s half-century conflict with Iran  The EconomistSatellite imagery shows where the U.S. military is positioned near Iran  The Washington PostTrump's objectives in Iran are unclear as indirect talks take place, sources say  NBC News",
    "published date": "Wed, 04 Feb 2026 16:02:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPcWZhQXdtZWZhUXA1Rmd2LWlqenpETzhreFJqdjBSOTBwRFlJNm5MMmE2YVNkQnZSY2VEU1V0Mnp5eU00V1Y1WXRwWElyTU02THRVME9NbmVqbVlsY1JfWkFSY2w1TTVxeS10MDFFU2xxWW5CcVBneFNnOW9yUWVRZl9TUUVBdDlvcWRCVXgwT0E4MlJxejI0U1VaSHd3VXlWR0J5TGJFSFlYQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "AP News"
    }
  },
  {
    "title": "Supreme Court allows California to use new voting map boosting Democrats - BBC",
    "description": "Supreme Court allows California to use new voting map boosting Democrats  BBCU.S. Supreme Court green lights California pro-Democrat redistricting voting map  CBCWhy a Republican Supreme Court just handed a victory to Democrats  vox.comSupreme Court lets California use new Democrat-friendly congressional map  cnn.comThe US in brief: California’s map stands  The Economist",
    "published date": "Wed, 04 Feb 2026 23:57:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1DNUNieWY0UGVONU9vWXg3UUhTLUl2LUcxWVUtVFhyR2IxU0JsQ1lqQ19Ld1o3eldHTTZRcVlESTBHc3dkNmppMzY5N1A2OGZMSE5RYU5YejVRdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield. - The 19th News",
    "description": "The original ‘wine moms’ are in Ohio. They’re mobilizing to support Haitians in Springfield.  The 19th NewsJudge blocks Trump administration’s stripping of Haitians’ protected status  The GuardianOhio’s GOP governor: Ending TPS for Haitians would be ‘blow to the economy’  The HillOpinion | In Ohio, I Caught a Glimpse of the New Resistance  The New York TimesThe Egregious Haitian-Immigration Decision  National Review",
    "published date": "Thu, 05 Feb 2026 20:15:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5GVDZFcTVPS3dZMGt2bkZTVHAwVkYyR1dkU0tvbXlpdTdXc2hUZkl0N0JndU1BNVBLMF90TnlEVlJsN2dERjFqaEtTM3pKUUVMUTUtWERmU2RNUmlZd1JITjg1UUhUbVZWeHptYW01SUtGdmYxcVV2Qw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://19thnews.org",
      "title": "The 19th News"
    }
  },
  {
    "title": "Iran Is Obsessed with ‘Sinking’ a U.S. Navy Nuclear Supercarrier - 19FortyFive",
    "description": "Iran Is Obsessed with ‘Sinking’ a U.S. Navy Nuclear Supercarrier  19FortyFiveUS says it shot down Iranian drone flying towards aircraft carrier  BBCThe Abraham Lincoln Carrier Strike Group Is Operating Near Iran  ForbesUS shoots Iranian drone as Iran’s president seeks ‘fair and equitable negotiations’  Toronto StarTrump says talks with Iran continuing as US shoots down an Iranian drone  Al Jazeera",
    "published date": "Thu, 05 Feb 2026 13:45:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNUFdYZjdMWGRTSEVuTzVjaEo0R2ZSZnFHVkFwU0l6dDJzMTdNMzdtOGtGRnFyVldUenNOanJaQ2VWUFdOdUVaY1Y4Y2dlQWdKaUk0UmlhRGlTTXF4VUt3NFg3YURQRWUyY3JVZm51WlI4MTR2YXZDUkc4TmYxZ2pIdFlSN0o2emQ5djBTTTBVbTRsY1lkY1VESUdCY1NSSmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.19fortyfive.com",
      "title": "19FortyFive"
    }
  },
  {
    "title": "Cuba open to talks with US ‘without pressure’ after months of Trump threats - The Guardian",
    "description": "Cuba open to talks with US ‘without pressure’ after months of Trump threats  The GuardianCuba to introduce plan to address fuel shortage amid US blockade  Al JazeeraCuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens  NBC NewsCuba ready for US talks ‘with no preconditions’ as energy shortages bite  Financial TimesExclusive: Cuba says it’s ready to talk to US, but not about regime change, as Trump ramps up pressure  cnn.com",
    "published date": "Thu, 05 Feb 2026 18:39:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB2b05xTUtrOVdNZ1RjR1p0VVVwWDYzMmVUb29jQzlTVEoyU2VhSHBXMUNlYzRfcUc0UUN5TklZZ2QxNXRINkV6eFphTXVqd0oxdnp4M3JyNFBQWl9JSTFQdFdIVlplQ0ltaWFoOXVZRXFGbVk?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "At least one killed and thousands evacuated as Storm Leonardo tears through Portugal and Spain - Euronews.com",
    "description": "At least one killed and thousands evacuated as Storm Leonardo tears through Portugal and Spain  Euronews.comRescuers search for woman swept away by river as Spain and Portugal battle Storm Leonardo  CityNews HalifaxEurope feels the impact of Storm Leonardo and freezing cold  BBCRains pummel Spain, Portugal, leaving 1 dead, 1 missing  dw.comPortugal extends state of emergency amid destruction brought by Storm Leonardo  Euronews.com",
    "published date": "Thu, 05 Feb 2026 08:18:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPNXViMEFROUctSGxJWGJ4MmtEYzF0TXZuNzF6OXQ1R2JfV09GWV9IekdxNTBIUDN3dC1GRlpGNGhBb0xUNEVqMHgyQzl1MmF2TzQ0dUo4QUR0Snl5OU8tYW5aVURTNkhnOHItLWxWdGRNVktwRmM3MWVSdnZDWjdWNExudlZCOGhVdVV4WXAzR3NkS1ZPZl9FVHNZampSU3k2U1FwUHFuN2RoR3RSb2V0aVZqcmYtN2xkalBWSWZNcnJBc04t?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.euronews.com",
      "title": "Euronews.com"
    }
  },
  {
    "title": "Brother of Shin Bet chief charged with ‘assisting enemy in wartime’ over Gaza smuggling - The Times of Israel",
    "description": "Brother of Shin Bet chief charged with ‘assisting enemy in wartime’ over Gaza smuggling  The Times of IsraelBezalel Zini, brother of Israel’s security chief, arrested in bust of alleged Gaza smuggling ring  cnn.comIsraeli intelligence chief's brother charged with smuggling cigarettes into Gaza  BBCA dozen people including Israeli soldiers charged with smuggling goods into Gaza  CTV NewsShin Bet chief’s brother charged with ‘assisting enemy’ over cigarette smuggling in Gaza  The Guardian",
    "published date": "Thu, 05 Feb 2026 13:47:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOUmdUWkJ3dk9lTW9hQjB3RnctQ3E4QmNCRzhNWHBnYU9jbUVBV1BUYkpwMTIyQTgwVHhLc1hDNFVZVm9CNGV4RUtSUFlFaVhYd1p2MzlnVmNVRkFrU2d0UlBzQ0pyWlVZVzl3cjVzUjZPTm5fUkRlN0dyQ3IxRDlBZGNnNXR0LVlpZFlPc2VLcEdybzVGRnlLUHU1RndHektWSkpoR2pONk9Rb0VLS2hCVmJVSTlFdHPSAbwBQVVfeXFMTXM4U016Rm1oRmJvcC1JUjB4ZU5WVTg2ZWxBc0NSRGVjSFVJdVFGQ0dXdmFHeF9NS1h3VTU3OGNfNzFzSDlTMWxWMUpYZE4ybkJoOG03ZldoZnltUGlrLUw4UHRVaF9Wa29kNEFEOGdTZ25BeHRRTTJJdW1EVWRYc24tU1BqazBpZzJlOUc1VTJEcU5rWTVnTWRiZXp2a2VRZlYyTHZ1cmJfRE9lZUdtajJwRmlxdkpYLWFjeHA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "Massive illegal rubbish dump discovered near M57 in Kirkby - BBC",
    "description": "Massive illegal rubbish dump discovered near M57 in Kirkby  BBCAnnelise Midgely calls for tougher action on waste dump criminals  BBCMassive illegal rubbish dump found near motorway  Yahoo News Canada",
    "published date": "Thu, 05 Feb 2026 16:34:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBxVmZCZUtMVUJRMFdBTUlHQ0IxTVJlVURydlZBdFVLVVk0bDU1cnI5ajBaWngtcWRHSUcyWmI2Sl8yLWJpRVJLY21hOS1UZW51MkpXc3RCOTExdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Vladimir Putin to visit China, Kremlin says, as Xi calls for 'grand plan' to strengthen ties - NBC News",
    "description": "Vladimir Putin to visit China, Kremlin says, as Xi calls for 'grand plan' to strengthen ties  NBC NewsXi and Putin discuss growing links between China, Russia in video call  The Globe and MailThe Chinese Yoke: Russia’s Return to Vassalship  War on the RocksRussia’s Putin holds video call with China’s Xi  Al JazeeraPutin and Xi Tout Trade and Political Ties in Video Call  Bloomberg",
    "published date": "Wed, 04 Feb 2026 13:38:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPVW1KNm9YendmWmtBYjZORW94dkJuUGk4Q2ktczVsMjdOV184bjNEaDhJcTBnSENDMU80Snc3ZnBzb0h1aWlOU19iaU1VcUFoLWJfYThwemxtVUxDQ2R6dzdaWWRGZEtSNGtqU2owRUFCQU00R2hhMXR4U3luWlhtWmV5VndaNUlmMGtILW9HOTNGU2Vo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nbcnews.com",
      "title": "NBC News"
    }
  },
  {
    "title": "For some reason Elon Musk confuses child safety laws with personal persecution - Boing Boing",
    "description": "For some reason Elon Musk confuses child safety laws with personal persecution  Boing BoingSpain hits back at Pavel Durov over mass Telegram post on social media ban plan  The GuardianSpain v social media giants: What’s the big dispute about?  Al Jazeera‘We will protect them from the digital Wild West.’ Another country will ban social media for under-16s  cnn.comSpain’s youth minister floats countrywide ban on X  politico.eu",
    "published date": "Wed, 04 Feb 2026 18:53:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPbzZ0N2VjY1J2dUdUV1M1OXA1cklEdGJGNGQwY1d2TjZ6bzhQenRrTWVTTS1aY2c4b25kREU4ME5ieTVlVnBPU1R5VEV3aGFJaHVpZHFFVFRZaGRVODNQN2RLa212bzF5c3RudFhCZndXX0xrb2FFUk94Y19zVzZHb1N6UkM2a2hYLTJGNHFYWnhSVHZBbzdMc3o1RVYtQkprakUzdkdtdGxsNy1WUEhKcHRCZEtLU3RX0gG-AUFVX3lxTFBvS3NReHFJVDRlanNrNzZEd1M0RjJTQTd2OXdvcDlERFN3WWZmTG5ybTktdEFHUlY3Ri1vWVp1SzF4T3NhTE9veDJ0YmE1V0xJbEtNLWxzMVBXbk1WWUROZ2kzNnlTQlRBN0NzVy1PT3haZHZuWVY2RGFHOFo0aXpXeXNCeEhwQjZDTjBXdnNIWDlROElfOUNDc2lpV01TelBtVndKMkFmX0tObkxYcnM3VGNJUGVtTVlXSTR3RlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://boingboing.net",
      "title": "Boing Boing"
    }
  },
  {
    "title": "Trying to reserve your street parking spot with cones could result in hefty fines: City of Toronto - CityNews Toronto",
    "description": "Trying to reserve your street parking spot with cones could result in hefty fines: City of Toronto  CityNews TorontoWho Has ‘Dibs’ on That Freshly Shoveled Parking Space?  The New York TimesSnowstorm parking wars turn violent as cities crack down, neighbors clash and police warn of escalation  foxnews.com",
    "published date": "Thu, 05 Feb 2026 23:04:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOaHhqcWpUZEc0bllfZ0d1LU5JUVNUZzlHVXk5UU80REhRalU3NFUxNGNlcHAtbnFHN05TbHJNQjZaZEprWXppLUxxVEd0QnI0UE5EX2RTbXFsTFJvM05KRGMtZWZ4SGloV3NjbHkyUjB1VUFXNXlSVlpFaTd3dmM0Q1ZHaDBDY2VlZFBJdmZiODJxVGttd28zYXZWWlpIMmRGc3hUc3VDSzdvZ3EyUVQwNlpSUmFobEJ1SDRtQXZpZEIxTzBMX19yejg1czk2X2hrR2Q0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://toronto.citynews.ca",
      "title": "CityNews Toronto"
    }
  },
  {
    "title": "Under the ice: Winter oyster harvests on P.E.I. start early as crews work to meet market demand - CTV News",
    "description": "Under the ice: Winter oyster harvests on P.E.I. start early as crews work to meet market demand  CTV NewsCold waters bring sweeter, fattier oysters during winter harvests  WESH",
    "published date": "Fri, 06 Feb 2026 00:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNRHhZcXR3alAwM1RWcVJWRlVmNjQ5cmRNTkZyRTNBdlBkNXlWZkN1RDNJN2pmRUlsSkN4b2JyZGcwTFctTmdxNHhrdFZjb25KSEV0TlZqOW1zdE5hdjVoaGE1Rl9GWlZNTThOWkg4TFY4QmQwLWM0TUlxQlB4eHpRdUd1YjN5aUJteVBPazBlRVhJay1HUnFpUmtGaHJ3X2FZVmFPdm5fckoyNzhDUUszVXYtNXhYY1l2bUM2UXBwcXlyVnVfWkFBN3dR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "US probes Nike over white workers' discrimination claims - BBC",
    "description": "US probes Nike over white workers' discrimination claims  BBCNike facing U.S. probe over alleged discrimination against white workers  CTV NewsNike faces federal probe over allegations of discrimination against white workers  NPRFederal agency probes Nike over alleged discrimination against White employees  cnn.comTrump appointee probes Nike over claims of bias against white workers  Al Jazeera",
    "published date": "Wed, 04 Feb 2026 23:07:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9tVkd1dXJjQ01XQ1dIdlhaVEhmMlk1N0JfbDhTWHpJelZzaDFWUVd2UGJXb2VtdGc1LUFFNHNBY3hIVUpTUFlNVEdyZ1pLY3cxMnlPNVFKb2M1Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Angel that looked like Giorgia Meloni removed from Rome church fresco - The Guardian",
    "description": "Angel that looked like Giorgia Meloni removed from Rome church fresco  The GuardianAngelic face of Italian prime minister wiped from fresco  cnn.comHow an art restorer sneaked Giorgia Meloni into a church fresco  The EconomistAn angel resembling Italy’s Meloni is painted over after an outcry from church and state  CTV NewsChurch fresco resembling Italian PM has face scrubbed out after outrage  BBC",
    "published date": "Wed, 04 Feb 2026 17:27:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQNGp4Y3FqX1kxNmdQQjBzS2VSLUlXbGMzcldrdVZMWGJxeTR5d1BzNE5GaDVCSEJCS09BUnI4NWtONk42VE5NYldSa1BDMHN3T0FTZWlDNmlWbEhLTEN3RkJmQ2JaVWFyUVdQcHVCQUpwS3Mtbjk5aDVmYjQ5RXVMSXF6cHpXRGI3US1aWUxteU1EUklGVEZvczg3VUhtLXVGY0xXU2tjSVlnSnNOSVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "‘Stark warning’: pesticide harm to wildlife rising globally, study finds - The Guardian",
    "description": "‘Stark warning’: pesticide harm to wildlife rising globally, study finds  The GuardianThe toxic burden of pesticides is growing all around the world  New ScientistPesticide residues alter taxonomic and functional biodiversity in soils  Nature",
    "published date": "Thu, 05 Feb 2026 19:19:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNdmxKVEFQVmVDMllrQktyZTFjcVcwOVZLRC1lLWN6TVEzRFhUSDBWQ0N1dVR6b0ZaOHNVU05DRjlDaWRReEpwaDdGaXVIMDJ4d1VIQTg3RTNwWlhTcERienRONzU4VTZiRXF5NlgyLTAwVC02UFVwaGxkSHg3SkhhMi1zRDhTR01XcmNocUVyS185b1hKMmFjQ2o4aFhvempGRUJqRnd6Um9IQW1NdGJGSnVCWnl4MTV1aElZ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "Russia jails stand-up comedian for six years over joke about wounded soldiers - Ynetnews",
    "description": "Russia jails stand-up comedian for six years over joke about wounded soldiers  YnetnewsRussia jails stand-up comic Artemy Ostani over war joke  Al JazeeraRussian comedian jailed for nearly six years over war veteran joke  ReutersStand-up comedian gets nearly 6 years in Russian prison over joke about war veteran  cbsnews.com",
    "published date": "Thu, 05 Feb 2026 15:39:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTFAtSkhCVklDNlN6ZENRclB2a2VhSmJQaTA3a1lnandCOEVFTG9oeEhNUmZMYWFLZHF0NFBya2VTMF9zWmxNcXNZWEIwR3NnQW9mbzQwTFRn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ynetnews.com",
      "title": "Ynetnews"
    }
  },
  {
    "title": "An estimated 8,000 cold-stunned iguanas removed from parts of Florida - Phys.org",
    "description": "An estimated 8,000 cold-stunned iguanas removed from parts of Florida  Phys.orgWATCH — Why are iguanas falling from trees in Florida? | story | Kids News  CBCFlorida euthanizes 5,000 iguanas after cold snap stuns the invasive reptiles  The GuardianIguana Meat Pizza Debuts at Florida Restaurant After Cold Weather Freezes Iguanas en Masse (Exclusive)  People.comAs cold-stunned invasive iguanas fall from trees, Floridians scoop them up for killing  The Washington Post",
    "published date": "Thu, 05 Feb 2026 21:47:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5DQ1lkQVBKU0ppWGpHemlSTVUyQzQ2aE1sV3hwcVZpdk9BR3hoMXI0dGtvampPMmdNVnV0NkVNeFAxdWhIbTRobkJQbUZDZDJQRGd2T3Y1UWVxNHZxZ3lEcVlSZDVOYVFmaDZpQWxDZ2g?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://phys.org",
      "title": "Phys.org"
    }
  },
  {
    "title": "SCHOLZ, Magdalena 'Leni' (nee Dragaschnig) - SooToday.com",
    "description": "SCHOLZ, Magdalena 'Leni' (nee Dragaschnig)  SooToday.com",
    "published date": "Wed, 04 Feb 2026 20:40:04 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcjJEbmZoRXFzT0JUNDBHOTNvUFNKb1NnNEtBYk5WSzdkRENyTGwta0lvUGw1Tzc5aWRPVTF4RS1zcS12bVZtQWRmNTF0a0ZycVRMbVZ6NDB3T21abzdtb1FHdERBUTdJVHBfVU8xOUtxU1otdko2SENtelFEMGlqYl9VLVFPOUtLT0E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.sootoday.com",
      "title": "SooToday.com"
    }
  },
  {
    "title": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’ - cnn.com",
    "description": "Melania Trump referenced her documentary at a White House event with former hostages. She says it’s ‘not promotion’  cnn.comMelania bristles at Epstein question when confronted by reporter at event to honor Israeli hostages  The IndependentMelania Trump meets with freed American-Israeli hostage whose story she features in her new film  CityNews HalifaxMelania Trump Uses Event With Freed Hostages to Promote Her Documentary  Rolling StoneMelania Trump Gets Confronted About Ghislaine Maxwell's Prison Treatment  People.com",
    "published date": "Wed, 04 Feb 2026 23:03:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNTnZfUEtLV2tYNHZhMWpKUEJYdTU1Z0xveFhuZWV4OTgxdHRGcE9PaTA1X0hQbkNpNHZsTHVTZ1FDdHZRd2xlTGJCN25OQWtieVh1bEYzMFlNWTllN0dnT092Vzc2bjJUWkVwWGlPRGhxOHZ3YlJZOVNZVWY3VGZqdHdITmlvYVVkYzdOOUdidw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "cnn.com"
    }
  },
  {
    "title": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack - The Kyiv Independent",
    "description": "'The worst damage we have seen' — Ukraine's energy crisis deepens after latest mass Russian attack  The Kyiv IndependentVideo: In frozen Kyiv, one Ukrainian plumber is in no mood for surrender  The Globe and MailThe Assault on Ukraine’s Power Grid  The New YorkerThousands without power in freezing Ukraine as renewed Russian strikes continue  BBCIn freezing Kyiv, Ukrainians endure without heat, power  dw.com",
    "published date": "Wed, 04 Feb 2026 12:24:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUS04VkRneFBHR3hLVDNsX3ZqUFNXeDJVRHpkRE00X2xWMDBRdzlqRHd2bEg4OXQwV2MwcDRoSHVkNW9ZVk9RLUZKd1NsT3B4OTYycWZGNS04STM4Zk9pV2FzZFV6bWNxY0hNTVZ6bHdZcF9mR2ZVaWxfSjZMNU1JbmpKUk9tS2dvSTRjZ1B4Smg5VzZmRmtNTThwTXNIZlNZZ016Q1ZGcnJwNU1pTFBGbzRXYnc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Chris King's New Gold Grease is Claimed to Roll Faster & Last Longer - Pinkbike",
    "description": "Chris King's New Gold Grease is Claimed to Roll Faster & Last Longer  Pinkbike",
    "published date": "Thu, 05 Feb 2026 01:11:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPR1BUUlpCNWwza1N1WDdvazVuaEdDTi1sdHh4SUhZenBUYTNXeU9HcGZNZTVPRE5OcWNjWWFDczVKMUhLMkkxcUd2Z0RHNEVOaVZlMDJ2d2o4NTc3TE0zVlg3TkRyb1VfQ0gyWVRUaklaSkNpclpqdkV0ZmY4bTVNNV81VkFnUVJfN25lVHVXbkJRZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.pinkbike.com",
      "title": "Pinkbike"
    }
  },
  {
    "title": "Congressman prays in front of Trump, asks that president finds ‘greater clarity’ - Global News",
    "description": "Congressman prays in front of Trump, asks that president finds ‘greater clarity’  Global NewsTrump Awkwardly Stands Behind Democratic Congressman Who Makes Urgent Plea During Prayer  Yahoo News Singapore",
    "published date": "Thu, 05 Feb 2026 19:30:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQRkNCWldUb1lWZDRTbzdlQUo1QVJKY1pYbzlMR3p1cElrOFd3cG5HNFpkY1JxOG5CRFlZVUVGakxzWXk2cmVZZV9fTDZ0aF93RThuenVqTlBZdEdDWndBSEJ6aWxPclRld3RIckZpMko1eGdVZmsyWkVBVUJ4Zlktdnd2RXJUclJydFp5dWpBV0kwczQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead - CBC",
    "description": "Civil rights lawyer says Trump officials couldn’t break her spirit, so they doctored her photo instead  CBC‘They Couldn’t Break Me’: A Protester, the White House and a Doctored Photo  The New York TimesArrested protester reveals pain caused by White House’s AI-generated photo of her crying: ‘Was just so degrading’  Yahoo News Canada",
    "published date": "Wed, 04 Feb 2026 23:20:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMWh2N1BudVJxZ2dMUVZPWGFfVHM3WFFZd2RRZ2o1UlY4S3BqNUtoNmhwc0QtUUxaV2dsajliMERaQ056akpUUzdfbUtTVzFUdmpMcm15RGVjdFJnMnYzZ2Yzd29jMG5ZaGZPNm1zWjV4X3JJNHVpaXlNNkNKSmI4c3ZMTjJPVHF3N1dn?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Photos of Cubans getting by without power as outages persist and tensions with US escalate - Yahoo News Canada",
    "description": "Photos of Cubans getting by without power as outages persist and tensions with US escalate  Yahoo News CanadaView Full Coverage on Google News",
    "published date": "Thu, 05 Feb 2026 15:27:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxObk5ibmJZZUIyQko1LU04RURpcGIwalUtQmxUQnpqdXVJVlVWVzBHekxPMndUemhTbjVGVU1LMHdZeGVwSThWcW9rejNLbmNiLTd2dEh4eUJSaTRfV2FFS000TnBCOHpPUkpIbmk4MGZ6TU9FVkZhT1lzaWU3R3dWWGpB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings - CTV News",
    "description": "Here’s how AI enhanced photos created fake news surrounding the Minnesota shootings  CTV NewsHow to tell real Minneapolis ICE surge videos from AI deepfakes — 5 key clues  inklImmigration Agents Are Killing and Abusing People. So Civilians Are Turning to a Controversial Tool to Find Justice.  SlateAI-Generated Anti-ICE Videos Are Getting the Fanfic Treatment  WIRED",
    "published date": "Wed, 04 Feb 2026 21:39:45 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPNVRyUXFzX3dpTmlVTzltVlVuaWY1YXQyanNGVE9oVXZPMktuSGQ3bDlEXzZUTXJIVXRNbXpjVV96cEY3RjNjRnA0b2xBaEczaXRFNFFxVWt2ZDdBeHFnTzF3RURqUkZkT3hHTkhzbFVfNG0xVG85QndLTmVOTklPREdwanNnc3V1bGFSQnVBQTlWTVprVG1sc1hkTDRCTy1YNlg1OTdzWmFSdHlpYlRFc0tweGc1UnBiVTBZQzIxX05PSmhQQUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "CNN’s Kaitlan Collins Fires Back After Trump Slams Her For ‘Never Smiling’ - TV Insider",
    "description": "CNN’s Kaitlan Collins Fires Back After Trump Slams Her For ‘Never Smiling’  TV InsiderTrump told a female reporter to smile. Why women aren't happy about it  USA TodayVance: Trump insulting Kaitlan Collins for not smiling was ‘so perceptive’  The HillTrump Scolds CNN’s Kaitlan Collins for ‘Not Smiling’  The New York TimesMegyn Kelly brings up advice from Roger Ailes to defend Trump’s ‘smile more’ attack on Kaitlan Collins  The Independent",
    "published date": "Wed, 04 Feb 2026 13:47:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9sRlJraW5pNDdra2dHdUZaSkRWVmM5a2NzWWhYazRrdGFqZVptWFNIZzZfU1NzamZQREdqTkdfekxHOWlycFVtbV9lc2JBQkxDdi1nQXpjeHFqRHI1SlJpMHNfbXhiT0d6RWh1dDJMWGc3Y1YwTER6dmJKSWE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tvinsider.com",
      "title": "TV Insider"
    }
  },
  {
    "title": "Ukrainians Arm Cargo Plane With Miniguns to Hunt Shahed Drones - Kyiv Post",
    "description": "Ukrainians Arm Cargo Plane With Miniguns to Hunt Shahed Drones  Kyiv PostWatch Ukraine’s Minigun-Firing, Drone-Hunting Turboprop In Action  The War ZoneIs Ukraine using Polish ‘Skytruck’ plane to down Russian drones?  TVP WorldUkraine Converts An-28 Into Shahed Drone Hunter  Мілітарний",
    "published date": "Thu, 05 Feb 2026 17:03:30 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE1TMTdrQ3pJdFhoSFp0Y011TFdibHNPQURUWXp2RTBqYVdUbF9kX0tDTmtYYk55aDFLSWFXY1VheVBBdU5CRzBBNnc2SQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kyivpost.com",
      "title": "Kyiv Post"
    }
  },
  {
    "title": "Mapped: Which Countries Rely Most on Imports - Visual Capitalist",
    "description": "Mapped: Which Countries Rely Most on Imports  Visual CapitalistThe World’s Most Import-Dependent Countries, Ranked  Visual Capitalist",
    "published date": "Wed, 04 Feb 2026 13:02:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE01NDBlbnZoa201cS00eW84Vk13QUVuY21DUWlwSmJLVkU5dTZzeXpScmdkcEVwTzFaY25zcmVUOU41MUFKTTVyYWwtZ2dKaXpFcXQ5dHpSQU15aEFoM3RKM1l6ODNRX01uVmZldlRKQjJoUE5IdDZfb3BTZEpaR28?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.visualcapitalist.com",
      "title": "Visual Capitalist"
    }
  },
  {
    "title": "Ukraine’s Secret Weapon Against Winter? It’s Hiding in Soldiers' Boots - UNITED24 Media",
    "description": "Ukraine’s Secret Weapon Against Winter? It’s Hiding in Soldiers' Boots  UNITED24 MediaVideo: Witnessing the drone war for Ukraine from the Russian side  The Globe and Mail",
    "published date": "Thu, 05 Feb 2026 18:15:24 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRjA4QldlbnkzdUZxbmowVmxXRzZ1ZDFPMzZCTFl4eUxaZlh1MTZ2ZkVfdmxOSHI3QlNFT1JabXdRV0tPVDk4QTJ5M1RXY3BZVEJDdll5eUxQcmlkVi1zOXV1VXBSdlFnUEMxTW55TzRGeTY3TlB1elphXzgtUmdzcjdqN2U0RFpSOFJxVVZyclpqTnM5QW5pRldhOVVRS3FQZWZqTFpMcnR1VnB0ZkNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://united24media.com",
      "title": "UNITED24 Media"
    }
  },
  {
    "title": "Man once married to Jill Biden held without bail after being charged in wife’s killing - Castanet",
    "description": "Man once married to Jill Biden held without bail after being charged in wife’s killing  CastanetView Full Coverage on Google News",
    "published date": "Wed, 04 Feb 2026 16:23:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxObVZzQUk0Vy1rbVp1VVVGWVhjZEJ0TC01Z19aVEg1MFI3ekw3cmZZa0tUNjYxZ2ZsS2J5dFJ2Yl9wVkZKR3FHaDdJVEl6MHNHczZqdmItN1JUSzgyWi1EeDBmV094ZWZtSzlLN2MzamhMLWJEVzVYa2huN3g4djVBcWpibWcyaUdWR2J0TURVMXRsOVl3bE5kc2thbTVaT0QxTHVReVhYbThTWUdia0VUcGRYQnJkZ2IyWDROV2dvNURwMUcyY0RiTg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.castanet.net",
      "title": "Castanet"
    }
  },
  {
    "title": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost - The Economic Times",
    "description": "Quote of the day by Melinda French Gates: 'I wanted to do things the right way, which, in my mind, almost  The Economic TimesWhat to Know About Melinda French Gates, Philanthropist and Ex-Wife of Bill Gates  People.com",
    "published date": "Wed, 04 Feb 2026 12:52:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMilAJBVV95cUxQVU54Z1FKOXVsMnpwdkxxcV9vdEhEa20wN0NEOGpHZzYyMEh1RUtFX3BfT25RTGdpT3pWUzdXSlc5REd1U290NlN4a1plLTRlY0lKcUpsa3N4Zk5rX3NWUWZlTUlHRERlWVNCQlBMN0RGODc4LTE1Um1oTDNodV9uNzQyNi1UYTY3SUk4Z0RZRE1ZLWRBc091OExwZ3NGWTRWemRDUVNyN0t4VjZLM0ZnSC1nQ25TZ3p6TFkwNl9VWHEwU18xX2g1M3p2LVhzMzdpRTd5TEFXdG84a3J5WFVNeXJMWHdGaC0zd2dMRFlzZVRvRmtxNk1GVTd3QTdrN3c4NTFRakZ4SnJ2UmdhSWxlTDhlaFnSAZoCQVVfeXFMT1IwTXBucnJ5NjJzWTc4TWEtLUlxWmlRREZLaDhRWW5uTENham1TWmZBUVBwLS1QZTYxeEFDNHVsdVZzdG1zLUlrLWFjencxSmphRUtqVm11ZllQMmJUa0dnSWpiVXU2d2d5akgxcHJtR3hBMjNLQlFEMWkyaEJWNWJWdkpnQ2lXcER0MlUxTnY1Rzk2ekJzZ2J2U1V5Y3NSRkhGVDFNeTJWald1OVB3cmtmYnNGa0ROZnloNzMtSUpxSDhReklQVEpEejBvV0I4ZExHa1REYm5nWUM4Nkh0anlmMk5hUGF2YUVmTzdhUi1vNVRodlliazFmSVlvdzc5T2Zka2NHamdxUGgzeTZPaHM5OFNsMUVndjNB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://m.economictimes.com",
      "title": "The Economic Times"
    }
  },
  {
    "title": "U.S. Army veteran faces deportation after 50 years in country: ‘Thank you for your service...should mean something’ - CTV News",
    "description": "U.S. Army veteran faces deportation after 50 years in country: ‘Thank you for your service...should mean something’  CTV News",
    "published date": "Wed, 04 Feb 2026 19:34:09 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOZGJrRU5TR09tLUxWN2g0TmxqYVhHaGxlRU9acjNjN0RHTVFrRXFmRlFudWlMMHNUeTZZN1A4UVZRaDktMHdtc1lvSmRhdVJQNkZMV2xkS2tLNDJEVk9QWm1id1dIWDRteEtBbnU2NV9kVEpkZVFvTkdheXg0SXVjX1M2S1Z3c1ptS1ZObGlNUGZmWjctWWlvNTVCQ3pZb1V1dzNaLWt1aHFNWWRQX2d5OFhzbzVUa2x3M21kbmRPSG5NbzVURWJibmpMNkRCTnN5bWpnNF9iZ21pR2JlU1E?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "How Iran’s infighting consistently derails diplomacy - ایران اینترنشنال",
    "description": "How Iran’s infighting consistently derails diplomacy  ایران اینترنشنالNegotiating with Iran Poses Significant Risks  FilmoGaz",
    "published date": "Wed, 04 Feb 2026 18:22:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE45SzNUMktOcS1YYVRGcHJnVzVwZzJxaTlWdDNEV19QdG1xQkFYd2VvUFRaeGZlU0hTcTJ4SkJyX20xaE80QmJqbEdJNm9td0xEVlE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.iranintl.com",
      "title": "ایران اینترنشنال"
    }
  },
  {
    "title": "Canadians visiting Mexico to face stricter penalties if they bring banned item - Daily Hive Vancouver",
    "description": "Canadians visiting Mexico to face stricter penalties if they bring banned item  Daily Hive VancouverAfter Mexico bans vapes, cartels tighten their grip on a booming market  Toronto Star",
    "published date": "Thu, 05 Feb 2026 19:07:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5uTk9NSjUxOTRUR29Dc3BHdTdvRnlaUHQ1OUNqOHBDRVR4eFZvcXJGNmlaakhTRTZNRWt1Y2dmX3RRTDlpcnptc25GZldRUEVuc0FxWFI1dXhjRzQtRUlwdGxEdDljczhtOXhDM2pLVU5BUW41V093?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Man sentenced to life in prison for 2024 attempt on Trump's life - BBC",
    "description": "Man sentenced to life in prison for 2024 attempt on Trump's life  BBCRyan Routh sentenced to life in prison for attempted assassination of Trump in 2024 at Florida golf course  cnn.comVideo: Man who tried to assassinate Donald Trump at Florida golf course gets life in prison  The Globe and MailRyan Routh sentenced to life in prison for trying to assassinate Trump  Al JazeeraRyan Routh, Man Convicted of Trying to Assassinate Trump, Gets Life Sentence  The New York Times",
    "published date": "Wed, 04 Feb 2026 17:57:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5ZbDkzeW12MDdnUDlHeGZ6c1FXbENZWUlYLWFUQXh2bklCT2NMVjNwRF9SZC1abGg0aE42LVRvSnFVelVMQ1djUVd4bVZTZGNNZkNlSXNGcmZUdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]