[
  {
    "title": "8 skiers found dead, 1 still missing in deadliest avalanche in Northern California in decades - CBC",
    "description": "8 skiers found dead, 1 still missing in deadliest avalanche in Northern California in decades  CBCEight skiers found dead after California avalanche  BBCWhy did they go? Avalanche warnings couldn't stop deadly mountain disaster  USA TodayThe backcountry ski trip hit by avalanche was led by an outfit offering mountain adventures globally  Yahoo! Finance CanadaKey question in deadly Tahoe avalanche: Why did skiers leave shelter in blizzard conditions?  San Francisco Chronicle",
    "published date": "Wed, 18 Feb 2026 19:30:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNT3VMcjYtTXIwVHpJTXQ2elBMYUNVRWM0ZDhDdTNzd3VXTXpyRVNyelNwUUpwS1pWT1NlNEw4YzNpRW1OTFpuTHAxTTdsX01YQlRXRDc5TGdoNHRJVE1ubVljR2V2X0pndUtmNjB6c09IbTBkZV8wQ3cwV3FwNm1DaHRQNjE3SHBKTmI2eE13?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say - CTV News",
    "description": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CTV NewsTrump moves closer to a major war with Iran  AxiosUS military ready for possible Iran strikes but Trump yet to make decision, reports say  The GuardianCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI NewsUS-Iran war could be imminent and take weeks, sources warn after latest nuclear talks  The Times of Israel",
    "published date": "Thu, 19 Feb 2026 00:12:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNWW1sV3QzUzhGRGs0SlZOcmJEVzlyMndqQ05xTmJNWDRIdU00amNKcWUwbjUwVUhnNENRZ1dzQjdaZEhhSzc0YURLQ3IxaEpOUnprVDlBX1FBLVJlMllCR0lkYXEtS044T2JJY195T1JteHZTYXNOVHE0WGREOUMxTUZxajVobVFERXBzNDhFYjMwZHg4bXI2dFNlT3pBUXlGM1U4NDNEcUcwVEpnNnJhUDdJZ1NWOTNfYjVIQ1NRZ01UWkxjYllyMEs1amZEOFB4TVRiMkVpeTdSSEVJN09OZElnWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Team Sweden left with 'bitterness and heartache' after OT Olympic ouster - NHL.com",
    "description": "Team Sweden left with 'bitterness and heartache' after OT Olympic ouster  NHL.comQuinn Hughes' OT goal sends U.S. to Olympic men's hockey semis  ESPNQuinn Hughes' OT winner lifts U.S. over Sweden into Olympic semifinals  Yahoo Sports CanadaWinter Olympics 2026: “I wasn’t ready for it to be over” – Quinn Hughes’ overtime goal against Sweden sends USA through to men’s ice hockey semi-finals  Milano Cortina 2026This Quinn Hughes stat makes his game-winning OT goal for Team USA even more impressive  Yahoo Sports Canada",
    "published date": "Thu, 19 Feb 2026 00:47:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNRWhubExzTE95MkdJemgxcFp4bUVESjQwSlRXaWxZcUl0TjFfMG9GZldaNjQ1YXo5Xzk5emZlSVZ4a1l1ZGJ0bWdyWjlKaExBSk1lRUp3VlJPNGFxbVAtUThNNWZhZ0N1ZHI1Z1hRTXlfbkZCbnVOeTdZQ3QwaEZqaVdvWFR5UW5hbHc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.nhl.com",
      "title": "NHL.com"
    }
  },
  {
    "title": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview - Global News",
    "description": "Stephen Colbert hits back at CBS bosses in dispute over unaired interview  Global NewsWhat's the equal time rule at the heart of the Colbert-CBS dispute?  CBCFCC chair: Colbert sees the ‘limelight is fading’  The HillCBS lawyers pulled James Talarico interview over fears it would violate Trump’s regulations, Stephen Colbert says  The Globe and MailFCC chair Brendan Carr says media were ‘lied to’ over Stephen Colbert controversy  The Guardian",
    "published date": "Wed, 18 Feb 2026 16:14:58 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9tSTZ2alNoeEw1Mi1XZ3AxVlJsV1JCeHFIMVd0bE5HRVRpZ2wwSkZzS1puZlI5Wlp5SUZSYkR2NDhNUU9haVA1NF9BLVlzSVlVX0JMcE8wbXpRVmkzTDNtSVpVZ1JrRVlOcFY1N0c1am55Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader - Times of India",
    "description": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader  Times of IndiaJesse Jackson (1941-2026): The life and legacy of the civil rights leader through the years  CTV NewsChildren of the late Rev. Jesse Jackson honor his legacy as memorial services set for next week  Toronto Star'He did it for us': US soldier recalls Jesse Jackson's efforts to free him and two other POWs  BBCSports helped shape Jesse Jackson's career and inspired the ex-quarterback to fight for equal rights  CityNews Halifax",
    "published date": "Tue, 17 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPUFF1QmE1cUMtU2hVVVJLVWNvdjdPV0stZXFldzBWakY1bVAwVUZLM0J5anV3S3VjNEowOVlCMklPZFJQWnBlTFlrN243S1FIcnZhWUFFUmp6ZzhMcngwd05uU3MyOGNlRlBRTnlsdVNUdnBVdzVmRFZuV1JOVENTS005bzZIWVo1X1k2d3pjVXFKNUdmdmp2VWNQcDFJM29CU01qbTJPSWxuOE5GSUFqb1N4V0VCTWZ3N0hpTWdndDZEYXVLMWI1bE4yTDVHM0tSV3o1Q0xpWHdTQTRsb0FyYlRVbXE4QVRudUNjTTF3ZWZ2NU9mM1BiamsxTdIBgAJBVV95cUxPaXRXbjVyOU14VFR3YWJYeW5WRDJvSHBaNjFVRFUtN3kzVUgtcEFheVExRlZYaUN2SlRQZzBpTGtjUWNOeGRkbndsd2t5dVNYY3VfZTcyYjlFT05naHZiLXAzVEtnM09iRmI0bnYyZ1ltTTlFejNsdU1MRVBES1dIU0g2ZmY0QktmOHNWNkJXRVk3bFIxV2wxNlpKMEhtZWMtTDZ6elRTczkwMFVINkRETXZXOVVDcm1nTi00ZXEzbmRHckVOcHNFNU9lZUVHQklacHF1dlQwWTNiRWM1Y2xuclk0TmxpUFVQc3JxSU1YWlFldzhLcTVZNmJkRC04NDNK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "'Difficult' Russia-Ukraine peace talks end without breakthrough - BBC",
    "description": "'Difficult' Russia-Ukraine peace talks end without breakthrough  BBCZelenskyy says no agreement on key issues in peace talks as he accuses Russia of ‘dragging out negotiations’ – as it happened  The Guardian'Difficult' peace talks spotlight Putin's chief negotiator and Ukraine antagonist  NBC NewsRussia-Ukraine talks: All the mediation efforts, and where they stand  Al JazeeraUkraine updates: Geneva peace talks end abruptly  DW.com",
    "published date": "Wed, 18 Feb 2026 22:33:48 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE10TlRjZTFxT3ZSbF9TQm52SWlVZXB3M0x2ZThJcXhjcEdMN25SYUMtVXVKSl9JaTZPbklzTkJfX3BTMmR3VkFNbjg3VzR5Z2pXTW01dEIzZ2tBUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Iran says progress made in nuclear talks with U.S. after partial closure of Strait of Hormuz - CBC",
    "description": "Iran says progress made in nuclear talks with U.S. after partial closure of Strait of Hormuz  CBCView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 19:12:32 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOS0VKLXplTTJISTZPUU1QbTRkUFNzNkJyUGFHcWxFQUx1UVU3b2U2dXlqZ1NQcmQ3RG5vQ0ZuQ2xfTi02c2wxYnAzY2xGY2JIWGVmaTNIaDVXeXhFT3ZtMlUwNV9WalNQODhTeVhUcGVLWGp1R3dTcW1ERjhmVWhKV3ltVkU1aExSTnd3ZndpbTRYZ3M?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Analysis: China’s biggest TV event had a clear star: the robot - CNN",
    "description": "Analysis: China’s biggest TV event had a clear star: the robot  CNNChina’s dancing robots: how worried should we be?  The GuardianChina’s humanoids are dazzling the world. Who will buy them?  The EconomistChinese Kung-Fu Robots Put Western Efforts to Shame  GizmodoChinese kung-fu robots steal the show in world's most-watched TV program  Le Monde.fr",
    "published date": "Wed, 18 Feb 2026 08:23:19 GMT",
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPdjBseXQ1OXVOdFcyRF9hckF6MU1Yd2JzWS1uQmQ2R0hybzFwbXBKcVcxYXJBRXZzME9RWGFQQVB6SHNtSU5xQ29qU2NEdS10TTBtVTBnaWM1RkxFWHFDZ3hmY3NwY1ROSjExNW90VF94MXE3bVZmMUpsVXNmZXdiNkpPUlpRX0c0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Iran security official appears to fire on crowd at cemetery - BBC",
    "description": "Iran security official appears to fire on crowd at cemetery  BBCIranian families mark protest killings as schools observe strikes  Al JazeeraIranians Mourn Slain Protesters With ‘Revolutionary Rage’ - The New York Times  The New York TimesPopular anger burns in Iran after crackdown, as Trump turns up pressure  The Washington PostIran's 40-Day Mourning Ceremonies Spark Renewed Protests  Radio Free Europe/Radio Liberty",
    "published date": "Wed, 18 Feb 2026 18:14:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA2MW4zcHpCOXl5b3cwLVRaYWVvWGNmNVIzMWU4ZGtVWER6aVpaR1pmdTM0NGd5SnF2UDYtZEJWd3lmMTdtaC0wWDdZNEloTW1sOXFaaWdtMllLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "What is Ramadan, the holiest month in Islam? - explainer - The Jerusalem Post",
    "description": "What is Ramadan, the holiest month in Islam? - explainer  The Jerusalem PostCalgary community joins nearly 2 billion Muslims around world to begin Ramadan  CTV NewsRamadan ushers in a month of fasting, worship and charity for Muslims, in photos  Toronto StarMuslims around the world celebrate the holiest month of the Islamic year, Ramadan  Yahoo News CanadaRamadan starts tonight!  CBC",
    "published date": "Wed, 18 Feb 2026 11:03:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFA4NGNucEZqUWpJSVVRNERlTjBMQlpJVTBfd1c1QW5JaUVqZHlHNXJMTXZLdko1M1o4XzNwR3hoalRyeG5xNWdKZTZtWmZEeElicV9NdmFnMDBqZ3Mt?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.jpost.com",
      "title": "The Jerusalem Post"
    }
  },
  {
    "title": "Sun, sand and empty beaches: Trump oil squeeze chokes Cuba’s tourism - CTV News",
    "description": "Sun, sand and empty beaches: Trump oil squeeze chokes Cuba’s tourism  CTV NewsAid the Cuban people, not their oppressors  The Globe and MailFuel crisis in Cuba: Should Canada help?  CBCUS sanctions, power cuts, climate crisis: why Cuba is betting on renewables  The GuardianCubans face the enemy ‘inside and outside’ as nation spirals deeper into crisis  The Record",
    "published date": "Wed, 18 Feb 2026 11:57:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQaldYcjVXdFJteWt0b05ZWlRiOVlEb0Rac1UzT3daRWMwWm5fZm45VmNUbE9GQ1V1Nl9KMVVaaGFSeG9fOG95UmkxS2R1aXdrTmVBekJ6RmtuelZLcV9ISlFpZ19JTE1VcnB6bmJtel9tREUwOEFxR0VLN1lRaXBORDJ1UEhxN3Q0WDZKVGRlQ213SHBQb0hlaF9Ed0tXWVJ1LU1IN0ln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Nancy Guthrie Case Explodes: FBI Contacts Mexican Authorities as Shocking New Ransom Note Emerges - okmagazine.com",
    "description": "Nancy Guthrie Case Explodes: FBI Contacts Mexican Authorities as Shocking New Ransom Note Emerges  okmagazine.comNancy Guthrie: Desperate hunt for breakthrough turns to Mexico  BBCNancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold  Fox NewsFBI Contacts Mexican Authorities in Nancy Guthrie Kidnapping, New Ransom Demand  TMZArmchair Detectives Complicate Nancy Guthrie Case  The New York Times",
    "published date": "Wed, 18 Feb 2026 21:43:07 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPaUZGUHpnaEZzdlBKelA0LWNHeERsaUxpVW53aDZqUXZIRDI3NVczVTdYLWdPS28zb3BIZVZMbjBORlJ1WGhJZ2g5aWtBYl9hZ25TMXFkRENManc0a2ZudjI1N21wT3VJM05YNVRMbXhkSHJ4UmZJMFpjUVJUcXBIODFaQkVCQnNVZFVsYzNoQUR6TUZIa0ZyUDVNUG9TQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://okmagazine.com",
      "title": "okmagazine.com"
    }
  },
  {
    "title": "Year of the fire horse - explained: the Chinese zodiac sign that’s all about intensity - The Guardian",
    "description": "Year of the fire horse - explained: the Chinese zodiac sign that’s all about intensity  The GuardianLunar New Year prayers, robots and festivities usher in the Year of the Horse  CityNews KitchenerVideo: Lunar New Year celebrations kick off in China on the first day of the Year of the Horse  The Globe and MailSudbury communities welcome Year of the Fire Horse with food, dance, family gatherings  CBCLunar New Year is under way. Here is how people celebrate it  CNN",
    "published date": "Thu, 19 Feb 2026 02:50:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOM3c2NGN4ZGtNc2daZzBhOFctYU90UXZRTzNoazJfNjJnS0JjOXM1YklCZzlDdURqUl9uVkFXXzg5SDJRblNmYWM0czJQNTV0UEpJNTZYMDRKWEUwQms2aTZnZDJIX3NEVmhQZlFONHVsaHEweXNNLWlDc1RrN3R2M2hvX1EwaWpYOFRlQk9OTERqR1lSUDVzVGtwRlhpajhWbTRKb0VrX1RuamNZNGdwcWFR?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theguardian.com",
      "title": "The Guardian"
    }
  },
  {
    "title": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game - Yahoo News Canada",
    "description": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game  Yahoo News CanadaVictims in Rhode Island hockey arena shooting were suspect's ex-wife and son  CBCPawtucket shooter’s gender identity tied to past family disputes, court records show  WPRI.comMan who tackled shooter at hockey game recounts chaotic moments  CTV NewsMan says he grabbed gun and struggled with shooter who opened fire at Rhode Island youth hockey game  NBC News",
    "published date": "Wed, 18 Feb 2026 15:58:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQcERKZzVlbEJFRURFcHRGTmpfV2l3VG1DQzZDeUdqSkFvMlVfOXgzcFRmNC1SbWZETkI3cVdCMnA3TkFnQ0J1dzNad3Jla2RyV1BiZTdOTTdCNlY1cXpITGhkcGFBUnNCWGFTX1R2c1U3c2lvZWh0aHNaVHFheldJNXE1Y3gxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "Carney faces calls to send fuel to Cuba as U.S. widens blockade - BNN Bloomberg",
    "description": "Carney faces calls to send fuel to Cuba as U.S. widens blockade  BNN BloombergView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 11:00:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNSzBsNnpJY1dhMmtCSGlrdURlZEhKMEJHSE9ldFpGcklpNXRZeTJnWVlRTFBxQzZsVjBUcTg4LVNCUkhwTHJSd1pUOGNLZUlyM0dpa1BmMll5SHpOd1h2eVpFdWZhTVNRNHI1VmFGSE5wZFlhY0thUEFubU1TenotWDZnY0tELVRTbXBRUnA0NG9hRW95c2EtdUZUZGE3blFHSi1uYTdSNXo2S0JyNHFRN3lrSzBsLU5JX2F3bG9RMlBBdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bnnbloomberg.ca",
      "title": "BNN Bloomberg"
    }
  },
  {
    "title": "Peru has lost another president. Here’s why, and what happens next - Global News",
    "description": "Peru has lost another president. Here’s why, and what happens next  Global NewsPeru’s congress elects country’s eighth president in a decade  Toronto StarPeru appoints Jose Maria Balcazar as president after Jose Jeri’s removal  Al JazeeraPeru’s leader José Jerí ousted over ‘Chifa-gate’ scandal, as presidential ‘curse’ strikes again  CNNPeru’s interim President José Jerí removed from office amid corruption investigation  The Globe and Mail",
    "published date": "Tue, 17 Feb 2026 22:43:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBUTlk5VzV4RnRvNXhuM0JLTWxMbnA3ZHZDNzZpV2hQbm1TVVF2MjNNbF9lal96YWQycGY3YWJkdE0yNVNoeTRkS19OdFNNWFNXSVVPczVtSnlqd3VZLU5uREg0OVA2WDVnZWFKcmlJUUpnVjdkMEZTWE11VHNmTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Japanese PM Takaichi's cabinet resigns - China Daily",
    "description": "Japanese PM Takaichi's cabinet resigns  China DailyOpinion: After a stunning election, Japan will be unleashed. Or is it already too late?  The Globe and MailTakaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development  Toronto StarBloomberg Daybreak Asia: Japan's Takaichi Formally Reappointed  Bloomberg.comMake Japan strong again: Sanae Takaichi’s plan to transform her country’s military  The Conversation",
    "published date": "Wed, 18 Feb 2026 00:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE51aVdhdzFnZzYzQkhqcnppV1BvSXJnSzJxTE1HOEY3SHlzZE55Y08yRVdDbjBWVm1yNmxabW9aV3g0b0ptMzdYZVFjdFFZZWdWSEVaLU1IcnpFR1VqZEF4ajRMRHVhVGhxUFZ4NVUzUXA3cGZrd0pjbnQwSzF2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chinadaily.com.cn",
      "title": "China Daily"
    }
  },
  {
    "title": "IDF says it dug up Canadian soldiers' graves to destroy Gaza tunnel - CBC",
    "description": "IDF says it dug up Canadian soldiers' graves to destroy Gaza tunnel  CBCA Canadian UN peacekeeper kneels at the grave of Canadian Gerald S. Porter in the Gaza War Cemetery in the 1960s. The children pictured are the great-uncle and aunt of the cemetery's current caretaker, Ibrahim Jaradah.  Yahoo News CanadaIsraeli military confirms it dug up Gaza cemetery where Canadians were buried  MSN",
    "published date": "Wed, 18 Feb 2026 18:00:42 GMT",
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBOVXBNaElhWXVKS0lONGJDOUlyMGdIWU8tMFBzZUNKbDZ1ZE55eXdMZzBFdTVNdF9wM3o4ZmpURFlEZFVPZzJpX3B2ZkY0YUZvNG5aYnMzRURvTFFReHBla0EtdnV2ck9NNm9teE12Wk4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Donald Trump’s envoys failed to reassure Europe - The Economist",
    "description": "Donald Trump’s envoys failed to reassure Europe  The EconomistMarco Rubio’s Impressive Speech  The AtlanticForget Maga. Welcome to Mega: Make Empire Great Again | Mehdi Hasan  The GuardianSecretary of State Marco Rubio at the Munich Security Conference  U.S. Department of State (.gov)Marco Rubio: America is not interested in polite managed decline of the West  National Post",
    "published date": "Tue, 17 Feb 2026 21:28:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNc3ZsNW56VWpUZzZjSnZxUmsyT3MwaEhKR2JSZnpHYnNPUzJwUjR4NEhKVHMzam16WmwySXo2U0IxODdYVS1Lc3haUVNOT0ZGSTMxdEhfVmVnczBZT0RYWjMwT0VFQkpwVmNOZXZyMkt5U1BMM0swamJVRjlzcy1FV0hPU2NwcnpDdVNIWW9SSHlTbFJZOVVVRGkteEI4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "In a Scorching Order, Federal Judge Rejects Trump’s Attempt to Trample the First Amendment and Rewrite America’s Antebellum Past - Ms. Magazine",
    "description": "In a Scorching Order, Federal Judge Rejects Trump’s Attempt to Trample the First Amendment and Rewrite America’s Antebellum Past  Ms. MagazineCiting Orwell’s ‘1984,’ judge orders Trump administration to return slavery exhibits removed from Philadelphia museum  CNNTrump administration appeals order to restore George Washington slavery exhibit in Philadelphia  CityNews HalifaxJudge cites Orwell in rejecting Trump’s bid to erase history of slavery in Philadelphia  MS NOWTrump Marks Black History Month With Slave Demand  The Daily Beast",
    "published date": "Tue, 17 Feb 2026 22:14:27 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPZ2tRNWVmZTRPcFBmeFJlUWVaUGc3bW9jMjVXa21wSjVJWlF1NWRqNDBQcUYzUl85X2xUWUxkRDlaMzFaY2pkMGRzVFlrVFl0alFMajl1VmtSVUppU1d0RWlMX1Z0TTEwZDdKXy03UjdURjhpbmVQakFQcTNHeVdTd2NMMG5hSldZX2s1RWxmV29wbmtlbC0wZUtad1didw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://msmagazine.com",
      "title": "Ms. Magazine"
    }
  },
  {
    "title": "Trump’s first Board of Peace meeting to draw more than 20 countries: White House - The Globe and Mail",
    "description": "Trump’s first Board of Peace meeting to draw more than 20 countries: White House  The Globe and MailTrump’s Board of Peace meets: Who’s in, who’s out, what’s on the agenda?  Al JazeeraTrump launches his ‘Board of Peace’ with billions pledged for Gaza, but many allies are wary  CNNOptics and fealty: Trump's Board of Peace wants proximity to Washington's power  Haaretz'A very MAGA agenda': Is Trump’s Board of Peace meant to replace the United Nations?  France 24",
    "published date": "Wed, 18 Feb 2026 20:28:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPN0EyS205TFNDWG1aclJtd29JRzMtaUpwYTZjVzJUV0xVRDd1VUhLZlB4d0V4RDl6bFFRTjA3d2VQTzF5ODN2Q083eC1RQmhHNzRLOEdtR3RqV195MmN3dkxaVFo4RjNQQ2k1a25oanpQNjA3NTlPcXlRV1NZcG9ndg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Trump family wants to own trademark if airports use president’s name - National - Global News",
    "description": "Trump family wants to own trademark if airports use president’s name - National  Global NewsTrump Organization trademark raises suspicions that family could profit from Florida airport name change  CNNDonald J. Trump International Airport? The President’s Company Trademarked It.  The New York TimesTrump Pre-Emptively Files Trademark For Airports Not Yet Named For Him  ForbesTrump trademarks his name ahead of Palm Beach airport renaming  USA Today",
    "published date": "Tue, 17 Feb 2026 18:15:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1WMmhjVU1XUFB1ek45TWE0M0pUckphMy1hU1RieGZTQV9BVkJIbzJmSnRiUHJ1UlRhbjNjcjJQcTljSmtUOHZDcEVNeFpJaEQtMFVReWl5aEt5V1JYWUUwVDVIYzRlTDl3RE9POTNUUmhFLTZWdHNJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "How a four-year onslaught has changed Ukraine - The Economist",
    "description": "How a four-year onslaught has changed Ukraine  The Economist‘It’s wearing on them’: Humanitarian team reflects on upcoming 4th anniversary of war in Ukraine  CTV NewsGlobal Rally for Ukraine in Vancouver  vancouverisawesome.comFour years into war, Winnipeg vigil aims to lift up Ukraine in prayer  CHVN RadioUkrainian victims honoured in Vernon as war continues 4 years later  Kelowna Capital News",
    "published date": "Wed, 18 Feb 2026 16:51:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQcnhMYnJMb05rRUJ0VG9EbU1ZUGptMnA5b0VuZmEwLVhPS280ZHVUNE1obXROV251MVkxVEQ2MnNrSm1CRTg2T0VrbGxnTTdZSWxCdllmUGluaWRMMEk3QkdyTF9wX1k5UHBwZDVLWDlqV3RDUGNpOVBuY0JPRHk2RUxqSnl4TklOZURPZjlUUWFwZFU?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections - CBC",
    "description": "U.S. environment agency sued over scrapping scientific rule behind climate protections  CBCAdvocacy groups sue Trump administration over endangerment finding’s repeal  Al JazeeraGlobe Climate: America vs. climate change  The Globe and MailOpinion | Why the EPA’s emissions reversal is the responsible decision  The Washington PostTrump has done more than harm the government’s ability to fight global heating | Jamil Smith  The Guardian",
    "published date": "Wed, 18 Feb 2026 17:42:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFB6YXBPbVdGMUZtTk90SGtkbHc0QmtRWHZ4LVFFM1dhWTZWbEwwenFWdVU4cDZUUENrOXlObGdVVXpVc0wweWgtMFFhZ09pVnVuVDZnYlNIcWxrUzVpTm9UYnhGd0FOa1J4Ync?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find - Gizmodo",
    "description": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find  GizmodoThe political effects of X’s feed algorithm  NatureX’s ‘For You’ Feed Could Be Making Users More Conservative, Study Suggests  Forbes",
    "published date": "Wed, 18 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNOV9JbTdROS1RWjR4Wm5ESkpIUGFXeDJOeU1yOTJMVEt1ZVRMRGNlLWlXNFlUeWJ0aG8tajdUS010QTg3WHlBeFFSdnNlaW1FZEZDNV9DSkFQRi1mQ1ZIRnVDakl5M3Roc1AySlJUVk5tWWg5ODR6dTF1VUhXLTdLTnlINTUzU3RrLTRwVVJ6cU5VNVRBVEs1dEEtaTh6R2V3MkQ2cG9iNlRwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "EU Quizzes Ukraine On Timeline For Repair Of Druzhba Oil Pipeline - Radio Free Europe/Radio Liberty",
    "description": "EU Quizzes Ukraine On Timeline For Repair Of Druzhba Oil Pipeline  Radio Free Europe/Radio LibertyHungary, Slovakia stop Ukraine's diesel supply with immediate effect  Euronews.comSlovakia Releases Emergency Crude Amid Standoff With Kyiv  Bloomberg.comEU Considers Emergency Steps to Restore Russian Oil Through Druzhba Pipeline  Crude Oil Prices Today | OilPrice.comHungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply  MSN",
    "published date": "Tue, 17 Feb 2026 13:45:11 GMT",
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPdTVNSkRxQ2JfV0VwNkc3MTJyVFdGZFMzWElyRmNnZC1fS1ZxRW14TEM4ZS1hdU9FUk5hdlkxNGlYdDROSnZsY056WmxHbWYxMjJ5OS1ZblcyM0lRcWR0M3VwNDA4Q1dhRE9zUXJxWTNmUDVyVU1kOGVscXI1MVUya1YtZDZlaW9uLU1PYlh4dDJqV1BNSV9aYmtn0gGcAUFVX3lxTE1rV19Gd0IyR3F1S1NVNGxhVGJlRjFTSlJSbUE3Y2FPR3djNWVCbWNETFpYdXFHMlZrRy12QkVjc3UxQmgzSVczRkVfbUlWNGdjMy16eGJyakg0WUFjTFZXMkUxNUdwdi1rQUh0UGdGYldQQkZqaTRKaU9jOGFwUmcwV3pCb1V2d21Cc05tNFBCT3UzVVJDQURUR3VWcA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.rferl.org",
      "title": "Radio Free Europe/Radio Liberty"
    }
  },
  {
    "title": "Russian cucumbers become symbol of rising wartime prices - The Globe and Mail",
    "description": "Russian cucumbers become symbol of rising wartime prices  The Globe and MailFood prices are surging in Russia. Is the war hitting Russians in the pocket?  BBCIn Russia, the humble cucumber becomes latest symbol of rising wartime prices  Reuters",
    "published date": "Tue, 17 Feb 2026 21:00:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPM2R2bHRBdHJBVFVoSEV6S19ESmxRZW1kX0xNS2VBeVdTWDlnZWtVWnRBOWI2YW5tRlZpUHpiZkYzSXV4TU55QUozVEtkLW9qNVVrVXdTUmdyVlJzSFFzT1puSzJsN25QS0pJSkRKMjNKbHdpa3lDc00tNlh4T21jdW5ndTBRZWN0cEE5UUhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Police arrest man with shotgun running towards US Capitol building - Al Jazeera",
    "description": "Police arrest man with shotgun running towards US Capitol building  Al JazeeraPolice arrest 18-year-old suspect for allegedly running at U.S. Capitol with shotgun  AxiosPolice arrest man who ran towards U.S. Capitol building holding a shotgun  CTV NewsMan in tactical vest with loaded shotgun arrested after charging US Capitol, police say  CNNPolice arrest man who ran toward the US Capitol building holding a shotgun  Toronto Star",
    "published date": "Wed, 18 Feb 2026 02:29:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPSlBpOXhXd2xqZzRydzJkUEc3dmpzcHNkejZBdmpXM3Z5aHJJRkJaNDVEOVRnM1RkVVJCNjBMcTg2NXhETmdwM1Vpbk5rdW50YWlZR0h4U2RpUjZ0eHNwLWJwWUZsS3hCQ0ZRVzVPZDdpX3hGSUx4d0tSLTAyUTNrZTBkTGVmYmNYRjRSNDZia18wUlQ1UTZ2VTFSaHJjMmFFdll1ZGd5SnludG1ROEIwSDBB0gG3AUFVX3lxTFAyYTlubjZUeHZCSl84SmJQcENjWURWZFVjNUJWTnBrYnFVU3d2OHNhcEhiVGZrMU9wQ293anpjclVnV2tYRldRRmFKUWRsQjFSOG5JZ195M0JTRjA4OVhmQUhETGQ5TTJKWk1hTTkxX2FLUDNFWHBrUzg2dzVySDVNbHR2OG1tekZGS1B2T3B1YU9MYVdFSi0yeTJOSWlmazJmTG1MRzZ4UU5NdThNNUFJNGRlQTdERQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "White House: Many arguments for a strike on Iran, they’d be wise to make a deal - The Times of Israel",
    "description": "White House: Many arguments for a strike on Iran, they’d be wise to make a deal  The Times of IsraelTrump has discussed timeline for Iran strikes — including as soon as this weekend — but no decision yet  CBS NewsUS renews threat of military action as Iran, Russia announce naval drills  Al JazeeraTrump meets with top Iran advisers as war threat grows  AxiosWhite House says Trump wants diplomacy with Iran as US reportedly could be ready for military attack – as it happened  The Guardian",
    "published date": "Wed, 18 Feb 2026 22:54:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQWWtBRWNscEJTUnZPaDJrSk9oQ2NUcUpPN1FxdzR5TXVzb05zblRpd0c0QkhNQnJUZmZadGxSdW8zaWt1VzN4SjFhS1RrRFNYNUQ1bHBXZW5VTG5XcUhoMlVoWkF5ME1lSWVKRHZOVjA0NmE0b3lncjYtbHlTMl9XU3FIX2lTZXg2QWlQR3o1UVR5UHF1YkZteWU1V28tcVhGSFdTNGQ1WWp2UFHSAbABQVVfeXFMTnhoLWhvWHhxc1I4UzZjWHl4b0gyNVU5dXhRRDlORnFtYXJXZmV1VE5uS0lrclhsOWt2eExZTkYzZm9uajRvVWV1T09KendYMUpZWGRkVjB2VXUyOXh4X1hXUGxxdUZHbUpfbWdIZHdsMkIwaTdvNWxkNHJNTWFBYlFsTHJNc01hQ0ZWeGplYWp6VEs3Uko5dTFENDdvQWl2ZjVoY0FCLWZHYlhzZUFDaVE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.timesofisrael.com",
      "title": "The Times of Israel"
    }
  },
  {
    "title": "New alcohol curfew will affect Canadians visiting popular European city - Daily Hive Vancouver",
    "description": "New alcohol curfew will affect Canadians visiting popular European city  Daily Hive VancouverThis popular European destination is putting a curfew on alcohol sales  USA TodayPopular tourist destination adds new ban on Americans  thestreet.comCanadian tourists warned of surprising new rule in popular European city  blogTO",
    "published date": "Wed, 18 Feb 2026 18:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE5LbklibFFMT1M0SEJKTUF0b0VOWlR0YmNLU25kWUZmRVlMVlU0ZzZZSGJXWjNidkJ0RGwtWG9ENHlZRmF3cnhjazNLUm1OWnE2SzJoUGlvdWt0WGMwVjRfbHotVTZjUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "12 killed in China’s second deadly Lunar New Year firework explosion - South China Morning Post",
    "description": "12 killed in China’s second deadly Lunar New Year firework explosion  South China Morning PostChina fireworks shop explosion kills 12 people, the 2nd such blast in days | CBC News  CBCA fireworks ship explosion in China kills 12 people in the second such blast in days  CityNews HalifaxFireworks shop explosion kills 12 people amid Lunar New Year celebrations  Yahoo News CanadaA fireworks store explosion in China kills 8 ahead of Lunar New Year  Winnipeg Free Press",
    "published date": "Wed, 18 Feb 2026 12:15:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPTGJuV0JfYUZwLVhJRmJkZk1OeVNWTzVfTl9fSklMTkJ4cmJZMk8wdXpOa2dvdnpObWt3V2hjd01FaTZYak5fcFhIV0N2LWR0VUdueFI1M2N0d0hULWE2OERhNkFIZ24xUjBKMHpLYm5rSXFUUU9CdzY5dHlPQThsQnc2UDMyTzlpSTRDTjRaSHdlQldZYnB3Wm53eld1R01NZlZCRklrREhrUWtsWERXWXktVm5FaGxsNjVBcDNR0gG-AUFVX3lxTE5XLTJwQlM1S000bnE3ckE0bWhsMWJtY3JGZVplV2pDaHp3UzVxLVZnOTdYLXdFcUR5aTQxOWRFdGg4V19JUUxzazIyQ0tXOW5CbDlWZzlxcGI0azhuY0FTdVR1TTRhSkVEQ2N1YktGMWFkYXpTdXdueWlacjBYUGVkZnc5ZHVsb3R1ZVpkZ1YxRmNXMDRnRnBnLWJqUlhYS2pwbkFvUXZoM0tXblZUSWdPTzdVRnFLemZscmxSeUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "French activist's killing leads to political furor, 11 arrests and a bomb threat - CBC",
    "description": "French activist's killing leads to political furor, 11 arrests and a bomb threat  CBCWave of arrests over killing of French nationalist piles pressure on far left  BBCParliamentary aide among 11 arrested over killing of French far-right activist  The GuardianPolice arrest 11 in the beating death of a far-right student in France  Toronto StarAfter Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left  The New York Times",
    "published date": "Wed, 18 Feb 2026 17:12:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB4dG9vdk5EZmxNWHJXQl85VUhjdGphbmFqOXBzN3llc1g1NzFqdG1uYm5HakFqRzc1djhmOFY1cW5pYW5tYVhQTVVxSzNFWGhscnIxSTF1UWFWTXlhMXJkWUlDZTdaLUpUY2x0SGhtTGpma0dYVXhXSi1ZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "‘Jordan is next’: West Bank annexation signals ‘silent transfer’ - Al Jazeera",
    "description": "‘Jordan is next’: West Bank annexation signals ‘silent transfer’  Al JazeeraAs Israel takes steps to claim land in West Bank, U.S. stands by  The Washington PostIndia signs UN statement on West Bank  Times of IndiaIsrael conducting ‘gradual de facto annexation’ of West Bank — UN official  The Times of IsraelIsrael advances registration of West Bank territory as state land in move decried as “de facto annexation”  CNN",
    "published date": "Tue, 17 Feb 2026 11:08:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOTmN3SjNRLTd4V3ptREF6SXRvU1ZHR1JKWW5FcEJxNWF1NXJNMUF6RW9ucDA4bERWUUM0R2dObDJpWFhBTUdrMGNfOHJkSEdKdTdyWU9LRnBGTUtfcF9PdTRQaV9fRjVkY085OERXQlZuOUtQRW90XzNXYnlicHI4N2tPbkxXYjhwOGhES1owSXh5ZExrU19oNjVPWdIBoAFBVV95cUxPYzJwaVpXTGlBRFh3U25zUkdjeWxIUm9EZGVpMWZjN0dFRllpeXp3dktHOEY5M0k4M3JacldWbHg2bVlLWnF2djlma2JQa0JmU2VNa1hlSkhxdHB6aWE5NmRDeXN0Zmc2NUJqN0dCenI5SHBHSi1VV0YwaDJyVXBnUVdnYVI4cmh3ZTlPN2tCOU5MWlVxbFJxNHh2ZHJRLVY2?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.aljazeera.com",
      "title": "Al Jazeera"
    }
  },
  {
    "title": "Eleven killed in multiple strikes on alleged drug boats, US military says - BBC",
    "description": "Eleven killed in multiple strikes on alleged drug boats, US military says  BBCFishermen in the eastern Caribbean fear for their lives following a deadly US strike  Toronto StarU.S. military strikes three more alleged drug boats, killing 11 people  The Globe and MailU.S. Kills 11 in Boat Strikes in Pacific and Caribbean - The New York Times  The New York TimesUS military says it killed 11 people in strikes on three alleged drug boats  CNN",
    "published date": "Tue, 17 Feb 2026 17:33:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE40V3dzRmU2UjRXa1dRNzlXQS1uamJ1eFRneHY3UFpOLVg2cU9QLTNpSXNHM0VON1RBa2lncUQySEhVZEM3ODJhLUNUR2lpUXdReXRiOUdRYWE0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "U.S., Iran to hold more nuclear talks as Tehran closes Strait of Hormuz - Global News",
    "description": "U.S., Iran to hold more nuclear talks as Tehran closes Strait of Hormuz  Global NewsView Full Coverage on Google News",
    "published date": "Tue, 17 Feb 2026 14:22:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNemRQSU1YbkdyN1ppTGlGVTJ5VTB1ZEtJVm5UazBFck1WTUtIcFlWaFhsY2c5ZXBGTmdhRmJ2TmJ5Rzh5QmVpbm8wcTR4ZnRNdjVRUEREOGhMWHNrTFgzcTJCQ3Bsc0VCRnA0UUFocjdRaDZUMGVFUTBCU2pSQjdnUg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Thanks to Trump’s threats, tourism in Greenland is booming - The Globe and Mail",
    "description": "Thanks to Trump’s threats, tourism in Greenland is booming  The Globe and MailHow to get what Greenland has, with permission : Planet Money  NPRMorning Update: Trump gives Greenland a tourism boost  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcWItRDl1a0QyWE1fa09YZ0lPRmtxT00xVW1PVkdaQXo3X2hHZGNWUXlORU5PS09rYXRkWWpGYVN1Q1QzaWFSTWhqZHZta0VoSGI3X1ZhalFfYWlVR0JIWEJ3TTVZODNfdGhBdlRtMjNRYTRuTWFwcEZ6OXEyUmZSaEVYNjlUakJDMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam - CNN",
    "description": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam  CNNDOJ accused of flouting law in Epstein name dump  The HillFallout from Epstein files in Europe affects royalty, politicians and diplomats  The Globe and MailThe Epstein files have brought a wave of resignations and investigations  The Washington PostOpinion | Ro Khanna Is Shaken by What He’s Learned From the Epstein Files - The New York Times  The New York Times",
    "published date": "Wed, 18 Feb 2026 11:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9vZC10WFVhcGhfOTIwb0NmS0w1WHJoOUlYdE8tb2gzRkFLUk90Z3R4MUpsU29WUzgzRnh2NEwzU0dfMFNFdFFNYzg0eFdRSVJVYmJNNGNHMlZDdjgtWTBvYW90ajhHR0pEcEFPUGpLTXF3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Canada's Shadow Refugee Claim System: How Tens of Thousands Are Approved Without a Single Question - The Bureau | Sam Cooper",
    "description": "Canada's Shadow Refugee Claim System: How Tens of Thousands Are Approved Without a Single Question  The Bureau | Sam Cooper",
    "published date": "Tue, 17 Feb 2026 16:56:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9mbGlsUjVUOVlVMjAxWGhPeEE5MEE4U3laRGNwQnFVRFg0eEJYUXhycWMwWFNLNnF1cGlMRzE3QW8xd0JpTW53UmRvVUluX3pRS1VSWm5WRFJaU0M2RHBDWjctZzl3Q180N0JqbXdQMEZQZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.thebureau.news",
      "title": "The Bureau | Sam Cooper"
    }
  },
  {
    "title": "'Absolute havoc' on coast path as storms take toll - BBC",
    "description": "'Absolute havoc' on coast path as storms take toll  BBC",
    "published date": "Wed, 18 Feb 2026 14:54:55 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9HSjNxNVRnc2xmWlo3eUt0YTdJOTQxRlFDMUQ0Uzg0SFE4R0FJY1Qxa3BVcW5CLUtlM2ZHY3lJSk1NbzcxZkJrWDZ2SVBlT2plc2NIeHRXS2VWdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Canada issues urgent travel advisory update for the Philippines - Daily Hive Vancouver",
    "description": "Canada issues urgent travel advisory update for the Philippines  Daily Hive Vancouver",
    "published date": "Tue, 17 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQV2ZEaVhRSnduQVAwWWg1SDNiQ21XOEVOdExTcThxQmQyUDhpUk5ncVBNS1pGczR2YURSZFZ4UU54UVpsMy1qVG1DM2hTVzhibGxEbFFXd3lIX3VMSEVuYk84ZDA5eEs1VTAyWVcxRmI1TlFINXFaOXJRLWU2dFdyWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "Lawrence O'Donnell Rips Trump With Clips Of 1 Leader 'Who Can Speak And Think And Feel' - HuffPost",
    "description": "Lawrence O'Donnell Rips Trump With Clips Of 1 Leader 'Who Can Speak And Think And Feel'  HuffPost",
    "published date": "Tue, 17 Feb 2026 17:34:44 GMT",
    "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNZHcwOGpTUGlEbUQ0SUhxNkZxczgxczM1enJNNXlJM01IUWZVQnFITTVhQTdBcmdacm4tYXptYzRLTDJMSkt6WGY2YThqanVvT0NBOGtLdXlSTTF0MHV6NmJFd3p6bFpZaUpZY3MzZzJPbkxuVHl3M2d2cmx4aHRFZkhEVzdZMTlxRWVLVHg5M29HTXpadWFoYVViNGpsWG1vZVViZFhnUmlQX21WOFZ0ZmlyZUFXTXVTQnpkQdIBwgFBVV95cUxNQTdhVjcyVDQ1b1llWEpXYV9zdGFVZEVEaVVTOHdXOTZXSkZPZjVkNkg1c0ktTHl5Q3d0eExyOE1yczBiTVo4eks0bDlkcF9qTjczc2pmTzNUUzBQX1Rma0d3YzJyMjh5bXJXWHZMU2M0NFZmcGw0YnZqeHpfM0VwODRFOE16OExCYmlJYXFVY0JRRVo2bW5faHFsVnpTZE8tTUtzZXFDb3l0aUZsSklyZ0dvQ3ZBZmFUZElaanZDUDBVUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.huffpost.com",
      "title": "HuffPost"
    }
  },
  {
    "title": "South Korea says Kim Jong Un’s daughter has entered a ‘successor’ stage. The reality is murkier - The Observer",
    "description": "South Korea says Kim Jong Un’s daughter has entered a ‘successor’ stage. The reality is murkier  The ObserverCould this teenage girl be North Korea’s next leader?  CNNKim’s Young Daughter Looks More Likely to Be North Korea’s Next Leader  The Wall Street JournalSpy agency says Kim Jong Un’s daughter is close to being designated North Korea’s future leader  CTV NewsKim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says  BBC",
    "published date": "Tue, 17 Feb 2026 07:01:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNRzdiMWtHRVBwMDJaY28wbUw3U1M5blJXbHI0WjNPelJTUXNGYnVvcTNsUXRuU0ROQlRDUzNFZ3ZuYlIwcjJoaERkZG5iNWZGX0lraXJaSnNkaEpCeVVfZU1DUVI3LTdYY2stX0hnaDVWM2I0eXlBUnZpclJaeFJHQXlBSDhGU0FUbWllOGktRmJZN19XWjFocG5fWDdCM3V2OThfRmw0dE5EMG9saUtvYTNweFRTcUM3anRuVVZ3aEx3bEZ0WWNpSXpob0dvU1VxUDMwdzc3SG5GUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://observer.co.uk",
      "title": "The Observer"
    }
  },
  {
    "title": "Merz warns US on tariffs, hails ‘future cooperation’ with China - politico.eu",
    "description": "Merz warns US on tariffs, hails ‘future cooperation’ with China  politico.euChina shock: Will Merz take on Germany's top rival?  DW.comMerz to seek strategic partnerships with China amid US tariff push  Investing.com Canada",
    "published date": "Wed, 18 Feb 2026 23:44:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNLUFlVHJqNldQTVd1eXMzOGhBMnVaWUpYajJrTnd5aGNIYXhTVzBqRThJcDJsVXRVV0lPSnNYNzg4SXBqUWFlbXVhWU5PM2xkZTg5eFpPUVJ4VWZnYXk2QXRsakpMc1FLc3NEQjk4VVdoejlFTmlmc0RTYktnblJuRnBTd18xTV9HR3hTUU9wRXBIeHpXbnNCa1QwZFhfX3UwZzRtRHJPRXVuU2pJbWxreko1alRFR1U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Five young people die in Spain apartment block fire - BBC",
    "description": "Five young people die in Spain apartment block fire  BBCFire in a storage room in northeastern Spain kills five children  CP24Spain: Five young people killed in Catalonia building fire  DW.com",
    "published date": "Tue, 17 Feb 2026 10:06:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE41LTZlN3BVNk5Qa29CMDRpSFV6UXZfbmk0OFpZQVJJajg2QzZFR014X25SQjNMLTBPQkxhNTRNWjdkTXA5OHRyT1RNM1FhMzlnTmQzNnAxOWYtdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Inocea Group to Acquire UK's Wave-class Fast Naval Replenishment Fleet to Return Proven NATO Capability to Active Service - navalnews.com",
    "description": "Inocea Group to Acquire UK's Wave-class Fast Naval Replenishment Fleet to Return Proven NATO Capability to Active Service  navalnews.com",
    "published date": "Wed, 18 Feb 2026 18:52:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPNWxJNFl3QWw1UHo4ZlVHMHlQRWRZWWZvRXdJRjlXNkhyVzVWc1F6UjcxTjhrdjhNN2dNcFBhdDViSV9RQ1dqaWdBMDJiTTFKODMtQUNYdDRpZ21ILTg4N2VRVHA5Rkt4cW1seFRYaENlc0lIQm8xcFpQMUhWQXhLRnhpNGR3ZzZsX0R1dDRNVmZqZ0JYd2plV3U4SW9ELUVRNHRaYzlZZ25yMW5tcG0tVFdzSW5PVmhrZmFibTBRcE1NTGZMY09aTFdYNXlGRW4tbm5abEd0VXFoWElGQ2NvNjBZVUNHcE95YndRNWVVWFBwV0ptaDZNSlZB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.navalnews.com",
      "title": "navalnews.com"
    }
  },
  {
    "title": "Ukraine war latest: Drones strike oil, chemical plants in Russia as fresh peace talks begin in Geneva - The Kyiv Independent",
    "description": "Ukraine war latest: Drones strike oil, chemical plants in Russia as fresh peace talks begin in Geneva  The Kyiv IndependentUkrainian drone damages Russian Black Sea port ahead of U.S.-brokered peace talks  CBCUkraine war latest: US responds to Navalny poison claim - as Slovakia accuses Ukraine of blackmail  Sky NewsEuropean Coal Futures Extend Gain After Strike on Russian Port  Bloomberg.comUkraine Reports Long-Range Drones Reached Perm Region, Hitting Key Chemical Production Site  UNITED24 Media",
    "published date": "Tue, 17 Feb 2026 19:13:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOTVVaVzRRWmVoaWQ1Tkw5UHZHN1Y5TXdGcENFRXc2X1k1N3pjVzVVcWNVMTVraXJlZm8wWDJGMWhYajFfX1NkcDJ1b1RoWG5WRmpndEs3OUYydzBUS1FHVGZKZXkzRjNSQTdSczVGOWc5QkdkUkdRd29XVzRzc0lJWnNRdXZ0ZzhvcnZnOVJucmhzZUpiUjc5TEhubjE2SzNCUW1MY3FJd2Z5blg1QkNQenlLT09yeU81TVBrXy1PTVcwM1diRnM0?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Beyond Zionism: After Gaza, the American Jewish Left Rethinks Jewish Identity - Haaretz",
    "description": "Beyond Zionism: After Gaza, the American Jewish Left Rethinks Jewish Identity  HaaretzHow pandering to anti-Zionist Jews harms US Jewry  The Jerusalem Post",
    "published date": "Tue, 17 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNNGxBN0I4Q1R6RVVWMFl5YzZROHVaeDhEZmZkSkF3R0E3Nkw4amh2WXBRSTl0VXV4bHFfRXNlUEFVOU9zOW1YSUZkSUkwSC1XQTBjc3FJWE5YSkVTYkFJSXdPU0tsWG5iQ3hiSGZaZHZMRy1VOFpjeGFfcHNqVnd1MGMzWFkxOXpuQktQaUlUWWVrWVU4VjdzMHdFck5LcmZqVGNlNWFla0RsSjNTc1B1Y1JDQ0RBR0xSMjJ4Zi0zODNiVF8wSTU2cER1cGZqNDVrb3BnMTJxNnVsZk5rRGMwd0RTZzQxV3pwY2Y1azFleEhyZmhNVTNrRmlUTHRUSE40SHZRWm1hV1R2S3FYejdmYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.haaretz.com",
      "title": "Haaretz"
    }
  },
  {
    "title": "MPs may investigate Andrew over trade envoy claims - BBC",
    "description": "MPs may investigate Andrew over trade envoy claims  BBCPolice assessing Stansted Airport private flights over Epstein ties  BBCU.K. police band together to assess Epstein revelations as scandal rocks royals and politics  CP24UK examining Epstein's use of airport for trafficking  Yahoo News CanadaUK police assess claims Epstein trafficked women on flights through London Stansted Airport  CNN",
    "published date": "Tue, 17 Feb 2026 11:43:50 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5FTF8td25OaU5VTnRxYkd1YVNaMHVPekM2UDVGZGJiV0FoeXBpMFRybG55Qkt6NC1lWE5mbkl2X19wLTJZRXVjQWpyM3pWUVVRNDdxeF9ySlQ4QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]