[
  {
    "title": "Former Prince Andrew Arrested by UK Police in Misconduct Probe - VOCM",
    "description": "Former Prince Andrew Arrested by UK Police in Misconduct Probe  VOCMFormer prince Andrew Mountbatten-Windsor arrested by U.K. police  CBCThe former Prince Andrew went from helicopter pilot to trade envoy to royal pariah  CTV NewsAndrew arrested on suspicion of misconduct in public office as King says 'law must take its course'  BBCKing Charles III says the law must take its course in the investigation of his brother, Andrew  Toronto Star",
    "published date": "Thu, 19 Feb 2026 11:06:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTFBqWEZwNnIwY2xLQXdzZlNGcUJVLUNqQTF5YVVKVU9nZkctZXcxR29TY211c2R3Wjkwc0tTZ1Q4ZXgzSGZVVmkyT3ljcw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://vocm.com",
      "title": "VOCM"
    }
  },
  {
    "title": "With no initial DNA match, Guthrie investigators turn to one of their newest tools to crack cases: genetic genealogy - CNN",
    "description": "With no initial DNA match, Guthrie investigators turn to one of their newest tools to crack cases: genetic genealogy  CNNNo DNA matches on glove found in Nancy Guthrie case, police say  BBCGenealogical sites have helped solve major crimes. Police in Nancy Guthrie’s case might turn to them  CTV NewsNo match in database for DNA evidence on gloves found 2 miles from home  NBC NewsNancy Guthrie disappearance: Sheriff pleads with suspect to ‘just let her go,’ insists case not cold  Fox News",
    "published date": "Thu, 19 Feb 2026 09:00:35 GMT",
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE96RUZWaVNoTUJRUzJmaDVReGNYbUtvOHJoVFF4OW1nYjV2dy0tWUFmeG9RNnRheVhfckRVSDZ6dnN6TUJXbjlBc3UwbXZxLTdFbjN4YkZSenlwellJZVZiVHhSVmdOVmtoUWRkNk9OVzVteGVuaEt5UA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "South Korea's ex-president Yoon receives life sentence for imposing martial law - CBC",
    "description": "South Korea's ex-president Yoon receives life sentence for imposing martial law  CBCYoon Suk Yeol: South Korea's ex-president jailed for life over martial law attempt  BBCDueling Protests at South Korean Ex-Leader’s Sentencing Highlight Political Rift  The New York TimesVideo: Yoon's lawyers slam Seoul court after life sentence verdict  The Globe and MailUpdates: South Korea convicts ex-President Yoon Suk-yeol for insurrection  Al Jazeera",
    "published date": "Thu, 19 Feb 2026 09:48:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9QZzhxU25sb0JINC02cTlvWEJCRzRmWjJuMkNwSlZ3NTlhVzdGX1ZSODdyTXFGR29QcXVjUVN4YW9ZdmZiWjM0MU1FNzNtUUFfZmdyeTBmbm9pVXp5WHhxQUt4VkpZRDVGQk02b2d1WnFxdzM3d3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say - CTV News",
    "description": "U.S. military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CTV NewsUS military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say  CNNIran and U.S. wage gunboat diplomacy as Tehran holds drills with Russia  The Globe and MailTrump moves closer to a major war with Iran  AxiosCarrier USS Gerald R. Ford Sailing in the Atlantic, Headed for Strait of Gibraltar  USNI News",
    "published date": "Thu, 19 Feb 2026 01:29:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNWW1sV3QzUzhGRGs0SlZOcmJEVzlyMndqQ05xTmJNWDRIdU00amNKcWUwbjUwVUhnNENRZ1dzQjdaZEhhSzc0YURLQ3IxaEpOUnprVDlBX1FBLVJlMllCR0lkYXEtS044T2JJY195T1JteHZTYXNOVHE0WGREOUMxTUZxajVobVFERXBzNDhFYjMwZHg4bXI2dFNlT3pBUXlGM1U4NDNEcUcwVEpnNnJhUDdJZ1NWOTNfYjVIQ1NRZ01UWkxjYllyMEs1amZEOFB4TVRiMkVpeTdSSEVJN09OZElnWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "8 skiers found dead, 1 still missing after California avalanche - Global News",
    "description": "8 skiers found dead, 1 still missing after California avalanche  Global NewsHow rescuers raced against time to reach skiers trapped in avalanche  BBCMoms on Ski Trip Among 8 Dead in Tahoe Avalanche: Report  People.comThe backcountry ski trip hit by avalanche was led by an outfit offering mountain adventures globally  Yahoo! Finance CanadaWhy did they go? Avalanche warnings couldn't stop deadly mountain disaster  USA Today",
    "published date": "Wed, 18 Feb 2026 20:01:05 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQWTE5WHpMbG43ZnJmZG4tOVQ2TGlzUEZfQmhHeTRBMW5JeTJSOVJBNXFDLTdZUk1Rb1UwNFR0VlBiZ3VsODNrN05YRjIzcXZyMGdoNkVHaTJHVlluNGg0bkxzRkRFLVJBLTA1WXBleFVBbGpxcDIwemRaRXdvSHZFWQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader - Times of India",
    "description": "Trump makes shocking claims about Jesse Jackson and Obama in tribute to late civil rights leader  Times of India'I carry his legacy': Black Windsorites remember Jesse Jackson | CBC News  CBCA look back at Jesse Jackson's visits to Columbus  AxiosSports helped shape Jesse Jackson's career and inspired the ex-quarterback to fight for equal rights  CityNews HalifaxChildren of the late Rev. Jesse Jackson honor his legacy as memorial services set for next week  Toronto Star",
    "published date": "Tue, 17 Feb 2026 23:41:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPUFF1QmE1cUMtU2hVVVJLVWNvdjdPV0stZXFldzBWakY1bVAwVUZLM0J5anV3S3VjNEowOVlCMklPZFJQWnBlTFlrN243S1FIcnZhWUFFUmp6ZzhMcngwd05uU3MyOGNlRlBRTnlsdVNUdnBVdzVmRFZuV1JOVENTS005bzZIWVo1X1k2d3pjVXFKNUdmdmp2VWNQcDFJM29CU01qbTJPSWxuOE5GSUFqb1N4V0VCTWZ3N0hpTWdndDZEYXVLMWI1bE4yTDVHM0tSV3o1Q0xpWHdTQTRsb0FyYlRVbXE4QVRudUNjTTF3ZWZ2NU9mM1BiamsxTdIBgAJBVV95cUxPaXRXbjVyOU14VFR3YWJYeW5WRDJvSHBaNjFVRFUtN3kzVUgtcEFheVExRlZYaUN2SlRQZzBpTGtjUWNOeGRkbndsd2t5dVNYY3VfZTcyYjlFT05naHZiLXAzVEtnM09iRmI0bnYyZ1ltTTlFejNsdU1MRVBES1dIU0g2ZmY0QktmOHNWNkJXRVk3bFIxV2wxNlpKMEhtZWMtTDZ6elRTczkwMFVINkRETXZXOVVDcm1nTi00ZXEzbmRHckVOcHNFNU9lZUVHQklacHF1dlQwWTNiRWM1Y2xuclk0TmxpUFVQc3JxSU1YWlFldzhLcTVZNmJkRC04NDNK?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://timesofindia.indiatimes.com",
      "title": "Times of India"
    }
  },
  {
    "title": "Ukraine peace talks cut short in Geneva as ‘dissatisfied’ Zelensky accuses Russia of stalling - The Globe and Mail",
    "description": "Ukraine peace talks cut short in Geneva as ‘dissatisfied’ Zelensky accuses Russia of stalling  The Globe and MailDonald Tusk tells Polish citizens to immediately leave Iran amid ‘very real’ prospect of war - Europe live  The GuardianVideo: Zelensky ends 'difficult' Ukraine peace talks, accuses Russia of stalling  The Globe and Mail'Difficult' peace talks spotlight Putin's chief negotiator and Ukraine antagonist  NBC News'Difficult' Russia-Ukraine peace talks end without breakthrough  BBC",
    "published date": "Wed, 18 Feb 2026 11:44:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPYVJ0ckU4cHdnMGVDQi1CSnhFbmlIdzF2eS1mUU1UampuRkJ5TGtFenpRZXNzeHhXaEtUbExlajNnNHc3b0hEN2ZYeDZGeVJuSFJOWi13LVBXd3BjOVVUd1JHMHpCZjdoMkF4UDl3ZGtmelNOSWtMdlhGM0VoS29vczU1dHR5TjdRTkItc1RJbjVaeW9CRmRxblc0bzVzRDhIQ1VkMTVOd2ZaTC1UTVczNVdkdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "Canada faces challenge as it navigates growing calls to help Cuba amid U.S. aggression - CBC",
    "description": "Canada faces challenge as it navigates growing calls to help Cuba amid U.S. aggression  CBCCarney facing calls to send humanitarian aid to Cuba  National PostAid the Cuban people, not their oppressors  The Globe and MailCarney faces calls to send fuel to Cuba as U.S. widens blockade  CTV NewsSun, sand and empty beaches: Trump oil squeeze chokes Cuba’s tourism  BNN Bloomberg",
    "published date": "Thu, 19 Feb 2026 09:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPby1pX2FZbVNlVHo5cERTSWdoZUVIUndZY0RHYkdWWkZOUG43VDZxQTdwWmxLX0VTRkRKTEFralJXU3Zya0MtYmsyUHZfXzBHNmszZ3Rzazl3WmhjR01NdTRoRTNjcTJQSi1fckdaRm1NTEdqeHlSN0Y2X09RQWFQOTNETWVqdVVycmg2MUU0Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Over 20 countries will attend Trump's Board of Peace meeting on Thursday, White House says - Reuters",
    "description": "Over 20 countries will attend Trump's Board of Peace meeting on Thursday, White House says  ReutersMajor European allies decline to join first meeting of Trump’s Board of Peace  The GuardianLive updates: Trump's Board of Peace to meet on Gaza  NBC NewsTrump launches his ‘Board of Peace’ with billions pledged for Gaza, but many allies are wary  CNNTrump’s first Board of Peace meeting to draw more than 20 countries: White House  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 18:39:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOSDFZeEF6V3hpaFJ4NWU2azgyWnZ5elExOGtyWUZGclY5YldTTEtEazdUdkFQd29oam1MNjdaUmRvbkV4b2luMTcyTnE2Q3V6ZF9iTEE3cWcyeXM1NFMtaDZtd0dndHFKOWZnWHczalpBM213MFczWWJNakF5MVBTTXVfWm9RRnJ0UGRfS3J6MElKZUlWb2pXNFdTTHhRYUdSbElBdzdXVF95dU1sWS1R?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "US envoys juggle two crisis talks, raising questions about prospects for success - Reuters",
    "description": "US envoys juggle two crisis talks, raising questions about prospects for success  ReutersVideo: Progress made in nuclear talks with U.S., Iran's foreign minister says  The Globe and MailIran expected to make written proposal for resolving standoff with US, senior US official says  ReutersIran’s supreme leader threatens to sink US warships as nuclear talks continue  The HillHeadlines for February 18, 2026  Democracy Now!",
    "published date": "Tue, 17 Feb 2026 21:30:18 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQT3VkZWJxY3VkcEJSVkpyWEkzdWpmaVdOb1Z4d0p3ZE43amYwUmx6dmItWE1SbHREUURTOTM5b0JvWk81d2ZmektvTGpXeWhlZDkyY2hyZEltRWNPMFdNS0F4TG5reFh2UHZyMlhwWHZicXd1Wm0tN0wxNXdTb1l2MUVrWF9PWlhWMF9TQWNodXVPMGNVOW0tdU9iMEw3aS1kS2p5NXV0eUFKZDRMcjVpTEh0bEdwZHVhQXI0MUtzTUdqdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Peru has lost another president. Here’s why, and what happens next - Global News",
    "description": "Peru has lost another president. Here’s why, and what happens next  Global NewsJosé María Balcázar becomes Peru’s eighth president in a decade  Toronto StarPeru names new interim president after removal of José Jerí  BBCLawmakers will elect Peru’s next president after the latest ouster  CityNews HalifaxPeru appoints Jose Maria Balcazar as president, ninth leader in a decade  Al Jazeera",
    "published date": "Tue, 17 Feb 2026 22:43:40 GMT",
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBUTlk5VzV4RnRvNXhuM0JLTWxMbnA3ZHZDNzZpV2hQbm1TVVF2MjNNbF9lal96YWQycGY3YWJkdE0yNVNoeTRkS19OdFNNWFNXSVVPczVtSnlqd3VZLU5uREg0OVA2WDVnZWFKcmlJUUpnVjdkMEZTWE11VHNmTGM?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "China’s humanoids are dazzling the world. Who will buy them? - The Economist",
    "description": "China’s humanoids are dazzling the world. Who will buy them?  The EconomistChina’s dancing robots: how worried should we be?  The GuardianAnalysis: China’s biggest TV event had a clear star: the robot  CNNChinese kung-fu robots steal the show in world's most-watched TV program  Le Monde.frChinese Kung-Fu Robots Put Western Efforts to Shame  Gizmodo",
    "published date": "Wed, 18 Feb 2026 18:55:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQWGRaV1ZXdXZwM3UzQlV1bXZDYUp6UVY4cmhqXzQ5LVQtOWpBa25Td3Q4UnFGd1dBSkVnRkt3MkU0bTdDUDUyLWVGRm5ja2ZaSkZ0SEczSHM0cmJRTDhQWGQ4OFBYT0NETVZZRXZQOG1VVHpFVkJwWi1tSGNNOWd3LTR0d0JvRjRtUE1MRTdNR1dMQktWVmUwdGc3ZzJNcmExZGpWQWt3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Late-night host Stephen Colbert isn’t backing down from public dispute with CBS bosses - CTV News",
    "description": "Late-night host Stephen Colbert isn’t backing down from public dispute with CBS bosses  CTV NewsWhat's the equal time rule at the heart of the Colbert-CBS dispute?  CBCStephen Colbert hits back at CBS bosses in dispute over unaired interview  Global NewsFCC reject claims of censorship, announces probe into US show The View  Al JazeeraFCC chair Brendan Carr says media were ‘lied to’ over Stephen Colbert controversy  The Guardian",
    "published date": "Wed, 18 Feb 2026 13:03:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQNGR3YUNTY2VKaHI2OXFuNlRDQnFtaDU4UG9kNU9VWm5ISnNsTG8tY0piRzhrSXV1YXRfRGk1a18yTzlUY3VYZ3VJMnB5ZEFmbWFPWjQ0b0otQ01FVnNnT1JWRENaRUt6U3hXV3NCZ3UtejJ2eGdkSk1lcWNCaGE0dXk1RmtTZ1FSQ3R0Q1FmbERzenRERkVXZkkzR09Rb3N0SDRDVXFkQUpRN3dfZ2p5ck9VQjBKS2F3TmpfN3JHbnp3TmZCYVlKd2NzQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.ctvnews.ca",
      "title": "CTV News"
    }
  },
  {
    "title": "Iran security official appears to fire on crowd at cemetery - BBC",
    "description": "Iran security official appears to fire on crowd at cemetery  BBCIranian families mark protest killings as schools observe strikes  Al JazeeraIranians Mourn Slain Protesters With ‘Revolutionary Rage’  The New York TimesPopular anger burns in Iran after crackdown, as Trump turns up pressure  The Washington PostIran's 40-Day Mourning Ceremonies Spark Renewed Protests  Radio Free Europe/Radio Liberty",
    "published date": "Wed, 18 Feb 2026 18:14:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFA2MW4zcHpCOXl5b3cwLVRaYWVvWGNmNVIzMWU4ZGtVWER6aVpaR1pmdTM0NGd5SnF2UDYtZEJWd3lmMTdtaC0wWDdZNEloTW1sOXFaaWdtMllLZw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "Japanese PM Takaichi's cabinet resigns - China Daily",
    "description": "Japanese PM Takaichi's cabinet resigns  China DailyOpinion: After a stunning election, Japan will be unleashed. Or is it already too late?  The Globe and MailTakaichi, reelected as Japan's leader, wants to cooperate with US in rare earths development  Toronto StarPolitics  The EconomistBloomberg Daybreak Asia: Japan's Takaichi Formally Reappointed  Bloomberg.com",
    "published date": "Wed, 18 Feb 2026 00:48:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE51aVdhdzFnZzYzQkhqcnppV1BvSXJnSzJxTE1HOEY3SHlzZE55Y08yRVdDbjBWVm1yNmxabW9aV3g0b0ptMzdYZVFjdFFZZWdWSEVaLU1IcnpFR1VqZEF4ajRMRHVhVGhxUFZ4NVUzUXA3cGZrd0pjbnQwSzF2QQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.chinadaily.com.cn",
      "title": "China Daily"
    }
  },
  {
    "title": "Donald Trump’s envoys failed to reassure Europe - The Economist",
    "description": "Donald Trump’s envoys failed to reassure Europe  The EconomistSecretary of State Marco Rubio at the Munich Security Conference  U.S. Department of State (.gov)Forget Maga. Welcome to Mega: Make Empire Great Again | Mehdi Hasan  The GuardianOpinion | Western Civ Can Save Us — Again  The New York TimesMarco Rubio’s Impressive Speech  The Atlantic",
    "published date": "Tue, 17 Feb 2026 21:28:52 GMT",
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNc3ZsNW56VWpUZzZjSnZxUmsyT3MwaEhKR2JSZnpHYnNPUzJwUjR4NEhKVHMzam16WmwySXo2U0IxODdYVS1Lc3haUVNOT0ZGSTMxdEhfVmVnczBZT0RYWjMwT0VFQkpwVmNOZXZyMkt5U1BMM0swamJVRjlzcy1FV0hPU2NwcnpDdVNIWW9SSHlTbFJZOVVVRGkteEI4dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.economist.com",
      "title": "The Economist"
    }
  },
  {
    "title": "Thanks to Trump’s threats, tourism in Greenland is booming - The Globe and Mail",
    "description": "Thanks to Trump’s threats, tourism in Greenland is booming  The Globe and MailMorning Update: Trump gives Greenland a tourism boost  The Globe and Mail",
    "published date": "Wed, 18 Feb 2026 11:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcWItRDl1a0QyWE1fa09YZ0lPRmtxT00xVW1PVkdaQXo3X2hHZGNWUXlORU5PS09rYXRkWWpGYVN1Q1QzaWFSTWhqZHZta0VoSGI3X1ZhalFfYWlVR0JIWEJ3TTVZODNfdGhBdlRtMjNRYTRuTWFwcEZ6OXEyUmZSaEVYNjlUakJDMEE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "U.S. environment agency sued over scrapping scientific rule behind climate protections - CBC",
    "description": "U.S. environment agency sued over scrapping scientific rule behind climate protections  CBCOpinion | Why the EPA’s emissions reversal is the responsible decision  The Washington PostTrump has done more than harm the government’s ability to fight global heating | Jamil Smith  The GuardianGlobe Climate: America vs. climate change  The Globe and MailWhy California could be the big winner as EPA abandons climate policy  Politico",
    "published date": "Wed, 18 Feb 2026 17:42:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFB6YXBPbVdGMUZtTk90SGtkbHc0QmtRWHZ4LVFFM1dhWTZWbEwwenFWdVU4cDZUUENrOXlObGdVVXpVc0wweWgtMFFhZ09pVnVuVDZnYlNIcWxrUzVpTm9UYnhGd0FOa1J4Ync?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Lunar New Year 2026 - Minecraft",
    "description": "Lunar New Year 2026  MinecraftYear of the fire horse - explained: the Chinese zodiac sign that’s all about intensity  The GuardianLunar New Year 2026: Here is how people ring in the Year of the Fire Horse  CNNLunar New Year prayers, robots and festivities usher in the Year of the Horse  CityNews MontrealDouble celebration: Chinese association marks 50 years in N.L. with help of Lunar New Year festivities  Radio-Canada",
    "published date": "Tue, 17 Feb 2026 21:16:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9HZG84X3V1RGpsWFdobE0tWnFVSU42TWZPbUxDeFltc1J0YmMzX1ppUkdaUHo2TEthVXZORHZ5S3UzaERSem9ORWFYcWVuUnBrZHk5NFBnYnM3NkJVdmNZUWg1b3JJQmx6Q1VV?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.minecraft.net",
      "title": "Minecraft"
    }
  },
  {
    "title": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game - Yahoo News Canada",
    "description": "R.I. Shooting Victims Identified as Suspect's Ex-Wife and College-Age Son, Killed While Watching Brother's Hockey Game  Yahoo News CanadaSuspect in Rhode Island ice hockey shooting killed ex-wife and son  BBCFamily speaks of 'profound pain' after trans dad guns down ex-wife, son at high school hockey game  Fox NewsPawtucket shooter’s gender identity tied to past family disputes, court records show  WPRI.comShooter killed ex-wife and a son in Rhode Island ice rink attack, police say  CTV News",
    "published date": "Wed, 18 Feb 2026 15:58:31 GMT",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQcERKZzVlbEJFRURFcHRGTmpfV2l3VG1DQzZDeUdqSkFvMlVfOXgzcFRmNC1SbWZETkI3cVdCMnA3TkFnQ0J1dzNad3Jla2RyV1BiZTdOTTdCNlY1cXpITGhkcGFBUnNCWGFTX1R2c1U3c2lvZWh0aHNaVHFheldJNXE1Y3gxdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://ca.news.yahoo.com",
      "title": "Yahoo News Canada"
    }
  },
  {
    "title": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find - Gizmodo",
    "description": "X’s Algorithm Pushes Users to Lean More Conservative, Researchers Find  GizmodoThe political effects of X’s feed algorithm  NatureX’s ‘For You’ Feed Could Be Making Users More Conservative, Study Suggests  Forbes",
    "published date": "Wed, 18 Feb 2026 16:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNOV9JbTdROS1RWjR4Wm5ESkpIUGFXeDJOeU1yOTJMVEt1ZVRMRGNlLWlXNFlUeWJ0aG8tajdUS010QTg3WHlBeFFSdnNlaW1FZEZDNV9DSkFQRi1mQ1ZIRnVDakl5M3Roc1AySlJUVk5tWWg5ODR6dTF1VUhXLTdLTnlINTUzU3RrLTRwVVJ6cU5VNVRBVEs1dEEtaTh6R2V3MkQ2cG9iNlRwUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://gizmodo.com",
      "title": "Gizmodo"
    }
  },
  {
    "title": "Trump’s rationale is still opaque as he slides closer to war with Iran - CNN",
    "description": "Trump’s rationale is still opaque as he slides closer to war with Iran  CNNWhite House presses Iran to make deal, while ramping up military presence  BBCTrump meets with top Iran advisers as war threat grows  AxiosU.S. says Tehran would be ‘very wise’ to make a deal as Russia, Iran hold naval drills  CNBCTrump has discussed timeline for Iran strikes — including as soon as this weekend — but no decision yet  CBS News",
    "published date": "Thu, 19 Feb 2026 05:00:33 GMT",
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPQ09uRk9QeG81cllXdlp5NU44X3RjYno0Qnh3bVpjQk5PQTV4cDFrZXNYQXlESERxSGpTUUxhbFNQUWFUQ1MwczBJQXY5NXFXVExieEJNdk5YRHBCZVZJUnBZdHlVdFZBajROSUc0V0lmc2JtbEdWNTRSQ0x6am82OFd1S1M3Q2E3bm9YZ1RaZTdmVzktMTYzYkQya3JxaDg?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "From foreheads to crowns: How Ash Wednesday looks different worldwide - OSV News",
    "description": "From foreheads to crowns: How Ash Wednesday looks different worldwide  OSV NewsChristians mark Ash Wednesday, beginning the Lenten Season in photos  CityNews HalifaxLent 2026  History.comAsh Wednesday: Millions mark start of Lent in the Philippines  Yahoo News CanadaAsh Wednesday marks the start of Lent, a period of fasting, reflection — and fish fries  Toronto Star",
    "published date": "Tue, 17 Feb 2026 20:29:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPc2ItNFJnY0YyYnpHZlU0WlZiS3VJVlUwazhrMmp5eWJDTUtlOFpSakJnVXhNNWk3eUNwdEdQSlpNT3dpV3BXNm94dk1VNmNFSzVOZklsZnVOdWQ0d1dnQld0TDBUazVXYVVzb0w0ZExRbjhOMnVKTTd5VlBXcmgzQnJ3SllIU1hpVGtUMTVJSm9hUzkwZDY0ZQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.osvnews.com",
      "title": "OSV News"
    }
  },
  {
    "title": "Iran and Russia to Hold Joint Navy Drills as U.S. Pressures Tehran on Nuclear Program - The Moscow Times",
    "description": "Iran and Russia to Hold Joint Navy Drills as U.S. Pressures Tehran on Nuclear Program  The Moscow TimesUS renews threat of military action as Iran, Russia announce naval drills  Al JazeeraIran partially closes Strait of Hormuz, a vital oil choke point, as Tehran holds talks with U.S.  CNBCU.S., Iran to hold more nuclear talks as Tehran closes Strait of Hormuz  Global NewsRussian Mi-28s And Su-35s Won’t Revitalize Iran’s Dilapidated Military  Forbes",
    "published date": "Wed, 18 Feb 2026 15:52:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNM0xBdGVER01PODZEbGZGaGZFblZwbl9BNEZjSnN3bzFEWVdWOGJmYjA4RnVyZzBQUVVUcHh3ZG56X2pLbkpVYUlQZmIxTlNJVnRnSmt2N1V3eFBmcU93aXVhNlRiOUg3WTVJd0V3OHQ0a3lIbkpHcEtvYWtURDhvVXhWYm53U1pXV0NQRE41YmswamEtS1l2R1FtWEViNERmTE1FT2I1bmxjd2ZIaE5Yb0xQMFE5T0FGMnQzSTV6LXo4ZklQNXZwZGdUdEo?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.themoscowtimes.com",
      "title": "The Moscow Times"
    }
  },
  {
    "title": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply - Associated Press News",
    "description": "Hungary will suspend diesel shipments to Ukraine over interruption to Russian oil supply  Associated Press NewsView Full Coverage on Google News",
    "published date": "Wed, 18 Feb 2026 16:58:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNc2RlNnN2OUdHcmhzVzVPLTU3M0pHVmJGU0V6dXgxaXhJOFc0dUdrQVFKc0tTVGZtNGQzUEY3R2Z5Uk9xS0ZJVU1zSlhQS05TaV9hbUdjLUVTTXJnT2tab2xpdWpac1REbW9XWHhYaHVGVHRvSlNhWGRCeU5MV3Y2bEo1T3MzOEJuclJpS1lvWmFnYVlldkhpbDZNamhhNUJJckhmSmxSV0FGV2JSYzMzTVNPMDBUWm8?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://apnews.com",
      "title": "Associated Press News"
    }
  },
  {
    "title": "GTA fire services seeing rise in lithium-ion battery fires - CP24",
    "description": "GTA fire services seeing rise in lithium-ion battery fires  CP24Safety tips on lithium battery fires from the Swift Current Fire Department  SwiftCurrentOnline",
    "published date": "Wed, 18 Feb 2026 10:03:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOYURub3J2M3FIekc1d0JWblAxZ0VnbWFzekNDbWtwcDV1ZTdGNmRHdjZhOUdPUHlLdGl6UDhwajRpTFNpREVKVEpPeGdMdlpxbDhlZHhYTDk4LTU4NzMxRnRVYUt3UWZlNE10bEFzZWVrMXpnUDNaVkRGem5nejhWNkVackV4dGFUdWNrQ1MzNlA3THQ2LVYtZkFPMFlzQlR1d0NEenJkako?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cp24.com",
      "title": "CP24"
    }
  },
  {
    "title": "Russian cucumbers become symbol of rising wartime prices - The Globe and Mail",
    "description": "Russian cucumbers become symbol of rising wartime prices  The Globe and MailFood prices are surging in Russia. Is the war hitting Russians in the pocket?  BBC",
    "published date": "Tue, 17 Feb 2026 21:00:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPM2R2bHRBdHJBVFVoSEV6S19ESmxRZW1kX0xNS2VBeVdTWDlnZWtVWnRBOWI2YW5tRlZpUHpiZkYzSXV4TU55QUozVEtkLW9qNVVrVXdTUmdyVlJzSFFzT1puSzJsN25QS0pJSkRKMjNKbHdpa3lDc00tNlh4T21jdW5ndTBRZWN0cEE5UUhB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.theglobeandmail.com",
      "title": "The Globe and Mail"
    }
  },
  {
    "title": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West? - The Kyiv Independent",
    "description": "What does Navalny’s murder confirmation mean for Russia, Ukraine and the West?  The Kyiv IndependentNavalny's mother says she always knew he was murdered after poison finding  BBCRussians mourn Alexei Navalny’s death on 2nd anniversary: ‘He was murdered’  Global NewsWhy Russia may have turned to dart‑frog toxin epibatidine to poison Navalny  France 24Why did Russia kill Navalny with a lethal frog toxin? Chemical weapons expert Marc-Michael Blum believes the Kremlin never intended to get caught.  Meduza",
    "published date": "Wed, 18 Feb 2026 18:55:43 GMT",
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPaFhNZWNiWEpvUGxGWEJlZTBqc3B1XzI5dF8zUWkwZ2NrYkkxWm5lSVhtTDktRFBxZF9ZZUsyQ3kybnIzdHZlZ2xkazVtUkc0T1NXUGZRT2hoZS1mX3pVX1lZcXlCZ09jRE9pTHVHOVduZUU3QW5HelFmVHdzNzljSUt2bURrcWZCMzBTMzFpNW1KZFhzNkR3dmYxeWRQbXI2X0c2aXl3aw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Could Witkoff be ousted from Ukraine talks? Senators hear 'chatter' of Russian deals - The Kyiv Independent",
    "description": "Could Witkoff be ousted from Ukraine talks? Senators hear 'chatter' of Russian deals  The Kyiv Independent",
    "published date": "Wed, 18 Feb 2026 21:06:39 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBTVlVmU0g4bkRWcl9VRV93LTk4QXdpc3VYc0hYd04tNnhRLUtRNnl2WUppMU1lVTlPREJLdHlTWXlNVW5QUHV0VkJ0bHVzLS1QbWxkTnhQMDdoNmx3SzJCWkZ4MlNDM1VUVTRIUUNZcTdYVHp5Q2kyN3BTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "12 killed in China’s second deadly Lunar New Year fireworks explosion - South China Morning Post",
    "description": "12 killed in China’s second deadly Lunar New Year fireworks explosion  South China Morning PostChina fireworks shop explosion kills 12 people amid Lunar New Year celebrations  CBCTwelve killed in China fireworks shop blast during Lunar New Year  Al JazeeraTwelve killed in China as firecracker store explosion triggers blaze  NBC NewsA fireworks ship explosion in China kills 12 people in the second such blast in days  CityNews Halifax",
    "published date": "Wed, 18 Feb 2026 12:15:02 GMT",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPTGJuV0JfYUZwLVhJRmJkZk1OeVNWTzVfTl9fSklMTkJ4cmJZMk8wdXpOa2dvdnpObWt3V2hjd01FaTZYak5fcFhIV0N2LWR0VUdueFI1M2N0d0hULWE2OERhNkFIZ24xUjBKMHpLYm5rSXFUUU9CdzY5dHlPQThsQnc2UDMyTzlpSTRDTjRaSHdlQldZYnB3Wm53eld1R01NZlZCRklrREhrUWtsWERXWXktVm5FaGxsNjVBcDNR0gG-AUFVX3lxTE5XLTJwQlM1S000bnE3ckE0bWhsMWJtY3JGZVplV2pDaHp3UzVxLVZnOTdYLXdFcUR5aTQxOWRFdGg4V19JUUxzazIyQ0tXOW5CbDlWZzlxcGI0azhuY0FTdVR1TTRhSkVEQ2N1YktGMWFkYXpTdXdueWlacjBYUGVkZnc5ZHVsb3R1ZVpkZ1YxRmNXMDRnRnBnLWJqUlhYS2pwbkFvUXZoM0tXblZUSWdPTzdVRnFLemZscmxSeUE?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.scmp.com",
      "title": "South China Morning Post"
    }
  },
  {
    "title": "French activist's killing leads to political furor, 11 arrests and a bomb threat - CBC",
    "description": "French activist's killing leads to political furor, 11 arrests and a bomb threat  CBCWave of arrests over killing of French nationalist piles pressure on far left  BBCParliamentary aide among 11 arrested over killing of French far-right activist  The GuardianPolice arrest 11 in the beating death of a far-right student in France  CTV NewsAfter Activist’s Killing, Tensions Erupt Between France’s Far-Right and Far-Left  The New York Times",
    "published date": "Wed, 18 Feb 2026 17:12:23 GMT",
    "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFB4dG9vdk5EZmxNWHJXQl85VUhjdGphbmFqOXBzN3llc1g1NzFqdG1uYm5HakFqRzc1djhmOFY1cW5pYW5tYVhQTVVxSzNFWGhscnIxSTF1UWFWTXlhMXJkWUlDZTdaLUpUY2x0SGhtTGpma0dYVXhXSi1ZUQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club - politico.eu",
    "description": "Carney offers to ‘broker a bridge’ to build giant anti-Trump trade club  politico.euTerry Glavin: Carney, leader of an anti-Trump alliance that doesn't exist  National Post‘Canada can broker a bridge,’ Carney says on new trading bloc efforts - National  Global NewsOpinion: How Canada and allies can stand up to Trump and other great-power bullies  The Globe and MailCarney constructs a mega anti-Trump trade alliance  politico.eu",
    "published date": "Wed, 18 Feb 2026 11:21:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNR0JIVGozbnRVUkxrakN6TUlMWEVZQTJqYnJPb01xdUlFdnZzbnRRaGJGNWtaRkNkZHhUYnhJbzFBN3h3SWJBM0FTRHAwdnZtLU55a1ctQV81eG4ydUNLVXZBZ0lBZ3M5ZEdlX3NNLUdpOW9MTXBoOXdWYVZLcFBGUA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "People Turn to Poison Quick - Counterpunch",
    "description": "People Turn to Poison Quick  CounterpunchJim Ratcliffe’s shameless comments signal soccer’s turn toward total Trumpism | Leander Schaerlaeckens  The GuardianManchester United: Sir Jim Ratcliffe immigration fallout analysed  BBCJim Ratcliffe is wrong. Idle Britons are the problem, not immigrants  The TelegraphTrump, Musk and now UK billionaire Jim Ratcliffe – they are the enablers, making racists feel great again  The Guardian",
    "published date": "Wed, 18 Feb 2026 07:00:41 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBFRnZoZ3VpckJZc29HSG9kYlNxWmNTMlZ2T1pSMHRvLWt4aUtiZnZUbl9Bc2VUOGRSbWwwN0x4aTIwUjFPSV9hTlgxajdjQmFPLTFicHJ1OUhYYWlvOWE4VWV4SVZadzhOd1NHZ2Z4VGZzQXI3TWNr?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.counterpunch.org",
      "title": "Counterpunch"
    }
  },
  {
    "title": "Eleven killed in multiple strikes on alleged drug boats, US military says - BBC",
    "description": "Eleven killed in multiple strikes on alleged drug boats, US military says  BBCFishermen in the eastern Caribbean fear for their lives following a deadly US strike  Toronto StarU.S. military strikes three more alleged drug boats, killing 11 people  The Globe and MailUS military says it killed 11 people in strikes on three alleged drug boats  CNNU.S. Kills 11 in Boat Strikes in Pacific and Caribbean  The New York Times",
    "published date": "Tue, 17 Feb 2026 17:33:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE40V3dzRmU2UjRXa1dRNzlXQS1uamJ1eFRneHY3UFpOLVg2cU9QLTNpSXNHM0VON1RBa2lncUQySEhVZEM3ODJhLUNUR2lpUXdReXRiOUdRYWE0dw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  },
  {
    "title": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam - CNN",
    "description": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam  CNNDOJ accused of flouting law in Epstein name dump  The HillThe Epstein files have brought a wave of resignations and investigations  The Washington PostFallout from Epstein files in Europe affects royalty, politicians and diplomats  The Globe and MailBondi criticised after saying all Epstein files have been released  BBC",
    "published date": "Wed, 18 Feb 2026 11:30:46 GMT",
    "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE9vZC10WFVhcGhfOTIwb0NmS0w1WHJoOUlYdE8tb2gzRkFLUk90Z3R4MUpsU29WUzgzRnh2NEwzU0dfMFNFdFFNYzg0eFdRSVJVYmJNNGNHMlZDdjgtWTBvYW90ajhHR0pEcEFPUGpLTXF3Zw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it - CNBC",
    "description": "Trump family says U.S. dollar needs an upgrade, and they are the ones to do it  CNBCThe Digital Retribution: Trump Brothers Vow to Overhaul “Outdated” Dollar with World Liberty Financial  South Florida Reporter",
    "published date": "Wed, 18 Feb 2026 23:04:36 GMT",
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNdUhZZEZEa3pLd05ia3Fxa1BkR3gxdjJ4VjVOamd3RENiN2I1NTVDbkxCbEd6amVJeXVNSkNzTlJ0N29yNWpsLWF3YlRUZ1k0eTBfcnJ1OW5iaFlhOHZMV05CajJEY0piUTRDeER3WFlOVWFtYXV1aEQzN19reTVWbjNNaXFpcUJJcW1uQlJwOWMwNlYwcGctN9IBngFBVV95cUxNcnFVVGMydDRnRXFEaTlYaEx2U2R0cW9LdWlQdlI3UE9vMVdDT0EzQUNlbkp3WmxGdXFLT3BwZHdoRkc0MUg4em4wVTJqdGV6U0Exd1ZLYkplTHNqS2hVNEp3elJQZXVZNmwwcncwdkF5WTBDOGdwb18yRWpZVDU0WkI4MG0zRjVWVDNJdzdjck9zWDdqZ1ZDOFduanpPQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnbc.com",
      "title": "CNBC"
    }
  },
  {
    "title": "Kilmar Abrego Garcia can’t be re-detained by immigration authorities, federal judge rules - CNN",
    "description": "Kilmar Abrego Garcia can’t be re-detained by immigration authorities, federal judge rules  CNNKilmar Abrego Garcia cannot be re-detained, federal judge rules  Global NewsFrom deportation to court, key events in Kilmar Abrego Garcia's fight with the Trump administration  Toronto StarUS judge says wrongfully deported Kilmar Abrego Garcia can’t be re-detained  Al JazeeraJudge orders migrant deported in 'error' free from ICE custody with criminal case looming  Fox News",
    "published date": "Tue, 17 Feb 2026 18:02:59 GMT",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOZDJBN2FZU3EwLVVWSVkyVk81dWkxNng0TFBJcHFrZXNWMlFvN1JDY0dQNXJnNUFkNXQ3OWxVUV9fc3JvS3Q4bUNDdi1LYzVEWlJFdjl1cm9aclVJclFvVEVYU291Um9pTW05VXpRWWxpQVpILTNCVVQ3eVdjNkc2REln?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cnn.com",
      "title": "CNN"
    }
  },
  {
    "title": "Ranked: China’s Largest Trading Partners in 2025 - Visual Capitalist",
    "description": "Ranked: China’s Largest Trading Partners in 2025  Visual CapitalistHow China plans to dominate global trade long after Trump  Reuters",
    "published date": "Wed, 18 Feb 2026 15:16:56 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFA2ZnR5N2NQVWhrRHJFSEhUVFZnOUo5RTNSMXJmTkV4NUxYdElZNWtkcm5ja2pmTDZxamxjV1NLaTdjY1pJMkVVV2xzSnFSWG5LV1oyTm96OVZwY2RYUk8xbk5WTUcxOEtVV1huNERnUGZLWEtQNFpKSjlUUXZhQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.visualcapitalist.com",
      "title": "Visual Capitalist"
    }
  },
  {
    "title": "BBC to argue Trump failed to show he was defamed in documentary - Reuters",
    "description": "BBC to argue Trump failed to show he was defamed in documentary  ReutersBBC reveals how it will fight Trump’s $10bn lawsuit  The TimesBBC argues Trump failed to prove defamation  The TelegraphTrump’s defamation lawsuit against the BBC is set to go to trial in 2027, US judge says  Toronto StarTrump case against BBC to go to trial in February 2027  BBC",
    "published date": "Wed, 18 Feb 2026 17:56:51 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPalI5WENHbFBHU0FtRDlzV0xJZ2E5azlnWWVJWjZSWjdQVzU2MHdoakR6Q0p0UUlBUXp4a2JtaGsxNjVEdUhsNGF4ZFR2d0RtRlJudW93eGNPUW5IaFF6VXhkbzZqZXNQVU1RQzhoSWw3R2tTMjVjVlZGV1k5TXl2WVY2dmt1ajJmc1VPYXUwUmR4QlJWS3J2dTFJdkZsT1NKRzdXaC13dnVJa3c?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Canada issues urgent travel advisory update for the Philippines - Daily Hive Vancouver",
    "description": "Canada issues urgent travel advisory update for the Philippines  Daily Hive Vancouver",
    "published date": "Tue, 17 Feb 2026 17:45:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQV2ZEaVhRSnduQVAwWWg1SDNiQ21XOEVOdExTcThxQmQyUDhpUk5ncVBNS1pGczR2YURSZFZ4UU54UVpsMy1qVG1DM2hTVzhibGxEbFFXd3lIX3VMSEVuYk84ZDA5eEs1VTAyWVcxRmI1TlFINXFaOXJRLWU2dFdyWA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://dailyhive.com",
      "title": "Daily Hive Vancouver"
    }
  },
  {
    "title": "‘My daughter was supposed to bury me’: Manitoba father devastated after slaying - Winnipeg Free Press",
    "description": "‘My daughter was supposed to bury me’: Manitoba father devastated after slaying  Winnipeg Free PressMinnesota Governor Candidate’s 22-Year-Old Daughter Fatally Stabbed By Husband  BeliefnetWoman's 'safety plan' found in St. Cloud apartment after stabbing  St. Cloud Times",
    "published date": "Wed, 18 Feb 2026 01:22:03 GMT",
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPWHUzek5ubFFiVWJMdTlXX1lXLTRUdnRCZnZhSnpTRHM2LUFzOUZpNnRIcDNNOVhOZW1jX0ZFdXJFQkFHYUdLaTkzbzNraTBXaURmM0kxcWVKRXFmVHV4MFRUV1lXQ1hwNVJLSkl2Umw0TlpfM0pwam5ZQWZ6YzNNTTBWdGJFaFZTeERuNnB6Qmh5d0M2cHVIcThMOWIwajFob3ctM3I2NW5NTkd2UHp5aFUtMW5CeWkzc0Uzai16WFg2U0U?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.winnipegfreepress.com",
      "title": "Winnipeg Free Press"
    }
  },
  {
    "title": "Trump family wants to own trademark if airports use president’s name - National - Global News",
    "description": "Trump family wants to own trademark if airports use president’s name - National  Global NewsTrump Organization trademark raises suspicions that family could profit from Florida airport name change  CNNDonald J. Trump International Airport? The President’s Company Trademarked It.  The New York TimesTrump trademarks his name ahead of Palm Beach airport renaming  USA TodayTrump Pre-Emptively Files Trademark For Airports Not Yet Named For Him  Forbes",
    "published date": "Tue, 17 Feb 2026 18:15:29 GMT",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1WMmhjVU1XUFB1ek45TWE0M0pUckphMy1hU1RieGZTQV9BVkJIbzJmSnRiUHJ1UlRhbjNjcjJQcTljSmtUOHZDcEVNeFpJaEQtMFVReWl5aEt5V1JYWUUwVDVIYzRlTDl3RE9POTNUUmhFLTZWdHNJ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://globalnews.ca",
      "title": "Global News"
    }
  },
  {
    "title": "Ukraine reportedly strikes oil depot in Russia's Pskov Oblast, targets Belgorod with missiles, leaving blackouts - The Kyiv Independent",
    "description": "Ukraine reportedly strikes oil depot in Russia's Pskov Oblast, targets Belgorod with missiles, leaving blackouts  The Kyiv IndependentUkrainian drone damages Russian Black Sea port ahead of U.S.-brokered peace talks  CBCEuropean Coal Futures Extend Gain After Strike on Russian Port  Bloomberg.comUkrainian Drones Strike Oil Depot in Pskov Region, Fire Erupts  МілітарнийUkrainian drones attacked north Russian oil hub Ukhta  The Barents Observer",
    "published date": "Thu, 19 Feb 2026 10:38:15 GMT",
    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOYThwZms3VnV1NEktTnZtOFY4T2w3eGFGRTNuYXdxV3l2dEM0ZEQ1YWx6bnNfclpKZHRFemJ6clB6SGlpdTJlLVNvQ21jSHFOSnBIcHJTTWg4eFZDWTl2YVpXb1ZoU0JpQTlKNERINEJDQXpIVl9tUXVxcVMwcjBURWd0OG5fSHU4XzVjSi05TS1fN2ZsOWtFTl9lOW1XOFFUOVpqYlA2WWhET1lYQ0JYWEdBdnpjTkVX?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://kyivindependent.com",
      "title": "The Kyiv Independent"
    }
  },
  {
    "title": "Wreck of 19th-century luxury steamer found in Lake Michigan - CBC",
    "description": "Wreck of 19th-century luxury steamer found in Lake Michigan  CBCShipwreck Found at the Bottom of Lake Michigan After Nearly 150 Years  The New York TimesThis Luxury Steamer Disappeared on a Stormy Night in 1872. Nearly 150 Years to the Day, It Was Found at the Bottom of Lake Michigan  Smithsonian MagazineSearchers find wreck of luxury steamer lost in Lake Michigan more than 150 years ago  CTV News150-year-old mystery solved: Wreck of 19th-century luxury steamer found in Lake Michigan  CBC",
    "published date": "Wed, 18 Feb 2026 23:18:06 GMT",
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOM2xDbzhpb3V3UXdGM0xaQnlJTHlLbkVabWlXNlcwWjh4UlRZM2J0VFFWZWRVeWZfR0FRSmVMamxnX3c3bFgyX2hHSzlkZG1rVDA1bzlIRG03T1ZRNUx2bE5vSUl4V2YtYmtrTHVHSVZaZ1hISHAyQU5rYUFzalljT1BPODFPUFVYbzJNQ1dqdkZReDZrT3F2VkxmVUlxV1UyVHBSbjhOLXlTdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.cbc.ca",
      "title": "CBC"
    }
  },
  {
    "title": "See the moon's shadow darken Antarctica in epic satellite imagery of the Feb. 17 solar eclipse (video) - Space",
    "description": "See the moon's shadow darken Antarctica in epic satellite imagery of the Feb. 17 solar eclipse (video)  SpaceYou’ll have to wait more than a decade to catch the next solar eclipse over Canada  CP24Your horoscope for the week ahead: Magnificent changes are on the way as the first eclipse of 2026 arrives  CBC‘Ring of fire’ solar eclipse: February 2026 path, visibility over Antarctica and partial eclipse for South Africa  CNNHow the New Moon will influence your sign in February 2026  Vogue Australia",
    "published date": "Wed, 18 Feb 2026 19:18:37 GMT",
    "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxNWnRBcDZScTJXOVdqbncxY082cnN6eXdhNnRKamJWdzZ1TURXOThCRFVXb3JmM1AzbWdrMXk2d05GU1h2MzctOWI2X2NWb1RyZnJFa0hlQ2pjRER6OHAyWDR1c05DeUptRGRjV2hxS19DYUR6aU5jdGs3NGVGTmFFeWdCRGJuMDNpWFlyMFVzRDg3QW1ObVBnWVB2MXhPSUlGY3pLOTlrS20tSFd5S1lDa0hRZTl3RG1mSklvdEhtX0ZXX05sWnlJTDhTRUlKaF8tclhtejhRbTNDR0hsd2E4?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.space.com",
      "title": "Space"
    }
  },
  {
    "title": "Beyond Zionism: After Gaza, the American Jewish Left Rethinks Jewish Identity - Haaretz",
    "description": "Beyond Zionism: After Gaza, the American Jewish Left Rethinks Jewish Identity  HaaretzHow pandering to anti-Zionist Jews harms US Jewry  The Jerusalem Post",
    "published date": "Tue, 17 Feb 2026 22:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxNNGxBN0I4Q1R6RVVWMFl5YzZROHVaeDhEZmZkSkF3R0E3Nkw4amh2WXBRSTl0VXV4bHFfRXNlUEFVOU9zOW1YSUZkSUkwSC1XQTBjc3FJWE5YSkVTYkFJSXdPU0tsWG5iQ3hiSGZaZHZMRy1VOFpjeGFfcHNqVnd1MGMzWFkxOXpuQktQaUlUWWVrWVU4VjdzMHdFck5LcmZqVGNlNWFla0RsSjNTc1B1Y1JDQ0RBR0xSMjJ4Zi0zODNiVF8wSTU2cER1cGZqNDVrb3BnMTJxNnVsZk5rRGMwd0RTZzQxV3pwY2Y1azFleEhyZmhNVTNrRmlUTHRUSE40SHZRWm1hV1R2S3FYejdmYQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.haaretz.com",
      "title": "Haaretz"
    }
  },
  {
    "title": "Putin Presses NATO to Lock in Promise It Won’t Expand East - Kyiv Post",
    "description": "Putin Presses NATO to Lock in Promise It Won’t Expand East  Kyiv PostRussia demands formal NATO-guarantees, including nullifying 2008-decision  Dagens.comSenior Russian official says Moscow needs 'security guarantees'  The Kyiv Independent",
    "published date": "Wed, 18 Feb 2026 13:31:13 GMT",
    "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE1oOVNOYWVCQ2U5NVNhb1YzaXF5WVFxNWVWMjQ0X1JHdVBDLVR0VHBWX09GcURZZ3hXVzdzUmhtSDh2dHNsS3ZXSEs2MA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.kyivpost.com",
      "title": "Kyiv Post"
    }
  },
  {
    "title": "Europe loses hold on American tourists, woos Chinese, Indian travellers - Reuters",
    "description": "Europe loses hold on American tourists, woos Chinese, Indian travellers  ReutersEurope loses hold on American tourists, woos Chinese, Indian travellers, survey shows  Yahoo! Finance Canada",
    "published date": "Tue, 17 Feb 2026 23:03:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNQkxYLXdtMlFVcGpOUV9aOTRQUVFGdUtCZEhnZ3M1a2JMbWUwaHMxWlRnRlBkVV9NMHdkSUI3VjJTa0J3c250cGlad1lXSU12X3lBN0pKYjFVeE1odXB4ZzllQ1V1bTlJak5mc3J2N2lhWENBbWgtcW9QekJObVl4WEg1QWpQTS15alM0elUta3NRa1JNVHRiTS1WUTd2dms1THlNRy1zOFdlR0VudVBwZGNnc2U4RUEtVDRleWdFOXp4LTYxcmc?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.reuters.com",
      "title": "Reuters"
    }
  },
  {
    "title": "Merz wants to be Europe’s Carney - politico.eu",
    "description": "Merz wants to be Europe’s Carney  politico.eu",
    "published date": "Wed, 18 Feb 2026 03:00:00 GMT",
    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQV2dBWnQwekswQUNCMElfSlNqVVo2ZUVOYWFaN2pqOXVCQ1dxQ1ZXcm82bi1nRnV6Y0stUlJfMnQwUExvOHJSY09ib05MZm1CYUpnb1NnTVZ2OGMxdU9la3hialJWa3pzSnhfSV94ay14YnU2RmdjLVoxZldwV25rb00wSVROWnlpb0YwUUUxMA?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.politico.eu",
      "title": "politico.eu"
    }
  },
  {
    "title": "Mexico declines Trump’s invitation to join Board of Peace: Tuesday’s mañanera recapped - Mexico News Daily",
    "description": "Mexico declines Trump’s invitation to join Board of Peace: Tuesday’s mañanera recapped  Mexico News Daily",
    "published date": "Wed, 18 Feb 2026 00:04:47 GMT",
    "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOZUk5bUhjMXIwS2k0aTN4S0N0ZV9HY3M1R1A1cDB6b1RLa3RuZGNXbm1ONEhaRXc2ZjhYV2VFQkVxaF9kNWc1RWNWY3I2V09NcENMQ2lKTnVFRUNmdlA4UE9YOFoyd0pKVG44ejVHNWNyQmNyYThtdlhmM1hsVDI2N2NQeER5Qms0WWhVMGhUeVBMck1QZi04S3pGZktCUFFwVnFmWjdB?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://mexiconewsdaily.com",
      "title": "Mexico News Daily"
    }
  },
  {
    "title": "PEN America’s Jewish Exception - Tablet Magazine",
    "description": "PEN America’s Jewish Exception  Tablet Magazine",
    "published date": "Wed, 18 Feb 2026 02:57:28 GMT",
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNZzRrX3RCaEw1Y3MwRE16OHZFUUNsdzlXZDBxM0pOcWlEaHRaaUZMWnJiMlRzb2RtOC1HME1Vc1JVc3d0Q3lVcm1GVkZEdjZZQUc4bW1sUjhKb29iaFdHOXZzT0YwQW96bEVQdmlOWS1fMTJRaW1zSloxR05ZREdBUFFrNEZ3Z0VoZEE3U3h3?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.tabletmag.com",
      "title": "Tablet Magazine"
    }
  },
  {
    "title": "The 30 countries that spend the most on their militaries, ranked - Business Insider",
    "description": "The 30 countries that spend the most on their militaries, ranked  Business Insider",
    "published date": "Tue, 17 Feb 2026 13:37:01 GMT",
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9oY0JwNXd2R0lxRjJYcWZqTVRyUjhGME5BZ0tLN3dKd2FfVmpZVEIweW9kQjNFaGQ5MnRCMlZLRHptcWZsX0xvYTY3dlZnM2N4TUFBZDZpZDNBWmhQM1F2eXpnaUkwTGNTYkVuME8wNHZnaXlyVnpGSEVqYmlEdw?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.businessinsider.com",
      "title": "Business Insider"
    }
  },
  {
    "title": "Police assessing Stansted Airport private flights over Epstein ties - BBC",
    "description": "Police assessing Stansted Airport private flights over Epstein ties  BBCPM says 'nobody is above the law' over Andrew allegations  BBCUK police assess claims Epstein trafficked women on flights through London Stansted Airport  CNNPolice investigating claims that Epstein trafficked women through UK airports  The GuardianUK examining Epstein's use of airports for trafficking  Reuters",
    "published date": "Wed, 18 Feb 2026 10:30:17 GMT",
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE92bWY0eXdDZFFJbFBsQk81Ry1wRzlCbEszczd0WFdoNmNDWU9XcXNmRElmS2M0OW41U2hRcWJXMS1hRElIYVdLa051SEowd3U2ZXhGdHRDclBTQQ?oc=5&hl=en-US&gl=US&ceid=US:en",
    "publisher": {
      "href": "https://www.bbc.com",
      "title": "BBC"
    }
  }
]